[
    {
        "user_name": "shavedkitty69",
        "time": "4 November, 2021",
        "context": "no need to search elsewhere in space, the aliens are already here among us.\n-rep. marj taylor greene",
        "good": "1",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "rayj785",
        "time": "4 November, 2021",
        "context": "Liberals are the reason the aliens won't talk to us.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "letsgetrel",
        "time": "4 November, 2021",
        "context": "This is a worthwhile pursuit.\nIt is nice that we can finally comment on a science article.\nJulia Musto must open up her articles to comment or resign.",
        "good": "5",
        "bad": "2",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "thomaswinslow009",
        "time": "4 November, 2021",
        "context": "It is astonishing that the universe supports the development of life at all. If the force of gravity was just a slight bit stronger stars would not have existed. The same goes for the other major forces. It's almost as if the universe was tweaked so that life could evolve.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "beadgBass",
        "time": "4 November, 2021",
        "context": "Life is an amazing feat of nature. To find it elsewhere would be spectacular.",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rjenil",
        "time": "4 November, 2021",
        "context": "A much harder task would be to find intelligent life in the Democrat party.",
        "good": "10",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "suomynona",
        "time": "4 November, 2021",
        "context": "Why waste time looking through telescopes. They can get a view of truly extraterrestrial life forms on Google Street view of 1600 Pennsylvania Ave. Washington D.C.",
        "good": "5",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "teeeceee",
        "time": "4 November, 2021",
        "context": "What's not being mentioned is that life on these other worlds has probably been looking for intelligent life on our planet... but hasn't found any.",
        "good": "8",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "doctornumber10",
        "time": "5 November, 2021",
        "context": "Let's not find life on other planets right now.  Joe would start inviting them here and handing out taxpayer money to them.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jpnightrain",
        "time": "5 November, 2021",
        "context": "Two words:  Fermi Paradox.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "chrysgriffing",
        "time": "4 November, 2021",
        "context": "this should NEVER be a matter of \"DIVERSITY\". It should solely be a matter of who is most qualified. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "solace7",
        "time": "5 November, 2021",
        "context": "The report suggests that political factors such as gender balance and racial balance be considered in awarding research grants.  Never mind the science.  So we fund based on identity policy rather than science.  Extraterrestrials might have a hard time finding intelligent life on earth.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Chingon636",
        "time": "5 November, 2021",
        "context": "They need to search for life on Earth first, then look elsewhere. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Ironic",
        "time": "5 November, 2021",
        "context": "Anyone observing our planet would determine that there is life.   Once they get the lyrics from WAP, they would determine that it's not intelligent life.",
        "good": "13",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "goa✟lips",
        "time": "5 November, 2021",
        "context": "Where is God hiding? Maybe He got pulled into a black hole?",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "𝓑𝓵𝓾𝓮𝓶𝓾𝓽𝓽",
        "time": "5 November, 2021",
        "context": "It's been in the media that it's a very strong possibility that UFO's do exist....The sightings started after Earth saw the atomic bombing of Japan.  It's obvious that other 'beings' could be watching the Earth's  progression both towards nuclear and space travel.......It is also possible that because of enormous distances between 'worlds' these UFO's could be robotic...After all we do send robots to Mars for exploration purposes....",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "strandedinthecenter",
        "time": "5 November, 2021",
        "context": "We need to find out if there is intelligent life anywhere in the galaxy.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "neonpops",
        "time": "5 November, 2021",
        "context": "There’s a lot of interesting stuff happening in the science world that’s not being reported anymore, politics have overtaken everything. Not too many scientists even here in the science section. Would we fight more over God should we find we’re not alone? Or would it unite us even closer than we already are?",
        "good": "3",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "goa✟lips",
        "time": "5 November, 2021",
        "context": "Highlights of the big bang that were missed by the goat-herders that wrote the bible:\n\nPlank Epoch\nGrand Unification Epoch\nInflationary Epoch\nElectroweak Epoch\nQuark Epoch\nHadron Epoch\nLepton Epoch\nNucleosynthesis\nRadiation Domination\nRecombination/Decoupling\nThe Dark Era (photons exist but still no visible light)\nReionization Era\nGalaxy formation (no mention of galaxies)\nSolar System formation (forgot to talk about planets)\n\nSide note: light did not exist until 377,000 years after the big bang because the quark soup was too dense to permit it.",
        "good": "1",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "Bigrefund",
        "time": "5 November, 2021",
        "context": "If intelligent life is discovered. I\nam willing to bet it won’t be a Democrat.",
        "good": "4",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "juliet7bravo",
        "time": "5 November, 2021",
        "context": "Why do they assume ET is going to be all warm, fuzzy, and cuddly?  Cuz we sure aren't.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "OldVeteran910",
        "time": "5 November, 2021",
        "context": "What a waste. They can't even recognize life in a woman's womb.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "carl978",
        "time": "5 November, 2021",
        "context": "Just imagine what all that money could have done to help people on THIS planet!!! ",
        "good": "0",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "StaffHerb",
        "time": "5 November, 2021",
        "context": "Even if we find advanced life on another planet, we can't get there or communicate with them with our life time or even our children's children's lifetime so why spend all that money just to know?  Why not spend it on understanding our our planet and solar system better.  We could invest in space travel right here and make incredible discoveries and answer the laundry list of unknown questions that would allow us to tangible do something.  Instead, we'll spend billions to say \"well now we know\".",
        "good": "6",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "Edwdyr",
        "time": "5 November, 2021",
        "context": "how much do these so called scientists want to blow now",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "1pingyes2pingsno",
        "time": "5 November, 2021",
        "context": "They need to make a slight alteration to their agenda to first trying to determine whether ET life has already found us.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "Lakota53",
        "time": "5 November, 2021",
        "context": "The Enrico Fermi paradox gives a big data point that we are alone and ought to reconsider how to cherish life",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "nomos",
        "time": "5 November, 2021",
        "context": "What a monumental waste of time and, by and large, our money!",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "1ofakind841",
        "time": "4 November, 2021",
        "context": "First of all...I have always believed that God may have created other life in the universe but it is entirely possible that he did not.  I think God does things like that, like it's His signature, He can.  Secondly...sometimes there are subjects that naturally appeal to guys and not so much to girls.  They usually involve some heavy math or are an extremely nerdy type of subject.  Because they do not naturally draw girls to them does not mean we have a diversity problem that needs fixing.  Leave it alone!!!!  If girls wanted to do it, they would.  It's not a \"problem\".",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "triple555",
        "time": "5 November, 2021",
        "context": "The people doing this research need to be more diverse? Let's just have the smartest people in the field. And yes it is a ton of money.",
        "good": "7",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "justsayyesirandnosirandbeaman",
        "time": "5 November, 2021",
        "context": "The only real genius that ever lived, John Von Neumann said, “  There  probably is a God.  Many things are easier to explain if there is than if there isn’t “.   He is correct. God is real. And He is the  creator. If you want to know the origins of the universe , read the first few chapters of the Bible.   Yes it would be fantastic to know what else is beyond the stars.  But there was no Big Bang other than God speaking it into existence and setting it all in motion. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Brylcream_Boomer",
        "time": "5 November, 2021",
        "context": "I think the reason for all these COVID vaccinations is that Extraterrestrial life already landed on our planet and we got infected by some germ never before seen on this planet.  Remember how much chatter there was about UFO's in 2018 and 2019 - then POOF! - nothing more is mentioned.\nYup a new virus NEVER BEFORE SEEN on this planet has arrived.....",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "zippydodah",
        "time": "5 November, 2021",
        "context": "Ridiculous waste of resources when there are real people here in earth without basic essentials of life; clean water, food, clothing, shelter.",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "billburditzman",
        "time": "5 November, 2021",
        "context": "Of course other life exists. Spock was a Vulcan.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cincyman",
        "time": "5 November, 2021",
        "context": "I hope they start finding intelligent life out there, as liberalism is costing a lot of people to lose their intellect here on Earth.",
        "good": "2",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "ocnilinc",
        "time": "5 November, 2021",
        "context": "Detecting signals from another advanced civilization would be the biggest discovery in our history. However, the odds are the signals will be from a source hundreds, if not thousands, of light years away. It won't be like we can chat it up with them or anything. There's a chance they might not even still exist.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "BlueButton",
        "time": "6 November, 2021",
        "context": "Jesus was from another world, and so is Satan.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "fakeitgoodnasa",
        "time": "6 November, 2021",
        "context": "Time for Nasa's art department to download the latest edition of photo shop..",
        "good": "0",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "DirkVonKlar",
        "time": "6 November, 2021",
        "context": "The aliens already know about our funny skits and self-adoration amusements. They basically only visit St. Tropez, in summer, as beach bods and various suntan lotions reinforce the true humano-technical gains they seek from earth. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "answerman64",
        "time": "6 November, 2021",
        "context": "I would prefer that they spend that money identifying the rock that WILL kill millions on earth in the next 3000 years or less.\n\n\"The ultimate goal, they noted, is to capture pictures of any Earth-like worlds that might be out there.\"\n\nFunny, they can't get a clear picture of Pluto yet, even with Hubble!",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "BlueButton",
        "time": "6 November, 2021",
        "context": "In my father's house are many mansions, John 14, kjv.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "svengolly",
        "time": "5 November, 2021",
        "context": "Do we need to go looking for alien life ? Are UFO's alien emissaries already here ? Be very careful what you wish for, you just may get it. To quote Arthur C. Clarke \"Two possibilities exist: Either we are alone in the universe, or we are not. Both are equally terrifying.\"",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mikey706",
        "time": "6 November, 2021",
        "context": "As a practice run, First look into life form in DC. \nB/C they spend like drunken sailors with our money. \nI feel really sorry that my Twin Boys will have to clean up our generations spending habits.",
        "good": "0",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "nomos",
        "time": "6 November, 2021",
        "context": "Extraterrestrial life is science fiction.",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "thomaswinslow009",
        "time": "5 November, 2021",
        "context": "As a life long agnostic I'm beginning to think that the universe may have been the result of intelligence. It seems that just the right laws of physics were set in place to allow life and consciousness to evolve. The materialists view that we just happen to be in one of the universes (inflation theory) that sustain life doesn't seem plausible to me.",
        "good": "3",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "pjfields",
        "time": "5 November, 2021",
        "context": "So, how would we explain \"wokeness\" to a space alien creature, even one apparently light years beyond us in intelligence? I mean, if they can't understand it, how can the rest of us plain jane ordinary folks, right here in the good old USA on planet Earth?",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "mrbroker",
        "time": "5 November, 2021",
        "context": "SETI. Ringing E T ‘s dinner bell since 1984",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "R.Bose",
        "time": "6 November, 2021",
        "context": "Given the size of the universe, it's hard to see why we would be the only life, but if there is life out there, it's hard to see why we haven't seen any sign of it yet. Somebody out there should have had robots come through our system by now.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "spiritualrevolution720",
        "time": "5 November, 2021",
        "context": "With the near trillions libs have spent on space aliens, illegal aliens, alienating and murdering unborn babies, alienating most of America from their God-given Constitutional Liberties, had they applied that amount to their declared concerns like climate change, free healthcare and college, all would all be paid for with some left over to drop in the plate when they pretend to be Christians at Sunday Mass.  Hail Mary!",
        "good": "1",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "Mapstar",
        "time": "6 November, 2021",
        "context": "Put the cost under the Infrastructure Bill.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "thomaswinslow009",
        "time": "5 November, 2021",
        "context": "I think microbial life is probably fairly common in the universe. Advanced civilization might be much more rare. There are so many things that have to go correctly for life to evolve to that state.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "sunsoakr",
        "time": "5 November, 2021",
        "context": "Diversity should never be the main decision in hiring people for professional jobs.  That is irrelevant.  The main importance for the job performance should be qualifications such as education, experience and past job records.",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "rubiks6",
        "time": "6 November, 2021",
        "context": "If there were life on other planets, life would be mundane, commonplace. God emphasizes how special we are by creating life here and nowhere else.\n\nGod created the vast cosmos just to impress us, to demonstrate His unimaginable power. Again, that's how special we are.\n\nThis is the only place in the universe where there is life. We are utterly insignificant and yet God loves us enough to become one of us.\n\nLife cannot emerge from lifeless material. Only God can create life. Life only comes from life. Nothingness and randomness do not have the power to create a universe. Nothingness and randomness do not have the wisdom to create life. Nothingness and randomness do not have a desire to share life with us. Only God has the power, the wisdom, and the desire to create us. From nothing comes nothing. Life only comes from life. You know this to be true.",
        "good": "2",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "pparis",
        "time": "5 November, 2021",
        "context": "UFO's are here now look here",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "1pingyes2pingsno",
        "time": "10 November, 2021",
        "context": "They would first need to define 'life'. No doubt there are life forms totally unfamiliar to us and we might not recognize an alien life form if it stared us in the eye.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "codered",
        "time": "6 November, 2021",
        "context": "fermi paradox --------most likely life would be single cell if that",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sangomez",
        "time": "7 November, 2021",
        "context": "If the closest star is LIGHT YEARS away, for all practical purposes we're alone. We've pretty much determined that there's no other life currently in our Solar System. \n\nPS  A light year is the distance that light (or a radio transmission) travels in a year. That's a long way. The closest star to our sun is 4.35 light years away.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "rpol",
        "time": "10 November, 2021",
        "context": "Without faster than light travel (or folding space), we are stranded on this third rock from the sun…",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "nicksj",
        "time": "10 November, 2021",
        "context": "While less sexy than finding extra-terrestrial life, finding large objects on a collision course with earth seems far more important.  It is acknowledged that we have not identified all such potential objects.  Even one could extinguish human life on earth.  If we discover one too late, will NASA explain they had other more important priorities?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "budzo",
        "time": "7 November, 2021",
        "context": "We are but a tiny silica atom on a DNA molecule spinning through a maelstrom of matter that constitutes a living being, call it God if you will, it explains the expanding universe cuz we/ it are still growing.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ephesians2:8,9.",
        "time": "10 November, 2021",
        "context": "As someone who has studied this question in depth I don't see any feasible pathway to life being formed as a result of random chemical reactions. It is axiomatic that there can only be one source of Creation. That Creation is stamped with the Creator's imprimatur that is His alone. Humans have experimented with life \"in a test tube\" taking some license along the way and fall short an infinite distance from realization of life. Nevertheless there is a sizable segment of our population that believes we have demonstrated its feasibility. Thanks to a compliant media who have little interest or perhaps even knowledge to disavow the real state of human origins the myth of abiogenesis persists.",
        "good": "3",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "boboventuri",
        "time": "9 November, 2021",
        "context": "We are just uselessly spending money and inviting utter destruction: signaling intelligent, capable, responsible aliens that we are trying to expand our world will certainly cause them to immediately vaporize the earth to keep the crazy-stupid from spreading.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rfloyd399",
        "time": "9 November, 2021",
        "context": "Its hard enough to find intelligent life on this planet",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "thunker54",
        "time": "7 November, 2021",
        "context": "Heck - the flat-earthers are still trying to find that magical edge of the Earth.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jadvik24",
        "time": "7 November, 2021",
        "context": "I think we should first explore our own planet and search for intelligent life!",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "whyfor",
        "time": "11 November, 2021",
        "context": "Has Lieutenant Uhura tried all known hailing frequencies?",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "TheHumbleHotshot",
        "time": "7 November, 2021",
        "context": "What a ridiculous thing to suggest that funding be withheld unless there are more women on a particular team. Will this lead to putting unqualified women on a team, just to get funding? That can make the quality of science suffer. Also, fully qualified and amazingingly brilliant women are abundant in the scientific communities. However, the \"ratio\" is what it is and gender, or race, or anything other than scientific merits of an individual or the team shouldn't be a factor in awarding grants.",
        "good": "0",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "yourargumentisinvalid",
        "time": "8 November, 2021",
        "context": "I had a much simpler goal, but it is proving to be impossible, as I tried to search for intelligent life in the Biden administration.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "spiritualrevolution720",
        "time": "8 November, 2021",
        "context": "Since humans can't travel past the moon, what difference does it make what some probe finds.  Like the Mars rover that past over an area and found NO sign of ancient water sources.  Then, it past back over the same area months later, and found signs of water.  Then, non-NASA scientist pointed it out that it is most likely the rover contaminated the site during it's first pass.  Unless it finds something in never before touched spot, you can't claim you found anything.  That's just bad science.  Fix the Earth and life on this planet, first.  Besides, the moment those scientist think they've found sign of life somewhere else, they'll start selling future rides that will never happen, so airhead humans can pretend to one day go and contaminate that planet.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "selfishly",
        "time": "8 November, 2021",
        "context": "\"At the same time, the 614-page report stressed the need for greater diversity among astronomy’s ranks – still predominantly male – and suggested that NASA consider a science team’s diversity when doling out money for research or projects.\" Diversity by whatever name moves the field to the lowest common denominator. Joe Biden accomplished that in less than 6 months.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "1987harleyes",
        "time": "7 November, 2021",
        "context": "Try searching for intelligent life in the democratic party first.",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "TheTruthAsItIs",
        "time": "9 November, 2021",
        "context": "Stop wasting my money on ET!",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "TowerCDP",
        "time": "8 November, 2021",
        "context": "The most qualified person is no longer a priority. Gender, race, and sexual orientation sounds like the new standard. Sad.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "txbart",
        "time": "10 November, 2021",
        "context": "This after the complete failure at finding any intelligent life on EARTH. Just watch the news and you may AGREE. Looking elsewhere had better odds.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "steve1633",
        "time": "7 November, 2021",
        "context": "Now we know how Kamala Harris was discovered.",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "puck_the_libs",
        "time": "8 November, 2021",
        "context": "DEFUND ALL SPACE RESEARCH.  IT BENEFITS US IN NO WAY, SHAPE OR FORM.",
        "good": "0",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "thomaswinslow009",
        "time": "8 November, 2021",
        "context": "Did consciousness create the universe or did the universe create consciousness. Asking for a friend.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dirkbroadcloth",
        "time": "7 November, 2021",
        "context": "\"need for greater diversity among astronomy’s ranks – still predominantly male –\"   You can't make this stuff up. Because everyone knows that male astronomers are a bunch of male chauvinist pigs working every day to keep women out their profession.  One in which most are unemployed with heavy college debt and don't make squat.",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "CyberWarrior",
        "time": "15 November, 2021",
        "context": "I think the study of N.D.E. (near-death experience) would be a more interesting study. ",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "dan5047628",
        "time": "11 November, 2021",
        "context": "If God created life elsewhere its my opinion that he would never want us to know. God hates chaos and doubt and that would definitely cause chaos and doubt among the weak minded. \nMaybe that's why he made it impossible for us to find out by making the universe so large.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Melania'sPantyDrawer",
        "time": "13 November, 2021",
        "context": "I think it's kinda funny that scientists are searching for alien life.With all the endless pictures of UFOs and stories of encounters I'm sure alien life has found us.And anouther NASA chief administrator has admitted it.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "uspatriot2020",
        "time": "12 November, 2021",
        "context": "Space aliens have already reached the earth.  How else can we explain the likes of Bruce Jenderblender, Hollywood and the Biden Administration?",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "uspatriot2020",
        "time": "12 November, 2021",
        "context": "Space?  I'd settle for finding intelligent life in D.C.",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "quietsmith",
        "time": "13 November, 2021",
        "context": "As I watch the fundies throw tantrums about this I wonder once more where we would be without centuries of religious fundamentalism holding back scientific progress.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "uspatriot2020",
        "time": "12 November, 2021",
        "context": "If I claim to be a space alien, what kind of goodies can I get out of Joe Biden?",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "johne37179",
        "time": "13 November, 2021",
        "context": "I’m all in favor of funding little green men in future diversity programs.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "a1lilly",
        "time": "11 November, 2021",
        "context": "My question is Why? Use those billions of dollars in more useful, helpful endeavors. ",
        "good": "2",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "JellyMan4TRUTH!",
        "time": "14 November, 2021",
        "context": "there is exactly ONE, KNOWN instance of a planet with LIFE in the universe.  Earth. So we KNOW that there is a one in a something over 700 quintillion chance of life. We don't KNOW anything else. Everything else is wishful thinking.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "dan5047628",
        "time": "12 November, 2021",
        "context": "OK, you got one shot, Mars. A dead toxic rock. Good Luck",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "rubiks6",
        "time": "11 November, 2021",
        "context": "Astrobiology  is the one field of scientific research in which you can earn a PhD but for which there isn't a single shred of evidence.\n\nIt's just us, folks. Sorry. Aliens are science fiction.",
        "good": "4",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "dan5047628",
        "time": "11 November, 2021",
        "context": "Call me when the Aliens land or someone finds Bigfoot but until then I will continue living in my Beach Condo until the water rises high enough that I can't drive to it. lol",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "YtuMamaTambien",
        "time": "11 November, 2021",
        "context": "Winning the lottery is on my \"to-do list\" and I have a better shot than they do at finding aliens.\n\nWe are alone.",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "uspatriot2020",
        "time": "12 November, 2021",
        "context": "Why not spend the money that's going towards this fool's errand on curing cancer?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "USSocialistRepublicofAmerica",
        "time": "12 November, 2021",
        "context": "\"building on the \"extraordinary progress\" already made.\" No. We have just as much information about life outside our planet as we did 2,000 years ago. Exactly the same information.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "uspatriot2020",
        "time": "12 November, 2021",
        "context": "Space aliens coming towards the earth will pick up the earth's commercial radio and television signals long before the aliens get near the earth.  So why in hell would they not turn around?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "pencil77777770",
        "time": "14 November, 2021",
        "context": "I will say this. I am confident there is other life.  The trend is clear;\nWell the earth is flat and everything revolves around it (oh wait)\nOk fine the earth is round & revolves around the sun but there are no other planets (oh wait)\nOk fine but only our special solar system has planets (oh wait)\nOk fine there are other solar systems with planets but none of them are potentially habitable (oh ... wait)\nOk fine there are other potentially habitable planets in other systems but they don't have ....... \nThe James Webb telescope finally launching next month .... is music to my ears,  because there is a chance the next oh wait ... is going to happen very very soon.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tangouniformd3m$",
        "time": "11 November, 2021",
        "context": "astronomers stressed the need to continue the money grubbing with extraterestrial  \"projects\"",
        "good": "2",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "sc075468",
        "time": "15 November, 2021",
        "context": "I believe there is a battle between good vs evil, among those of us with intelligent life around the universe.   \n\nJesus has many brothers.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "nicksj",
        "time": "11 November, 2021",
        "context": "Judging by the number of UFO sightings in the past half century, it would appear that intelligent life has already found us.  Perhaps it would be easier to try to establish contact with them.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "uspatriot2020",
        "time": "12 November, 2021",
        "context": "If space aliens reach the earth before noon eastern time January 20, 2025 they had better bring their own gas for the return trip.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "peregrine464",
        "time": "13 November, 2021",
        "context": "This begs the question of how to travel to other planets likely having intelligent life given the vast distances and my understanding that the speed of light cannot be exceeded. Then again, it was formerly a scientific fact hundreds of years ago that the Earth was flat and that disease was caused by bad smells. Plus, the way things are going with CRT and all, that any breakthroughs will be made by the Chinese, not the US.",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "disgreeablegiver",
        "time": "11 November, 2021",
        "context": "Hasn't that already been on the list for the last 50 years ?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "TXTwstr",
        "time": "15 November, 2021",
        "context": "After a “mesmerizing” display of her interest in Space to a bunch of paid child actors, I’d like to nominate (F)Kamala Harris to lead the effort by journeying there herself. The problem with that, though, is there still wouldn’t be signs of any intelligent life out there that we’d know of.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "westernman094",
        "time": "17 November, 2021",
        "context": "Scientists should work with others to improve life on this planet before looking outward to other placed for life...who cares if there is  or isn't anything out there if life on earth is getting more difficult every day.  And what is life anyway?  so they discover an amoeba some billions of light year away!  Yippee!  Better yet...they discover a life form that helps us to become better humans...such is science fiction.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Martus_Abdias_",
        "time": "16 November, 2021",
        "context": "Humans murder innocent unborn babies to avoid responsibility for their own decisions.\n\nNo intelligent extraterrestrial life would want to have anything to do with us.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rgaylordjr",
        "time": "18 November, 2021",
        "context": "Instead of \"diversity\" how about picking the best qualified? ",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "djohnson",
        "time": "17 December, 2021",
        "context": "It seem to me that science fiction movies have a way of becoming real, Star Trek a lot of their gadgets are real now. \nSo maybe we shouldn't awaken a sleeping alien, remember what happen in Intendance Day.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "johnch22",
        "time": "15 November, 2021",
        "context": "Why are scientists looking for INTELLIGENT extraterrestrial life?\nBecause there is no intelligent life here on Earth.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "thomaswinslow009",
        "time": "16 November, 2021",
        "context": "As humans I think we are a little biased toward thinking that life can only exist where water is present. There might be ways for life to arise that we can't even imaging.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dan5047628",
        "time": "16 November, 2021",
        "context": "God may have put life on other planets, But I believe He made the Universe so large so that we would never know.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "itzahoax",
        "time": "17 November, 2021",
        "context": "Ha, what a joke.  We don't even have a decent photo of the Earth from space.  The blue marbles they put out are obvious CGIs.  And that's because man has never been to space, nor can they get through the firmament.",
        "good": "0",
        "bad": "2",
        "replies": []
    }
]