[
    {
        "user_name": "mpw5",
        "time": "5 December, 2018",
        "context": "On the surface, considering the fact that New York City and the NYPD are governed by a Socialist Mayor, the use of drones may be a concern about people's privacy.  \nI also believe the the NYPD has a \"Citizen's Committee\" that supposedly works with the police concerning the citizen's Rights in the face of new technology.  That group should be involved in the usage of the drones on how and where they can be used.\nIf my wife or daughter was sunbathing in the backyard, I might take steps to dispatch the drone to wherever dead drones go.  On the other hand, if a bad guy was jumping fences in an attempt to escape the police, a drone would be useful in an area where it might be too dangerous to public safety to use a helicopter.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Mountainhiker",
        "time": "5 December, 2018",
        "context": "Considering the massive traffic tie ups we have in our cities, it's makes sense to use this technology from a public safety standpoint.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "Itchytwitterfinger",
                "time": "5 December, 2018",
                "context": "starts out as \"PUBLIC SAFETY\" ends up as SPYING",
                "good": "6",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "BidenCrimeSyndicate",
                "time": "5 December, 2018",
                "context": "Most cities have stationary traffic cams that work just fine.",
                "good": "4",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "Dr.SteveBrule",
        "time": "5 December, 2018",
        "context": "\"Oh c'mon...when have we ever abused our authority...?\"- the police",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jigjag",
        "time": "5 December, 2018",
        "context": "The only way these could efficiently aid in law enforcement would be a violation of the 4th amendment.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "laveg1",
        "time": "5 December, 2018",
        "context": "ITS THE FUTURE BABY",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ChathamCraig",
        "time": "5 December, 2018",
        "context": "Drones with cameras in the streets of NYC.  This will not end well.  NYers put this down immediately before you see pictures of your children in the bath propagated around the world.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "namtah",
        "time": "5 December, 2018",
        "context": "Give them to FDNY.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "MelissaSnyder",
        "time": "5 December, 2018",
        "context": "A new use for my 12g shotgun.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "RedRaindrop",
        "time": "5 December, 2018",
        "context": "draw your shades",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cola976890",
        "time": "5 December, 2018",
        "context": "I've seen body camera footage of cops stealing from suspects and planting evidence. Undoubtedly cops will use drones to break laws. With all the surveillance cameras everywhere, the cops don't need this.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "virginianhart",
        "time": "5 December, 2018",
        "context": "See em? Shoot 'em.",
        "good": "2",
        "bad": "0",
        "replies": [
            {
                "error": "error"
            }
        ]
    },
    {
        "user_name": "BlueCoathanger",
        "time": "9 December, 2018",
        "context": "The drone fleet will soon be known as “Skynet”",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Phovos",
        "time": "20 January, 2019",
        "context": "The NYPD met with and provided a draft of its drone policy to the New York Civil Liberties Union before completing its program. NYCLU associate legal director Chris Dunn said he expressed concerns regarding police use of the technology.\n\nThat's right.  Lets go back to the old western days, use horses, and wear cowboy hats, guns slung on the sheriff's hips. \n\nLets see how we can tie the hands of police, while the criminal elements are using everything they can, technology wise, to commit crimes.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rtrim",
        "time": "5 December, 2018",
        "context": "As long as the NYPD operates according to all FAA sUAS regulations, it shouldn't be a problem, but they won't have to because they are law enforcement and special.   \n\nI imagine the regulations covering \"transiting private property\" wont' apply either.  \n\nOh, and if you shoot one down and can't prove they were over your property for the \"purpose of surveillance\", you might be charged with destruction of property along with any other charges that might apply.  You don't own the airspace above your house.  The FAA has control over that.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "TXJmmFox",
        "time": "5 December, 2018",
        "context": "Drones are a Liberals dream come true.  Imagine in the future how they will be able to police.  First comes the face recognition, then the thought recognition...then the Liberal goons.  People were a lot happier before the cell phone and internet.",
        "good": "8",
        "bad": "0",
        "replies": [
            {
                "user_name": "rtrim",
                "time": "5 December, 2018",
                "context": "There was life before cell phones and the internet?  Seriously?  Wow, how did we ever make it.",
                "good": "1",
                "bad": "0",
                "replies": []
            },
            {
                "error": "error"
            }
        ]
    },
    {
        "user_name": "breakingnews893",
        "time": "5 December, 2018",
        "context": "Not equipped with weapons. Yet.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cubanpete5",
        "time": "11 December, 2018",
        "context": "Remember the movie scene from exterminator when they went to the future and robot and drones were attacking the people. Or the movie scene from the matrix where they are fixing his eyes and he noticed police brought out drones and walking spiders, so he hid in a tub of water and off course the movie WAR OF THE WORLDS.  Sounds new york is heading in that direction and into the future.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "Phovos",
                "time": "20 January, 2019",
                "context": "another technophobe",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "deltawbravo",
        "time": "5 December, 2018",
        "context": "In a statement, the Legal Aid Society said it opposed police use of the technology. “Its continued unrestrained expansion will only further sow distrust and increase unequal treatment of our clients,”\n\nJust who are their clients?",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Itchytwitterfinger",
        "time": "5 December, 2018",
        "context": "we can have ours , you can't have yours  just as the CCTV",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "GreenPlanet",
        "time": "15 January, 2019",
        "context": "I do believe there is a concern here.  But why are they only worried about police using them.  I think we should also be worried about corporations and private citizens using them.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "Phovos",
                "time": "20 January, 2019",
                "context": "Just like any technophobic liberal.   \nPrivacy concerns, well, EU has a fantastic CCTV network, guess they are not worried about privacy, huh?   They have a low crime and high closure of crimes committed.\nYou on facebook?   Privacy?  hahaha.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "henrywiser",
        "time": "5 December, 2018",
        "context": "I'd like to know more about the drones. What brand, technical information.",
        "good": "3",
        "bad": "0",
        "replies": []
    }
]