[
    {
        "user_name": "mrmarkconley",
        "time": "25 December, 2021",
        "context": "I guess you don't look to FOX for news about the JWST launch this morning or anything else space related. Sad, since I watch FOX exclusively.",
        "good": "2",
        "bad": "2",
        "replies": [
            {
                "user_name": "nofooln924",
                "time": "25 December, 2021",
                "context": "Fox knows its audience and most don’t care about science.",
                "good": "2",
                "bad": "3",
                "replies": [
                    {
                        "user_name": "talibiden161",
                        "time": "25 December, 2021",
                        "context": "Yet its liberals who dont believe in science, ironic huh.  You know like the science that shows life begins at conception",
                        "good": "3",
                        "bad": "2",
                        "replies": [
                            {
                                "user_name": "sciencerocks",
                                "time": "28 December, 2021",
                                "context": "No science shows that.",
                                "good": "0",
                                "bad": "1",
                                "replies": [
                                    {
                                        "user_name": "talibiden161",
                                        "time": "28 December, 2021",
                                        "context": "actually it does, you truly should get an education.  Being willfully IGN0RANT is a disgusting liberal thing.",
                                        "good": "1",
                                        "bad": "1",
                                        "replies": [
                                            {
                                                "user_name": "sciencerocks",
                                                "time": "28 December, 2021",
                                                "context": "I teach anatomy, among other things.\nThe embryology textbook I use puts it this way: \"Human development begins at conception.\" When a human life begins is a matter of philosophy, not science. Possibilities include conception, implantation, a detectable heartbeat, viability, and birth. All of those are consistent with science (though the heartbeat one is silly), and all are matters of opinion.\n\nAnd before you tell people to get an education (I have a PhD in anthropology) or accuse them of being liberal (I lean conservative), perhaps you should think more deeply.",
                                                "good": "0",
                                                "bad": "0",
                                                "replies": [
                                                    {
                                                        "user_name": "talibiden161",
                                                        "time": "28 December, 2021",
                                                        "context": "NONSENSE.  I believe the science and the scientists who hold this view.  Why dont you? I dont believe you for a second. \"A sample of 5,502 biologists from 1,058 academic institutions assessed statements representing the biological view ‘a human’s life begins at fertilization’.\" \"Overall, 95% of all biologists affirmed the biological view that a human's life begins at fertilization (5212 out of 5502).\"",
                                                        "good": "0",
                                                        "bad": "0",
                                                        "replies": [
                                                            {
                                                                "user_name": "sciencerocks",
                                                                "time": "28 December, 2021",
                                                                "context": "I'm fine with that view. But it is still an opinion. Philosophers have struggled with this question for centuries. It is not a scientific question. Where did you get your data?",
                                                                "good": "0",
                                                                "bad": "1",
                                                                "replies": [
                                                                    {
                                                                        "user_name": "talibiden161",
                                                                        "time": "28 December, 2021",
                                                                        "context": "Its science.  With modern technology they can actually SEE  the fetus growing.  You really should get into the 21st century.  I doubt if you are a teacher, if you are you are cheating them out of a real education.  \"Steven Andrew Jacobs PHd\nUniversity of Chicago - Department of Comparative Human Development; Northwestern Prizker School of Law\nDate Written: July 25, 2018",
                                                                        "good": "0",
                                                                        "bad": "0",
                                                                        "replies": [
                                                                            {
                                                                                "user_name": "sciencerocks",
                                                                                "time": "28 December, 2021",
                                                                                "context": "Yes, I watched both of my sons develop in the womb, both in the twentieth century. Your timeline is a bit off.\nYou are missing the point. All the technology in the world cannot answer a subjective philosophical question.\nYou seem like a sincere person, so let me give you an analogy. I am a professor of anthropology who studies human evolution. We have a fossil record that goes back 6 million years of hominin evolution. We know that our own modern species arose only' about 100,000 years ago. Is that when we became human, or could our predecessors be called 'human' as well? That is a subjective question, just like when a 'human' life begins.",
                                                                                "good": "0",
                                                                                "bad": "0",
                                                                                "replies": [
                                                                                    {
                                                                                        "user_name": "talibiden161",
                                                                                        "time": "28 December, 2021",
                                                                                        "context": "once again science denier - its SCIENCE not philosophy.  You are not  a professor, your mind is too closed to be allowed to teach.  Your deflection and deversion is REJECTED.   I pray every day that people like you are not teachers, you only have one view and you are unable to open your mind to facts or new data.  Go away klown, I have no more time for you",
                                                                                        "good": "0",
                                                                                        "bad": "0",
                                                                                        "replies": []
                                                                                    }
                                                                                ]
                                                                            }
                                                                        ]
                                                                    }
                                                                ]
                                                            }
                                                        ]
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "olericat",
                "time": "25 December, 2021",
                "context": "It is Christmas morning, princess, now, go run and play with your tinkertoys...",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "talibiden161",
                "time": "25 December, 2021",
                "context": "NASA Published 60 mins ago\nNASA launches James Webb Space Telescope deep into space to see 'distant worlds' and back in time\nThe Webb telescope will help scientists understand the origins of the universe\nBy Caitlin McFall | Fox News",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "sciencerocks",
                "time": "28 December, 2021",
                "context": "Why would you watch Fox exclusively? Have your no interest in news?",
                "good": "1",
                "bad": "2",
                "replies": [
                    {
                        "user_name": "talibiden161",
                        "time": "28 December, 2021",
                        "context": "quit whining.  It is clear why you have no friends and even your family shuns you.",
                        "good": "0",
                        "bad": "1",
                        "replies": [
                            {
                                "user_name": "sciencerocks",
                                "time": "28 December, 2021",
                                "context": "You are projecting.\nI guess I was wrong when I called you a 'sincere' person.",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "fakeitgoodnasa",
        "time": "24 December, 2021",
        "context": "Nasa forgot to mention that their space artists concocting 'images' via the JTW telescope, will also have the latest version of photoshop.",
        "good": "0",
        "bad": "5",
        "replies": [
            {
                "user_name": "reconsurgeon",
                "time": "24 December, 2021",
                "context": "That must be what they’ll use to fix glitches in the Matrix…",
                "good": "0",
                "bad": "1",
                "replies": []
            },
            {
                "user_name": "quietsmith",
                "time": "25 December, 2021",
                "context": "So you hysterical tool that thinks we have technology more advanced than the technology we use to go to space that we use to fake going to space...\n\nWhat about the International Space Station? :D",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "fakeitgoodnasa",
                        "time": "27 December, 2021",
                        "context": "The International Fake Station (IFS) is a remote-controlled satellite (technology perfected by PARD).\n\nThose 'aboard' the IFS are located in a studio, equipped with harnesses of course.",
                        "good": "0",
                        "bad": "1",
                        "replies": [
                            {
                                "user_name": "quietsmith",
                                "time": "27 December, 2021",
                                "context": "Oh so it is up there. Got it. :D \n\nAnd no it's not remotely controlled, it's in orbit, and yes there are people on it :D",
                                "good": "0",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "fakeitgoodnasa",
                                        "time": "5 January, 2022",
                                        "context": "Yes, the IFS is indeed in orbit, and it is remotely controlled as are most satellites. The astro-actors and cosmo-clowns are located in a studio adjacent to the defunct Buran hangar in Baikonur. Why Nasa even built these clowns a 'garden space' so when they are 'off camera' they can take-in a little nature.\n\nIt's truly pathetic that folks still believe that people are 'living' in the International Fake Station.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": [
                                            {
                                                "user_name": "quietsmith",
                                                "time": "6 January, 2022",
                                                "context": "Oh do keep digging for me :D \n\nAnd no, its not remotely controlled. It's in orbit. While it does have limited capabilities to move with its thrusts, not so much that you can really control its orbit. Then there's the small matter of how we refuel it from time to time. :D",
                                                "good": "0",
                                                "bad": "0",
                                                "replies": []
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "rubiks6",
        "time": "25 December, 2021",
        "context": "Wow. No news about the launch? What’s wrong with Fox?",
        "good": "2",
        "bad": "3",
        "replies": [
            {
                "user_name": "nofooln924",
                "time": "25 December, 2021",
                "context": "Fox being Fox. Honestly, I think if the launch failed it would have made top billing on Fox and the majority would have blamed Biden.",
                "good": "2",
                "bad": "2",
                "replies": [
                    {
                        "user_name": "talibiden161",
                        "time": "25 December, 2021",
                        "context": "You are another one of THOSE IDI0TS;NASA Published 60 mins ago\nNASA launches James Webb Space Telescope deep into space to see 'distant worlds' and back in time\nThe Webb telescope will help scientists understand the origins of the universe\nBy Caitlin McFall | Fox News",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "talibiden161",
                "time": "25 December, 2021",
                "context": "NASA launches James Webb Space Telescope deep into space to see 'distant worlds' and back in time RIGHT THERE ON THE FRONT PAGE. ---- NOT VERY GOOD AT ENGLISH ARE YOU CUPCAKE.",
                "good": "1",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "rubiks6",
                        "time": "26 December, 2021",
                        "context": "Wasn't there when I posted.",
                        "good": "0",
                        "bad": "1",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "quietsmith",
                "time": "27 December, 2021",
                "context": "Did you need another article to bawl your eyes out and deny science is a thing?",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "obiteme",
        "time": "24 December, 2021",
        "context": "Wish it wasn't launching from Kourou, French Guiana and would launch on a US rocket from US soil instead, but oh well.",
        "good": "3",
        "bad": "5",
        "replies": [
            {
                "user_name": "connord218",
                "time": "24 December, 2021",
                "context": "The earth spins the fastest at the equator, that's why it launches there; to get a boost",
                "good": "7",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "Glasgow-ky",
                        "time": "27 December, 2021",
                        "context": "Didn't know SOUTH africa was closer to the equator",
                        "good": "0",
                        "bad": "3",
                        "replies": [
                            {
                                "user_name": "dementia_biden",
                                "time": "28 December, 2021",
                                "context": "French Guiana is in South America, genius. It's really close to the equator. Lot closer than Cape Canaveral FL.",
                                "good": "1",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "YetHereYouAre",
                                        "time": "3 January, 2022",
                                        "context": "Yup about 300 miles north....",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": []
                                    }
                                ]
                            },
                            {
                                "user_name": "YetHereYouAre",
                                "time": "3 January, 2022",
                                "context": "I didnt know French Guiana was off of Africa....But This launch zone IS on the equator just off South America.",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "davidleeroth",
                "time": "26 December, 2021",
                "context": "How to tell people you know absolutely nothing about physics without telling people you know absolutely nothing about physics.",
                "good": "5",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "MakingItHappen919",
                        "time": "30 December, 2021",
                        "context": "I love bacon too",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "quietsmith",
        "time": "25 December, 2021",
        "context": "Best Christmas gift ever.",
        "good": "4",
        "bad": "0",
        "replies": [
            {
                "user_name": "GreenBottle",
                "time": "1 January, 2022",
                "context": "God Bless us everyone!",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "nonotrush",
        "time": "24 December, 2021",
        "context": "My son does astronomy. He has his own observatory (like you can imagine only smaller) and has taken some simply amazing shots. Coming from landscape photography, he already had a good degree of knowledge, some of which helped him get really good, fast. It is unbelievable what is out there. Hope NASA does some wonder work with this knew telescope going up this Saturday.",
        "good": "9",
        "bad": "0",
        "replies": [
            {
                "user_name": "GreenBottle",
                "time": "1 January, 2022",
                "context": "It is wonderous to be alive in these times!",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "talibiden161",
        "time": "25 December, 2021",
        "context": "Already 50,000 miles from earth at 8:42AM pacific time",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "fatfreddy'scat941",
                "time": "27 December, 2021",
                "context": "In other words, it has barely started its voyage. Basically it isn't even out of the garage.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "Trumplicious",
        "time": "25 December, 2021",
        "context": "I have my own theory about the Big Bang. Before the big bang there was  no space. There was only the singularity that contained massive energy in the most basic form. With no where to go it eventually exploded. The singularity or black hole was broken up into a trillion or more pieces and these are what we call super massive black holes that are at the center of each galaxy. And the rest of the energy form hydrogen and stars, many going super nova creating all the elements that formed planets. All the stars and planets grouped together to their closest super massive black holes creating galaxy's. The super massive black holes that are in the center of each galaxy exist in space now, and if they consume too much material, can release the material as energy, and this is what they call an Active super massive black hole. The question is can this newly released basic energy from active black holes form into hydrogen. Or did it take the power of the original big bang to do that.",
        "good": "1",
        "bad": "3",
        "replies": [
            {
                "user_name": "talibiden161",
                "time": "25 December, 2021",
                "context": "oh look the chinese troll gave herself a like.",
                "good": "2",
                "bad": "2",
                "replies": []
            },
            {
                "user_name": "GreenBottle",
                "time": "1 January, 2022",
                "context": "Humans cannot wrap their minds around eternity with no beginning or end. It just is, and ever changing. Each piece has a beginning & end, but not the whole of it. But what do I know?",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "rubiks6",
        "time": "24 December, 2021",
        "context": "Still looking for life \"out there\"? Tsk, Tsk.\n\nIn the mean time, Mankind, in spite of all his cool technology is becoming more and more evil. The \"last days\" are upon us, folks. It's going to get ugly down here.",
        "good": "0",
        "bad": "3",
        "replies": [
            {
                "user_name": "quietsmith",
                "time": "25 December, 2021",
                "context": "There there, go back to weeping in the corner over your Bible as you cry all the science is a big evil conspiracy against you.",
                "good": "2",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "why101",
                "time": "25 December, 2021",
                "context": "It's not about religion.  Our adversaries have become stronger and allied.  They are about to unleash aggression upon the world and the US.  Meantime US leaders are focused on being \"woke\" or whatever the newest buzzword is for inward self-loathing.",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "rubiks6",
        "time": "24 December, 2021",
        "context": "\"... government workers were fired for being gay.\" \n\nAhh. I do miss the good ol' days when there was a bit more sanity.",
        "good": "2",
        "bad": "2",
        "replies": [
            {
                "user_name": "Cons_Indpdt",
                "time": "25 December, 2021",
                "context": "You sound like a religtard,,,",
                "good": "1",
                "bad": "3",
                "replies": [
                    {
                        "user_name": "rubiks6",
                        "time": "25 December, 2021",
                        "context": "What will you do when death seizes you and you find yourself brought before the Judge-of-All-Men? Will you escape death’s grasp? What will free you from your dark, hellish eternity?",
                        "good": "1",
                        "bad": "2",
                        "replies": [
                            {
                                "user_name": "fatfreddy'scat941",
                                "time": "27 December, 2021",
                                "context": "Why do you assume there will be an eternity?",
                                "good": "1",
                                "bad": "1",
                                "replies": [
                                    {
                                        "user_name": "rubiks6",
                                        "time": "27 December, 2021",
                                        "context": "Because Jesus Christ rose from the dead.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": [
                                            {
                                                "user_name": "fatfreddy'scat941",
                                                "time": "27 December, 2021",
                                                "context": "Now you're just being silly. No one rises from the dead more than a couple of hours of being 'dead'.",
                                                "good": "0",
                                                "bad": "0",
                                                "replies": [
                                                    {
                                                        "user_name": "rubiks6",
                                                        "time": "27 December, 2021",
                                                        "context": "You may think it is silly but when you die you will discover that the reality is that everyone is raised from the dead. Every one. No exceptions.\n\nYou too will rise from the dead. You will be brought before your Creator and you will be judged for your sins. You don’t get a free pass.",
                                                        "good": "0",
                                                        "bad": "2",
                                                        "replies": []
                                                    }
                                                ]
                                            },
                                            {
                                                "user_name": "Cons_Indpdt",
                                                "time": "30 December, 2021",
                                                "context": "Only ancient goat herders think that is true.",
                                                "good": "0",
                                                "bad": "0",
                                                "replies": [
                                                    {
                                                        "user_name": "rubiks6",
                                                        "time": "30 December, 2021",
                                                        "context": "I’m not an ancient goat herder. \n\nYour statement makes no logical sense. It does, however, sound like something a troll might say. I’ll give you the respect you deserve.",
                                                        "good": "0",
                                                        "bad": "0",
                                                        "replies": []
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "jfh67667",
        "time": "8 February, 2022",
        "context": "Forget about deep space and how about you turn that telescope towards the moon and let us see some detailed unedited IR photo's of the surface.  Since the IR can see through the haze, it should let us all see the surface and close up detail clearly.   Yup, that's what I thought.  They absolutely won't do it!  But why?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "trueguy",
        "time": "25 December, 2021",
        "context": "What is the real purpose of spending such a fortune on toys like that ? Ok maybe to find out other super advanced  societies somewhere in the deep cosmos then what?\nor maybe to keep earthlings occupied while never ending variants are in the news daily ?\nI get it .governments don’t know how to spend other peoples money .",
        "good": "2",
        "bad": "12",
        "replies": [
            {
                "user_name": "Fbgh",
                "time": "25 December, 2021",
                "context": "Apparently advancing human knowledge and understanding about the universe is not high on your priority these projects are discovering entirely new fields of science and expanding our place in the cosmos this kind of tech advances things like cell phone and communication, it goes on and on. ",
                "good": "11",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "quietsmith",
                "time": "27 December, 2021",
                "context": "Nope, we won't find alien life with it and wouldn't expect to. It's for studying the universe itself.",
                "good": "5",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "deegeebee",
        "time": "15 February, 2022",
        "context": "Isn't it interesting how the $10B cost comes up in every article? I'm sure there were many 'journalists' hoping something would fail so they could use the 'waste of money' stories they had already written. Not one of those dollars was 'shot up into space' but spent right here on planet Earth.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dan5047628",
        "time": "28 December, 2021",
        "context": "So billions spent on looking at the stars. You can see them by looking up in the sky at night and learn just as much.",
        "good": "1",
        "bad": "11",
        "replies": [
            {
                "user_name": "DeaconWebb",
                "time": "31 December, 2021",
                "context": "agreed",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "shortylong",
                "time": "2 January, 2022",
                "context": "Yes.  We learned that we needed telescopes.",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "uhavenoclue",
        "time": "25 December, 2021",
        "context": "I wonder what happens when we look out there a see something looking back",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "GreenBottle",
        "time": "1 January, 2022",
        "context": "Interesting comments here by an IQ spectrum of people? Some get it, and some just don't! Never will?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sp1ke",
        "time": "27 December, 2021",
        "context": "So why didn't Fox cover this appropriately? It is because Fox and the Rep cons are ANTI-SCIENCE, per anti-vax, anti-public health.",
        "good": "0",
        "bad": "9",
        "replies": [
            {
                "user_name": "sciencerocks",
                "time": "28 December, 2021",
                "context": "Not a word about the passing of EO Wilson, either.",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "shortylong",
                "time": "2 January, 2022",
                "context": "You have some serious personal issues...",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "jfh67667",
                "time": "8 February, 2022",
                "context": "Explaining things to you is like trying to explain to my dog why licking his butt is inappropriate.  In the end, he doesn't have the mental capacity to understand and he still licks his butt.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    }
]