[
    {
        "user_name": "Harrykeepthechange",
        "time": "15 April, 2021",
        "context": "Coincidentally, I can think of about 2.5 billion things that would be more important and relevant to study at this time.",
        "good": "5",
        "bad": "7",
        "replies": [
            {
                "user_name": "928quest",
                "time": "15 April, 2021",
                "context": "Yeah, why focus on science and discovering the nature of life when you can virtue signal and be woke.",
                "good": "9",
                "bad": "5",
                "replies": []
            },
            {
                "user_name": "beadgBass",
                "time": "16 April, 2021",
                "context": "If you thought of 2.5 billion things at one thing per second, it would take you longer than 80 years. Methinks you exaggerate.",
                "good": "7",
                "bad": "2",
                "replies": []
            }
        ]
    },
    {
        "user_name": "drewlewis",
        "time": "15 April, 2021",
        "context": "\"......the Berkeley team said the total population could be as little as 140 \nmillion or as much as 42 billion with 2.4 billion as the middle value\". So basically they don't know how many there were.",
        "good": "23",
        "bad": "3",
        "replies": [
            {
                "user_name": "StrengthOfTen",
                "time": "16 April, 2021",
                "context": "Fox News wanted an eye catching headline for the article so they went with the big number.",
                "good": "4",
                "bad": "2",
                "replies": []
            }
        ]
    },
    {
        "user_name": "cea246989",
        "time": "17 April, 2021",
        "context": "In the final analysis, although it's interesting to put a number to the T-Rex population estimate, it's still just a swag.  No way to prove it, but a neat argument.",
        "good": "4",
        "bad": "1",
        "replies": [
            {
                "user_name": "letsgetrel",
                "time": "17 April, 2021",
                "context": "It is just a thought experiment to talk about over a beer.",
                "good": "2",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "scion777",
        "time": "19 April, 2021",
        "context": "now think about how many mid-sized and small dinosaurian predators there will - which would have outnumbered the tyrannosaurs at the top of the food chain by many times ...",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "OLLIE.OOP",
        "time": "17 April, 2021",
        "context": "They were all part of the big plan to put the Democrats in the White House.",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "DogsandCats",
        "time": "19 April, 2021",
        "context": "Wonder how they mated?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Citizen010",
        "time": "15 April, 2021",
        "context": "So how is this racist?",
        "good": "8",
        "bad": "6",
        "replies": [
            {
                "error": "error"
            }
        ]
    },
    {
        "user_name": "hillbillyranger",
        "time": "24 April, 2021",
        "context": "Ya got to love these educated guesses. There is no real proof of how they lived or how long or anything else. But it's fun to read these and use your imagination which is what their guesses are based on I believe. Not that I know or really care it makes no difference to man kind unless they find a T rex skeleton with a human skeleton sticking out of it's mouth then that would show one may have had some impact on the other. LOL Which we all know is impossible.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "RichardZZ",
        "time": "16 April, 2021",
        "context": "It Would make a nice pet.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "thomaswinslow009",
        "time": "16 April, 2021",
        "context": "And not a single one made it onto Noah's Ark. What a shame.",
        "good": "9",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "dan5047628",
        "time": "28 April, 2021",
        "context": "Funny",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "PurpleDog",
        "time": "26 April, 2021",
        "context": "I am beginning to think that Paleontologists and their ilk MAY be the least creatively inclined group on the planet.  They need to use some of their funds to hire actual and believable creative writers, who can paint a picture that is not so obviously stilted and silly....or a novelty for the science of today...maybe tell the truth and present that they really have no idea and present their actual creative ideas as JUST that....not fact etc....its getting old and not good for the people's perception of science in general.  They are fast gaining on the climate crowd among others.",
        "good": "1",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "Objective_Thinker",
        "time": "17 May, 2021",
        "context": "I am still amazed by the people who wrongly believe the non-avian dinosaurs all died out 4000 years ago. Their opinions should be considered null and void on any topic because they have already forfeited common sense and critical thinking. Those poor uneducated rubes...",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "homeschoolmafia",
        "time": "17 July, 2021",
        "context": "And I saw E.T. eating candy and later sitting beside Pee Wee Herman.",
        "good": "0",
        "bad": "0",
        "replies": []
    }
]