[
    {
        "user_name": "victory5",
        "time": "6 September, 2022",
        "context": "Democrat Party just can't get enough Trump. You would think he is still the acting President the way they all spew constant dribble about him. If it wasn't for inflation, jacked up food prices, fuel prices et all you would believe Trump was still running the show. It would be nice if at least some of the Democrats would focus more on the job at hand instead of a former President.",
        "good": "148",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "PiedPiper888",
        "time": "6 September, 2022",
        "context": "Once again, the double standards of Democrats is incredibly apparent.  My next question to Jean-Pierre would be: “Can you please tell me one single thing that Joe Biden has done that has actually helped Americans”?  She’d be stumped because Biden has done nothing whatsoever to help Americans.  He’s helped countless non-Americans though.",
        "good": "95",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "vic7",
        "time": "6 September, 2022",
        "context": "\"If she knew this question was coming, you would think she would have a better answer prepared,\" This was her better answer that she worked on for hours.",
        "good": "45",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "humble_ragamuffin",
        "time": "6 September, 2022",
        "context": "\"National Journalism Center program director Becket Adams made the same point, tweeting, 'The really funny thing is: she had months to prepare for a question she knew was coming, and she still doesn’t have a good answer!'\"\nPeople should NOT criticize her for not coming up with a good answer.  THERE WAS NO GOOD ANSWER!  It was complete and total hypocrisy and the best orator in the world wouldn't be able to hide that. ",
        "good": "31",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "spirit77",
        "time": "6 September, 2022",
        "context": "Forerunner to the 2020 steal the deal scandal, look up if you can find it the 2016 issue with Broward County Fla absentee ballot scandal. Liberals refused to cover it. See a certain good friend of Clintons there who was elections supervisor had allegedly printed up extra absentee ballots and used clerks to fill them in for people get ballots but never vote. A worker seen what was going on went to the elections supervisor not knowing that she was the Luthor of the operation. She was promptly fired and escorted from the building for voicing her concerns.  She went to Republicans under sunshine law they demanded observers immediately Supervisor of elections refused. Court judge said now or else all ballots there gone. She still put it off 3 more days. Absentee ballots were ordered held for trial. She destroyed the ballots and made digital copies. Republicans had learned about the ink used in the forgeries was not same as the state made ballots. She destroyed the evidence. Santis removed her about year later for that scandal.",
        "good": "105",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "patriotbiker016",
        "time": "6 September, 2022",
        "context": "Schooled by who? Conservatives? Of course she was. In real news, Trump operatives who stole election data are in big trouble.",
        "good": "1",
        "bad": "26",
        "replies": []
    },
    {
        "user_name": "irondumpling",
        "time": "6 September, 2022",
        "context": "Doocy should know by now that it's different when dems do it.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "oiltrader312",
        "time": "6 September, 2022",
        "context": "Never in the past has such a totally ignorant person been put into a position like this.  The laughing stock yo the entire world.  With the VP running a close second!",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "clownworld170",
        "time": "6 September, 2022",
        "context": "Every day appointees by skin color & gender in this administration show the American people that qualifications matter",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "fxr392",
        "time": "6 September, 2022",
        "context": "\"Oh, I knew this was coming,\" Jean-Pierre said --- Yet she did not have a coherent answer. I'd hate to see what she'd say if she didn't know the question was coming.",
        "good": "62",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rt1957",
        "time": "6 September, 2022",
        "context": "so you are surprised with her answers to anything...? don't you remember the reasons she was picked to do that job in the first place? ...well there you go!",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "coop721",
        "time": "6 September, 2022",
        "context": "I don’t remember a single Republican having a problem with Hillary when for the better part of two years she traveled the country and world whining about how the 2016 election was stolen. ",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Dem_Lives_Don't_Matter",
        "time": "6 September, 2022",
        "context": "\"Look, the only place be givin' me my props is MSNBC.\" ~ Karine ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "waternymph",
        "time": "6 September, 2022",
        "context": "She is simply out of her league..... It's just embarrassing. ",
        "good": "12",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "brook29433",
        "time": "6 September, 2022",
        "context": "CananyonetellmewhymyspacebardoesnotworkonFoxonly?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rodh082",
        "time": "6 September, 2022",
        "context": "This is what you get when you make a hire solely on gender and race…everyone else who is qualified are tossed to the curb.",
        "good": "13",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Liberals...ehh",
        "time": "6 September, 2022",
        "context": "Hilarious!!  So in 2016 you’re concerned about the voting rights of democrats, but in 2020 everything went as smoothly as possible?  So now I’m an extremist for being part of the MAGA movement, but she’s a hero for championing peoples rights?  Head scratcher indeed",
        "good": "13",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "truthamongliars",
        "time": "6 September, 2022",
        "context": "President Trump OWNS the Democrat LIARS!!!! Everyone in the Criminal dem world FEARS Him and Must LIE Continuously about Him.  Make America Great Again!!! God Bless President Trump!!!",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "itsmymonee",
        "time": "6 September, 2022",
        "context": "It’s a glaringly obvious question. So why is it always up to Peter Doocy to ask these sorts of questions?  A room full of supposed journalists and reporters and they all pretend the left didn’t call Trump illegitimate for his entire term. ",
        "good": "57",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "strommie63",
        "time": "6 September, 2022",
        "context": "Because there is no \"good answer\".",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "trivium525",
        "time": "6 September, 2022",
        "context": "She put the question to Joe and that was the lame brain answer he gave her, so when someone asks, just tell them that!🤪😂bahahaha ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ital1",
        "time": "6 September, 2022",
        "context": "Im waiting for this Nation to come back to the place where those in power say something that comports with reality; where people mean what they say and use language as if it evolved to describe things with some exactitude. You know \"this is this\" and \"that is that\" not the opposite. It certainly won't happen with the Party of Chaos in power.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rodh082",
        "time": "6 September, 2022",
        "context": "If this is how she answers a question that she’s had years to plan for, I’m pretty sure she just lost credibility on any “off the cuff” answers (i.e., the ones she has to constantly be looking for in her binders).",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mreggypantz",
        "time": "6 September, 2022",
        "context": "Imagine offering a rebuttal like this, presumably understanding that it is absurd and inscrutable, yet still saying it. Why? Because as a Democrat, she knows that the media will not skewer her for it, indeed they will even validate it for her. All she need do is utter something and they will do the rest",
        "good": "44",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "stace2317",
        "time": "6 September, 2022",
        "context": "Explain fair one. You want to have it both ways. The 2020 election was riddled with first times. You definitely chose the wrong argument. You are making the argument that people in the 2020 election are claiming. If you want to help your side…resign. NOW!  You are out of your depth. They are sacrificing you. They will use you up. The will say that was all you and you were inept. It’s coming because you can’t explain Joe Biden. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sjmaus",
        "time": "6 September, 2022",
        "context": "The poor little token is out of her league.",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "BillDewall969",
        "time": "6 September, 2022",
        "context": "She’s not there for any other reason than to take the shot ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "RAN731",
        "time": "6 September, 2022",
        "context": "KJP is a low IQ Dim.  PERIOD….. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mreggypantz",
        "time": "6 September, 2022",
        "context": "Jack Hunter's observation is precisely correct and explains much of the hypocrisy and absurdity we see from Democrats. They know they can make ridiculous claims and  absurd statements, because not only will their lackeys in the media not rebuke them for it, they will actually find a way to validate it for their Democratic masters. ",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "clownworld170",
        "time": "6 September, 2022",
        "context": "Democrats are allowed complete hypocrisy as the media provides cover daily. Same with laws, democrats are above the law",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "LibMob602",
        "time": "6 September, 2022",
        "context": "These people have absolutely no shame. I bet if Trump ran and won the 2024 elections, she would say the same thing again. That’s how audacious these people are.",
        "good": "39",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "kendol",
        "time": "6 September, 2022",
        "context": "If they remake the Little Rascals show 20 years later, she would be one of the characters. ",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "MasterChiefUSN931",
        "time": "6 September, 2022",
        "context": "When you adopt this 'equity' garbage this is what you get. Think about that the next time you are going up the airbridge to board your flight and you see the flight deck crew is all POC's. How did they get their jobs? ",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Muxman",
        "time": "6 September, 2022",
        "context": "So I wonder how long before Peter Doocy is banned as a WH reporter? I suspect it's coming. 😃",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rollxtidexroll",
        "time": "6 September, 2022",
        "context": "OOOOtay Buckwheat.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "milwaukeeb",
        "time": "6 September, 2022",
        "context": "Foxnews supports traitors like Trump.",
        "good": "1",
        "bad": "21",
        "replies": []
    },
    {
        "user_name": "DerpTurtle",
        "time": "6 September, 2022",
        "context": "Ummmmm? Is it really that surprising that dems don't have a good answer - for anything? I mean really, look at any once prosperous city they have run (into the sewer). They want that for the entire country, look at Florida, doing well, they hate DeSantis for it. I wonder why? Look at Texas, they hate Abbot, why? Look at Californica, they love them some Newsom, I wonder why? ",
        "good": "10",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "NotaDemDum",
        "time": "6 September, 2022",
        "context": "Democrats = Hypocrisy AGAIN.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Pedophilejoebiden814",
        "time": "6 September, 2022",
        "context": "She is the Forrest Gump of politics",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Nothingbutthetruth661",
        "time": "6 September, 2022",
        "context": "War is peace, \nFreedom is slavery, \nIgnorance is strength, \nBig brother, \nNewspeak, \nDoublethink, \nImmutable of the past, \n2+2=5,\nGeorge Orwell",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "oldctanky",
        "time": "6 September, 2022",
        "context": "It's obvious her college professors afforded her the opportunity to change and deny her answers to tests also, or she wouldn't have made it past pre-k",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "raygunn995",
        "time": "6 September, 2022",
        "context": "Shouldn't a person in her position be at least one of the smartest and brightest? And she is what Biden gave us.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mreljeffee",
        "time": "6 September, 2022",
        "context": "so no push back to little orphan annies comments.  way to show your bias fox news ",
        "good": "0",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "NotaDemDum",
        "time": "6 September, 2022",
        "context": "She's not the only one, remember the word illegitimate.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "milwaukeeb",
        "time": "6 September, 2022",
        "context": "So Foxnews is now comparing her to the orange idjt (the impeached Donald J Trump) who up till now haven't stopped yapping about 'stolen' election. Hilarious 😆",
        "good": "0",
        "bad": "9",
        "replies": []
    },
    {
        "user_name": "ohiocons",
        "time": "6 September, 2022",
        "context": "Affirmative Action at its worst. ",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "7thcav758",
        "time": "6 September, 2022",
        "context": "When she's finally fired, she can get a job holding a lantern at the end of a driveway.",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "NotaDemDum",
        "time": "6 September, 2022",
        "context": "Ummm Uhhhh, can we circle back.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mmorajr",
        "time": "6 September, 2022",
        "context": "Worse Press Secretary in History, she is totally incompetent to be up there answering questions. This is what happens when you try to meet quotas instead of placing the most qualified person in that position but that's the way the Biden Admin has filled other vital positions too and you now see the results.",
        "good": "51",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "raygunn995",
        "time": "6 September, 2022",
        "context": "Biden chose her for her position because her culture (13%) is good at lying.",
        "good": "5",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "friendlybutvenomous",
        "time": "6 September, 2022",
        "context": "When cornered, she lies and runs. It's in the DNA.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "huntersartemporium341",
        "time": "6 September, 2022",
        "context": "Liberals in the US in 2022 are INSANE!!!!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "glmc",
        "time": "6 September, 2022",
        "context": "Standard Democrat answer \"I did not say what you heard me say\".",
        "good": "17",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "_malcolmxcrement_",
        "time": "6 September, 2022",
        "context": "Don't laugh at her. she can't help it\n She's \"special\". ",
        "good": "14",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "wethepeople1776",
        "time": "6 September, 2022",
        "context": "This mop head just needs a wooden handle, and then put her in a bucket in the corner...where she can do no further harm.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Nothingbutthetruth661",
        "time": "6 September, 2022",
        "context": "War is peace, \nFreedom is slavery, \nIgnorance is strength, \nBig brother, \nNewspeak, \nDoublethink, \nImmutable of the past, \n2+2=5,\nGeorge Orwell",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "myvoy",
        "time": "6 September, 2022",
        "context": "What do you expect from a by-product of affirmative action??!!",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "adventurer1952",
        "time": "6 September, 2022",
        "context": "“TDS” is alive and active amongst the liberal community today, and the left is terrified that he could be re-elected in 2024, as they know that he would continue his promise of draining the swamp.",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Red1022",
        "time": "6 September, 2022",
        "context": "Name me one person who had their voting right’s suppressed ? Just one ;one . We keep keep hearing about voter right infringement but I never see any examples!!!!! ",
        "good": "14",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "gmontag",
        "time": "6 September, 2022",
        "context": "It seems that some election deniers are more equal than others. ",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "JimmineyCricketts",
        "time": "6 September, 2022",
        "context": "LOL.  Fox is stooping to quoting pastors/sports journalists on political topics.  \nThis truly is the party that hates education.  ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "findingitfunny603",
        "time": "6 September, 2022",
        "context": "She' taken lesson from Kamala on \"incoherent babble\".\nKamala:  \"Remember, always start with a giggle.\"",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "panget",
        "time": "6 September, 2022",
        "context": "The token one. ",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "spotsonthewall",
        "time": "6 September, 2022",
        "context": "Peter Doocy speaking to Little PC Annie......\"Pot meet kettle on stolen elections.\"",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "BringBackAmerica164",
        "time": "6 September, 2022",
        "context": "It’s amazing and I thought it couldn’t get worse then Jen Psakia or however it’s spelled, don’t really care enough to spell it correctly ",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "travestar869",
        "time": "6 September, 2022",
        "context": "Biden should hire based on qualifications, not pigment and gender.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Oakley17941",
        "time": "6 September, 2022",
        "context": "I have a dwarf cherry tree with the same haircut. ",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "darlinfamily688",
        "time": "6 September, 2022",
        "context": "but she checks the right boxes",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "woodyman",
        "time": "6 September, 2022",
        "context": "Donald Trump lives rent free in the liberal brain",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "RussM",
        "time": "6 September, 2022",
        "context": "The word Democrat has become synonymous with the word HYPOCRITE. Everyone knows it including them.",
        "good": "13",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rearadmiraljockrash",
        "time": "6 September, 2022",
        "context": "But, but, but I am righteous and you are not.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dimmindlesssheep",
        "time": "6 September, 2022",
        "context": "'My answer is ten thousand million times better than yours'\nKJP",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "resort",
        "time": "6 September, 2022",
        "context": "She lies on a daily basis. Worse than her boss. ",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "badger4149",
        "time": "6 September, 2022",
        "context": "She knew it was coming, and still swung and missed. Amazing incompetence and hypocrisy.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "white.noise",
        "time": "6 September, 2022",
        "context": "If Trump didn't exist, they would have to invent him.  ",
        "good": "13",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "john894",
        "time": "6 September, 2022",
        "context": "Quote: Washington Editor for The Spectator Amber Athey blasted Jean-Pierre, tweeting, \"She knew it was coming and still couldn't muster up a decent response.\"\nIn other words she could not be honest, which is why she has the job she does...",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "skippy015",
        "time": "6 September, 2022",
        "context": "He’s in their head…lol!",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "anothernamealready",
        "time": "6 September, 2022",
        "context": "Losers on both sides have questioned results.  Because we live in America we have that right. Protests are part of our exercise of free speech,  whether those protests take place in or around government buildings or in public spaces that has been part of America .  Because jan 6 was a republican protest democrats and rinos have make it a political crime. We now have political prisoners ",
        "good": "11",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "davenc50",
        "time": "6 September, 2022",
        "context": "I disagree with those saying she should have had a better answer to the question. How do you have a credible response to a question that specifically illustrates your hypocrisy about something you did that is complete verifiable?\nIt’s not rationally or logically possible. Your only options are: 1. Deny the action. 2. Admit your action. 3. Stay silent.\nKJP is like watching amateur hour with no laughs.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Razzmatazz612",
        "time": "6 September, 2022",
        "context": "Black Affirmative Action Raggedy Jean-Pierre.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "smilingkangaroo",
        "time": "6 September, 2022",
        "context": "We'll know that there has been a fair election when Donald J. Trump wins.  There is simply no way that a man as likeable and as respected as Donald Trump could lose a fair election.  Approximately 80 percent of American voters chose Donald Trump.  ",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "equilibrium",
        "time": "6 September, 2022",
        "context": "The headline says she was \"schooled\".  One question asked and answered.\nBut given the level of \"schooling\" here, I can't blame their linear perspective.",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "jasonforthetruth",
        "time": "6 September, 2022",
        "context": "EVERY OTHER NEWS SERVICE IS REPORTING on Trump confederates caught on camera entering a voting station and breaking into Dominion systems shortly before Trump (through Fox) reporting on voter fraud at that facility. Yet this crud is the lead story on this service? No wonder Fox is getting sued for billions for false reporting!!!!",
        "good": "0",
        "bad": "11",
        "replies": []
    },
    {
        "user_name": "drmarke410",
        "time": "6 September, 2022",
        "context": "Sorry Karine, the only person to be killed on January 6 was Ashley Babit, an unarmed person, shot and killed by. Capital police officer with a record of careless firearm use.  Why the continual lies?? ",
        "good": "14",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "joept1@yahoo.com",
        "time": "6 September, 2022",
        "context": "Ridiculous as usual, we can’t believe one word that comes out of DC",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "guest3333",
        "time": "6 September, 2022",
        "context": "It's because there is no good answer and she knows it.  The old senile guy would know it too but he has no clue, they are words on a teleprompter that Jill tells him to read. ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bulletbob704",
        "time": "6 September, 2022",
        "context": "She has the mental agility of a 40 ounce.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "misterfixitup",
        "time": "6 September, 2022",
        "context": "A kid with their hand in the cookie jar would have done better. Perfect poster child for the dems.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "DrewRok",
        "time": "6 September, 2022",
        "context": "I mean, look at her. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "TiredAmerican276",
        "time": "6 September, 2022",
        "context": "Because there is no good answer. The answer is both parties do it. It's not a threat to democracy, and one side shouldn't be damned for it when the other side is doing it too. She can't say that though. We are simply playing by the same rules the Democrats set up. If they don't like the rules, they need to quit making them. I'm so sick of the hypocrisy that Democrats have on just about everything they engage in. Rules for thee, not for me. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "steve1633",
        "time": "6 September, 2022",
        "context": "Does anyone remember Prissy, Scarlet O'Hara's ignoramus maid in Gone With the Wind?  Just wondering.  [Now what made me think of her?]",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "rasbrewer",
        "time": "6 September, 2022",
        "context": "Just report when she finally gives a good answer. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Brianne",
        "time": "6 September, 2022",
        "context": "I agree that denying election results is dangerous.  Therefore, I call on all extremists to stop falsely claiming Joe Biden legitimately won the 2020 presidential election.  ",
        "good": "12",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "oivink",
        "time": "6 September, 2022",
        "context": "it is tough to defend the commies that are ruining this country.......",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tumultuoustimes",
        "time": "6 September, 2022",
        "context": "I dont see the Doos schooling anybody. His reputation precedes him.",
        "good": "1",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "pawpawof6315",
        "time": "6 September, 2022",
        "context": "She is as clueless as her president sad sad sad",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "catstep",
        "time": "6 September, 2022",
        "context": "She should have prepared an answer and put in her binder of responses for the press. Unfortunately any response she had would have been hypocritical. ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "1st.cavmia.",
        "time": "6 September, 2022",
        "context": "This woman has got to go...Old joe can sure pick them..!Everyday is full of issues and misinformation or none at all...",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tumultuoustimes",
        "time": "6 September, 2022",
        "context": "So Fox heads to Hollywood for the wisdom of Adam Baldwin? So much for that liberal bias!",
        "good": "0",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "Fed-upinTexas232",
        "time": "6 September, 2022",
        "context": "The three minute lecture about why it was a ridiculous question is exactly what's wrong with this administration.  They don't recognize that anyone with a different opinion of what democracy really is deserves to even be heard.  we should just sit down and shut up otherwise we will eventually have the FBI and the IRS (along with a couple of Marines in full dress) showing up at our door.",
        "good": "10",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "chiefosceola",
        "time": "6 September, 2022",
        "context": "Hillary wrote an entire book how the election was stolen and has never accepted the results.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "pawpawof6315",
        "time": "6 September, 2022",
        "context": "The cherry tree is smarter ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "marymary957",
        "time": "6 September, 2022",
        "context": "biden should just keep everything as is/fire nor replace a single soul.\n\nThat would help the Republicans even more",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "*WINNING*",
        "time": "6 September, 2022",
        "context": "Is anyone surprised by the fact that the GOP Lead going into the midterms has completely and totally disappeared? \n😂😂😂😂",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "mcthousand",
        "time": "6 September, 2022",
        "context": "She would be better qualified advertising toenail fungus remedy. Black fungus matters.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "pawpawof6315",
        "time": "6 September, 2022",
        "context": "Jason for the truth stop watching fox go back to msnbc more your speed ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "majjjj",
        "time": "6 September, 2022",
        "context": "Nothing new here folks, just another DimDem liar at the mic.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "pawpawof6315",
        "time": "6 September, 2022",
        "context": "So did Kalama ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Cloderic",
        "time": "6 September, 2022",
        "context": "And another Kamala-Kakkle answer.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jamin5280",
        "time": "6 September, 2022",
        "context": "\"...she knew was coming, and she still doesn’t have a good answer!\"\nThat's because there is no good answer. The only thing she could do was admit her hypocrisy and we all know that won't happen no matter how obvious it is.",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "criticalthinkingisgood214",
        "time": "6 September, 2022",
        "context": "Maybe we can be rational and agree neither election was stolen. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Delbert134",
        "time": "6 September, 2022",
        "context": "She had an answer for him but the dog ate that page from her binder",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "wegotproblems",
        "time": "6 September, 2022",
        "context": "she is not a good liar or is Biden as far as that goes ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sp00ky",
        "time": "6 September, 2022",
        "context": "Biggest joke on the planet.\nThis entire administration.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Nanrob",
        "time": "6 September, 2022",
        "context": "It’s way past time for her to be gone.  The Dems worry about checking boxes, but the first box checked off should be competency. She definitely not the only one that isn’t competent. Look at the majority of the cabinet ",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "l.tagg",
        "time": "6 September, 2022",
        "context": "Imagine how bad a communicator Frenchie would be if she didn't have a \"Master's Degree\" in Public Relations. ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "w.r.dooomed",
        "time": "6 September, 2022",
        "context": "And don't forget Hillary accusing Trump of being an illegitimate President. The Clinton's history is a crime story.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "w.r.dooomed",
        "time": "6 September, 2022",
        "context": "Leave her right where she is...she's  like a score card of a real bad (and cheating) golfer. 5 under par for every hole!!!😂",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "GoodFella68403",
        "time": "6 September, 2022",
        "context": "\"Mocked White House press secretary\".\nThat could be a headline every freaking day. ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "foxistrashnews",
        "time": "6 September, 2022",
        "context": "He scares them to death..he lives larger in the tinny mind's..\nWhat they fail to see is.. WE ARE MAGA.. \nDonal represents us..we the people..",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "yvonne.is.me",
        "time": "6 September, 2022",
        "context": "IF she knew this question was coming, why did she not have a better answer! geesh!!",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "flinters",
        "time": "6 September, 2022",
        "context": "White House Press Secretary Job Qualifications:  Black, gay, female\nThat's it.  Nothing else.  Note the is no requirement for intelligence or competence, hence Jean-Pierre getting the job.",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "laserwiz",
        "time": "6 September, 2022",
        "context": "The Chocolate Sock Puppet doesn't even have the personal integrity to resign after it has become obvious she's incompetent and not qualified to do more than to salt fries at McDonald's.    This woman is clueless.   She's 10,000 million times clueless.",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "hitemp",
        "time": "6 September, 2022",
        "context": "'Voting rights' have NEVER been 'in danger'.  Another FAKE liberal crisis.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "political_pessimist",
        "time": "6 September, 2022",
        "context": "Pretty telling when someone in her position never expects to receive that question from the media.  Dems are that comfortable that their media has their back.  Vote them out.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "deepthinker258",
        "time": "6 September, 2022",
        "context": "Karine Jean-Pierre. The epitome of the Biden Administration.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "984roger",
        "time": "6 September, 2022",
        "context": "You can question the results all you want.  When your supporters riot and break into the Capitol, well then you’ve gone a step too far.",
        "good": "0",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "robertmcd",
        "time": "6 September, 2022",
        "context": "Only Democrats are allowed to claim elections are stolen...gosh",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "moreideas481",
        "time": "6 September, 2022",
        "context": "When KJP responds, all Democrat WH reporters' eyes gloss over as their brains shut down - more.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "uncommonman51273",
        "time": "6 September, 2022",
        "context": "Mentally inferior. She is not worth watching as a representative of this administration.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "C’monMan...",
        "time": "6 September, 2022",
        "context": "Is it raggedy Ann or Andy?! 🤔 we sure are confused these days",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bidensux666969",
        "time": "6 September, 2022",
        "context": "When she says nervously \"I knew this was coming\" what she means is I was afraid this was coming because they didn't give the answer on the index card. ",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Obamawasafraud",
        "time": "6 September, 2022",
        "context": "An equity response instead of an intelligent one ! ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "buckshot789",
        "time": "6 September, 2022",
        "context": "🤡🤡🤡🤡this entire biden administration 🤡🤡🤡🤡",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Jyikes278",
        "time": "6 September, 2022",
        "context": "Definitely a hanging chad...",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "vladrump",
        "time": "7 September, 2022",
        "context": "She would have been wiser to take some time and circle back before she responded to Doocy's question.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "train786",
        "time": "7 September, 2022",
        "context": "Why is the White House keeps putting this child behind the podium everyday?  She totally unqualified and not too bright— why keep punishing her?— that is cruel ",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "beatrice777",
        "time": "6 September, 2022",
        "context": "How many times is she going to say, \"look the president has been very clear on this...\" yeah he's clear all right, no substance, you can see right thru him... ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "callmethebreeze",
        "time": "7 September, 2022",
        "context": "He is deserving of a slow, painful, tortuous death.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "hunterslaptop007",
        "time": "7 September, 2022",
        "context": "“She knew it was coming and still couldn't muster up a decent response.\"\n~ Amber Athey, September 6, 2022\nWhat else did you expect from a member of Biden’s Affirmative Action Administration who has the intelligence of a hamster?",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "daisy-01",
        "time": "7 September, 2022",
        "context": "she is almost as funny as AOC. \nalways good for a laugh.  ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "snafu2021",
        "time": "7 September, 2022",
        "context": "Look it’s Chucky’s Bride. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "thomas37164",
        "time": "7 September, 2022",
        "context": "She gets schooled all the time....But thats ok as Dems accept low standards",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "lojil",
        "time": "7 September, 2022",
        "context": "It’s the “Do as I say not what I do “ syndrome. A large section of Democrats suffer from it and eagerly embrace it because of their “elite superiority ego” Yet Jesus taught to be servants, serve one another, not the citizens serve the Democrat Party. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "CanadianBakin’",
        "time": "7 September, 2022",
        "context": "Uh - no.  She wasn’t “schooled”.  Her answer was good.   Hillary conceded the election that same night and there was a peaceful transition of power.  Trump never conceded, continued to insist it was stolen and helped incite a riot on Capitol Hill.\nJust another phoney hypocrisy pushed by right wing agitators.  Just like she said.",
        "good": "0",
        "bad": "7",
        "replies": []
    },
    {
        "user_name": "endemicpandemic114",
        "time": "6 September, 2022",
        "context": "Jean-Pierre\nBarely there",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "IndieXDem",
        "time": "7 September, 2022",
        "context": "It's just like Democrats who hysterically warned Trump was killing our children because he was pushing for schools to reopen is responsible for school closures! \nYou can't find a single quote from Trunp supporting school closures while their are literally hundreds of quotes from Democrats and dozens of op-ed pieces from the MSM opposing the reopening of schools. \nYet because Trump wanted schools reopened it had to be bad so I guess Trump and Republicans WERE responsible for the continued closures in BLUE STATES because Democrats \"knew\" opening schools had to be bad because that was what Trump wanted! ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "knowthetruthbeforeyoupost",
        "time": "6 September, 2022",
        "context": "I think, she thought we we’re suppose to be impressed, by the fact, that she knew the question was coming. \nRemember, democrats have a low bar.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "TX_Polander",
        "time": "7 September, 2022",
        "context": "She’s terrible at her job..\nHow did she get it? Oh wait, I know🙄",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "WhistleDick88",
        "time": "7 September, 2022",
        "context": "Doocy : Karine, in 2016 you Tweeted the election was stolen because Trump won Explain yourself please.\nKarine : I've been expecting that question from you for a long time. Sooo......uhhhhhh......well you see.....there was.....uhhhhhh. You're a racist. No more questions. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Smitty65",
        "time": "6 September, 2022",
        "context": "It was the best canned answer it could remember to do more lying ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "fedup634",
        "time": "6 September, 2022",
        "context": "You don’t expect her to give the honest answer. It’s different because it makes them look bad if they admit they harbor a double standard. Besides, she hasn’t answered a question since taking the job, why start now. J ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "hdqb13",
        "time": "7 September, 2022",
        "context": "If she ain't lying she ain't trying hard enough.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "leftistnotliberal",
        "time": "7 September, 2022",
        "context": "Everyone who says the cure to recidivism is to lock them up for longer is missing the point.\nFirst off, the US has more people in prison both in total numbers and per capita. There is no country on the planet which has more people locked up than ours, so you can't say we're not tough on crime.\nThe reason that the prison system in the US is bad at rehabilitation is that it doesn't practice rehabilitation.\nIf you look at the countries without a lock them up and throw away the key mentality, their recidivism rates are much lower. The reason is that their prisons are designed for two things: punishment and rehabilitation. American prisons are driven by \"Let's get even!\" instead of \"Let's make this person a functioning member of society.\" Almost anyone who has served time in American prisons will tell you that the only thing they teach you is how to be a better criminal.\nIt's just crazy that people think America is soft on crime... we're a total police state.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "❤️herqueef",
        "time": "7 September, 2022",
        "context": "FrenchBlkLezsbian is in over her dreds'",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "micktroup",
        "time": "6 September, 2022",
        "context": "The reason Trump is a real estate magnate is that he lives RENT FREE in the heads of millions of liberals…",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "betterthanlife",
        "time": "7 September, 2022",
        "context": "Her comments weren't extreme because she's a Democrat. Duh!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Truthseeker904",
        "time": "7 September, 2022",
        "context": "Pay no attention to what the girl behind the podium tweeted in 2016 she is the great and hypocritical Press secretary of the wizard of Corn Pop. ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "boog472",
        "time": "7 September, 2022",
        "context": "They don’t even care anymore how absurd they look, they just keep pushing their agenda.  ",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "truth225",
        "time": "7 September, 2022",
        "context": " And she’s the bright one of the Biden gang. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "californiapoop",
        "time": "7 September, 2022",
        "context": "You can't believe anything that comes out of that snakes slithering tongue.  It convinced Eve to eat of the tree of life and then she betrayed Adam to do the same.  It has turned and twisted the facts of the trueth to mislead the American people.  We were banned from the garden because of the lies and hate it had of gods children, it wants nothing but pain and suffering because it was cast out of gods presence.  ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "❤DEFENDTHEINNOCENT!",
        "time": "7 September, 2022",
        "context": "Amazing - but not in a good way .  🙄",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dealwithreality",
        "time": "7 September, 2022",
        "context": "She is the face of this administration and the Democratic Party.  She is doing a great job of confirming their hypocrisy.  That is the only thing she can do well.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "4dembos",
        "time": "7 September, 2022",
        "context": "Karine Mop Top thinks stolen election claims for republicans vs democrats arr not the same. Just like inflation and high prices aren’t the same she claims. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bucknasty680",
        "time": "7 September, 2022",
        "context": "This is what you end up with when hiring based off equity, versus using meritocracy. She’s in way over her head and most “journalists” are too afraid to call her out about it.  But, she is a POC, a member of the LGBQTIAXYZMF’er, and an immigrant.  The Biden administration wasn’t sure she was qualified because she didn’t sneak across the Southern border, but she impressed them with her lack of any useful knowledge. ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mainewoman",
        "time": "7 September, 2022",
        "context": "You can try to school her all you want, but she is too dim to be educated.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "n0t0nmywatch",
        "time": "7 September, 2022",
        "context": "What was “ridiculous“ was Prissy’s response to Doocy’s question.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rsox312",
        "time": "7 September, 2022",
        "context": "KJP is the second worst affirmative action hire in this Administration...",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "lexus2013",
        "time": "7 September, 2022",
        "context": "Anybody in that position who looks like a 12-year-old playing dress-up can't be taken seriously. ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "justkiddinginmt",
        "time": "7 September, 2022",
        "context": "Doesn’t the White House have any clue as to how bad she is doing?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "CoolhandLuke766",
        "time": "7 September, 2022",
        "context": "She's LOST like all the rest of them, these people are Bad News!",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bluemax309",
        "time": "7 September, 2022",
        "context": "This is what wokeness is all about. I have been woken up by wokeness.  ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sawfingers573",
        "time": "7 September, 2022",
        "context": "\"Oh, I knew this was coming. I was waiting, Peter, for when you were going to ask me that question.\"\nAnd, she responded stupidly ",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "TheMaven",
        "time": "7 September, 2022",
        "context": "Dems hypocrisy has no bounds.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "colkurtz",
        "time": "7 September, 2022",
        "context": "Goofy looking raggedy ann is wall eyed. Looks like a flounder, sounds like a flounder, acts like a flounder….",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "resource1218",
        "time": "7 September, 2022",
        "context": "Here’s a question for her, when is the administration actually going to solve a problem instead of creating them? ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "waltercronkite681",
        "time": "7 September, 2022",
        "context": "She and Affirmative Action programs are a threat to our democracy! I'll give you ten thousand million reasons to back my claim.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "gravelroad",
        "time": "7 September, 2022",
        "context": "You can buy them books and buy them books.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "logicbased",
        "time": "7 September, 2022",
        "context": "She is absolutely perfect. Her being a black, woman, LGBTQ+, ensures that she can NOT be fired for failing in her duties. The duties that can easily be defined with a simple statement:\nSkilled Orator\nAffirmative action decision making at its finest right here. I am excited, and similar to Tucker Carlson's calling out of who Biden's cronies are, I am somewhat relieved that this is the sort of thinker that goes against my beliefs and interests.\nThat and ten thousand million other reasons as well.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "daphnelove",
        "time": "7 September, 2022",
        "context": "she has learned to lie now she has no clue how to tell the truth",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "stevis82",
        "time": "7 September, 2022",
        "context": "The fact that they gave her the job shows how little the Democrats think of the position. It must be basically the WH equivalent to being the ambassador to the Republic of Upper Volta in importance. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sickofnews-8646",
        "time": "7 September, 2022",
        "context": "maybe JP should stop starting every response with oooh gurl.....",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "NYPatriot",
        "time": "7 September, 2022",
        "context": "Miss Scarlett I don’t know nothin about birthing a baby.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dojin808",
        "time": "7 September, 2022",
        "context": "\"Cringe\" Jean Pierre was reamed to say the least.  And to top it off referring nord stream pipeline to \"Nordstrom\"!  What a joke.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "KYTNgirl",
        "time": "7 September, 2022",
        "context": "Bless 💜 her heart…she’s so in over her braids. ",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "whatsamatteru2022",
        "time": "7 September, 2022",
        "context": "And these are the adults...?",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dissatisfieddiner",
        "time": "7 September, 2022",
        "context": "Peter Doocy. Mr. Calm, cool, and collected.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "umiami",
        "time": "7 September, 2022",
        "context": "standard question.... standard answer ....2+2= rain on pluto",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "leftorright",
        "time": "7 September, 2022",
        "context": "2000 election stolen \n2008 racism ends Black President\n2016 fascism back election stolen\n2020 election fair and country United  \nI get that right Dems?",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "americadivideddividedwefall",
        "time": "7 September, 2022",
        "context": "Cmon Man...It's not her fault!  First she belongs to a protected class, and secondly, it's ALWAYS someone else's fault.  In this case Doocy's fault, cmon man!",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "patriot0013",
        "time": "7 September, 2022",
        "context": "Initially I thought this poor woman sounded ridiculous based on who she represents. Now I realize Brandon's administration just hires the lowest people on the Diversity Pole- all the Good Ones are taken.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "selfishly",
        "time": "7 September, 2022",
        "context": "Cute as a Kewpie doll but not a smart. Yet she gets paid $180,000 a year and good benefits. There must be thousands and thousands more like her - people with a large title that do no work - in the government.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "maelific71771",
        "time": "7 September, 2022",
        "context": "KJP EXPOSED! (Mic Drop). ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "radicalcentrist",
        "time": "7 September, 2022",
        "context": "The 2020 election was stolen. There were many and glaring irregularities that were never fully investigated because, in light of the George Floyd riots and other disturbances, many people thought that it would have been too divisive.  Folks like Bill Barr gave the issue a cursory once-over and declared that there was no voter fraud.  The traditional \"aw... shucks!  We'll get you next time!\" sentiment took over, and the whole thing was swept under the rug in the name of national unity.  After Jan. 6, the question became politically toxic, which was why the DNC had people at the Capitol to incite the mob to violence in the first place.  If Trump can be blamed for anything, it was sending his own people into the Democrats' trap.  ",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "truth24-7",
        "time": "7 September, 2022",
        "context": "This woman isn't qualified to be the switchboard operator at the white house much less press secretary.  ",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dallas17",
        "time": "7 September, 2022",
        "context": "This is the best Chief of Staff Ron \"The Hack\" Klain could come up with?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ammomatters!",
        "time": "7 September, 2022",
        "context": "BUCKWHEAT !",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "hbw1944",
        "time": "7 September, 2022",
        "context": "“She’s not bright“ is nearly an apt expression of this nearly brain dead press secretary.\nShe needs to go back to college as a freshman and bone up on her communication skills; skills? What skills?\nThey could sit a dummy on a stool in place of this so  called press secretary and it would do an equally effective job!  ",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "neptunesteel",
        "time": "7 September, 2022",
        "context": "If she was a stripper I would tip her $5.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "GWaz",
        "time": "7 September, 2022",
        "context": "I'm surprised she just didn't try the old Peppermint Patty trick and say, \"I'll have to circle back to you on that.\"",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "yerkiddin",
        "time": "7 September, 2022",
        "context": "It doesn't matter anymore.  For the next 50 years at least there will be nothing but screeching and race-baiting and bureaucracy-backed conspiracy investigations every time a Republican wins anything.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mikey707",
        "time": "7 September, 2022",
        "context": "Does Brandon surround himself with any smart ppl? ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mabbam980",
        "time": "7 September, 2022",
        "context": "If this woman’s press briefings were treated in the same manner as are contestants on AMERICA’s GOT TALENT there would be 4 buzzers going off simultaneously.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "debtisachoice",
        "time": "7 September, 2022",
        "context": "\"Jean-Pierre schooled online after ‘bad answer’ to Doocy’s question about her own ‘stolen election’ rhetoric\"\nThis whole Democrat party is a embarrassment ",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "iiipct",
        "time": "7 September, 2022",
        "context": "Hands down, the most incompetent one that's ever held this position.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mullamike647",
        "time": "7 September, 2022",
        "context": "The Press Secretary's hypocrisy is so brazen that it's laughable. No where in any of her tweets during this period did she say a word about voter rights, just spewed hatred at the voters that thought Stacy was NOT the best candidate for the state of Georgia. Double standard much!!!!",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "MUX",
        "time": "7 September, 2022",
        "context": "She looks like little orphan Annie after a day in the coal mine",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "averagejoecitizen",
        "time": "7 September, 2022",
        "context": "There's only ONE reason she got that job.... Time to tell the truth.. a box was checked off...",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jjcoolbreeze2020",
        "time": "7 September, 2022",
        "context": "She checks a lot of Liberal Boxes but NOT the Intelligent Box.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "donnie377",
        "time": "7 September, 2022",
        "context": "Wow, and the liberal media lets her get away with that answer.  This is why's Brandon's approval rating is at 38%, how is it even this high? A: Liberals, just vote party lines regardless.\nWe have a recession and inflation is crushing most Americans.  How do you spin this?  Inject more Build Back Broker money and give undeserving students loan forgiveness?  Why isn't everyone not screaming?  GOP, needs to step up. Do what these Libs have been doing for years, Distract, Deflect, Lie, and blame everything on the other party! Wake up people!",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "titanictwenties",
        "time": "7 September, 2022",
        "context": "Uppity.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "grimreaper598",
        "time": "7 September, 2022",
        "context": "I hate to admit this but watching her and the Biden administrations “adult children” try to answer questions is entertaining to the extent that we expect the answers to be 180 from reality and truth.  \nWhat is wrong with this is that they are so inept and eager to ignore facts.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dejavoo",
        "time": "7 September, 2022",
        "context": "Affirmative action needs to stop.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "therowdyref",
        "time": "7 September, 2022",
        "context": "People on here complaining about a \"double standard\" from the Left. \"Democrat good, Republican evil\" is only ONE standard....\n[sips more Kool-Aid]",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "grtamerhero22",
        "time": "7 September, 2022",
        "context": "Brillo face isn’t bright.\nThat’s obvious.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "makesnosense262",
        "time": "7 September, 2022",
        "context": "I have nothing against GROOT but the more she tries to be smart  the less she is..The Peter Principle... move on and write some children's books. she is WAY OUT of her league..",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jamiec",
        "time": "7 September, 2022",
        "context": "Yea? Well...racist!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "CVA-61",
        "time": "7 September, 2022",
        "context": "Another diversity appointment who can't answer simple questions.  Another FAILURE from the Slurin JO administration.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "TheDiscerningElephant",
        "time": "7 September, 2022",
        "context": "Her response was entitled and pedantic, in the same breath.  Made about as much sense as a parachute on a helicopter.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "flyoverred",
        "time": "7 September, 2022",
        "context": "Peter Doocy appears to be the only journalist in the room.  However, he's too respectful to that joke of a press secretary.  He needs to go full Jim Acosta or Sam Donaldson and get her rattled.",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "omeomi",
        "time": "7 September, 2022",
        "context": "She knew the question was 'coming' - because she knows what she said.   She calls it 'ridiciulous' because some dems will still do exactly what the biden gang tells them to do. Other dems - and even a few dems in the media - are beginning to stray outside the 'party lines'",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "saveamerica629",
        "time": "7 September, 2022",
        "context": "Democrats do not understand that word hypocrisy. They think it’s a word reserved for Conservatives.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "SMHintheUS",
        "time": "7 September, 2022",
        "context": "Double-standard by a Democrat.   Nothing new to see here....",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "blumax66",
        "time": "7 September, 2022",
        "context": "The real president, Trump, haunts the democrats dreams, he is their boogeyman and they imagine him around every corner. They claim they're not afraid of running  against him but spend every waking moment trying to bring him down so they don't have to. Every moment they spend on Trump means they aren't focusing on DeSantis. ",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "surgprotector297",
        "time": "7 September, 2022",
        "context": "Doocey dropped a deuce...on the muppet with no brain 🤣",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "instantnoodle",
        "time": "7 September, 2022",
        "context": "this muppet is nothing short of a prop :/",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "deepceev758",
        "time": "7 September, 2022",
        "context": "JP employs the DNC's \"voter suppression\" hoax to draw an imaginary difference between her rejection of election results and those related to the 2020 election.\nWaPo Fact-Checkers Slam Biden for Georgia Election Law Claims: ‘Four Pinocchios’  for his comments including “Jim Crow in the 21st Century” (Yahoo news, 31Mar21) \n\"Voting is surging in Georgia despite controversial new election law,\" The Post reported that early voting in Georgia was seeing its largest turnout ever, laying waste to its own claims, as well as those of Democrats and other left-wing figures. (WAPO, 21May22)",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bythec",
        "time": "7 September, 2022",
        "context": "She's been Dooced again!",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "think_clearly",
        "time": "7 September, 2022",
        "context": "When you say \"I knew this was coming\", you know you are in the wrong!",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "zackjon",
        "time": "7 September, 2022",
        "context": "Democrats:  It is egregious criminality, anti-democratic and insurrectionist to question the results of an election...unless we do it.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "stba",
        "time": "7 September, 2022",
        "context": "To go along with the worst president in US hisory we also have the worst press secretary in US history.....",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "grtamerhero22",
        "time": "7 September, 2022",
        "context": "How could Karine Jean Pierre be expected to remember anything? She goes face first through a meat grinder every morning. ",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jerry_l",
        "time": "7 September, 2022",
        "context": "If Trump said the sun would rise tomorrow, the Dems would villify him, call him a witch for thinking he could predict the future. If Biden said the sun would rise tomorrow, the Dems would call him a prophet and build statues to him.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "truthhasfallen208",
        "time": "7 September, 2022",
        "context": "\"She's not bright.\" This a statement that sums up a majority of leftists.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "🎸gibsonguitar🎸👍",
        "time": "7 September, 2022",
        "context": "\"If she knew this question was coming, you would think she would have a better answer prepared,\"\nHOW ABOUT, SHE SHOULD HAVE JUST DELETED IT. SHOWS HOW S_U_ID SHE IS...\nBOX CHECKER, ALL THE RIGHT BOXES'S WERE CHECKED HENCE WHY SHE IS THERE, PERIOD.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "haywoodjadomy",
        "time": "7 September, 2022",
        "context": "Yet no evidence that any voter rights were in danger, in Georgia or any other state. ",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "docbill",
        "time": "7 September, 2022",
        "context": "If a republican win voting rights are in danger.  If a democrat wins, not so much.  Got it!",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "kiester1",
        "time": "7 September, 2022",
        "context": "open mouth, insert foot.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "daved63187",
        "time": "7 September, 2022",
        "context": "2020 Election Results from Federal Election Commission website\n81,268,924 Voted for Biden\n74,216,154 Voted for Trump\n2,898,325 Voted for Other Candidates Combined\n158,383,403 TOTAL Votes Cast in 2020 Election with a voter turnout of 66.8% of voting age people.\n158,383,403 votes divided by 66.8% = 237,100,903 voting age people. According to the 2020 US Census there were 231.593 million +/-1,000 people of voting age which exceeds the number of people who where of voting age in the 2020 US Census by 5,507,903 people.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "Oceanswimmer",
        "time": "7 September, 2022",
        "context": "She gave the perfect  answer, she played the race card . ",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "floorida",
        "time": "7 September, 2022",
        "context": "They might as well put the scarecrow from the wizard of Oz at the podium. Probably get better answers. ",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cmwyo",
        "time": "7 September, 2022",
        "context": "She really is doing the best she can!!!     The fact that she's no good at the job is because she filled the square, not because she was found to have merit.  She's a perfect poster-child for this administration and how they handle everything.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Proud_Deploreable_Forever",
        "time": "7 September, 2022",
        "context": "Incompetence. It's what you get when you go with the Affirmative Action hire... ",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "joright",
        "time": "7 September, 2022",
        "context": "Why should she prepare? She could get up there and speak in an incomprehensible dead language and still get a positive review from most reporters.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "psychoannie2",
        "time": "7 September, 2022",
        "context": "Since she  has been \"waiting\" for that question, she should have had an answer.  Since she \"knows\" what is coming, does she  know she is highly replaceable?  Biden's new theme song:  SEND IN THE CLOWNS",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "WillSon",
        "time": "7 September, 2022",
        "context": "she gave a 13% answer....meaning irrational",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Not-Russian-Disinformation",
        "time": "7 September, 2022",
        "context": "Side Show Bob checks all the boxes but one.... Intelligence.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bidensniffedme745",
        "time": "7 September, 2022",
        "context": "She is the flag bearer of competence we have all come to expect from the Biden Administration, from him on down.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "beenaroundthehorn",
        "time": "7 September, 2022",
        "context": "My mom had a dust mop when I was growing up that looked remarkably similar to her hair.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "4dembos",
        "time": "7 September, 2022",
        "context": "Karine Has Juan’s PeeOnHerHair Lives in a Chop Zone. She doesn’t see anything wrong with Biden’s Human Trafficking Children In From Mexico. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "aamerican77",
        "time": "7 September, 2022",
        "context": "HYPOCRISY ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "MacPappy",
        "time": "7 September, 2022",
        "context": "Trans-Buckwheat is a hoot. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "s.mack",
        "time": "7 September, 2022",
        "context": "Okay, I get it, Jean-Pierre got the job because she checked two very important blocks - Woman, Black. How about checking that third and most important block - Qualified?\nWho cares if she's a black woman (which is ironic in and of itself since she can't define what a woman is) but at least hire a black woman that is qualified and doesn't have to consult notes every single time someone asks her a question. \nPsaki was a liar and fraud, but at least she could think on her feet. ",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sal049",
        "time": "7 September, 2022",
        "context": "I really do not understand the intense hate of some Democrats or anyone for that matter.  If you look at people that have such contempt and hatred inside of them they look old, tired and mean & crave attention. It truly effects them physically.  What truly matters is what you do now is going to count towards where you end up when you die.    Yikes!!!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bustersouth",
        "time": "7 September, 2022",
        "context": "Let's just mail out ballots and see what comes back---LOL",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "bidensniffedme745",
        "time": "7 September, 2022",
        "context": "I wonder if Democrat voters are happy or embarrassed that she is their press secretary?",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "quietbear002",
        "time": "7 September, 2022",
        "context": "It's just another democrat showing the double standard that democrats use.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "surfsider",
        "time": "7 September, 2022",
        "context": "Article reads 90% fox trying to say denying election results is wrong...\nsorta like a national network calling an election before polls close.\nBut, they were not in on it...nope, not at all",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "poisonous507",
        "time": "9 September, 2022",
        "context": "Like Hillary, even when she knows the questions ahead of time, she is unable to give a clear answer believable answer. She would have done better by answering, \"How dare you\"!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "usmc1811m48m60",
        "time": "9 September, 2022",
        "context": "BLM being BLM.\nYou can take BLM out of the jungle. But you can not take the Jungle out of BLM.\nEnough said.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "edflorida2",
        "time": "9 September, 2022",
        "context": "Moppet's clueless but at least not as hideous as the Alien Psucki. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "freeze1617",
        "time": "9 September, 2022",
        "context": "Lets be real the 2020 election was stolen. There is no doubt about it and democrats want that shut down ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "p3mode685",
        "time": "8 September, 2022",
        "context": "Have to give her credit for trying. Making sense of biden, no one has succeeded yet.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bydam",
        "time": "9 September, 2022",
        "context": "The press is not being fair to Bruh Bidens 3 boxes checked press secretary. They axes her all de hard quextions.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "twistedsisteristhegreatestbandever!",
        "time": "8 September, 2022",
        "context": "Disputing the election result is an American national pastime. It has happened every election I can remember since Reagan. As we  have seen, it went on for 4 years during Trumps term. \nBut this time, after \"the most fair and transparent election in history\", in which the bloke who struggled to fill a phone box at his conventions got more votes than any other president in  history, you're labeled a domestic terrorist if you dispute the result.\nYeah, sounds legit.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tobydog",
        "time": "8 September, 2022",
        "context": "she would have been better off just saying yes I did say that but I feel different now. Not a good answer but better than what she said in the interview",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "lira952",
        "time": "9 September, 2022",
        "context": "Geez, does she apply her makeup in the dark?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jrup1986",
        "time": "8 September, 2022",
        "context": "It took them 5 days to print off all those fake ballotsand fill them out. Hopefully everyone involved will have their entire blood lines ended. Children wives neices everyone ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "pauljpace904",
        "time": "9 September, 2022",
        "context": "This lady is so over her head not to mention a clown.  She stands up there reading from her binder and when asked questions that she can't answer she says it's a ridiculous question or she states I am not going to answer it.....kinda like her boss.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tradertom",
        "time": "9 September, 2022",
        "context": "It was obvious that the Russians created Trump's 2016 win.  His margin was so small that ANY help could have created it.  And the Russians helped a lot - stealing emails and doing a social media attack in several battle ground states.\nIt was done by a computer unit of the Russian military  A bunch of them were indicted by the US - but never tried because they are in Russia.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "silencedogood1001409",
        "time": "9 September, 2022",
        "context": "She didn't have a good answer because there is no good answer.  Hard to come back on the truth.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sleepyamerica",
        "time": "8 September, 2022",
        "context": "This is what you get when the Whitehouse decides to treat the office of Press Secretary as an affirmative action program. Trans Howdy Doody was a train wreck. The current spokespuppet makes THD look like a bloody genius! How much lower will the Brandon administration have to go to get the NEXT spokespuppet??",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mij",
        "time": "9 September, 2022",
        "context": "So by her words \"voting rights\" are now\" not\" in danger today. Good.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "happyamerican276",
        "time": "9 September, 2022",
        "context": "Ms Pierre is beyond a joke....a very sad joke in the White House setting.  We all get it, the Press Secretary has always been the position to carry the water for the President, but she is beyond dazed and confused.   I can't watch her as she is so out of her league it isn't even funny. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "usa#1secondtonone",
        "time": "8 September, 2022",
        "context": "She claimed there wasn't a border crisis yet her own Dems in Chicago NYC and DC are crying border crisis",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ya..right!",
        "time": "9 September, 2022",
        "context": "Side Show Bobbette is a clueless stooge for the plugs admin and obviously was awarded her position via nepotism. Ya see, she's plug's out-of-wedlock illegitimate child when he owned slaves back in 1860...",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "attiwkramz",
        "time": "8 September, 2022",
        "context": "If she expected the question, then why didn’t she have a better answer?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "usmc1811m48m60",
        "time": "9 September, 2022",
        "context": "325 mil population in the USA and the BLM are14% of it.\nAnd BLM are 13% of the USA's problems today.\nYep, BLM is being BLM.\nNothing to see here, move along now.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "freeze1617",
        "time": "9 September, 2022",
        "context": "Stolen emails, stolen drone, stolen election …..welcome to the world of #unpresidented Trump.\nReminder: Brian Kemp stole the gubernatorial election from Georgians and Stacy Abrams.......\n that was about voting rights?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "likefrieswiththat",
        "time": "9 September, 2022",
        "context": "It's cute, that perpetually confused look and 6th grade intellect.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "claymore1969",
        "time": "8 September, 2022",
        "context": "That's what you get with diversity, inclusion and equity or D.I.E.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "usmc1811m48m60",
        "time": "9 September, 2022",
        "context": "No matter what title a BLM has, it is still a BLM.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Kahless_the_unforgettable",
        "time": "9 September, 2022",
        "context": "Has anyone asked Stacy Abrahams this question? I keep hearing from Democrats that it's unAmerican to question election results but none of them seem to come down on Abrahams, who has questioned the gubernatiorial election in Georgia for years. And why have Democrats questioned nearly all major elections won by Republicans? Seems hypocritical to me they label Republicans as unAmerican for questioning 2020 but they do it nearly every time a Republican wins a major election.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mymothersdaughter048",
        "time": "8 September, 2022",
        "context": "KJP is the new \"Gaslight Queen\".  Psaki passed the crown to her when she left the White House.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "JDog39",
        "time": "8 September, 2022",
        "context": "Let's see,\nas press secretary, Karine checks most of the boxes:\nFemale - check\nBlack - check\nGay - check\nCompetent - well...........",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "lori99",
        "time": "8 September, 2022",
        "context": "The people who are mocking the fact that this woman did not have a good answer have totally missed the point, imo. First, there really is no good answer. Second, more importantly, though, she doesn't need a good answer. No other reporter is going to follow up on this issue. The only two reporters who do ask the hard questions have 500 other such questions, so they can't return to this particular topic. And no other media outlets covered it. It wasn't on my local news. It wasn't in the newspapers around here. The whole topic will now disappear. \nShe didn't need a good answer because the media covers up for this administration.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sboroman",
        "time": "8 September, 2022",
        "context": "I wonder if she could do her job if she was only allowed to tell the truth.  I mean, she can barely do her job now!!!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "everydayguy37",
        "time": "8 September, 2022",
        "context": "I was speaking at the time because Democrats lost. In 2020 they won so it's totally different. ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jackwick",
        "time": "8 September, 2022",
        "context": "If she wasn’t supporting the stereotype of blacks being intellectually inferior she would be mildly amusing.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "snorkelbob",
        "time": "8 September, 2022",
        "context": "The Internet is forever.  You can't un-say what you said.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Bidenflationnation",
        "time": "8 September, 2022",
        "context": "This lady is proving something I never really subscribed too but clearly whites are the superior race.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "trafgod",
        "time": "8 September, 2022",
        "context": "Why does she look like raggedy Ann? When she opens her mouth all I hear is a 6th grader trying to explain quantum physics to a kindergarten class.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "HomeoftheBills",
        "time": "8 September, 2022",
        "context": "Funny that they whole country know that the democrats cheated especially after they found out they made a movie that showed pictures of the same people voting at many different drop off boxes and stuffing the boxes with many illegals' ballots.\nMany were done after midnight hours and desks at voting sites stacked with ballots brought in after hours. All votes for Biden",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "lummox51",
        "time": "8 September, 2022",
        "context": "  Jean-Pierre Cabbage-Patch",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "layback",
        "time": "8 September, 2022",
        "context": "CNN currently has a YouTube video of a voting machine that was stolen, the sold by Goodwill, the resold and now is a part of an investigation.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "totallycereal",
        "time": "8 September, 2022",
        "context": "She is sharp as a bowling ball and twice as dense.........",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "moderateconservative558",
        "time": "8 September, 2022",
        "context": "She looks like Buckwheat's grandchild. Why would anyone take \"miss thang\" serious...",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "imrational",
        "time": "8 September, 2022",
        "context": "Time and time again, The Dems/liberals revert to their core principle of hypocrisy. It is inherent in their being, part of their DNA.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Dogman123!",
        "time": "8 September, 2022",
        "context": "Her head looks like one of those Spinning Floor Mops.  They should just call it \"The Pierre\"!!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Muccapazza",
        "time": "8 September, 2022",
        "context": "She is not very bright unfortunately!",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "AndrewIrishman",
        "time": "8 September, 2022",
        "context": "Complaining about elections is only a problem for Republicans. Democrats like Al Gore, Hillary Clinton, or Stacy Abrams can complain all day long. Same with rioting. Hundreds of riots during 2020 alone. One Republican riot in all history.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "honorthefallen710",
        "time": "8 September, 2022",
        "context": "This  is what happens when you value optics over intellect...... ",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "davesop2865",
        "time": "8 September, 2022",
        "context": "She is cute...but so is a baby rattlesnake.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "OptedOut",
        "time": "8 September, 2022",
        "context": "The most disturbing thing about this woman is that she has not yet attained her level of greatest incompetence. She is still on the lower end of the Peter Principle scale. ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "happyrep88",
        "time": "8 September, 2022",
        "context": "Seriously, she is the most unqualified Affirmative Action token ever!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Sentarco",
        "time": "8 September, 2022",
        "context": "The last thing Pierre expected was to go through kindergarten at the White House.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "libocracyishypocrisy",
        "time": "8 September, 2022",
        "context": "What she meant was it is ridiculous to question a Democrats double standard...",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "al42929",
        "time": "8 September, 2022",
        "context": "Poor little Jean-Pierre, she has no idea what she is doing or saying. I guess that is probably OK because she represents Biden who is mentally even more challenged.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "WhoKnew648",
        "time": "8 September, 2022",
        "context": "The question I have is “Who does your hair?”",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "1shipbound",
        "time": "8 September, 2022",
        "context": "She subsequently called the reporter’s comparison \"ridiculous\" and gave a long response about how her tweets were different because they were advocating for \"voting rights,\" which, she added, were \"in danger\" at the time. But she did not say that, did she? Her statement was that 2016 and Georgia's gubernatorial election were stolen which is no different than what Trump said.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "88888615",
        "time": "7 September, 2022",
        "context": "When she bobs her head 20 times per minute while answering = lying!   ",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Bulljr538",
        "time": "8 September, 2022",
        "context": "She whipped up another lie typical of liberals......\nLook,  I am not ashamed to say the 2020 election was stolen because it was.  \nWhen I get to heaven (not that it will matter) but I am going to ask God who really legitimately won the 2020 election?  I mean how many ballots were really real?  Then I will ask, why did you allow it to happen? Perhaps, he will say well kind of like when we let the children of Israel fall into captivity to Egypt - so they would pray and cry out to us for help once again.  I wanted you to know what it would be like to be led by a godless, corrupt, evil man and that perhaps as a country you would turn from your own evil ways of accepting that it was okay to allow the unborn to be slaughtered, to allow and accept that it was okay for a man to lie with another man, to accept that it was okay for one group of people to burn down cities with death and destruction but no okay for a small group to storm your capital and demand accountability for their governance.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "gbsmith",
        "time": "8 September, 2022",
        "context": "Progs just love to lie.  ",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Downrange553",
        "time": "8 September, 2022",
        "context": "A twenty-first century phenomenon is at work in the DOJ, FBI, and the Democratic party. Former President Trump continues to live rent free in the minds of those who are in the respective agencies and party.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Downrange553",
        "time": "8 September, 2022",
        "context": "I do not give any credence to this child of darkness, lies and misinformation neither should anyone else. Her boss in the White House has never been right about anything. He is all wrong about Trump's supporters being a threat to Democracy. Trump Supporters are the most patriotic people on the planet and are certainty a threat to Biden's Marxists ideology and its destructive agenda.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "billw58",
        "time": "8 September, 2022",
        "context": "better get involved in election integrity, they will rigg this one as well if they can...\nthe FBI DOJ and democratic party will be working hard to make sure your vote doesn't count.. including lying to FISA judges and manufacturing evidence ",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "carseni",
        "time": "8 September, 2022",
        "context": "She needs to leave the White House and work at Waffle House.   ",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "usafreedom080",
        "time": "8 September, 2022",
        "context": "Socialist-Democrats- Think They Can Do Virtually Anything! Like DIRECT The FBI To MONITOR PARENTS ACROSS The United States! Totalitarian Dictatorship Tactic! NO More Free Passes! When it Makes Sense Challenge Them! VOTE- REMOVE These People From Office VOTE!",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mc512tr",
        "time": "8 September, 2022",
        "context": "Yes, everyone knew it was coming, and everyone knew you don’t have answer for it, you affirmative hire bum! ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "LoKath",
        "time": "8 September, 2022",
        "context": "She is a laughing stock",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "inspector2",
        "time": "7 September, 2022",
        "context": "They just pull the string in her back, and she spouts one of eleven different responses.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dumpalldemocrats2022",
        "time": "8 September, 2022",
        "context": "This administration, fronted by Biden but commandeered by Obama, is the most corrupt, dishonest and failed in our great country's history.  The people involved with this administration all need to be arrested, prosecuted and punished to the full extent that our constitution allows.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ThisMessageViolatesCommunityStandards",
        "time": "8 September, 2022",
        "context": "This country would be about 10% misguided democrat if the media didn't run interference for democrats and their lies.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "boyd's.corner",
        "time": "8 September, 2022",
        "context": "I thought word salads were a Kamala thing?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "alvinsr.",
        "time": "7 September, 2022",
        "context": "More schiff from bubble head jean-pierre.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "PatriotRider",
        "time": "7 September, 2022",
        "context": "Every time I see her, I wonder when did Ronald McDonald get married?",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rabcarlsbad",
        "time": "8 September, 2022",
        "context": "You just don't understand, it is extreme when conservatives do it, it is admirable and just when liberals do it. There does that explain it better?",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "thegreatunwashed164",
        "time": "8 September, 2022",
        "context": "Karine Jean-Pierre is rising to the same level of competence as the rest of the Biden Administration displays.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "blackliesmatter01",
        "time": "8 September, 2022",
        "context": "once again, she was allowed to sidestep with her response. stop playing pattycake and light a fire under this administration.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "alwaysdowhatsright158",
        "time": "8 September, 2022",
        "context": "This is who you get when you have to check all the boxes. Female , Gay  , College Degree  , Liberal  ,  Instead of who is the best candidate. ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dimndimer",
        "time": "8 September, 2022",
        "context": "Where did she get her chia pet wig?",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Orion_Starr",
        "time": "7 September, 2022",
        "context": "Not a very bright Raggety-Ann",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "7gus",
        "time": "7 September, 2022",
        "context": "LETS'S BE CLEAR.    Hahahahahahahahahahahahaha.    ",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sargejohn362",
        "time": "7 September, 2022",
        "context": "She's just another far left radical just like the majority of Biden's administration, the DC FBI and DOJ.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "maxheadroom326",
        "time": "7 September, 2022",
        "context": "If we do it,  its \"ridiculous\" to even point out;  but if you do it,, its a threat to democracy. \nRiiiiiiight...",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "squatching",
        "time": "7 September, 2022",
        "context": "Diversity Hire.  KJP always seems like a child to me.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "InquisitorMkoll",
        "time": "7 September, 2022",
        "context": "One way for me, another for thee.  That's the liberal way.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "FINN319",
        "time": "7 September, 2022",
        "context": "Just a used q-tip. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bertrambig2021",
        "time": "7 September, 2022",
        "context": "What is ridiculous is anyone thinking this Biden regime is in any way legit",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "smooth-1",
        "time": "7 September, 2022",
        "context": "Did she just circle back on doocy?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mwr60455",
        "time": "7 September, 2022",
        "context": "Where do these people come from ?  Totally inept.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "shitstainbidump",
        "time": "7 September, 2022",
        "context": "Hypocrisy at its finest.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "del20",
        "time": "7 September, 2022",
        "context": "Is there any intelligent person in the Biden administration at all? Or that knows what they are doing?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "snapdragonfly",
        "time": "7 September, 2022",
        "context": "She had EVERY qualification.  She is black and she is a woman....period.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "zeroone114",
        "time": "7 September, 2022",
        "context": "As ridiculous as the people she makes excuses for. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "datruff693",
        "time": "7 September, 2022",
        "context": "there surely will be some type of conflict and likely a civil war as a lot on the left and a few on the right refuse to see anything but what they want despite evidence. Whatever pushes my agenda and what i think is the norm.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "markk.",
        "time": "7 September, 2022",
        "context": "The democrats have been screaming about stolen elections all the way back to the \"hanging chads\" in 2000.... Then, where there is actually an election with obvious irregularities like we saw in 2020, they claim it's all a conspiracy theory. Rich. ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "reddr@gon",
        "time": "7 September, 2022",
        "context": "Let's be honest, if the left didn't have double standards, they'd be left with no standards at all.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "bayoujoe222",
        "time": "7 September, 2022",
        "context": "They tell you the questions in the test, and flunk it! ? low IQ",
        "good": "3",
        "bad": "0",
        "replies": []
    }
]