[
    {
        "user_name": "WeForgetForYouRetail🧠",
        "time": "2 May, 2021",
        "context": "Safe splashdown!  I remember Apollo 8.  The reading from Genesis was epic.",
        "good": "154",
        "bad": "5",
        "replies": [
            {
                "error": "error"
            }
        ]
    },
    {
        "user_name": "tyredcynic",
        "time": "2 May, 2021",
        "context": "Sure is nice of Elon Musk to provide America with a space program, since our government is too busy funding welfare, gender reassignments and hatred against anyone who has been successful in life.",
        "good": "452",
        "bad": "16",
        "replies": [
            {
                "user_name": "gabe_the_goober",
                "time": "2 May, 2021",
                "context": "The government defunded NASA long ago, doesn't have much to do with current politics. I think this is proof that private industry is way better at innovating than the government is.",
                "good": "70",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "GreenPaw",
                        "time": "2 May, 2021",
                        "context": "They want to go to Mars but we are going to space the same way we did in the 6Os.  Except for a couple of new toys.",
                        "good": "0",
                        "bad": "16",
                        "replies": [
                            {
                                "user_name": "gabe_the_goober",
                                "time": "2 May, 2021",
                                "context": "You are woefully uninformed. They are planning on building a base/launch platform on the moon. The ideas the guys are coming up with are very different than the 60's. Just because we are goin to the ISS the same way doesn't mean new endeavors will be the same. The ISS is old so we have to conform new tech to interface with the ISS. \n\nEducate yourself.",
                                "good": "12",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "user_name": "Bidenmademillionsin2021whileyoustruggle",
                        "time": "2 May, 2021",
                        "context": "Let russia or china build a station on the moon , watch how fast the USA government suddenly does a 180 on funding NASA",
                        "good": "7",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "alexjonesisright",
                        "time": "2 May, 2021",
                        "context": "there is that saying\nIF YOU WANT SOMETHING TO FAIL\nPUT THE GOVT IN CHARGE OF IT",
                        "good": "10",
                        "bad": "1",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "🇺🇲🦅🇺🇲ibeme🇺🇲🦅🇺🇲",
                "time": "2 May, 2021",
                "context": "maybe joe will volunteer for the next flight, being the nice guy that he is and all!!",
                "good": "37",
                "bad": "6",
                "replies": [
                    {
                        "user_name": "strokermotor",
                        "time": "2 May, 2021",
                        "context": "Reminds me of the old show Lost In Space",
                        "good": "7",
                        "bad": "2",
                        "replies": []
                    },
                    {
                        "user_name": "alexjonesisright",
                        "time": "2 May, 2021",
                        "context": "they just made a space cadet head of the SPACE FORCE",
                        "good": "8",
                        "bad": "1",
                        "replies": []
                    },
                    {
                        "user_name": "alexjonesisright",
                        "time": "2 May, 2021",
                        "context": "JOE IS GOING TO THE U K IN JUNE\nHARRIS AND PELOSIE WILL SEIZE POWER THEN",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "dataengineer",
                        "time": "2 May, 2021",
                        "context": "hahaha....I can envision it....they splashdown.....'hey, there's an empty seat...where's joe?'....'OMG, we left him up there!' ",
                        "good": "3",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "reaper163",
                                "time": "2 May, 2021",
                                "context": "Tease.",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "GreenPaw",
        "time": "2 May, 2021",
        "context": "Four astronauts head home from the ISS abord SpaceX's capsule.  There I fixed it for you FOX.",
        "good": "16",
        "bad": "4",
        "replies": [
            {
                "user_name": "WeForgetForYouRetail🧠",
                "time": "2 May, 2021",
                "context": "aboard",
                "good": "23",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "beerme1",
                        "time": "2 May, 2021",
                        "context": "LOL",
                        "good": "5",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "¥?#*!",
                        "time": "2 May, 2021",
                        "context": "Funny",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "thewiserman",
        "time": "2 May, 2021",
        "context": "Watching it now on TV.",
        "good": "10",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "trainman54",
        "time": "2 May, 2021",
        "context": "A century from now, Musk will be described as the true Henry Ford of space travel - a private citizen with a private company doing for human technological civilization what Ford did for mechanical transportation.  Right now he is criticized left and right but someday in the not too distant future, a young child resident on the Moon, Mars or perhaps in an orbiting station will learn in his school lessons about Musk- that will be the true measure of the man!!!!!",
        "good": "248",
        "bad": "4",
        "replies": [
            {
                "user_name": "theburp",
                "time": "2 May, 2021",
                "context": "I can only wonder by the USA and NASA are spending billions to develop something that SpaceX already has, and it works.",
                "good": "22",
                "bad": "7",
                "replies": [
                    {
                        "user_name": "joleenworden810",
                        "time": "2 May, 2021",
                        "context": "Dear me, where have you been since 1959 when NASA and the USA began developing space travel?  Yes we spent $ billions long before Space X existed.  Space X has only been around for the last 20 years, and it has built upon the knowledge base of the last 50 years at NASA.  It did not evolve out of thin air.",
                        "good": "16",
                        "bad": "5",
                        "replies": [
                            {
                                "user_name": "theburp",
                                "time": "2 May, 2021",
                                "context": "Yet SpaceX did it in a few years, and NASA is still working on it.  No one denies what NASA has done over the years, after all I did live through it.   SpaceX has a working delivery system, so why waste the money on designing another system that does the same thing, spend the money to go to Mars.",
                                "good": "10",
                                "bad": "3",
                                "replies": [
                                    {
                                        "user_name": "texdefender",
                                        "time": "2 May, 2021",
                                        "context": "NASA and SpaceX have to very different goals.  SpaceX is handling earth to orbit and maybe to the moon.  NASA is to Mars, it two different things, and requires different tech.",
                                        "good": "2",
                                        "bad": "2",
                                        "replies": [
                                            {
                                                "user_name": "theburp",
                                                "time": "2 May, 2021",
                                                "context": "Musk says they will go to Mars in just a few years",
                                                "good": "2",
                                                "bad": "1",
                                                "replies": [
                                                    {
                                                        "user_name": "texdefender",
                                                        "time": "3 May, 2021",
                                                        "context": "Saying and doing are two different things.  And I highly doubt it will be done without NASA and Space Force Assets.",
                                                        "good": "0",
                                                        "bad": "0",
                                                        "replies": [
                                                            {
                                                                "user_name": "theburp",
                                                                "time": "3 May, 2021",
                                                                "context": "That is exactly the point I'm trying to make, why not have NASA and SpaceX work together?  It would save money and get it done quicker.  NASA is spending billions on a launch vehicle when SpaceX has one, and another company almost has one.",
                                                                "good": "0",
                                                                "bad": "0",
                                                                "replies": [
                                                                    {
                                                                        "user_name": "texdefender",
                                                                        "time": "4 May, 2021",
                                                                        "context": "I think you really need to do more research.",
                                                                        "good": "0",
                                                                        "bad": "0",
                                                                        "replies": []
                                                                    }
                                                                ]
                                                            }
                                                        ]
                                                    }
                                                ]
                                            },
                                            {
                                                "user_name": "theburp",
                                                "time": "2 May, 2021",
                                                "context": "Musk has publicly stated that SpaceX will have a man on Mars by 2026.",
                                                "good": "0",
                                                "bad": "0",
                                                "replies": []
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "JackMeoff®",
                "time": "2 May, 2021",
                "context": "What..he's the 21st century version of Howard Hughes??",
                "good": "1",
                "bad": "9",
                "replies": []
            },
            {
                "user_name": "granpab",
                "time": "2 May, 2021",
                "context": "Elon is a refreshing reminder of the type of visionary men who made America great by just doing what most people thought were impossible.",
                "good": "40",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "obozzo",
                        "time": "2 May, 2021",
                        "context": "A Henry Ford Quote to live by \"Whether I think I can, or whether I think I can't, I'm right\"",
                        "good": "2",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "franklinleibell",
                "time": "2 May, 2021",
                "context": "\"It is not the critic who counts; not the man who points out how the strong man stumbles, or where the doer of deeds could have done them better. The credit belongs to the man who is actually in the arena, whose face is marred by dust and sweat and blood; who strives valiantly; who errs, who comes short again and again, because there is no effort without error and shortcoming; but who does actually strive to do the deeds; who knows great enthusiasms, the great devotions; who spends himself in a worthy cause; who at the best knows in the end the triumph of high achievement, and who at the worst, if he fails, at least fails while daring greatly, so that his place shall never be with those cold and timid souls who neither know victory nor defeat.\" Theodore Roosevelt \"Citizen in a Republic\" speech at the Sorbonne, Paris, 23 April 1910",
                "good": "47",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "NJBChicago",
                "time": "2 May, 2021",
                "context": "Musk is way more than Howard Hughes or Henry Ford. He’s not only developed rocket systems that carry men/women to space far faster and safer than NASA but he is mass producing electric cars, building underground transportation, etc... He is the future. The millennials that make fun of him could never dream of accomplishing what he has in such a short time. They’re still trying to figure out why Donald Trump won the presidency.",
                "good": "91",
                "bad": "2",
                "replies": [
                    {
                        "user_name": "alexjonesisright",
                        "time": "2 May, 2021",
                        "context": "THEY KNOW HOW HE WON\nDIDNT ACCOUNT FOR HIS POPULARITY WHEN THEY SET THE ALGORYTHIM ON DOMINION VOTING MACHINES\nAND DIDNT SET IT HIGH ENOUGH THIS LAST TIME\nSO THEY HAD TO HALT THE ELECTION\nTRUCK IN AN ESTIMATED 20 MILLION BALLOTS\nITS STARTING TO COME OUT IN ARIZONA\nITS WHY NANCY PELOSIE NEEDS 24/7 NATIONAL GUARD PROTECTION FOR WHEN THAT WHOLE CAN OF WORMS IS EXPOSED",
                        "good": "10",
                        "bad": "4",
                        "replies": []
                    },
                    {
                        "user_name": "cschlise",
                        "time": "2 May, 2021",
                        "context": "Expect more Great things from GenXers.  We quietly get the job done.",
                        "good": "1",
                        "bad": "7",
                        "replies": []
                    },
                    {
                        "user_name": "maxthrottle862",
                        "time": "2 May, 2021",
                        "context": "Musk made a small fortune on Paypal. He could have retired and lived very comfortably. Instead he took his money and doubled down on himself and his dreams for the future. He advanced electric car technology way past what any large company was doing, developed battery and solar technology for homes, developed a reuseable rocket and booster system for space travel, is trying to advance underground tunneling technology. He is doing more to solve the worlds problems than any other individual. ",
                        "good": "7",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "Koolass",
                "time": "2 May, 2021",
                "context": "That wonderful story will certainly be cancelled",
                "good": "10",
                "bad": "2",
                "replies": []
            }
        ]
    },
    {
        "user_name": "king_of_fun246",
        "time": "2 May, 2021",
        "context": "Have a safe flight guys, and may the 4's be with you...",
        "good": "18",
        "bad": "0",
        "replies": [
            {
                "user_name": "trainman54",
                "time": "2 May, 2021",
                "context": "Great word play!!!",
                "good": "4",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "🧻🚽💩🪠",
        "time": "2 May, 2021",
        "context": "One thing is for sure. If they don't splashdown safe, Elon won't hosting SNL next Saturday.",
        "good": "0",
        "bad": "16",
        "replies": []
    },
    {
        "user_name": "amerrepck",
        "time": "2 May, 2021",
        "context": "safe travels!",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Stan🐘",
        "time": "2 May, 2021",
        "context": "Name one thing invented or discovered by a black or brown that has benefited mankind?",
        "good": "11",
        "bad": "15",
        "replies": [
            {
                "user_name": "allbowbeforeme",
                "time": "2 May, 2021",
                "context": "the taco",
                "good": "12",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "zeldachampion",
                        "time": "2 May, 2021",
                        "context": "lol",
                        "good": "4",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "allbowbeforeme",
                        "time": "2 May, 2021",
                        "context": "3d tv",
                        "good": "1",
                        "bad": "1",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "MisterKnowItAll",
                "time": "2 May, 2021",
                "context": "Watermelon ",
                "good": "6",
                "bad": "1",
                "replies": []
            },
            {
                "user_name": "jimjames17",
                "time": "2 May, 2021",
                "context": "Algebra.",
                "good": "6",
                "bad": "2",
                "replies": []
            },
            {
                "user_name": "¥?#*!",
                "time": "2 May, 2021",
                "context": "Peanut butter",
                "good": "11",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "marcoramius",
                "time": "2 May, 2021",
                "context": "The process of separating plasma from blood.",
                "good": "3",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "101stParatrooper",
        "time": "2 May, 2021",
        "context": "This is the easy part.  It's going to fall down.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "glasseye114",
        "time": "2 May, 2021",
        "context": "When is biden going to force SpaceX to use electricity for propulsion. You know it's coming, right after biden takes credit for the Space Program.",
        "good": "41",
        "bad": "4",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "JackMeoff®",
        "time": "2 May, 2021",
        "context": "Back to the past? anyone notice a pattern here with this generation.",
        "good": "5",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "williambayer025",
        "time": "2 May, 2021",
        "context": "NOT a commercial plug --- but just now, while I had the Science Channel on in the background while working at the computer, I got to watch the night splashdown live, via infrared viewing. It was flawless. That coverage took me back to the old space-race days when the media that we all now detest did a pretty good job of covering launchings and landings.",
        "good": "285",
        "bad": "2",
        "replies": [
            {
                "user_name": "manonfire245224",
                "time": "2 May, 2021",
                "context": "And all the baby-boomers feel at peace.  This whole space thing is just a reliving for them.  They need to just go away but unfortunately they already caused too much damage to our Great Nation: United States of America.",
                "good": "7",
                "bad": "484",
                "replies": [
                    {
                        "user_name": "texdefender",
                        "time": "2 May, 2021",
                        "context": "Really, and just who is doing all the rioting, looting, and burning?  It isn't the baby-boomers.  It's people like you, people that don't really care about moving forward.  It's not us, we are trying to extend the frontier, to explore, to seek new places and new goals.  All you people have is racism, and ill will apparently, your comment is evidence enough.",
                        "good": "104",
                        "bad": "1",
                        "replies": []
                    },
                    {
                        "user_name": "heyblue77",
                        "time": "2 May, 2021",
                        "context": "how cute you liked your own comment. To bad nobody likes you",
                        "good": "48",
                        "bad": "2",
                        "replies": []
                    },
                    {
                        "user_name": "LibsNeedaRealDaddy",
                        "time": "2 May, 2021",
                        "context": "Said the unemployed millennial, living in his baby-boomer parent's basement.",
                        "good": "62",
                        "bad": "3",
                        "replies": [
                            {
                                "user_name": "manonfire245224",
                                "time": "2 May, 2021",
                                "context": "I run my own logistics business.  I clear about 700k in a year.  I have over 50 employees.   So what were you saying?",
                                "good": "0",
                                "bad": "17",
                                "replies": [
                                    {
                                        "user_name": "karebru",
                                        "time": "2 May, 2021",
                                        "context": "Well, bless your heart!\nSo why all the bitterness towards the generations that provided you with the ability and the environment in which to do that?\nOr do you think that we were just living in caves and banging rocks together until your glorious self appeared.",
                                        "good": "6",
                                        "bad": "0",
                                        "replies": [
                                            {
                                                "user_name": "karebru",
                                                "time": "2 May, 2021",
                                                "context": "By the way... Having to tout ones own achievements is a serious sign of inferiority issues.",
                                                "good": "8",
                                                "bad": "0",
                                                "replies": []
                                            }
                                        ]
                                    },
                                    {
                                        "user_name": "reaper163",
                                        "time": "2 May, 2021",
                                        "context": "Next time I ask for fries,  make sure you salt them freak!",
                                        "good": "3",
                                        "bad": "0",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "user_name": "khcuttin70",
                        "time": "2 May, 2021",
                        "context": "What are you rambling about?  You made absolutely no sense in your remark.  How did \"our space thing\" ruin the United States?     What is ruining the United States is the \"woke\" radicalism, terrorists who call themselves protesters, and let's not forget the Biden Administration......THAT'S what is ruining the United States.",
                        "good": "77",
                        "bad": "6",
                        "replies": []
                    },
                    {
                        "user_name": "rwac",
                        "time": "2 May, 2021",
                        "context": "That's right, us Boomers have already been up there and found there's nothing of value there. But as is typical you Millennials won't believe us and have to see for yourselves.",
                        "good": "15",
                        "bad": "8",
                        "replies": []
                    },
                    {
                        "user_name": "bossko291",
                        "time": "2 May, 2021",
                        "context": "People like you have muddied the gene pool.",
                        "good": "37",
                        "bad": "1",
                        "replies": []
                    },
                    {
                        "user_name": "1957toolman",
                        "time": "2 May, 2021",
                        "context": "Is that how it feels when you shoot up? Like your on fire? What are you shooting? It must have hallucinating affects.",
                        "good": "24",
                        "bad": "3",
                        "replies": []
                    },
                    {
                        "user_name": "jhhhh",
                        "time": "2 May, 2021",
                        "context": "Well, at least the boomers did something significant. From the time President Kennedy announced we would have the greatest BHAG of a generation and go to the moon in 10 years  to “one giant step” was less. Going to the moon turned into a Brady winning so many supper bowls people got bored of it. So what happens? The program was handed off to millennials and for 15 years we keep going to the NASA apartment in the sky over and over and over again. Common millennials, you can do better.",
                        "good": "26",
                        "bad": "2",
                        "replies": [
                            {
                                "user_name": "manonfire245224",
                                "time": "2 May, 2021",
                                "context": "The program is still ran by baby-boomers.   Gen-x has gotten the worse deal.  The Baby-boomers put most debt on them and kept their pay low.  Us, Millennials are taking the management positions because GEN-Xs are too old and they are stuck again. Oh well...",
                                "good": "1",
                                "bad": "17",
                                "replies": [
                                    {
                                        "user_name": "jhhhh",
                                        "time": "2 May, 2021",
                                        "context": "Wait a min. We went to the moon over and over and over with analog equipment and you folks go to the apartment in the sky over and over and over and you are the most technologically equipped generation that has lived to date. Get you heads out of wherever they are and do something!!",
                                        "good": "4",
                                        "bad": "0",
                                        "replies": [
                                            {
                                                "user_name": "manonfire245224",
                                                "time": "2 May, 2021",
                                                "context": "I own a logistics company with over 50 employees and clear about 700k a year.  What are u wanting me to do?",
                                                "good": "1",
                                                "bad": "6",
                                                "replies": [
                                                    {
                                                        "user_name": "ronm347",
                                                        "time": "2 May, 2021",
                                                        "context": "Stop lying would be a good start.",
                                                        "good": "6",
                                                        "bad": "0",
                                                        "replies": []
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "user_name": "Butwait,there'smore!",
                        "time": "2 May, 2021",
                        "context": "Dumbest comment of the day, and it's still the morning.",
                        "good": "27",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "markr83",
                        "time": "2 May, 2021",
                        "context": "Come to a story that should be positive for all American's and spew hate. Nice job showing who you are.",
                        "good": "20",
                        "bad": "1",
                        "replies": []
                    },
                    {
                        "error": "error"
                    },
                    {
                        "user_name": "karebru",
                        "time": "2 May, 2021",
                        "context": "You talk as if The United States of America is your birthright.\nIt's our generation, and those before ours that built this Great Nation. \n...Then we made the mistake of giving it to you with a silver spoon. \nYou know-it-all punks are proof that our biggest fault was in the way we raised our kids.",
                        "good": "47",
                        "bad": "1",
                        "replies": [
                            {
                                "user_name": "markr83",
                                "time": "2 May, 2021",
                                "context": "wish I could give this 2 thumbs up.",
                                "good": "11",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "user_name": "4cx35000c",
                        "time": "2 May, 2021",
                        "context": "Does your mother know you are on her computer? Run along now, Junior. The adults will be home soon.",
                        "good": "9",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "blakedog",
                        "time": "2 May, 2021",
                        "context": "Wow, I never saw so many people disagree with someone. What a loser you are.",
                        "good": "4",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "reaper163",
                        "time": "2 May, 2021",
                        "context": "Jealous much.",
                        "good": "3",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "SQZ",
                        "time": "2 May, 2021",
                        "context": "Please board the first flight to Mars.",
                        "good": "3",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "gftirebiter",
                                "time": "2 May, 2021",
                                "context": "He can ride on the outside.",
                                "good": "2",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "NJBChicago",
                "time": "2 May, 2021",
                "context": "Gone are those day of the old media. They no longer exist. They are now self absorbed political hacks.",
                "good": "181",
                "bad": "9",
                "replies": []
            }
        ]
    },
    {
        "user_name": "JackMeoff®",
        "time": "2 May, 2021",
        "context": "Blast from the past, this generation stealing old ideas from the 60's.",
        "good": "7",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "rayj785",
        "time": "2 May, 2021",
        "context": "No matter how you feel about Elon Musk he knows how to get stuff done.",
        "good": "138",
        "bad": "1",
        "replies": [
            {
                "user_name": "ponyboy58",
                "time": "2 May, 2021",
                "context": "Private company.\nShows what you can get done as long as you keep the government out of it.\nJust like over at SpaceX.",
                "good": "78",
                "bad": "6",
                "replies": []
            }
        ]
    },
    {
        "user_name": "Oma2Max",
        "time": "2 May, 2021",
        "context": "Congratulations.  Thanks for putting the USA back in the game.",
        "good": "140",
        "bad": "3",
        "replies": [
            {
                "user_name": "sciencerocks",
                "time": "2 May, 2021",
                "context": "We were never out.",
                "good": "28",
                "bad": "7",
                "replies": [
                    {
                        "user_name": "alexjonesisright",
                        "time": "2 May, 2021",
                        "context": "YOU WOULD NEVER KNOW THAT LISTENING TO CNN",
                        "good": "3",
                        "bad": "6",
                        "replies": [
                            {
                                "user_name": "sciencerocks",
                                "time": "2 May, 2021",
                                "context": "I don't waste my time on TV news.\nApparently you like watching CNN",
                                "good": "4",
                                "bad": "1",
                                "replies": [
                                    {
                                        "user_name": "alexjonesisright",
                                        "time": "2 May, 2021",
                                        "context": "you would never know that\nwas trying to make a point\nnot an accusation\napology accepted",
                                        "good": "0",
                                        "bad": "4",
                                        "replies": [
                                            {
                                                "user_name": "sciencerocks",
                                                "time": "2 May, 2021",
                                                "context": "You made no point at all, you just wasted my time.",
                                                "good": "4",
                                                "bad": "0",
                                                "replies": []
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "user_name": "jayo6",
                        "time": "2 May, 2021",
                        "context": "Actually we were.  Obama saw to that by killing our manned space program.  I guess it was too “white”.",
                        "good": "4",
                        "bad": "7",
                        "replies": [
                            {
                                "user_name": "sciencerocks",
                                "time": "2 May, 2021",
                                "context": "That is false. The space shuttle program was technically ended by the Bush administration.\nThe Obama administration solicited bids for the private/NASA joint venture and awarded the contract to SpaceX in 2014 (or thereabouts).\nMeanwhile NASA did some magnificent work with unmanned missions.\n\nIt is amazing what you learn when you put partisanship aside.",
                                "good": "6",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "user_name": "chopped_liver",
                        "time": "2 May, 2021",
                        "context": "Untrue. There was a time after the last shuttle (10 years or so) when NASA lost it all and all trips were done by the Russians with us paying them taxi money.",
                        "good": "4",
                        "bad": "3",
                        "replies": [
                            {
                                "user_name": "sciencerocks",
                                "time": "2 May, 2021",
                                "context": "Please see my reply to Jay06",
                                "good": "3",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "jhhhh",
                "time": "2 May, 2021",
                "context": "What game? Flying people to the NASA apartment in the sky? It’s sad. We now see that event that we have repeated 400 times as a crowning achievement.",
                "good": "0",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "Decolonization",
        "time": "2 May, 2021",
        "context": "Bravo-Zulu.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "Bidenmademillionsin2021whileyoustruggle",
        "time": "2 May, 2021",
        "context": "Elon Musk making every governments space program look like a joke lol. And this is a man that smokes weed, post memes, and buys doge coin. The BEST example of how far a regular citizen can go when they chase their dreams",
        "good": "63",
        "bad": "3",
        "replies": [
            {
                "user_name": "Bingham7479",
                "time": "2 May, 2021",
                "context": "He's  making Boeing look like a joke also.",
                "good": "10",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "alexjonesisright",
                        "time": "2 May, 2021",
                        "context": "BOEING CONCENTRATED ON PADDING THE POCKETS OF WASHINGTON LOBBYISTS BY SELLING TO THE U S GOVT [TAXPAYERS]  3000 HAMMERS 8000 DOLLAR O-RINGS",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "dataengineer",
                        "time": "2 May, 2021",
                        "context": "Boeing IS a joke",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "Pathfinder12",
                "time": "2 May, 2021",
                "context": "Well on his way to be the most influential African-American ever.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "2bhntn",
        "time": "2 May, 2021",
        "context": "Thank you Elon Musk, no more depending on Russia for rides! Bringing back Pride To the USA after our shuttle program was mothballed by our government!",
        "good": "150",
        "bad": "2",
        "replies": [
            {
                "user_name": "StutkaAce",
                "time": "2 May, 2021",
                "context": "You mean destroyed by 0bama!",
                "good": "27",
                "bad": "3",
                "replies": [
                    {
                        "user_name": "SQZ",
                        "time": "2 May, 2021",
                        "context": "Actually, it was eroding well before that.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "wolfgan1",
        "time": "2 May, 2021",
        "context": "Amazing this is not headline any more.  It is now as routine as taking a flight in an airplane.",
        "good": "15",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "DogOnPorch",
        "time": "2 May, 2021",
        "context": "God Speed Michael Collins.",
        "good": "22",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "openyoureyespeoplenow623",
        "time": "2 May, 2021",
        "context": "Too bad it's a super villain doing this instead of NASA",
        "good": "1",
        "bad": "29",
        "replies": []
    },
    {
        "user_name": "thewiserman",
        "time": "2 May, 2021",
        "context": "Harris to lead the National Space Council. Makes sense as she has always been spaced out.",
        "good": "37",
        "bad": "3",
        "replies": [
            {
                "user_name": "¥?#*!",
                "time": "2 May, 2021",
                "context": "Don’t be ridiculous, that would be like putting a senile old man in charge of the United States.",
                "good": "13",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "ponyboy58",
                "time": "2 May, 2021",
                "context": "And she'll go to the border as often as she goes to space.",
                "good": "17",
                "bad": "1",
                "replies": []
            },
            {
                "user_name": "Ukiyo",
                "time": "2 May, 2021",
                "context": "I’d pay for her one way ticket to Mars.  ",
                "good": "25",
                "bad": "2",
                "replies": []
            },
            {
                "user_name": "nachobabydaddy206",
                "time": "2 May, 2021",
                "context": "The space between her heels yep.",
                "good": "10",
                "bad": "2",
                "replies": []
            }
        ]
    },
    {
        "user_name": "FSL",
        "time": "2 May, 2021",
        "context": "NASA doesn't seem to get a lot of funding these days, good thing we have private industry to keep us moving forward in space",
        "good": "89",
        "bad": "1",
        "replies": [
            {
                "user_name": "BoxTurtle",
                "time": "2 May, 2021",
                "context": "NASA's budget for fiscal year (FY) 2021 is $23.3 billion. This represents a 3% increase over the previous year's amount. You’re right; that’s not a lot considering the trillions being thrown around these days.",
                "good": "39",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "torkild",
                        "time": "2 May, 2021",
                        "context": "For instance Biden just asked for 80 Billion MORE for the IRS threat squad.  3.5x the NASA budget to hire more goons.",
                        "good": "4",
                        "bad": "4",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "beadgBass",
                "time": "2 May, 2021",
                "context": "Who do you think pays them?",
                "good": "12",
                "bad": "3",
                "replies": []
            },
            {
                "user_name": "StutkaAce",
                "time": "2 May, 2021",
                "context": "Remember 0bama shifted NASA funding to research \"Muslim Studies\" makes a little sense since he was in fact a Muslim born in Kenya!",
                "good": "19",
                "bad": "4",
                "replies": []
            }
        ]
    },
    {
        "user_name": "redlindholm",
        "time": "2 May, 2021",
        "context": "This is awesome and Space X rules. Good job guys!",
        "good": "22",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "independence076",
        "time": "2 May, 2021",
        "context": "I hope someone updates the press secretary on this. Someone tell her something, since she had no idea there was a Space X program. She is quite the brainiac. ",
        "good": "42",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ew1usnr",
        "time": "2 May, 2021",
        "context": "This should have been the lead article, not Caitlyn Jenner.",
        "good": "68",
        "bad": "0",
        "replies": [
            {
                "user_name": "radov",
                "time": "2 May, 2021",
                "context": "Both are science and engineering.",
                "good": "22",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "alexjonesisright",
                        "time": "2 May, 2021",
                        "context": "SELF MUTILATION IS NOT ROCKET SCIENCE",
                        "good": "2",
                        "bad": "3",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "JLampe",
        "time": "2 May, 2021",
        "context": "A private contractor ferrying astronauts to space and back. One more accomplishment that highlights American exceptionally.   ",
        "good": "204",
        "bad": "1",
        "replies": [
            {
                "user_name": "alexjonesisright",
                "time": "2 May, 2021",
                "context": "vote demacrates out before they totally destroy america",
                "good": "85",
                "bad": "12",
                "replies": []
            },
            {
                "user_name": "BoxTurtle",
                "time": "2 May, 2021",
                "context": "Ironic that he’s Canadian actually.",
                "good": "5",
                "bad": "57",
                "replies": [
                    {
                        "user_name": "sciencerocks",
                        "time": "2 May, 2021",
                        "context": "If you are referring to Elon Musk, he is South African.",
                        "good": "33",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "alexjonesisright",
                                "time": "2 May, 2021",
                                "context": "UNCLE ELON?\nIS THAT WHY DEMOCRATS [LIBERALS] HATE HIM SO MUCH",
                                "good": "3",
                                "bad": "6",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "user_name": "1sparky",
                        "time": "2 May, 2021",
                        "context": "What does that have to do with anything",
                        "good": "4",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "reaper163",
                        "time": "2 May, 2021",
                        "context": "He is an American :)",
                        "good": "1",
                        "bad": "1",
                        "replies": []
                    },
                    {
                        "user_name": "soundstore",
                        "time": "2 May, 2021",
                        "context": "who is?  musk?  you are off by about what, 4000 miles?",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "jarhead7052",
                "time": "2 May, 2021",
                "context": "One more instance of private industry outperforming government inefficiencies and incompetence.",
                "good": "24",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "soundstore",
                        "time": "2 May, 2021",
                        "context": "QFT.  every time he sticks one of those landings, he drives a stake into the heart of every liberal politician.  which is probabyl why the MSM just does not cover the launches and landings - oh they are there but it gets what 15 seconds?  unless a test capsule explodes and it gets a day...",
                        "good": "6",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "my_2_sense",
        "time": "2 May, 2021",
        "context": "A giant step backwards.  Splashdowns used to be a thing of the past.",
        "good": "2",
        "bad": "23",
        "replies": [
            {
                "user_name": "DogOnPorch",
                "time": "2 May, 2021",
                "context": "Nature's shock absorber.",
                "good": "7",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "ilfautcroire272",
        "time": "2 May, 2021",
        "context": "“The capsule of the first SpaceX crew was surrounded by pleasure boaters last summer, posing a safety risk.”To be more exact, the crew was surrounded by Trump supporters who unveiled the Trump 2020 flag. That was wonderful to see.  Those were much happier days.   Hopefully they will return and the dark cloud of the fascist woke left can be overcome.",
        "good": "45",
        "bad": "8",
        "replies": [
            {
                "user_name": "alexjonesisright",
                "time": "2 May, 2021",
                "context": "AFTER ARIZONA FORENSIC AUDIT\nWILL JOE BIDEN PEACEFULLY VACATE THE WHITE HOUSE",
                "good": "2",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "ponyboy58",
        "time": "2 May, 2021",
        "context": "I don't think it's that big a deal.\nI'm sure they can find the water just fine even in the dark.",
        "good": "3",
        "bad": "17",
        "replies": []
    },
    {
        "user_name": "arminius23",
        "time": "2 May, 2021",
        "context": "Space X achievements seem to be the only good news in the media nowadays.",
        "good": "46",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "honestyforever",
        "time": "2 May, 2021",
        "context": "I want to see more fake pictures from Mars and the moon.",
        "good": "2",
        "bad": "13",
        "replies": [
            {
                "user_name": "NHConservative182",
                "time": "2 May, 2021",
                "context": "You belive in the moon? 🤣",
                "good": "2",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "marcoramius",
                "time": "2 May, 2021",
                "context": "How do you Flat Earthers/space deniers/conspiracy theorists even function?",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "GreenBike",
        "time": "2 May, 2021",
        "context": "I miss the days when nasa got vehicles into space and didn’t have to rely on South African billionaires.",
        "good": "2",
        "bad": "9",
        "replies": [
            {
                "user_name": "libsrnuts855",
                "time": "2 May, 2021",
                "context": "need to spend the $$ on illegals now instead",
                "good": "4",
                "bad": "1",
                "replies": []
            },
            {
                "user_name": "NHConservative182",
                "time": "2 May, 2021",
                "context": "Yeah. 100 billion American tax dollars on used shuttle parts (SLS) and it still hasn't launched. Much better we keep going down that path... ",
                "good": "1",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "GreenBike",
                        "time": "2 May, 2021",
                        "context": "How many engineers, physicists, mathematicians, etc did the Apollo Mission produce?  The shuttle missions. It may cost a lot but the return you get back is 100 fold. I would say the last great thing we did as a country was the Apollo missions. We can’t act cohesively anymore.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "sam1775",
        "time": "2 May, 2021",
        "context": "Glad Space X can continue our proud heritage of space exploration. With very soon to be Dear Leader Kamila DeVil now in charge of NASA she will do what socialist democrats do best. Destroy it since it's a rrrrraaaaccccciiiissssttt organization!",
        "good": "20",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "jose9056",
        "time": "2 May, 2021",
        "context": "Great job.  \n\nEven better, Boeing is still watching from the spectator stands.",
        "good": "32",
        "bad": "3",
        "replies": [
            {
                "user_name": "alexjonesisright",
                "time": "2 May, 2021",
                "context": "BOEING IS IN THE WITNESS DOCKET",
                "good": "7",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "confundido",
        "time": "2 May, 2021",
        "context": "If the Earth was dark, how did they find it?",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "jhhhh",
        "time": "2 May, 2021",
        "context": "Yah that’s right. For the 400th time we flew up to the NASA apartment in the sky and came back. This is the most overpriced and overrated underachieving event in NASA history.",
        "good": "1",
        "bad": "29",
        "replies": [
            {
                "user_name": "Vet_74",
                "time": "2 May, 2021",
                "context": "Estimates of the return on investment in the space program range from $7 for every $1 spent on the Apollo Program to $40 for every $1 spent on space development today. The critical factor driving productivity growth is technology. Social programs provide $3 dollars for every $!.",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "truthforu211",
        "time": "2 May, 2021",
        "context": "IN OTHER NEWS - never to be found on any USA medias - the US Navy disabled the Communist Chinese aircraft carrier Liaoning. The US Navy used electronic warfare to disable the outdated Stability System machinery. destroying it through its Conduction System. Japanese naval personnel witnessed it.\nThis is 2 events. 1- The US military initiated a “soft” war on the Chinese military. 2- A warning. What happens to the Chinese military if it attacks Taiwan. Unless the Chinese army can walk on water, attacking Taiwan ain't happening. The Chinese navy & marines were checkmated.",
        "good": "16",
        "bad": "1",
        "replies": [
            {
                "user_name": "joeyg45",
                "time": "2 May, 2021",
                "context": "But wait I thought China was in Biden's pocket??? 🤣🤣🤣",
                "good": "3",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "truthforu211",
                        "time": "2 May, 2021",
                        "context": "Biden had nothing to do with it.",
                        "good": "6",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "eee222",
                        "time": "2 May, 2021",
                        "context": "You've got it backwards, bun boy.",
                        "good": "6",
                        "bad": "1",
                        "replies": []
                    },
                    {
                        "user_name": "dataengineer",
                        "time": "2 May, 2021",
                        "context": "the other way around",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "nankerphelge217",
                "time": "2 May, 2021",
                "context": "Can you site the story.  if true you're right.  It should be lead news on every source.",
                "good": "8",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "ironranger281",
        "time": "2 May, 2021",
        "context": "When are we sending Hillary back to Mars ? \n\nThats what i want to know !",
        "good": "12",
        "bad": "0",
        "replies": [
            {
                "user_name": "dataengineer",
                "time": "2 May, 2021",
                "context": "they have already. she's back home.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "fedup6410",
        "time": "2 May, 2021",
        "context": "Spacex is to be commended",
        "good": "20",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bigmikegalaxy",
        "time": "2 May, 2021",
        "context": "On K-EARTH 101 everybody was doing the astronaut twist to celebrate.  🎶 Swing your spaceman round and round 🎶",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Blood_on_Dems_Hands",
        "time": "2 May, 2021",
        "context": "They did it in the dark so they weren’t accused of being racist. But they wore white suits and that defeated the purpose.",
        "good": "13",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "truthforu211",
        "time": "2 May, 2021",
        "context": "Before they were completely removed from the capsule, they had to put on the dem☭cRATS Scamdemic Face Diaper.",
        "good": "17",
        "bad": "0",
        "replies": [
            {
                "user_name": "realist12345678",
                "time": "2 May, 2021",
                "context": "Amazing how Trump transformed a sensible public safety precaution into a partisan political symbol.",
                "good": "2",
                "bad": "20",
                "replies": [
                    {
                        "user_name": "truthforu211",
                        "time": "2 May, 2021",
                        "context": "If the surgical Face Diaper can protect you from Covid-19, then explain why bio-weapon lab personnel wear full containment suits in those labs with deadly viruses - including Covid. Tell us why those lab personnel do not just wear the Face Diaper. Waiting ...",
                        "good": "3",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "commoncents112",
                                "time": "2 May, 2021",
                                "context": "I'm pretty sure it has to do with following \"protocol\" in the sense that, any/every company has a PPE (personal protective equipment) they are required to wear. Politics plays no part in company safety guidelines ",
                                "good": "0",
                                "bad": "3",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "user_name": "nankerphelge217",
                        "time": "2 May, 2021",
                        "context": "No genius.  The hatred of Trump transformed a marginal (at best) precaution into a cult like phenomenon.  The idiots still wear them even after innoculation.",
                        "good": "5",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "thisf******guy",
        "time": "2 May, 2021",
        "context": "This how it's done, Bezos. Take a seat.",
        "good": "14",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "alexjonesisright",
        "time": "2 May, 2021",
        "context": "IS IT TRUE THEY WERE REFUSED ENTRY TO SPACE FOR VOTING REPUBLICAN",
        "good": "6",
        "bad": "2",
        "replies": [
            {
                "user_name": "emilypearson",
                "time": "3 May, 2021",
                "context": "race racer racest",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "cyanvalvespring",
        "time": "2 May, 2021",
        "context": "They must have come back to join the riots.",
        "good": "0",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "smartman106",
        "time": "2 May, 2021",
        "context": "So glad we don’t have to pay the Russians for these trips anymore.",
        "good": "19",
        "bad": "0",
        "replies": [
            {
                "user_name": "libsrnuts855",
                "time": "2 May, 2021",
                "context": "biden pays them in many more ways",
                "good": "5",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "HighlandsFarmer",
        "time": "2 May, 2021",
        "context": "Shame on Fox News!!!!!!!!!!!!!!!!!!!!!!  This amazing and historic mission should have been the lead story this morning.   Instead, for the second day in a row, we are subjected to another large photograph of a transexual who is thinking of running for political office.  What twisted priorities you folks have!!!",
        "good": "31",
        "bad": "5",
        "replies": [
            {
                "user_name": "nankerphelge217",
                "time": "2 May, 2021",
                "context": "And yet, here you are.",
                "good": "1",
                "bad": "7",
                "replies": []
            }
        ]
    },
    {
        "user_name": "radov",
        "time": "2 May, 2021",
        "context": "After America's greed destroys planet earth they are in search of a new planet to destroy.",
        "good": "2",
        "bad": "33",
        "replies": [
            {
                "user_name": "honestyforever",
                "time": "2 May, 2021",
                "context": "What do we do when the oil starts bubbling out of the oceans and ground again?",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "bozohere",
        "time": "2 May, 2021",
        "context": "Pretty darn cool!",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "occer",
        "time": "2 May, 2021",
        "context": "Got to give it to Musk. He has put mankind in space and returned them. His biggest adversaries such as Zuckerberg, Bezos, Dorsey etc only managed to put men in skirts and destroy everything around them.",
        "good": "36",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mlipst",
        "time": "2 May, 2021",
        "context": "I didn't see any social distancing or mask wearing in the capsule.  Did Joe make them get tested for COVID, upon entering the U.S.?",
        "good": "18",
        "bad": "4",
        "replies": [
            {
                "user_name": "ScienceGal",
                "time": "2 May, 2021",
                "context": "The sad part is that Cletus doesn’t understand that astronauts were in quarantine and tested prior to launch. \n\nThere isn’t any bleach to drink on ISS and Jesus can’t hear prayers in space.",
                "good": "3",
                "bad": "16",
                "replies": [
                    {
                        "user_name": "mlipst",
                        "time": "2 May, 2021",
                        "context": "You thought I was serious?  Ha!  The sad part about you, is that you are sarcasm-challenged and are bereft of any sense of humor.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "jh1957773",
        "time": "2 May, 2021",
        "context": "Welcome back SpaceX crew.  Flawless job.",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "PMST33",
        "time": "2 May, 2021",
        "context": "Those outfits they are wearing makes them look like privates for a third world military.",
        "good": "2",
        "bad": "8",
        "replies": []
    },
    {
        "user_name": "markabbott",
        "time": "2 May, 2021",
        "context": "Goodnight John Boy!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "someotherview",
        "time": "2 May, 2021",
        "context": "Congrats, and thanks for a feel good story.",
        "good": "12",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rpol",
        "time": "2 May, 2021",
        "context": "Kudos to Space X!  My only regret is with the boots on the new spacesuits.  Everything looked cool until you get down to the boots.  I guarantee they are functional, but they look a bit sloppy...",
        "good": "1",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "anti-liberal996",
        "time": "2 May, 2021",
        "context": "Elon Must is a one man NASA. If only he had NASA's budget. ",
        "good": "8",
        "bad": "0",
        "replies": [
            {
                "user_name": "guest1234567890173",
                "time": "2 May, 2021",
                "context": "NASA [IS] a large part of SpaceX budget.",
                "good": "2",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "drlove699",
                "time": "2 May, 2021",
                "context": "Yet another example of capitalism being superior to socialism.",
                "good": "13",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "rightshoe",
        "time": "2 May, 2021",
        "context": "So cool.  At least some fraction of the human race can work together and accomplish awesome things. In fact, I'll bet that fraction is much larger than click-baiters want us to believe.",
        "good": "14",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Leebj428",
        "time": "2 May, 2021",
        "context": "Bravo Zulu",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "NHConservative182",
        "time": "2 May, 2021",
        "context": "Another win for private space companies. 100 billion dollars later Congress still can't get SLS of the pad, even though it's made with used space shuttle parts. ",
        "good": "16",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mortyo6",
        "time": "2 May, 2021",
        "context": "Fifty or so yrs ago we were riding electric dune buggies on the moon, 238,000miles away, went back and forth six times.  Now we can scarcely reach 238mi. All this \"regression\" on a 50million $ a day budget. This would never, ever be allowed in any sort of reality. If these aren't the folks that are \"conspiring\", then no one ever has!",
        "good": "0",
        "bad": "1",
        "replies": [
            {
                "user_name": "ConservativeBoomer909",
                "time": "2 May, 2021",
                "context": "$50 Mil 50 years ago was worth a lot more than $50 Mil today.",
                "good": "2",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "mortyo6",
                        "time": "2 May, 2021",
                        "context": "That is today.  Probably closer to 60mil/ day",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "ConservativeBoomer909",
                                "time": "2 May, 2021",
                                "context": "NASA hasn't had a budget increase since 1969.",
                                "good": "0",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "mortyo6",
                                        "time": "2 May, 2021",
                                        "context": "Yes it has.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": [
                                            {
                                                "user_name": "ConservativeBoomer909",
                                                "time": "3 May, 2021",
                                                "context": "Not really, if you take into account inflation.",
                                                "good": "0",
                                                "bad": "0",
                                                "replies": []
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "d1nger",
        "time": "2 May, 2021",
        "context": "Is a red eye flight a cheaper splash down?",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "ColonelF",
        "time": "2 May, 2021",
        "context": "The greatest achievements of humanity are sometimes made possible by individuals who have a vision and dedication with the resources to make it happen. This can go in a variety of ways. While bezos buys the Washington Post to influence government policy for his benefit, Musk will change the world. ",
        "good": "84",
        "bad": "1",
        "replies": [
            {
                "user_name": "papa1700",
                "time": "2 May, 2021",
                "context": "Well said!",
                "good": "26",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "Americant",
                "time": "2 May, 2021",
                "context": "Although, Bezos DOES own Blue Origin.",
                "good": "1",
                "bad": "8",
                "replies": []
            }
        ]
    },
    {
        "user_name": "sns_usa",
        "time": "2 May, 2021",
        "context": "Amazing! The great debate has always been should we got to the Moon and build a base or go onto Mars next. I say go onto Mars...make this great leap in the 2030s, but it is all about the future and what comes next for future generations.",
        "good": "6",
        "bad": "0",
        "replies": [
            {
                "user_name": "drlove699",
                "time": "2 May, 2021",
                "context": "I was under the impression that moon was a target to become launching point for longer missions due to the comparative ease of launching.",
                "good": "6",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "mortyo6",
                "time": "2 May, 2021",
                "context": "Actually the great debate is DID we ever go to the moon. From what I've seen, I say no.",
                "good": "0",
                "bad": "31",
                "replies": [
                    {
                        "user_name": "vkirkpat",
                        "time": "2 May, 2021",
                        "context": "lol... so gullible",
                        "good": "3",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "mortyo6",
                                "time": "2 May, 2021",
                                "context": "Right, they supposedly went 238,000miles 50 yrs ago (with dune buggies), now can hardly go 238miles. And call it progress. Who are the conspirators here?",
                                "good": "0",
                                "bad": "5",
                                "replies": [
                                    {
                                        "user_name": "bubblelicious",
                                        "time": "2 May, 2021",
                                        "context": "The Blackbird program aircraft exceeded Mach 3. 2 in 1962-1963. \n\nYou telling me aviation hasn't progressed since then?\n\nMinds are like parachutes...they work best when they're open.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": [
                                            {
                                                "user_name": "mortyo6",
                                                "time": "2 May, 2021",
                                                "context": "It does reach those speeds. Truly amazing. And is at the verge of falling apart, isn't it?  Look up the speed of the Falcon lol. No way. Use that open mind of yours.",
                                                "good": "0",
                                                "bad": "0",
                                                "replies": [
                                                    {
                                                        "user_name": "bubblelicious",
                                                        "time": "2 May, 2021",
                                                        "context": "Debating with fools is a fools journey. \n\nEnjoy your reality...",
                                                        "good": "0",
                                                        "bad": "0",
                                                        "replies": [
                                                            {
                                                                "user_name": "mortyo6",
                                                                "time": "2 May, 2021",
                                                                "context": "I will. I can't believe you think comparing a Blackbird with a Falcon is a fools journey...actually, I can.",
                                                                "good": "0",
                                                                "bad": "0",
                                                                "replies": []
                                                            }
                                                        ]
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "user_name": "bubblelicious",
                        "time": "2 May, 2021",
                        "context": "You'd be wrong...",
                        "good": "1",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "mortyo6",
                                "time": "2 May, 2021",
                                "context": "I don't think so. Just try speeding up their slow mo. videos, that should convince anyone with an open mind. Which most lack.",
                                "good": "0",
                                "bad": "1",
                                "replies": [
                                    {
                                        "user_name": "bubblelicious",
                                        "time": "2 May, 2021",
                                        "context": "Believe what you will.\n\nWho shot Kennedy?\n\nChemtrails legit?\n\nWhat's at Area 51?\n\nNorth Dakota Illuminati?\n\nSasquatch?\n\nJust trying to gauge the level of your denial mindset.",
                                        "good": "1",
                                        "bad": "0",
                                        "replies": [
                                            {
                                                "user_name": "mortyo6",
                                                "time": "2 May, 2021",
                                                "context": "No you're not, your deflecting.",
                                                "good": "0",
                                                "bad": "0",
                                                "replies": [
                                                    {
                                                        "user_name": "bubblelicious",
                                                        "time": "2 May, 2021",
                                                        "context": "Again...believe what you will.",
                                                        "good": "0",
                                                        "bad": "0",
                                                        "replies": [
                                                            {
                                                                "user_name": "mortyo6",
                                                                "time": "2 May, 2021",
                                                                "context": "Again...prove \"outer-space\" is even possible.",
                                                                "good": "0",
                                                                "bad": "0",
                                                                "replies": []
                                                            }
                                                        ]
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "user_name": "marcoramius",
                        "time": "2 May, 2021",
                        "context": "The only debate is in the mnds of conspiracy theorists.  We did go to the moon.  If you can supply any new, credible evidence that has not already been debunked, please present it.",
                        "good": "1",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "mortyo6",
                                "time": "2 May, 2021",
                                "context": "If the old evidence, and there is plenty, is too difficult for you to accept, anything new won't do any good.",
                                "good": "1",
                                "bad": "2",
                                "replies": [
                                    {
                                        "user_name": "marcoramius",
                                        "time": "2 May, 2021",
                                        "context": "Since all of that old evidence has been thoroughly debunked already, how about presenting some new evidence?  Shouldn't be hard given today's technology.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": [
                                            {
                                                "user_name": "mortyo6",
                                                "time": "2 May, 2021",
                                                "context": "Debunked, as you checked into it, or debunked as in you \"took their word for it\"....again.",
                                                "good": "0",
                                                "bad": "1",
                                                "replies": [
                                                    {
                                                        "user_name": "marcoramius",
                                                        "time": "2 May, 2021",
                                                        "context": "For your question, there are a lot of people a lot smarter than the two of us whose word I'll take over most folks.  Two I know personally (in the know) who never have anything to do with such duplicity.  I trust them, so how about we approach this from the perspective of common sense?  First:  With the hundreds of thousands of folks who worked from Mercury to Apollo, someone \"in the know\" would have talked by now.  Sure we can say they were threatened or paid into silence, and that would certainly be plausible.  That said, secrets of this magnitude simply don't stay secret for long.  Someone ALWAYS talks.  Usually someone with nothing to lose.  Plus someone talking then them dying or a family member dying would be too suspicious to dismiss.  Second:  The Soviets and Chinese, and others, were monitoring everything the US did when preparing for, going to, and then landing on the moon.  If there was one shred of evidence that it was all a hoax, do you honestly believe they wouldn't have let that one out?  The Soviets most certainly would have to discredit the US at that time.  Third:  You can see the landing sites with a powerful enough telescope.  The bottom of the LM's, the tracks from the rovers and the rovers themselves are there.",
                                                        "good": "0",
                                                        "bad": "0",
                                                        "replies": [
                                                            {
                                                                "user_name": "mortyo6",
                                                                "time": "2 May, 2021",
                                                                "context": "So, \"appeal to authority\" and \"it's not possible.  And no, you can't see the sites with a telescope, folks have tried. And still, no blast crater on any landing. And you have no idea what people \"at the top\" are up to, including our so-called enemies,(China, Russia) of which we've never gone to war btw.",
                                                                "good": "0",
                                                                "bad": "0",
                                                                "replies": []
                                                            }
                                                        ]
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "user_name": "blakedog",
                        "time": "2 May, 2021",
                        "context": "There is no debate.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "mortyo6",
                                "time": "2 May, 2021",
                                "context": "Ah, one of those 'settled science' people.",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "user_name": "dataengineer",
                        "time": "2 May, 2021",
                        "context": "Capricorn one was a great movie. loved it.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "mortyo6",
                                "time": "2 May, 2021",
                                "context": "At least they had a black actornot. They may have even shown disturbed dirt underneath the rocket after it landed. The devil's in the details.",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "QuitThat",
        "time": "2 May, 2021",
        "context": "Now if only they can perfect that ground based landing that doesn't explode when  it lands... Otherwise Mars is a No Go  No lakes or oceans on Mars.\n\n ..... Except for that.... nice job!",
        "good": "1",
        "bad": "9",
        "replies": [
            {
                "error": "error"
            },
            {
                "user_name": "Yehoodi",
                "time": "2 May, 2021",
                "context": "Typical reductive performance-mode hyperbole. Just in case you haven’t zipped off to another comment field to prove how smart you are, there is a reason they call the Starship program test articles “prototypes”. It’s part of the plan for rapid development to presume vehicle loss. Jeez, aren’t you late for a party where no one wants to be around you again?",
                "good": "4",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "QuitThat",
                        "time": "2 May, 2021",
                        "context": "Naw. I'm still here....  What's wrong with wanting to see success of the next step?   That's why they test!",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "woolery",
        "time": "2 May, 2021",
        "context": "More proof individual freedoms is what drives innovation and not governments. Elon knows this.",
        "good": "16",
        "bad": "1",
        "replies": [
            {
                "user_name": "BUT_WHATABOUT_ANTIFA!?🤯😭",
                "time": "2 May, 2021",
                "context": "With government money.",
                "good": "3",
                "bad": "7",
                "replies": [
                    {
                        "error": "error"
                    }
                ]
            }
        ]
    },
    {
        "user_name": "markt57",
        "time": "2 May, 2021",
        "context": "Not to be out-performed by CNN's Jeffrey Toobin, Bezos and Musk put their rockets on display.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "gothicironworks",
        "time": "2 May, 2021",
        "context": "Has anyone else seen the documentry on the last Apollo mission called \"Apollo 18\"? I saw it beofre they pulled it out of theatres but after seeing that I wonder if its a good idea about sending astronuts back to the moon or even Mars.",
        "good": "2",
        "bad": "0",
        "replies": [
            {
                "user_name": "marcoramius",
                "time": "2 May, 2021",
                "context": "I did see it, but a documentary?  Nope.",
                "good": "1",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "bubblelicious",
                "time": "2 May, 2021",
                "context": "It's a movie...not a documentary. A quasi-interesting story line with the usual space horror stuff. For me...Meh",
                "good": "2",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "rufusrufftuff",
                "time": "2 May, 2021",
                "context": "Seriously, you think that was a documentary? (documentry?)",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "my1970america832",
        "time": "2 May, 2021",
        "context": "Meanwhile the news is giving NASA the credit.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "freestateman",
        "time": "2 May, 2021",
        "context": "thank God for private business involvement in our space program. ",
        "good": "14",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "👑QueenBiden👑",
        "time": "2 May, 2021",
        "context": "Wow last was in 1968...I wasn't around to see the Apollo program. Hope to see our return to the moon though and to Mars.",
        "good": "9",
        "bad": "0",
        "replies": [
            {
                "user_name": "ConservativeBoomer909",
                "time": "2 May, 2021",
                "context": "I saw the reports on Sputnik when I was little. I remember thinking how great that was.",
                "good": "3",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "👑QueenBiden👑",
                        "time": "2 May, 2021",
                        "context": "It had to be an amazing time. I have always felt I was born during the wrong time.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "jasonsims",
        "time": "2 May, 2021",
        "context": "Congrats SpaceX ...proving that the private sector can do something that big gov can't or wouldn't",
        "good": "29",
        "bad": "0",
        "replies": [
            {
                "user_name": "fnkneeonmyneck",
                "time": "2 May, 2021",
                "context": "Well I have you know joebama just put heels up in charge of the US space efforts so what could possibly go wrong? /sarc",
                "good": "8",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "DemsRManipulativeNaziwannabes",
        "time": "2 May, 2021",
        "context": "Awesome, great job SpaceX and NASA.    Media crickets- President yawns.\nMeanwhile back at the ranch, Antifa dweebs are shining up their trashcan lid shields for another ignorant demonstration that has no purpose, and BLM founders and organizers are out buying multi million dollar homes via donations from the duped and ignorant.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "iamiamgodrespect1",
        "time": "2 May, 2021",
        "context": "Don’t put Kamala over that too…",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "gallowspoll",
        "time": "2 May, 2021",
        "context": "\"I want to reassure the citizens of the United States that there is nothing to worry about. The life forms that recently crashed in our territorial waters seem to be very friendly and cooperative.\"\n\n- Kamila Harris",
        "good": "7",
        "bad": "1",
        "replies": [
            {
                "user_name": "ConservativeBoomer909",
                "time": "2 May, 2021",
                "context": "Probably her cousins.",
                "good": "4",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "newsjet641",
                "time": "2 May, 2021",
                "context": "LOL",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "FJB!",
        "time": "2 May, 2021",
        "context": "it was a lot more exiciting in 1968",
        "good": "2",
        "bad": "2",
        "replies": [
            {
                "user_name": "bubblelicious",
                "time": "2 May, 2021",
                "context": "A lot of things were more exciting in 1968... 😉",
                "good": "7",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "neverpoliticalbull",
        "time": "2 May, 2021",
        "context": "Congrats SpaceX and Elon Musk...this country and world needs more of both!",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "DisgustedVeteran410",
        "time": "2 May, 2021",
        "context": "Kamala Harris is the new chair of the Space Council.  Considering her skills, what will she bring to the space program I wonder.",
        "good": "12",
        "bad": "3",
        "replies": [
            {
                "user_name": "anti-liberal996",
                "time": "2 May, 2021",
                "context": "As much skill and talent as she bought to border diasters. ",
                "good": "7",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "👑QueenBiden👑",
                "time": "2 May, 2021",
                "context": "She'll display the vacuum of space.",
                "good": "2",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "dataengineer",
                        "time": "2 May, 2021",
                        "context": "LOL, and the wind blowing through her ears",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "bubblelicious",
                "time": "2 May, 2021",
                "context": "Well, apparently she knows a thing or two about hard rockets and ejections.",
                "good": "4",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "🐧thereisagod2⭐",
        "time": "2 May, 2021",
        "context": "* * FAKE NEWS * *",
        "good": "0",
        "bad": "8",
        "replies": [
            {
                "user_name": "NHConservative182",
                "time": "2 May, 2021",
                "context": "Space isn't real. Just ask Kamala... ",
                "good": "3",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "johndoesr",
                        "time": "2 May, 2021",
                        "context": "But the teachers said Kamalaho took up space in school............",
                        "good": "2",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "marcoramius",
                "time": "2 May, 2021",
                "context": "Nice to see the space deniers and Flat Earthers are up and about this Sunday morning.",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "BlueCactus",
        "time": "2 May, 2021",
        "context": "Eat that Jeff Bozo, you flaming commie",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "lanjon4751",
        "time": "2 May, 2021",
        "context": "Boomers! Greatest generation ever. It's when America was the greatest nation in the entire world. Not so much anymore after following generations systematically destroyed it!",
        "good": "20",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "richtool",
        "time": "2 May, 2021",
        "context": "Very cool that a private company can do this. Over time, it will help bring costs down while NASA focuses elsewhere.",
        "good": "6",
        "bad": "0",
        "replies": [
            {
                "user_name": "tunein",
                "time": "2 May, 2021",
                "context": "they will be forced out of business, following the Biden tax sack of corporate profits!",
                "good": "3",
                "bad": "1",
                "replies": []
            },
            {
                "user_name": "kod",
                "time": "2 May, 2021",
                "context": "Vice President to chair national aerospace? Private space ventures will be lobbied out of existence.",
                "good": "3",
                "bad": "1",
                "replies": [
                    {
                        "error": "error"
                    }
                ]
            }
        ]
    },
    {
        "user_name": "blakedog",
        "time": "2 May, 2021",
        "context": "Is Boot Edge Edge trying to figure out how to tax NASA on how many miles they travel? That could be trillions and trillions of dollars on just one mission.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "hiwayne!",
        "time": "2 May, 2021",
        "context": "Awesome! This never gets old. Welcome home Crew-1",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "beeman276",
        "time": "2 May, 2021",
        "context": "Thank you Mr. Musk.  Without you, we’d still be hitching rides with the Soviets.  A great example of why private enterprise is so superior to government ineptness.",
        "good": "28",
        "bad": "0",
        "replies": [
            {
                "user_name": "dataengineer",
                "time": "2 May, 2021",
                "context": "He should be the director of NASA in the new red state nation: the United Federalist States of America. Montana, Utah, the western plains states, Texas, the deep south, and florida.",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "reaper163",
        "time": "2 May, 2021",
        "context": "Thank you President Trump!",
        "good": "19",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Sjtbrit1",
        "time": "2 May, 2021",
        "context": "I am all about space exploration and finding a new home for my great great grandchildren. I applaud Elon Musk for his vision making this possible. Now I wish our government could have the same insight to fixing the homelessness issue on earth. But I won’t hold my breath. They are to busy packing their bank accounts.",
        "good": "6",
        "bad": "2",
        "replies": [
            {
                "user_name": "RealitySucks",
                "time": "2 May, 2021",
                "context": "When will Earth be less habitable than Mars? Surely not when your great grand children are adults. Likely never. Mars will never have water. Why not build on Earth what is planned for Mars? It would be much easier, less costly, and benefit far more people. That is if it is even necessary.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "radov",
        "time": "2 May, 2021",
        "context": "Musk's largest charitable contribution is a 100m contest to make himself richer.\nThis guy has to be the worst.",
        "good": "0",
        "bad": "21",
        "replies": [
            {
                "user_name": "vic143",
                "time": "2 May, 2021",
                "context": "You suckin on a jelly sickle right now?",
                "good": "5",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "dataengineer",
                "time": "2 May, 2021",
                "context": "well, 'radov' (is your first name vladimir?), at least you're not hiding behind an outrageous name anymore... but you are a bot troll nevertheless. SWAT",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "'63split",
        "time": "2 May, 2021",
        "context": "Two questions: 1, Why land at night? 2, Why was the video more grainy that those from Mars?",
        "good": "2",
        "bad": "4",
        "replies": [
            {
                "user_name": "speedyone",
                "time": "2 May, 2021",
                "context": "1:  Orbital mechanics.\n2:  Night vision",
                "good": "4",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "'63split",
                        "time": "2 May, 2021",
                        "context": "Orbital mechanics could have made it land during the day too. Why use night vision, just land in the light. The 'private' boat issue should be easy to take of.",
                        "good": "1",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "speedyone",
                                "time": "2 May, 2021",
                                "context": "So, you think they're just hovering over the same spot on the Earth and can pop down whenever, wherever they like and they did it at 3:00 AM just to be cute.\nClearly my time is wasted on you.",
                                "good": "2",
                                "bad": "1",
                                "replies": []
                            },
                            {
                                "user_name": "cooper1950",
                                "time": "2 May, 2021",
                                "context": "If you've been in orbit for six months, you're not delaying your landing so some irrelevant clown can see it in daylight.",
                                "good": "1",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "'63split",
                                        "time": "2 May, 2021",
                                        "context": "It was already delayed 4 days. Don't call yourself a clown. That's speedyone's claim to fame.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": [
                                            {
                                                "user_name": "speedyone",
                                                "time": "2 May, 2021",
                                                "context": "Dude, you're the one who doesn't understand basic orbits.\nThe only one looking silly here is you.",
                                                "good": "0",
                                                "bad": "1",
                                                "replies": [
                                                    {
                                                        "user_name": "'63split",
                                                        "time": "3 May, 2021",
                                                        "context": "And you do? Please just quit! You look more stupid by the post. The speed of the capsule is reduced to break orbit and begin it's decent. The location and time of of landing they want determines the beginning and rate of decent. Got it !!!!",
                                                        "good": "0",
                                                        "bad": "0",
                                                        "replies": [
                                                            {
                                                                "user_name": "speedyone",
                                                                "time": "3 May, 2021",
                                                                "context": "Rate of descent is gravity, dude.\nYou think Elon can change gravity?\n\nThey can't just \"wait 6 hours\" and hit the same spot, DA.\nTHAT is what YOU said.",
                                                                "good": "0",
                                                                "bad": "1",
                                                                "replies": []
                                                            },
                                                            {
                                                                "user_name": "speedyone",
                                                                "time": "3 May, 2021",
                                                                "context": "and yes, I've covered orbital mechanics in college and my work.",
                                                                "good": "0",
                                                                "bad": "0",
                                                                "replies": [
                                                                    {
                                                                        "user_name": "'63split",
                                                                        "time": "3 May, 2021",
                                                                        "context": "Get your money back ASAP!",
                                                                        "good": "0",
                                                                        "bad": "0",
                                                                        "replies": [
                                                                            {
                                                                                "user_name": "speedyone",
                                                                                "time": "3 May, 2021",
                                                                                "context": "Haven't you embarrassed yourself enough?",
                                                                                "good": "0",
                                                                                "bad": "0",
                                                                                "replies": []
                                                                            }
                                                                        ]
                                                                    }
                                                                ]
                                                            }
                                                        ]
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "nosleepyjoe",
                "time": "2 May, 2021",
                "context": "If you actually read the article it said that the high winds would be lowest at night. Not sure about the grainy pic.",
                "good": "3",
                "bad": "1",
                "replies": []
            },
            {
                "user_name": "OrangeLeaf",
                "time": "2 May, 2021",
                "context": "Faked.......they really landed in a sewage treatment pit near El Paso..........",
                "good": "1",
                "bad": "5",
                "replies": [
                    {
                        "user_name": "cooper1950",
                        "time": "2 May, 2021",
                        "context": "Don't down-vote it.  He's being sarcastic.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "error": "error"
            }
        ]
    },
    {
        "error": "error"
    },
    {
        "user_name": "radov",
        "time": "2 May, 2021",
        "context": "Musk never set out to save the planet only to get rich. If there was a demand for coal burning stoves he would be selling them also.",
        "good": "1",
        "bad": "21",
        "replies": []
    },
    {
        "user_name": "radov",
        "time": "2 May, 2021",
        "context": "Who cares, but then again there are many fox fans in search of UFO's and QFO's.\nElons greed takes him on a quest to find a new planet to destroy.",
        "good": "1",
        "bad": "23",
        "replies": [
            {
                "user_name": "nicksj",
                "time": "2 May, 2021",
                "context": "Enjoy your hate.",
                "good": "13",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "bd0",
                "time": "2 May, 2021",
                "context": "Look at your phone, your tv, internet, computers, onboard technology in cars. If you don't understand that the quest to go to space has been driving all of the advancements then there is little hope for you",
                "good": "4",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "dataengineer",
                "time": "2 May, 2021",
                "context": "THIS ACCOUNT IS VIOLATING FOX NEWS POLICY. SWAT",
                "good": "0",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "whiskeyjack751",
        "time": "2 May, 2021",
        "context": "Their \"Woke\" NASA space suits, especially those funky, girly guy boots, make them look like Beverly Hills sanitation workers! You've got to be kidding me, couldn't NASA have come up with something more \"Top Gun\" in style, form and function? Makes you wonder, are they really heading to the ISS, or an suborbital garbage truck run?",
        "good": "0",
        "bad": "14",
        "replies": [
            {
                "user_name": "speedyone",
                "time": "2 May, 2021",
                "context": "NASA had nothing to do with the design of the suits.\nYou can tell because the SpaceX suits are modern, functional, and simple.",
                "good": "2",
                "bad": "1",
                "replies": []
            },
            {
                "user_name": "nosleepyjoe",
                "time": "2 May, 2021",
                "context": "Is that all you get out of this, their style of space suits? Go back to reading Vogue.",
                "good": "7",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "dataengineer",
                "time": "2 May, 2021",
                "context": "african bot troll...NASA is not involved. It's a Texas company called SpaceX, moving forward into the future. Somehow, you Russian operatives figured out how to get in. we know what you are. SWAT",
                "good": "4",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "RealitySucks",
                "time": "2 May, 2021",
                "context": "You are stuck in the 60s.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "TCSM",
        "time": "2 May, 2021",
        "context": "This is a great thing for the country and for mankind....hoping my kids are around to see man colonize in space....God knows we need an escape plan!",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "cooper1950",
                "time": "2 May, 2021",
                "context": "Pronouns.  Watch your pronouns.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "BlueMustache",
        "time": "2 May, 2021",
        "context": "Elon Musk for President of Texas.",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "papa1700",
        "time": "2 May, 2021",
        "context": "Congrats to Elon Musk and  SpaceX!!  Great to see astronauts transported to and from the ISS on American built spacecraft.  \n\nWhere is Boeing these days?  Ever since their uncrewed Starliner spacecraft got lost in space over a year ago I haven't heard anything.  If I remember correctly, they were initially awarded about twice the funding that was given to SpaceX for developing a spacecraft to take astronauts to the ISS.",
        "good": "25",
        "bad": "0",
        "replies": [
            {
                "user_name": "nicksj",
                "time": "2 May, 2021",
                "context": "They're still struggling to get their first demonstration flight going.  An obvious comparison between a century old bureaucratic company and a new innovative company.",
                "good": "9",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "dataengineer",
                        "time": "2 May, 2021",
                        "context": "I'm glad I don't work there anymore.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "Inquiringminds106",
                "time": "2 May, 2021",
                "context": "He had me with the convertible in space. Love it.",
                "good": "8",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "dataengineer",
                "time": "2 May, 2021",
                "context": "Boeing is so focused on getting everything done in 5 minutes that they skip steps that require thoroughness",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "mazchaz",
        "time": "2 May, 2021",
        "context": "Kamala:  I've had more nighttime splashdowns that SpaceX !",
        "good": "14",
        "bad": "0",
        "replies": [
            {
                "user_name": "Hbikerbob",
                "time": "2 May, 2021",
                "context": "funniest thing I've heard all weekend",
                "good": "2",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "clarkston",
        "time": "2 May, 2021",
        "context": "Great progress.  Impressive.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "af_vet",
        "time": "2 May, 2021",
        "context": "There's a new sheriff in town, SpaceX.  Boeing, you can go home now.",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "super_decathlon",
        "time": "2 May, 2021",
        "context": "At least we didn’t have an accident . Elon for Emperor!",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "radov",
        "time": "2 May, 2021",
        "context": "Why dont musk and besos donate 50B to save lives in countries that cant get vaccines.\nAtleast Gates spends his money helping people.",
        "good": "1",
        "bad": "21",
        "replies": [
            {
                "user_name": "thateldoo416",
                "time": "2 May, 2021",
                "context": "It's a tax-write-off for Gates...get a clue!",
                "good": "4",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "radov",
                        "time": "2 May, 2021",
                        "context": "So giving away your fortune is a tax write-off thanks for your accounting advice.",
                        "good": "0",
                        "bad": "4",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "injeun726",
                "time": "2 May, 2021",
                "context": "Because you aren't God, that's why.",
                "good": "7",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "radov",
                        "time": "2 May, 2021",
                        "context": "Maybe Biden is, 49% in taxes will be a nice charitable contribution by musk.",
                        "good": "1",
                        "bad": "3",
                        "replies": [
                            {
                                "user_name": "injeun726",
                                "time": "2 May, 2021",
                                "context": "Then he is off your hook. Wave bye bye to big fish.",
                                "good": "1",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "kheshig",
                "time": "2 May, 2021",
                "context": "It's funny that people always want to tell others how to spend their money. When you make 50B, please come to me and I will be happy to tell you where to spend it.",
                "good": "9",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "melon",
                "time": "2 May, 2021",
                "context": "Reducing the cost to reach orbit by two orders of magnitude will change the planet's economy in ways you clearly cannot comprehend.",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "hiwayne!",
                "time": "2 May, 2021",
                "context": "Yeah send their fortune to some 3rd world cesspool..... once they’re all vaccinated, they can go back to being a cesspool and spreading HIV around.... that’ll really advance humanity",
                "good": "3",
                "bad": "1",
                "replies": []
            },
            {
                "user_name": "cooper1950",
                "time": "2 May, 2021",
                "context": "Will that get us to Mars?",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "error": "error"
    },
    {
        "user_name": "BuckFoeJiden",
        "time": "2 May, 2021",
        "context": "Well done, SpaceX, NASA.",
        "good": "14",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "OrangeLeaf",
        "time": "2 May, 2021",
        "context": "I guess this is good news............",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Eggyokio",
        "time": "2 May, 2021",
        "context": "I’m sorry I find this whole man in space narrative boring. There is no patriotism involved. Watching rich people splashing into the water in expensive toys isn’t the same as a country trying to better itself.\nDo you cheer your buss driver for showing up. \nSo sorry NASA you’ve been taken over by Jeff and Elan frat rich boys.\n\n\n      BORING ",
        "good": "0",
        "bad": "15",
        "replies": [
            {
                "user_name": "blakedog",
                "time": "2 May, 2021",
                "context": "Showing up is the driver's job. I pay the bus driver even though I don't ride the bus. There is nothing he does that just about everyone else on the planet can do.",
                "good": "0",
                "bad": "1",
                "replies": []
            },
            {
                "error": "error"
            }
        ]
    },
    {
        "user_name": "Americant",
        "time": "2 May, 2021",
        "context": "We need more great Americans.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "OliveSword",
        "time": "2 May, 2021",
        "context": "So......The Great new technology space x came up with is the same as we had 50 years ago ?",
        "good": "1",
        "bad": "1",
        "replies": [
            {
                "error": "error"
            },
            {
                "user_name": "Americant",
                "time": "2 May, 2021",
                "context": "SpaceX is into a  whole lot more than crewed NASA missions. Google Starlink and Starship. Some awesome landings!",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "autorotator",
                        "time": "2 May, 2021",
                        "context": "50 years\nWright bros.  1903\nA Redstone R&D missile was flight tested on 20 August 1953.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "autorotator",
                "time": "2 May, 2021",
                "context": "Then, they had slide rules.  \nNow they have supercomputers.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "autorotator",
        "time": "2 May, 2021",
        "context": "Glad you got back before Karameleon took over.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Truonics",
        "time": "3 May, 2021",
        "context": "So.   Fix your Tesla's.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "newsjet641",
        "time": "2 May, 2021",
        "context": "Congratulations, SpaceX.  And the astronauts as well.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mark1963",
        "time": "2 May, 2021",
        "context": "If it was not for Mr. Musk and his vision of America getting back into space and with their own ships.  We wouldn't be in the position like we are for man's greatest adventure.  Mars.  Thank you Elon Musk.  For making it possible for NASA to stay in business. ",
        "good": "2",
        "bad": "0",
        "replies": [
            {
                "error": "error"
            },
            {
                "error": "error"
            }
        ]
    },
    {
        "user_name": "hhhaaa",
        "time": "2 May, 2021",
        "context": "Apollo 8 splashdown was at 10:51am ET, on December 27, 1968.\nThat's not at night.\n\nThe splashdown was about 5000 yards, or 3 miles, from the USS Yorktown ( recovery carrier).\nThe chutes and splashdown were easily visible in daylight from the Yorktown, and not just the recovery helicopters.\nThis reporting is not correct.",
        "good": "0",
        "bad": "4",
        "replies": [
            {
                "user_name": "slacktoad",
                "time": "2 May, 2021",
                "context": "Splashdown was in the mid Pacific, not the east coast, so the local time was 4:51 am.\n\n \"According to prior planning, helicopters and aircraft hovered over the spacecraft, and pararescue personnel were not deployed until local sunrise, 50 minutes after splashdown\"\n-- NASA, Apollo 8",
                "good": "4",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "hhhaaa",
                        "time": "4 May, 2021",
                        "context": "It is not dark before sunrise, especially in/on the open ocean.\nIf you look at the videos of the reentry and splashdown, as in the mission control center, unseen by most people, ever, the reentry, chutes, and spacecraft were visible, even from the carrier Yorktown. \nPerhaps our joy in the successful reentry and splashdown of the first flight to and from the moon, so close to the recovery ship, actually and visually, and or the radio, in real-time, overwhelmed our senses as to whether it was occuring in \"darkness\".\nWho cares about that. \nWe had just sent man to the moon and back, successfully, and all was good!!!",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "hhhaaa",
                                "time": "4 May, 2021",
                                "context": "Perhaps MSM wants to diminish the successful accomplishment of private industry, i.e. SpaceX, vs. the supreme government represented by NASA.\nActually, not much has changed, industry did and continues to do 95+% of the work and NASA and the government wants to take credit for the successes.\nDifference is that that back then, in Apollo, NASA actually had really good people thayt did great things. But, not without the greatness of the industry and non-government people who actually did 95+% of the real work.\nNASA and the government it represents still tries to control the narrative and they significantly control the dollars.\nDifference is, it is much clearer that NASA is not really needed for actual accomplishements and achievements.\nEven if you look behind the PR for the Mars unmanned mission, industry is/are the real ones making it happen.\nNASA is just taking the credit as they always have. And, if things fail, then they blame others, i.e. industry.\nIt is the gubernment way!!!!",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "chiefsbrat",
        "time": "3 May, 2021",
        "context": "Scary thought doing a water recovery at 3:00 a.m. \nAt least Apollo 8 was close to nautical twilight.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Americant",
        "time": "2 May, 2021",
        "context": "If Astronauts are \"American heros\" so is Elon Musk.",
        "good": "4",
        "bad": "1",
        "replies": [
            {
                "user_name": "GreenBike",
                "time": "2 May, 2021",
                "context": "Elon musk is South African.",
                "good": "0",
                "bad": "2",
                "replies": []
            }
        ]
    },
    {
        "user_name": "dataengineer",
        "time": "2 May, 2021",
        "context": "well...within a day, the automated bot troll account creation system has taken over fox social media. but at least they're on our side except for one or two.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Americant",
        "time": "2 May, 2021",
        "context": "Im glad they're on our side.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "autorotator",
                "time": "2 May, 2021",
                "context": "I think Alpha Centauri has dibbs,",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    }
]