[
    {
        "user_name": "theyarelying",
        "time": "27 September, 2022",
        "context": "No surprise the FBI and the DOJ are just democrat pawns now. They turn the other way with the terrorist group Antifa too.",
        "good": "11",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "😲gam-esq5.0😲",
        "time": "27 September, 2022",
        "context": "Thanks to Joe and the Ho, we now live in a sham Republic just like any other \"People's Republic\".  This all has to change in 2022 and later in 2024....",
        "good": "30",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bidenhtr",
        "time": "27 September, 2022",
        "context": "Merrick Garland should be in prison.",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Ooltheuncanny",
        "time": "27 September, 2022",
        "context": "How many eye witnesses came forward with info on the vandals that targeted these “pro life” sites?  Maybe Jarrett, instead of lazily and inaccurately feeding righties a diet of unfounded outrage, could’ve looked into that.",
        "good": "1",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "fuji739",
        "time": "27 September, 2022",
        "context": "Garland is pure evil and needs to be removed",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "SineSimulatione",
        "time": "27 September, 2022",
        "context": "Everyone says that the rank and file FBI agents are not the problem with the FBI’s culture.  I disagree.  The rank and file agents need to stop participating in this type of biased law enforcement.  If that means losing their jobs, they need to be willing to lose them to stand up for what is right.  Until the rank and file refuse to participate in this one-sided enforcement of our laws they will be part of the problem, and not part of the solution.",
        "good": "179",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "XYismale",
        "time": "27 September, 2022",
        "context": "Everything is n video somewhere. The protest. The raid. If there is any truth to the FIBs story it would have been leaked by now.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "irrefutablesources",
        "time": "27 September, 2022",
        "context": "Jewish AG Garland doing his Tribe Soros, Schumer, Bloomberg & Weingarten's work by going after Christians openly now..\n\nHistory repeating itself.",
        "good": "10",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "woodyjones",
        "time": "27 September, 2022",
        "context": "Shows the corruption in our nations FBI and justice dept. The FBI should be totally disbanded. Fire every agent because they are all crooked. either start something new for America or allow the state police of each state to work law enforcement.",
        "good": "17",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "clearthinking2024",
        "time": "27 September, 2022",
        "context": "Why is s the FBI involved in an assault charge, not a federal issue, when the local police believed his defense after they watched the video of the guy harassing his 12 YO child? If they are getting involved with assault arrests with using SWAT, why did the FBI use SWAT to arrest the boyfriend of the Democrat rep for when they punched a protestor? Two-tiered justice system and the FBI has  become weaponized against those that disagree with the liberal agenda.",
        "good": "64",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "benfranklin553",
        "time": "27 September, 2022",
        "context": "Sorry folks, this is communism. It’s here😢",
        "good": "15",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "politicalzoo",
        "time": "27 September, 2022",
        "context": "For 6 years FBI has been a political weapon wielded by disgruntled democrats... it's not getting better.",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "hmelton",
        "time": "27 September, 2022",
        "context": "...our \"gubbermint\" has failed to see that as American's, we are Citizens.  Not Subjects.",
        "good": "7",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Oysterman",
        "time": "27 September, 2022",
        "context": "Garland/Wray just 2 more traitors to America along with Biden.",
        "good": "12",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "bansocialist",
        "time": "27 September, 2022",
        "context": "this administration are domestic  terrorist ",
        "good": "8",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "reallyfakenews",
        "time": "27 September, 2022",
        "context": "This administration has declared war on conservatives. They are pure evil.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "LoneStarRanger",
        "time": "27 September, 2022",
        "context": "This is not an isolated incident.... its happening to American Patriots all over the country.",
        "good": "10",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "sail4",
        "time": "27 September, 2022",
        "context": "this is not fixable - we must reboot it from a Skelton after a major purge",
        "good": "26",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "john195577",
        "time": "27 September, 2022",
        "context": "Where was Pennsylvania law enforcement?  If this guy pushed that old man he should be arrested...  For pushing an old man.  Simple assault.  Sheriff's deputy.  Probably one, at the most two.  And if somebody is going around communicating credible threats, they need to hunt them down and arrest them.  Absolutely none of this situation or really any of these abortion situations need to fall outside the state laws that have been violated.  Abortion is a state issue.  Get used to it.  We all have to.  If the DOJ and FBI want to arrest somebody, how about going down down to Texas and arresting a few people for illegally entering the United States?  A federal offense.  They seem to be more than willing to leave that problem in the hands of the states, federal responsibility notwithstanding.   They need to fire everybody in the FBI above the rank of branch head and start over.   The FBI leadership has forgotten what business they are in, and they refuse to be reminded.  I blame the FBI because they were on the scene.  They could have communicated with local authority and deferred to that authority in spite of the agenda at the DOJ.  It is called risking your job to maintain your integrity.  We all have to from time to time, and sometimes it does not end well.  But it was their turn.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Termlimits999",
        "time": "27 September, 2022",
        "context": "The FBI is only a shell of its former self.  Obama completely transformed it into a democrat enforcement agency.",
        "good": "16",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "tiredofdemhysterics",
        "time": "27 September, 2022",
        "context": "Democrat fascism.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "critter885",
        "time": "27 September, 2022",
        "context": "So shameful, read your Bible and you'll see what's happening",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tiredofuseless100%",
        "time": "27 September, 2022",
        "context": "Time to close the FBI. \nThe DoJ can work through the states’ law enforcement agencies to apprehend their suspects, after the states’ legal department has previewed what the apprehension is about. \nAin’t perfect but it neuters the ability of this partisan Nazis Gustapo tactics.",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "whydowecare",
        "time": "27 September, 2022",
        "context": "Several FBI agents for a shoving match???? Yep that sounds like something a dictator would do.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "therewasnofraud",
        "time": "27 September, 2022",
        "context": "Hey Gregg Jarrett.  You know nothing about the law, FBI and even less about life. Get a real job.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Bamatix17",
        "time": "27 September, 2022",
        "context": "I wonder what kind of personal security Garland and Wray have???",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tadbittipsy",
        "time": "27 September, 2022",
        "context": "the american people are plenty enough equipped to deal with these new kgb's of the democrat party.",
        "good": "12",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "biscuitcrux",
        "time": "27 September, 2022",
        "context": "Corruption 101\n\nThat IS government.",
        "good": "9",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "tiredofdemhysterics",
        "time": "27 September, 2022",
        "context": "Put the fascists in the DOiJ and FIB in jal!",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "fbiworthless510",
        "time": "27 September, 2022",
        "context": "DOJ AND FNI read these posts trust me. they know they are corrupt and they are looking for anyway to push their political agenda. ",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "falcon84",
        "time": "27 September, 2022",
        "context": "Ultimately Garland and Wray are not to blame in this GESTAPO action.  Biden is with his calling 50% of the people terrorists and further alienating many independents who see such rhetoric for what it is.  If those who solidly oppose the democrats' socialist plans can be called terrorists and lose their rights, what will happen when they need a new goat to scape?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "usernameisblank",
        "time": "27 September, 2022",
        "context": "Good thing they arrested this guy.\n\nA baby could have died....",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Bullseye10x",
        "time": "27 September, 2022",
        "context": "“ruby ridge”, “davidson compound”, fbi has a history of violence against Americans",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "uniqueusername",
        "time": "27 September, 2022",
        "context": "At best you have a simple assault charge (local). Summons releasable. To send the FBI SWAT team is a clear signal that the DOJ is proactively engaging in political persecution. Attacking democracy and the very freedom countless Americans supposedly died to protect. Though it seems they truly died to protect the establishment elitists and their ability to trample on your constitutional rights.",
        "good": "59",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "dsdambo",
        "time": "27 September, 2022",
        "context": "Christopher Wray lives in Atlanta. Anyone wanna dig up that addy?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "fargotom",
        "time": "27 September, 2022",
        "context": "We the people need to stand up against this tyranny!",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Bidenisaloser1",
        "time": "27 September, 2022",
        "context": "The truth probably is the man was at the baby killing office and the intolerant employee instigate a scene. ",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rattlebait",
        "time": "27 September, 2022",
        "context": "Joe Biden and his administration are doing more damage to the constitution and our freedoms that November 2022/2024 can't get here fast enough...\nVote!!!  No EXCUSE!!!",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "aquagotchie",
        "time": "27 September, 2022",
        "context": "Want to know how to get the secret name of the \"victim\"?  Log onto the County Clerk's website and search under Mr. Houck's name.  The lawsuit will show up, with all names on the front cover.  You're welcome.  Please spread the name everywhere, because you're not supposed to do that.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "RoadRunner57",
        "time": "27 September, 2022",
        "context": "Garland and Wray need to resign immediately. The Federal police state must stop!",
        "good": "41",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "web3",
        "time": "27 September, 2022",
        "context": "It is in your face if you are not a democrat. DOJ/FBI are really showing their true blue colors.",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "RoadRunner57",
        "time": "27 September, 2022",
        "context": "This is Obama's and Rice's handy work!",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jimmy45",
        "time": "27 September, 2022",
        "context": "The FBI is filled with piglets who hate America",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "yarnavy15",
        "time": "27 September, 2022",
        "context": "The FBI is a political arm of the DNC now. It needs dismantled and rebuilt. Where are the BLM. Antifa,  terrorist border crosser arrests? No, they raid an elected Presidents home and crickets on Nancy and Hunters business affairs.",
        "good": "12",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "harveystockdale",
        "time": "27 September, 2022",
        "context": "The FBI have become the 2022 version of \"Biden's Brown Shirts\" and have irreparable harm to the trust that Americans once had in this national police force.  In 43 days the GOP controlled house and senate needs to charge a number of people in the current government with sedition.",
        "good": "12",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bsrepellent",
        "time": "27 September, 2022",
        "context": "The DOJ, and FBI need to be completely gutted out, and rebuild with actual good, honest citizens!",
        "good": "13",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Wren_27",
        "time": "27 September, 2022",
        "context": "Locked and loaded!  I dare them.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "johnn707",
        "time": "27 September, 2022",
        "context": "President Trump may have hurt your feelings, but Joe Biden is hurting your family,finances & your freedom",
        "good": "14",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "wkwtow",
        "time": "27 September, 2022",
        "context": "Brown Shirts",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "wkwtow",
        "time": "27 September, 2022",
        "context": "Still waiting on the body cam footage.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "OhWell466",
        "time": "27 September, 2022",
        "context": "You would think they were building something with as much framing they do.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "heir_of_romulus",
        "time": "27 September, 2022",
        "context": "Don't worry white suburban soccer moms, the doj and fbi haven't forgotten about you ",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "frmerlevet",
        "time": "27 September, 2022",
        "context": "Eric Holder proudly announced that he was Obama's \"wing man\", that was the start",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "MarkOB",
        "time": "27 September, 2022",
        "context": "Everyone who is aware of any political persecution by the DOJ and FBI is complicit. It’s not OK to look the other way!",
        "good": "11",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Bidenisaloser1",
        "time": "27 September, 2022",
        "context": "All the evil crime they are ignoring to do Biden’s bidding. ",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tr34",
        "time": "27 September, 2022",
        "context": "Civil actions only require a preponderance of the evidence & the case was tossed. Criminal cases require Probable Cause which is a much higher burden not to mention pushing someone typically is a disorderly persons offense. There better be a whole lot more to this case for the FBI actions that took place.",
        "good": "30",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "jha1941",
        "time": "27 September, 2022",
        "context": "abolish/defund the FBI BROWN SHIRTS. Establish a real law enforcement organization with a Constitutional basis to perform its mission. DO NOT permit any current BROWN SHIRTS to serve in the new organization. Instead offer them retraining as school crossing guards. ",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "johnn707",
        "time": "27 September, 2022",
        "context": "If Jean-Pierre thought US cities were safe, she would have said so.  Anytime someone asks  a question as straightforward as \"Are US cities safe?\" and is answered with a deflection like \"It's not a yes or no question\", it's obvious the question hit a sore spot and the answer really is \"no\".",
        "good": "54",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Doomer",
        "time": "27 September, 2022",
        "context": "Scary behaviour!",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "domino2121487",
        "time": "27 September, 2022",
        "context": "Ever notice the labeling from Progressive Liberal Democrats against anyone who has a different view on a subject? They really do know all these different labels they try to pin on people cause what they call others is really themselves. All they need to do is look in a mirror to see what they accuse others of being. Progressives are nothing more than bullies!! ",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Jack'sPot",
        "time": "27 September, 2022",
        "context": "AMERIKA! Biden is the death of a republic. Merry Fentanyl to the left.",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "SickofCriminals",
        "time": "27 September, 2022",
        "context": "Trump was president for 4 years and he failed to fire these Marxists in our gov't.  In fact, he appointed FBI Director Wray, a card carrying Marxist Democrat.  Trump failed in many ways, he talked the talk, but didn't walk the walk.",
        "good": "0",
        "bad": "7",
        "replies": []
    },
    {
        "user_name": "PoppaT",
        "time": "27 September, 2022",
        "context": "I would like to know what the activist said to the 12 y.o. son!! As a father, you curse my son or verbally threaten him in front of me? You're going down! End of story! This appears to be what the local LEOs came up with: It was simply a case of a father defending his children. Should have been the end of it! But, no! The government had to weaponize the federal officials to make a point! WAKE UP PEOPLE!!!! YOU COULD BE NEXT!!",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "templarknight484",
        "time": "27 September, 2022",
        "context": "time to clean house America.  doh needs a complete rebuild when Trump is back!",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "agoldengloves",
        "time": "27 September, 2022",
        "context": "The rank and file FBI Agents are just as bad as the senior leaders in DC, for participating in these abuses and violations of constitutional and civil rights.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Christobol141",
        "time": "27 September, 2022",
        "context": "Yep. The FBI is a Biden Schill.",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "americafirststeve",
        "time": "27 September, 2022",
        "context": "This administration doesn’t even try and hide their partisanship anymore. Garland and Wray will do whatever their handlers tell them to do without questioning why. Every day we get one step closer to Marxism.",
        "good": "50",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "therover178",
        "time": "27 September, 2022",
        "context": "civil war or starvation ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "SickofCriminals",
        "time": "27 September, 2022",
        "context": "AG Garland and FBI Wray have ruined the FBI, turned it into a Democrat Party political weapon.  So sad the FBI has been coopted by the Joe Biden and the Democrats.  It's going to backfire on them though.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "make2024better",
        "time": "27 September, 2022",
        "context": "FBI is a Political weapon for the Democrats ...bought and paid for with our tax dollars...they are working for a political party that's not for all the people only for their side.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "theonetheonly",
        "time": "27 September, 2022",
        "context": "Patriots:\nIf you don’t like how things are/were, VOTE in every election 2022 / 2024…. (especially local elections) from dog catcher to bonds to levies to mayor to school board member and ALL state and fed level elections. \n \nLook up the voting dates on your state website, put them into your calendar to remind you, VOTE and remind others. Don’t give the liberals a chance to grow again and please, DO NOT be complacent, make it a priority….\n \nIf you aren’t proactive, your community could turn into a Minneapolis / Portland Oregon / Austin gem with liberals escaping their own mess by moving to your area……… \n \nPerpetual vigilance and action, VOTE and get others to, dog catcher to president.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "txbart",
        "time": "27 September, 2022",
        "context": "Our alphabet federal,agencies have been busy destroying a century of trust, their predecessors built up. The DOJ, IRS, and FBI have a real image problem. They are feared but no longer respected. All the facts will come out at trial. I worry  the media will cover up.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "TheRepublicMatters🎬",
        "time": "27 September, 2022",
        "context": "This is insane.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "fedup1968",
        "time": "27 September, 2022",
        "context": "Full tactical swat team to arrest a guy for a simple arrest warrant. All you need to know right there that this is nothing more than Biden's Gestapo!",
        "good": "17",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dt10",
        "time": "27 September, 2022",
        "context": "This is selective law enforcement based on political ideology and it must stop or we will lose our democracy. They will attempt to do the same thing with Trump, charge him for the same crime Hillary committed, and it must not be tolerated. If Trump gets charged with any classified information crime then we must demand that Hillary be charged also. We must never tolerate a dual system of justice based on ideology.",
        "good": "91",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "johnlee966",
        "time": "27 September, 2022",
        "context": "Never listen to what a Democrat says, when they speak!  Always pay attention to what they actually do!  Their radical and controlling nature is on display for all Americans to see!",
        "good": "13",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "great_intuit1",
        "time": "27 September, 2022",
        "context": "Trump had 4 years to clean house at FBI and did nothing. DeSantis 2024!",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "DUnsworth",
        "time": "27 September, 2022",
        "context": "There is something very sinister and dangerous happening in our government.  I fear it is only going to get worse.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "SamSource",
        "time": "27 September, 2022",
        "context": "Disgusting. Same with BLM riots no accountability ",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "justme632",
        "time": "27 September, 2022",
        "context": "Maybe in Jan 23 Merrick will receive a knock at his door ",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "suzon",
        "time": "27 September, 2022",
        "context": "Republicans and conservatives will all be persecuted  by a democrats’ “Gestapo”  if we do not win in NOV.  VOTE VOTE VOTE!!! We must unite to stop the Democrats one party regime.  ",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "falcons24",
        "time": "27 September, 2022",
        "context": "FBI/DOJ is a strong arm for the Sloe administration.  The FBI is an embarrassment.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "keneverett",
        "time": "27 September, 2022",
        "context": "Merrick Garland seems to have the same temperament as a frustrated chicken farmer in 1930s Germany.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "gericurl",
        "time": "27 September, 2022",
        "context": "This is called communism. Democrats are COMMUNISTS!!",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ToldYouSo0274",
        "time": "27 September, 2022",
        "context": "Awwwwwe, well maybe you shouldn't get into altercations with senior citizens. How bout that.",
        "good": "1",
        "bad": "9",
        "replies": []
    },
    {
        "user_name": "liberalismisapandemic",
        "time": "27 September, 2022",
        "context": "Gestapo tactics",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "frankpadia",
        "time": "27 September, 2022",
        "context": "So now a verbal argument and a shoving match warrant arrest by the FBI?   Suddenly this is a Federal case?  Seriously?  Major drug traffickers are being caught and released by local DAs but the FBI is going after “dangerous criminals” like this man?   All Garland does every day is prove why keeping him off the SCOTUS was the most brilliant decision of McConnell’s political career.  Obama appointed him because he knew this is who he is.  A dangerous, leftist activist with little regard for the Constitution or the law.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "agoldengloves",
        "time": "27 September, 2022",
        "context": "FBI legion of demons doing the devil's work.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "qfakedthemoonlanding",
        "time": "27 September, 2022",
        "context": "\"deeply religious\" men shouldn't be assaulting 72 year olds escorting medical patients.",
        "good": "0",
        "bad": "10",
        "replies": []
    },
    {
        "user_name": "Zegna140311",
        "time": "27 September, 2022",
        "context": "Jarrett, Carlson, Hannity, Ingram, they are all great at creating outrage but they do nothing to get us organized, find good leadership or develop a Plan to push back. They will write books, though, and make $$$ off of our fear and suffering.",
        "good": "0",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "runningbum",
        "time": "27 September, 2022",
        "context": "In another article the nu per of FBI agents were anywhere from 15-25.  The agency said between 15-20 agents.  Really??  They needed 15-20 agents to arrest a person for essentially a misdemeanor that occurred over a year ago.  Talk about excessive force.  Not to mention the penalty for the crime is extremely excessive.",
        "good": "32",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "elbowsmcfadden",
        "time": "27 September, 2022",
        "context": "How can anyone who assaults the elderly consider themselves a Christian?",
        "good": "0",
        "bad": "8",
        "replies": []
    },
    {
        "user_name": "azbitesback",
        "time": "27 September, 2022",
        "context": "Comrades! Pennsylvania pro-life activist's arrest puts DOJ, FBI injustice and their Marxist POLITICAL One-sidedness on full display!",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "r.w.b!!also460",
        "time": "27 September, 2022",
        "context": "And I will say once more who are the FASCIST Nazis?",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "marbyn",
        "time": "27 September, 2022",
        "context": "They should be wearing brown shirts with SS on the collar. That is what they have turned into.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "vaffanculo....",
        "time": "27 September, 2022",
        "context": "This man was protecting bis 12 year old son from a crazed democrat. Of course the KGBFBI hunted him down.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "nomad1965",
        "time": "27 September, 2022",
        "context": "A government run by criminals.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "justme632",
        "time": "27 September, 2022",
        "context": "I wonder why the dems are doing this don’t they understand it will only go to prove that the same thing can happen to them ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "OliveSubmarine",
        "time": "27 September, 2022",
        "context": "Big brother called. I’m out.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dneaster",
        "time": "27 September, 2022",
        "context": "Hitler's Brown-shirts,would be proud of the FBI,( Federal Bureau of Intimidation)!!",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sailorscreek",
        "time": "27 September, 2022",
        "context": "Be afraid.  Be very very afraid.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "derek01",
        "time": "27 September, 2022",
        "context": "Politicians and officials who try to change America into a banana republic need to enjoy socialism in a maximum security prison. There should be no statute of limitations for such behavior.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "l.l.",
        "time": "27 September, 2022",
        "context": "The DOJ and FBI have proven to be nothing more than the Democrats lap dogs and have lost all credibility with the general public. ",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "md1983",
        "time": "27 September, 2022",
        "context": "The FBI has turned into a group of thugs run by the Dems crime family. ",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "horace",
        "time": "27 September, 2022",
        "context": "Surprised that the DOJ took assets away from looking through Trump’s photos and magazine clippings from their raid on his home to arrest this person.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "agoldengloves",
        "time": "27 September, 2022",
        "context": "As a juror, I will vote to acquit any defendant in a trial with FBI evidence or testimony no longer credible.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rightwinggunnut",
        "time": "27 September, 2022",
        "context": "For at least the last 30 years the FBI has shown nothing but contempt for the American public. They have become government “to” the people not for the people. The very fact that agents didn’t get locked up for the Branch Davidian debacle or that Hillary hasn’t been imprisoned for the litany of things she has done proves exactly that. Then there is the illegally obtained FISA warrants used against Trump. The FBI doesn’t need a restructure it needs to be torn down, we have enough federal policing agencies! I think the average citizen would be absolutely shocked if they knew what was going on in half of the government buildings in this country. There would be a revolution like never seen before, citizens would want to burn the buildings down with the offending people in them.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "deathtoalldemocrats",
        "time": "27 September, 2022",
        "context": "When that democrat campaigner comes to your door, show him what you think about him the second he steps on your land. :-)",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "marie72756",
        "time": "27 September, 2022",
        "context": "Republicans like Hawley and Cruz and Sarah Sanders were attacked ruthlessly both In public and in their homes, their families threatened repeatedly ,, No Arrest or Raids.. \nTell me again how the DOJ, FBI is Not targeting Conservatives and Republicans?",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "antonioz",
        "time": "27 September, 2022",
        "context": "If someone gets in your kids face screaming obscenities you should definitely intervene. The FBI is showing their political affiliation more brazenly then ever.",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "docholliday1888",
        "time": "27 September, 2022",
        "context": "Abolish the FBI..",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "s.m.lucas",
        "time": "27 September, 2022",
        "context": "Bidens Gestapo...",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bidenisaclown205",
        "time": "27 September, 2022",
        "context": "Bullies with badges lead by facist, left wing semi-dictators.  If I was an FBI agent, I sure wouldn't tell that to people who ask me what I do for a living.",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "SpeechFree480",
        "time": "27 September, 2022",
        "context": "Wray and Garland are the Himmler and Goebbels of our world.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "deplorable1776369",
        "time": "27 September, 2022",
        "context": "I’d like to solve the puzzle Pat!   “Extreme Progressive Liberalism!  ",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cvn73-e06",
        "time": "27 September, 2022",
        "context": "When the Republicans take back every form of the government, all FBI and DOJ agents should be fired if participating in these so called hit jobs on Trump and others.",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "marie72756",
        "time": "27 September, 2022",
        "context": "Hey if Hirono, Ryan , and Warren  all  setting members  of Congress, say its 'A Call to Arms' that \" Killing is justified\" then I would have to assume we are at war and Defend Myself.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Steeler58484",
        "time": "27 September, 2022",
        "context": "So glad Garland is not on Scotus.",
        "good": "7",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "dadof7seven",
        "time": "27 September, 2022",
        "context": "Most of us saw the hand writing on the wall after old Joe was installed in office. We are a land of declining morals, dubious laws, and political attacks sponsored by this regime. It is time to fight back.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ralphkamdon",
        "time": "27 September, 2022",
        "context": "This guy and those like him are some of the reasons I carry.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "lukendixie",
        "time": "27 September, 2022",
        "context": "The red tsunami can't come soon enough.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Phaedrus39",
        "time": "27 September, 2022",
        "context": "The surprise arrest with armed police pointing guns in the presence of children reminds of something you would see from the FSB in Russia.",
        "good": "11",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "allonsye",
        "time": "27 September, 2022",
        "context": "If Republicans do not return the favor to democrats after they gain in power this fall, you’ll know that they are useless as far as an opposition to tyranny goes. Until there such an opposition, the unjust beatings will continue. ",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "twilight12",
        "time": "27 September, 2022",
        "context": "Sounds like this is Russia and not the US!",
        "good": "8",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "yomamma7452",
        "time": "27 September, 2022",
        "context": "As always, the DOJ and FBI are the most corrupt government agencies ever.",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "RecessionsAreConsequential",
        "time": "27 September, 2022",
        "context": "Fed brass ordering needless raids to tip election scales for unworthy Leftist Democrats.",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "trinity6145779",
        "time": "27 September, 2022",
        "context": "Here is my question, should this not been a local law enforcement matter, why is the FBI showing up with a SWAT team etc to serve a warrant on one man.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "righttime23",
        "time": "27 September, 2022",
        "context": "Woe is me\nTeacher they're picking on me\nWhat a bunch grade schoolers \nGrow up",
        "good": "1",
        "bad": "8",
        "replies": []
    },
    {
        "user_name": "Demosthenes2",
        "time": "27 September, 2022",
        "context": "A violent felon was arrested.\nThat is a good thing.\nPretending that he is a victim is just more hate speech and lying from the right wingers who think that violence from their supporters is not crime.",
        "good": "3",
        "bad": "8",
        "replies": []
    },
    {
        "user_name": "oneguy481",
        "time": "27 September, 2022",
        "context": "So let me fill people in around the country as to what is happening in New York state. As part of her campaign to to be elected governor, acting Governor Hochul is sending out pamphlets and flyers labeling her opponent Lee Zeldin an extremist that is unfit for office. What makes Lee an extremist according to the flyer? The only item mentioned is the fact that he is pro-life and believes that life begins at conception. Apparently Governor Hochul please anybody with that view is an extremist. In a way I can't blame her for investing all her energy into this campaign strategy. New York state is suffering. New York City has an out of control crime problem. Clearly she has to deflect from that.",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "vaffanculo....",
        "time": "27 September, 2022",
        "context": "If a 72 year old got in my kids face screaming obscenities I'd shove them too. Don't mess with people's children",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rep57568",
        "time": "27 September, 2022",
        "context": "The swamp definitely needs more cleaning.",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "stath",
        "time": "27 September, 2022",
        "context": "the gestapo and the SS are at it again",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "henrinam",
        "time": "27 September, 2022",
        "context": "FBI =  KGB",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "One_Eye",
        "time": "27 September, 2022",
        "context": "There is no doubt that in the FIB, right now, there are agents setting up \"insurance policies\" for 22 and 24 elections. Peter and Lisa destroyed any and all credibility of that agency ",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Curmudgeon",
        "time": "27 September, 2022",
        "context": "This is a gestappo, face the reality folks.  They are fighting for the ruling parties control and are no longer a police force.",
        "good": "10",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "globetrotterIwish",
        "time": "27 September, 2022",
        "context": "We hear “the majority of the DOJ & FBI are great people, it’s the ones at the top....”. Obviously not!  Sounds like basic thugs who go along with terrorizing normal citizens",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "yasteril",
        "time": "27 September, 2022",
        "context": "At this point a long, hard look needs to also be taken at the agents who participated in these obvious abuses of power because they've betrayed their oaths too.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "buzzard10264",
        "time": "27 September, 2022",
        "context": "The democrats certainly seem bent on a second Civil War. It makes one wonder about their mental stability. For instance, one question comes to mind. Of the almost 500 million legally owned firearms in America, how many are owned by liberal, progressive, democrats? Just wondering.",
        "good": "6",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "AmericansLost",
        "time": "27 September, 2022",
        "context": "Get used to it unless Americans stand up to these thugs.",
        "good": "7",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Whitey9876",
        "time": "27 September, 2022",
        "context": "The rank and file go along because they are all one and the same. We will never hear about the agents that do quit because of their principles. The whole government and education centers in this country have been corrupted. They need to be torn down and rebuilt ",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dog63",
        "time": "27 September, 2022",
        "context": "Greg, well said and\"AMEN\" 👏 👍",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mc56",
        "time": "27 September, 2022",
        "context": "We are close folks.  The Second Amendment is there to protect us from this stuff.  I don't want to go there but they are pushing us to the limits.  I agree with an earlier poster, if the rank and file have to leave the FBI or any other federal KGB/Gestapo agency then do it, but don't expect us to exempt you just because you \"were following orders\".  If we can get a conservative House and Senate and impeach biden and kackala then we can get rid of the FBI/KGB/Gestapo and other federal bureaucracies that make \"... Life, Liberty and the pursuit of happiness\" impossible.",
        "good": "12",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "eatit",
        "time": "27 September, 2022",
        "context": "The department of “Justice” and the FBI are national disgraces especially the FBI which at one time was a source of pride",
        "good": "12",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "ohiogrown",
        "time": "27 September, 2022",
        "context": "War on Women. ",
        "good": "0",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "tholion269",
        "time": "27 September, 2022",
        "context": "Ok Garland needs to be impeached.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rvsnavely",
        "time": "27 September, 2022",
        "context": "Think this is bad, just wait until  all the new armed IRS agents/Thugs getstarted on the taxpayers.  You haven't  seen anything yet.  The next 2 years will get nasty, because of the Socialist, trying to grab power, using every thing they can againist anyone  one that dares to say no, to their agenda.",
        "good": "8",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "dorakichi",
        "time": "27 September, 2022",
        "context": "I have difficulty trusting the accounts of either side in this story.",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "tony727026",
        "time": "27 September, 2022",
        "context": "News flash: the FBI has been 100% corrupt since it’s inception. Did everyone forget what J Eggar Hover did with the FBI for it first 47 years ? \n    I never realized that this happened a year ago and had its day in court, and was dismissed, rightly so. This is absolutely a display of absolute power ",
        "good": "9",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "maxman492",
        "time": "27 September, 2022",
        "context": "FBI equals KGB",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sailorscreek",
        "time": "27 September, 2022",
        "context": "It appears HHS is joining in.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "🍻fizzyliftingdrinks🍻",
        "time": "27 September, 2022",
        "context": "What, was Elian Gonzalez not home for the FBI to terrorize again? Or perhaps a School board meeting?  The only terrorists still operating in the United States are homegrown and have 3 letter initials working out of Langley and D.C. \n\nhttps://www.foxnews.com/world/elian-gonzalez-onetime-political-football-now-a-college-grad-in-cuba",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "CaptainUSofA🇺🇸",
        "time": "27 September, 2022",
        "context": "You can go after Pro Life Conservatives with a weaponized FBI/DOJ, Parents at School Board Meeting who object to Critical Race Theory and Members of the Supreme Court of the US that voted to overturn Roe V. Wade and give the decision back to the States with impunity under the Harris-Biden Administration. Note to the Republican Party when you take over in November? Make sure Attorney General Merrick Garland is impeached immediately following Alejandro Mayorkas - the intentionally inept United States Secretary of Homeland Security fostering the current fiasco on our nation’s Southern Border. November cannot get here soon enough…..",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "sam1775",
        "time": "27 September, 2022",
        "context": "The Department of Just Us (Loyal Socialist Democrats)",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "uhoseriiii",
        "time": "27 September, 2022",
        "context": "Merrick Garland is a small man. Not just in stature but in his integrity. He is a bully because he can be one.",
        "good": "8",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "flash67",
        "time": "27 September, 2022",
        "context": "Mr. Garland along with the FBI has been a disgrace and they have lost all credibility  with well over 70% of this country. ",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sandmansmith",
        "time": "27 September, 2022",
        "context": "The FBI was a political police force from its beginning under J. Edgar Hoover and has worsened dramatically under the Biden Administration.  Garland must be held accountable by the expected Republican legislative majority and so with his toady, Director Wray!  Get out and VOTE!  Those who aid and abet this sort of governmental terrorism must be removed from office!  ",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "armyvet163",
        "time": "27 September, 2022",
        "context": "this is george soros, niden and obamas way of creating a communist dictatorship in america.  if Democrats lose the election marshal law will be declared ",
        "good": "10",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "ram1530",
        "time": "27 September, 2022",
        "context": "The American Gestapo at work!!!",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sensei",
        "time": "27 September, 2022",
        "context": "Shame on ALL members of the FBI",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ingleside",
        "time": "27 September, 2022",
        "context": "Any government agencies doing the bidding of tyrants under the color of law are traitors to the American people.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Steeler58484",
        "time": "27 September, 2022",
        "context": "Why don’t we hear of the democrats that get this kind of treatment?",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "gokartmozart",
        "time": "27 September, 2022",
        "context": "The fish rots from the head down.  But rank and file agents are voluntarily participating in openly politically partisan raids, arrests against Christians and Conservatives but ignoring the systemic violence of BLM, ANTIFA, etc. it indicates the entire agency has been corrupted and has outlived its usefulness",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "drwds",
        "time": "27 September, 2022",
        "context": "Apparently abortion clinics have federal protected status, but pro-life clinics do not.  The FBI has no interest in searching for the criminals that targeted over a dozen pro-life centers.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "smartthink",
        "time": "27 September, 2022",
        "context": "Democrats have just gone nuts. years of ADHD meds, depression meds, and pot smoking have had the expected results. None of them are capable of clear thought and these radical actions are proof of it.",
        "good": "3",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "Bring_It_On",
        "time": "27 September, 2022",
        "context": "As the GOP sits back  Doing-Nothing as usual with their thumbs up their....",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "soggyshoes",
        "time": "27 September, 2022",
        "context": "Local sheriffs need to rise up and protect their jurisdictions.  And Good able-bodied men join your local posse and become engaged.  And vote the dems out and then prosecute those who were complacent in these abusive processes that have been happening.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "progressives8rfreedoms",
        "time": "27 September, 2022",
        "context": "The Marxist Dims political weaponization of the formerly trusted DOJ and FBI will take a few years to clean up after the GOP retakes the WH in 2024.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "speakeroftruth",
        "time": "27 September, 2022",
        "context": "The left can only push so far, then it gets ugly.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sendintheirklowns",
        "time": "27 September, 2022",
        "context": "The Stalinist DOJ at its finest.",
        "good": "3",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "ed209",
        "time": "27 September, 2022",
        "context": "Did the FBI goose-step up to Houck's door?",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "malemes41",
        "time": "27 September, 2022",
        "context": "Well if so called art imitates life,look at the new Fall show Feds as an indicator of what the once proud FBI has become...an ex HS guidance counselor with her low cut top and big 13% mouth taking down all the bad Whites!!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "kidneybean",
        "time": "27 September, 2022",
        "context": "“Our” media could howl about these abuses day and night, but they don’t.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "conservativenation",
        "time": "27 September, 2022",
        "context": "One question. Did he possibly break the law?",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "BlueLineForLiberty",
        "time": "27 September, 2022",
        "context": "Hey, Joy Reid, here's what Facism looks like!\nhttps://www.foxnews.com/media/msnbcs-joy-reid-claims-neofascism-won-big-italy-giorgia-melonis-victory#&_intcmp=hp1r_16,hp1r",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "spotman3",
        "time": "27 September, 2022",
        "context": "More eveidence of how we have the most CORRUPT and INEPT federal government in history.  God, help us.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jumpynina",
        "time": "27 September, 2022",
        "context": "COULDN'T CARE LESS\nCOULDN'T CARE LESS\nCOULDN'T CARE LESS\n\n\"Could care less\" means that you care just a little. I don't think that is what Gregg  Jarrett means. Everyone should watch Weird Al's Word Crimes video for a little education.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Tango1848532",
        "time": "27 September, 2022",
        "context": "Just part of the plan, turn Americans against one another. Started with Obama, on steroids under Brandon (as directed by “Mr O” behind the green curtain)",
        "good": "9",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "mofojo",
        "time": "27 September, 2022",
        "context": "Toxic partisanship in the United States is not a new problem. In 1796, President George Washington was so distressed by the way America was splitting into two political factions — the Democratic-Republicans led by Thomas Jefferson, and the Federalists of Alexander Hamilton — that he devoted much of his farewell address to warning his countrymen",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cormac22",
        "time": "27 September, 2022",
        "context": "Is there anything the left does that isn't a massive overreach, mobilizing the DOJ and thugs over a shoving match that charges had been dropped on seems a bit much, besides being obviously partisan.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "arclite89",
        "time": "27 September, 2022",
        "context": "If this is as bogus as it looks, I hope he sues everyone who has attacked him. The FBI certainly looks like it is in the back pocket of this administration.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "americancitizen1606",
        "time": "27 September, 2022",
        "context": "FBI is corrupt and not trusted",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "canyon12025",
        "time": "27 September, 2022",
        "context": "The FBI and DOJ are employees of the Democrat Party. Their only job assignment is to \"Get Trump!\"",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "alanfromatlanta",
        "time": "27 September, 2022",
        "context": "Let them push.  They are the ones that look foolish",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "deman5",
        "time": "27 September, 2022",
        "context": "⏳",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "thisgottastop",
        "time": "27 September, 2022",
        "context": "Doesn't anyone on the left think it's odd or irrational when more than 2 law enforcement officers show up to arrest the alleged perp of a truly minor crime like this? Or is it what it truly is - a political stunt where the left shows what they can and will do against conservatives?",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mofojo",
        "time": "27 September, 2022",
        "context": "unity doesn't stand a chance when American politics are dominated by an unhinged two-party duopoly",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "firemac12",
        "time": "27 September, 2022",
        "context": "Of all the insanity in this country these days,  if this doesn’t scare you nothing will.   KGB territory folks. ",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "DDs102",
        "time": "27 September, 2022",
        "context": "Sadly the political skits go on right in front of the public eye, but the media continues to lay out the narrative ahead of the facts.  Democrats love to judge ahead of the right to prove innocence.  \n\nAbortion itself is not about womens rights as they want to insist … it’s about the “convenience factor” of abortion due to benefit career, age, financial, adultery, oops, gender, etc. while avoiding all facets of accountability.  No one on either side argues the life and death circumstances that are clear exceptions to the rule.  The argument is all about “convenience” and the fact pro-abortion activists are using that as a woman’s  rights stance…",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "LibsCreatedTheUSConsWereLoyalists",
        "time": "27 September, 2022",
        "context": "Assault is illegal. Cry me a river.",
        "good": "1",
        "bad": "8",
        "replies": []
    },
    {
        "user_name": "BaronHarkonnen",
        "time": "27 September, 2022",
        "context": "Not your parents FBI DOJ IRS, being weaponized against American citizens. Spanish American War, WW 1, WW 2 Vietnam, Desert Storm, four generations of my family fighting for America against Dictators Despots Islamic Terrorists & Communists. Now realizing the greater conflict is in our own country.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Aomame",
        "time": "27 September, 2022",
        "context": "The FBI got involved over a shoving match? There is more to the story. The appearance looks to favor leftists but I can't believe a just a shoving fight is all there is here. But if shoving a leftist leads to an FBI raid and arrest then the US is doomed. Then this means the FBI doesn't want to look at all this murder and human trafficking and heinous crimes in the US but is worried about shoving and yelling at leftists.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Biden=moron733",
        "time": "27 September, 2022",
        "context": "FBI and DOJ are sooo corrupt now.... top 500 in each division need to be fired",
        "good": "8",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "heir_of_romulus",
        "time": "27 September, 2022",
        "context": "Wonder if the agents made a bee line right for the wife's dress wardrobe like they did at Trumps",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "mrwrightbro",
        "time": "27 September, 2022",
        "context": "Old coot Garland certainly has lost his mind. He's in Squinty Slo Joe territory now.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "ohiogrown",
        "time": "27 September, 2022",
        "context": "War on Women's health care rights ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "zebhead47",
        "time": "27 September, 2022",
        "context": "The only semblance of law enforcement in this country today is limited to non-urban counties and the local sheriff. All Federal law enforcement is a political joke and embarrassment and most urban police are overwhelmed with crime, depleted staffs and liberal prosecutors. Law abiding societies begin to unwind when we start overlooking and accepting small crimes and today unless you murder someone or push a pro-abortion activist you won’t spend a night in jail in most urban locations. ",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "mofojo",
        "time": "27 September, 2022",
        "context": "George Washington \nacknowledged that it was natural for people with common interests to organize into competing groups. But passionate loyalty to political parties too often fueled \"the most horrid enormities\" — vengefulness, dissension, and repression.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "robstall",
        "time": "27 September, 2022",
        "context": "\"They're coming after YOU, I'm just in their way\"..- DJT",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tatorhill",
        "time": "27 September, 2022",
        "context": "In Federal jury trials in the future, expect them to be held in DC or other large Blue areas!  They have their jury members already selected!  Them having Federal trials out in the country, they will be opening themselves up for failure!  You will begin seeing one or more jurors not believing ANY FBI testimony against Conservative people charged with crimes!",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "SeanB303",
        "time": "27 September, 2022",
        "context": "like Schumer said, they have 6 ways to Sunday to get you.....",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dalemubarak347",
        "time": "27 September, 2022",
        "context": "The DOJ and FBI (the federal government) are having their way coz the pips  (the conservatives and republicans) are just keeping quite over what’s happening.\nMeaning the rights accept these actions of the federal government…",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "jmas",
        "time": "27 September, 2022",
        "context": "Wow, over a shouting match. It's starting to sound more like Russia every day here.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "OliveDucky",
        "time": "27 September, 2022",
        "context": "The wicked shall be turned into hell, and all the nations that forget God. Psalms 9:17. Repent and accept Jesus Christ into your heart, for great tribulations are coming.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "1Rebel007",
        "time": "27 September, 2022",
        "context": "Pro-death activists get an automatic pass from Obama loyalists in the DOJ.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mofojo",
        "time": "27 September, 2022",
        "context": "The worsening malice and meanness of American politics are clearly not deepening public affection for the two major parties. The number of registered independents is higher than it has ever been in the modern era 28%",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Thermodorian",
        "time": "27 September, 2022",
        "context": "Got to wonder why they thought they needed 15 agents to arrest the guy on a year old civil charge. What information were they acting on? If this is SOP, they must run the most expensive LEO in the world. Most of the country can't get enough police, but the FBI can deploy 15 agents, probably all top-10 law school grads, to arrest one guy because he protests abortions.... doesnt add up.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "norvillerogers",
        "time": "27 September, 2022",
        "context": "Don't want the FBI to show at your door?  Don't commit federal crimes.\n\nSeems simple enough.",
        "good": "2",
        "bad": "9",
        "replies": []
    },
    {
        "user_name": "shesellssanctuary!741",
        "time": "27 September, 2022",
        "context": "Why is this surprising? This is what Fuhrer Biden and Brown Shirts do..",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "shesellssanctuary!741",
        "time": "27 September, 2022",
        "context": "Leftists on this thread will see nothing wrong with this..\nThey don't fool anyone..they've always loved Dictators and their Tactics..",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "210s",
        "time": "27 September, 2022",
        "context": "How do they brain wash the agents at the FBI and SWAT to execute raids like this?  Is it the fear of losing their jobs?  How does someone abandon common sense and logic like this?\nIt reminds me of how the MSM personalities like Madow, Todd, Acosta etc etc act on TV.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "indyinde",
        "time": "27 September, 2022",
        "context": "The names of all of the DoJ personnel involved in this should be noted by the GOP.  When the GOP returns to power in Congress later this year they can all be subjects of Congressional hearings.  And when the GOP regains the Presidency they can be subjected to summary dimissal",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "itnerd",
        "time": "27 September, 2022",
        "context": "It didn't really take that long for ol' Joe to turn a premier law enforcement agency into a joke used to terrorize American citizens that simply don't agree with him.\n\nWe just need to hold our collective noses for two more years and he will be gone.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "really001",
        "time": "27 September, 2022",
        "context": "Wait so a judge threw it out in civil court which is way easier to win then criminal but some how  the Fed has enough evidence to prosecute.. Really??\nI would think they would have there hands full with all the attacks that happened to Fed properties during the riots.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "tutt058",
        "time": "27 September, 2022",
        "context": "Ahhh the burning smell of Communism....ahhh so refreshing Brandon",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bidenisatokenpresident",
        "time": "27 September, 2022",
        "context": "The injustices and the contempt of the DOJ & FBI was put on full display when they raided the home of President Donald J Trump !  The actions against Mr. Houck, to them, is just \"business as usual\". This is another swamp that needs to be drained.  From the senior officials all the way down to the weak little pantywaists who have no backbone, they need to all be removed from their jobs, starting with Garland and Wray.  As with so many working under, and with, this administration, they are threats to our country.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "notyourparentsgop!",
        "time": "27 September, 2022",
        "context": "The \"excessive force\" used was when the guy decided to take down an elderly man.  Fanatics and Cult members need to be held accountable for assaults.  Get over it Felicia's.  You haven't overthrown our democracy yet!  Rule of law still matters.",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "smilyrep",
        "time": "27 September, 2022",
        "context": "The elephant man at it again",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "peggug",
        "time": "27 September, 2022",
        "context": "Vote Republican",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "redfoxhuntrr",
        "time": "27 September, 2022",
        "context": "Garland needs to go. ",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "taramp;feathers",
        "time": "27 September, 2022",
        "context": "This is only the beginning.  Jobama's gestapo is just getting started.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Sunday870",
        "time": "27 September, 2022",
        "context": "The DOJ and FBI do the bidding of the Biden Administration and Democrat party. All political and with a leftist radical agenda. They are no longer about law and order and criminal justice. No doubt the Armed IRS will follow in their steps.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "claytonbixby",
        "time": "27 September, 2022",
        "context": "And the meek shall inherit the earth.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bobgoelz315",
        "time": "27 September, 2022",
        "context": "FBI = Brown Coats ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tutt058",
        "time": "27 September, 2022",
        "context": "Can I put my ex wife on your warant list if I donate to Brandon ?....just wondering...",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "pattycake623417",
        "time": "27 September, 2022",
        "context": "The pendulum swings both ways and has been building momentum before it’s inevitable swing back. When the house and Senate return to the Republicans in November, they cannot miss one opportunity to course correct all of this and work towards the removal of every last treasonous player.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "TheMan!274",
        "time": "27 September, 2022",
        "context": "Our current government under Joe Biden's leadership is evil to its core!",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "EnglishAmerican",
        "time": "27 September, 2022",
        "context": "But we’re the fascists?",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "thetruth1776",
        "time": "27 September, 2022",
        "context": "This is exactly what happens when the people who've stolen power don't care about the Constitution or the principles on which the nation was founded.  \n\nWe are a nation ruled by petty tyrants and tinpot-dictator wannabes who, like all tyrants of the past, use buzzwords like \"democracy\" and \"safety\" and \"THREAT\".  \n\nNotice, however, that they never use words like \"liberty\" or \"individual\" or ESPECIALLY \"God\".  The master they serve HATES God and those who serve Him.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tutt058",
        "time": "27 September, 2022",
        "context": "You mean the KGB right ? These tactics are KGB like not FBI. Weaponized Federal Enforcement agencies with politpolitT-Shirts on.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "SixSibling",
        "time": "27 September, 2022",
        "context": "The law and order Republican Party, that’s a joke.",
        "good": "0",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "jarvman",
        "time": "27 September, 2022",
        "context": "Cut off the snakes head.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "joser14",
        "time": "27 September, 2022",
        "context": "“ The FBI and Department of Justice could care less”\n\nCouldn’t.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "usingmybrain295",
        "time": "27 September, 2022",
        "context": "so many things can go wrong accidently when you point a firearm at somebody. for most part a non violent crime that already was thrown out by a civil court as having no merit and you just put this guys life at risk? i hate cancel culture but only way FBI saves face on this one is for some firings or bare minimum relief of command on whoever ordered this. review of judge who signed arrest warrant!",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tutt058",
        "time": "27 September, 2022",
        "context": "Bananas 🍌 here...get your Bananas.....Bananas for the Republic of Bananas......right Brandon?",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "icestationzebra",
        "time": "27 September, 2022",
        "context": "Time to get him some thumbscrews 😐",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sandy10974",
        "time": "27 September, 2022",
        "context": "I belive this happened in Germany in 1935 are they just trying to silence political opponents.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "22889964",
        "time": "27 September, 2022",
        "context": "Looks like Garland screwed up again.  Selective law enforcement",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "freedom!!551",
        "time": "27 September, 2022",
        "context": "Gestapo with meritless Garland at its head.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "wombroom",
        "time": "27 September, 2022",
        "context": "The clear and present danger to America is the Biden administration.... \nBeware when you unleash the whirlwind....",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "AshliBabbittsRottingCorpse",
        "time": "27 September, 2022",
        "context": "All of America holds the Christo fascist MAGA traitors in contempt.",
        "good": "1",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "paducky229",
        "time": "27 September, 2022",
        "context": "Time for civil legal action against the government for 10 billion dollars and ask the court for a freeze on that amount so the DOJ/FBI can’t spend it",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Sidneyisagirltoo",
        "time": "27 September, 2022",
        "context": "The FACT that there is such disparity in the law should be a concern for all....regardless of your party .",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mac5793",
        "time": "27 September, 2022",
        "context": "I think that is time to take a long hard  look at what has been going on with the FBI and DOJ.\nIt is a proven fact that both departments have been politized to the point that neither can be trusted for fair and equal justice.  I think that it is time to dismantle both departments and start over. It is really sad that in todays society that everything is controlled  by one political  party and the national news media. I had a family member that was in law enforcement for over 25 years that worked with both the FBI and DOJ . He left and retired before things got to the point that they are now. He told me that If I really understood how evil and corrupt things are at the federal level  that it would scare you to death.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Bidendabuffoon",
        "time": "27 September, 2022",
        "context": "Catholics and Jews better become “really woke” on what is happening. Democrats are waging a war on religion. They are not just coming for your guns but they are aiming to drive religion into the catacombs like in Ancient Rome.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mullah_obama",
        "time": "27 September, 2022",
        "context": "For FBI it will be hard to keep a good reputation when agency is being used to terrorize political opponents of Socialist Democratic Party. Until the FBI became a non-political, independent law enforcement organization, people will always perceive it as a terror arm of Socialist Democratic Party.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "nascar8806",
        "time": "27 September, 2022",
        "context": "The question is, How did Garland and Wray find out about a case that was tossed out by a District Court a year ago?\nanswer....\nSome left wing group with connection to them came up with this plan.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "trupatriotsloveamerica",
        "time": "27 September, 2022",
        "context": "The FBI lost all credibility years ago.  Sad times",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ray567",
        "time": "27 September, 2022",
        "context": "this is a bit off the subject but when they did away with roe vs wade left went ballistic, \" my own body\" they screamed, but when many had to get the shot due to gov mandates they were not so mad in fact they screamed \"get the shot\"\nand those who didn't got villified! lost jobs and other stuff ,so they should kerp their hypocritical  mouths shut!",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "itoldyouso594",
        "time": "27 September, 2022",
        "context": "We proudly fly the American flag 365 days. For us it stands for the country we once knew and loved. I pray America will return to her greatness but I wait for someone to attack one of us with violence and will gladly stand up for what I know is right; adherence to our country's lost values. God bless America. ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Zegna140311",
        "time": "27 September, 2022",
        "context": "And, Greg, let me guess, the solution to the problem is \"buy my book.\"  Jarrett, Carlson, handedy, Ingram they are all great at fomenting outrage but do nothing To help us protect ourselves.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "marcuso",
        "time": "27 September, 2022",
        "context": "fbi and doj. are same as gastopo and ss. ",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "warbo053",
        "time": "27 September, 2022",
        "context": "All FBI agents are now required to wear high riding boots with their trousers tucked in.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "BR549",
        "time": "27 September, 2022",
        "context": "The FBI & DOJ used to fight criminal organizations. Now they are one of those they used to fight.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "peter-frigate",
        "time": "27 September, 2022",
        "context": "“ In North Dakota, a man used his SUV to mow down and kill a teenager because he believed the young man belonged to a Republican extremist group, although there is no evidence of that, say police.”\n\nIn fact, there is no evidence of anything political in the attack.",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "justaprophet",
        "time": "27 September, 2022",
        "context": "Multiple times Jane's revenge has terrorized pro-life facility and the DOJ and FBI with all their technology can't seem to find any of the offenders, but by golly, when a pro-life man who is accused of simple assault then the brown shirt from Biden's henchman jump into action.  And Wray has the nerve to say the FBI in not corrupt and bias.  Yeah right.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ncjoe672",
        "time": "27 September, 2022",
        "context": "They're creating a PR nightmare for themselves.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "toomanyyearstobeignored",
        "time": "27 September, 2022",
        "context": "Guessing he was a flight risk.  Not like the two men who had a no bail appear in court who were arrested in CA for trafficking Tens of thousands of fentanyl… Who incidentally didn’t show up for their court appointment.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "gibbys",
        "time": "27 September, 2022",
        "context": "I Love my Country & Fear my gov't!!!",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Vae_Victus",
        "time": "27 September, 2022",
        "context": "Hillary was taking a page from her Russian friend Vladimir, accusing her opponents of being Nazis, nothing brings hate to others by that one word. 😉 ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "opleygrinds",
        "time": "2 days ago",
        "context": "This is not how law, and justice, are administered. This is something else. This is intimidation and state kidnapping not seen since the days of the Stasi.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "TrulyAmerican",
        "time": "2 days ago",
        "context": "When did conservatives start to hate the police….. I’ll tell you when, when they started arresting law breaking Republicans.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ch3k.ur.r3ality",
        "time": "2 days ago",
        "context": "It would be best to shut down the FBI completely. Their own politically corrupt actions and the lies they have told to congress and to the American people have taken away every vestige of legitimacy as a law enforcement agency. We can do better than this.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "constitutionalrepublic646",
        "time": "2 days ago",
        "context": "Welcome to the New World Order, where you can be jailed, raided, killed, and publicly denigrated as a peaceful person for your political beliefs.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "nugget55452",
        "time": "2 days ago",
        "context": "To  a  man  thats  speaks  his  FREEDOM  of  SPEACH???   Arressted  by  the  FBI....     This  country  has  gone  to  HELL!!!!!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "nugget55452",
        "time": "2 days ago",
        "context": "With  GUNS  drawn!!!!!!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dockane",
        "time": "2 days ago",
        "context": "No context, half story.  FOX's specialty.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "seniorpop",
        "time": "2 days ago",
        "context": "FBI/DOJ getting more like the Gestapo every day.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "murica572",
        "time": "2 days ago",
        "context": "After the Republicans regain power, we shall once again have equal justice under the law, right after we spend a few years getting payback. Then everything will be fair once again!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "RedneckRandy337",
        "time": "2 days ago",
        "context": "Sounds like the MAL raid, were thousands of FBI, military, state and local police surrounded Trump's place with guns, tanks, artillery at 3 a.m.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tuckerisasmartcookiereally",
        "time": "2 days ago",
        "context": "And “To Serve Man” is a cookbook!!!! Eeeek!!!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "Think4urselves",
        "time": "2 days ago",
        "context": "If the fbi wasn't corrupt it would be arresting members in Congress and the house for their corruption with China and other countries. We are not a democracy. There's the elites , their enemy's and us commoners.  We will always be their victim.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bosco33",
        "time": "2 days ago",
        "context": "Break out the Beltway version of \"Where's Waldo?\"      Where's fay wray,  andrea maracas, and meritless garfinkel gargoyle,  hiding in Baghdad?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "waschicagomikelongago",
        "time": "2 days ago",
        "context": "His home is in Kintnersville, PA about 45 to 50 miles from the Planned Parenthood Office.  There is no such thing as \"Public Transportation in Kintnersville except the historic Delaware Canal, you know, the one that George Washington took the Durham boats from to attack the Hessians in Trenton one Christmas long ago.  There are only 2 roads out of Kintnersville and only 2 bridges across the river to New Jersey within 20 miles of his home.  Real desperado there so that the FBI needed armed agents to make this arrest.  Of course, Dr. Gosnell would still be free in Philly if the FBI had anything to say about it.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "canuckistan",
        "time": "2 days ago",
        "context": "None of you had any complaints when it was Muslim Americans being targeted, and I saw zero articles about the Black Socialists of America being raided. Conservatives have this odd notion that they’re the only ones being targeted by government, but I think they’re just not used to being on that side of the persecution.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "whipperwhinnes",
        "time": "2 days ago",
        "context": "Well we will all pay the price for this the same as Germany did...",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "NMCB4",
        "time": "2 days ago",
        "context": "Why do we even pay taxes?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "boomerok",
        "time": "2 days ago",
        "context": "They need to clean house in the FBI and DOJ.Go after the cartels and stop accepting money from them.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "satellitecoffee",
        "time": "2 days ago",
        "context": "yep  hard to think FBI can continue, by the way Jared was the one that said give them a chance, Trump was good to listen, but big mistake.  if we knew the facts we would take up arms against the \"King George\" FBI",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "atpLGBLGBLGB",
        "time": "2 days ago",
        "context": "FBI and DOJ are our very own modern day versions of the Brown Shirts and the Gestapo.\nYou can thank Herr Biden and his band of thugs and bullies.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "walmartshopper155",
        "time": "2 days ago",
        "context": "Reps need to get tough.        Fight fire with fire.     They   Made a name that stuck.    Maga.       Find a name for them.     I suggest bidens banana republic.  What do you think",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ol'charlie",
        "time": "2 days ago",
        "context": "As it stands now, I wouldn't p on and FBI agent if they were on fire. It's time for the separate states to start passing laws banning the FBI.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rep57568",
        "time": "2 days ago",
        "context": "The swamp needs continous draining!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "filiusjm734",
        "time": "2 days ago",
        "context": "PP have had people killed.....when did the right speak out against that?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "lechrenski",
        "time": "2 days ago",
        "context": "He assaulted an old man. Multiple times. And he’s been violating the FACE act for years. If there was “unequal justice” here, it is that he’s gotten away with this awful behavior for so long.",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "mickeg",
        "time": "27 September, 2022",
        "context": "First they came for the socialists, and I did not speak out……because I was not a socialist.\nThen they came for the trade unionist, and I did not speak out ….because I was not a trade unionist. .\nThen they came for the Jews, and I did not speak out….because I was not a Jew.\nThen they came for me….and there as no one left to speak for me.\n   Martin Niemoller",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "JustOnceTryToThinkOK",
        "time": "27 September, 2022",
        "context": "Obviously, we need to defund the FBI.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "tfa",
        "time": "27 September, 2022",
        "context": "This is the most biased justice dept and legal system in US history. They don't even seem to hide their extreme allegiance to one party and the party they have chosen, has morphed into the new authoritarian party.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "peter-frigate",
        "time": "27 September, 2022",
        "context": "The things that puzzle me are why the perp’s wife is the primary news source and why the fbi waited almost a year to make an arrest.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bosco33",
        "time": "27 September, 2022",
        "context": "The top floor of the fbi HQ needs an Exorcist.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "froghugger",
        "time": "27 September, 2022",
        "context": "Garland's worms keep poking their heads out of the apple...not great optics for voters to see streaming as they stand in voting lines.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "want2believe_ts-13",
        "time": "27 September, 2022",
        "context": "Just don't break the law and you have nothing to worry about.",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "Caleb7",
        "time": "27 September, 2022",
        "context": "Fox conveniently ignores all of the abortion centers which have been vandalized, set on fire, and even burned down through the years, and even doctors killed.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "snap70",
        "time": "27 September, 2022",
        "context": "The gestapo chief Garland is trying to destroy every Republican, including Trump as revenge for not getting to SCOTUS.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "khanute",
        "time": "27 September, 2022",
        "context": "WAKE UP AMERICA , DEM GESTAPO GETTING OUT OF CONTROL !",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "JamestownDescendent",
        "time": "27 September, 2022",
        "context": "Democrat communism is on full display with these agencies.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Freedom2024863",
        "time": "27 September, 2022",
        "context": "SAVE AMERICA VOTE REPUBLICAN !",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "elbowsmcfadden",
        "time": "27 September, 2022",
        "context": "I'm surprised that no one intervened who he assaulted the geriatric.\n\nI can't see that happening where i live.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bearinthewoods441",
        "time": "27 September, 2022",
        "context": "The Swamp is full of this behavior. We still have a job ahead of us, with or with Trump, to drain the swamp. Fire the incumbents that protect their own interests over America's. We all seemed to be able to \"Agree-to Disagree\", till about 2008. We need to learn to do that again, and remove anyone from government that can't.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "want2believe_ts-13",
        "time": "27 September, 2022",
        "context": "\"The alleged victim sued for money damages, but the case was tossed out by a District Court, according to Ryan-Marie Houck.\"\n\nYet interestingly, no docket number exists for this supposed case.  A private complaint was submitted, local authorities ended their role as the fed took it over.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "thatchief",
        "time": "27 September, 2022",
        "context": "\"The FBI and Department of Justice could care less\"\n\nFox News can't even get 10 words into an article without making an egregious error.  \n\nIf these blowhards can't figure out \"COULDN'T CARE LESS\" then how on Earth are you going to trust their reporting?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "c1toborc1",
        "time": "27 September, 2022",
        "context": "The alphabet agencies have become politically weaponized.  America, and our Constitution, is in deep trouble.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "peripeteia",
        "time": "27 September, 2022",
        "context": "The difference between pro-life’s response to RvW and pro-choice’s reaction to JvD is stark . . .",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "whatsamatteru2022",
        "time": "27 September, 2022",
        "context": "2 separate in-justice systems...we are now that 3rd world 'banana\" country...",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "davole",
        "time": "27 September, 2022",
        "context": "The FBI (Fumbling Bureau of Incompetents) obstinately and unprofessionally refused to justify their  level of force that was deployed over a relatively minor offense that supposedly occurred a year ago.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "nowisthetime",
        "time": "27 September, 2022",
        "context": "Mark Houck, catholic org?  Hmmm, something's not adding up with this.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "want2believe_ts-13",
        "time": "27 September, 2022",
        "context": "Imagine pretending to be a Christian and thinking it was ok to assault someone.",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "bearinthewoods441",
        "time": "27 September, 2022",
        "context": "More Federal overreach into a State, Local government issue.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "franklinsdad890",
        "time": "27 September, 2022",
        "context": "The DOJ and FBI have become enemies of the people...  So corrupt.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "r2akauw",
        "time": "27 September, 2022",
        "context": "Looks like the Dept. of Justice and the FBI have overextended their authority, not to mention acting in a hysterical manner, not at all in keeping with minor issue relating to the yr. old offense. How odd of them...",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "elbowsmcfadden",
        "time": "27 September, 2022",
        "context": "We know that those who prey on children or the elderly have a tough time in prison.\n\nThis story will probably have a happy ending.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ash1972",
        "time": "27 September, 2022",
        "context": "\"while his seven frightened children looked on.\"\n\n7 children?! He is part of the problem. He needs to be locked up before he ruins more of the earth.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "elbowsmcfadden",
        "time": "27 September, 2022",
        "context": "A \"so called Christian\" attacked an elderly man and has been charged with federal crimes over it.\n\nIt's not a \"no knock warrant\" where innocents were murdered, so where's the outrage?",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "elbowsmcfadden",
        "time": "27 September, 2022",
        "context": "I'm curious as to why this story isn't in the \"good news\" section?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "faithfamilyfirearms",
        "time": "27 September, 2022",
        "context": "John 15:18-19 \"8 “If the world hates you, know that it has hated me before it hated you. 19 If you were of the world, the world would love you as its own; but because you are not of the world, but I chose you out of the world, therefore the world hates you. \"",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mickeg",
        "time": "27 September, 2022",
        "context": "While Biden rages about Republicans, Conservatives and the MAGA supporters of Trump being extremists and fascists, he has weaponized his own 'brown shirts' in the DOJ under Garland and the FBI which has lost credibility under Comey in their persecution of Trump and currently under Wray .\nGarland and Wray have weaponized law enforcement to persecute and prosecute political adversaries while protecting partisan allies. \nThe FBI had previously spread the Steele dossier hoax in an effort to spread disinformation and get FISA warrants under false pretense. They have protected Joe Biden from the implications of the now verified 'laptop from hell' belonging to Hunter since Dec of 2019.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "wroot",
        "time": "27 September, 2022",
        "context": "We can thank former POTUS Obama for politicizing these very powerful government agencies, that have become the lap dogs of the Democratic Party!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ridingon264",
        "time": "27 September, 2022",
        "context": "One might think, or wish, that in the face of such obvious unethical behavior that at least one democrat politician would have the moral character to stand up and say \"enough\" to Garland.  But the silence is deafening.  Our country is in deep trouble when either party finds it acceptable for the gov't to treat citizens in this way.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "HKT911",
        "time": "27 September, 2022",
        "context": "My only question is why they weren't wearing brown shirts when they got there?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "AmericaisBack915",
        "time": "27 September, 2022",
        "context": "You poor souls DO know this man is being charged with attempting to block someone from gaining access to an abortion clinic and that attempting to block ANYONE from gaining access to ANY clinic is a FEDERAL crime, right?\n\nYou DO know it's the DOJ's JOB to enforce federal law, right?\n\nI'm JUST checking.\n\nFeel better soon.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "chuckiechan483",
        "time": "27 September, 2022",
        "context": "It is obvious to everyone who now fears FBI retribution for “unhealthy opinions”, that the FBI is trying to provoke violence.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "andyowen",
        "time": "27 September, 2022",
        "context": "Obama hired MANY people.....these people are all suspect?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "displayname1234235",
        "time": "27 September, 2022",
        "context": "Thank God that Garland didn't make it to the Supreme Court",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "gyryryryg",
        "time": "27 September, 2022",
        "context": "This is just an indication that the dictatorial party is making its move. Much like North Korea or Russia or China.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "lucidatious283",
        "time": "27 September, 2022",
        "context": "If this is what deeply religious has come to then god is shirley dead!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "andyowen",
        "time": "27 September, 2022",
        "context": "Jean-Pierre is a typical Dem....this is a Communist ideology in \"US garb\".......never admit the \"truth\" except (rarely) when it fits your own political narrative?   Americans have to accept that NOTHING Biden tells you is TRUE....NEVER??????",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "iceload",
        "time": "27 September, 2022",
        "context": "The FBI and DOJ can't be bothered with the ransacking of a store just up the street.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bertco",
        "time": "27 September, 2022",
        "context": "The FBI back in the 50s and 60s went after Martin Luther king because they believed he was a threat to America along with many other people that wanted equality during that time frame. Edger Hover keep records on all the politicians to protect himself. WACO was a nightmare that didn’t have to happen. Seems like a lot of people lose their lives one way or another when the FBI gets involved. Freedom is not Free when you stand up to this government.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ppt",
        "time": "27 September, 2022",
        "context": "In Communist countries, if you defy the government they punish you.  Can't you see that the democrats are trying to create communist America?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "charliedog2",
        "time": "27 September, 2022",
        "context": "\"lust for power\"  That alone is the Best reason to vote em in and vote em out!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "murica572",
        "time": "27 September, 2022",
        "context": "When the Nazis found a citizen that didn't want to kill Jews they persecuted that person and put them on a watch list after they beat them up.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "conservativeamerican2020080",
        "time": "27 September, 2022",
        "context": "The DOJ and FBI are total jokes under this administration. Everything is a joke under Biden.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "See_the_difference?",
        "time": "27 September, 2022",
        "context": "So the FBI arrested a terrorist? That’s okay.",
        "good": "1",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "Quickdraw5.56",
        "time": "27 September, 2022",
        "context": "The FBI have turned into the gestapo under Garland. Everyone keeps pointing their finger at the FBI don't realize they take their orders from Garland. When you have a radical like him running the show expect to be targeted if your political opinions don't line up. This is the same guy who labeled parents domestic terrorists for voicing their concerns. This case was thrown out since the accuser never showed to court multiple times, yet for some reason the DOJ picked it up. Since when did shoving a person away from your child warrant a raid from the FBI? If the accuser never showed means he knew he didn't stand a chance in court. One minister with no history of violence didn't need more than 2 agents to make an arrest. This screams make an example of what happens when you don't fall in line. Which has now sparked more public distrust for the Garland and the DOJ.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sovereignnation604",
        "time": "27 September, 2022",
        "context": "Gestapo in the US.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "luvtheusa1200565",
        "time": "27 September, 2022",
        "context": "The swamp must be drained or all is lost!!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "onfulldisplay",
        "time": "27 September, 2022",
        "context": "Stand up to protest for the right to kill unborn children then stand before God and tell him you did so.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "blackriflesmatter398",
        "time": "27 September, 2022",
        "context": "Democrats are a scourge on America.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "TheDayoftheLordApproaches",
        "time": "27 September, 2022",
        "context": "There is one judge who will deal with Garland and his ilk.  They will stand before His great white throne for sentencing.  Swift and certain,  to the lake of fire for eternal suffering.  They could avoid it through confessions, submission and repentance, but most of them have hardened their hearts.  The Day of the Lord is coming soon.  Perfect justice for all.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "donewithlyingdem's",
        "time": "27 September, 2022",
        "context": "FBI = Fake Bureau of Investigation.  Dismantle it.  There getting more and more like Germany's Gestapo.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tryingthisout",
        "time": "27 September, 2022",
        "context": "FOX needs to stop attacking the DOJ and FBI. Both are fine institutions responsible for keeping US citizens safe.",
        "good": "0",
        "bad": "5",
        "replies": []
    }
]