[
    {
        "user_name": "bigrig259",
        "time": "5 hours ago",
        "context": "Somewhere new to send the illegals crossing the border?",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "terryrab",
        "time": "4 hours ago",
        "context": "China has already claimed it and is building a base.",
        "good": "3",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "honestbroker1776",
        "time": "5 hours ago",
        "context": "Better stick our Flag on it now before the Chinese declare it theirs\n\nTalk about a Massive Zit",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "don'taskme",
        "time": "5 hours ago",
        "context": "Wish we could send every liberal to some island like that and watch it erupt again 🤔👏😉",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "hartnavy",
        "time": "6 hours ago",
        "context": "Did they pay the carbon credits for the eruption?",
        "good": "2",
        "bad": "5",
        "replies": [
            {
                "user_name": "d'artagnan0962",
                "time": "6 hours ago",
                "context": "Hawaii's Kilauea volcano has been erupting nonstop for over a decade, we might not want to press the carbon issue.",
                "good": "1",
                "bad": "4",
                "replies": [
                    {
                        "user_name": "woozymarigold",
                        "time": "3 hours ago",
                        "context": "Three decades of almost continuous eruption spewing 7000 tons per day.  I looked it up a while back.",
                        "good": "0",
                        "bad": "2",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "atl12",
        "time": "5 hours ago",
        "context": "I declare the new island an immigration sanctuary!",
        "good": "2",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "Kwayne",
        "time": "4 hours ago",
        "context": "I recently saw that NASA had crashed a rocket into a small asteroid as a test to see if they can break one apart or change it's course to \"protect earth.\"  Will this become the next crisis to replace global warming?",
        "good": "3",
        "bad": "5",
        "replies": [
            {
                "user_name": "DogsandCats",
                "time": "4 hours ago",
                "context": "The DART that smacked into the asteroid was minuscule compared to the size of the rock and hard to believe that it would have any  effect on the trajectory of the thing.",
                "good": "0",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "woozymarigold",
                        "time": "3 hours ago",
                        "context": "It's not strictly mass and size, closing velocity has an effect as well.  With enough lead time you only need to speed up or slow down a rock a few centimeters/second.  Any alteration of velocity, no matter how small, affects the orbit of the body.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "DogsandCats",
                                "time": "2 hours ago",
                                "context": "Physics teacher?",
                                "good": "0",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "woozymarigold",
                                        "time": "29 minutes ago",
                                        "context": "Nope.  High school graduate 1974, and an Associates Degree earned in 1988.  I also read voraciously and while I couldn't calculate the trajectory it isn't hard to understand the basic idea that force is dependent on both mass and velocity.  So even a small object at a high enough velocity can perturb the orbit of a larger body.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": [
                                            {
                                                "user_name": "DogsandCats",
                                                "time": "23 minutes ago",
                                                "context": "Phew!  I'm a college grad who still counts on my fingers. Terrible with math. Too much of an abstract thinker. I applaud you though.",
                                                "good": "0",
                                                "bad": "0",
                                                "replies": []
                                            }
                                        ]
                                    }
                                ]
                            },
                            {
                                "user_name": "moonbatcrazy",
                                "time": "51 minutes ago",
                                "context": "I wonder though, did anybody calculate the trajectory after impact to make sure it won’t hit another asteroid that will hit another and so on, humans have been known to make horrendous mistakes trying to manipulate nature.",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "sciencerocks",
                "time": "31 minutes ago",
                "context": "Anthropogenic global warming is still a crisis, as are global economic trends. We must deal with these crises all at the sam time, but for tonight my prayers are with those in the path of hurricane Ian.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "sowhat262",
        "time": "5 hours ago",
        "context": "They should name it \"Biden Island\" because it is full of hot air and will not last long.",
        "good": "10",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "spinynorman262",
        "time": "8 hours ago",
        "context": "Nice to see new islands arising as other go under due to rising sea levels.",
        "good": "8",
        "bad": "4",
        "replies": [
            {
                "user_name": "sjmaus",
                "time": "7 hours ago",
                "context": "Name one island that has 'gone under' due to rising sea levels.",
                "good": "10",
                "bad": "5",
                "replies": [
                    {
                        "user_name": "spinynorman262",
                        "time": "7 hours ago",
                        "context": "The islands of Kepidau en Pehleng, Nahlap, Laiap, Nahtik, and Ros have all been submerged in recent years.\nKiribati is an island nation that is slowly disappearing.  The Solomon Islands, Maldives, Micronesia, Seychelles and more all have island populations that have to be relocated in the next few years.",
                        "good": "4",
                        "bad": "5",
                        "replies": [
                            {
                                "user_name": "sjmaus",
                                "time": "7 hours ago",
                                "context": "Uninhabited atolls that come and go due to erosive wave action. These reefs have been moving and changing constantly for thousands of years, long before the industrial revolution",
                                "good": "11",
                                "bad": "5",
                                "replies": [
                                    {
                                        "user_name": "spinynorman262",
                                        "time": "6 hours ago",
                                        "context": "Wrong again.",
                                        "good": "6",
                                        "bad": "2",
                                        "replies": []
                                    },
                                    {
                                        "user_name": "letsgetrel",
                                        "time": "5 hours ago",
                                        "context": "You folks are so sad. As a geologist with a long-term perspective, and a hydrogeologist at that, I know how important global warming and sea level rises are in the grand scheme. Both are accelerating at unnatural paces, and we have the long term data to prove that.\nDo some reading of the scientific literature rather than the blogs, and you won't so glibly dismiss the human effects on our planet.",
                                        "good": "4",
                                        "bad": "4",
                                        "replies": [
                                            {
                                                "user_name": "Cincinnatus296",
                                                "time": "5 hours ago",
                                                "context": "Aren't you still 'cooking the books' on that subject?...Yeah, thought so.",
                                                "good": "3",
                                                "bad": "5",
                                                "replies": [
                                                    {
                                                        "user_name": "letsgetrel",
                                                        "time": "3 hours ago",
                                                        "context": "Never have, never will.",
                                                        "good": "1",
                                                        "bad": "0",
                                                        "replies": []
                                                    }
                                                ]
                                            },
                                            {
                                                "user_name": "presidenttrumpsupporter",
                                                "time": "4 hours ago",
                                                "context": "Are you one of the same guys telling us there was going to be an ice age coming and we all would starve when I was going to school back in the 60s",
                                                "good": "4",
                                                "bad": "3",
                                                "replies": [
                                                    {
                                                        "user_name": "letsgetrel",
                                                        "time": "3 hours ago",
                                                        "context": "No, I was in elementary school in the 60s. Unlike you, I paid attention.",
                                                        "good": "3",
                                                        "bad": "2",
                                                        "replies": []
                                                    },
                                                    {
                                                        "user_name": "YetHereYouAre",
                                                        "time": "3 hours ago",
                                                        "context": "I'm still waiting on that same ice age by the year 2000 that those same scientists are now saying  we are going to drown.\n I guess the scientists theories come from who ever is funding them this month.",
                                                        "good": "0",
                                                        "bad": "3",
                                                        "replies": []
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            },
                            {
                                "user_name": "YetHereYouAre",
                                "time": "6 hours ago",
                                "context": "Since 1890 the sea level has only risen about 8 inches........So, if any island has \"gone under\" then it was inevitable.",
                                "good": "3",
                                "bad": "4",
                                "replies": [
                                    {
                                        "user_name": "pescadoloco702",
                                        "time": "6 hours ago",
                                        "context": "Sea level rise is supposed to be accelerating. I guess we’ll find out next year when NOAA’s data for the latest epoch comes out. This will be the first epoch where a entire constellation of GPS satellites was active the entire time. The data should be free of land subsidence anomalies for the first time.",
                                        "good": "1",
                                        "bad": "0",
                                        "replies": []
                                    },
                                    {
                                        "user_name": "letsgetrel",
                                        "time": "5 hours ago",
                                        "context": "And now it is more inevitable due to anthropogenic global warming.\nWe've got the data, you've got an uninformed opinion.",
                                        "good": "3",
                                        "bad": "3",
                                        "replies": [
                                            {
                                                "user_name": "Kwayne",
                                                "time": "5 hours ago",
                                                "context": "How is we? Are you a climate scientist?\nThere are scientist who think mankind have little or no effect on climate.",
                                                "good": "1",
                                                "bad": "3",
                                                "replies": [
                                                    {
                                                        "user_name": "letsgetrel",
                                                        "time": "3 hours ago",
                                                        "context": "I'm a geologist, and climate plays a large role on how I do my job of hydrogeology consulting.\nThere are very few scientists who think that mankind has \"little or no effect on climate,\" and they are not up on the latest facts in the scientific literature.",
                                                        "good": "1",
                                                        "bad": "0",
                                                        "replies": []
                                                    }
                                                ]
                                            },
                                            {
                                                "user_name": "Kwayne",
                                                "time": "5 hours ago",
                                                "context": "One of the unfortunate things about scientific research is that it has to be funded by someone.  Very few scientist will publish an opinion that goes against the entity funding them.  If they do, they will likely find themselves unfunded. AKA unemployed. Kind of like, don't bite the hand that feeds you.",
                                                "good": "3",
                                                "bad": "2",
                                                "replies": []
                                            }
                                        ]
                                    }
                                ]
                            },
                            {
                                "user_name": "libertywastelands",
                                "time": "5 hours ago",
                                "context": "Micronesia is 35 feet above sea level, New Orleans is 6 feet below sea level and still here. Those tiny islands are used mainly for ship channels. Everything on Earth will disappear at some point and something will reappear to take its place, I think its called time.",
                                "good": "3",
                                "bad": "3",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "Cincinnatus296",
                "time": "5 hours ago",
                "context": "Wrong. No islands have succumbed to so-called rising sea levels, but I'm pulling for Martha's Vineyard to be the first -- and take Obummer and 'Big Mike' with it.",
                "good": "4",
                "bad": "4",
                "replies": []
            },
            {
                "user_name": "don'taskme",
                "time": "5 hours ago",
                "context": "Seriously? What islands have sunk?",
                "good": "0",
                "bad": "4",
                "replies": [
                    {
                        "user_name": "Kwayne",
                        "time": "5 hours ago",
                        "context": "I am still waiting for my ocean front property in north Georgia.",
                        "good": "0",
                        "bad": "4",
                        "replies": []
                    },
                    {
                        "user_name": "letsgetrel",
                        "time": "3 hours ago",
                        "context": "Spiny already answered that.",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "spinynorman262",
                        "time": "1 hour ago",
                        "context": "They didn't sink. They were submerged, as listed above.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "wbh2",
                "time": "26 minutes ago",
                "context": "so how many others have gone under if any due to rising sea levels?",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "Cincinnatus296",
        "time": "5 hours ago",
        "context": "Has Tonga built a luxury hotel on it yet?... Too soon?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "fawceto",
        "time": "3 hours ago",
        "context": "How much CO and CO2 did it release?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cmsgt(ret)89",
        "time": "1 hour ago",
        "context": "Good place to send DC politicians",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "4usa714",
        "time": "4 hours ago",
        "context": "I know who we can move to the Island  :)",
        "good": "1",
        "bad": "1",
        "replies": [
            {
                "user_name": "letsgetrel",
                "time": "3 hours ago",
                "context": "Thanks for volunteering yourself.",
                "good": "0",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "ADaddy",
        "time": "2 hours ago",
        "context": "The average elevation of Florida is 6 feet. This new island is looking pretty good.",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "JustKeith",
                "time": "1 hour ago",
                "context": "Actually... if you google it...\n100'",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "russianconspiracies",
        "time": "2 hours ago",
        "context": "Has Xiden offered it to China yet?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ChristianOldGuyRetired",
        "time": "59 minutes ago",
        "context": "I thought climate change was going to cause us to lose land mass, not gain it.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "yankeedogg",
        "time": "3 hours ago",
        "context": "I'm sure China is already trying to claim it as their own....",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "JustKeith",
        "time": "1 hour ago",
        "context": "... and China has already claimed that it belongs to them.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "uscitizenforlife",
        "time": "10 minutes ago",
        "context": "Someone better claim it as theirs before the Chinese come in and take it. They are good at stealing other countries islands, secrets, etc.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "professor1776",
        "time": "1 hour ago",
        "context": "Oh no. Now there is another place we will have to send foreign aid to.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ohhfudge",
        "time": "4 hours ago",
        "context": "The eruption released 40 metric tons of co2 so all coal power plants in the world must be shut down for 30 years to compensate.",
        "good": "1",
        "bad": "2",
        "replies": [
            {
                "user_name": "kwitchyerbeliakin",
                "time": "1 hour ago",
                "context": "You made that up and we all know it.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "DogsandCats",
        "time": "2 hours ago",
        "context": "More land in the South Pacific for the Chinese to usurp.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "wbh2",
        "time": "48 minutes ago",
        "context": "Better claim it before China puts a base on it.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Lokey",
        "time": "2 hours ago",
        "context": "Do the Democrats know about this?",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "rd2021",
                "time": "2 hours ago",
                "context": "They will blame climate change, Trump and systemic racism.",
                "good": "4",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "DePloraBelle",
        "time": "2 hours ago",
        "context": "Volcano control now! \nIrresponsible volcanoes mess with the climate-or-something, yes? We can't have that! \nSubvert volcanism now!",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "presidenttrumpsupporter",
        "time": "4 hours ago",
        "context": "Tonga plant your flag and claim it yours before China moves in and claim it as theirs.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "holdmybeer2",
        "time": "2 hours ago",
        "context": "More pollution than all the diesels running around. Thanks Nature we appreciate it.",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "rd2021",
        "time": "2 hours ago",
        "context": "Kerry will want Tonga to buy carbon credits to off set the volcano.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "democratlivesdon'tmatter",
        "time": "23 minutes ago",
        "context": "So when water levels rise is it from global warming or water displacement?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "wiseacres",
        "time": "3 hours ago",
        "context": "By this time next year the Chinese will have a \"peaceful, civilian\" airstrip on it ...",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cluckythehen",
        "time": "17 minutes ago",
        "context": "I just hope it doesn't flip over.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Trail_Boss",
        "time": "4 hours ago",
        "context": "This is causing global warming and raising the temperature of the ocean. Better get AOC on this!",
        "good": "4",
        "bad": "3",
        "replies": []
    }
]