[
    {
        "error": "error"
    },
    {
        "user_name": "dawgdadii",
        "time": "1 September, 2022",
        "context": "Facts? Speculation, Howie. And you know that it's speculation on your part. Remember the \"facts\" provided to the FISA Court? Yep, those facts. Until they weren't facts at all.",
        "good": "75",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "a.j.",
        "time": "1 September, 2022",
        "context": "Likely=No proof.",
        "good": "13",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "RVA614",
        "time": "1 September, 2022",
        "context": "Howie is yet another FOX NEWS on air person trying to bury DJT. It seems to be a regular occurance as the networks continues to sink to CNN/MSNBC levels.",
        "good": "46",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "bobpies",
        "time": "1 September, 2022",
        "context": "Trump says the DOJ most definitely is on a fishing expedition to find anything to stop him from running for office again.\nSame group that started it in 2015.\npretty sure they will plant evidence. ",
        "good": "49",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "informed&awake",
        "time": "1 September, 2022",
        "context": "Taiwan’s robust and thriving democracy imprisoned its second democratically elected President Chen. And life goes on….",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "85frankenstein",
        "time": "1 September, 2022",
        "context": "Hmmmm, Trump had the authority to declassify those documents.... So, They're not classified if he declassified them...",
        "good": "14",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "trigger485",
        "time": "1 September, 2022",
        "context": "America first",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "bobpies",
        "time": "1 September, 2022",
        "context": "Remember \nWhat's right is right and \nwhat's left is wrong ",
        "good": "12",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "j.b.weld",
        "time": "1 September, 2022",
        "context": "NEWSMAX.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tejas-baby914",
        "time": "1 September, 2022",
        "context": "I think this is the first time I ever saw a government agency take pictures of the cover sheets of potentially classified material. I would like to know who authorized the photography and transmission of this classified material to the media.",
        "good": "7",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "643istwo",
        "time": "1 September, 2022",
        "context": "The sooner we have a Civil War the sooner it will be over and we can start to rebuild. We are only delaying the inevitable.",
        "good": "4",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "soldierphd",
        "time": "1 September, 2022",
        "context": "Sorry Kurtz, you have this wrong. Markings and cover sheets don’t make documents classified, content does. The classification authority needs to review and determine relevance. The staged picture doesn’t convey a “fact,” but rather an illusion to “create,” influence and distort “facts.” Try again, Kurtz, and read up first.",
        "good": "7",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Kurzweil",
        "time": "1 September, 2022",
        "context": "“Trump has shown himself unwilling to accept that he has once more become an average American citizen under the law.”",
        "good": "3",
        "bad": "10",
        "replies": []
    },
    {
        "user_name": "royrsramirez",
        "time": "1 September, 2022",
        "context": "DOJ has lied on so much.  Can NOT be trusted.",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "fualtrde",
        "time": "1 September, 2022",
        "context": "This is yet another self-inflicted wound by The Orange Grifter's legal team. (The special master motion) opened the gates for the DOJ to respond with a 36-page missile right into the heart of Trump Tower.\n\nThis response decimates Trump claims that his team was fully cooperative the whole time. Actually, it lays out a case of obstruction.",
        "good": "2",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "nothingbuta",
        "time": "1 September, 2022",
        "context": "Every excuse Trump has tried to make is easy to refute!  Wake up, people!",
        "good": "2",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "PurpleToast",
        "time": "1 September, 2022",
        "context": "Howard \"neverTrumper\" Kertz. You're as rotten as Chris Wallace was.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "michaelkelly612",
        "time": "1 September, 2022",
        "context": "Of course the FBI does not want a special master. It is important that no independent person overseas the FBI. Just trust us. We are the FBI. The fact all the leaks are coming from us is not important. We still have more magic facts to leak. Let’s get Comey back. Howard please don’t act like you can’t see through this leaked photo that the FBI doesn’t want anyone to check.",
        "good": "3",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "lgr2021",
        "time": "1 September, 2022",
        "context": "This is foxes fact checker who covers the mecia? Was howie hired directly from move on dot org or did he take a few fake jobs in between to hide his true identity?",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "goolie",
        "time": "1 September, 2022",
        "context": "biden--zelensky--kolomoisky--PRIVATBANK--Burisma--cofer black",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ILEANRIGHT413",
        "time": "1 September, 2022",
        "context": "The DOJ says??? NOBODY trusts the DOJ OR THE FBI. They are a bad joke. ",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "chinatopcat",
        "time": "1 September, 2022",
        "context": "It’s likely that Joe Biden is destroying the country. ",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "BidenandDemsblowbigones",
        "time": "1 September, 2022",
        "context": "facts because the libs say they're facts..",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mikeobama535",
        "time": "1 September, 2022",
        "context": "Does anyone trust the doj or fbi or Howard kurtz....yea me neither",
        "good": "19",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "mrwonderful273",
        "time": "1 September, 2022",
        "context": "This is nothing new for the DOJ.  I watched them do the same thing to my dad over 30 years ago.  The news media was complicit.  \nAll about the headlines.  \nWhen they realize there is nothing there, the results in the media are buried 4 or 5 pages back.  The damage is done.",
        "good": "40",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "nothingbuta",
        "time": "1 September, 2022",
        "context": "I wonder if they found some of the documents hidden in the Time Magazine picture frames!",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "innamillel",
        "time": "1 September, 2022",
        "context": "The DOJ is a criminal organization.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "bratney832",
        "time": "1 September, 2022",
        "context": "FBI corrupt. Period. Get on Telegram and follow President Trump and hear it from the President himself as to what’s going on. The man has continued to fight for our Country and the fake President sitting in office is the one that has committed treason. The FBI protected him and his son from business dealings while he was in office. Trump2024!",
        "good": "5",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "sonnyliston",
        "time": "1 September, 2022",
        "context": "Howard “Trump Derangement” Kurtz at it again 🤡🤡🤡🤡🤡",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sittinonthedock546",
        "time": "1 September, 2022",
        "context": "Kurtz has always belonged @ CNN with Wallace. ",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "notallofus262",
        "time": "1 September, 2022",
        "context": "A cemetary with ONE coffin on a golf course??? Hmmmm.......",
        "good": "2",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "mickey1976",
        "time": "1 September, 2022",
        "context": "What a sad joke. The DOJ is corrupt. Trump can’t hide classified docs when he declassified them.",
        "good": "6",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "jbleau633",
        "time": "1 September, 2022",
        "context": "When was Kurtz right about anything?  Him and Rove must share an office.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "vlo14295",
        "time": "1 September, 2022",
        "context": "So, the suppression of the Hunter Biden laptop story is the real story",
        "good": "7",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "johnn707",
        "time": "1 September, 2022",
        "context": "No....see you in November Democrats. You guys are gonna lose your minds when you see this red wave...",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "johnn707",
        "time": "1 September, 2022",
        "context": "Hope the playing field is level for this red tsunami that's coming in November Democrats have no outs",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "fireinthesky7",
        "time": "1 September, 2022",
        "context": "Kurtz is a plant from the NY Times.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "iffets",
        "time": "1 September, 2022",
        "context": "If Trump was going to \"hide\" documents, I really don't think he'd hide them at his home. ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "1stcorpsanv.",
        "time": "1 September, 2022",
        "context": "I have a feeling the West Coast drought will end, Lake Mead will fill back up, After the mid terms, from all the Liberal tears.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bobriley912",
        "time": "1 September, 2022",
        "context": "just like the rest of the witch hunt of the last 6 years. big nothing burger. ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "JustaDude170",
        "time": "1 September, 2022",
        "context": "Trusting anything the FBI or the department of justice say is like trusting Epstein with an underage girl. You just don’t.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "johnn707",
        "time": "1 September, 2022",
        "context": "All I'm going to say is if they feel they need to go after a man that has been out of office for almost 2 years it's telling me they are terrified of him in 2024",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bobe314",
        "time": "1 September, 2022",
        "context": "If Trump was trying to hide documents and owns so many properties why would he remove them from his secure storage and hide them in his desk? Personally I believe some if not all of those documents may have been smuggled in when the FBI entered, why else refuse to allow Trumps attorneys to observe the search and ask for the security cameras to be turned off?",
        "good": "46",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "mabbam980",
        "time": "1 September, 2022",
        "context": "DOJ is just about as corrupted as is every other branch of government by the antics of the Democrat Party beginning with Obama. Lawlessness abounds everywhere and there is no end in site at the present time. \nClassified documents?\nCheck out Hillary.\nThey did, that is Comey and others did\nGave her a clean bill of health.\nCheck out Hunter’s laptop\nThey did, they said \nRussian disinformation they said.\nStill keeping the HOAX alive \nVersion 2.0, 3.0, 4.0 and beyond.\nWill it never stop.\nDonald Trump has been made to look like the Emanuel Goldstein of ORWELL’s “1984”\nConstantly hate, hate, hate , hate , hate.\nMy God.\nWhat is happening to this country.\n ",
        "good": "3",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "ballerina61!",
        "time": "1 September, 2022",
        "context": "doj is weaponized against Trump AND ALL AMERICANS! If you think they will stop at President Trump THINK AGAIN! What about the \"paraders\" from Jan. 6 that are still in solitary confinement without a court hearing! ONE person died that day - a quiet, peaceful woman was shot by a capital police! WHERE'S THE \"SAINT GEORGE\" OUTCRY?!?",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "macc282",
        "time": "1 September, 2022",
        "context": "Since when did the DOJ, a Federal investigative and enforcement agency, comment on \"on going\" investigations? So much for the \"likely\" fair and impartial administration of justice part.",
        "good": "12",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "nthemiddle",
        "time": "1 September, 2022",
        "context": "So we went from...there are no documents, the fbi planted them, I declassified them,  they're part of my presidential documents so I'm allowed to have them. What's the next excuse?",
        "good": "0",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "johnn707",
        "time": "1 September, 2022",
        "context": "They are Treating Trump as though he has no rights as a citizen or former President. Even if you are not a Trump supporter you have to look at the DOJ and FBI with suspicion.",
        "good": "25",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "Ross81-06-05",
        "time": "1 September, 2022",
        "context": "Might have, likely, maybe, those are not definitive words. The FBI can claim anything, true or false, at no consequence. They told us for years the dossier was real, they also said Trump obstructed their Russia Collusion investigation, both were false. So why should I believe anything they say now? ",
        "good": "74",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "justsomethoughts501",
        "time": "1 September, 2022",
        "context": "The current DOJ will charge Trump, let the fight begin.  The Biden admin has opened Pandora’s box, more political reprisal will come in the future.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "devin808",
        "time": "1 September, 2022",
        "context": "Searching an ex presidents house is just nonsense.  Just think of all the creepy stuff is in Biden,  Obama and the Clinton's homes. Yikes!!! The FBI has become weaponized. It started while then Kenyan was in office and the RINOs helped him out. Democrats hate America and there proud of it.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "alltrumpedup",
        "time": "1 September, 2022",
        "context": "\"Likely\" which means new witch hunt!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "BidensBlunderousAfghanSurrender",
        "time": "1 September, 2022",
        "context": "Will the REAL Chris Wallace, please stand up, please stand up, please stand up!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "1stcorpsanv.",
        "time": "1 September, 2022",
        "context": "If they are all mass print like shown with colorful boarders for meeting hand outs, are they really secret or classified anymore...",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jwillstoneii",
        "time": "1 September, 2022",
        "context": "Pictures of a truly classified document... sure.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "infidel52",
        "time": "1 September, 2022",
        "context": "Likely?Likely?",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "1stcorpsanv.",
        "time": "1 September, 2022",
        "context": "Hey Garland, why so much area redacted?\nthey black lines are covering up the blank spaces to fill in later if we really find something.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "BRight374",
        "time": "1 September, 2022",
        "context": "How do we the people know this wasn’t a set up?  These people had been in Trumps home before and everything was in order. They then break-in for hours scatter, and plant papers where they wish. What about Hillary’s server!!!!!",
        "good": "4",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "verysane",
        "time": "1 September, 2022",
        "context": "Is this the start of the \"Stop the Witch hunt\" campaign requiring more donations when contributions are still being amassed by Trump for the \"Stop the Steal\" campaign? Since we cannot donate anymore to his scam charity, which turned out to be his family, should we now donate for his 5 star prison cell service?",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "monocle",
        "time": "1 September, 2022",
        "context": "Sorry Howie,\n\nFor it to be a turning point, the DOJ would have to have some credibility...",
        "good": "7",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "johnn707",
        "time": "1 September, 2022",
        "context": "At least we don’t have Justice Garland. Think about how much damage he could do to this country in that position.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bennieblancofromcleveland",
        "time": "1 September, 2022",
        "context": "I’ll admit to being at a loss as to what criteria his remaining supporters use for assessing leadership qualifications.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Jlredder",
        "time": "1 September, 2022",
        "context": "Throwing Top Secret documents on the floor and taking a picture of them is absolutely absurd.  Never gonna happen if they were real.  They will stop at nothing to destroy this man because they know he’s the only one who can stop THEM from destroying this country.",
        "good": "11",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "GoldFish",
        "time": "1 September, 2022",
        "context": "Vote R in Nov......That or get washed down the Drain by Biden.",
        "good": "4",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "loaferspt",
        "time": "1 September, 2022",
        "context": "Hmmmm... let me see.  Trump lawyers were not allowed to be in the rooms that the FBI were raiding and we are suppose to believe that none of this was staged by the FBI?  Sorry not buying it.   Once you lose trust you never get it back!",
        "good": "6",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "bg3putts",
        "time": "1 September, 2022",
        "context": "The first to speak always sounds right until the other side presents it's case. The Russia collusion sounded right until the real facts came out, I will wait until both sides are out until I decide who is in the wrong, thanks anyway Howard.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "thebigliar307",
        "time": "1 September, 2022",
        "context": "“Facts” are something that Trump, his lawyers and his cult followers know nothing about. Trump is guilty. Obstruction of Justice is a felony. I could care less what the DOJ decides to do with this. Indict and charge Trump. Go ahead. Give him a slap on the wrist. Go ahead. So nothing. Go ahead. But it’s time for the Republicans to put this toxic, cancerous, lying, fraud, behind us. Look what happened in Alaska last night. If the Republicans don’t move past Trump, the mid terms will be disastrous. . ",
        "good": "3",
        "bad": "3",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "paulyg",
        "time": "1 September, 2022",
        "context": "Wow! That read like a CNN report !",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "colonelcolt",
        "time": "1 September, 2022",
        "context": "Wow, I so impressed. The secret documents were photogenically left in plain view by Trump, next to the magazine covers.\n\nAnd the DOJ is really on the side of Right, notwithstanding selective enforcement of federal law.\n\nBut I guess Howie believes in the tooth fairy, too. Glad you have him, Fix. He's worth a giggle.",
        "good": "1",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "Noonematters",
        "time": "1 September, 2022",
        "context": "If they only showed all of the evidence during Epistein’s trial. That is something the public is interested in.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "HighPlainsGrifter",
        "time": "1 September, 2022",
        "context": "Trump on Truth Social demanding to be reinstated. Wow!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "steeledreaper2.0",
        "time": "1 September, 2022",
        "context": "Look at the pages closer, the ones that have the fake paper over them .That is a photoshopped picture.\nAll those secret documents were out in the open for everyone to read that passed them.\nIf these documents were really classified ,no one but the guys with clearance would  \nBe able to see them.\nThe one with the Presidential seal look at it,that looks like a personal document.",
        "good": "19",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "apubesworstnightmare",
        "time": "1 September, 2022",
        "context": "Fox has gone anti trump will the cult storm Fox headquarters?",
        "good": "1",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "Betterdon'tthink",
        "time": "1 September, 2022",
        "context": "Trump hid the documents…. Now he says he declassified (by the way he can’t)… but the key point is: why was he keeping those documents? For what use? All the rest is noise and I hope trumpers realize it",
        "good": "1",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "johnn707",
        "time": "1 September, 2022",
        "context": "The ENTIRE FBI is guilty of hiding Joe’s & Hunter’s crimes.   There is NO WAY one guy pulls this off by himself with all the attention.   He was backed up by the DOJ and the entire management team of the FBI. ",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "ghost2020769",
        "time": "1 September, 2022",
        "context": "You can almost believe Garland and the DOJ.  NOT!",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "BidensBlunderousAfghanSurrender",
        "time": "1 September, 2022",
        "context": "DNC Trump Story Trolls are waking up and crawling out of their sewers.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "johnn707",
        "time": "1 September, 2022",
        "context": "What happened was a federal firearms crime, along with drug dealing, prostitution, influence peddling, & money laundering. Will Hunter face any charges? No, none. Will Joe be questioned about the money going to \"the big guy\"? No, he won't.",
        "good": "30",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "plnjane",
        "time": "1 September, 2022",
        "context": "doj absolutely has to go after Hillary and the bidens now. ",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "maddog49",
        "time": "1 September, 2022",
        "context": "You sound so compelling, HOWARD KURTZ!  Let me tell you why your column is B.S.  The reason is that you are trying to REWRITE HISTORY Orwellian-style.  You want us to forget that the FBI raid was supposed to be about an informant seeing a NUCLEAR WEAPONS DOCUMENT in Donald Trump's house.  Both President Biden and Merrick Garland told news reporters there was an alleged nuclear weapons document.\n\nBut some of us know that Top Secret is not the top security classification.  There are FIVE MORE LEVELS ABOVE TOP SECRET.  Such documents are kept in thick-steel-walled vaults.  You cannot remove Above Top Secret documents from the vault.  The President has to go to the Pentagon where the vault is.  Any document that could get Trump executed for treason is in one of those vaults.\n\nNow, Kurtz, YOU are trying to make it sound like Trump hiding documents was the impetus all along.  No, it is a desperate attempt to salvage a smart-aleck strategy.  The affidavit cannot be fully revealed because doing so would likely cause monstrous EMBARASSMENT to the Biden administration that the impetus was the alleged nuclear weapons document.  How could Biden and Garland NOT KNOW that a nuclear weapons document cannot leave the Pentagon vault, therefore Trump never had one in the White House to move to his own home? \n\nFurthermore, Kurtz, you are kidding yourself if you think the Biden administration didn't know what was in those classified documents on the day they were confiscated.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "freeatlast1966232",
        "time": "1 September, 2022",
        "context": "We only have their word on where and what they found since cameras were turned off and there were no other witnesses.  I'm sorry, the DOJ and FBI are no longer upstanding and trustworthy.  I just don't believe them.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ballcoachmom123",
        "time": "1 September, 2022",
        "context": "The DOJ wouldn't lie now would they??? They broke into Trump's safe (empty)without the proper warrant for a safe. They wouldn't allow his lawyers to watch the search!!! They broke in when they knew he wouldn't be there!!! NOT SUSPICIOUS AT ALL!!! WHAT ALL DID THEY TAMPER WITH? DID THEY PLANT ANYTHING? DID THEY PUT BUGS IN HIS HOUSE? WHO WOULD TRUST THE DOJ/FBI THESE DAYS???",
        "good": "3",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "64squares386",
        "time": "1 September, 2022",
        "context": "The presence of cover sheets and classification markings means nothing.  If the President declassified these documents, then these cover sheets and markings must be removed and stricken.   If the bureaucrats were resisting this process up to the end of President Trump’s term, that is irrelevant to this process.  They must be removed now.  Crimes?    Not hardly.   ",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Ugadawg74",
        "time": "1 September, 2022",
        "context": "trump sent top secret documents as birthday cards or just made paper airplanes and threw them around mar a lago!!!",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "braybur",
        "time": "1 September, 2022",
        "context": "Latest dem hoax ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Ugadawg74",
        "time": "1 September, 2022",
        "context": "DOJ THE BIGGEST SO CALLED OFFICE FOR TRUTH AND JUSTICE USES HERESAY AS A DEFENSE GO FIGURE !!!!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rakkasanleader2",
        "time": "1 September, 2022",
        "context": "What's lost in this story line - conveniently, is the simple fact that the President has the authority to declassify intelligence. If he did, then the sworn affidavits that his attorney's provided stating there were no classified documents in the building, would be accurate. Under normal circumstances - the documents would be clearly marked Declassified, with a date. But as we know, Trump had his own way of doing business. Since all we've seen are classification cover letters (Red Secret and Orange Top Secret), getting that third set of eyes on the documents - the 'special master,' is critical.",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "iowalife",
        "time": "1 September, 2022",
        "context": "Like in Ashley Biden's Tweet last night the goal is to march him out in handcuffs in front of the TV cameras. The only thing that might prevent that is 1 million people camping out on the grounds of Mar-a-lago the next 12 months. The local authorities would just cut off water and electricity which would close the 'campground'.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bschab",
        "time": "1 September, 2022",
        "context": "I thought DoJ didn’t comment on ongoing investigations?  I guess they do when they need to direct the MSM and general publics attention?  If these documents, photographed and laying spread across the floor are possibly damaging to our national security, why TF are they photographed and being shared on national news???  ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "19sdi57019",
        "time": "1 September, 2022",
        "context": "If these documents are classified top secret, then why have they been shown to the public?",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "whatmeworry1",
        "time": "1 September, 2022",
        "context": "Given that DOJ attorney Kevin Clinesmith forged evidence to be used in an affidavit against President Trump, it is entirely plausible that the FBI/DOJ once again fabricated and planted evidence.",
        "good": "7",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "jrvega1",
        "time": "1 September, 2022",
        "context": "Likely just doesn’t seem to be a legal term to justify this raid.  Rogue agents need to be fired!",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "gophergravy",
        "time": "1 September, 2022",
        "context": "Howie smells blood in the water.  Get him to cnn quickly.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jmlansdowne",
        "time": "1 September, 2022",
        "context": "Only 5hing I'm curious about were these photos taken before or after. The FBI demanded the security cameras be turned off and trumps lawyers were not allowed to watch the search? ",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "whatmeworry1",
        "time": "1 September, 2022",
        "context": "Charles Schumer warned us about the deep-state which is the fourth and most powerful branch of government: “Let me tell you, you take on the intelligence community, they have six ways from Sunday at getting back at you.”",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "theunforgiving",
        "time": "1 September, 2022",
        "context": "Fox is saying now that Trump went to China and Russia to try to sell the documents because the billionaire was short of money /sarc.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mydogsarebetterthanyourkids",
        "time": "1 September, 2022",
        "context": "When did Fox become CNN?",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "flyandscuba",
        "time": "1 September, 2022",
        "context": "So why spread them all over the floor and take photos? And leak the photos to the press? The FBI has a political bent against President Trump. It and the DOJ are weapons of the leftist democrats - nothing more.",
        "good": "10",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "therealdrw",
        "time": "1 September, 2022",
        "context": "Please stop carring Howard Kurtz' stories.  He's a toilet.  Thank you.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "scrutinize",
        "time": "1 September, 2022",
        "context": "Trump sees America as an exploitable asset. He thinks only of his wealth and power. Republicans hate America.",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "Longs",
        "time": "1 September, 2022",
        "context": "I think the photo is suspicious. I’m quite sure it’s not normal protocol chuck a bunch of Top Secret document onto the floor. Remember they were there to get the documents, not review them during the raid. I say suspicious because this photo could have been released weeks ago. Funny how a TIME magazine cover is neatly staged right of the document with all the Democrats peaking in the Oval Office window looking over Trumps back. I will say, if anyone can handle and move Top Secret documents out of the White House like they are moving their furniture, we have a much bigger problem!!!!!",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "noggled",
        "time": "1 September, 2022",
        "context": "Barr lied about the Mueller report. Garland is letting his court filings tell the truth. But don’t forget to send Trump all your money, your wife and your daughters.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "antidictator",
        "time": "1 September, 2022",
        "context": "FOX will censor and cancel this article.\nIt actually tells truth and facts",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "Pfftt",
        "time": "1 September, 2022",
        "context": "Your cult leader is about to be imprisoned. Guess you'll have to vote Democrat if you know what's good for you. F your constitution. Surrender your weapons or else.",
        "good": "0",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "🇺🇸saynotodempolicies🇺🇸",
        "time": "1 September, 2022",
        "context": "They say trumps office is meticulous at all times. Would never leave documents on a floor.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Myway499",
        "time": "1 September, 2022",
        "context": "Howard Kurtz…trying out for a new gig at MSNBC? Probably the least watched program on Fox News!",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "theunforgiving",
        "time": "1 September, 2022",
        "context": "Drip, drip, drip, the FBI and DOJ are full o leakers.  Always have have been.  They leak info to shape their narrative.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Ouigee",
        "time": "1 September, 2022",
        "context": "Howie, are you forgetting a little item called due process? All the DOJ did was make unproven allegations. They are going to have a big problem with chain of custody since representatives for President Trump were not allowed to be present during the raid. They are also going to have problems in that Obama and Clinton did the same thing with no repercussions.  Garland and the DOJ have put themselves in a no win position. ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "westcoastchowd",
        "time": "1 September, 2022",
        "context": "Howie's a Washington Post mole at the network. Remember what the viewers did to Chris Wallace? Yeah Howie, soon you will be employed by the sinking ship CNN.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "DON'SFOXNATION",
        "time": "1 September, 2022",
        "context": "Howard, given your bias, could this picture have been staged by the corrupt DOJ and FBI?",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "TheJackal454",
        "time": "1 September, 2022",
        "context": "THIS MEANS NOTHING. THE FBI COULD OF TAKEN THOSE DOCS IN WITH THEM. I WOULDN'T PUT IT PAST THEM.",
        "good": "7",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "Bodger",
        "time": "1 September, 2022",
        "context": "Likely won't win you any cases.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "griffin",
        "time": "1 September, 2022",
        "context": "Why aren’t they selectively leaking photos of Melania’s underwear after they rifled through them?  Disgusting selected leaks to somehow justify their KGB tactics.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ddsmpret",
        "time": "1 September, 2022",
        "context": "Hid?  Putting them in a closet or desk is hiding!",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "someonewithanopinion",
        "time": "1 September, 2022",
        "context": "If those are images of evidence of the ‘crime’ why haven’t they arrested anyone yet?  If this was a murder case and they asked for a warrant declaring the ‘evidence’ would be located at the location and then they showed pictures of the ‘murder weapon with blood splatter’ they would have already made the arrest. Now you say this isn’t a murder case. Correct,  they claim it deals with ‘national security’ and poses grave danger to the United States. Now it’s either as serious as murder or it’s not. If it is,  make the arrests. ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Command_Shift_Right",
        "time": "1 September, 2022",
        "context": "Howie's a cnn plant.  Last article I'll read by him.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "patriotusa01",
        "time": "1 September, 2022",
        "context": "The DOJ has little to no credibility, until they clean house in both DOJ and FBI everything they say or do will be suspect. The Republican party needs to take control of Congress and the Whitehouse and I mean true conservatives not Rinos. If the American people don't act quickly and use their vote wisely come November, we will truly be lost as a Nation.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jlarsen5860052",
        "time": "1 September, 2022",
        "context": "No facts. Just an opinion. 45 is being tried and convicted in the media. Again. The Left needs to go back to the basement.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Bigdaddyjustice",
        "time": "1 September, 2022",
        "context": "Fake News",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "gregg.318",
        "time": "1 September, 2022",
        "context": "Yawn.  If the DOJ and FBI hadn’t already demonstrated how corrupt they are, we might take it seriously.  \nResist the totalitarian leftist thugs.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "giftofgod",
        "time": "1 September, 2022",
        "context": "There is nothing fair about the Media. You never get the whole story. You get what they want you to hear and see. Then they tell you these are the Facts. THEY WANT YOU TO BELIEVE Trump not only stole government documents, but he was going to sell them to our enemies. The FBI uses the word \" LIKELY \" in their reports. Likely is not evidence.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "lift8686",
        "time": "1 September, 2022",
        "context": "Keep in mind. His only defense is that the fbi is out to get him.  Really?  You can’t make this up.",
        "good": "0",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "dmack748",
        "time": "1 September, 2022",
        "context": "declassified",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "shelleychez",
        "time": "1 September, 2022",
        "context": "I had to double check to make sure I wasn’t on CNN!!\nIs FOX attempting another move to the middle? Lots of speculation here. \nDear FOX, I hate Goodbyes.. but one might be in our future. \nNewsmax is looking better.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "calico193",
        "time": "1 September, 2022",
        "context": "\"But what journalists are dealing with in these latest Trump developments are facts.\"....BWAHAHAHAHAHAHAHAHAHAHAHAHA.....BAAHAHAHAHAHAHA.....oh, I needed a good laugh!!!!  There's not a journalist out there today that would know what a \"fact\" was if it bit them on the rear....",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Bigdaddyjustice",
        "time": "1 September, 2022",
        "context": "Fake News",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sloppytitzaoc",
        "time": "1 September, 2022",
        "context": "Still can't find anything...haha",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "corruptliars2022",
        "time": "1 September, 2022",
        "context": "Howie is the new chris Wallace\nFire Howie today!!!!!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sloppytitzaoc",
        "time": "1 September, 2022",
        "context": "To the effect of?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "djt2024nope",
        "time": "1 September, 2022",
        "context": "Yes conspiracy everywhere...except with Trump himself, of course.   So many people on this discussion board who believe everything and anything except the obvious.  Face it folks, Trump was a self defeating President.  His \"rules don't apply to me\" attitude has now brought him to the brink of disaster.",
        "good": "0",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "P@ppy",
        "time": "1 September, 2022",
        "context": "I only served on Jury Duty one time.... But I don't think \"Likely\" was used while we were deliberating ?   This is going to be another colossal waste of time & money.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "wjbii",
        "time": "1 September, 2022",
        "context": "So?\nI bet Obama and Bush STILL HAVE some. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "marylndconservative",
        "time": "1 September, 2022",
        "context": "If he’s charged, there’s going to be an uproar as this seems way less than what Hillary did.  They will have these charges waiting in the wings until 2024 or charge him and drag it out.  So obvious . . .",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "panget",
        "time": "1 September, 2022",
        "context": "Staged. The folders are neatly arranged.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Cap'Ec",
        "time": "1 September, 2022",
        "context": "Too much speculation delivered as fact by Howie.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "balabergowitz",
        "time": "1 September, 2022",
        "context": "Seems Highly unusual that Biden's DOJ/FBI feels the Need to  Quell\nthe Media Attention and Trump's Right for a \"Special Master\".\nThey're seem to be Protesting too Much - Fear that they're about to be Exposed?",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "escape",
        "time": "1 September, 2022",
        "context": "Does anyone really think Trump was in a basement hiding documents.\nSo beneath him.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mRNAsecretoflife=life",
        "time": "1 September, 2022",
        "context": "The box with the framed \"Time\" deal is a classic Trump...they were not staged.\nExhibit is 2A...what does exhibits 1A-Z show?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jasonf148",
        "time": "1 September, 2022",
        "context": "Does Toddler Tyrant's makeup crew do a comb over on his hairy magic document declassifier wand too?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "AlinaLopez12",
        "time": "1 September, 2022",
        "context": "A Raid  80 days before the mid terms … all msm talk about,  how convenient?  Better  than covering the complete disaster that is the Biden administration.  We aren’t buying it. ",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "Suzfah",
        "time": "1 September, 2022",
        "context": "More lies and propaganda. ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bflead",
        "time": "1 September, 2022",
        "context": "We are to believe that DJT grabbed all these docs and put them in boxes with magazines with his photo on the cover? Bahahaha. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bigjohntn202",
        "time": "1 September, 2022",
        "context": "Staged photos.  The fbi probably brought those doctored documents in themselves and staged it.",
        "good": "7",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "ctt515",
        "time": "1 September, 2022",
        "context": "The amazing part of this is how it was not on their radar as brightly and targeted as it is right now.  Something to be said for that when you weed through the mess.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "hateseveryone",
        "time": "1 September, 2022",
        "context": "Facts?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Tim1952",
        "time": "1 September, 2022",
        "context": "I think Howie is upset that Chris Wallace is gone...or maybe he know Paul Steinhauser will be taking his job soon at Fox...",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rightseroding",
        "time": "1 September, 2022",
        "context": "All this is damming if the DOJ can be trusted.\nGuess what? They're NOT to be trusted!\nThey have demonstrated with unswerving ability to be corrupt!",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "freddy6969",
        "time": "1 September, 2022",
        "context": "All planted by the corrupt FBI",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "winterwarrior",
        "time": "1 September, 2022",
        "context": "Me:  \"The FBI and Biden Regime likely planted inflammatory documents.  Is this the turning point?\"",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "mRNAsecretoflife=life",
        "time": "1 September, 2022",
        "context": "Murdoch said he is done too...in NY Post...when will Fox Howie?\nTrump stuck himself with a fork to see if he is done...he is done...\nTrump ‘admits possession’ with Truth Social post that is ‘evidence of his guilt’: analysis",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "mycally",
        "time": "1 September, 2022",
        "context": "Just another political hit job. Straight up.  They could say those documents found anywhere in the house and get away with it. They wouldn’t let any witnesses in the house to refute their claims. ",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rpsmith99",
        "time": "1 September, 2022",
        "context": "Ha…i love the smell of desperation from MAGAts in the morning.  The comments are hilarious!",
        "good": "3",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "Kalena",
        "time": "1 September, 2022",
        "context": "How do you prove \"likely\" in a court of law?  So funny.  ",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "azbitesback",
        "time": "1 September, 2022",
        "context": "That makes it look STAGED by the FBI!",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "goatroper074",
        "time": "1 September, 2022",
        "context": "Howie baby, you should be asking about the number of documents that the Deep State is planting amongst those that Trump rightfully had in his possession. You do realize that Democrats have to lie, cheat, and steal to “win” elections, right? Come on man.🇺🇸",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "holiday1973",
        "time": "1 September, 2022",
        "context": "I would expect that he wouldn’t make them public, Hunter Biden wasn’t president.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "alarian",
        "time": "1 September, 2022",
        "context": "Howard Kurtz should just go work for CNN",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Reverend306",
        "time": "1 September, 2022",
        "context": "I guess the fib(FBI) likely his hunters laptop and hitlerys emails🤔🤔🤔",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "DirtySanchez122",
        "time": "1 September, 2022",
        "context": "To summarize the facts, Trump took PLAINLY MARKED classified records to Mar-a-Lago. He has delayed, obstructed and resisted Government efforts to recover them. Then he (or his staff) concealed the records from investigators and they have now been clearly caught doing so. \nTHE END",
        "good": "1",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "Democratsuckock!",
        "time": "1 September, 2022",
        "context": "“Likely hid”. A team of federal agents couldn’t decipher if he did or not?",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "hunter2555",
        "time": "1 September, 2022",
        "context": "Your honor, he \"likely\" did it..lol they have nothing on President Trump 😁",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "larryblake",
        "time": "1 September, 2022",
        "context": "Just another Dim witch hunt backfiring on them.  Dims remind me of the Roadrunner and Coyote cartoons.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "FrankieSoCal",
        "time": "1 September, 2022",
        "context": "\"likely hid\" means they are trying to smear Trump falsely with no evidence.",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "eatshit327",
        "time": "1 September, 2022",
        "context": "And the DOJ is likely lying.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "farmerwalt",
        "time": "1 September, 2022",
        "context": "NO ONE BELIEVES THE CORRUPT CROOKS AT FBI AND DOJ..",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "edthec720",
        "time": "1 September, 2022",
        "context": "Why was Hillary not held to the same standards for handling classified material?",
        "good": "3",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "larryblake",
        "time": "1 September, 2022",
        "context": "\"Trump likely hid classified documents\"..........is that sorta like could have, might have or possibly have?\n\nHA! HA! HA!",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "0fnobledescent",
        "time": "1 September, 2022",
        "context": "A top secret labeled piece of paper shows me nothing.  I can actually print one out for myself and put a big pile of blank papers under it. DOJ and FBI have lost all street cred",
        "good": "5",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "dennisinwv",
        "time": "1 September, 2022",
        "context": "At what point during the FBI’s removal of documents from boxes and throwing them on the floor become “tampering with evidence”?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "gsd",
        "time": "1 September, 2022",
        "context": "Howie Kurtz just another Trump hating pundit",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rpsmith99",
        "time": "1 September, 2022",
        "context": "Trump is a broken human being. His narcissism is off the charts. He believes laws don’t apply to him. \n\nWell, he’s wrong. He’s going to die in prison.",
        "good": "4",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "Redfly0451",
        "time": "1 September, 2022",
        "context": "As implied it is \"likely\" that the FBI is being used as a policical weapon against Trump and the Republican party.\nIs not \"likely\" but a fact that they are leaking informaion in order to divert attention and affect the public's opinion.  And no one has told them to plug these leaks..\nThe FBI and DOJ have a confirmed pattern of this behavior.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rlp1963",
        "time": "1 September, 2022",
        "context": "Still not worthy of an FBI raid. Other Presidents and lesser office holders such as Hillary Clinton have had classified documents and took their time about returning. There wasn't any reason to believe he was being anything but stubborn about returning them. This is just another example of how they do things differently when it comes to him. Not my government.",
        "good": "3",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "btjustin",
        "time": "1 September, 2022",
        "context": "Howard Kurtz is such a joke, no one in their right mind believes a word he says.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "conman84019",
        "time": "1 September, 2022",
        "context": "Maybe he did, but accusing someone without proof?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "hhh1",
        "time": "1 September, 2022",
        "context": "The DOJ says a lot of things....except what is true and factual.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "CATSGOFOR9",
        "time": "1 September, 2022",
        "context": "We all know Trump has severe mental issues, it’s common knowledge. Most likely he believes he is still President and can do as he pleases.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "trulynobody",
        "time": "1 September, 2022",
        "context": "Meanwhile, still waiting for the raid on the university holding all of Biden's papers",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "TalkToMike",
        "time": "1 September, 2022",
        "context": "Another never Trumper from fox. ",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "borkkan",
        "time": "1 September, 2022",
        "context": "What is \"real\" about the photo? Nothing  The Jackets for this paperwork are just cover sheets.. They have shown nothing about the contents.. Just becasue someone deems something Top Secret does not mean its actually Secret  100s of people know about it.. The FBI has got to be the dumbest organization in our country.. They don't have just egg on their face they are wearing their entire breakfast on their face.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "uncadippy",
        "time": "1 September, 2022",
        "context": "Knowing what we now know about Russia collusion hoax, Hillary's emails, hunters laptop, ray Epps, why would anyone trust a word coming from doj or the FBI? They just create the evidence they want.",
        "good": "3",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "danlxi",
        "time": "1 September, 2022",
        "context": "Hillary Clinton???",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sonnie51",
        "time": "1 September, 2022",
        "context": "In the history of the presidency, not one president home was ever raided. If he hid some why not all, as if he knew you were coming. Please stop the lies, you look pretty bad. Most of us have been watching the bouncing ball from the very beginning.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "c_h289",
        "time": "1 September, 2022",
        "context": "Apparently Howard Kurtz has the tendency to claim FACTS on things he wishes them to be present/true just like his former counterpart /comrade on  CNN. \n\nAccording to this logic of his, anyone's home can be searched if this person is suspected of some \"likely\" crime. And you will be shown the proof, if any, after the search.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "highwaystar357",
        "time": "1 September, 2022",
        "context": "The Dims grasping at straws. There isn't a straw in the world that will save Brandon and his cult.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "johnlee966",
        "time": "1 September, 2022",
        "context": "A turning point??  It's desperation, pure and simple!",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "srpatterso",
        "time": "1 September, 2022",
        "context": "The DOJ said President Trump colluded with Russia. Was that a \"turning point\"?",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "treefitty354",
        "time": "1 September, 2022",
        "context": "Democrats can pretend to care about classified documents when they retrieve the 30,000+ Hillary Clinton destroyed.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Boiledcrabs975",
        "time": "1 September, 2022",
        "context": "I would sooner believe the DOJ or FBI hid documents in the boxes they took out of Trumps place. They have a history now of lying and planting evidence to destroy him.",
        "good": "4",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "brylcreamboomer",
        "time": "1 September, 2022",
        "context": "Since we have no witnesses and the cameras were turned off, then these papers are props in a theater production if you ask me.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jwhite701",
        "time": "1 September, 2022",
        "context": "no this just another Russia Russia Russia",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "timpfay",
        "time": "1 September, 2022",
        "context": "The DOJ is no longer doing its job. They need to be defunded!",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "bobburger910919",
        "time": "1 September, 2022",
        "context": "Kurtz has to go. He's a one trick pony. Hates Trump, Trump is bad, Trump did this and Trump did that. Go see a doctor...",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "jbchi844",
        "time": "1 September, 2022",
        "context": "Hey Howard, when do you start at MSNBC?",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "elderlygentleman482",
        "time": "1 September, 2022",
        "context": "This article implies we should believe the serial liars at the DOJ and FBI. I have no confidence in any thing they say. How do we know they didn’t “stage” the picture. I am not a fierce Trump supporter, I just have NO Trust in the FBI or DOJ.",
        "good": "5",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "ctemple268",
        "time": "1 September, 2022",
        "context": "For all we know the FBI brought that pile in with them. Zero transparency. No one watching them. They can say literally anything. ",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "richard52831",
        "time": "1 September, 2022",
        "context": "Hell, I bought some of those \"top secret\" covers for some of my papers as a joke once. Anyone can say \"Look! Top secret!!\"",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "john2000",
        "time": "1 September, 2022",
        "context": "When the DOJ start prosecuting democrats for their crimes then I will start taking their claims seriously.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "undeniably-tru",
        "time": "1 September, 2022",
        "context": "First of all Kurtz, if the documents are missing how do they know they were in President Trump's procession?  Secondly, how do we know that an untrustworthy DOJ ridden with bias and hate for President Trump is being honest about what they say?  Thirdly, President Trump has the right as a President to declassify any document that transpired while he was in office.  Biden hid all of his documents in Delaware, Obama hid his documents in Chicago and Hillary burned and bleached hers.  We need to close this one way street.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "scouser1010",
        "time": "1 September, 2022",
        "context": "Facts give me a break. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cjw6519",
        "time": "1 September, 2022",
        "context": "Fox will be overtaken by New Max allowing this liberal on your show",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "1951stu",
        "time": "1 September, 2022",
        "context": "Howard, the FACT is, the FBI leadership is corrupt. THAT is what's important and what needs to be reported.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Nurse13",
        "time": "1 September, 2022",
        "context": "I hope Trump releases the videos…. Let the world see😂",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "boris25",
        "time": "1 September, 2022",
        "context": "What is Fox using an obviously “staged photo “ to sell the FBI’s story? I’m sure President Trump had papers lying around  the floor in his office.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "calloway01",
        "time": "1 September, 2022",
        "context": "dear howard kurtz....what snake oil you selling? the picture you refer too invokes a feeling.  you were right about that.  its utter disgust at how far the DOJ has fallen as to use the equivelant of visual sight gags to impress the spongebob squarepants intelligence of their groupies.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "051314",
        "time": "1 September, 2022",
        "context": "The key word here is ‘likely’   That tells me the DOJ and FBI have squat. That this is ‘likely’ another witch hunt. Everyone involved in this charade should be ‘cancelled’",
        "good": "4",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "thomascollins",
        "time": "1 September, 2022",
        "context": "Nobody believes the Democrat of Justice.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "mikeg72",
        "time": "1 September, 2022",
        "context": "Trump said they were declassified, game over for Trump haters.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "salesman123",
        "time": "1 September, 2022",
        "context": "No Howard it's no turning point, and it's a shame that you even ask that non-sensical question. You may be waking the same path of shame that Mike Wallace suffered if you keep this up...",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mindblown21",
        "time": "1 September, 2022",
        "context": "All speculation by those who have always hated trump.  No visual of what was there before the raid, no info on if declassified, could have done this before now, govt working with attys in June, Trump has not been to ML for how long?  All seems like another attempt by a corrupt DOJ and federal\nagency to push their agenda.  Go figure",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "KatyVet673",
        "time": "1 September, 2022",
        "context": "I’m not a fan of Howard Kurtz. Just another Chris Wallace",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Ilovechaos",
        "time": "1 September, 2022",
        "context": "If I am a semi Facist can I semi pay my taxes?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "PurpleFlask",
        "time": "1 September, 2022",
        "context": "typical democratic hit job. never trust a democrat, never vote for one.  ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jr1967874",
        "time": "1 September, 2022",
        "context": "You're right Howard, DOJ is 100% legit...you must have relatives working there or something.\n\nYou're right Howard, DOJ treats EVERYONE the same.\n\nYou're right Howard, why ask for oversight since DOJ has already plundered through the material?  Why, because nobody except you fully trusts DOJ anymore.  I would like to see a neutral party evaluate what was siezed.\n\nI'd also like to see DOJ aggressively investigate cases equally...",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "hammer888",
        "time": "1 September, 2022",
        "context": "If these were indeed classified..the FBI just deleted classified them…by taking a pit tie of them and publishing them.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "eatbeef",
        "time": "1 September, 2022",
        "context": "Let me help Democrats out until you hold Hillary Clinton and Joe Biden accountable nobody's going to care what Trump did but you Democrats! the only thing Trump did wrong was stop the January 6th riot! that picture proves nothing nobody knows that the FBI didn't plant this stuff the FBI didn't arrange it because nobody was allowed in with the FBI no cameras no attorneys nobody knows what the FBI did but we all know they're corrupt and they are biased! this is why another election is pointless the only way this country gets settled against through a bloody civil war!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jakemeoff",
        "time": "1 September, 2022",
        "context": "Probably more secure there than our Chinese white house.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "carrwf",
        "time": "1 September, 2022",
        "context": "Kind of looks staged, doesn’t it??",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Ilovechaos",
        "time": "1 September, 2022",
        "context": "Has Howie become Fox’s designated hater?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "calloway01",
        "time": "1 September, 2022",
        "context": "dear howard kurtz....what snake oil you selling? the picture you refer too invokes a feeling.  you were right about that.  its utter disgust at how far the DOJ has fallen as to use the equivalant of visual sight gags to impress the spongebob squarepants intelligence of their groupies.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Cisgen_Bob",
        "time": "1 September, 2022",
        "context": "Looks like a bunch of cover sheets for classified documents dropped on the ground. Can't really tell if any documents are actually classified, but if the DOJ thinks they have a criminal case, they should file charges. Put up, or shut up.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Aomame",
        "time": "1 September, 2022",
        "context": "No one believes photos anymore. Even everyday mothers put filters and photoshop their own images on face book everyday. Why release an image? Why even comment on an image? The people who comment on images are the entertainment industry. Photos say more about the creator than the image now days.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "concernedaboutthis",
        "time": "1 September, 2022",
        "context": "The FBI has lost whatever credibility it had the moment it started playing partisan politics.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Smc186",
        "time": "1 September, 2022",
        "context": "Zero credibility in fbi and feds . Next ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "gregg64",
        "time": "1 September, 2022",
        "context": "Those documents must not be too classified if the FBI just throws them on the floor and takes pictures of them then shows the world so anyone can read them.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "1pingyes2pingsno",
        "time": "1 September, 2022",
        "context": "Not a turning point. Too late. The DOJ has already gone over the cliff of no return.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "chaosreigns",
        "time": "1 September, 2022",
        "context": "Maybe he hid them in Russia, inside Hunter's laptop case.\n\nThe Department of Injustice is Fuhrer Biden's Schutzstaffel, and must not be trusted.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Anti-O’Brien@1984",
        "time": "1 September, 2022",
        "context": "And given the unprecedented situation of a former president under criminal investigation, even the widely distrusted fourth estate has little choice but to report these facts – fairly but fully.\n\nWhich The Misleadia has completely failed to do.\n\nPeople - you realize cover sheets with classification markings are not classified?\n\nI had these cover sheets on my desk but no classified material.\n\nAnd yes,  That snap looks completely staged.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jwhite701",
        "time": "1 September, 2022",
        "context": "oh yes the photo they found on their camera. 6 years of lying the DOJ cant be taken on any of their words.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "GerryV343",
        "time": "1 September, 2022",
        "context": "Who is taking pictures of ‘Secret Documents’? Who gave the OK to do so?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "barnsey",
        "time": "1 September, 2022",
        "context": "TRUMP 2024 🇺🇸 ",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Susan,RN",
        "time": "1 September, 2022",
        "context": "C’mon Howie, and we should believe anything they say…. Not! Are you kidding me.?????",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Bigdeal103",
        "time": "1 September, 2022",
        "context": "Who can believe anything the FBI and DOJ have to say.  They lied thru their teeth for five years about Russia, Russia, Russia and that's not all of the lying to us that they've done.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "adhokrudnum",
        "time": "1 September, 2022",
        "context": "And they were so sure that the Steele Dossier was ligit. democrats are turning this country into a joke.",
        "good": "2",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "Savage_Centurion1263",
        "time": "1 September, 2022",
        "context": "Facts? Anyone can throw a Standard Form 704 over a pile of papers and claim that they're classified. The picture of the pile is a nice touch though to add to the illusion that this was justified.",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "swissshamoo020",
        "time": "1 September, 2022",
        "context": "The discredited FBI and DOJ will stop Trump from being president again. GOP should develop another strategy soon or you will lose the 2024 too.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "soggyshoes",
        "time": "1 September, 2022",
        "context": "Kurtz trying to make pies of mud.......he missed his calling.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "jamesr",
        "time": "1 September, 2022",
        "context": "There are no facts here just constant media speculation and what ifs. It's getting incredibly annoying listening to the opinions of all these hacks. Russia, the call, impeachment, etc.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "fourdabopper",
        "time": "1 September, 2022",
        "context": "Sounds like two teen age girls fighting over who is using whose makeup",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "honestcitizen",
        "time": "1 September, 2022",
        "context": "Garland has a political ax to grind and it is more than out in the open now!!! He'll do anything to sway public opinion and hurt Trumps chances at reelection much like the rest of his cronies in this farce of an administration,",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "tminn",
        "time": "1 September, 2022",
        "context": "\"Likely hid\"? It means they can't prove that intent. How about \n'Likely planted' , again.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "4america981",
        "time": "1 September, 2022",
        "context": "Turning point? yeah, this is when Trump's comeback tour turned into his farewell tour.",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "easynight",
        "time": "1 September, 2022",
        "context": "Likely??? Similar to the DOJ thinking that President Trump \"likely\" was in lockstep with the Russians?",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "b11infantry",
        "time": "1 September, 2022",
        "context": "Kurtz is speculating about this and trying to place the blame on Trump for the inadequacy of the DOJ, FBI and Biden Admin. He tends to stretch the truth with everything he writes! Case in point: He calls himself a journalist!",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "odyss",
        "time": "1 September, 2022",
        "context": "The president of the United States decides what is classified and what is not classified, that is established law. Just like the president decides if Ukraine gets aid or it does not, since under our constitution ONLY the president conducts foreign policy and that too is established law, but it did not prevent an impeachment by the lawless democrats.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "tmm1102779",
        "time": "1 September, 2022",
        "context": "Garland needs to hang for treason along with the rest of the gangsters.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jr1967874",
        "time": "1 September, 2022",
        "context": "The \"new\" Chris Wallace\" has arrived...please leave too.  I've noticed Kurtz leaning a little to the left recently...I'm Independent myself.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "john3perry167",
        "time": "1 September, 2022",
        "context": "\"Some of the documents found at Mar-a-Lago. (Photo: via Associated Press)\n“I do have firsthand knowledge, as you know. I have been down there, I’m down there frequently,” Habba told Sean Hannity. “I have never seen that. I have never, ever seen that. That is not the way his office looks. Anybody that knows President Trump’s office, he has guests frequently there, it’s just a joke.”\nThe documents recovered during the search included highly sensitive materials that should only be kept in a secured facility. While Trump’s team has previously claimed that anything he had at Mar-a-Lago was kept secure, Habba’s admission that these items were actually in a room where he “frequently” had guests was unlikely to help his case. \nTrump’s attorneys, advisers and insiders have come up with a number of unusual defenses for this stash of sensitive documents.\nRudy Giuliani, who served as Trump’s attorney after he lost the 2020 election, recently claimed Trump was just keeping them safe. And Trump attorney Christina Bobb said on Fox News that the documents were secure at Mar-a-Lago because “only certain members of staff can get there, and then there’s only one key” and “a limited number of people” had access to that area.\"",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "WDS333",
        "time": "1 September, 2022",
        "context": "“Likely” is not empirical evidence and would not stand up in our legal system. That word “Likely” is employed by a politically biased Justice Department to create a narrative serving their political purpose of power and control. If this was based on solid empirical evidence, they could arrest, indite and prosecute immediately and successfully. The leftist media then uses this non-empirical false narrative to create a fantasy story for its listeners, who desperately want to hear that the boogey man Donald is a criminal who has finally been caught and crucified, when he is not and has not, because there no empirical evidence. This is clearly why the descriptor “fake news” (DT's term) is accurate.",
        "good": "4",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "punion",
        "time": "1 September, 2022",
        "context": "likely???????????? just like all the others words they have used over the last 6 plus years....probably, could have, appears, will be..........they refuse to leave him alone!!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sapinva",
        "time": "1 September, 2022",
        "context": "It's just more of the same to distract the voters from inflation, an open border, crime, etc. before the election. If they can incite violence, that would be a bonus to prop up the ratings on their boring Jan 6th TV show.",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "fakenewsfl",
        "time": "1 September, 2022",
        "context": "Why would he even want them?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "justaguyindc",
        "time": "1 September, 2022",
        "context": "Perhaps they should have Trump’s trial right after Hillary’s !?!?!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "heinzel",
        "time": "1 September, 2022",
        "context": "Ignorance has no bounds. This is like the fox that says trust me I will protect your chickens. To paperclip a classification on any paper does not make them classified. Just another attempt by the  swamp rats to keep power.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "heinzel",
        "time": "1 September, 2022",
        "context": "Kurtz should move on to CNN and join the rest of the fake media ",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "sapinva",
        "time": "1 September, 2022",
        "context": "Probably blank pages under those classified covers. On one hand they can't release anything because it will harm their investigation, but they can leak information to the press literally every day.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "naturejock",
        "time": "1 September, 2022",
        "context": "I got some of those same envelopes from Amazon.  I use them to stop my kids from opening my private papers.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "beyondbelief2809",
        "time": "8 September, 2022",
        "context": "Wonder if the FBI and the DOJ are going to raid raid Trump Tower next or his new Trump Hotel that is just down the street from the Whitehouse, or did Donald sell that one?  Of course they could also raid his golf resort in Scotland and take in a few rounds of golf and and enjoy a couple of nights at the resort, too, just to relax from the stress of having to carry out the raid.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "macmurray",
        "time": "4 September, 2022",
        "context": "The FBI needs to tear down Mara-lago board by board, and brick by brick. What else is Fat Donnie hiding? And where?",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "crustaceans5",
        "time": "6 September, 2022",
        "context": "Since no witnesses, (Trump lawyers) were allowed during the search, I'd be willing to bet the FBI took the documents at the behest of the DOJ to set Trump up on a bogus charges - that I wouldn't doubt for a skinny minute!",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "chickenlittle7",
        "time": "4 September, 2022",
        "context": "this must be the troll daily double for the holiday weekend. The little posers congregate to squawk the same, refried sound bites . They all like one another's desperate dim spin, and compete for the most for the most three-syllable slurs in a sentence. None of them have any facts or logic, but are great at parroting the liberal media rhetoric.",
        "good": "1",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "DarkBrandon2024",
        "time": "6 September, 2022",
        "context": "No greater thieves in history than the GOP.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "ILOVEAMERICA893",
        "time": "8 September, 2022",
        "context": "Likely?  The DOJ lies.",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "takerepubpartybackfromtrump",
        "time": "7 September, 2022",
        "context": "Almost admits reality! but then says Biden is worse for saying insurrectionist are bad news - gee, how awful to say! Get real!!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tak32",
        "time": "8 September, 2022",
        "context": "The lying DOJ?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "freestateofflorida617",
        "time": "5 September, 2022",
        "context": "Like I believe anything the DOJ says.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "DMR66",
        "time": "7 September, 2022",
        "context": "I for one will never trust or believe what comes from the FBI, They have displayed such arrogance, bias and hatred for rule of law. The constitution states who is eligible to run for presidency, nothing in it states one must come from the swamp, they felt threatened as so many politicians being exposed for the corrupt frauds they are. So the charade continues, We The People now know how deeply rooted the swamp is. Hopefully in the future we the people will change their course, defund their budgets and eliminate half of Federal Dept’s. Over 400 is outrageous. All those who conspired falsehoods, lack of candor, biases should be fired and tried for treason, this applies to present and past politicians, employees and contractors who aided in their treasonous acts. We The People will survive transition becoming stronger than ever. Those who were complicit should look for another country to call home. If we don’t set a standard against this behavior the next revolution will be far more uglier than civil war. Federal Government was formed to protect and serve We The People, lock them up, lock all them up",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "macmurray",
        "time": "4 September, 2022",
        "context": "Trump lookin’ weak and scared, like a chihuahua with its nuts cut off.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "britaman1",
        "time": "7 September, 2022",
        "context": "The FBI and DOJ are above scrutiny.  It's not like they ever fabricated evidence, sent spies to illegally monitor, or set procedural traps for his staff.  Trump should just trust Bidens team and do whatever they say. ",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "geteducated",
        "time": "6 September, 2022",
        "context": "If justice is allowed to do their jobs the way it's done in any other case, this will end well for America, but this Trumpy judge has her head in Donald's pants.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Patsfan43",
        "time": "8 September, 2022",
        "context": "This  is the same guy who refused to talk about Hunter Biden's lap top before the last election. The  same guy who refused to talk about Senators Grassley and Johnson's story that they have deposit slips going into the Biden bank accounts from COMMUNIST GOVTs.  ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Lennox955",
        "time": "5 September, 2022",
        "context": "Why are we allowing the FBI  handle this guy with kid gloves ?   \nDoes he have an official position in the government?   No.    \nDoes his name appear on any ballot?   No\nIs he a declared candidate for any position?  No\nDoes he have an official position in the Repo party?   No\nIn fact, he is just another Joe Schmo, like you and me,   so the law applies to him,  just like you and me.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "murica572",
        "time": "8 September, 2022",
        "context": "The writer of the article is Howard Kurtz who is in 5th stage TDS. He's one of FOX's token liberals.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "geteducated",
        "time": "8 September, 2022",
        "context": "FBI, if you're listening, I hope you're able to find the 48 file folders of classified documents that are missing. ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "thinkingissoimportant",
        "time": "7 September, 2022",
        "context": "“I know that national security professionals inside government, my former colleagues, are shaking their heads at what damage might have been done. I’m sure Mar-a-Lago was being targeted by Russian intelligence and other intelligence services over the course of the last 18 or 20 months, and if they were able to get individuals into that facility, and access those rooms where those documents were and made copies of those documents, that’s what they would do.”\nFormer CIA director John Brennan ",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "johngreat1409",
        "time": "8 September, 2022",
        "context": "Interesting how they can't release any information because it would affect their investigation. Yet here they are leaking little tidbits that may or may not be factual. This is why you know you cannot trust them. And all likelihood they actually went there to get all of Trump's personal information in case he runs again they will be able to release any little tidbit that might be hurtful to his election chances. ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "glenp.robbins",
        "time": "8 September, 2022",
        "context": "Fox needs to stop being so greasy - dont publish leaks, the Post and Times are owned by Jewish elites - ALL of whom are in place to steal the Republic for Europe Israel China et al.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "loserdims🤯🤯🤯🤯🤯🤯🤯",
        "time": "6 September, 2022",
        "context": "The writer sounds like a liberal!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "hce420",
        "time": "7 September, 2022",
        "context": "What's going on here? Why is FoxNews reporting the facts? Is FoxNews planning on also reporting that at least one of the highly classified documents that Trump stole contained nuclear capabilities information? I hope not. I just want to hear about how Hillary should be locked up for attempting to work from home when she was secretary of state. And maybe more about the tan suit.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "citizenuntied",
        "time": "4 September, 2022",
        "context": "He says \"Lucky I declassified\"........We say......We're lucky that he's no longer president!!!",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "goober",
        "time": "4 September, 2022",
        "context": "Is this the tip of the iceberg? What other criminal activities is the GOP engaged in? Do others in the GOP have access to classified documents? Are they sharing them with their Russian, Chinese, and Saudi allies?",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ToldYouSo0274",
        "time": "1 September, 2022",
        "context": "I wonder what was in the 3 classified documents found in his desk drawer...with his passport. \n\nIntel so important, you may need it if you leave the country, better keep those right here with my passport.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "hopefullyclearthoughts",
        "time": "3 September, 2022",
        "context": "Are you MAGA's ready to admit Trump is a crook?",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "betterthanlife",
        "time": "1 September, 2022",
        "context": "The photo is a violation of Title 18 Sections 793 and 794, by the FBI, if the documents weren't declassified. \n\nIt does not demonstrate the President didn't declassify the documents, nor does it demonstrate an attempt to intentionally hide evidence from a criminal investigation, since he didn't know the investigation was happening.",
        "good": "4",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "mrcodsak",
        "time": "2 September, 2022",
        "context": "defund DOJ,FBI,CIA .",
        "good": "1",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "whyumad257",
        "time": "3 September, 2022",
        "context": "Bias you say\nTrump raid recovered 40 empty file folders marked top secret , fbi still looking for files the archives says trump has , but haven’t been located yet\n\nThat’s not important fox",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "whatsamatteru2022",
        "time": "2 September, 2022",
        "context": "Trump/45 had dirt on them...the DUMS, and they wanted it back bigly!",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "jmmul123",
        "time": "3 September, 2022",
        "context": "Release everything...after all, it's declassified. I always wanted the names of CIA operatives.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "HarryBaals404",
        "time": "2 September, 2022",
        "context": "America laughs at the DOJ. There is zero Justice at the FBI and DOJ. Just look at the crimes Hillary and Hunter got away with. Zero repercussions.",
        "good": "1",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "onlytruthnow642",
        "time": "4 September, 2022",
        "context": "Trump is a fraud and a clear and present danger to our democracy. Where are the rest of the docs? Hidden or are they already in Putin's hand?",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "totallynotatroll",
        "time": "1 September, 2022",
        "context": "So Trump, by detaling how the documents were stored in his attempt to defend himself, reveals that he knew that these documents were still being stored at Mar-a-Lago, despite previous sworn statements that he had already handed everything over.",
        "good": "3",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "geteducated",
        "time": "3 September, 2022",
        "context": "\"FBI, if you're listening, I hope you find the 43 missing file contents.\"",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Truth_Betold",
        "time": "3 September, 2022",
        "context": "TOP SECRET ILLUSION COLLUSION...FOX'S \"STEVEY DOUCEY\" OWES PRESIDENT TRUMP AND 80 MILLION PATRIOTS AN APOLOGY ...!!!!!!!!!!!!!!!",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "Veteransdeservebetter",
        "time": "2 September, 2022",
        "context": "Likely, boy the DOJ sure is on top of things.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "onlytruthnow642",
        "time": "3 September, 2022",
        "context": "Nobody doesn't do anything without Trump's approval. So far it looks like Trump hid docs. was reckless with docs and there are probably more hidden. For what purpose? Money? Where are the docs from the empty folders? No one can deny that Trump doesn't care about US security even when he knows foreign agents have infiltrated his club. This should disqualify Trump from ever having a gov't job much less being President. Did some of the docs go to Putin who Trump views as a genius and close friend!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "murica572",
        "time": "3 September, 2022",
        "context": "Every other month the democrats invent a crime for Trump. Every one of them is Treason and punishable by Death. Dems go for the most serious crimes to make it look good.",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "BlueSword",
        "time": "3 September, 2022",
        "context": "He was a lousy president... and an even worse civilian.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "levergunner889",
        "time": "2 September, 2022",
        "context": "Chris Wray’s FBI ARRESTS Kellye SoRelle Attorney for Oath Keepers Founder Stewart Rhodes Less than ONE WEEK after She Secretly Agreed to Testify For Rhodes    September 1, 2022 \n\nThe FBI arrested Attorney Kellye Sorelle on Thursday morning after she secretly told attorneys for Oath Keepers founder Stewart Rhodes that she would testify in defense of Stewart.\nProud Boys founder Enrique Tarrio, Bianca Gracia, the co-founder and president of Latinos for Trump Organization, attorney Kellye SoRelle and Oath Keepers founder Stewart Rhodes on January 5, 2021, in a Washington DC parking garage.\nTarrio was discussing security with Bianca Gracia whose group was holding a rally on January 6th near the US Capitol. The rally was cancelled after the violence started breaking out at the US Capitol\nThe DOJ is using this Tarrio meeting with Stewart Rhodes as evidence of a “seditious conspiracy.”\nThe government charged Kellye SoRelle with their typical nonsense including standing outside the US Capitol on Jan. 6.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "thinkingissoimportant",
        "time": "2 September, 2022",
        "context": "\"Facts are facts\".\n\ntrump doesn't have to do time for this - one of the consequences for his actions could be that he never holds office again.\n\nGiven this document debacle, he certainly isn't fit to.",
        "good": "7",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "alexzap",
        "time": "2 September, 2022",
        "context": "Howard Kurtz needs to go the way of Wallace",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Veteransdeservebetter",
        "time": "1 September, 2022",
        "context": "I don't know, did you happen to smell any Bleach?  That would be a sure tell.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "thinkingissoimportant",
        "time": "3 September, 2022",
        "context": "18 U.S.C. § 1519, “Destruction, alteration, or falsification of records in Federal investigations and bankruptcy.” \nSection 1519 provides that: Whoever knowingly alters, destroys, mutilates, conceals, covers up, falsifies, or makes a false entry in any record, document, or tangible object with the intent to impede, obstruct, or influence the investigation or proper administration of any matter within the jurisdiction of any department or agency of the United States or any case filed under title 11, or in relation to or contemplation of any such matter or case, shall be fined under this title, imprisoned not more than 20 years, or both. \n\nI bet he's hoping for a fine.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "whyumad257",
        "time": "3 September, 2022",
        "context": "Daily briefings are not labeled top secret , so why did trump have 48 file folders labeled top secret completely empty,   Trump either lost , hide or gave away secret material \n\nWhich one of those makes him a good president",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "siciliangirl",
        "time": "1 September, 2022",
        "context": "So it's ok to create an issue on these documents that every president can walk away with but not to string Biden up for breaking his oath to protect our borders! Sounds like they're instigating another insurrection.",
        "good": "4",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "kamun",
        "time": "2 September, 2022",
        "context": "Trump now opposes publishing the inventory of what the FBI seized at Mar-a-lago.\n\nLegal scholars noted that Trump's team had asked for the detailed inventory to be unsealed in its original motion.\n\"It's hard to make sense of their legal strategy, which contradicts their public statements about transparency,\" former federal Prosecutor Renato Mariotti tweeted.\n\n\"We're not going to learn what's in the more detailed inventory of items seized at Mar-a-Lago despite DOJ's offer to unseal it, because, Trump doesn't want you to know,\" former U.S. Attorney for the Northern District of Alabama Joyce White Vance tweeted on Thursday. \n\n\"DOJ called his bluff. The evidence uncovered in the search must be highly incriminating.\"",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "taxpayer024",
        "time": "2 September, 2022",
        "context": "We did not find the documents we wanted to find to prove that we were right.    We accuse everyone first then, find the evidence to prove we were right.  We are Law Enforcement-  YOU ARE GUILTY, WE SAY SO.",
        "good": "3",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "macmurray",
        "time": "1 September, 2022",
        "context": "Trump hasn’t been this scared since he was slapped by Mommy.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rgytd",
        "time": "1 September, 2022",
        "context": "They say that TRump thew the documents on the floor? No, they did it! Why they wouldn't let trump lawyers watch? why did they close all cameras? They also probably planted 3 documents in the president's office. THIS IS BANANA REPUBLIC ON STEROID!\nBIDEN, DOJ, FBI CORRUPTION!",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "rgytd",
        "time": "1 September, 2022",
        "context": "Nuclear? espionage? spy? what? NOTHING!\nBIDEN, DOJ, FBI CORRUPTION!!! that's what it is!",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "tps4999",
        "time": "1 September, 2022",
        "context": "It would be nice if someone could explain this. If Trump states that he declassified the documents in his possession while he was President (something no one disputes he could do) then how is his possession of them in any way wrong let alone criminal?",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "wolfcastle",
        "time": "1 September, 2022",
        "context": "So the DOJ \"Leaks\" a photo of redacted documents. I'm not seeing the issue here other than it's another example of why we can no longer trust the DOJ.\n\nAgain, where is the crime? He's the president, he's allowed to have secret stuff, they already met with him about that - DOJ told him to get a different lock - which he did. Done. What is he not allowed to have that he had/ has?",
        "good": "1",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "streamofconsciousness",
        "time": "1 September, 2022",
        "context": "National security documents were found in Trump’s office desk drawer (alongside his passports) at the hotel where he hosts foreign nationals. After they were served a federal subpoena, Trump and his Team lied and said all government documents were returned.\n\nLet the FBI do their risk assessment! Let them check for fingerprints…. Who knows how many sets will be found on them? Each second we delay could be putting CIA operatives and American soldiers lives at risk!\n\nOnce that is complete, we can go back to pointing fingers and playing the blame game.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jkoz226045",
        "time": "1 September, 2022",
        "context": "Howie, we know it's your fever dream that Trump be frog-marched to jail in a matching orange jumpsuit but, if the docs were so dang secret, why did they photograph them and allow them to be seen by our worst enemies? Why does the DOJ not want a special master? Could it be just another chapter in the series of fake witch hunts? All while the First Son gets away with cozying up to and peddling influence to our actual worst enemies? Whose side are you on, Howie? Hmnn?",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "bobsteets",
        "time": "1 September, 2022",
        "context": "Did the former defeated President sell information to the Taliban?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "8448682",
        "time": "1 September, 2022",
        "context": "Airtight case. US justice department mobilized to crush the threat to national security.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "naturejock",
        "time": "1 September, 2022",
        "context": "claims.   Like when the minority  secretly paints slurs on a synagogue and screams racism.. But they did it.  Claims are just claims.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "john3perry167",
        "time": "1 September, 2022",
        "context": "But on Tuesday night, the Justice Department used a routine court filing in the matter to initiate a blistering counteroffensive that disclosed new evidence that Trump and his legal team may have interfered with the inquiry.\nSign up for The Morning newsletter from the New York Times\nIn the filing, in U.S. District Court for the Southern District of Florida, department officials revealed more details about the classified materials that Trump had taken from the White House, including a remarkable photograph of several of them arrayed on the floor of Mar-a-Lago, his home and private club in Florida. In what read at times like a road map for a potential prosecution down the road, the filing also laid out evidence that Trump and his lawyers may have obstructed justice.\nIt was as if Trump, seeming not to fully grasp the potential hazards of his modest legal move, cracked open a door, allowing the Justice Department to push past him and seize the initiative.\n“The Trump team got more than they bargained for,” said Preet Bharara, a former U.S. attorney in Manhattan and a longtime critic of Trump. “In response to a thin and tardy special master motion, DOJ was given the opportunity to be expansive.”",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "brokegstring",
        "time": "1 September, 2022",
        "context": "Lol, the turning point was Trumq's photoshopped inauguration image and the immediate lawyering up. The continual \"beached whale\" flopping certainly didn't help.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "1oldngray",
        "time": "1 September, 2022",
        "context": "DOJ back peddles better than Biden can ride a bicycle.",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "DiscreetPoster",
        "time": "1 September, 2022",
        "context": "\"likely,\" possible, maybe, could be, we think, might have, not sure, LOL",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "8448682",
        "time": "1 September, 2022",
        "context": "I love reading about Trump fail on fox News.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bluesun",
        "time": "1 September, 2022",
        "context": "Got to love those \"he probably did it\" arguments...",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "austen",
        "time": "1 September, 2022",
        "context": "Trump's lawyers signed an affidavit that they had given the FBI all the classified documents.   They also didn't allow the FBI into the storage room to search,  and it was the Trump lawyers who gave the FBI the boxes.    We now know that the FBI was tipped off that there was more boxes,  that boxes were kept hidden from them in June.   They got the search warrant and found hundreds of classified documents including many labeled Top Secret including in Trump's own desk drawer.  'That is obstruction of justice.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rgytd",
        "time": "1 September, 2022",
        "context": "BIDEN, DOJ, FBI CORRUPTION!!! THIS IS CORRUPTION THAT STICKS TO THE HIGH HAVENS!\nThere nothing said about Trump refuse to give back any thing. He said take anything you need in JUNE! Everything they needed was in the storage they didn't take it but said to put a lock which he did. THen they come and went into Melania dresser for what? They could have had everything in JUNE? And if they didn't they could have write another subpoena to ask for what was missing. THIS IS CORRUPTION THAT STICKS TO THE HIGH HAVENS!\nMAGA 2022, 2024. BBB: BYE BYE BIDEN! LETS GO  BRANDON!",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "jeannniemac",
        "time": "1 September, 2022",
        "context": "Because the FBI raided Trump's residence when they knew he would be away, and refused to allow Trump's lawyers or any other witnesses to observe the extensive search, it is highly likely the FBI stole and or planted their own \"evidence\" against Trump. Did the FBI steal Trump's RICO records and evidence about Obama and Hillary Clinton?",
        "good": "1",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "cheetoswithyourwhine",
        "time": "1 September, 2022",
        "context": "I like Presidents that don't STEAL top secret documents or invoke the 5th...  Just sayin.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "onestudent",
        "time": "1 September, 2022",
        "context": "Trump once again in legal trouble. Like any criminal, his problems are only those he causes himself.",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "southernconservativepride",
        "time": "1 September, 2022",
        "context": "As an independent conservative I see both parties need some serious house cleaning to do.  Far left and Far right need to go and Hilary, Hunter and Trump all need to answer to the law of the land they are not above it.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "22889964",
        "time": "1 September, 2022",
        "context": "These clowns can claim anything.  Apparently this farcical raid is coming apart at the scene because the DOJ/FBI are making all type of excuses, suppositions and leaks.",
        "good": "2",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "antonym557",
        "time": "1 September, 2022",
        "context": "Fox is a bit slow approach their turning point on Trump.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "elbowsmcfadden",
        "time": "1 September, 2022",
        "context": "Am quite sure this could be resolved more quickly if we just gave Donald his Twitter account back.",
        "good": "0",
        "bad": "0",
        "replies": []
    }
]