[
    {
        "user_name": "grumpers",
        "time": "8 hours ago",
        "context": "stay tuned for his book...",
        "good": "1",
        "bad": "1",
        "replies": [
            {
                "user_name": "robert_ore",
                "time": "4 hours ago",
                "context": "Hope so.\n\nHis Navy career is over and civilian life probably won’t be a walk in the park now that his reputation is ruined.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "24Mossberg406",
        "time": "8 hours ago",
        "context": "Arson, one of the toughest crimes to solve.  That’s why, if you do catch an arsonist, the death penalty is appropriate.  Remember, in most instances, arsonists that are caught set fires previously, just didn’t get caught.",
        "good": "1",
        "bad": "4",
        "replies": [
            {
                "user_name": "Unlikey",
                "time": "7 hours ago",
                "context": "The first step is determining what caused the fire.  It can be accidental or intentional, but many times a firm call is not practical, so it's listed as undetermined.  Proving the who set the fire intentionally is the next step.  Both steps are hampered by the fact that 110PSI water and other firefighting efforts go a long way to wiping evidence from the point of origin.  Besides, if the ship was a fire waiting to happen, a cigarette or matchbook would be all you need and that's not a lot of evidence to work with.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "lcfstation3",
        "time": "8 hours ago",
        "context": "The bigger story is how the Navy, under Biden, chose to scrap the entire ship after the fire rather than repair it. I remember reading how the Navy salvaged many ships at Pearl Harbor after the Japanese attack and also many others during WW2, including aircraft carriers, that were badly damaged and then put back into service. It leaves the US one down in that category of carrier which will be badly needed in event of a conflict.",
        "good": "66",
        "bad": "2",
        "replies": [
            {
                "user_name": "richardkittyhawk",
                "time": "8 hours ago",
                "context": "Trump sought to increase the number of Navy ships.  Biden plans to cut even some new ships from the logs and send them to the Fleet Reserve and finally discarded completely.  Makes absolutely no sense to reduce the Navy when China is quickly building up their own navy for a future war with the US.",
                "good": "48",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "cegg",
                        "time": "5 hours ago",
                        "context": "If it makes no sense you know Biden is behind it.",
                        "good": "2",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "chelseas4086",
                                "time": "4 hours ago",
                                "context": "Take Jill Biden for instance...",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "user_name": "Rectifier150w",
                        "time": "5 hours ago",
                        "context": "Actuall it does, the less hardware we have makes it easier for our enemies to attack us.",
                        "good": "2",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "chelseas4086",
                        "time": "4 hours ago",
                        "context": "But you under estimate BIden, he has certain obligations you know in order to keep that $1.5B from CCP at Rosemont-Seneca.  Hardly Senile.",
                        "good": "1",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "CMDRViperMetcalf,USN",
                                "time": "4 hours ago",
                                "context": "'The Big Guy'.",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "nraforlife",
                "time": "7 hours ago",
                "context": "I agree went to Pearl Harbor this year and heard the story as ships were raised floated then dry docked for complete repair working 24/7",
                "good": "14",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "saetexas064",
                "time": "7 hours ago",
                "context": "Biden's idea is to have the replacement for this carrier named after him...",
                "good": "3",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "botany-bay",
                        "time": "6 hours ago",
                        "context": "Biden’s name must have been painted on the burned out one.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "louStralzers",
                        "time": "6 hours ago",
                        "context": "USS Come On Man?",
                        "good": "3",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "manwhoneverwas",
                        "time": "4 hours ago",
                        "context": "Whenever the USS Biden goes to sea it sputters, sails in circles, forgets where it was headed and breaks down.  Then we find out it will cost trillions to fix.  And it's all Trump's fault.",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "gunluvingirl",
                "time": "7 hours ago",
                "context": "This fire took place 7 months before Biden was in office. Why didn’t the previous President do something about not salvaging the ship?",
                "good": "0",
                "bad": "10",
                "replies": [
                    {
                        "user_name": "taig327",
                        "time": "6 hours ago",
                        "context": "He was busy defending against the Russia hoax and 2 phony impeachments.",
                        "good": "9",
                        "bad": "1",
                        "replies": [
                            {
                                "user_name": "gunluvingirl",
                                "time": "6 hours ago",
                                "context": "The hoax and the first impeachment happened before this fire. He was on the campaign trail during this time.",
                                "good": "1",
                                "bad": "4",
                                "replies": [
                                    {
                                        "user_name": "NavyGunner25mm",
                                        "time": "6 hours ago",
                                        "context": "Fire effects the strength of metal, as well as miles of wiring, plumbing and sensitive equipment. The way ships are built, it's easier to start from scratch.",
                                        "good": "2",
                                        "bad": "0",
                                        "replies": []
                                    },
                                    {
                                        "user_name": "anotherfalsepremise062",
                                        "time": "5 hours ago",
                                        "context": "You need to stop.",
                                        "good": "1",
                                        "bad": "0",
                                        "replies": []
                                    },
                                    {
                                        "user_name": "taig327",
                                        "time": "39 minutes ago",
                                        "context": "Glad to see you agree it was a hoax.\n\nThe hoax and the 2 impeachments took up huge amounts of time and effort during President Trumps 4 years in office.  Time and effort that could have been spent else where.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "user_name": "wags1959",
                        "time": "6 hours ago",
                        "context": "Because the former President that you try to blame for everything even though he has been out of office for 2 years was still awaiting the evaluation on it's condition.\nOf course he never got to make that decision on the carrier, because you and your other Low Life RATS rigged an election. \nAnd don't try and tell me that it was a legit election.",
                        "good": "8",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "texashillcountry849",
                                "time": "6 hours ago",
                                "context": "And the results of that evaluation determined that the ship should be scrapped.",
                                "good": "0",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "wags1959",
                                        "time": "36 minutes ago",
                                        "context": "Have you seen that evaluation, or do expect half the population to take the word of a lying DemocRAT President.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "user_name": "CongressNeedsTermLimits",
                        "time": "6 hours ago",
                        "context": "That was an honest question. I won’t speculate. Idk the answer but I do know Congress hates bad news and GOs hate to give it.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "texashillcountry849",
                "time": "6 hours ago",
                "context": "Not hard to understand.  Repairs were estimated to take 7 years and cost $3.2B.  It was slated to be replaced with an LHA-9 at a cost of $3.9B.  $650M had already been appropriated to the purchase of that ship, but the funds were re-allocated to the wall.",
                "good": "1",
                "bad": "5",
                "replies": []
            },
            {
                "user_name": "harrysfh",
                "time": "6 hours ago",
                "context": "Thank you for acknowledging!! Under Biden.",
                "good": "1",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "mikecarter",
                "time": "5 hours ago",
                "context": "The navy determined that repair costs would be close to the price of a new ship but would take longer to finish (removal of literally EVERYTHING, then rebuild).",
                "good": "2",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "RM1_USN_Ret018",
                        "time": "3 hours ago",
                        "context": "Plus the structural integrity of the steel is in question due to the heat and length of time the ship was on fire.",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "vetfl",
                "time": "5 hours ago",
                "context": "Probably due to repairing costs almost twice as much as a new one.",
                "good": "1",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "pandamic20",
                        "time": "5 hours ago",
                        "context": "Like car parts. If you built a car from retail parts, it'd cost twice as much as a new car.",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "pandamic20",
                "time": "5 hours ago",
                "context": "The Navy would salvage anything that floated during WWII. They made ocean liners into supply ships, they converted anything that floated to support the war effort. That fire raged for days at extreme temps, the steel was warped and damaged beyond salvage. It would have cost as much or more to repair.",
                "good": "4",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "RM1_USN_Ret018",
                        "time": "3 hours ago",
                        "context": "Plus war time needs and availability of \"new steel\" during that time was at a premium.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "chelseas4086",
                "time": "4 hours ago",
                "context": "Biden scrapped two ships because there was barnacles on them.",
                "good": "1",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "nemoosewalk",
                "time": "4 hours ago",
                "context": "Taiwan comes to mind… 😎👍👍👍🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸✔️",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "taxation.is.theft",
                "time": "4 hours ago",
                "context": "He lives in your head rent free.",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "FreePatriot1976",
                "time": "3 hours ago",
                "context": "This class of ship has minimum modern strategic value. Unless we plan to have a beach head assault, which is very unlikely in today's warfare, defense dollars should go elsewhere.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "EM1USN'84-'95",
                        "time": "2 hours ago",
                        "context": "I disagree.  I understand your point that an amphibious assault may not be the ideal scenario in a lot of situations.  But after the toe-hold on the territory has been established, we would want to get the rest of the foot in there.  We could wait until the airborne guys build an airport with their little shovels, or we could have a ship like this that can provide air support, as well as food, ammunition, etc.  And yes, even  bulldozers and other construction equipment and personnel, including re-enforcements.\nThe Navy is pretty versatile because that is necessary.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "remipup",
        "time": "8 hours ago",
        "context": "Let's hope the captain got the full brunt of the blame. A single sailor cannot destroy a ship with a little cardboard.",
        "good": "17",
        "bad": "1",
        "replies": [
            {
                "user_name": "boxman88",
                "time": "8 hours ago",
                "context": "He did. read about it.",
                "good": "2",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "Navybiker185",
                        "time": "5 hours ago",
                        "context": "No, he didn’t.  ",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "don10101",
                "time": "8 hours ago",
                "context": "Mmmm......That's like saying a single camper can not cause a forest fire.\nNow did whom is in charge of the work site fail to keep things tidy and contribute to the possibility of a fire? yes.",
                "good": "4",
                "bad": "2",
                "replies": [
                    {
                        "user_name": "itsabouttheconstitution",
                        "time": "7 hours ago",
                        "context": "Lack of training is the reason.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "don10101",
                                "time": "7 hours ago",
                                "context": "Agreed, the same thing can be said about campers.",
                                "good": "0",
                                "bad": "1",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "user_name": "thegreatunwashed164",
                        "time": "7 hours ago",
                        "context": "A single hunter (lost) started San Diego's Cedar Fire in 2003.  His name is Sergio Martinez of West Covina, CA.  Some billions of dollars of damage was done and 15 lives were lost.",
                        "good": "0",
                        "bad": "1",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "ForwardObserver1AC",
        "time": "8 hours ago",
        "context": "Real sailors with real issues. Not Public Affairs Pogues like Admiral Kirby and Lt. Hunter Hiden.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "nickdoszk993",
        "time": "8 hours ago",
        "context": "Rush to judgement!",
        "good": "2",
        "bad": "2",
        "replies": [
            {
                "user_name": "NewarkPI",
                "time": "7 hours ago",
                "context": "Two years?",
                "good": "1",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "goa✟lips",
        "time": "8 hours ago",
        "context": "Scapegoats everywhere approve.",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "claytonbixby",
        "time": "8 hours ago",
        "context": "Deck duty- sounds like the worst duty in the Navy.",
        "good": "5",
        "bad": "0",
        "replies": [
            {
                "user_name": "billthegunowner🖕",
                "time": "8 hours ago",
                "context": "If deck duty includes cleaning toilets, I totally agree!",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "everythingisfine562",
                "time": "8 hours ago",
                "context": "Try boiler room in the Pacific, in the tropics. ",
                "good": "6",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "geniusdetector107",
                        "time": "5 hours ago",
                        "context": "Under kamikaze attack.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "Wediditjoe",
                "time": "7 hours ago",
                "context": "Not everyone always get what they want immediately. Keep your head dow and keep working hard things usually work out.",
                "good": "1",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "claytonbixby",
                        "time": "7 hours ago",
                        "context": "Unless your CO has it in for you...",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "gc2254",
                        "time": "7 hours ago",
                        "context": "You can’t always get what you want, but If you try sometimes, you get what you need!-Rolling Stones.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "o57",
        "time": "8 hours ago",
        "context": "they were looking for a fall guy",
        "good": "21",
        "bad": "2",
        "replies": [
            {
                "user_name": "NewarkPI",
                "time": "7 hours ago",
                "context": "And they found a guy who lit the fire",
                "good": "2",
                "bad": "3",
                "replies": [
                    {
                        "user_name": "bdub63",
                        "time": "5 hours ago",
                        "context": "Prove it.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "mike0121",
                "time": "7 hours ago",
                "context": "Yeah, go to lowest guy they can find, Not the top that should  be hung, that's where the problem is,",
                "good": "2",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "Gunfighter",
        "time": "8 hours ago",
        "context": "Basically, the prosecution didn't have their ducks in a row, and the judge had no choice but to rule for an acquittal.",
        "good": "39",
        "bad": "0",
        "replies": [
            {
                "user_name": "RedTsunami645",
                "time": "7 hours ago",
                "context": "Deck duty for the prosecutors!",
                "good": "8",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "robert_ore",
                "time": "5 hours ago",
                "context": "The nature of the prosecutors ducks mattered not.\n\nDucks or no ducks, the guy didn’t do it.",
                "good": "1",
                "bad": "1",
                "replies": []
            },
            {
                "user_name": "pandamic20",
                "time": "5 hours ago",
                "context": "Civilian lawyers usually eat military lawyers for lunch. I worked with a guy in the Navy, they had him dead to rights for theft. They found Navy property at his home and he was acquitted at trial, allowed to retire with his pension. In the military, it's backwards from civilian court. You're assumed guilty until you prove your innocence.",
                "good": "2",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "MichiganContributor",
        "time": "7 hours ago",
        "context": "Ruin a mans life because in the military someone has to be burned and blamed. I was in the Navy and I never saw a cardboard fire that could melt an aluminum ship. Huge lithium ion batteries burn hot, just watch the car fires, yeah, makes sense. I was so mad when they blamed this sailor, and none of us like chipping paint in the ship yard, so I guess every sailor that ever had to could be at fault too. NOT",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "billthegunowner🖕",
        "time": "8 hours ago",
        "context": "Circumstances make it sound like he was guilty, but the prosecution failed to produce factual evidence that would go further than circumstantial evidence.",
        "good": "27",
        "bad": "0",
        "replies": [
            {
                "user_name": "1pingyes2pingsno",
                "time": "6 hours ago",
                "context": "But that normally doesn't matter to Libs. If Adam Schiff was the prosecutor, the guy would have been found guilty.",
                "good": "2",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "🧻🚽💩🪠",
        "time": "7 hours ago",
        "context": "The only guys with an attitude problem that I knew in the service was because they wanted out, not deeper in the shif. But then, we were doing a lot of the stuff that Mays seemed to be pining for.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "lyindems050",
        "time": "7 hours ago",
        "context": "So he did it, but got off scot free. \nHis middle name must be Hunter.\n#Arsonist",
        "good": "0",
        "bad": "4",
        "replies": [
            {
                "user_name": "jw3413",
                "time": "7 hours ago",
                "context": "one thing you learned in the military you don't make accusations without proof, so where's your proof????? ",
                "good": "3",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "nannmurphy",
        "time": "7 hours ago",
        "context": "Dear Mr Casiano:. The phrase is \"sowing,\" as in planting seeds, not \"sewing\" as in stitching together.\n\nIf the issue one of some \"auto-edit\" program insistently shifting letters to a more \"common\" word, it still needs correcting.\n\nI mention this as the editors have let the same error pass in three or four other articles fairly recently, so clearly they don't recognize the mistake, or else they don't care that it may make you look a bit unprofessional and foolish.",
        "good": "3",
        "bad": "0",
        "replies": [
            {
                "user_name": "loyalskeptic",
                "time": "7 hours ago",
                "context": "What is needed is a GRAMMAR checker or fully literate proof reader. The same thing, wrong word but spelled correctly, plagues a great many e-books.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "maga-marine456",
        "time": "7 hours ago",
        "context": "What's going on? People not doing their duty, then not accepting responsibility, trying to blame others! It's sounds like the Brandon administration!",
        "good": "3",
        "bad": "0",
        "replies": [
            {
                "user_name": "chuckt746",
                "time": "4 hours ago",
                "context": "Yeah, I bet they're mad they couldn't blame Trump for the fire.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "RipVanBrandon",
        "time": "7 hours ago",
        "context": "Maybe Ukraine can give us a loan for the repairs.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "gilchrist55456",
        "time": "8 hours ago",
        "context": "Smoke and mirrors so the real perps had time to get their ducks in a row. They should be ashamed but they are not, they're just glad they slipped away under the cover.",
        "good": "2",
        "bad": "0",
        "replies": [
            {
                "user_name": "NewarkPI",
                "time": "7 hours ago",
                "context": "Maybe he did it",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "furrmom",
        "time": "7 hours ago",
        "context": "There were too many mistakes made on this ship from the top on down.\nThey were just scapegoating this young sailor.\nI saw it happen too many times in the military.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "doclr11",
        "time": "7 hours ago",
        "context": "The judge took into account that the 1.2 billion dollar ship, allowing for Bidenflation, was only worth 12 cents.",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Captain74",
        "time": "7 hours ago",
        "context": "There was supposed to be a crew aboard that ship trained to fight fires for just this type of circumstance. Too busy getting \"Pronoun Training\" I guess. Several senior officer's heads need to roll.",
        "good": "64",
        "bad": "1",
        "replies": [
            {
                "user_name": "yarnavy15",
                "time": "6 hours ago",
                "context": "Exactly.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "Vernicus",
        "time": "7 hours ago",
        "context": "Another reason to never join the military, they like to eat their own.....",
        "good": "2",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "👊knucklesandwich👊",
        "time": "7 hours ago",
        "context": "Having stood fire watch myself and acting Fire marshal while in dry dock and even pier side I have seen disasters waiting to happen myself. Most of these contractors don’t have the same level of attention to detail as we sailors had. Guys welding next to a pool of fuel oil etc…. Crazy stuff happens and it wasn’t the first or last time this will happen.",
        "good": "56",
        "bad": "0",
        "replies": [
            {
                "user_name": "georgeinsandiego",
                "time": "7 hours ago",
                "context": "There's also the fact that a ship is uniquely vulnerable during a yard period; due to the miles of ventilation, hoses, lines, and leads running down just about every trunk and passageway; and due to the scaffolding that often makes it difficult to move about at all, much less with a self contained breathing apparatus on your back.",
                "good": "20",
                "bad": "2",
                "replies": []
            },
            {
                "user_name": "Unlikey",
                "time": "7 hours ago",
                "context": "And there are plenty of examples of construction sites burning even without all the hazards here.  Plumber heating up one end of a pipe not realizing that the other end through the wall is covered with paper or other flammables.  I wondered what type of hard evidence they had... apparently none.",
                "good": "14",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "jim0987654321",
                        "time": "4 hours ago",
                        "context": "construction sites are nothing like a war ship",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "Sharp1234",
                "time": "6 hours ago",
                "context": "Fuel oil is not flammable",
                "good": "0",
                "bad": "3",
                "replies": [
                    {
                        "user_name": "revright",
                        "time": "5 hours ago",
                        "context": "Ever hear of the USS Forestall and a clown named John McCain?",
                        "good": "5",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "EM1USN'84-'95",
                        "time": "2 hours ago",
                        "context": "The vapors are.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "DaWall",
        "time": "7 hours ago",
        "context": "Guess the FBI investigated this case with the same intensity they investigate BLM/ANTIFA burning down federal buildings…",
        "good": "3",
        "bad": "0",
        "replies": [
            {
                "user_name": "👊knucklesandwich👊",
                "time": "7 hours ago",
                "context": "Probably ncis with Dinozzo and Torres.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "kohl1957",
        "time": "8 hours ago",
        "context": "Sad.  This U.S. Navy cannot do anything right it seems.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "riverrat70",
                "time": "7 hours ago",
                "context": "Were you in the Navy?",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "CongressNeedsTermLimits",
                "time": "6 hours ago",
                "context": "I disagree. Navy air support saved my platoon and a Corpsman kept 1 of my Soldiers and a fellow Marine alive. When Chinas fleet hits, you’ll be happy to see the USN. ",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "kcroyals30",
        "time": "7 hours ago",
        "context": "Just stop American imperialism. This was a start Putin will finish the task.",
        "good": "0",
        "bad": "7",
        "replies": [
            {
                "user_name": "okie2021",
                "time": "7 hours ago",
                "context": "F/O",
                "good": "2",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "CongressNeedsTermLimits",
                "time": "6 hours ago",
                "context": "LOL Comic relief! Inane, obtuse, and unexpected!",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "itsabouttheconstitution",
        "time": "8 hours ago",
        "context": "I haven't heard about Brass prosecuted for this disaster. Admirals and Captains need to be prosecuted for their failures.",
        "good": "45",
        "bad": "0",
        "replies": [
            {
                "user_name": "kohl1957",
                "time": "7 hours ago",
                "context": "Amen.  The real problem with the USN is the top heaviness of it... they need to weed out the \"Admirals\" and the \"Captains\".  Too much brass, not enough bottle.",
                "good": "12",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "don10101",
                "time": "7 hours ago",
                "context": "You can bet someone is not getting promoted.",
                "good": "2",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "itsabouttheconstitution",
                        "time": "7 hours ago",
                        "context": "Not enough.",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "wallaB",
                "time": "6 hours ago",
                "context": "They were, by loss of commands, demotions etc.! ",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "satchmolives",
                "time": "6 hours ago",
                "context": "This was the fire where the personnel did a poor job of suppression. They didn’t know how to use the air tanks. Wrong people doing the job. Inability to operate equipment.\n\nToo busy watching pronoun videos to train properly.",
                "good": "17",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "Navybiker185",
                "time": "5 hours ago",
                "context": "Different spanks for different ranks",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "georgeinsandiego",
        "time": "7 hours ago",
        "context": "The only evidence that could have been offered was the testimony of an eyewitness who could not be certain of what they thought that they saw. At the time of the fire everyone aboard a Navy ship was required to wear a face mask as part of the response to Covid-19.",
        "good": "15",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "ButchS",
        "time": "7 hours ago",
        "context": "Well the fire didn’t start itself. Someone is responsible ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "savebb-35",
        "time": "8 hours ago",
        "context": "You enlisted in the Navy and did not expect painting, polishing, scraping and cleaning?\nYou should have stayed in school, get your degree and go to OTS.\nWhat a squid.",
        "good": "3",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "billw328",
        "time": "7 hours ago",
        "context": "The fact that he failed to be selected or bombed out of the training falls on him. There are standards to be selected, if he did not meet them it's not the fault of the navy. The Navy has many schools, there must have been something that he would have been interested in. He was acquitted, end of story.",
        "good": "2",
        "bad": "2",
        "replies": [
            {
                "user_name": "boxman88",
                "time": "7 hours ago",
                "context": "Since I was not Navy I don't know their training but usually you quit. They might help you decide, bu you quit the process. That was how it was in mine. Unless you are hurt.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "conserveone1",
        "time": "7 hours ago",
        "context": "Yardbirds started a fire when I was aboard the Lexington in Boston years ago!  Anything can happen.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Bidenisaloser1",
        "time": "7 hours ago",
        "context": "He’s white and got off so you know for a fact he didn’t do it. ",
        "good": "1",
        "bad": "4",
        "replies": [
            {
                "user_name": "DavidPlatt",
                "time": "7 hours ago",
                "context": "and there you go!",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "richardkittyhawk",
        "time": "8 hours ago",
        "context": "This was a controversial case from the start.  The prosecution and the evidence was not convincing to the judge.",
        "good": "56",
        "bad": "0",
        "replies": [
            {
                "user_name": "tompost",
                "time": "6 hours ago",
                "context": "A sailor on a submarine accidentally sank a submarine because he slept with the window open",
                "good": "5",
                "bad": "3",
                "replies": []
            }
        ]
    },
    {
        "user_name": "Bidenisaloser1",
        "time": "7 hours ago",
        "context": "What race is Kenji?",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "steveduffie",
        "time": "7 hours ago",
        "context": "My brother was a Fire Fighter on the USS Forestal when it caught fire decades ago. He still lives with that disaster. ",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "ghost.of.yet.to.come",
                "time": "7 hours ago",
                "context": "Tell him thank you for all of us.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "Sevano689",
        "time": "7 hours ago",
        "context": "If he got away with it, he's luckier than a power ball winner.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "e_mass_reader",
        "time": "7 hours ago",
        "context": "Good Lord.  It's \"SOWED DOUBT\" as in sowed the seeds of doubt.",
        "good": "2",
        "bad": "0",
        "replies": [
            {
                "user_name": "IllinoisRefugee329",
                "time": "7 hours ago",
                "context": "Nice catch!",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "tokth",
                        "time": "7 hours ago",
                        "context": "nah.. they sowed it in directly. that way they didn't need to wait for it to grow",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "e_mass_reader",
                                "time": "7 hours ago",
                                "context": "The defense lawyers got out their sewing kits and sewed doubt into the fabric of the government's case.",
                                "good": "2",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "USMC-0321",
        "time": "7 hours ago",
        "context": "Fire prevention was always first on any naval ship",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "USAFirst814",
        "time": "7 hours ago",
        "context": "The motto of the story : Become a Navy Seal or set an Aircraft Carrier on fire......",
        "good": "0",
        "bad": "1",
        "replies": [
            {
                "user_name": "retired.army",
                "time": "7 hours ago",
                "context": "It was a littoral ship.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "dontworryitwillgoaway",
        "time": "7 hours ago",
        "context": "\"Meanwhile, defense attorney's sewed doubt in the creditability...\"\nYou mean sowed doubt? We're not sewing a dress here. \nAttorney's? You mean \"attorneys\" plural... (more than one and without the apostrophe).\nCreditability? No way. Try \"credible\" instead... (believability of statements by a witness).\nAnother danger of relying on spellcheck instead of English 101 class.",
        "good": "4",
        "bad": "0",
        "replies": [
            {
                "user_name": "manolete2",
                "time": "7 hours ago",
                "context": "I am with you...these Neanderthals didn't pay attention in elementary school English class.",
                "good": "3",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "mercyfulfates",
        "time": "7 hours ago",
        "context": "uss bonfire",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ghost.of.yet.to.come",
        "time": "7 hours ago",
        "context": "Still have to figure it out.  Can't have an unknown weakness inside the ship.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Q2a",
        "time": "7 hours ago",
        "context": "Well I am surprised. Whether he did it or not, I expected him to be the scapegoat. The reason I say that, is because when I was in the service, I witnessed an innocent man sent to Leavenworth, because he stood against a lie, instead of taking an Article 15.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "ncjoe672",
        "time": "7 hours ago",
        "context": "If you want to find who was really responsible - look to whomever was pointing the finger.",
        "good": "1",
        "bad": "1",
        "replies": [
            {
                "user_name": "blindman123",
                "time": "7 hours ago",
                "context": "I'll bet you never call the cops.",
                "good": "0",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "ncjoe672",
                        "time": "7 hours ago",
                        "context": "Don't have to, I live in a neighborhood where people are normal......and exercise their 2nd Amendment rights.",
                        "good": "0",
                        "bad": "1",
                        "replies": [
                            {
                                "user_name": "blindman123",
                                "time": "7 hours ago",
                                "context": "Sounds like I won the bet!\nI'm glad you live in a decent neighborhood.",
                                "good": "0",
                                "bad": "2",
                                "replies": [
                                    {
                                        "user_name": "ncjoe672",
                                        "time": "7 hours ago",
                                        "context": "In life, you get what you work(ed) for.....but you already knew that!",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "grunt651",
        "time": "7 hours ago",
        "context": "This is the best Navy can do?   The only person  they wanta blame but can't bring enough evidence to convict?   Burns 4 days dockside but nobody is responsible?  Who got the participation trophy?",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "motofuji",
        "time": "7 hours ago",
        "context": "Maybe next time it won't take them 4 days to put a fire out.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "IllegitimateJoe891",
        "time": "7 hours ago",
        "context": "Glad that was cleared up for him.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "RobertHinman830",
        "time": "7 hours ago",
        "context": "Woke Navy woke up for a short time and investigated before trashing a sailor.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rcb862",
        "time": "7 hours ago",
        "context": "Your honor how can we make a big deal over a billion dollar ship when democrats throw trillions around on pure garbage to the point of driving a thriving country into recession.   A billion isn’t even a tip to the bar tender with these people.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sevant57",
        "time": "7 hours ago",
        "context": "I guess giving out participation trophies for everything wasnt such a good idea??? Who would have thought you couldnt just join the Navy and become a SEAL???....LOL.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "americafirststeve",
        "time": "7 hours ago",
        "context": "Pretty sad that the fire was able to destroy a Navy ship. Where were the sprinklers, etc?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "conservativeaz",
        "time": "7 hours ago",
        "context": "Really glad he didn't make the SEALS.  That could have been catastrophic had he made it.  \n\nWould he actually have the back of others on his team?  \n\nSounds like it was all about him.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "ghost.of.yet.to.come",
        "time": "7 hours ago",
        "context": "Yahoo News: \"Another sailor, Carissa Tubman, who was assigned to escorting Mays to the brig on Aug. 20, 2020, testified that she heard a stunned Mays mumble to himself: “I'm guilty, I guess. I did it.\" Then she said he mumbled some more before she heard him say: “It had to be done.\" \"",
        "good": "0",
        "bad": "1",
        "replies": [
            {
                "user_name": "texashillcountry849",
                "time": "6 hours ago",
                "context": "And Andrew Thoresen, an electrical engineer who examined the ship,  said he found highly combustible lithium ion batteries with their caps blown off and a copper cable with a melted end in the engine of a forklift, indicating it may have sparked the fire.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "ghost.of.yet.to.come",
                        "time": "5 hours ago",
                        "context": "Might be right, or the heat from the fire caused the batteries to explode.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "texashillcountry849",
                                "time": "4 hours ago",
                                "context": "Could be. But if you are going to charge someone with arson, you need real evidence.",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "gerardo001",
        "time": "7 hours ago",
        "context": "NAVY recruiters constantly lie to meet their quotas, and once they enlist someone, officers also make life unbearable with promises to improve if you add more years to your contract. If this was a business, they could be sued for false claims, extortion, and harassment. No wonder informed youngsters don't want to enroll anymore.",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "omeomi",
        "time": "7 hours ago",
        "context": "The should have to remunerate him  - they ruined his reputation and his career....and there was never evidence - only a story from someone who changed that story frequently.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "RedSkyAtNight",
        "time": "7 hours ago",
        "context": "Lots of people making comments show they've never been on a Navy ship that's in the yard for maintenance.",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "blindman123",
                "time": "7 hours ago",
                "context": "Enlighten us.",
                "good": "1",
                "bad": "2",
                "replies": []
            }
        ]
    },
    {
        "user_name": "clas70607",
        "time": "7 hours ago",
        "context": "I totally agree with the conclusion!  I did 24 years in the Navy, if you dont do your due diligence you will never find out the truth.  Obviously, they were quick to blame with out trying to find out the real cause of the fire.  ",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "bellview17",
        "time": "7 hours ago",
        "context": "He'll be getting some serious back pay",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "blindman123",
        "time": "7 hours ago",
        "context": "Seems strange that some cardboard catching fire would burn that ship to the ground.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "papadoc",
        "time": "7 hours ago",
        "context": "The Navy investigated itself.  The coverup was successful.  Remember the Indianapolis!",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "dreamofsiargao",
        "time": "7 hours ago",
        "context": "They made the mistake of blaming the white guy.",
        "good": "0",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "bluthumb484",
        "time": "7 hours ago",
        "context": "Whose wife is he?",
        "good": "0",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "txbart",
        "time": "7 hours ago",
        "context": "Sloppy, sloppy, sloppy prosecution. The UCMJ is a stacked deck, but you have to have a case and properly present it WITH evidence.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "antiliberalhero",
        "time": "7 hours ago",
        "context": "How a fire suppression system on a 1.2 billion dollars ship failed? ",
        "good": "2",
        "bad": "0",
        "replies": [
            {
                "user_name": "NavyGunner25mm",
                "time": "5 hours ago",
                "context": "They're often out of service during repairs.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "e_mass_reader",
        "time": "7 hours ago",
        "context": "This is a huge tragedy for America's Naval preparedness.  It makes me furious.  And all those billions going to the Ukraine, not into building combat ships to wipe China and Russia from the seas.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "hmelton",
        "time": "7 hours ago",
        "context": "...when it comes to military and civilian personnel the Navy 'always' shoots first and asks questions later.  ...sometimes they simply \"can't handle the truth\".",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "JD-41",
        "time": "7 hours ago",
        "context": "\"Naval sailor\".....are there types of sailors??",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "blindman123",
                "time": "7 hours ago",
                "context": "Maybe Merchant Marine?",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "CongressNeedsTermLimits",
                "time": "6 hours ago",
                "context": "Maybe. This one’s nickname is “Sparky”.",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "texashillcountry849",
                "time": "6 hours ago",
                "context": "Merchant Marines.  Coast Guard.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "patriotforever937",
        "time": "7 hours ago",
        "context": "He did it and the Navy will come to regret it.",
        "good": "0",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "wombroom",
        "time": "7 hours ago",
        "context": "I think he is guilty... he was used to getting a participation trophy and thought he deserved to be a Seal.....",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "1pingyes2pingsno",
        "time": "6 hours ago",
        "context": "Lack of hard evidence normally doesn't matter to Libs. If Adam Schiff was the prosecutor, the guy would have been found guilty.",
        "good": "3",
        "bad": "1",
        "replies": [
            {
                "user_name": "gunluvingirl",
                "time": "6 hours ago",
                "context": "He was tried in a military court",
                "good": "1",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "1pingyes2pingsno",
                        "time": "6 hours ago",
                        "context": "Yes, however I was alluding to those who control the woke Military.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "abraham12",
        "time": "6 hours ago",
        "context": "\"However, they [prosecutors] did not present any physical evidence. Meanwhile, defense attorneys sewed doubt in the creditability of Seaman Kenji Velasco, a key witness for the prosecution who changed his account over time.\"\n    Navy FREQUENTLY jumps quickly to find a scape goat, releases his name to news services, and then gets shot down at trial.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "chrisblitzer2",
        "time": "7 hours ago",
        "context": "He's as innocent as Bradley Manning.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "americadeservestrump",
        "time": "7 hours ago",
        "context": "So a Bic lighter is all that is needed to sink an American warship costing $1.2 Billion. Good to know. Come on Putin. Easy pickens currently available in the US. Just bring a lighter!\n\nThere is no god. Show me proof!",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "webertype40",
        "time": "7 hours ago",
        "context": "So what happens now? Does this young man remain in the military? Does he get back pay for the time he lost? There will always be those who doubt his innocence, so his reputation can never be fully restored, which means finding work outside the Navy will be difficult. And if he remains in, there likely won't be many opportunities for promotion or advancement, as leadership will likely be looking for any opportunity to scapegoat him or make his life difficult.",
        "good": "2",
        "bad": "0",
        "replies": [
            {
                "user_name": "chrisblitzer2",
                "time": "7 hours ago",
                "context": "He will receive the Presidential Medal of Freedom.",
                "good": "0",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "CongressNeedsTermLimits",
                        "time": "6 hours ago",
                        "context": "Not until they check his voting history … or unless he says he’s now a girl. ",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "awaccrewdawg",
        "time": "7 hours ago",
        "context": "'failing to become a Navy SEAL and being assigned to deck duty'...He failed 'BUD'; too bad but a lot of candidates don't make the cut.  He's an E-1, he was assigned 'deck duty'; was he expecting a staff position at USPACFLT?",
        "good": "2",
        "bad": "1",
        "replies": [
            {
                "user_name": "TheSunlightCaller",
                "time": "7 hours ago",
                "context": "But but but all those movies showed how easy it was for a guy like him to just become a SEAL or a Captain. Maybe after a couple more years an ADMIRAL.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "awaccrewdawg",
                        "time": "6 hours ago",
                        "context": "Right....and we'll sprinkle some pixie dust, wish upon a star, and everything will be okie-dokie.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "CongressNeedsTermLimits",
                "time": "6 hours ago",
                "context": "I blame this young man’s father for not teaching him determination and fortitude. Thankfully, most US military are not fully entitled and “woke” yet. ",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "NavyGunner25mm",
                "time": "5 hours ago",
                "context": "E-2 and I highly doubt he attended BUDS. Plenty of dockets to be filled, regardless of rank.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "i-ely523",
        "time": "7 hours ago",
        "context": "Maybe he did it, maybe he didn’t. The evidence,  or lack of evidence says, there is no case against him sufficient to convict. It’s always a good idea to make no accusations that you can’t back up with evidence. ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "CongressNeedsTermLimits",
        "time": "7 hours ago",
        "context": "Too bad his shipmates didn’t identify as firemen. Time to print more dollars, Joe. ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jcolage",
        "time": "7 hours ago",
        "context": "I am a survivor of the USS Iowa BB-61 turret explosion in 1989, trust me, the Navy tends to blame hapless sailors for their own malfeasance...",
        "good": "51",
        "bad": "0",
        "replies": [
            {
                "user_name": "streetglidinman",
                "time": "6 hours ago",
                "context": "Seems like the M.O. of all government agencies and services.",
                "good": "3",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "yarnavy15",
                "time": "6 hours ago",
                "context": "Hear, hear. They were quick to place blame and fabricate a story based on hearsay.",
                "good": "2",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "i-ely523",
        "time": "7 hours ago",
        "context": "One of the fundamental principles of military scapegoating is to go after the lowest rank available. ",
        "good": "26",
        "bad": "0",
        "replies": [
            {
                "user_name": "phantom68560",
                "time": "5 hours ago",
                "context": "\"lowest rank available\" ... i.e., the most vulnerable and helpless!",
                "good": "2",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "jlt8888",
        "time": "7 hours ago",
        "context": "They \"sowed\" doubt, not \"sewed.\" Fox News' standards are abysmal.",
        "good": "3",
        "bad": "0",
        "replies": [
            {
                "user_name": "i-ely523",
                "time": "7 hours ago",
                "context": "Maybe the defense attorney was a seamstress. Picky, picky. ",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "jorell",
                "time": "6 hours ago",
                "context": "Journalism school isn't what it used to be.",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "CongressNeedsTermLimits",
                "time": "6 hours ago",
                "context": "Just another communications major whose peers make the same mistakes for CNN and PBS. ",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "Commonman1234014",
        "time": "7 hours ago",
        "context": "Sounds like that JAG graduated last in his law class",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "retired.army",
        "time": "7 hours ago",
        "context": "It seems that shutting the water tight doors leading to the affected area would have made the fire burn itself out in a couple of hours.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "trafgod",
        "time": "7 hours ago",
        "context": "I say he did it and will do something else later down the road like burn his house down because the door dash driver forgot to bring napkins.",
        "good": "0",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "ConservaSig",
        "time": "7 hours ago",
        "context": "Innocent until proven guilty, do slip shod investigative work and you loose convictions. Live and learn Navy. 🤷‍♂️",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "abraham12",
                "time": "6 hours ago",
                "context": "This is standard operating procedure for the US Navy.  Find a likely culprit and name him as a scape goat to the news services and then the case blows up when there's no evidence.",
                "good": "2",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "tompost",
        "time": "6 hours ago",
        "context": "A sailor on a submarine accidentally sank a submarine because he slept with the window open",
        "good": "3",
        "bad": "3",
        "replies": [
            {
                "user_name": "usnret011",
                "time": "6 hours ago",
                "context": "they probably forgot the screen door as well ",
                "good": "3",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "itsjonny",
        "time": "6 hours ago",
        "context": "Since when has it become acceptable to text your CO, especially using vulgarities.",
        "good": "2",
        "bad": "0",
        "replies": [
            {
                "user_name": "sonnyliston",
                "time": "6 hours ago",
                "context": "Ever since Biden took office",
                "good": "2",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "itsjonny",
                        "time": "6 hours ago",
                        "context": "Touché",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "ogilthorpe",
        "time": "6 hours ago",
        "context": "It's really rare that one of these military kangaroo courts acquits anyone.",
        "good": "10",
        "bad": "2",
        "replies": [
            {
                "user_name": "vern809",
                "time": "6 hours ago",
                "context": "Very true, this is out of the normal slam dungs they normally prosecute.",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "yerkiddin",
        "time": "6 hours ago",
        "context": "What's up with texting his division officer?  Were they at a club?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Franklin'sFollower",
        "time": "6 hours ago",
        "context": "Question:  What is worse than a sleeping Navy? \n\nAnswer:  A Woke Navy.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "administration63",
        "time": "6 hours ago",
        "context": "Just like the Iowa, Blame the first person of interest.",
        "good": "2",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "NavyGunner25mm",
        "time": "6 hours ago",
        "context": "Shipyards are always full of misfits and hazards. Half of our civilian workers were drunk and/or high, even offering us alcohol while they welded in our magazines.",
        "good": "5",
        "bad": "0",
        "replies": [
            {
                "user_name": "usnret011",
                "time": "6 hours ago",
                "context": "I remember shipyards being a little different, but I went home 20 years ago.",
                "good": "2",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "NavyGunner25mm",
                        "time": "6 hours ago",
                        "context": "I left in 97.  San Diego, Portsmouth and Norfolk were pretty bad. Portsmouth was by far the worst from what I experienced.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "displayname02",
        "time": "6 hours ago",
        "context": "\"sewed doubt\"?  c'mon Fox",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "futurevoice",
        "time": "6 hours ago",
        "context": "The Navy did a sorry job of investigation and went looking for a scapegoat.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sharktruck",
        "time": "6 hours ago",
        "context": "gimme a break with these comments. the kid probably got away with it ",
        "good": "5",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "Richboll",
        "time": "6 hours ago",
        "context": "USS indianapolis…..USS Iowa…..USS Bonhome Richard….  Anyone else see a pattern in Navy behavior?  ",
        "good": "1",
        "bad": "1",
        "replies": [
            {
                "user_name": "usnret011",
                "time": "6 hours ago",
                "context": "how does the Indianapolis play into this?",
                "good": "3",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "RedSkyAtNight",
                "time": "6 hours ago",
                "context": "Accidents happen. My first ship was nicknamed \"The Burn'n Bush\". USS Bushnell AS-15.",
                "good": "2",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "usnret011",
                        "time": "6 hours ago",
                        "context": "I remember going alongside USS Proteus (AS-19) a long time ago.",
                        "good": "1",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "RedSkyAtNight",
                                "time": "6 hours ago",
                                "context": "Sadly, there are only 2 Sub Tenders left in the Navy.",
                                "good": "1",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "user_name": "usnret011",
                        "time": "6 hours ago",
                        "context": "I remember going alongside USS Proteus (AS-19) a long time ago.",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "usnret011",
                        "time": "6 hours ago",
                        "context": "I remember going alongside USS Proteus (AS-19) a long time ago.",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "NavyGunner25mm",
                "time": "5 hours ago",
                "context": "The Iowa was easily determined to be a breech failure on the gun. The way we would load the powder, projectiles and shells from the magazines was a recipe for disaster. The sad part was the Navy falsely blaming it on 2 sailors that had an alleged relationship and argument.  That was a sad day that has stuck with me since it happened.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "chopdemon",
        "time": "6 hours ago",
        "context": "I'm sure he can sue someone for lost time... hope he wins. I hope he gets his choice of duty on any boat anywhere he wants now while getting to wear a Lets go Brandon t-shirt.",
        "good": "0",
        "bad": "2",
        "replies": [
            {
                "user_name": "usnret011",
                "time": "6 hours ago",
                "context": "ships not boats ",
                "good": "2",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "CongressNeedsTermLimits",
                        "time": "6 hours ago",
                        "context": "Don’t be too quick to judge. The US Navy has ships, yes, but a Sailor can serve on any of a number of smaller boats and craft, too—all 3,200 of them. ",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "HighCountryPatriot",
        "time": "6 hours ago",
        "context": "NCIS seems such more competent on TV ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Jetliner632",
        "time": "6 hours ago",
        "context": "Reminds me of the USS Iowa turret explosion. The Navy and Investigators pushed a false narrative of what really happened and ruined the lives of several service members. ",
        "good": "8",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "sonnyliston",
        "time": "6 hours ago",
        "context": "Putin just made the largest purchase of cardboard in history",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "stoehrcov",
        "time": "6 hours ago",
        "context": "So one sailor as a witness?\nWe need more and the Navy needs to prepare for this event",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "eneres_fonaed",
        "time": "6 hours ago",
        "context": "The brass will ruin anyone lower who reveals higher-ups' incompetence. Obama made sure that the best retired early leaving the losers in command. Navy ... huh ???",
        "good": "4",
        "bad": "0",
        "replies": [
            {
                "user_name": "steven_da_vet1",
                "time": "5 hours ago",
                "context": "Normal throughout the branches. The best usually do minimum time and move on while those that stay are usually the middle ground in quality. The worst weed themselves out or find others to blame for their failures.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "vanhalen572",
        "time": "6 hours ago",
        "context": "The WHOLE SHIP? Not even a demotion?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "saintpaullikestrump",
        "time": "6 hours ago",
        "context": "When did they start putting piping on the dress whites, and what's up with the coasty in the picture.",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "eagleinvestigations",
                "time": "6 hours ago",
                "context": "The coasty may have been one of his lawyers.  Beginning in October 2015, Service Dress White jumpers were changed to feature navy blue piping on cuffed sleeves, stars and navy blue piping on the collar, and a yoke, making it a 'photo-negative' of the Service Dress Blue jumper.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "futurevoice",
        "time": "6 hours ago",
        "context": "Where is Leroy Jethro Gibbs when you need him?",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ranger231674",
        "time": "6 hours ago",
        "context": "I don't think this kid was a candidate for Sailor of the Year, but the Navy apparently had a weak case against him.  The system works.",
        "good": "10",
        "bad": "1",
        "replies": [
            {
                "user_name": "Anti-Liberalism",
                "time": "5 hours ago",
                "context": "It's a shame that their case wasn't stronger, because I'm convinced he did it.",
                "good": "0",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "Navybiker185",
                        "time": "5 hours ago",
                        "context": "Doesn’t matter what you are convinced of, he was found not guilty.  ",
                        "good": "4",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "robert_ore",
                        "time": "5 hours ago",
                        "context": "That’s not how it works.\n\nTheir case wasn’t stronger because he didn’t do it.",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "slymee",
        "time": "6 hours ago",
        "context": "Because he identified as a woman.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "SirSnarkalot",
        "time": "6 hours ago",
        "context": "The Navy is notorious for using sailors for menial tasks unrelated to their actual job training & the USN absolutely loves to \"make work\"  for lower enlisted. One reason why their retention rate is so low.",
        "good": "2",
        "bad": "2",
        "replies": [
            {
                "user_name": "mst77_just_an_idea_I_had_⚠️⚠️⚠️⚠️⚠️⚠️⚠️",
                "time": "6 hours ago",
                "context": "perhaps Menial Taskman should be a rating.  Me?  Menial Taskman Second Class.  In a few years, I'll be Chief Menial Taskman.",
                "good": "2",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "dixiepixie207",
        "time": "6 hours ago",
        "context": "Lie detector test done?..firewalls to contain fire in one area?  Sprinklers?? if thats all it took to sink the ship navy is in trouble!",
        "good": "2",
        "bad": "0",
        "replies": [
            {
                "user_name": "NavyGunner25mm",
                "time": "6 hours ago",
                "context": "Certain ships are designed to sink as fast as possible, such as the Supply class. Mainly due to the amount of ordnance and fuel aboard, which would be catastrophic if exploded on the surface.\n\nYou also can't close most hatches or passageways due to the equipment being ran through for ventilation and electrical service during repairs. Sprinkler systems are often inoperable while being serviced.",
                "good": "2",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "gunluvingirl",
        "time": "6 hours ago",
        "context": "My son’s ship is docked at that pier now.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "joebauers645",
        "time": "6 hours ago",
        "context": "Must have been a libby judge who let him go!",
        "good": "0",
        "bad": "4",
        "replies": [
            {
                "user_name": "bidenlost2020810",
                "time": "5 hours ago",
                "context": "If it were a libby as you put it, they would have been sending him home in a body bag by now.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "VladTheTard",
        "time": "5 hours ago",
        "context": "Hey guys, let's throw the guy who chips paint under the bus.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mecanik909",
        "time": "6 hours ago",
        "context": "All back pay and honorable discharge with benefits.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "darkknight713",
        "time": "6 hours ago",
        "context": "Maybe they should spend more time actually doing their job like fire warch instead of gender sensitivity training",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "usnmcb17",
        "time": "6 hours ago",
        "context": "A fire started on a Navy ship intentionally or unintentionally should've been put out immediately by the fire team. ",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "scientistlibertarian",
        "time": "6 hours ago",
        "context": "I read an extensive amount about this case.  Basically NCIS and the ATF are completely incompetent.  The TV show makes you think NCIS are this world class group of investigators but this and other investigations show they're worse than useless.  It's really too good to even say they're incompetent.  The command investigation into this event showed wide scale problems in how the Navy manages ships in port undergoing work.  This even after another loss of a submarine in the past few years. Yet they focused on one sailor with almost no evidence other than he might have been there and he wasn't happy in the Navy.  People should really read about how the Navy/ATF did their \"investigation\" and arrived at their conclusions.  It's mind bogglingly unbelievable and what's even more amazing is that no one in the leadership of these organizations seems to care how bad they are.  We've got a lot of great people in the military but the leadership in all the services are horrific.",
        "good": "7",
        "bad": "0",
        "replies": [
            {
                "user_name": "shipscook1",
                "time": "5 hours ago",
                "context": "Saying that NCIS is incompetent is giving them way too much credit.",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "earthmelt",
        "time": "6 hours ago",
        "context": "Looks like an AIRCRAFT CARRIER..........................................................",
        "good": "0",
        "bad": "2",
        "replies": [
            {
                "user_name": "steven_da_vet1",
                "time": "5 hours ago",
                "context": "It technically is",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "dawg_fish",
        "time": "6 hours ago",
        "context": "Wokeness in our military",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "OldTexan(UltraMAGA)🍊",
        "time": "6 hours ago",
        "context": "I didn't pay attention to this case, guess I should have.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "FinalCountDown",
        "time": "6 hours ago",
        "context": "I was in the Navy and we all had fire fighting training, 1974, I’m surprised the new ships don’t have sprinklers to help douse the fire",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "RedSkyAtNight",
                "time": "5 hours ago",
                "context": "Sprinkler system was deactivated due to being in the yard. That's what was reported.",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "Rollingdownhilllikeasnowballheadingforhell",
        "time": "6 hours ago",
        "context": "The captain of any vessel being rank admiral and so on is responsible for any mishaps on that vessel.  Glad to see this young man get back on track with his future.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "atypicalamerican",
        "time": "6 hours ago",
        "context": "I wish he could sue the  department of the Navy for ruining his career and get at least a million bucks out of it",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "vern809",
        "time": "6 hours ago",
        "context": "They must not have had squat on this kid. This doesn't happen much in the Military court system.",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "steven_da_vet1",
        "time": "5 hours ago",
        "context": "This is usually the case with officers not trained in judicial procedures. Usually they have made up their mind prior to collecting any evidence and convince themselves they are right. Military justice is usually far from the truth.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "chaz9876",
        "time": "6 hours ago",
        "context": "Remember when that Battleships 16\" Gun Exploded and they started Chasing Some Sailors to Blame for it?\nYeah, its like that...\nBy the way, I work at Navy Base San Diego and that Ship Fire burned for 2 weeks and set off the Smoke Alarms 24/7 in our building...  Helicopters dumped water on it the whole time but METAL Fires can't be put out with water...\nWe had to Work from home or at the Ship Yard where the air wasn't so bad.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "joecasm",
        "time": "6 hours ago",
        "context": "He should consider himself lucky that he was assigned a fair judge that apparently wasn't worried about his own military career.",
        "good": "5",
        "bad": "0",
        "replies": [
            {
                "user_name": "AZSkies",
                "time": "3 hours ago",
                "context": "That’s the thing about base legal, they are fairly autonomous to the local rank and file. They report directly to the JAG either regionally or even at DC level. ",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "bushwoman728",
        "time": "5 hours ago",
        "context": "Gee, I wonder who this Seaman Kenji Velasco is, who testified against Navy sailor Ryan Sawyer Mays and then kept changing his story. The Navy prosecutors sound just as bad as civilian prosecutors. They don't care whose lives they ruin just to win a case. I am glad this young man came thru this. Maybe they should take a look at Kenji. Maybe he started the fire.",
        "good": "3",
        "bad": "0",
        "replies": [
            {
                "user_name": "farfromlib710",
                "time": "5 hours ago",
                "context": "The Navy can't handle the TRUTH!!!!!",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "navy1977656",
        "time": "6 hours ago",
        "context": "What this comes down to is the command was so focused on Diversity Equity and Inclusion training that they forgot Damage Control,  Fire Fighting and War Fighting training. ",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bulldogx79586",
        "time": "5 hours ago",
        "context": "navy rushed to judgement decades ago with the Iowa gun turret explosion....anyone remember Clayton Hartwig?",
        "good": "5",
        "bad": "0",
        "replies": [
            {
                "user_name": "bugholes",
                "time": "4 hours ago",
                "context": "The Navy exists to protect the Brass. They never sacrifice one of their own, but will bury an enlisted man in a heartbeat.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "truone",
        "time": "6 hours ago",
        "context": "California Libs let the arsonist go.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "antihotair054",
        "time": "5 hours ago",
        "context": "Good to see that that justice is available even in the military.  Navy brass apparently were attempting to cover their own failures to prevent such an expensive situation as occurred with the Bonhomme Richard by forging the case against Mays as a very convenient scapegoat.",
        "good": "4",
        "bad": "1",
        "replies": [
            {
                "user_name": "americancitizen094",
                "time": "3 hours ago",
                "context": "it's what the Navy does best!",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "whiteywhite",
        "time": "6 hours ago",
        "context": "The real hard evidence was located on Hunter Biden's laptop, and backed up on Hillary's home email server. No reasonable prosecutor would bring charges. ",
        "good": "10",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "mrbiger671",
        "time": "6 hours ago",
        "context": "They could have just taken a couple of bucks every month out of his salary, you know what I mean Vern? ",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "Pinball-Wizard",
                "time": "5 hours ago",
                "context": "You wanted them to Dock his pay!",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "mvolner72450",
        "time": "6 hours ago",
        "context": "The Navy should be financially accountable for destroying this sailor's life, career and reputation.  He should be honorably discharged and receive all pay, promotions and allowances allowed.",
        "good": "11",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "MDcafeparent",
        "time": "6 hours ago",
        "context": "I still don't buy it.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "pete_mcmillan",
                "time": "5 hours ago",
                "context": "It was never for sale.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "heimdallr",
        "time": "5 hours ago",
        "context": "Yet another sad testament to the soullessness of the Navy officer corps.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "federalscientist",
        "time": "5 hours ago",
        "context": "Naval sailor ",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "4nsixguy",
                "time": "5 hours ago",
                "context": "And?",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "robert_ore",
        "time": "5 hours ago",
        "context": "Years ago, spent some time in the yards  and maintenance pier side.\n\nThe conditions as described on the BHR sound typical. Same stuff has been going on for years. Surprised that many more tender boxes haven’t gone up in smoke.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rts",
        "time": "5 hours ago",
        "context": "If they can’t even properly investigate a fire, how can the navy be prepared to fight a war against the Chinese. ",
        "good": "5",
        "bad": "0",
        "replies": [
            {
                "user_name": "4nsixguy",
                "time": "5 hours ago",
                "context": "Apples and oranges",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "lordwereintrouble",
        "time": "5 hours ago",
        "context": "My, dos centavos...based on what I've [previously] heard/discovered, etc. with regard to the suspect & case; the suspect....most likely...is (actually) GUILTY of what is alleged!  HOWEVER,...the prosecution was tremendously \"lackadaisical\" in their trying of the case, whereas...the DEFENSE raised every conceivable contention to the accusations,...and argued/challenged them, SUCCESSFULLY!",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "robert_ore",
                "time": "4 hours ago",
                "context": "Nancy Grace would be proud of your assessment.",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "GunsAGoGo056",
        "time": "5 hours ago",
        "context": "Should have sent him to Russia as a SEAL to sink a couple of their ships.",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "jmc78",
        "time": "5 hours ago",
        "context": "USN never again",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "geniusdetector107",
        "time": "5 hours ago",
        "context": "God only knows. Better that a hundred guilty go free than one innocent be convicted.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ClaudeBalls779",
        "time": "5 hours ago",
        "context": "36 people including 5 admirals are called out in the official report",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "RedSkyAtNight",
        "time": "5 hours ago",
        "context": "On another note, the Navy has announced it's changing the duty uniform AGAIN!  Photo and article is in The Navy Times.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "annoyedreader439",
        "time": "5 hours ago",
        "context": "There were far too many issues that were being ignored to be able to say without a doubt that he started the fire...he was being scapegoated.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sakitulo296",
        "time": "5 hours ago",
        "context": "Lithium ion again. According to the woke this will save the planet.😂",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ByeNFL",
        "time": "5 hours ago",
        "context": "My only comment regarding the decision to scrap the ship is that WWII era ships were not anywhere near as complex as today's warships.  It could well be the cost alone of repairing he ship was prohibitive.  WWII ships were archaic compared to today's technical computer driven ships.  That is a decision I expect would have a lot going into it.  I could not even guess what the best call would be.  Not enough information or expertise.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Anti-Liberalism",
        "time": "5 hours ago",
        "context": "He did it.",
        "good": "0",
        "bad": "2",
        "replies": [
            {
                "user_name": "SkeletonKrewe",
                "time": "5 hours ago",
                "context": "The judge said no. Deal with it.",
                "good": "2",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "4nsixguy",
                "time": "5 hours ago",
                "context": "The says differently and its opinion is the only one that counts.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "wokenomore",
        "time": "5 hours ago",
        "context": "Media gets yet another one wrong...when will Americans learn",
        "good": "2",
        "bad": "0",
        "replies": [
            {
                "user_name": "4nsixguy",
                "time": "5 hours ago",
                "context": "What?",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "boomerjp",
        "time": "5 hours ago",
        "context": "Whether he did it or not will never be known. The prosecution failed to prove it. That's how law works. ",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "shippingman",
        "time": "5 hours ago",
        "context": "Don't forget that the CO and XO were relieved + others, and rightfully so. Their poor decisions before, during, and after the casualty were a disgrace. Where's their trial(s)?",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "timj.151",
        "time": "5 hours ago",
        "context": "Good thing for the sailor the FBI or justice department didn't come after him especially if he's a conservative.",
        "good": "3",
        "bad": "0",
        "replies": [
            {
                "user_name": "truthful895",
                "time": "5 hours ago",
                "context": "They still kept him in the brig for two years!",
                "good": "2",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "whocares777",
                        "time": "5 hours ago",
                        "context": "Which he deserved because he DID burn the ship.",
                        "good": "0",
                        "bad": "2",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "reaganiterushman",
        "time": "5 hours ago",
        "context": "Woke Navy.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "RoadRunner57",
        "time": "5 hours ago",
        "context": "Sounds like more than just the ships crews was in poor condition, the prosecution needs a lot of work as well!",
        "good": "3",
        "bad": "0",
        "replies": [
            {
                "user_name": "truthful895",
                "time": "5 hours ago",
                "context": "I wonder if they were enlisted because they were trans!",
                "good": "1",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "ABNRGR133",
                        "time": "5 hours ago",
                        "context": "Lol",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "Cult46isaJoke",
        "time": "5 hours ago",
        "context": "Recruiters promise heroism and deliver mediocrity. ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "arcticgeronimo",
        "time": "5 hours ago",
        "context": "I believe it is sowed not sewed.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sunny497",
        "time": "5 hours ago",
        "context": "Anyone want to bet,  there's Lawsuits about to take off ? ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Arnie15",
        "time": "5 hours ago",
        "context": "The US Navy tradition of blame the most junior person and not the captain who was responsible may finally be gone. Just reading what was in the press at the beginning of the court-martial was enough to convince me the young enlisted sailor was not at fault. Instead it was the CO and XO who failed to inspect what they expect. Just another example of the failed “woke” officers in the military today. I’m sure they will get promoted and get a medal. ",
        "good": "3",
        "bad": "0",
        "replies": [
            {
                "user_name": "cognomen238",
                "time": "5 hours ago",
                "context": "Well, setting a pile of cardboard on fire, wasn't the Admiral's fault",
                "good": "1",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "annoyedreader439",
                        "time": "5 hours ago",
                        "context": "the problem is that he was acquitted so he also didn't light a pile of cardboard on fire.",
                        "good": "1",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "cognomen238",
                                "time": "5 hours ago",
                                "context": "Is that what that means to you?",
                                "good": "0",
                                "bad": "1",
                                "replies": []
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "voroal",
        "time": "5 hours ago",
        "context": "What I got was he did it but they prosecutor didn't do a good job of evidence collection.  Key words was 'sow doubt'. So he will get off even though he is guilty.",
        "good": "0",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "bugholes",
        "time": "4 hours ago",
        "context": "Just ask the Marsoc 3 how it works. After a lower court threw out the charges against them, Gen. Mattis ordered them recharged. They are fighting this travesty as we speak.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mranonymous",
        "time": "4 hours ago",
        "context": "He did it. but as usual the govt had poor lawyers.",
        "good": "3",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "bb2c2",
        "time": "4 hours ago",
        "context": "Democrats cherish their fudge packers.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "CptVonTrapp",
                "time": "4 hours ago",
                "context": "far out dude!",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "LexiconDevil",
        "time": "4 hours ago",
        "context": "So what? The disgraced non war hero john mcain lit the Forrestal fire that killed 134 sailors and injured another 161. His daddy was an admiral so he didn’t get in trouble either.",
        "good": "2",
        "bad": "2",
        "replies": [
            {
                "user_name": "tonyinmontana504",
                "time": "4 hours ago",
                "context": "That's not what the investigation said or were you there to see who started that fire?",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "petessake1",
        "time": "4 hours ago",
        "context": "Poor Sailor, what an ordeal he has gone through. \nPity they are not forced to pay him something!",
        "good": "3",
        "bad": "1",
        "replies": [
            {
                "user_name": "selkie614",
                "time": "4 hours ago",
                "context": "They may well be.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "malang95",
        "time": "5 hours ago",
        "context": "👍👍👍👍👍",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mattreno",
        "time": "4 hours ago",
        "context": "Was the ship made out of wood?\nCardboard boxes igniting the steel walls and floors of a ship? That's even dumber than jet fuel melting steel beams.",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "fmike929",
                "time": "4 hours ago",
                "context": "Ships are highly flammable.  If you had been Navy you would have known that. ",
                "good": "2",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "woolybully372",
                        "time": "3 hours ago",
                        "context": "I wasn't Navy and I knew that.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "suxcitydelivery",
        "time": "4 hours ago",
        "context": "In the Navy officers rarely take blame for anything.  Blame is always sent down the chain a command until they find someone suitable to accept it.",
        "good": "9",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "chelseas4086",
        "time": "4 hours ago",
        "context": "Biden says the US has to catch up with the UK.  He is concerned that Liz Truss will put UK into a deep recession before the he gets the US in one....",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "veteran5813",
        "time": "5 hours ago",
        "context": "Whatever the cause ~ this just can’t happen. I agree with another’s post that Navy personnel are much more careful than civilian contractors aboard ship for repairs. They need supervision",
        "good": "2",
        "bad": "0",
        "replies": [
            {
                "user_name": "jarheadfantom",
                "time": "4 hours ago",
                "context": "Just like the contractor that started a fire in a nuclear submarine just so he could get out of work. ",
                "good": "3",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "jarheadfantom",
        "time": "5 hours ago",
        "context": "If you join the Navy and think you're going to be a SEAL, and not chipping paint, painting, swabbing, or pushing planes around on a carrier, then you've got another thing coming.",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "bugholes",
                "time": "4 hours ago",
                "context": "Those who apply for the SEAL program know beforehand, that they will be assigned to a ship in the fleet in the specialty they were trained for before the SEAL program. They can also get a chance to retry for the SEAL program after a period of time.",
                "good": "2",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "RedSkyAtNight",
                        "time": "4 hours ago",
                        "context": "There are enlisted who go straight from bootcamp into BUD/S training. Usually pre planned through recruiter.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "senpalpatine",
        "time": "4 hours ago",
        "context": "Why does Clayton Hartwig come to mind when I read this article?",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "americancitizen094",
                "time": "4 hours ago",
                "context": "Clayton Hartwig? The Navy scapegoated him as hard as they could. I know, I'm his brother in law. ",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "senpalpatine",
                        "time": "3 hours ago",
                        "context": "That was my point.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "philosifur",
        "time": "4 hours ago",
        "context": "Embarrassing.  The gubment should have accused the sailor of being a Jan 6th insurrectionist.  He'd already be serving a life sentence in a DC prison.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "chelseas4086",
        "time": "4 hours ago",
        "context": "\"I saw this man, in Seamen's uniform with short cut hair and a covid mask on light this fire...\" \n- witness",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "morganmesa731",
        "time": "4 hours ago",
        "context": "So, he set boxes on fire on purpose, but he is not guilty?  I see.",
        "good": "3",
        "bad": "2",
        "replies": [
            {
                "user_name": "robert_ore",
                "time": "4 hours ago",
                "context": "No. You don’t see.",
                "good": "2",
                "bad": "1",
                "replies": []
            },
            {
                "user_name": "Kemaris",
                "time": "4 hours ago",
                "context": "No, that's not what the finding was. It does not appear that anyone actually saw him light anything on fire, and the Navy never bothered investigating other in possible causes.",
                "good": "4",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "truthful895",
        "time": "5 hours ago",
        "context": "If he was trying to prove a point, it may have been more serious a point than he realized!  If the ship was full of junk with the fire suppression system turned off anything could have started the fire! whoever authorized the fire suppression system to be turned off should be liable!",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "urroner",
        "time": "4 hours ago",
        "context": "We don't need no stinkin' evidence.  Vamanos muchachos.  Let us return to the South and pick crops for Pelosi.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "joebidenyourenojimmycarter",
        "time": "4 hours ago",
        "context": "sounds like he was not guilty rather then innocent.\n\ndon't think anything was proved during the trial....  he could very well have started the fire because he was mad...  but with no evidence beyond a reasonable doubt that lithium batteries or a forklift also could have started the fire....  when the proof doesn't fit, you must acquit.",
        "good": "1",
        "bad": "1",
        "replies": [
            {
                "user_name": "robert_ore",
                "time": "4 hours ago",
                "context": "He was found not guilty and is more innocent than the CO, XO and DCO.",
                "good": "3",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "urroner",
                        "time": "4 hours ago",
                        "context": "What about those EIEIOs?",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "error": "error"
    },
    {
        "user_name": "thinkingmonkey475",
        "time": "4 hours ago",
        "context": "So he sent the text about \"hazardous conditions\" then later a fire started and they assumed it must have been him?",
        "good": "6",
        "bad": "1",
        "replies": [
            {
                "user_name": "suxcitydelivery",
                "time": "4 hours ago",
                "context": "That's how officers keep those shiny things on their shoulders.",
                "good": "4",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "DemoKKKRatsHateBlacks",
                        "time": "4 hours ago",
                        "context": "Exactly.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "crazynesss",
        "time": "4 hours ago",
        "context": "This was a railroad job from the start.",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Tenshi",
        "time": "5 hours ago",
        "context": "Thought is was reported the USS Bonhomme Richard was going to be scrapped.",
        "good": "2",
        "bad": "0",
        "replies": [
            {
                "user_name": "fed-upwithdems",
                "time": "5 hours ago",
                "context": "it is. the fire happened while the ship was undergoing maintenance ",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "washingtondemocrats_r_iconoclasts",
        "time": "5 hours ago",
        "context": "This could have been prevented if only we had one more male admiral in a skirt, another George Floyd statue, more CRT training, and more black people in TV commercials.",
        "good": "10",
        "bad": "0",
        "replies": [
            {
                "user_name": "Wewontbefooled780",
                "time": "4 hours ago",
                "context": "thank you brother that made my evening",
                "good": "3",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "learntoswim751",
                "time": "4 hours ago",
                "context": "LOL! Thanks I needed that!",
                "good": "2",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "seafordva",
                "time": "3 hours ago",
                "context": "Well done! LOL.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "rangobang",
        "time": "4 hours ago",
        "context": "Hopefully the Navy will learn from their mistake to add more sprinkler heads in high risk areas.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "AlBundy733",
        "time": "5 hours ago",
        "context": "Tough to get a conviction anymore without video.",
        "good": "0",
        "bad": "1",
        "replies": [
            {
                "user_name": "robert_ore",
                "time": "4 hours ago",
                "context": "Tough to get a conviction when he didn’t do it.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "progressives8rfreedoms",
        "time": "4 hours ago",
        "context": "Maybe this cowardly traitor can still land a gig as a Sea World Seal.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "TheFantasticMrFoxEsquire",
        "time": "4 hours ago",
        "context": "The punk did it. So I guess that means a promotion.",
        "good": "0",
        "bad": "8",
        "replies": [
            {
                "user_name": "DemoKKKRatsHateBlacks",
                "time": "4 hours ago",
                "context": "You hate everyone or everything? Or both?",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "robert_ore",
                "time": "4 hours ago",
                "context": "You should have provided your evidence to the prosecutor.",
                "good": "3",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "TheFantasticMrFoxEsquire",
                        "time": "4 hours ago",
                        "context": "They have the evidence. They jackhammered it.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "robert_ore",
                                "time": "3 hours ago",
                                "context": "And what evidence is that?\n\nPlease, educate us on this “evidence”.",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "DemoKKKRatsHateBlacks",
        "time": "4 hours ago",
        "context": "His chain of command should be fired for making the kid take the fall for their inept actions.... or INaction, I should say.   Ridiculous.  At least the judge has integrity.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "littlee854",
        "time": "4 hours ago",
        "context": "How about the fact when these ship under go \"maintenance\"  every single bulkhead door is prevented from closing due to cables and power cords. Including ones designed to seal compartments to stop the spread of fire. The contracting companies make billions off of the military every year.  Make them include fire crews, watch crews to prevent and put out any fire on those ships.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "roushl1964",
        "time": "4 hours ago",
        "context": "Well, the Navy may have lost their case, but let there be no doubt his military career is over...the stain of the charge will be on him like white on rice.  Sad really, but that is how the services operate!",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "CptVonTrapp",
        "time": "4 hours ago",
        "context": "What other kind of sailor is there…?",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "CharlemagneTheElder",
                "time": "3 hours ago",
                "context": "Coast Guard.",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "OptedOut",
                "time": "31 seconds ago",
                "context": "Commercial.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "diverdownmaui437",
        "time": "3 hours ago",
        "context": "Obviously someone in his chain of command didn't like him and saw an opportunity to make an example. They failed miserably. The Navy failed to provide evidence except someone who kept changing their story.  They actually used a he said he said argument and they lost.  It makes one question the professionalism of the Navy's JAG officers.  Perhaps all JAG officers in general.  Perhaps the legal profession has gone woke in the military.  Very bad for our military members if that this the case.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "woolybully372",
        "time": "3 hours ago",
        "context": "I knew something like this would happen schooner or later.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "woolybully372",
        "time": "3 hours ago",
        "context": "The ship was docked so maybe he was under a lot of pier pressure.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "solarlight",
        "time": "3 hours ago",
        "context": "Are they going to allow him release, give him a discharge or keep him around to torture?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "qmc(sw/exw)ret.",
        "time": "4 hours ago",
        "context": "I spent 25 years in the USN. Fires on ships happen all the time. But to lose a ship to fire while pierside in the USA can only happen through negligence, lack of training or degradation of installed fire fighting systems. All of those are the direct responsibility of the Commanding Officer.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "percivalschnauzington",
        "time": "4 hours ago",
        "context": "Yeah, so what happened to Kenji Velasco?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Pundit",
        "time": "4 hours ago",
        "context": "He was found not guilty now he can go back to chipping paint!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mattreno",
        "time": "4 hours ago",
        "context": "I can imagine the Chinese military taking notes: no more need for torpedoes or ship to ship missiles, we'll just sneak someone on board, tell him to look for cardboard boxes, then pull out a cigarette lighter.",
        "good": "0",
        "bad": "1",
        "replies": [
            {
                "user_name": "CptVonTrapp",
                "time": "4 hours ago",
                "context": "cigalette rightel…",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "senpalpatine",
        "time": "4 hours ago",
        "context": "Wow…to think a contracted ship repair facility might have contributed to this fire. I mean, they’re usually top notch and always observe good house keeping practices. No way, it had to be a non-rate.",
        "good": "2",
        "bad": "1",
        "replies": [
            {
                "user_name": "seafordva",
                "time": "3 hours ago",
                "context": "I spent 38+ years, overhauling Aircraft Carriers. There was a Shipboard or Dry Dock fire almost daily. Ships Force and Shipyard FD would both respond. Fires were usually caused by grinding, welding, brazing, or careless smoking. Rarely did the fire last more than 10 minutes, and even more rarely, did it result in any casualties. It goes with the job.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "dflood",
        "time": "4 hours ago",
        "context": "Amazing that a white kid actually got acquitted by our \"woke\" Navy. Maybe he actually is innocent. If so, they wasted a lot of time and will never know what happened.I live in San Diego and watched that proud ship burn. I dont like the fact that somebody is getting a pass here.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "alligator8611",
        "time": "1 hour ago",
        "context": "The fire marshal along with any and all training safety officers. D.C. personnel and training P.O.’s need to be investigated. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "galenr",
        "time": "3 hours ago",
        "context": "Several dozen reports were filed regarding fire hazards throughout the ship for weeks before the fire, including reports from several commissioned officers. On site commanders did nothing with these reports until those making them went public.\n\nTime for more coffee.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "hooliganvet",
        "time": "3 hours ago",
        "context": "What's a \"Naval Sailor\"?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "101stParatrooper",
        "time": "4 hours ago",
        "context": "The new ships need a sign:  No Smoking.  Cigarettes could start a fire and burn up the ship.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "lionhardt",
        "time": "3 hours ago",
        "context": "Kinda like biden setting America on fire for revenge!!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cks260",
        "time": "4 hours ago",
        "context": "Must be the same judge that let 'McCain' off the hook for his 'disaster'....",
        "good": "1",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "justpappystu600",
        "time": "2 hours ago",
        "context": "Considering the level of evidence the prosecution had the trial was questionable to begin with...",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dudekelp",
        "time": "3 hours ago",
        "context": "Failed scape goating",
        "good": "0",
        "bad": "0",
        "replies": []
    }
]