[
    {
        "user_name": "DependsOnJoe",
        "time": "2 days ago",
        "context": "Will switching remove me from the class action settlement? I'm rather looking forward to my one dollar and six cent share of selling out America.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "HarryBaals404",
        "time": "2 days ago",
        "context": "Google buried all news related to Hunter’s laptop, they promoted Trump Russia collusion and any negative news on the economy, inflation or interest rates is very hard to find. It’s ridiculous what an influence these search engines have over the American people, but they are starting to wake up and take notice. ",
        "good": "104",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "st.r705",
        "time": "2 days ago",
        "context": "It’s so easy to get around Google blocks, it’s all about how you phrase things, if you don’t get the results phrase it differently and it shows up eventually. Avoid what you know they are looking to block in searches. It’s been fun for me to figure out, I’m a pro now.",
        "good": "6",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "dick-tracy",
        "time": "2 days ago",
        "context": "I just looked at it , it tracks your search history.\nI'll stick with DuckDuckgo",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "justormredux",
        "time": "2 days ago",
        "context": "I wonder how much he paid Fox for the infomercial.",
        "good": "2",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "nothingbuta",
        "time": "2 days ago",
        "context": "Meh….",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "HarryBaals404",
        "time": "2 days ago",
        "context": "I’m looking forward to trying it. I’m so sick of searching on Google and ending up on only pro left wing propaganda. Try searching, American economy. I don’t know where Google finds these lies and disinformation. ",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "howaboutthem",
        "time": "2 days ago",
        "context": "DEMocrats won't stand for this",
        "good": "9",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "dick-tracy",
        "time": "2 days ago",
        "context": "DuckDuckgo user but I'll be checking it out.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "OldTexan(UltraMAGA)🍊",
        "time": "2 days ago",
        "context": "Google is an extension of the DNC",
        "good": "19",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "abiel",
        "time": "2 days ago",
        "context": "I don't trust them any more than Google. Look at what happened with Rumble, when you sign in to your account every video has a 10 second loading time, sign out and it goes away.",
        "good": "4",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "afgmountaingoat",
        "time": "2 days ago",
        "context": "Just googled NRA. It was the top of the page. So was a search for Hunter Biden’s laptop. What are people on about?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "NorCalPatriot",
        "time": "2 days ago",
        "context": "What?  There are patriots who still use Google?",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "and,1,other",
        "time": "2 days ago",
        "context": "Will the leftist banks, companies, and politicians put a stranglehold on them like other popular conservative platforms/search engines?",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jershon",
        "time": "2 days ago",
        "context": "Politicians are so cheesy with naming tech ventures. Also need to stop copying things and make something original and better.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "👼‍SuperFlyJesusFreak👼‍",
        "time": "2 days ago",
        "context": "\"A few years ago, as I was looking for things in searching on the Internet, I felt like I just wasn't getting results that I expected… I felt like it kind of like was these biased results, and so I started talking to other people and… other people sort of felt the same way,\" \n\nWhat exactly was he searching for?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "DependsOnJoe",
        "time": "2 days ago",
        "context": "Google... How do I market my own brand of Board Shorts in Iran? \n.... Hello?\n\n... Uh hello? Google?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "gun-rights-texan",
        "time": "2 days ago",
        "context": "Unfortunately in our society today freedom of speech only applies to liberals and what doesn’t offend liberals. Anything other than wokeism offends libersls",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "theConstituent",
        "time": "2 days ago",
        "context": "Glad to see this.  I use Duck Duck Go for privacy and am happy with them.  Google is trying to collect details about every single person in the world.  They have unimaginable power.  ",
        "good": "61",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "jlt8888",
        "time": "2 days ago",
        "context": "Google has ridiculous market share (more than 90% of searches worldwide). We need more competition.",
        "good": "24",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "srirwin",
        "time": "2 days ago",
        "context": "It was BIG GOVERNMENT that enabled BIG TECH to become the filter of speech!  The problem is the Progressives are the big tech  protectors and they have no qualms about shutting down speech the don't like!",
        "good": "26",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sus123",
        "time": "2 days ago",
        "context": "So this is the same, = cancel what left has to say",
        "good": "0",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "BYEBYEMISSAMERICANPIE🍒",
        "time": "2 days ago",
        "context": "I’ve been using DuckDuckGo for 4 years or more. Googles been burying information since it began. ",
        "good": "43",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Proud_son_of_Columbus🇮🇹🇺🇦",
        "time": "2 days ago",
        "context": "Big tech is protected by both sides.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "CDiBella943",
        "time": "2 days ago",
        "context": "Installed ✅ ",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "rebelveteran",
        "time": "2 days ago",
        "context": "I hope it's a great success I would love to see Google put out of business sometime in the future so that the liberal lunatics can't control everything we say and censor things they don't like from patriotic Americans",
        "good": "7",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "StopFeelingGuiltyWhitePeople",
        "time": "2 days ago",
        "context": "I'm impressed.  If you Freespoke search the \"National Justice Party\", which is a white advocacy group, it's the top line.  On Google, they're the third line sandwiched between speeches from the ADL and SPLC about them being a bunch of racists.",
        "good": "3",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "👼‍SuperFlyJesusFreak👼‍",
        "time": "2 days ago",
        "context": "There's already an alternative to Google.  DuckDuckGo.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dougseeker880",
        "time": "2 days ago",
        "context": "I trust Google (throws up in my mouth).",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "banthafodder",
        "time": "2 days ago",
        "context": "When the founding fathers wrote about freedom of speech, there were no social media platforms. Speech must be closely monitored and controlled today because anyone can spread their own ideas to the world. That's a danger to democracy.",
        "good": "0",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "hooduhthunkit",
        "time": "2 days ago",
        "context": "I drive to my local library, whip out the microfiche and start searching. It's SO much easier than Google. And, they only track me if I leave the building with it. The security aspect is world's above anything Google provides.",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "skeet4204547",
        "time": "2 days ago",
        "context": "thank god for these people fighting for our free speech and privacy!! Google has too go along with all the other far left company's being controlled by very rich people that want to destroy America ",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "idgaratsass",
        "time": "2 days ago",
        "context": "Was FreeSpeak already taken ?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Proud_son_of_Columbus🇮🇹🇺🇦",
        "time": "2 days ago",
        "context": "Just another Duck Duck saying what people want to hear but no difference. DuckDuck is no different than google and I'm sure that this will be the same. The people of the US are so gullible.",
        "good": "0",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "and,1,other",
        "time": "2 days ago",
        "context": "What is best about this, is it shows that Google most definitely buries positive conservative results. Freespoke gives all results, according to relativity, instead of what they decide would be best for you to see. Search anything positive about conservatives on Google, and all you will get is leftist media opinions, then finally maybe a couple of what you were actually looking for. Search the same on Freespoke, and it gives you everything that is most relevant to your search.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mdmckin",
        "time": "2 days ago",
        "context": "Everyone is aware that you can buy \"hits\" on Google to make it seem a search is more popular than it truly is right?....🤔",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "winnersnotwhiners",
        "time": "2 days ago",
        "context": "Excellent!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Dr.Burt",
        "time": "2 days ago",
        "context": "Freespoke just grew by one more.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "toro95037",
        "time": "2 days ago",
        "context": "Todd Ricketts has an interesting observation about Google and Twitter. I too have noticed that over the years that Google searches have become skewed off track, and I no longer use their service. I wonder how many people know that FoxNews uses a Google algorithm in the \"conversation\" forums. You are not free to post just \"anything\" here, it's not just big tech that censors.",
        "good": "21",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mc130ip",
        "time": "2 days ago",
        "context": "So, he thinks Google is left leaning and he's created a right leaning website in response.  Still, nothing centrist, as he claims he wants.",
        "good": "0",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "whatever66666",
        "time": "2 days ago",
        "context": "We need a conservative BROWSER.  Please and thank you.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "whatever66666",
        "time": "2 days ago",
        "context": "duckduckgo has me.",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "a11399",
        "time": "2 days ago",
        "context": "Google and all of its subsidiaries are nothing more than a vast, data-mining operation.   I haven't used it for a very long time.  Firefox and duckduck are great alternatives for any Google function.",
        "good": "125",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "suphawaii",
        "time": "2 days ago",
        "context": "What happened to Truth Social? Same thing will happen with this one,",
        "good": "0",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "faitaccompli42",
        "time": "2 days ago",
        "context": "Google has had an anti-Conservative bias almost since its inception. Not as blatant as Twitter, Google is more sneaky about it, but the results are the same. Like most liberals, they abhor free speech.",
        "good": "77",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "floyder",
        "time": "2 days ago",
        "context": "This is a horribly written story.  Seems common lately.    Are there editors?   ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "lastman_standing",
        "time": "2 days ago",
        "context": "When the war breaks out, it won’t be much longer, there will be two internets. One for conservatives and one for liberals. It’s coming.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "EvilRepublican893",
        "time": "2 days ago",
        "context": "Google has become an Apple computer. Time to move on to greener fields. ",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "americanshark",
        "time": "2 days ago",
        "context": "Lost my interest when he began talking similar to a valley girl, \"like\"...\"like\" whew.",
        "good": "8",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "RoyD.Mercer",
        "time": "2 days ago",
        "context": "OUTSTANDING!!!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "JohnDoe55005500",
        "time": "2 days ago",
        "context": "Won't be that hard to bring up two browsers, one Google and the other Freespoke, to see the stark difference .. type in the same search, say \"Kyle Rittenhouse\" and see what results come up on each browser.",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "thunderagent",
        "time": "2 days ago",
        "context": "Free speech and the free exchange of ideas. \nWhat a concept.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rogerramjet222",
        "time": "2 days ago",
        "context": "I might try this one out.  They shoukd talk about this engine more and drive support as they did with duckeuckgo.\n\nHave this engine on one browser, duckduckgo on another.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Juanjulio086",
        "time": "2 days ago",
        "context": "True free access doesn’t filter out what the platform doesn’t like, for example:  “porn”.  This is just another Google…just a right-leaning Google.  🤷‍♂️",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "michaelbroughton",
        "time": "2 days ago",
        "context": "Every search engine is mining your data regardless of what they profess! Outright and blatantly lies are the now norm. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cccollo",
        "time": "2 days ago",
        "context": "I think it’s fantastic. I’ve never heard of it but will check it out. I don’t like to be influenced by one mindset.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Pinball-Wizard",
        "time": "2 days ago",
        "context": "I don't use Google anymore, I use Bing, and I might end up going with Duckduckgo.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Etool435",
        "time": "2 days ago",
        "context": "Switched to DuckDuckGo a few years back and all the creepy tracking advertisements went away. ",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "lastman_standing",
        "time": "2 days ago",
        "context": "You can speak freely, as long as you only say what I want to hear. - Liberal definition of free speech.",
        "good": "14",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "insanedemocrat",
        "time": "2 days ago",
        "context": "Google is run by an authoritarian, Bing is owned by Bill Gates (Need i say more about authoritarian) and Duck Duck Go CEO already said its ok to censor misinformation... \n\nThese people think they are smarter than everyone else so they have to tell us how and what to think. Hopefully this is different and he doesnt become a sellout!",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "ArtificialIntelligenceBuyDumb",
        "time": "2 days ago",
        "context": "AMEN!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "richardgrande894",
        "time": "2 days ago",
        "context": "Results for the enword on Freespoke:  A slang term used to describe American blacks but somehow everyone was gaslighted into accepting that the race intended to be insulted by it is also the only ones who can say it. Also known as the first American meme.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "UnicornRadar",
        "time": "2 days ago",
        "context": "Google deduces your interests from your browsing history, and then gives you tailored search results that it thinks you will want. That's why you eventually see mostly conservative or mosty liberal news in your search results. Ultimately you are getting a limited world view from Google, because they think that's what you want.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rocky-rowdy",
        "time": "2 days ago",
        "context": "Google went from \"Do No Evil\" to \"Do the Right Thing\" (translated into...censor conservative viewpoints) to now  \"to organize the world's information and make it universally accessible and useful .\" (translated into...mine all of your personal data and then sell it and make Brin and Page richer than God...and manipulate data to censor all republicans.) Google is now the definition of Evil...",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "unforgivable183",
        "time": "2 days ago",
        "context": "Google is pro CCP!",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "finn_mccool",
        "time": "2 days ago",
        "context": "I'm in on Freespoke!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "#LibertyForward",
        "time": "2 days ago",
        "context": "All the while sucking up and selling your info amd searches to law enforcement. Wouldn’t trust them with a toy animal. ",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "valannín",
        "time": "2 days ago",
        "context": "The fact that it still censors a segment of the internet based on what the owner deems to be objectionable means that it’s not a ‘free speech platform’.\n\nIt’s a Conservative one.  Bias is bias.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Oldwhiteguy262",
        "time": "2 days ago",
        "context": "Google and privacy should not be used in same sentence.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "MoreMajorum",
        "time": "2 days ago",
        "context": "Brave or Freespoke.   Nothing else.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "my$.02worth$.00",
        "time": "2 days ago",
        "context": "How is it that the people/party that used to holler about free speech the most have taken it away???",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bunkerinspector578",
        "time": "2 days ago",
        "context": "It's funny to watch MAGAts fawn over a tool that preaches 'privacy', 'free speech', and 'no Google'..............and that's basically the end of their due dilligence. Brave is a Chromium-based browser.....so if you like Brave, you can thank Google ;).",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "vietnamriverinevet",
        "time": "2 days ago",
        "context": "Not sure what good a separate conservative forum will accomplish.  I think it would tend to further divide the country.  People need to be able to share views with one another without censorship.  Unfortunately, current forums allow anonymous ranting and censorship... Not a good way to get people together.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sho'nuff",
        "time": "2 days ago",
        "context": "I thought it was just coincidence that when I Googled something,  say kitchen knives, kitchen knife ads popped up on every site I went to for a month.   It never dawned on me that they might by eavesdropping. ",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "robstall",
        "time": "2 days ago",
        "context": "The Constitution is now OPTIONAL according to this insidious left lib dem sector.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "68_corvette",
        "time": "2 days ago",
        "context": "Duck Duck Go another alternative",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "fuddyduddydude",
        "time": "2 days ago",
        "context": "The sooner these biased tech giants can be de-monopolized, the better off society will be. ",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "apoliticaljoe",
        "time": "2 days ago",
        "context": "Hahaha you type this URL on google and for some reason”it will not load” lol",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "onemorething666",
        "time": "2 days ago",
        "context": "Use DuckDuckGo....very private",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "FlyEagle515",
        "time": "2 days ago",
        "context": "Why isn’t is called “Freespeak”? 🤔",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "987607328ad",
        "time": "2 days ago",
        "context": "My friends revealed to me the as yet unspoken news that they are carefully developing Espionage search algorithms based on many years of experience, but adjusted for new data.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "common",
        "time": "2 days ago",
        "context": "I use brave browser and dont miss google at all.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "pngjohnny",
        "time": "2 days ago",
        "context": "I've been using DuckDuckGo but will definitely give Freespoke a try.",
        "good": "91",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "grazer",
        "time": "2 days ago",
        "context": "I have Bing and have Duck, Duck Go in favorites.  Put in the same words to search, and you get different results.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "lmarion",
        "time": "2 days ago",
        "context": "Here’s one White Sox fan who will be a little easier on the Cubs. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "auschwitzpoolguard",
        "time": "2 days ago",
        "context": "There are like 9 trackers on that page. There's none on Brave Search.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "vppacificocean",
        "time": "2 days ago",
        "context": "To identify as a Republican, conservative, white male. . .is putting a target on your back.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "brownwatervet",
        "time": "2 days ago",
        "context": "Now they care, sure.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "MoreMajorum",
        "time": "2 days ago",
        "context": "Yeah, for all you folks not keeping up with current events, DuckDuckGo gives your data to Bing and censors content with the same Microsoft algorithms.  You’re basically using Bing.  Brave or Freespoke, guys.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Brandon's_got_what_plants_crave",
        "time": "2 days ago",
        "context": "Google is a datamining nightmare for people who use it.  Ought to be illegal, the way people are being used by that company.  And the nerve of them to put \"context\" flags, etc., on YouTube videos.\n\nWeaning away/off of Google takes a long time and is not easy.  The fact Android phones use Google makes things much more difficult.  Is Apple any better on the privacy front?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "skeeter1936",
        "time": "2 days ago",
        "context": "DuckDuckGo ❤️👍",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "carbonation",
        "time": "2 days ago",
        "context": "Animal Farm.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "RHB1",
        "time": "2 days ago",
        "context": "Google is part of the problem. Let me prove it to you: Google \"Hillary Clinton associates deaths\", then do the same search on DuckDuckGo or Freespoke. The returns are much different. Also, search for your name from time to time, you may be surprised at what you find.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Trumplicious",
        "time": "2 days ago",
        "context": "The powerful are interested in Free Speech too, but that is not my concern. The government uses Facebook to prevent Free Speech of each and every American. Doesn't matter if you are Pelosi or Ted Cruz. By soliciting speech from the public on Facebook, they are thwarting our Free Speech Rights.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "saggydrawers",
        "time": "2 days ago",
        "context": "Make it free like google ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "hammer4481",
        "time": "2 days ago",
        "context": "Since Fox Fake News puts out a story on Freespoke, there must be something wrong with it.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "hammer4481",
        "time": "2 days ago",
        "context": "Fox Fake News censors everything that Google does--I've been censored here for about two years, just after the scamdemic hit.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "unicorn666397",
        "time": "2 days ago",
        "context": "Duck Duck uses Bing as their search - still trackable ….I now use BRAVE",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ConcernedCitizen56",
        "time": "2 days ago",
        "context": "OK, tried Freespoke. Website is frozen and unresponsive...",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mdmckin",
        "time": "2 days ago",
        "context": "Google sells hits. If you are a political party, a business or a news agency, etc... You can buy \"hits\" to make whatever you want show up on the top of the 'search' list. When others search, these \"popular\" searches appear first.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "a1c3c0",
        "time": "2 days ago",
        "context": "Not sure why the needed to use an article for Freespoke ad space, but duckduckgo is better.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sevvy",
        "time": "2 days ago",
        "context": "I, too, kept searching and couldn't find things on Google.\nLike \"Actual widespread election fraud\", \nand\n\"Any real evidence of widespread election fraud\"\nbut nothing...\nthen I tried Freespoke....and \nalso nothing. hmmm...",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "justanothercomment830",
        "time": "2 days ago",
        "context": "Google biased???? Say it isn't so. Just think Covid, they were printing out more junk studies called \"science\" than an HP Printer could handle from everything from masks to vaccines. \n\nWorse yet, The Biden Administration partnered with Google and others to remove or bury content under the guise of misinformation. \n\nHannity said regarding Covid \"Do your Research\". That became impossible for an ordinary American since google only had one narrative. And they also headed you off before you could get to your Doctor. \n\nOn July 29th, 2021, the Federation of State Medical Boards (FSMB) in the US warned all healthcare professionals that they could lose their medical license if they create or spread what is deemed to be Covid-19 vaccine “misinformation”.\n\nMisinformation was anything contrary to the government narrative. Essentially you had nowhere to go except substack or these type of new platforms. They were attacked as conspiracy boards.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "KipK",
        "time": "2 days ago",
        "context": "Need more platforms like this,  leave the standard biased platforms and go on about your business",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "rhodeisland",
        "time": "2 days ago",
        "context": "The take videos off youtube that shows Child Unprotective Services doing bad things, illegall things.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "im_gumby",
        "time": "2 days ago",
        "context": "It will fail. Sorry but the economics tend towards monopolies in this space unless you have a better mousetrap.  Google is lightyears ahead and to catch up one would need very deep pockets. \nGoogle prints money from their control over internet adversisting.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ShitFloats",
        "time": "2 days ago",
        "context": "They always start out this way but once they become successful, they start down that slippery slope of profit maximization. That requires tracking information for potential advertisers. Soon, they know you have hemorrhoids, live on 1st street, and your Dad's middle name is Carl.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "uau",
        "time": "2 days ago",
        "context": "duckduckgo is the no brainer. Works great.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "cseco",
        "time": "2 days ago",
        "context": "I'm not sure about Google and censorship. A few years ago a friend, as a joke I thought, sent me an email that told me to Google \"Nancy Pelosi naked.\" Like a sap I did. Google gave me results. It didn't censor anything.\n\nThat was back around 2019 and I'm still in therapy.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Trumplicious",
        "time": "2 days ago",
        "context": "As far as the Free Speech goes, I believe and have always believed, that if you have a web site on the Internet that allows comments, you must allow Free Speech for those comments. This is my fight. These companies want to operate on wires each individual town government contracts for, and these companies allow speech from the public , then it must be Free Speech.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "klik395",
        "time": "2 days ago",
        "context": "This is the way it should be done. Instead of complaining about google, facebook , and twitter create something better and let the public decide which one to use.",
        "good": "5",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "american_freedom_1955",
        "time": "2 days ago",
        "context": "Google won't let me be racist. Wah!",
        "good": "0",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "Obamawasafraud",
        "time": "2 days ago",
        "context": "We were all lied to when they sold us a secure internet that would keep your privacy safe and be non bias in it’s searches ! 👎🏼🤡",
        "good": "4",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "whatmeworry1",
        "time": "2 days ago",
        "context": "The googs, zucks and twits are intolerant of the diversity of thought, ideas and beliefs.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "outwest-01503",
        "time": "2 days ago",
        "context": "Nothing wrong with DuckDuckGo",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "zonomo",
        "time": "2 days ago",
        "context": "There are 2 important sides to this coin and he didn't address the most important one.   The search results are on one side but the search meta data is on the other.  What will they do with that?  Will they collect and monetize like Big Tech?  How is that data protected, how is identify protected, what is collected, and who has access to it?  Tread carefully here people.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "DonTheOrangeMoron",
        "time": "2 days ago",
        "context": "Is this another Trumpy failed business venture?",
        "good": "0",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "digitalage4wokenbroke",
        "time": "2 days ago",
        "context": "I use duckduckgo and it protects your privacy. Absolutely do not use Google. There's plenty of other free search engines that give you the same result and don't give Lib owned Google 1 penny.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "gravoid",
        "time": "2 days ago",
        "context": "Just added FreeSpoke to my search line-up.  Nice to have several alternatives.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "iceload",
        "time": "2 days ago",
        "context": "The add results were always listed first but there was only two or three, now there are two pages before you get to legitimate responses. Google has become just a marketing tool, they went from \"do no evil\" to \"anything for a buck\".",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ididntdonuthin",
        "time": "2 days ago",
        "context": "I wonder if Freespoke will be \"like\" the best search engine ever, \"like\" will it only return \"like\" results that \"like\" support my agenda? I mean will it \"like\" weed out \"like\" all of the leftist \"like\" garbage?",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "s.tex.bears",
        "time": "2 days ago",
        "context": "How do get rid of google? It's on my PC, laptop, and phones?\nI hate it",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jayjjacob",
        "time": "2 days ago",
        "context": "liars",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "wuwei205",
        "time": "2 days ago",
        "context": "Why not just take down the phony fiat currency dynasty. Return ALL the I’ll gotten gains to the commonwealth and enact laws that never allow for it to happen again. We will never be a free nation if we allow a private institution to issue us debt.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "americanshark",
        "time": "2 days ago",
        "context": "Oh yeah..another Black President....NOT",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "itsengineering",
        "time": "2 days ago",
        "context": "Leave it to Republicans to create a \"free speech\" platform that caters to conservatives only and censors certain information. That is hilarious.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "greggybadmitten539",
        "time": "2 days ago",
        "context": "Lol well this is going to be an enormous waste of this dudes money 😂",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Leopold*Klopp",
        "time": "2 days ago",
        "context": "if you think for one second that there are services that protect you\nyou are so terribly incorrect\nthe second you hit the power button to on and begin to use which ever internet you use\nyou and most everything about you is exposed to the world.... NO EXCEPTIONS",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "godawgs1972",
        "time": "2 days ago",
        "context": "Google and free speech should never be in the same sentence.",
        "good": "7",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Brandon's_got_what_plants_crave",
        "time": "2 days ago",
        "context": "Thought about trying it, then saw Rickett's is part owner of the Chicago Cubs.  As a Cardinals fan, I just can't bring myself to support this endeavor.\n\nKIDDING!\n\nWhat he needs to do now is to get a map service going and to make Freespoke a more robust alternative to Google's services.  Good on him, and GO CARDS!",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Eirik_Finn",
        "time": "2 days ago",
        "context": "Partisan founded = partisan contaminated results. Avoid this unless you truly love living in your echo chamber.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "marvinshort1953",
        "time": "2 days ago",
        "context": "With the number of search engines out there and someone thinks we need another one?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "republicansaretraitors",
        "time": "2 days ago",
        "context": "and by \"Free speech\" they mean uncensored hate speech, lies, conspiracy theories and racism, of course",
        "good": "3",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "historyguy99",
        "time": "2 days ago",
        "context": "I just searched NRA in google and it was the first hit.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dgmnb",
        "time": "2 days ago",
        "context": "\"No one officially ever bestowed upon Google and Twitter and Facebook to say, ‘This is what people ought to see and this is what people ought not to see,’ but they've kind of taken it upon themselves to do that,\" he said. \"I just think at a certain point, that becomes very dangerous.\"\n\nSo he's only in favor of free speech that he agrees with. Typical.",
        "good": "1",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "stopcrnpop",
        "time": "2 days ago",
        "context": "I just checked out Freespoke. It seems they are not being exactly a beacon of truth in advertising as they do censor content they deem inappropriate. Even as I am in agreement with the inappropriate nature of the content they have mentioned, I do not agree with a media platform to announce themselves as an advocate of free speech, even though they are going to be picking what is to be allowed.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "zugdog",
        "time": "2 days ago",
        "context": "Let’s face it: Google, Facebook and Twitter are destroying our society and culture. \nAnd the latter two siphon away BILLIONS of hours of American productivity. 👹🤬👹",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "NoMaskRequired",
        "time": "2 days ago",
        "context": "Brave, is another goog alternative to google",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "davegreen50",
        "time": "2 days ago",
        "context": "More competition is a good thing. Keep it coming. It's going to end up where these apps become polarized, but that's okay. Certainly beats the alternative.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "hammer4481",
        "time": "2 days ago",
        "context": "The Foster home thing in every state is a racket where kids are abused many different ways--often medically kidnapped by lying doctors for ulterior motives.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "feetpizza",
        "time": "2 days ago",
        "context": "Google “white inventors” and then go to images tab. Enjoy all the POCs. Edison and Tesla are there of course, but you have to scroll to find any obscure white people that really isn’t relevant. ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Ancientalien180",
        "time": "2 days ago",
        "context": "Freespoke has more censorship than duck duck go, and probably google as well. 🤨 Doesn't sound like freespoke supports free speech.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "arthur59",
        "time": "2 days ago",
        "context": "Got to live the people thinking that because their search engine isn't spitting back the lies they want to hear their freedom of somehow being restricted.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dsrknows817",
        "time": "2 days ago",
        "context": "Freespoke sounds great.  Will look it up.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "toxicnut1",
        "time": "2 days ago",
        "context": "Google helped in the coup of President Trump.  They should be executed.   ",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "donmartin'sbigtoe",
        "time": "2 days ago",
        "context": "You can't properly rank a lie, so if Republicans would stop lying so much, they'd rank better.",
        "good": "0",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "jeffelkins",
        "time": "2 days ago",
        "context": "Duck duck go is already out there and has been for years!  I prefer that browser over google for many reasons!  The main is because I don’t trust google!",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Wildbill46",
        "time": "2 days ago",
        "context": "Use Duck Quack Duck {or something like that).",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "byebyedimocratsinnovember",
        "time": "2 days ago",
        "context": "Freespoke:  No censoring!!!\n\nAlso Freespoke:  No pornpgraphy!!!\n\nSo, only censoring the stuff you don't like.  How are you different from Google again?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jojowasaman2",
        "time": "2 days ago",
        "context": "About time. Will definitely give it a go.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "oldwhiteguynj",
        "time": "2 days ago",
        "context": "All Q all the time.  Cause Truth Social was such a great success. It will appeal to the far right and no one else.  Best of luck.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mtwallet526",
        "time": "2 days ago",
        "context": "If you are still using Google, then you haven't changed the search settings of your browser. I prefer Duck duck go. But then to each his own right.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Eirik_Finn",
        "time": "2 days ago",
        "context": "Use Duck Duck Go. Free. No ads. No tracking.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "patriotforever937",
        "time": "2 days ago",
        "context": "Best news all day. Support these websites and stop using the Marxist propaganda sites. This is the only way.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dianef.",
        "time": "2 days ago",
        "context": "Even though Google is what it is, there's that great catchy name. If anyone wants to know something the phrase is always \"Just Goggle it\".",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "canadalady",
        "time": "2 days ago",
        "context": "315 posts from people that don't understand how a search algorithm works.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "billbuxmann",
        "time": "2 days ago",
        "context": "I'm sure it'll be as successful as Truth Social and DDG.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "usaf463050",
        "time": "2 days ago",
        "context": "This article just made Todd Ricketts a boat load of money. Everyone who thinks that free speech is under attack will now be using his search engine. It's a brilliant idea, offer the supposedly disenfranchised what they think they need and you're in business. He's doing it for the money, nothing else.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "oamot798",
        "time": "2 days ago",
        "context": "They need an alternative to YouTube.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jda3689",
        "time": "2 days ago",
        "context": "I've noticed the left-slant when I search on Google.  I've seen results come back and wonder why it is showing me this  because it's not what I searched for.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "conservative.voice.of.reason",
        "time": "2 days ago",
        "context": "Google is over.  Everybody is flocking to Bing, where the Truth network thrives.",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "polcat",
        "time": "2 days ago",
        "context": "Thanks everyone.  I'd never heard of DuckDuckGo.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "19inchpythons",
        "time": "2 days ago",
        "context": "I'll give it a go. I was trying qwant but it's still too t♦rded for me. So long as it doesn't show t♠rded wiki results, It may become my goto.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Iclimbedthemountain",
        "time": "2 days ago",
        "context": "Probably not going to be many libs sign up as they are steadfastly against the first and second amendments ... they want to hear their bias and nothing else.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "wall2020",
        "time": "2 days ago",
        "context": "YouTube is even more blatantly pushing their views / propaganda. How many times will they show that Louisiana  gun wielding lady superimposed over unrelated scenes, or the Republican negativity they enjoy pushing for google.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tired_of_this535",
        "time": "2 days ago",
        "context": "\"\"We're trying to like, you know, give people a free speech search engine.....\n\nAdmirable, but one of the first things this guy should search for is a grammar school.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "DonTheOrangeMoron",
        "time": "2 days ago",
        "context": "It’s good that the Radical RepubliQans think there is privacy’s on this search engine.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "geronimo261",
        "time": "2 days ago",
        "context": "They always start that way. And then.......well we all know now.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "eddiefast4321",
        "time": "2 days ago",
        "context": "Without their lies, suppression of free speech, censorship and media manipulation, Dems have Nothing!",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "john_cocteausten",
        "time": "2 days ago",
        "context": "That's what Truth Social said, too. Then they started banning people who said things they didn't agree with.",
        "good": "1",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "PKTeamMember",
        "time": "2 days ago",
        "context": "\"Diversity\".  There's that evil word !  OMG !",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Tristan888",
        "time": "2 days ago",
        "context": "Google is runs the DNC!!!!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dave7865909",
        "time": "2 days ago",
        "context": "I sure hope Freespoke is as much of a roaring success as Truth social is hahahahaha.",
        "good": "2",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "southofnowhere",
        "time": "2 days ago",
        "context": "Duck Duck Go is the way to go.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "commonsensecomment",
        "time": "2 days ago",
        "context": "Have they been raided yet for being threats to the communism takeover?",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "wildbillofohio",
        "time": "2 days ago",
        "context": "Yeah, let's wait and see. So did Twitter and Facebook. Until enough subscribers join and the boot does it's magic....! No trust here. Data collection and Social Media scoring probably for the CCP!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "civilwar2020",
        "time": "2 days ago",
        "context": "Ricketts should like, you know , focus on the Cubs not sucking, like an owner should.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "donmartin'sbigtoe",
        "time": "2 days ago",
        "context": "So you're still looking for a platform that will treat your lies just the same as the truth?",
        "good": "0",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "solipsistic_journey",
        "time": "2 days ago",
        "context": "Freespoke is not biased in any way.  You can tell by looking at their recommended topics.  For example, the politics list starts out with:\n\"The Squad\"\nThe Cost of Green Energy\nMonkeypox\nWhat is 2000 Mules?\nGas and Grocery Prices\n\nNope.  No bias there.",
        "good": "1",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "fredie",
        "time": "2 days ago",
        "context": "I remember when DuckDuckGo made those promises.\nThen they bought into the whole \"Russia disinfo\" narrative.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "conservative.voice.of.reason",
        "time": "2 days ago",
        "context": "And what is truth anyway?\nIf I believe in something, isn't it true to me?",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "kreature",
        "time": "2 days ago",
        "context": "\" part of a larger mission to bring Americans a family-friendly place to search and consume news and information.\" That's how it starts. Then there are more things to censor \"for the childrenz\".",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "pmgrant284",
        "time": "2 days ago",
        "context": "Am I the only one unable to connect to Freespoke from the Google Chrome web browser?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mackhess901",
        "time": "2 days ago",
        "context": "So putting a right wing spin on search results is somehow better? There are already search engine alternatives to Google that have absolutely no political connections at all. I'll stick to those.",
        "good": "0",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "mackhess901",
        "time": "2 days ago",
        "context": "Another advertisement disguised as a news article. FOX is getting worse by the day",
        "good": "2",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "bidenluvscommies",
        "time": "2 days ago",
        "context": "This guy can’t make a sentence with out “kinda, sorta, maybe.\n Just say it for crying out loud. Google does censor results & people are concerned about losing free spech.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Vae_Victus",
        "time": "2 days ago",
        "context": "Whenever I Google a search \"free speech\" I get a blank page. 🍻😏",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "hammer4481",
        "time": "2 days ago",
        "context": "Right, but I'm a little confused by you saying, \"Covid exists\" but are you referring to the faked genome \"v!rus\" which was pieced together by DNA banks? Going by the gold standard Postulates from 1890 that must be done in the lab experiment--no v!ruses exist and I do not accept germ theory anymore which includes the contagion myth--terrain theory is true, seen with our own eyes.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mississippivolunteer",
        "time": "2 days ago",
        "context": "Seems overloaded, I guess.  Zip results.  Sorry, Todd!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "brandont",
        "time": "2 days ago",
        "context": "Google and privacy are complete strangers ",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "smay",
        "time": "2 days ago",
        "context": "I went and tried out this search engine and typed in our local newspaper and it brought up no results.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "conellw",
        "time": "2 days ago",
        "context": "I've heard of google but never use it!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "HappyToDebate",
        "time": "2 days ago",
        "context": "The more the merrier I say, but Fox, why a story on Freespoke, but not on the largest Free Speech search platform out there, Duck-Duck-Go?\n\nI urge everyone out there to test any political search phrase at Google against Freespoke or Duck-Duck-Go.  You will be shocked and appalled at the difference.  On Google, all the leftist stuff rises to the top and what you were actually looking for is pushed down to page 35 or so.  The free speech platforms provide actual results - no matter the politics or popularity.",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jolee834",
        "time": "2 days ago",
        "context": "Google has always given results it wants you to have. Bing is no different. it's not just censorship it's control. Well have to vet this one carefully. Controlled control. it's like Twitter, rumble, gab, etc They keep all like minded ppl herded together. Easier to monitor you that way. ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "yashar",
        "time": "2 days ago",
        "context": "You'll need a lot more than just political motivation to compete with Google. You should either be a tech genius who is capable of creating something new at least as good as Google, or you should have tens of billions of dollars and hire brightest tech minds in the world to do that for you. Of course, there is always the possibility that Google destroys itself.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "badasswade",
        "time": "2 days ago",
        "context": "WAIT!!!!\nI thought Truth Social was the alternative to Twitter...😮",
        "good": "0",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "chrise416",
        "time": "2 days ago",
        "context": "I am sick of the word diversity. People have a right to live how and with whoever they want. Gays beat that drum daily. How come OK with them but not others?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "JoeHidingStriprlounge",
        "time": "2 days ago",
        "context": "I hope they bury google-  biased results, are obvious they only carry stories n articles they want to headline- hide the good stuff. They control what you see according to their censoring and political agenda or motives.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "timeforthedemstogo306",
        "time": "2 days ago",
        "context": "Why can’t congress legislate big tech into the compliance with the federal code? Common man…. Do your jobs! ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "demcommunist480",
        "time": "2 days ago",
        "context": "Anything related to Google is censorship!! DO NOT believe this!! We need to have a new operating system, applications and browser by a third party!! Apple, Microsoft, Google and Meta have all development in China so there is no freedom with these companies or their subsidiaries!",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mtcicero672",
        "time": "2 days ago",
        "context": "Free speech? strange concept! That is sarcasm lefties!",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "hammer4481",
        "time": "2 days ago",
        "context": "The truth about the scamdemic, _11 that was not terrorists, the mostly fake _kraine war which involves the reset. These are the main ones but there's much more. Hardly anyone realizes the gross amount of propaganda put out by Fox and all the other MSM outlets. I never go by feelings, Buckwheat, I'm 100% evidence-based; it is you that's brainwashed by the fake news.",
        "good": "0",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "notimefor",
        "time": "2 days ago",
        "context": "Free speech..., what a concept!  Why didn't anyone think of this before?  But wait..., they did!  About 250 years ago now.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "misterfixitup",
        "time": "2 days ago",
        "context": "Watch the documentary social dilemma...it'll open your eyes on what big tech is up to. It even scares the guys who created this big tech monster and now regret it.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Brandons18wheeler",
        "time": "2 days ago",
        "context": "Freespoke seems to work as advertised. I searched on \"Hillary Clinton\" with Freespoke and Google and the difference is amazing.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "hammer4481",
        "time": "2 days ago",
        "context": "True--I go to specific websites and doctors who show that Cov_d does not exist by the isolati_n process that was faked by v!rology--and we know what the real bioweapons are. PCR did not work and was debunked by the Corm_n-Drost_n Revi_w--by 2_ scientists who found 10 fatal errors--\"completely useless\" they concluded.\n\nI have been amazed at the sheer amount of misinformation put out by the government on many topics that is supported by Fox Fake News and the other news outlets. Fox censors just as much as Google does. I'll have to check this reply to see if it made it past these comm_nistic, anti-American, anti-1st amendm_nt censors.\n\nJust think, were their narrative true, there would be no need to censor any part of it, but we see that's not the case.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "hereiamagain",
        "time": "2 days ago",
        "context": "DuckDuckGo is my choice.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "elidamoskinos",
        "time": "2 days ago",
        "context": "I just \"signed up\" for Freespoke, and my Microsoft (business) email account filtered the email into my Junk folder.  When I tried to \"Move\" the email to Inbox... it just disappeared.  Coincidence?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "unipartysux",
        "time": "2 days ago",
        "context": "Hopefull SCOTUS will soon hear the case that ends the social media monopoly",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bwahahhhaaaahhhhaaaaaa",
        "time": "2 days ago",
        "context": "Just tried to use it at work and it's blocked.  Looks like Corporate America is on the take with this a s well.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "3250251240",
        "time": "2 days ago",
        "context": "Go Cubs!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "xolodog",
        "time": "2 days ago",
        "context": "What constitutes hate speech is debatable, but placing a gag on ideas through censorship can’t be seen an act of love.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "it'sme624",
        "time": "2 days ago",
        "context": "I use Duck Duck go.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Alotta.Anger",
        "time": "2 days ago",
        "context": "And they push \"Unconscious Bias\" lessons for their staff as long as it relates to \"racial bias\" and yet they never recognize they are falling victim to that same danger when it comes to \"philosophical bias\"",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "factsarefacts.",
        "time": "2 days ago",
        "context": "Thank God!!! We never have to hear conservatives crying about search results ever again!",
        "good": "1",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "JoeJoe🐰",
        "time": "2 days ago",
        "context": "You can't ONLY have JUST ONE perspective... I use Google, yes.. But, I also use Yandex to see what Google doesn't want you to see.\n\nRun the whole Ukraine bit through Yandex, and you'll rethink your position quick, after all the omitted Google search results come up.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "saysomething56",
        "time": "2 days ago",
        "context": "I would gladly pay for search that did not simply deliver links to the highest bidder.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "getrealdog",
        "time": "2 days ago",
        "context": "Google banned freedom of speech. I banned google.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "HighwayStar",
        "time": "2 days ago",
        "context": "This concept needs to spread to everything. Remember how Google, Apple, and Amazon conspired to destroy Parler? We also need a new store so we have an alternate to Walmart and Target.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "c19hoax",
        "time": "2 days ago",
        "context": "More lies....next",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "hammer4481",
        "time": "2 days ago",
        "context": "Correct--the bioweapons are the vaccines, anti-virals, monoclonal antibodies, which the FDA withdrew (too deadly)  and all developed and funded by the population control fake genius, Bill Gates.\n\nExcess deaths in '21 were all from the shot aside from some in ICU by ventilation and Remdesivir which destroys the kidneys, then the hospital gets 80 grand minimum for a fake CV death. Paxlovid, the pill is also designed to reduce the population which Fox said Biden and Fauci reported as well as 4 boosters each which are always water jabs for the camera\n\nAgree about virology--100% false. I learned to evaluate the isolation experiment studies and can determine what is real or fake despite the study's conclusion which can be a lie saying they \"found a v!rus\" when virology has done no such thing, ever.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "TrollingtheMediaPodcast",
        "time": "2 days ago",
        "context": "The first time I saw this was when a friend pointed out that if you Google Trump and Jeffrey Epstein photos of Trump and Jeffrey Epstein pop-up. If you Google Bill Clinton and Jeffrey Epstein 3 of the first 6 photos are Trump and Jeffrey Epstein. The funny thing is there’s no link to Trump and a huge link to Clinton in the Epstein escapades..",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "lonestarinbigd",
        "time": "2 days ago",
        "context": "The Fascist Democrats will find somè way to shut them down.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "c19hoax",
        "time": "2 days ago",
        "context": "Google and Free speech should never ever be in the same sentence",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "akpaul49",
        "time": "2 days ago",
        "context": "I like considerd it but like wasn't able to like figure it out.  I decided it was like just easier to like not do it.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "factsarefacts.",
        "time": "2 days ago",
        "context": "Freespoke is a joke.  It tags conservative politicians and shows right wing media as a priority is all.  But if you search for Disney you just get results which are all to buy Disney products.  No mention of DeSantis anywhere in the Disney results.\n\nFreespoke is just an open source free search tool with specific right wing politicians tagged to have right wing media stories appear first.",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "testingtesting",
        "time": "2 days ago",
        "context": "There are already alternatives but one more is always welcome.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "thinkforyourselfnotaboutyourself",
        "time": "2 days ago",
        "context": "In other words, Ricketts is creating another echo chamber for right wing conspiracy theories and half-truths. Great.",
        "good": "0",
        "bad": "8",
        "replies": []
    },
    {
        "user_name": "TheChief785",
        "time": "2 days ago",
        "context": "Don’t trust Google. It is in cahoots with the progressive liberals to identify and eventually eliminate any one who dis agrees with them.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "shawng863",
        "time": "2 days ago",
        "context": "I typed nra into Google and the first site that came up was a link to join the NRA.  Not sure what this article is talking about.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ah40",
        "time": "2 days ago",
        "context": "Don't apologize for censoring pornography. It's the moral thing to do.",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "NunSuch931",
        "time": "2 days ago",
        "context": "I haven’t used Google in years. I switched to DuckDuckGo.",
        "good": "15",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "snowflakemaker",
        "time": "2 days ago",
        "context": "speakeasy or freespeak....better names.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "yugekack",
        "time": "2 days ago",
        "context": "A full hate-speech echo chamber just for Conservatives and Republicans. Bravo. ",
        "good": "1",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "it's-ame,mario!",
        "time": "2 days ago",
        "context": "Why don't you freespoke that?, nope, it doesn't have the same ring as google.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cegg",
        "time": "1 day ago",
        "context": "I'll have to check Freespoke out.  Can't wait to get away from Google especially since the cooperate with the CCP.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Don'tMessWithTexas247",
        "time": "2 days ago",
        "context": "I noticed the same with Google...then went to DuckDuckGo, found the Conservative postings that were not found on Google.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "hmelton",
        "time": "1 day ago",
        "context": "...and google will stockpile everything you offer up and keep it saved for decades to come back and haunt you later.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Ancientalien180",
        "time": "1 day ago",
        "context": "Cash grab💰💰💰",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "afreeman",
        "time": "1 day ago",
        "context": "\"I felt like I just wasn't getting results that I expected\" ----- Your boy says this and then follows it with acusing google of being bias. --- Just how clueless has the average conservative become regarding his own bias? \n\nI didn't get what I wanted so it must be wrong ! Lol",
        "good": "1",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "nonserviam(neverreadsreplies)",
        "time": "1 day ago",
        "context": "but Google's algorithm has assured them that people don't want free speech, diversity of opinion, or privacy; and it's also assured them that it's never wrong",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "StandWithUkraine166",
        "time": "1 day ago",
        "context": "I like the Freespoke model, it's not bad at all.  They also seem to be pretty fair labeling things \"Left\" and \"Right\" and \"Middle\" which is nice. \n\nTheir privacy policy is not bad either.  \n\nOverall, it seems like they are on the right track.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "DeProgrammedNeanderthal",
        "time": "2 days ago",
        "context": "Funny how conservatives just imitate real tech and play the free speech card. Where is parler?",
        "good": "1",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "awsome1",
        "time": "1 day ago",
        "context": "DuckDuckGo is my default search engine and I see no reason to change!",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bidenmytime799",
        "time": "1 day ago",
        "context": "I don't think people get it.  We don't want our search results to be politically biased in any direction.",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sunsearay670",
        "time": "1 day ago",
        "context": "If Google suggested it - then they have to be a part of it and still see what people post!!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "TrueAmerican1",
        "time": "1 day ago",
        "context": "Don’t trust Google or any other social media platform.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "koloa",
        "time": "1 day ago",
        "context": "I'm searching for information and what I get is page after page of sales pitches, and that's from all the search engines. What a waste of time and bandwidth.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "conservativevetran",
        "time": "1 day ago",
        "context": "Duck Duck Go works good for me, I can always find things that the left leaning sights won't show",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Jnick223",
        "time": "1 day ago",
        "context": "I downloaded it on my phone and I did a search, lies made up about Trump. I tried several different versions of that search, and all that came up with stories from the Washington Post, New York Times, Vanity Fair, etc. I deleted it off my phone. Same thing as Google!",
        "good": "0",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "Rossi46",
        "time": "1 day ago",
        "context": "blah, blah, blah - join truth social and criticize bunker bonespurs - you'll be locked out or your profile will be deleted. same goes for mypillowguys site - can't take the lords name in vain or the same thing will happen. righties talk about free speech but never back it up.",
        "good": "2",
        "bad": "8",
        "replies": []
    },
    {
        "user_name": "Don'tMessWithTexas247",
        "time": "1 day ago",
        "context": "Dems are still trying to use AltaVista.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "fightthefarleft",
        "time": "1 day ago",
        "context": "Uh oh.  The Marxist tyrants running our country aren't going to like this.  Expect frivolous lawsuits.  We can't have people using the Bill of Rights against the woke mob.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "freddyfour20",
        "time": "2 days ago",
        "context": "I haven’t “googled” anything in years. In the future it won’t matter. All phones track people and cars will soon do the same.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "1969veteran",
        "time": "1 day ago",
        "context": "Finally, someone supporting free speech in America. We used to have till the woke minorities started messing things up.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Musketeer",
        "time": "2 days ago",
        "context": "Have you noticed the accuracy and content of Google searches has been dumbed-down to make the end user of the data become just as low IQ'ed as the search results?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "NorCalPatriot",
        "time": "1 day ago",
        "context": "Good for you!  I'm trying it.  I never use \"Them.\"  I was using Swiss Cows, but I believe they were bought out by MS or Google.  It also thinks it knows what you are searchng for and \"types\" for you too much.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tennrn",
        "time": "1 day ago",
        "context": "Seems like riots and burning have qualified for free speech for the past few years.  But we need a new platform to express opinions contrary to liberal-speak",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "zzzzpugzzzz",
        "time": "2 days ago",
        "context": "Inconvenient truth. All search engines including DuckDuckGo use either Google or Microsoft as the backbone for their search engines. Perhaps these alternatives can just not filter or skew the search results. I dont trust the backbone search providers to not alter things at that level though.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "light101",
        "time": "2 days ago",
        "context": "\"Diversity of thought.\" Diversity usually means for blacks.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "presidentmerkinmuffley",
        "time": "1 day ago",
        "context": "I’ve been using brave search for a while.  Pretty happy with it so far.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ChuckJones",
        "time": "1 day ago",
        "context": "At last! Kudos to Todd Ricketts!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "imsogayicantevendrivestraight",
        "time": "1 day ago",
        "context": "I use Mojeek when I want to get around the Google filters.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tompost",
        "time": "1 day ago",
        "context": "Google is a female, because it doesn’t let you finish your sentences before making a suggestion",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "listentopeople",
        "time": "1 day ago",
        "context": "I will change to duck duck go and free spoke now. anything is better than google.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "douglasg",
        "time": "1 day ago",
        "context": "I went to the web site, upon reading this article. I spent time trying to search various subject, both democrat and republican. I could find little difference between google, duckduckgo, and this one. It through up web pages not related in way to what I was searching for. Also, add to that, there was very little information that came up. Granted that I was relieved not to see endless sites that promoted everything, but what I was looking for, there should have still been more information found. Until they can actually search and find data, and get rid of the sites that are either click bait or have absolutely nothing to do with what you are searching for, it is not a viable solution to any of the other search engines. I was really really hoping that it would be.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ProV1970",
        "time": "1 day ago",
        "context": "Interesting! Ill give it a try",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "njp109",
        "time": "1 day ago",
        "context": "Does Todd ricketts believe that Nazis should have a right to free speech?",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "FlipsyRussell",
        "time": "1 day ago",
        "context": "Free speech? The fascist lefties will hate that.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tonysofla",
        "time": "1 day ago",
        "context": "Maga's send all your money, who cares it's a money losing endeavor.\nTruth Social getting its plug pulled any week now, lol.",
        "good": "1",
        "bad": "8",
        "replies": []
    },
    {
        "user_name": "irish1679",
        "time": "1 day ago",
        "context": "It would be awesome to have a platform where you don’t have to conform to the rigid views of the far right with their need to control what people read, think , or say.",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "ThinkingAdult624",
        "time": "1 day ago",
        "context": "This is great but so late to the table it probably cannot survive against the behemoth of GOOGLE that is supported by the leftists, the Chinese and other LIBERTY hating factions. I sincerely hope this platform gains some foothold but am doubtful of it's success because it is probably to late as are so many of conservative actions because they fail to act on real threats until they are backed into a corner due to sloth, cowardice and the fecklessness of the leaders who value their personal portfolios and perks far more than the good of their voters!!!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dneaster",
        "time": "1 day ago",
        "context": "Time will tell,a truly open forum would not be a negative,and welcomed by many!! Good luck!!",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "gig73",
        "time": "1 day ago",
        "context": "They support none of the three!!!! LIARS!!!",
        "good": "0",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "manwithnocountry",
        "time": "1 day ago",
        "context": "Lies.  Don't fall for it, people.  None of the sites are trustworthy.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "donewiththat",
        "time": "1 day ago",
        "context": "I hope Ricketts website succeeds. But if it ends up being another echo chamber like Truth Social or Qnon nonsense, it's doomed to fail.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "templarknight484",
        "time": "1 day ago",
        "context": "yes!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "SmartPerson99",
        "time": "1 day ago",
        "context": "Google, FB, and others tell their employees to never admit or tell who they work for. Maybe it's time to start exposing them.. If you work for the Nazis, YOU are a Nazi. Who cares who \"runs the show\" when you can just start dealing with their employees an work your way up.... Somebody should hack and release a list of these companies employees.",
        "good": "5",
        "bad": "0",
        "replies": []
    }
]