[
    {
        "user_name": "dwjtx",
        "time": "7 May, 2021",
        "context": "Obviously not real! Haven't seen a single little green person yet!",
        "good": "6",
        "bad": "0",
        "replies": [
            {
                "user_name": "Schattenkrieger",
                "time": "7 May, 2021",
                "context": "maybe they aren't green and you can only see them on infrared?",
                "good": "6",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "markr83",
                        "time": "7 May, 2021",
                        "context": "If they as they identify as green they are green!",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "widethoughts",
        "time": "7 May, 2021",
        "context": "What makes it a helicopter instead of a drone?",
        "good": "2",
        "bad": "0",
        "replies": [
            {
                "user_name": "Schattenkrieger",
                "time": "7 May, 2021",
                "context": "spelling.",
                "good": "7",
                "bad": "0",
                "replies": []
            },
            {
                "error": "error"
            },
            {
                "user_name": "emilypearson",
                "time": "8 May, 2021",
                "context": "It is both.",
                "good": "1",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "widethoughts",
                        "time": "9 May, 2021",
                        "context": "No doubt it is a cool accomplishment, but what is the criteria that makes them both? Not arguing....just trying to understand why they call it a helicopter.",
                        "good": "1",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "emilypearson",
                                "time": "9 May, 2021",
                                "context": "It’s a helicopter because it gets lift from rotary wings. It’s a drone because it’s an unmanned aircraft that flies autonomously .",
                                "good": "1",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "nugulator",
        "time": "7 May, 2021",
        "context": "It can't get stuck in a tree. That's the most common demise.",
        "good": "12",
        "bad": "1",
        "replies": [
            {
                "user_name": "thunker54",
                "time": "7 May, 2021",
                "context": "I fly RC airplanes for a hobby.  The #1 rule is to avoid the edge of the air.  That includes trees, buildings, space, water and the ground.  As long as you avoid those areas, you don't have to worry about crashing.   <joke>",
                "good": "2",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "skeff",
                "time": "8 May, 2021",
                "context": "Or windmills, or skyscrapers or power lines. But give us time... 😐",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "rayj785",
        "time": "7 May, 2021",
        "context": "JPL has some seriously good engineers!",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "BuckFoeJiden",
        "time": "7 May, 2021",
        "context": "I am impressed NASA! Well done!",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Colo805",
        "time": "7 May, 2021",
        "context": "it is part of the southern border security or wasted money that should have been spent there",
        "good": "1",
        "bad": "3",
        "replies": [
            {
                "user_name": "thunker54",
                "time": "7 May, 2021",
                "context": "NASA's 2020 budget was 0.47% of the total federal budget.",
                "good": "2",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "Colo805",
                        "time": "8 May, 2021",
                        "context": "2% too much",
                        "good": "0",
                        "bad": "2",
                        "replies": [
                            {
                                "user_name": "thunker54",
                                "time": "8 May, 2021",
                                "context": "I'm sure that will happen now that SloJoe is in.  Glad to know you think that 0.47% is only 2% too much, and that if it was cut only 2% you'll be happy with NASA's chicken feed that gets tossed that way.\nLetsee - 0.47% less 2% is .4606%.   See? We weren't that far apart after all  !Just tweak it down 2% and everybody is happy again!",
                                "good": "2",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "Colo805",
                                        "time": "8 May, 2021",
                                        "context": "try to keep up, maybe drinking all that Tang has hurt your quantitative skills, 2% of the federal budget is billions of dollars",
                                        "good": "0",
                                        "bad": "3",
                                        "replies": [
                                            {
                                                "user_name": "thunker54",
                                                "time": "8 May, 2021",
                                                "context": "I said the budget was 0.47%.  You said that was 2% too much\n2% of 0.47% is .4606%.   Simple math.  You should have learned it by 6th grade.\nNASA has NEVER had \"2% of the Federal budget\" - never.",
                                                "good": "4",
                                                "bad": "0",
                                                "replies": []
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "RedScissors",
        "time": "7 May, 2021",
        "context": "Yeah science",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "historian326",
        "time": "7 May, 2021",
        "context": "Look, I am proud of NASA and must say that it is really catching up. However, I must warn NASA that if their drone hits my space yacht - NASA will hear from my lawyers.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "wisemountainape",
        "time": "7 May, 2021",
        "context": "Think about this. This is one of mankind's greatest scientific accomplishments and it's the 35th story on the Fox news web site. Supplanted by stories of mask nazis, child porn perverts, petty criminals holding up banks, and the leading story of Biden's mouth piece potentially quitting her job.\n\nNo wonder American kids are more interested in social media and smut than STEM.",
        "good": "20",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "DeplorableWhiteGuy",
        "time": "7 May, 2021",
        "context": "Just curious what happens if the little helicopter falls over. Doesn’t look very stable.",
        "good": "3",
        "bad": "0",
        "replies": [
            {
                "user_name": "Schattenkrieger",
                "time": "7 May, 2021",
                "context": "someone has to go out there and set it up right again.  duh.",
                "good": "5",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "slacktoad",
                "time": "7 May, 2021",
                "context": "The rover has a robotic arm that can put it upright, given a fair amount of planning.",
                "good": "2",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "thunker54",
                "time": "7 May, 2021",
                "context": "They said long ago if anything went wrong it was all over.. The ONLY mission this little thing had was to see if flight could be achieved on another planet.  So seeing how stable it would be was all part of the whole mission.  It was only meant to collect data to see how/if better designed such drones could be used in the future.",
                "good": "2",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "skeff",
        "time": "8 May, 2021",
        "context": "Fly away, little fledgling, fly! 🙂 🐣🐥🐤",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "nepawoods",
        "time": "8 May, 2021",
        "context": "This is the best idea Donald Trump ever came up with.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "fakeitgoodnasa",
        "time": "8 May, 2021",
        "context": "\"Do people still believe in this fish tale?\".. (Jim Carrey re. Nasa).",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "michaelmorrow",
        "time": "8 May, 2021",
        "context": "There should simply be a Human Space Program, have all nations work together. We need to bring Humanity to Earth Like Worlds and to adapt Humanity and everything we bring with us to those Worlds. There's no sense pretending that the nations of Earth are going to colonize new Earth Like Worlds, though.\n\nNo nation on Earth will ever have authority on any ELW, because there's no practical means of enforcing authority over an ELW. Even if you send unmanned space vessels to teach the Humans on an ELW a lesson, you'll never live to find out what happens, your USV's might not even reach that ELW before the total collapse of your nation on Earth.\n\nTo get to ELWs, Humans will travel in Generation ships. Entire generations of Humanity will spend their entire lives on these Generation Ships. By the time Humans get to one of these ELW's, they will be their own people. And over time, the differences between Humans on Earth and Humans on one of these ELW's will increase. By a process of random mutation and adaptation, the evolution of mores and so on, Humans on ELW's will differ from Humans on Earth, in all kinds of ways.\n\nEven if Humans on an ELW speak English, they will develop words we don't have on Earth, to describe things that simply don't exist on Earth. In any way and every way, Humans on ELW's will eventually come to be their own people. And they will live in their own nations, according to their own mores, well beyond the practical reach or authority of the nations of Earth.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "StrengthOfTen",
        "time": "9 May, 2021",
        "context": "Waiting for some video of an angry Martian walking up to it and yelling, \"Get this thing off  my property!\"",
        "good": "3",
        "bad": "0",
        "replies": []
    }
]