[
    {
        "user_name": "RedState798",
        "time": "12 September, 2022",
        "context": "Cankles Clinton is a National Treasure, I just wish someone would bury her.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ucfcpa83",
        "time": "12 September, 2022",
        "context": "Ha, the trump cult is so desperate they dug up Hillary, too funny",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "stonetalons",
        "time": "12 September, 2022",
        "context": "Clinton campaign mocks Catholics, Southerners, 'needy Latinos' in emails\n-- The Washington Times    October 2016\n ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "R3K475",
        "time": "12 September, 2022",
        "context": "Of course Hillary wouldn’t lie, her private server didn’t have any emails “after” bleach-bit… she also didn’t want her other criminal activities to come to light in her “election interference” with her fake dossier… there are many criminals in our government or former government workers. The threat of Trump discovering and revealing these criminal activities is what continues to drive the Democrat’s actions against him. We need a restoration of our Constitution. Bill of Rights, and correctly enforced laws by our judges, FBI, and other institutions.",
        "good": "77",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "ledeepstatecestmoi",
        "time": "12 September, 2022",
        "context": "Jonathan Turley is an American treasure!!! Really. I ain’t lying. Honest. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tupperhouse",
        "time": "12 September, 2022",
        "context": "But, but, they have fact checkers.",
        "good": "14",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "conservativeteam",
        "time": "12 September, 2022",
        "context": "Hillary Clinton is radicalized.  She promotes hoaxes and untrue narratives, and she is working with a vast left-wing conspiracy.  The Russia Hoax was false, the Democrats and Hillary colluded with MEDIA to brainwash a nation, it worked, some really duped people still believe Trump was colluding with Russia.  Hillary and her house of horrors in NY State was never raided, when it was determined she was hosting an unsecured server housing classified materials.",
        "good": "56",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "voting4trump2024",
        "time": "12 September, 2022",
        "context": "Comey said 110 emails in 52 email chains discovered on Clinton’s unauthorized server were classified at the time they were sent or received, including some that were “top secret.” He also said that while the probe did not prove Clinton's server was hacked, it may have been - and he pointedly noted that she used unsecure devices while visiting countries hostile to the U.S.",
        "good": "105",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "armymominga",
        "time": "12 September, 2022",
        "context": "Clinton destroyed evidence which was already under court order.  That is the crime.",
        "good": "12",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "k462036",
        "time": "12 September, 2022",
        "context": "Yes,,,, and another... Bill was never with Monica...",
        "good": "14",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ray__haney",
        "time": "12 September, 2022",
        "context": "She is best ignored.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "happyending4u",
        "time": "12 September, 2022",
        "context": "When Hillary was asked about bleach-bit she said, \"is that like Windex or something?\"",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "acarl007",
        "time": "12 September, 2022",
        "context": "Liberal Media machine dishonest bias on behalf of the democrat party\nIs the most destructive element in American society ",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "316",
        "time": "12 September, 2022",
        "context": "Trump never destroyed any materials that were under subpoena.  Hence endth the inquiry.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jimartphoto635",
        "time": "12 September, 2022",
        "context": "The media is not afraid of calling out her dishonesty, they are afraid of losing their jobs. they know what and who they are dealing with. She should have been long gone years ago!",
        "good": "37",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "clearthinking936",
        "time": "12 September, 2022",
        "context": "shouldn't the headline be, MEDIA CONTINUES TO SHOW TRUE COLORS AGAIN AND AGAIN...?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "letitdrain",
        "time": "12 September, 2022",
        "context": "If a democrat is talking they are lying,  it must be in their DNA!",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "happyending4u",
        "time": "12 September, 2022",
        "context": "Hillary had more emails on Yoga than all the Yoga instructors in NYC that have been teaching for 30+ years!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "toolgrinder919",
        "time": "12 September, 2022",
        "context": "My God, she gets uglier every day ",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "hawkish46830",
        "time": "12 September, 2022",
        "context": "No, Mr. Turley, you are wrong--Hillary Clinton most assuredly should be charged and jailed for her CRIMES.  She lied to Congress about all of it, and continues to lie about it now.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "miguel_sanchez43",
        "time": "12 September, 2022",
        "context": "the only thing this hideous creature is good at is twisting the truth.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "camdenite",
        "time": "12 September, 2022",
        "context": "The truth is that twenty two of those emails contained information so top secret and sensitive that they can never be released ever, not even if redacted.",
        "good": "34",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "thatchief",
        "time": "12 September, 2022",
        "context": "If Hillary Clinton's behavior is really as bad as Fox would lead us to believe- then isn't it odd that Donald Trump, our \"law and order president\" did nothing about it?  \nI mean, one of Trump's campaign promises was that she'd be in prison.  We all chanted \"lock her up\", but nothing happened.  There were THREE different investigations into Clinton under Trump's watchful eye, and no charges were filed.\nYou gotta wonder: why is Trump so absolutely impotent when it comes to the most important things?  Why is it Trump's DOJ couldn't figure out how to get Clinton, but those same people Trump appointed look like they're going to take the orange man down. ",
        "good": "1",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "unconservative",
        "time": "12 September, 2022",
        "context": "If it's OK for Donnie, it's OK for Hillary. Down with Republican double standard!",
        "good": "1",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "Allie007029",
        "time": "12 September, 2022",
        "context": "The media is as corrupt as Hilary Clinton. ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "glsfbg",
        "time": "12 September, 2022",
        "context": "She was extremely careless. No reasonable prosecutor would file charges. The Comey version of \"It depends what the meaning of the word \"is\" is.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "readingglasses",
        "time": "12 September, 2022",
        "context": "when Hillary says \"hello\" it needs to be fact checked. ",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Cancled",
        "time": "12 September, 2022",
        "context": "When they say truth over facts, they mean their truth from the department of misinformation ",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "pointle",
        "time": "12 September, 2022",
        "context": "The silence is deafening…..\nDem policies have…..\n1)     Opened our borders to the largest invasion in our history of criminals, terrorists, COVID carriers, the unvaccinated, drug dealers and more.\nAnd the Dems say nothing…2)     Damaged the oil industry severely causing a worldwide economic crisis.\nAnd the Dems say nothing….\n3)     Created numerous, useless and ineffective mandates that started a worldwide economic crash, didn’t slow COVID, destroyed industries and cost people jobs\nAnd the Dems say nothing….\n4)     Closed schools, damaged education and continues to be a blight on millions of children nationwide even though children are virtually unaffected by COVID.\nAnd the Dems say nothing….\n5)     Released violent criminals to committhousands of heinous murders and millions of other crimes.\nAnd the Dems say nothing….\n6)     Allowed thousands to commit numerous felonies burning medical facilities and churches, openly threaten judges, violently attack free speech\nAnd the Dems say nothing….\n7)     Caused violent riots, arson vandalism, looting, assaults and murder nationwide\nAnd the Dems say nothing….\n8)     Removed, demonized, attacked, undermined, and threatened parental rights even trying to get parents listed as domestic terrorists by the FBI\nAnd the Dems say nothing…. \nAnd the silence is deafening….",
        "good": "63",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "CptVonTrapp",
        "time": "12 September, 2022",
        "context": "The word is LIE not FALSEHOOD.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mrmick",
        "time": "12 September, 2022",
        "context": "Technicalities are by far the weakest form of argument and justification. Hilary and her staff played fast and loose with classified information and was able to get away with it without so much as an official reprimand, much less any kind of legal punishment.  \nI am sure that she thinks of herself as quite smart for being able to pull the wool over the eyes of the American people and to come out smelling more or less like a rose.  I hope she enjoys her triumph.  \nHer days is coming.  The time will come when she will get her comeuppance.  God may not be so forgiving. ",
        "good": "60",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "trommo",
        "time": "12 September, 2022",
        "context": "Trump's DoJ had 4 years to \"lock her up\" and did nothing",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "PeterG",
        "time": "12 September, 2022",
        "context": "Hillary is more crooked than Lombard Street in San Francisco ! For the uninformed, that’s the self-proclaimed “crookedest street in the world”.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jformaga",
        "time": "12 September, 2022",
        "context": "Was the FBI really the Clinton's personal 'Hit\" team if you went against them?",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "leonard712",
        "time": "12 September, 2022",
        "context": "Hillary is a proven, accomplished liar whose legal training taught her exactly how to skate on the thin ice between truth and falsehood even to the point of getting away with deleting subpoenaed documents. Thank God she was never president, Her sec state crimes said it all.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "icarus_airways",
        "time": "12 September, 2022",
        "context": "FHRC",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Immunefrommicrochips835",
        "time": "12 September, 2022",
        "context": "She had a SCIF (Sensitive Compartmented Information Facility) I would assume that she would be handling highly classified information or their wouldn’t have been the need for a SCIF. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "roadsterred3",
        "time": "12 September, 2022",
        "context": "The Media are all in when it comes to supporting Hillary.\nHowever, their credibility is no longer held in high regard by the American people even though they may think so.\nConstant lying to the American people is no longer working.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "abandonsocialmedia",
        "time": "12 September, 2022",
        "context": "Government bullhorns the lies and whispers the retraction. ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "independent-voter-666",
        "time": "12 September, 2022",
        "context": "We sure dodged a bullet, when she was not elected President?",
        "good": "16",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "roxella",
        "time": "12 September, 2022",
        "context": "Let's all check in to see what 'ol snaggle tooth is up to now, shall we ?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "deplorableleeroy",
        "time": "12 September, 2022",
        "context": "No one, not even Democrats, believe the\nmedia Propaganda any more.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "maybeiknowmore",
        "time": "12 September, 2022",
        "context": "God save President Donald Trump.  The left will stop at nothing to keep him out of the White House.  ",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "speaketruth",
        "time": "12 September, 2022",
        "context": "The Media is nothing but a bunch of Democrats. ",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Hjnh",
        "time": "12 September, 2022",
        "context": "Clinton always was, still is, and always will be a lying SOS who should be in jail. ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mcbiker_john",
        "time": "12 September, 2022",
        "context": "Stick around long enough and Hillary and other democrats will sell you some good old fashion 'false democracy'. However, Often its free - no charge!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "DixieNourmous",
        "time": "12 September, 2022",
        "context": "Trump could have had Hillary locked up, all he had to do was appoint her to a position in his administration.  Those clowns are getting indicted left and right!",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "mva281",
        "time": "12 September, 2022",
        "context": "Please stop posting news about her.. it just make her relevant and gives me nausea",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Brennanmonster03",
        "time": "12 September, 2022",
        "context": "Goes to show- monkey see monkey do doesn’t apply here. In socialist society the ruling party can never be vilified. Only the opposition to the ruling class. Kinda scary isn’t it? ",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rjc2011",
        "time": "12 September, 2022",
        "context": "This is rife throughout our govt. The FBI is full of partisan agents who's sole job is to taint GOP and it's candidates. I don't know how you weed these people out because there hundreds of thousands of them in Federal Govt",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "daniel4rmsa",
        "time": "12 September, 2022",
        "context": "Bill we will never forget you. You were a smash success ",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "daveginoly181",
        "time": "12 September, 2022",
        "context": "Some information is \"born classified\". Merely discussing certain matters in print (whether via hard copy or via email) results in the creation of classified information, just because of the nature of the conversation. A Secretary of State is unlikely (to the point of near impossibility) able to conduct her business (including emails) without engaging in conversations and information transfers that are highly classified by their nature, even as they are transmitted. Those working at this level of government know this. The fact that this sort of \"born classified\" information may have been (and almost certainly was) on Hillary's home server was a serious breach of national security matters, even without \"markings\".",
        "good": "28",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "thetruth1286",
        "time": "12 September, 2022",
        "context": "I call Turley out on being a partisan hack.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "CovidScareSurvivor",
        "time": "12 September, 2022",
        "context": "Why is Kankles McGillihag still in the news? ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jailfordonnie",
        "time": "12 September, 2022",
        "context": "Does anyone recall Turley whining about trump's serial lying?",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "normalamericanguy",
        "time": "12 September, 2022",
        "context": "Fox is supposed to be the number  one main stream media n the universe and they called her out, so what is the story about, exactly?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "USMCvet866",
        "time": "12 September, 2022",
        "context": "There is no more media. It’s propaganda for Talibiden. Fox is better than the rest of the DemCommunist propaganda media folks ",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "maritz",
        "time": "12 September, 2022",
        "context": "I think Hillary C  has goiter. It's noticeable in her photo above.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "zeke1",
        "time": "12 September, 2022",
        "context": "She lies",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Joey#",
        "time": "12 September, 2022",
        "context": "Hillary is guilty of everything Trump was falsely accused of and then some. ",
        "good": "7",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "jaygatten",
        "time": "12 September, 2022",
        "context": "Ask Vince Foster ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "pres_monkeyfist",
        "time": "12 September, 2022",
        "context": "Obviously Trump isn't as Sneaky and Deceitful as Hillary.   DEMOCRATS WINNING...HAHAHA ",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "wawii",
        "time": "12 September, 2022",
        "context": "The Clintons are text book liars. The MSM keeps covering for them.",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "fubar193",
        "time": "12 September, 2022",
        "context": "MSM: The Cankles camp says she is working out in her \"Signature Pants Suit\" and is getting ready for a Run, Bill says he is behind her all the way! LOL FDV(Dem. Voters)!",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "maga61",
        "time": "12 September, 2022",
        "context": "This woman's death will be celebrated by billions worldwide. I hope to urinate on her grave one day. Maybe a dump too.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "theworld'sbitch",
        "time": "12 September, 2022",
        "context": "falsehood? REALLY? ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jaygatten",
        "time": "12 September, 2022",
        "context": "Say: Webster Hubbell ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ProfessorTicklepickle",
        "time": "12 September, 2022",
        "context": "The most deceitful person in the history of the world, Hillary Clinton, being defended by the most deceitful organization in the history of the world, lame-stream media, is not news.",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bobstone",
        "time": "12 September, 2022",
        "context": "The “true colors” of MSM are well know. Same as FBI. It’s not red, white,and blue like it should be. It’s Communist Red.  ",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "lathaniel",
        "time": "12 September, 2022",
        "context": "The hag and her husband are professional liars and crooks. They do it very well. That's why they are slick and slippery. They'll never really be caught. The blue dress was an oversight they won't make again. ",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "lppro",
        "time": "12 September, 2022",
        "context": "She would tell the truth a hundred different ways before she would lie.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jwillstoneii",
        "time": "12 September, 2022",
        "context": "\"Truth is the same as not getting caught in a lie\" Hillary's Diary ",
        "good": "13",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jaygatten",
        "time": "12 September, 2022",
        "context": "ASK THE FRENCH,GERMANY AND THE ENGLISH WHY THEY HAVE FORGOTTEN THE GREEN NEW DEAL. ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "2fedupgmcd",
        "time": "12 September, 2022",
        "context": "Nora O’Donnell sat there like a potted plant when Hillary was not telling her the truth. Nora do you even realize that means she disrespects you not to mention half of America.",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "zappacostta",
        "time": "12 September, 2022",
        "context": "No officer I wasn't speeding, my car was.",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "milorafferty",
        "time": "12 September, 2022",
        "context": "Come on now, the Cankle lies aren't news. Now if she ever says anything that is truth, THAT would be news. ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "fedupover8",
        "time": "12 September, 2022",
        "context": "We all know that kind of a liar that she is..... but to quote her \" At this point, what does it matter?\" Comey even stated how many emails she had,  but because people come up dead when they cross her or expose her...........Well, you get the point. ",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "GreenTool",
        "time": "12 September, 2022",
        "context": "What if I told you that a snake could talk?  And lie?  ",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jaygatten",
        "time": "12 September, 2022",
        "context": "The gas pump tells us what is really going on!",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "vichara477",
        "time": "12 September, 2022",
        "context": "Why Mr. Turley do you believe: \n“As I have stated previously, I do not believe that the email scandal warranted criminal charges and certainly did not justify the \"lock her up\" mantra used in the 2016 presidential campaign.”\nWhen you later state:\n“Hillary elected to use an unsecured personal server despite the strong policy against such systems for the discussion of State Department business. The reason is obvious. The servers are more easily penetrated by foreign intelligence and, according to the FBI, \"hostile actors gained access\" to some of the information through the emails of Clinton’s associates and aides.”\nAnd:\n“What the private server allowed was control by the Clintons. That control would later prove key when Clinton delayed full disclosure to federal officials and ultimately deleted thousands of emails.”",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "gig73",
        "time": "12 September, 2022",
        "context": "The truth has never been within HRC's capabilities.  No truth has ever left her lying lips.  The same can be said of the MSM and their minions!",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "isitafact",
        "time": "12 September, 2022",
        "context": "Bet some of the progressive Dems still love her. She is fooling herself if she thinks anyone else does.",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Wslogger69",
        "time": "12 September, 2022",
        "context": "That is what we call as spin!  Truth into a lie and a lie into a truth. Just another ex lawyer who loves to watch her lips move no matter what the truth is. ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "doclr11",
        "time": "12 September, 2022",
        "context": "I remember when there was strong sentiment during the last (legitimate) election to “lock her up.” Trump magnanimously declined to do so. When Republicans take over again, the DemocRats will squeal when they find out that there will be no mercy.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "VotingDemocrat=Donkeypox",
        "time": "12 September, 2022",
        "context": "the liberal media is the Democrat party \n\nnothing is more dishonest or disingenuous than the liberal democrat they want illegals to further voter fraud but they don't want them in their backyard... the not in my backyard liberal... emotion over reason, agenda over logic, criminal over victim, abnormal over normal, illegals over citizens, evil over good, parasitic over productive, lies over truth,enemies over friends, the Democrat platform in a nut shell ",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "zarkastic",
        "time": "12 September, 2022",
        "context": "A good portion of the government owes Hillary favors for supporting their bad deeds and so we see coverups by a wide margin of the agencies she controls through promises of retaliation if they try to implicate her.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "PurpleScooter",
        "time": "12 September, 2022",
        "context": "Do you think she is still mad at Carlos danger, the stroking gun",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sickofthepandering",
        "time": "12 September, 2022",
        "context": "We deplorables use the word lie.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Ccjohn",
        "time": "12 September, 2022",
        "context": "Why does anyone even give Hillary air time to just spew her lies. The Clinton’s are really talented. They can lie in any form of media.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sandmansmith",
        "time": "12 September, 2022",
        "context": "Hillary can and does say anything she wants no matter how false because she knows the media will back anything she says while attacking Trump at every turn.  The only amazing thing is how Republicans are still ahead in polls despite the full on propaganda blitz by nearly all media outlets!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "varactyl81",
        "time": "12 September, 2022",
        "context": "IF ANY OF HILLARYS statements are true... it still begs the question, why all the secret servers at home, why all the data wiping, and cell phone smashing....???",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "peter33",
        "time": "12 September, 2022",
        "context": "Only true corrupt people try to even sniff the level of corruption of the Clintons it’s virtually impossible Trump has zero corruption in his blood the Clintons use corruption",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "truthhurtssometime",
        "time": "12 September, 2022",
        "context": "Turley is calling Kessler a serious journalist.  Therein lies the problem. Kessler is a hack of the highest order.  A Dim and Leftist to the core.  Fact check is his supposed specialty but he spent 4 years saying Trump lied about being bugged.  To use his twisted logic he applies to Hillary, Trump was in fact technically correct.  Just because the FBI and DOJ used newer technology and did not actually plant a bug in the Tower or at the WH, doesn't mean they did not listen in on conversations and intercept comings and goings.  Kessler gave Trump 4 Pinocchio's for this supposed \"lie\".  He applied this same tortured logic thousands and thousands of times to track the \"lies\".  He's a hack. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "DCWins",
        "time": "12 September, 2022",
        "context": "She only used her server “half way”",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "SailorDavey980",
        "time": "12 September, 2022",
        "context": "I met her in person once while in the military...\nShe treated her staff like dogs and everyone else like furniture. \nUntil the cameras turned on. ",
        "good": "14",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "notimefor",
        "time": "12 September, 2022",
        "context": "That is why the media lacks credibility.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "i'myourhuckleberry166",
        "time": "12 September, 2022",
        "context": "Someday media all the lies, coverups and damage that you're responsible for are going to come back and mangle you. I can't wait for the day. It's going to be wonderful !",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mawbrules",
        "time": "12 September, 2022",
        "context": "It's hard to believe that millions of people voted for this witch. ",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "alwaysfreedom",
        "time": "12 September, 2022",
        "context": "It would take a publication a foot thick and printed in small type to list all of her lies and misdirections",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "pres_monkeyfist",
        "time": "12 September, 2022",
        "context": "Hillary and Harris get their signature pantsuits from the same guy... Omar The Tent Maker.",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "someday",
        "time": "12 September, 2022",
        "context": "if everything is on the up and up why install a private server ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "doyourresearchpeople",
        "time": "12 September, 2022",
        "context": "Hillary's actions were heavily investigated MANY times.  It's over.  The Fox/MAGA media is all 'Whataboutism\".\nFact: Trump possessed numerous ACTUAL classified docs - of the HIGHEST classification levels (SCI, SAP, Nuclear).  Not 'possible' or 'likely' classified INFO buried within emails, all of which were 'state dept' type information...not Presidential secrets.\nA few orders of magnitude different I'd say...",
        "good": "0",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "sannleikurinn",
        "time": "12 September, 2022",
        "context": "The Clinton's, both Bill & Hill, are the best liars the world has ever seen. Frankly, it's something to marvel at.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "hiimed",
        "time": "12 September, 2022",
        "context": "🇺🇸TRUMP 2024🇺🇸SAVE AMERICA🇺🇸SAVE THE WORLD🇺🇸 ",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jamiec",
        "time": "12 September, 2022",
        "context": "Global Alliance for Clean Cookstoves summit\nThat's not really a thing is it?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "grazer",
        "time": "12 September, 2022",
        "context": "Hillary Clinton is vile, and it says a lot about Democrats and the media that they still worship at her feet.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "fuddyduddydude",
        "time": "12 September, 2022",
        "context": "Ever since 2016, we’ve been exposed to blatant double standards and hypocrisy than have drawn the battle lines we’re facing today. Fortunately, the truth is out there and no amount of ignorance or denial will ever subdue that. ",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cookguy",
        "time": "12 September, 2022",
        "context": "To compare Trump’s handling of classified to Clinton’s isn’t even a close comparison.  Hillary’s use of classified on an unsecured server is a felony.  It doesn’t require intent, it is a violation because of the unsecured and open access to classified information.  In addition, her zealot followers deleted national archive emails which required retention.  Also, they deliberately destroyed phones to prevent disclosure.  Trump retained records that were secured and guarded by the SS.  He made no effort to hide, destroy or change these records in his possession.  The difference can’t be more stark.",
        "good": "143",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dougmh",
        "time": "12 September, 2022",
        "context": "The tech manuals and schematics of my radar set were classified CONFIDENTIAL.   Had I failed to lock them up after every use, I would have received NJP at the least and a court martial with less than honorable discharge at worst.  LOCK HER UP!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rightprof",
        "time": "12 September, 2022",
        "context": "When there's no justice a society falls apart. And that's what we're seeing now. ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Not_Specified",
        "time": "12 September, 2022",
        "context": "When Hillary lied about her Bosnia trip, we all knew that she definitely was a liar. If someone lies about something like that, then they lie about everything, and she has.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "WhatHappened788",
        "time": "12 September, 2022",
        "context": "Remember Benghazi!  ",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "JDLC717",
        "time": "12 September, 2022",
        "context": "Horrible cow.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "factcheckdeeznutz",
        "time": "12 September, 2022",
        "context": "If you have to go thru that much trouble to detail how something was \"technically true\", then it's actually \"basically false\".  ",
        "good": "33",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "nd219",
        "time": "12 September, 2022",
        "context": "I wish Hillary would just go away forever, like getting hit by a train........   ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "yuramushroom",
        "time": "12 September, 2022",
        "context": "The only pig that applies her own lipstick...",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "hhefnerla",
        "time": "12 September, 2022",
        "context": "Pretty sad that even though I'm American, I think more highly of the Queen than I do Hillary - and I don't think I'm alone. ",
        "good": "15",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "WhatHappened788",
        "time": "12 September, 2022",
        "context": "The truth gene is missing in all democrat politicians, and the liberal media. ",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "truthwillsetyoufree871",
        "time": "12 September, 2022",
        "context": "And what about the government computers that Hillary arranged to have a microchip that forwarded emails to China? You have to admit it was a very ingenious way to be a traitor.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rssommers216",
        "time": "12 September, 2022",
        "context": "she only appears immortal...we need to experiment...hit her with some water and see if she melts...",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "joe'sairshakinghand",
        "time": "12 September, 2022",
        "context": "WHEN YOU TAKE A HAMMER TO THE EVIDENCE AND DESTROY IT THAT IN ITSELF MAKES YOU LOOK GUILTY ",
        "good": "16",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Wxtz",
        "time": "12 September, 2022",
        "context": "The Democrat FBI Works for her and her party. Not you. ",
        "good": "13",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "nd219",
        "time": "12 September, 2022",
        "context": "I wish Hillary would just go away forever, like getting hit by a train........   ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "weneedfossilfuel",
        "time": "12 September, 2022",
        "context": "Hillary is totally corrupt.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "8yrsisenough",
        "time": "12 September, 2022",
        "context": "Are we ever going to see the last of this sow?",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tonyinmontana504",
        "time": "12 September, 2022",
        "context": "Jonathan Turley is an outstanding scholar. His perspective on the issues at hand a remarkably clear in a world we're so many are tossing smoke bombs.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "joe'sairshakinghand",
        "time": "12 September, 2022",
        "context": "WHEN YOU TAKE A HAMMER TO THE EVIDENCE AND DESTROY IT THAT IN ITSELF MAKES YOU LOOK GUILTY ",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "foxdiditagain",
        "time": "12 September, 2022",
        "context": "Hillary is so false that the democrats accept it as the norm now.",
        "good": "16",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "max'sdad446",
        "time": "12 September, 2022",
        "context": "The entire Clinton crime syndicate should be in prison.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cocobolla",
        "time": "12 September, 2022",
        "context": "This picture hurts my eyes!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "weneedfossilfuel",
        "time": "12 September, 2022",
        "context": "Hillary is totally corrupt.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "warbaby44",
        "time": "12 September, 2022",
        "context": "Falsehood = Massive Lie",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "lastconservativestanding",
        "time": "12 September, 2022",
        "context": "Hillary calls Pelosi “queen” (of the Mob) while she retains the title “queen” (of trash) hailed by the “king” (of janitors, WAPO, who deep six truth)",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "johnnythewalrus",
        "time": "12 September, 2022",
        "context": "The MSM serving as compliant little lap dogs for Democrats and specifically the Clinton crime syndicate is hardly \"news\".  ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "evc59",
        "time": "12 September, 2022",
        "context": "Why can't there just be a new virus that is untreatable, has a 100% morbidity rate and only attacks politicians?",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "SweetLight",
        "time": "12 September, 2022",
        "context": "Hilliard seems to think she is above all laws, man-made and those made by God.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "liberalsciencedenier",
        "time": "12 September, 2022",
        "context": "I wish Fox would use current pictures of this worn out bag of estrogen.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "RTC",
        "time": "12 September, 2022",
        "context": "the law doesn't require it to be intentional ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "hardrain367",
        "time": "12 September, 2022",
        "context": "Bottom line, the differences between the Clinton case and the Trump case are significant. Comey on the Clinton case (July, 2016):\n\"\"In looking back at our investigations into mishandling or removal of classified information, we cannot find a case that would support bringing criminal charges on these facts. All the cases prosecuted involved some combination of: clearly intentional and willful mishandling of classified information; or vast quantities of materials exposed in such a way as to support an inference of intentional misconduct; or indications of disloyalty to the United States; or efforts to obstruct justice. We do not see those things here.\"\nJames Comey, July, 2016\nWe see all those things in Trump's case.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "BidenhasAlzheimer’s",
        "time": "12 September, 2022",
        "context": "If a Democrat lies, and no one hears them, is it still a lie?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "49ner",
        "time": "12 September, 2022",
        "context": "What was on the 30000 emails she deleted, What was  on the black berries she destroyed, what was on the hard drive she acid washed?...these are the questions that need to be answered....",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "SweetLight",
        "time": "12 September, 2022",
        "context": "Hilliard seems to think she is above all laws, man-made and those made by God.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "giggalaharris",
        "time": "12 September, 2022",
        "context": "Really? Why does the title so nicely say falsehood. Call it what it is !! A lie!!! Why is it always a falsehood or Pinocchio when it’s a democrat. But when a republican says something that isn’t true it’s “A BIG LIE’ ",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "GunsAGoGo056",
        "time": "12 September, 2022",
        "context": "I am old and do not get around much anymore.  There is one thing that would cause me to get active.  If Hillary Clinton were tried for all her wrong doings and sentenced to death by hanging, I would travel to Washington DC to watch the show and applaud when it ended.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "alligator8611",
        "time": "12 September, 2022",
        "context": "If Hillary is all about the people, and all the people love her, why won’t she go on FOX news and be interviewed by Hannity, Watters, Gutfeld or Judge Jeanine. 🙀",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "BidenhasAlzheimer’s",
        "time": "12 September, 2022",
        "context": "If a Democrat lies, and no one hears them, is it still a lie?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "brylcreamboomer",
        "time": "12 September, 2022",
        "context": "Everyone knows Hillary used a PRIVATE Email System because she didn't trust the email system setup by the FBI that all other government people use",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "trumpite2024!",
        "time": "12 September, 2022",
        "context": "The most corrupt politician of my lifetime. The Clinton Body Count is an interesting read ",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "disgruntledtaxpayer",
        "time": "12 September, 2022",
        "context": "If none of it was classified why did you hide it  deleteot smash phones and bleach bit? Guilty......lock her up.....",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "oldenoughtoknowbetter377",
        "time": "12 September, 2022",
        "context": "The queen of Benghazi!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "spankdamonkey",
        "time": "12 September, 2022",
        "context": "I hope Trump shuns all these fake news outlets when he becomes President in 2024. Gonna Be EPIC!!! I'm more excited about the Debates...",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "BidenhasAlzheimer’s",
        "time": "12 September, 2022",
        "context": "If a Democrat lies, and no one hears them, is it still a lie?",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dlglenn",
        "time": "12 September, 2022",
        "context": "Here is the pot calling the kettle black. Hillary's lucky she didn't go to Prison. Her and the rest of the Clinton Crime Family. This woman is a Has-Been and needs to go back home and stay. There's no kind words for this woman that comes to mind. she's Guilty. 30,000 documents Secret, Top Secret, etc. and in her possession.\nLet's not forget Bleach Bit, destroying phones with a hammer.\nShe's Guilty of Benghazi. This woman is a danger to US.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "FlyingViking",
        "time": "12 September, 2022",
        "context": "A 2018 report of Department of Justice inspector general revealed that \"81 of Hillary Clinton’s email chains contained approximately 193 individual emails\" which were \"classified from the CONFIDENTIAL to TOP SECRET levels at the time.\" What the heck is the difference? This woman is a deceitful lier that should have been prosecuted. They failed at all levels of the DOJ and have lost all credibility with American people.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Jeepman2",
        "time": "12 September, 2022",
        "context": "They can say anything they want, lie, cheat steal because they know the media will support them",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Butchcassidy969",
        "time": "12 September, 2022",
        "context": "MSM lies as much as Clinton does.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ididntvoteforhim971",
        "time": "12 September, 2022",
        "context": "Sooner you face the fact that Dems are NOT held accountable like the rest of us, the sooner your life will be less stressful.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "5thgp",
        "time": "12 September, 2022",
        "context": "The Clintons are the most lying corrupt family our country has ever witnessed.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "clarkston",
        "time": "12 September, 2022",
        "context": "anyone who stays with a man for power when he is unfaithful on a world stage is a megolomaniac and  i prefer to deposit them in the circular file. women today are somehow attracted to her. they are being swindled.  normal people like ted kennedys wife dissolve. their morality cant withstand it. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "goatroper074",
        "time": "12 September, 2022",
        "context": "Why is it called a “falsehood” when it’s more accurately a “lie”? Can we please call things what they are?🇺🇸",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "a.merican",
        "time": "12 September, 2022",
        "context": "\"However, Clinton is now rewriting history with the help of many in the media who simultaneously pushed this line that the email scandal was a type of conservative hoax. It was not.\"\nYUP.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "demsaretheenemy515",
        "time": "12 September, 2022",
        "context": "The Swamp Protects All Its Creatures.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "etc797",
        "time": "12 September, 2022",
        "context": "Calling out Hillary's falsehoods would be a full time job. Why bother, she is totally irrelevant now?",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jcc62151",
        "time": "12 September, 2022",
        "context": "Nothing will happen to her; she knows where all the bodies are buried. If she goes down, she will take 3/4's of Washington DC with her...",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "recession",
        "time": "12 September, 2022",
        "context": "This country is being run by domestic terrorists ",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "myturn653",
        "time": "12 September, 2022",
        "context": "I don’t follow Mr Turley’s argument here.  It seems to me that the Clinton case was far more egregious than the Trump case and was prosecutable on its face. ",
        "good": "10",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "justanothertaxguy",
        "time": "12 September, 2022",
        "context": "Democrats regularly rail against misinformation yet they are the worst purveyors of this very misinformation and the MSM willingly goes along. The MSM has one standard for misinformation for republicans and another for democrats. ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Cft",
        "time": "12 September, 2022",
        "context": "Of she had zero classified emails. They were all deleted once an investigation was mentioned. ",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "fmtt6938",
        "time": "12 September, 2022",
        "context": "The only word that comes to mind starts with a B and ends with an h. ",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "TheDon028",
        "time": "12 September, 2022",
        "context": "Were the Clinton's horrible! Yep!",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "vetteacher326",
        "time": "12 September, 2022",
        "context": "Hillary compromised agents in the field. People died because of her. And then there was Benghazi. More good men died because of her. She is worse then Hanoi Jane. ",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "RTC",
        "time": "12 September, 2022",
        "context": "she ignored the subpoenas, her cohorts were given immunity and there are no transcripts of her interview with the FBI. ",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jackriley550",
        "time": "12 September, 2022",
        "context": "Pot, meet kettle.  Kettle, meet pot. \nTURLEY: Media shows true colors for not calling out fat donnie's falsehood!",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "gonefishin\"",
        "time": "12 September, 2022",
        "context": "Hillary has the Clinton Crime Family vaccine.  She was given the free pass on her destruction of 30000 emails and smashing all her electronic devices by James Comey.  He is and was a firm Clinton supporter and a major Trump hater and who knows what he got for his treason.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "steve781",
        "time": "12 September, 2022",
        "context": "Were I Bill I would have chosen Monica, she at least had a useful skill.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "IQ168-plus",
        "time": "12 September, 2022",
        "context": "\"Clinton is now rewriting history with the help of many in the media...\"  The media parses, re-writes misinforms, half-informs on anything  that comes out of another dims mouth, computer, etc.  \"Benjamin Franklin once said that a \"half truth is often a great lie.\"",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "UPNorth906",
        "time": "12 September, 2022",
        "context": "lying lier lying about lying.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Marlowe4088",
        "time": "12 September, 2022",
        "context": "Hilary has literally gotten away with murder.  But she’s out there bloviating about everything else but her true legacy.  This woman is the biggest narcissist on the left and that’s saying a lot.  ",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "overthehillsandfaraway3",
        "time": "12 September, 2022",
        "context": "So what Hillary did was bad?  How about what Trump has allegedly done?  Should we lock him up?   ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jonathan3232",
        "time": "12 September, 2022",
        "context": "Have you ever seen a Trump interview on Fox??? They laugh while he lies!!!!",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "Lastchance043",
        "time": "12 September, 2022",
        "context": "Hillary has been around  Bill long enough to know you can lie but in their alternative reality, it can also be true. Bill was master and Hillary learned well. ",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cks260",
        "time": "12 September, 2022",
        "context": "The communist media showed their true colors at the beginning of the Trump era...",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "wildturkey77",
        "time": "12 September, 2022",
        "context": "Theses cases are “strikingly “ dissimilar if you actually look at the details, but Fox bets you won’t….",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ghillie762",
        "time": "12 September, 2022",
        "context": "Technically this, technically that. So is she technically a criminal?",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "maganj",
        "time": "12 September, 2022",
        "context": "It's refreshing to see Secretary Clinton back in the news again with some wind in her sail and a solid policy foundation. Hillary in 2024!!",
        "good": "1",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "voteoutdirtydems",
        "time": "12 September, 2022",
        "context": "When will this hag die ?",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "kdlaz",
        "time": "12 September, 2022",
        "context": "Lock her up, then bulldoze the prison.   Then pour 500 tons of salt on it.  Then, use it as a site for dumping nuclear waste.  \nThen, be happy that you did the country such a great service.",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "IwoJimaRemembered",
        "time": "12 September, 2022",
        "context": "It's OK. We all know she cannot be truthful.  Her whole life is a lie.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "sikintired",
        "time": "12 September, 2022",
        "context": "I think the other way they use words to mislead here is by saying nothing was marked \"classified.\" Every one who knows anything about classified markings know there is not a marking called \"classified.\" But Clinton purposely says it in that way to avoid being caught in a lie while misleading people. The same as people saying there was no WIDESPREAD election fraud. Yes, there wasn't widespread election fraud, but there was specific incidents which was all that was needed. Both parties know where the elections can go either way, that is where you have fraud.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Eaglerydr",
        "time": "12 September, 2022",
        "context": "Total bull. Truth She had marked classified emails on an totaly insecure personal server. She also had classified information in several other emails also on the same totally insecure severs. There is no spin to put on it. She was guilty and everyone knew it and she was protected by the alphabet agencies because they thought she was going to be president. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "john556555",
        "time": "12 September, 2022",
        "context": "she is still claiming that the election was 'stolen' from her. Where is the FBI?",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "soitbegins393",
        "time": "12 September, 2022",
        "context": "The media are just a propaganda tool",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Tenshi",
        "time": "12 September, 2022",
        "context": "You had a hunch the news systems was rigged and you couldn’t put your finger on it, huh ?\nThis might solve the puzzle:\n• ABC News executive producer Ian Cameron is married to Susan Rice, Obama’s former National Security Adviser\n• ABC News correspondent Claire Shipman is married to former Obama’s previous Whitehouse Press Secretary Jay Carney\n• ABC News and Univision reporter Matthew Jaffe is married to Katie Hogan, Obama's former Deputy Press Secretary\n• ABC President Ben Sherwood is the brother of Obama's then Special Adviser Elizabeth Sherwood\n• CBS President David Rhodes is the brother of Ben Rhodes, Obama's previous Deputy National Security Adviser for Strategic Communications.  If Ben’s name sounds familiar, that is likely due to him being Obama's FALSE NARRATIVE guy.  He had a major role in the editing of the now infamous Benghazi talking points.\n• CNN President and Washington Bureau Chief Virginia Moseley is married to former Hillary Clinton's former Deputy Secretary Tom Nides who was Obama’s Deputy Secretary of State.",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dccb",
        "time": "12 September, 2022",
        "context": "Well, coming from a proven liar. The problem is, she knows that we know, about this, and so much more. No matter how many times she lies, does not make it true.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "SteveLahaie701",
        "time": "12 September, 2022",
        "context": "Hillary had classifed information that was able to be penetrated by foreign hackers. Correct? Trump had classified information in a secured place in his home. Correct? Now what would be the easiest place to get information from? This just seems like a game of semantics.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "myheroesjoeandcamela",
        "time": "12 September, 2022",
        "context": "Trump should have just incinerated the documents and all would be well. ",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "happyscotus",
        "time": "12 September, 2022",
        "context": "She is a liar and we all know it. The question is, will she ever be held accountable? The answer is obviously no. So we have to live with it. The public conscience will have to remember and be reminded occasionally of what a liar she is. Until she has her public funeral when all democrats will feign sorrow at the passing of such a great leader. ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "BigBadWolfDog",
        "time": "12 September, 2022",
        "context": "The same guy that was all in on the Clinton impeachment, then wasn't because trump was getting impeached, now thinks he has credibility. He doesn't. Turley is a hack.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "watching247",
        "time": "12 September, 2022",
        "context": "How many cell phones and drives did they find at Trumps that were smashed with hammers. How many emails were missing that were deleted, did he use a private server?\nHow much bleach bit did they find?\nWhy was Hillary not raided?\nWhy is Hillary not in jail?   ",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "bar-s-bar",
        "time": "12 September, 2022",
        "context": "I do not believe that the email scandal warranted criminal charges and certainly did not justify the \"lock her up\" mantra --- Can someone explain how admittedly destroying 30000 pieces of subpoenaed evidence does not warrant criminal charges?",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "magakag2020798",
        "time": "12 September, 2022",
        "context": "Please tell us Queen Teflon of Blackberry Hammer.\nAre there any pieces of Chelsea's $250,000.00 thousand dollar wedding cake left ?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "george311",
        "time": "12 September, 2022",
        "context": "The Clintons, Obama’s and Biden’s are bullet proof and they know it, and Justice for all except them ???🇺🇸",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "commonsense863",
        "time": "12 September, 2022",
        "context": "hilary and joe both have the blood of true patriots on their hands, Benghazi and withdrawal from Afghanistan ",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "naja",
        "time": "12 September, 2022",
        "context": "How do these people live with themselves?  Yuck!",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cinic",
        "time": "12 September, 2022",
        "context": "I still find it difficult to believe that her e-mails can't be resurrected. It seems to me that the FBI/CIA can do a lot of these techy things when they are inspired to. We seem to have accepted her explanation as an absolute. Anyone out there know? Can e-mails be dug out of the trash? I can dig mine up.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jy67",
        "time": "12 September, 2022",
        "context": "Hillary is truly one of the most vile humans on the planet. ",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Liberals_are_scurge",
        "time": "12 September, 2022",
        "context": "what about the 50k emails Hillary deleted",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Fncisnumber1",
        "time": "12 September, 2022",
        "context": "All the left does is lie. And, when it’s proven they lied, they just keep repeating the lie anyway. Charlottesville is a great example of this. They lied about what Trump said, and anyone who cares, can watch the video, and see Trump said the opposite of what the left claims. David Duke, is another. Russian collusion is another. ",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "george311",
        "time": "12 September, 2022",
        "context": "There is a criminal reason this woman destroyed 30,000 emails, too bad we will never know ???🇺🇸",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "The_Big_Guy_and_Where's_Jackie?",
        "time": "12 September, 2022",
        "context": "\"How to gaslight\" must be required reading for Libs. ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "fair_n_balanced",
        "time": "12 September, 2022",
        "context": "There is absolutely no question about it. There were zero classified emails on her server after she purged the hard drive with Bleach Bit.",
        "good": "8",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "AntiAmericanDems",
        "time": "12 September, 2022",
        "context": "And she then ILLEGALLY destroyed evidence that was part of the investigation. A Republican would have been serving time for that. ",
        "good": "15",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "thatchief",
        "time": "12 September, 2022",
        "context": "During Trump's presidency there were three different investigations into Hillary, none of them resulted in any charges.\nIf Clinton is as bad as Fox News wants you to think she is: then Donald Trump's presided over rampant lawlessness and unfettered criminality and he was utterly impotent to enact any meaningful change.  \nCONGRATULATIONS!!!",
        "good": "0",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "gene6642",
        "time": "12 September, 2022",
        "context": "Turley, a former knee-jerk liberal \"gets it\".",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mktguy2",
        "time": "12 September, 2022",
        "context": "Can't everyone just agree that if \"Lock her Up!\" is a good idea, \"Lock HIM Up!\" is also a REALLY good idea?",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "RipVanWrinkle",
        "time": "12 September, 2022",
        "context": "SHRILL ery would NEVER lie.\nTruth be told.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mlipst",
        "time": "12 September, 2022",
        "context": "Democrats have been the great rewriters of history;  whether it's the source of Jim Crow Laws, the history of the Ku Klux Klan, which political party was more supportive of Women's Suffrage legislation and the Civil Rights Act, the challenging of elections, etc.  And the media is complicit in allowing this to occur.  They never challenge the lies coming out of Democrats' mouths.  And in the event that they might issue a challenge, they accept the gobbledy-gook responses that come out of their mouths without follow-up.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cortomom",
        "time": "12 September, 2022",
        "context": "Do you mean Hillary the serial killer?   She probably has a picture of Trump on her bedroom wall that she practices throwing knives at.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "plb910",
        "time": "12 September, 2022",
        "context": "Clinton is the most evil and vile woman in politics. A true Democrat!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ourgovernmenthatesus616",
        "time": "12 September, 2022",
        "context": "HRC will get away with this (again), but not forever. Judgement is pending.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cushkaye900",
        "time": "12 September, 2022",
        "context": "Interesting libs are all over the Trump article, crickets on this one.  ",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "blaze0207",
        "time": "12 September, 2022",
        "context": "Remember her staff included the lawyer whose laptop was seized, then disappeared in the hands of the FBI, THEN magically, \"found\", again.  This lawyer whose name escapes me was a subject , of HRC's investigation, herself.\nBut in an unprecedented move was allowed to sit in, when Hillary was questioned, while a subject hersel in the same investigation.\nThe  use of Bleach Bit was enough to charge her with negligence. I stand by my claim that Hillary received two tier Justice!",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "fjbfjbfkhfad",
        "time": "12 September, 2022",
        "context": "The clintons are corrupt.  The bidens are corrupt.  This is fact.  If you voted for either, you are morally corrupt.",
        "good": "11",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "hiphoppippop",
        "time": "12 September, 2022",
        "context": "she turn in her email where yall bin at ??",
        "good": "0",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "rayb739",
        "time": "12 September, 2022",
        "context": "The truth is no one lives forever and if I can live long enough, I'll be able to be alive on the planet that no longer has people such as Hillary breathing the same air that I use.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "hiphoppippop",
        "time": "12 September, 2022",
        "context": "you aint wory bout haters hilery . god bless you for you servace",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "justice_to_the_hypocrites",
        "time": "12 September, 2022",
        "context": "The purpose of the liberal biased media is to sway less educated voters who cannot think for themselves.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "usmc88755",
        "time": "12 September, 2022",
        "context": "No surprise! All freedom-loving, patriotic Americans know that all media are nothing more than Marxist propaganda tools ... except for Fox most of the time!",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "joeybuffoon635",
        "time": "12 September, 2022",
        "context": "Looks like Hillary is closing in on 240 maybe 245.....",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "britishbg",
        "time": "12 September, 2022",
        "context": "Hillary's tortured logic is knowingly and transparently misleading - Clinton is an aberration, and stain on the morals and ethics of American politics.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bdatruth",
        "time": "12 September, 2022",
        "context": "You mean is as is was when I tried to sell the Special Access programs to China?",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "nodoubt140",
        "time": "12 September, 2022",
        "context": "Jabba Clinton. A new star wars character. Part hippo, part hyena, entirely lying, immoral villain   ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "state1234",
        "time": "12 September, 2022",
        "context": "50,000 emails with a few having the word coronavirus in them. She's a criminal and has been for decades now. ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "reasonandlogic706",
        "time": "12 September, 2022",
        "context": " propaganda\nnoun\n1.  information, especially of a biased or misleading nature, used to promote a political cause or point of view",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "americanmight",
        "time": "12 September, 2022",
        "context": "She had Classified and Top Secret emails on her unlawful private server. The Director of the FBI told us, this is what their investigation showed. And of course, we have no idea what was on the thousands of deleted emails. She also had a private server because she was selling access to the Secretary of States office, and she needed to launder that cash through her fake charity. This required her to have control over all her email traffic…so in an emergency, she could do, what she did…destroy the evidence.",
        "good": "13",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "chile10001488",
        "time": "12 September, 2022",
        "context": "\"...I do not believe that the email scandal warranted criminal charges and certainly did not justify the \"lock her up\" mantra...\"\nThis was so much more than that though. The emails were all wiped from her server while under subpoena. No one but Clinton knows if there were classified emails on that server and no one ever will. She and her staff took hammers to cellphones so that nothing could ever be retrieved from them. Then Hillary got the doj to grant full immunity to some on her staff so they could never be charged by anyone in connection with that case, immunity granted for their cooperation...whatever that means. They did nothing at all to earn it though did they? I think it warranted a lot of people getting locked up.",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "LookingforAmerica",
        "time": "12 September, 2022",
        "context": "A face only a Mother could love!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "xan222",
        "time": "12 September, 2022",
        "context": "I know its an old joke, but \"How can you tell when a Democrat is lying?\" \nTheir mouths are moving",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "semperinfronte",
        "time": "12 September, 2022",
        "context": "'Tortured logic' honestly describes pretty much everything that's coming from Democrats.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "listentopeople",
        "time": "12 September, 2022",
        "context": "wapo is a liberal biased rag that censors too much for its readers to actually know what truth is. I really do not understand how any of them can keep their credentials as being a news organization when all they do is opinions",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tkh139",
        "time": "12 September, 2022",
        "context": "Eventually she will go away, just hold on.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "slayerofall",
        "time": "12 September, 2022",
        "context": "Foxnews wants this foul thing to be President with all the free press they are giving her.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "hughg.rexion",
        "time": "12 September, 2022",
        "context": "Why in God's green earth isn't this troll in Federal Prison???",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "BadBadLeroyCornPop",
        "time": "12 September, 2022",
        "context": "If what Hillary did was legal, why did they  use hammers and bleach-bit to destroy subpoenaed cell phones and data?",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mike0953",
        "time": "12 September, 2022",
        "context": "Good God!!! You’d think we could wrap up Hillary in some charges by now.  Not looking good.  After all we are still looking for the real killers for Nicole Brown and Ronald Goldman. Sheesh. ",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Toad870",
        "time": "12 September, 2022",
        "context": "Hillary is rotten to the core",
        "good": "8",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "electaclown;expectacircus",
        "time": "12 September, 2022",
        "context": "STILL talking about Hillary? Give it a rest Fox, no other “media” gives her as much air time as you do. Pretty bad when a recycled Hillary is the worst Dem villain you can find. Time to switch parties. ",
        "good": "0",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "madd5277",
        "time": "12 September, 2022",
        "context": "That far worst than fox not covering Video of republicans telling poll workers in Wayne county Michigan not to worry about the rules. 9/8/22",
        "good": "0",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "forwardright",
        "time": "12 September, 2022",
        "context": "The old lush who walks around in her daily routine with a bottle of hot sauce in her purse. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "becro",
        "time": "12 September, 2022",
        "context": "There has NEVER been a time when personal integrity and good judgement in leaders is needed in leaders more than it is today!! Personal understanding of the issues by voters and choosing candidates of high moral character is still needed, very much!!  Choosing the lesser of 2 (or more) bad choices  is about all we have left!!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Dr.Doug",
        "time": "12 September, 2022",
        "context": "What does anyone expect to hear coming out of Hillary’s lying mouth?",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "humble_ragamuffin",
        "time": "12 September, 2022",
        "context": "Liberals don't disagree with something because it's a lie.\nLiberals think something is a lie because they disagree with it.\nSo when a liberal accusing you of lying, all they are really saying is, \"You said something I disagree with and that angers me!\"",
        "good": "8",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "OliveTeepee",
        "time": "12 September, 2022",
        "context": "A little actual history about democrats. U S Grant, a democratic president, promised the Lakota people that they could live on their sacred land in the Black Hills forever. Two years later, Grant directed WT Sherman, a democrat, to conduct a war of genocide against these same people, for political reasons. Custer, another democrat, got killed, trying to gain political points by massacring innocent people, for political reasons. Nothing has changed. There is a very good reason why democrats are trying so hard to rewrite American history.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "SophiaR",
        "time": "12 September, 2022",
        "context": "Look at the eyes.  Enough said.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "e.nursedavidson045",
        "time": "12 September, 2022",
        "context": "Of COURSE THE VIEW DIDN'T QUESTION HER EITHER",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "perfectsense802",
        "time": "12 September, 2022",
        "context": "If Hillary's lips are moving she's lying.",
        "good": "9",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "hwy66cynic",
        "time": "12 September, 2022",
        "context": "The one major difference is that Hillary could not declassify any of her emails while the President of the United States (Trump) had the power to declassify anything that he wished..",
        "good": "15",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mklosty",
        "time": "12 September, 2022",
        "context": "What Secretary Clinton did was orders of magnitude more egregious than what former President Trump did.  The sheer volume of classified information, the severity of the breach of the applicable law, the intent, the level of security afforded the classified information in possession of each person, and each person’s disposition of the information all show a much more severe issue stemming from Clinton’s misdeed than from Trump’s.",
        "good": "16",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "trilitetra451",
        "time": "12 September, 2022",
        "context": "great article, always articulate and on point....but then again. logical intelligent minds don't focus on bogus talking points",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dudelbug",
        "time": "12 September, 2022",
        "context": "Isn't it just convenient that hillary just came back out of hiding after the fbi raid? Nothing from hillary until the raid..hmm interesting ",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mimi-orchid",
        "time": "12 September, 2022",
        "context": "I would absolutely love not having to see her obnoxious face!",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "RedneckRandy337",
        "time": "13 September, 2022",
        "context": "In 2016 a sufficient number of voters ignored the most qualified person to ever seek the presidency in favor of the least qualified ever. And Trump went on to wreck the American presidency, numerous government institutions and our standing in the world. Four years later he nearly wrecked our democracy by trying to overturn an election that booted him back to the private sector by the biggest popular vote margin ever. And now Trump has engaged in espionage against the United States. The secrets he stole are of value only to foreign countries, and he was certainly going to sell them if he hasn’t already, because Trump will do treasonous things for money.",
        "good": "3",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "handyman12",
        "time": "12 September, 2022",
        "context": "Turley: \"...I do not believe that the [Clinton] email scandal warranted criminal charges and certainly did not justify the \"lock her up\" mantra...\"  I whole heartedly disagree.  Hillary Clinton used the private server and private email account so she could avoid any oversight to what she was doing as Secretary of State and with her slush fund charity which pulled in millions of dollars of donations from foreign countries.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "trafgod",
        "time": "12 September, 2022",
        "context": "She swore on record that she had her workers copying and faxing her classified documents. She even went on to leave detailed instructions to cover up and classified markings before faxing the documents. That was quickly brushed over and dismissed. Taking classified Intel then having people with no security clearance to remove classified headers and then sending it to an unsecured private server where she could bleach bit the hard drive after it was subpoenaed by the feds. Any 6th grader with common sense could connect the dots about why she was keeping the records on her \"private server\" most if it at the time was her covering up her benghazi scandal where she helped arm Libyan terrorists with American weapons and for her good buddy Sydney Blumenthal who coincidentally was doing business in Libya at the time. ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "texasaggie77",
        "time": "13 September, 2022",
        "context": "Lawyer speak...",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "joright",
        "time": "12 September, 2022",
        "context": "The MSM's true colors have been obvious for years. Which is why millions of people don't watch them, believe them, respect them.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "nutstoyou",
        "time": "13 September, 2022",
        "context": "They will tell a lie when the truth would be better.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "andythelawyer",
        "time": "12 September, 2022",
        "context": "Clinton Derangement Syndrome.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "truthseeker65075",
        "time": "12 September, 2022",
        "context": "Clinton didn't incite a foaming at the mouth mob of right-wing domestic terrorists to assault the US Capitol to try and 1) stop Congress from doing its work and 2) hang the Vice President.\nClinton didn't attempt a coup d'état by having seven States fake certificates to the National Archives listing her as the recipient of each State’s 2016 electors.\nTrump is the greatest threat to American democracy since the insurrection in the 1860s. He must be prevented from ever again holding public office.",
        "good": "2",
        "bad": "8",
        "replies": []
    },
    {
        "user_name": "Tobefairtoday",
        "time": "12 September, 2022",
        "context": "Hillary Clinton almost takes as many naps as Joe Biden. Must be the chardonnay.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "granee",
        "time": "12 September, 2022",
        "context": "she has the brain of biden... would be a waste of time to explain anything to her",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bobby408",
        "time": "13 September, 2022",
        "context": "Looks like Trump isn't above the law after all. Just don't take document out of the white house your not suppose to have and you won't go to jail. ",
        "good": "1",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "poorhouse157",
        "time": "12 September, 2022",
        "context": "One difference that I’ve not seen anyone note is that on an inadequately secured computer or server an outside entity could obtain information without even setting foot on the premises. The paper at Trumps residence can’t be accessed without actually setting foot on the premises. Neither situation is a good optic for either Hillary or Trump, but no one as yet has indicated any known access of the documents at Trumps residence by nefarious  persons. That can’t be said about Hillary’s servers as the FBI indicated there was evidence of intruders on her servers. ",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "notnow311",
        "time": "13 September, 2022",
        "context": "Trump and his buddies went golfing and everyone forgot their clubs",
        "good": "0",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "unitedtospeak",
        "time": "12 September, 2022",
        "context": "Not only does the liberal media not call out democrats, they out and out lie for them. They will censor any facts that contradict democrats position and any misdeeds that could damage democrats position.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "behondrhetoric",
        "time": "13 September, 2022",
        "context": "Hasn't he heard? President Obama declassified all classified material on Hillary Clinton's email. Like Trump he just didn't tell anyone ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "edoceo",
        "time": "12 September, 2022",
        "context": "always a masterful liar to the public, and she actually believes those lies. ",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "aTHEist",
        "time": "13 September, 2022",
        "context": "Always a wonder when the Fox propaganda machine calls out other media for bias.\nClinton had no classified emails on her server.",
        "good": "1",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "soyouknow",
        "time": "12 September, 2022",
        "context": "Mr.Turley the MSM has shown their true colors for last decade or so",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "AllPolitiansAreFrauds",
        "time": "12 September, 2022",
        "context": "I said it 6 years ago and I'll say it again now for the Trump situation. It is my opinion that EVERY single politician is guilty of breaking security rules. What the DOJ should do is send out a blanket statement that says something along the lines of:\n\"The enclosed 60 page document explains all the laws regarding security clearance data. We understand that politicians may not be aware of technology, so we're providing a 1-800 number for you to ask questions. Each and every one of you has until November 1st to get your data in order. All infractions before that date will be ignored this one time. Any individual found not handling clearance data properly after that day WILL be prosecuted.\"\nIt will end the nonsense of both of these situations, prevent countless other situations, and provide a clear line in the sand for the future.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "honestpolitician",
        "time": "12 September, 2022",
        "context": "Childlike mannerisms in adult leaders disqualifies them from the necessary credentials to do their job well. Poor example to set, and even worse to follow.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "1pingyes2pingsno",
        "time": "13 September, 2022",
        "context": "I would like to believe that when the GOP take over Congress after the Midterms, they will start to undo all the damaging nonsense created by the Dems and their minions. Unfortunately, I have seen the Republican Lawmakers in action last time they held the majority and it doesn't bode well. They may squander their opportunity by bickering and sitting on their hands, not wanting to make waves in DC.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "idonthavaklue",
        "time": "12 September, 2022",
        "context": "A half truth is a whole lie \nThe only scandal bigger than cheating Clinton is cheating Biden & scandalous Obama \nClinton is the poster child for covert female narcissism ",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "travelon82",
        "time": "13 September, 2022",
        "context": "The media has become disgraceful.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "taxpayer024",
        "time": "12 September, 2022",
        "context": "Technically, elected officials in Washington D.C. are not criminals.   There are few arrests and fewer convictions.  Lawyers like the word untruthful which is preferred to liar.   Most Americans understand that Washington D.C. is a sewer of criminals and liars.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tenneddie555",
        "time": "12 September, 2022",
        "context": "The MSM prints/says it. The general public believes it.\nSad.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "WhyAreYouSurprised",
        "time": "12 September, 2022",
        "context": "This article is really about Trump. You know Trump should not have mishandled top-secret documents, but if you can chase squirrels, you do not have to think about it. ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "WhyAreYouSurprised",
        "time": "12 September, 2022",
        "context": "I am not excusing Hillary's mishandling of documents. I am just pointing out that what Trump did was much worse. I am also pointing out that you are using Hillary to avoid dealing with Trump's mess. Hillary is not a defense of Trump. Really. She lost. Trump is not a victim. Deal with it. ",
        "good": "3",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "entertainmentrus",
        "time": "12 September, 2022",
        "context": "It appears that WhyAreYouSurprised and thatchief are typing from opposite sides of the same single-wide for their pennies-per-post.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "thatchief",
        "time": "12 September, 2022",
        "context": "If Donald Trump was so interested in \"law and order\"- then why'd he let Hillary get away with all of this? ",
        "good": "0",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "johnnyd540",
        "time": "12 September, 2022",
        "context": "Big surprise to see Hilary Dems trolling this specific article.  In the end, Hilary is what she is.  A lifetime Politician who's interest is NOT in the people of the United States.  We are cattle to her.  All of us...even you Mr./Ms. Democrat commenting right now.  Here's the good news, pretty much all of them are criminal or at least not living up to their oaths to the people, God, and the constitution.  Simple.  Most importantly I think a story like this, that has a bunch of Dems reading the comments and posting their own, is an opportunity.  \nNo, I do not HATE libs...or progressives.  Not a fan of white supremists for sure.  I think it serves the media and the gov for us to hate each other.  I get why as far as they go.  But I don't get all the hate between us all.  I have a lot of Dem friends and family.  I love them.  We watch games together, eat, celebrate, just like I would with my Repub friends...Social Media, News (wink) Media, and the Fed all benefit.  That's why every issue is made polarizing.  For example, I am pro-life...for me and my family.  However, I don't think abortion should be illegal.  I think rather than fight with people like me, just talk.  Be reasonable, understanding, and realize we are not enemies as the media and the fed would like us to believe.  Just saying, United the people are stronger than the elected people...that's why they practice divide and conquer...",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "obxwebdesigner813",
        "time": "12 September, 2022",
        "context": "Not calling the Clintons out and using articles like this stated as opinions are the reason the Clintons have gotten away with this for years. YOU, the media, never hold them accountable and in your need to play the middle ground talks of “opinion” are constantly railroaded by daily opposition “fact” pieces. Days move on and the noise they make is louder than your “opinion” that can’t even stand on facts. This is why no one takes YOU seriously because you can’t just say what is wrong is WRONG!!!",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "thatchief",
        "time": "12 September, 2022",
        "context": "MAGAts: Why is anyone talking about Trump? He's living rent free in your head!!\nalso MAGAts: Since it's been 3 days, let's talk about Hillary Clinton again\nIf it wasn't for cognitive dissonance, most MAGAts wouldn't do anything cognitive at all. ",
        "good": "2",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "WhyAreYouSurprised",
        "time": "12 September, 2022",
        "context": "Why does Fox need Hillary? What story could they be covering? \nDid Fox cover the spy that was found with access to MAL? They could cover that story. \nFox does not so much lie as leave off stories and cover Hillary, and AOC and Pelosi instead. It is just a bunch of squirrels. ",
        "good": "4",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "MGW7",
        "time": "12 September, 2022",
        "context": "I'm sure her emails would have shown deep corruption in the DOJ as well as dozens of other Democrat empowered federal branches of government. That is why they fried the servers and all other devices they could be traced to, locked away wikileaks founder, and released a statement that the emails were not in the interest of national security.",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "wulliebullie",
        "time": "12 September, 2022",
        "context": "Run Hillary run! the country needs you!",
        "good": "0",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "meh_whatever",
        "time": "12 September, 2022",
        "context": "If seems that if Trump had destroyed the Classified content, it would more closely resemble what Dems do in these types of cases. Look up Sandy Berger for another example. ",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "liberal4ever",
        "time": "12 September, 2022",
        "context": "If you think Hillary should be charged, do you also then think Trump should be charged?",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "4bennett",
        "time": "12 September, 2022",
        "context": "Hillary, old Nutsy Pelosi and mad Maxine Waters are in a competition to determine which of them is the biggest “C” word. Hillary is ahead at the moment but old Nutsy is coming up fast.\nAdan Schiff was miffed when he found out he wasn’t included.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "vedder995",
        "time": "12 September, 2022",
        "context": "Turley is a smart guy but many smart people miss the obvious. He states that you don’t use a private e-mail server because it has more likelihood of being hacked by a foreign entity. Maybe that’s the official claim but more likely you use a private email server because you then have autonomy over what gets backed up and retained. Hillary would never have been able to get rid of all those emails if the server was backed up regularly like a government owned email server would be required to be.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dannyo66052",
        "time": "12 September, 2022",
        "context": "There are honest mistakes, factual errors, intentional falsehoods and outright lies.\nThe democrats believe we should think she made an honest mistake by deleting her emails.\nIt's a factual error to claim her server was secure and not hacked thereby giving the hackers free reign to read her emails.\nIt's an intentional falsehood to claim she mishandled classified information.\nAnyone who claims she had no classified emails on her server is an outright liar.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "bluestatehostage9",
        "time": "12 September, 2022",
        "context": "Hillary correctly concluded that she would be better off destroying the evidence than having it come to light, thanks to corrupt FBI Director Comey.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "anycapp",
        "time": "12 September, 2022",
        "context": "Maybe CNN should make a deal with Fox. CNN will call out Hillary's lies and Fox calls out Trump's lies. I know in that case Fox will be much busier than CNN, but if they are serious about calling out lies, they shouldn't have a problem with that.",
        "good": "1",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "dave7976",
        "time": "12 September, 2022",
        "context": "Anyone that pretends bleach-bitting a server, deleting emails, and destroying phones with hammers when they were all under subpoena is somehow ok while vilifying a former POTUS that is retaining documents that will go into the presidential library has to be so biased that they forego all critical thought.  Just admit that this is the stuff that people use for POLITICAL RHETORIC but is simply what our elected officials all either \"get away with\" or you hold ALL of them guilty not just Trump.",
        "good": "7",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "m36101",
        "time": "12 September, 2022",
        "context": "The Clintons have always considered “plausible deniability “ with truth. ",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "flackjacket5",
        "time": "12 September, 2022",
        "context": "Don't ever expect democrats to be fair or judicious. Don't ever expect their press to report the truth.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "orwellnailedit",
        "time": "12 September, 2022",
        "context": "What do they have on you Jonathan? Whatever it is, it is not worth sacrificing your credibility like this. Dont end up like Giuliani.",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "deplorable#1189",
        "time": "12 September, 2022",
        "context": "Criminals of the Biden Clinton Obama era are above the law because they paid them off!  We all know it. ",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "bosco33",
        "time": "12 September, 2022",
        "context": "Make the bag lady the Ambassador to Haiti....They'll just \"love:\" her there.....How much did you steal from the Haiti foundation?",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "ppt",
        "time": "12 September, 2022",
        "context": "Comey July 5 2016: \"From the group of 30,000 e-mails returned to the State Department, 110 e-mails in 52 e-mail chains have been determined by the owning agency to contain classified information at the time they were sent or received. Eight of those chains contained information that was Top Secret at the time they were sent; 36 chains contained Secret information at the time; and eight contained Confidential information, which is the lowest level of classification.\"  She is a crook and a liar.",
        "good": "5",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "Kahunanokaoi",
        "time": "12 September, 2022",
        "context": "Hillary, \"Oink\"",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "bob1981",
        "time": "12 September, 2022",
        "context": "Regardless of Clinton's practice of using a private server, no email should have classified information and be sent unencrypted. This is because the email distribution system is not secure. Any message you send--or that the government sends though email can be intercepted and clearly read if not encrypted.\nThe issue with Clinton is more of her mismanagement of government records then of the confidential nature of the emails themselves.",
        "good": "0",
        "bad": "7",
        "replies": []
    },
    {
        "user_name": "cyzr",
        "time": "12 September, 2022",
        "context": "Rat Hillary out and you end up in a box heading to the cemetery.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "stamplicker770",
        "time": "12 September, 2022",
        "context": "One thing that everyone knows now including our enemies is that America cannot keep secrets for long. Between the news media , Silicon Valley, and corrupt politicians the world knows our secrets. ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "justwondering61008",
        "time": "12 September, 2022",
        "context": "I was in the USAF with Top Secret/SCI clearance, and worked at NSA. If I had done what she did, I would have gone to prison...she should have.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "WhyAreYouSurprised",
        "time": "12 September, 2022",
        "context": "Shouldn't Trump have just as many investigations. Ooops, he has had more and has had to pay huge fines, had his charity shut down for fraud and had to pay 25 million in damages to fake Trump U students. ",
        "good": "1",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "Bullaaev",
        "time": "12 September, 2022",
        "context": "What was on the hammer crushed phones?",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "beachlover48",
        "time": "12 September, 2022",
        "context": "Why is the press not held accountable for fabricating lies in the media or not telling the whole truth. They embellish, fabricate and bend the truth when they should be held to an even higher standard of truth than your average person. They hold great responsibility, yet they lie.\n\nLet's start holding the left liberal media streams accountable !!!",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "foxgood",
        "time": "12 September, 2022",
        "context": "What happened to Durham, did he get a new house yet?",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "2Amatters",
        "time": "12 September, 2022",
        "context": "Is she STILL NOT PRESIDENT?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "blaino15825",
        "time": "12 September, 2022",
        "context": "Hillary lost a legal trivia quiz to Kim Kardashian. A washed up drunk.",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "demsareholdingmeprisoner",
        "time": "12 September, 2022",
        "context": "One of the most despicable liars ever to work in DC. She's right up there with Shifty and Biden.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "WhyAreYouSurprised",
        "time": "12 September, 2022",
        "context": "Someone asks how Trump declassifying a document put's our assets at risk. A member of a foreign government is sending us information. The information provided would indicate who is providing it. Trump declassifies it meaning anyone can read it. Now one of the spies wandering around MAL has access to it. And yes, we know there were spies at MAL.",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "thatchief",
        "time": "12 September, 2022",
        "context": "if Hillary Clinton was so bad, then why is it when Trump was president she was investigated on 3 different occasions and no charges were filed? \nTrump promised us he'd \"lock her up\", but instead Trump's DOJ let her off with no charges.  \none of two things is true: \nHillary Clinton is a criminal and Donald Trump was too impotent and incompetent to follow through on his promise of holder her accontable.\nHillary Clinton did nothing worth bringing forth formal charges.\nwhich is it?",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "noalibi40",
        "time": "12 September, 2022",
        "context": "Hillary not having classified emails on her private server is the same as Bill's DNA wasn't on Monica's blue dress. Clintons are corrupt criminals who should be in prison.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "leftistsarenotliberal",
        "time": "12 September, 2022",
        "context": "I read Hillary likes the rap song WAP. Please read the lyrics...",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "perfectlyflawed",
        "time": "12 September, 2022",
        "context": "All animals are equal; some are more equal than others.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "WhyAreYouSurprised",
        "time": "12 September, 2022",
        "context": "In Trump's court filings he has never claimed that they were declassified, because it would not matter. ",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "foxgood",
        "time": "12 September, 2022",
        "context": "When is Jesi Smolett going to jail?",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "WhyAreYouSurprised",
        "time": "12 September, 2022",
        "context": "Some of you are still hanging onto the Trump declassified them nonsense. 1. There is a process so assets (as in people in foreign countries working for us) are not compromised or have a chance to get out. 2. If Trump declassified without this step it means he is extremely lazy or incompetent. 3. Even if Trump declassified them, he does not own them. ",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "DocThomas",
        "time": "12 September, 2022",
        "context": "Monica for President!!!!!",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "smartthink",
        "time": "12 September, 2022",
        "context": "I think everyone just expects her to lie. ",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "WhyAreYouSurprised",
        "time": "12 September, 2022",
        "context": "If you are outraged by Clinton you must be apoplectic about Trump mishandling clearly classified documents.",
        "good": "1",
        "bad": "7",
        "replies": []
    },
    {
        "user_name": "4bennett",
        "time": "12 September, 2022",
        "context": "Hillary,aka satan’s daughter, never tells the truth about anything.if she’s speaking, she’s lying.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "WhyAreYouSurprised",
        "time": "12 September, 2022",
        "context": "Did you see the picture of the Russian spy with Trump and Lindsey Graham at MAL?\nIf not, why not?",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Gilcrest",
        "time": "12 September, 2022",
        "context": "Pretty simple based on all the \"what about Hilary\" cries here.\nBring Trump in for an 11 hour Hearing.",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "fixento104",
        "time": "12 September, 2022",
        "context": "Colors, no,  we are talking about the lack of character and ethics of the  writers and editors employed in the news media.   ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "pgalore",
        "time": "12 September, 2022",
        "context": "Media has always been corrupt- nothing new. ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "wlmmorenowthanever",
        "time": "12 September, 2022",
        "context": "Hillary looks more and more like a turkey.  ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "blaino15825",
        "time": "12 September, 2022",
        "context": "No news- liberals increasingly lie to America's face. Hillary does it, Kamala just told America that our southern border is secured when you can go to Live video streaming of people crossing illegally by the hundreds.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ohyeame2",
        "time": "12 September, 2022",
        "context": "I pay about as much attention to what the Mainstream Media says as what Hillary Clinton says.  They are both liars and morally corrupt.  ",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "patriotforever937",
        "time": "12 September, 2022",
        "context": "Everyone that has any common sense knows that Hillary is a liar and is unethical.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "trump42020",
        "time": "12 September, 2022",
        "context": "So thankful she was never president. Pray she never will be too",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "apparition",
        "time": "12 September, 2022",
        "context": "\"The Survival Primer\" (2015), Technique #14:\n\"A successful lie is not so much about stating untruths as it is about stating only part of the truth\".",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Lizzy436",
        "time": "12 September, 2022",
        "context": "It appears to me that Hillary has probably had to get a whole new wardrobe. Maybe her new designer is called Omar. ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "JD-41",
        "time": "12 September, 2022",
        "context": "I'm shocked, shocked to find that lying is going on in here with the Clintons.....with apologies to Casablanca.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "um0pap!sdn",
        "time": "12 September, 2022",
        "context": "ALL DONE BY THE DEMOCRATIC COMMUNISTIC REGIME\n\nFebruary 13, 1861.  Lincoln is supposed to be affirmed when the electoral votes are counted in the US Capitol building, but on the morning of the count, hundreds of anti-Lincoln rioters (your party) stormed the building. Their goal: to stop the electoral count.\n\nOn July 2, 1915, a former German professor at Harvard, Erich Muenter (a Democrat), planted a package containing three sticks of dynamite in the Capitol near the Senate Reception room. The explosive detonated around midnight and during a time when the Senate had been on recess.\n\nOn March 1, 1954, four democratic Puerto Rican Americans fired guns in the House of Representatives, injuring five congressmen.\n\nOn March 1, 1971, a bomb exploded in the Capitol building. While the explosion did not injure anyone, it caused some $300,000 in damage. A group calling itself the democratic Weather Underground claimed to be behind the bombing\n\nNovember 7, 1983, a bomb tore through the second floor of the Senate wing of the Capitol. The device detonated late in the evening and no one was harmed, but it caused an estimated $250,000 in damage. A group calling itself the democratic Armed Resistance Unit later claimed responsibility",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "FawnStomper",
        "time": "12 September, 2022",
        "context": "A person with nothing to hide doesn't smash their cell phones with a hammer. ",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bobbybinder",
        "time": "12 September, 2022",
        "context": "I seriously wish we could see all these swamp people get what they deserve, especially Clinton, Pelosi and Biden. But our society just isnt built that way, instead the rich get away with almost anything. ",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "BlueCoathanger",
        "time": "12 September, 2022",
        "context": "Nothing will ever happen to a Clinton, ever, until maybe judgement day.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "foxgood",
        "time": "12 September, 2022",
        "context": "Did Comey get a house out of that deal?",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "WhyAreYouSurprised",
        "time": "12 September, 2022",
        "context": "Trump must be in big trouble.\nClinton and California stories today. \nAnything about AOC?",
        "good": "1",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "bidensniffedme745",
        "time": "12 September, 2022",
        "context": "I can't wait to celebrate her death!!",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mrmiller",
        "time": "12 September, 2022",
        "context": "stolen classified documents. trump is in big trouble, Clinton emails AGAIN. no Hunter stories though",
        "good": "2",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "SJN710",
        "time": "12 September, 2022",
        "context": "The Clintons always get away with murder.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Clap8",
        "time": "12 September, 2022",
        "context": "And so it goes on...viewers of mainstream media exist in an alternate set of \"truths\".",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "angryfrightenedred",
        "time": "12 September, 2022",
        "context": "Oh no our savior is in trouble! Quick, talk about that one lady we don’t like!",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Demosthenes2",
        "time": "12 September, 2022",
        "context": "Turley tries to compare e-mails on a server with papers lying in a desk.\nWhich one can ANYBODY just pick up and read?\nTurley doesn't want to acknowledge the difference between a piece of paper anyone can read just by looking at it and a file on a server that has password protection which requires special access to read.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "CRW12",
        "time": "12 September, 2022",
        "context": "If just half of what Hillary has been accused of over the last decade is true she should be locked up.   It’s amazing that Democrats still worship her.   ",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "goodguy57592",
        "time": "12 September, 2022",
        "context": "No one wants to disappear for asking hillsy a hard question.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "seaden",
        "time": "12 September, 2022",
        "context": "Criminal charges were warranted. Clinton intentionally set up a private, unsecured computer server to circumvent having to use the government secured server, which would have subjected her emails to FOIA requests and scrutiny. In doing so, Hillary exposed Classified information to hacking by our enemies, which they did. Hillary then destroyed 33,000 emails that were under subpoena by the court.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "legacy's",
        "time": "12 September, 2022",
        "context": "We already know the media's true colors.  They are cheerleaders for this:  Out of control inflation, a “RECESSION,” stock market crash, unemployment rate up, record gasoline prices, record Federal debt due to out of control democrat spending to BUY votes, out of control crime, record deaths from drugs, school shootings resulting in deaths of school kids, millions of illegals pouring into the country, hundreds of billions spent on illegals, road deaths, Covid deaths, record homelessness, supply chain shortages, no baby formula, road rage incidents, kids failing at school, mentally ill boys calling themselves transgenders so they can take showers with the girls, 325 mass shootings in the past 7 months, hiring an IRS army of 87,000 agents and now lots of talk about food shortages this fall from the people who grow the food, the farmers.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "JoeBlowPayne",
        "time": "12 September, 2022",
        "context": "Thank you for finally acknowledge the real reason behind Hil’s use of a private server in the first place. She was trying to avoid scrutiny and FOIA regulations, which is also a violation of Federal code. The media writ large constantly overlooks this. Equal justice for all. ",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "R_U_Still_Winning",
        "time": "12 September, 2022",
        "context": "LOL Fox admits what Hillary said is technically true but can't admit that Trump flat out lied when he said he had no classified documents. ",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "ScienceofTruth",
        "time": "12 September, 2022",
        "context": "So it’s not criminal - to lock her up- for deleting emails and phones when\nThey are under subpoena? Good to know in case others ever have to deal with that .",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "childishlibs",
        "time": "12 September, 2022",
        "context": "If Hillary did not commit any crimes, why were there some many immunity from prosecution given to all of her staff?",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "loot&scootbiden",
        "time": "12 September, 2022",
        "context": "She wanted the information on her private server, the Feds asked her to turn it over, she then destroyed the server and deleted the emails.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mackhess901",
        "time": "12 September, 2022",
        "context": "More whataboutisms from the right. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "modpower",
        "time": "12 September, 2022",
        "context": "There is so much criticism towards those who \"hate\" Trump. Should the same criticism apply to all this hate toward Clinton?",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "53chieftain",
        "time": "12 September, 2022",
        "context": "They can dig up deleted emails from the time emails started and yet they can't dig up hers?",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "32ford",
        "time": "12 September, 2022",
        "context": "Hillary IS above ALL laws.. that is why so many people that have had dirt on her has committed suicide!! Think about that!!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bsmoke",
        "time": "12 September, 2022",
        "context": "It's really simple.  If her name was anything except clinton, would she have been arrested and tried?  Yep.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "loot&scootbiden",
        "time": "12 September, 2022",
        "context": "Comet was afraid of the Clintons. People around them die.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "charlie5729",
        "time": "12 September, 2022",
        "context": "Both Clintons should be in prison. But they are Democrats’ royalty…enough said.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jamesmoran1836",
        "time": "12 September, 2022",
        "context": "She’s the epitome of a professional gaslighter …. The more we break from the Matrix the more we see her true colors…",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bidensniffedme745",
        "time": "12 September, 2022",
        "context": "Imagine if Trump had burned all those documents after they had been subpoenaed, I'm sure they would have let him off with a warning, right?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "iffartshadteeth",
        "time": "12 September, 2022",
        "context": "one big difference between Trump and Hillary situations...Trump had executive privileges and Hillary didn't (she wasn't president)",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Sparker",
        "time": "12 September, 2022",
        "context": "When is hillarys funeral?",
        "good": "0",
        "bad": "0",
        "replies": []
    }
]