[
    {
        "error": "error"
    },
    {
        "error": "error"
    },
    {
        "user_name": "thevoiceinyourhead",
        "time": "21 December, 2018",
        "context": "A good 12ga would take care of that pronto.\n\nOh, and I find it hard to believe that this was able to go on for three days and they couldn't stop it.",
        "good": "16",
        "bad": "0",
        "replies": [
            {
                "user_name": "exradardan",
                "time": "21 December, 2018",
                "context": "You read my mind!",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "Sean-Seoltoir",
        "time": "21 December, 2018",
        "context": "\"Mr. Drone, meet Mr. Shotgun...\"",
        "good": "7",
        "bad": "0",
        "replies": [
            {
                "user_name": "RobertInSF420",
                "time": "21 December, 2018",
                "context": "Drone should have simply been shot down within the first 30 minutes by some marks-man.    Simple  What's the issue????",
                "good": "4",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "Sean-Seoltoir",
                        "time": "22 December, 2018",
                        "context": "If it is moving, it's not that easy of a shot with a rifle.  Since you said \"marksman\", then it implies a rifle, not a shotgun.  There's also the issue of any bullets that miss the drone eventually landing in a populate area and injuring someone.  You don't shoot skeet with a rifle.  A shotgun would be acceptable since the smaller pellets lose velocity from wind resistance quicker and it would be less of a danger to nearby people.\n\nOf course, we're talking the UK here, so they would have probably had to search for hours before they could have found someone with a shotgun that they could use.  Where I'm at, they would just go to the check-in area and ask if anyone had a shotgun and some ammo they could borrow.  Surely *someone* would be taking a hunting trip and carry a shotgun along with them.  Usually though, I only see people with handguns and rifles checking them in with their luggage.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "BillOckham",
        "time": "21 December, 2018",
        "context": "Even better, the advent of personal transportation using drone stabilizing technologies will eliminate the need for airports and airlines all together.  We'll be harder to terrorize or hold hostage when we all have autonomous and self directed flight capability, moving away from the military type control paradigm aviation currently labors under",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "HornlineOvertones",
                "time": "21 December, 2018",
                "context": "How tall of a wall are we going to need once there is a cheap 2-seater drone on the market?",
                "good": "3",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "johngc",
                        "time": "21 December, 2018",
                        "context": "No wall needed -- Deploy a bunch of pick up trucks with bed mounted \"Rocket powered CATCH NETS\". The nets will take down every drone at far less cost than walls and anti-aircraft batteries.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "Beefsock544",
        "time": "21 December, 2018",
        "context": "This author just droned on and on.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "kburk343",
        "time": "21 December, 2018",
        "context": "Pretty simple, just station the national guard at airports with orders to shoot down any drone that comes in and then trace the location & arrest the drone pilot",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "agangsnoopy",
        "time": "21 December, 2018",
        "context": "Back in 2013, two teenagers with a pressure cooker shut down a large portion of the City of Boston for nearly 4 days.  \n\nShutting down an airport for 3 days with a drone is pretty lame compared to that.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "JohnAO",
        "time": "21 December, 2018",
        "context": "Ohhhhh ... that was a DRONE!  I thought it was Pelosi's voice.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "azdutchdude",
        "time": "21 December, 2018",
        "context": "Nothing like a mandatory 10 yr federal prison sentence though. And in the wrong ethnic wing of the prison.",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "azdutchdude",
                "time": "21 December, 2018",
                "context": "\"Prisoner 382267, you are now known as Benjamin Dover.\"",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "error": "error"
    },
    {
        "user_name": "Fatboy'sgoinghome!",
        "time": "21 December, 2018",
        "context": "Fear monger much? Yikes",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "hfarquar",
                "time": "21 December, 2018",
                "context": "And yet the airport was shut down. Fear? No. As someone who has a masters in cyber security, specializing in drones, I can assure you that it is not fear mongering. Do research before posting next time.",
                "good": "3",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "texgeekdude",
                "time": "21 December, 2018",
                "context": "I'm guessing you weren't at the airport.  If you're not affected, it didn't happen, right?",
                "good": "4",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "azdutchdude",
                        "time": "21 December, 2018",
                        "context": "Mom wisely doesn't let him out of her basement.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "winmod97",
                        "time": "21 December, 2018",
                        "context": "I wasn't at WW II, so I guess that didn't happen either?",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "karmijones",
        "time": "21 December, 2018",
        "context": "I'm sure this is something that taxes and permits will take care of. That is how our protectors usually react with. Perhaps creating a new, massive, federal agency for drones? It won't accomplish anything but it will make the federal government larger.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bowman02",
        "time": "21 December, 2018",
        "context": "How long will it take the Brits to figure out that they can just shoot it down?",
        "good": "2",
        "bad": "0",
        "replies": [
            {
                "user_name": "DimsHaveNoPlatform",
                "time": "21 December, 2018",
                "context": "THey don't have gun lying around. maybe they can throw knives at them?",
                "good": "4",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "slacktoad",
                "time": "21 December, 2018",
                "context": "I take it you've never been to London airports.  They were patrolling them with MP5s back when American cops were still using .38s",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "slacktoad",
                "time": "21 December, 2018",
                "context": "I understand the problem completely and never suggested a rifle was an appropriate weapon in this situation. I was just responding to the guy who still believes the myth that British cops have no guns.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "fordprefec",
        "time": "21 December, 2018",
        "context": "We need to start by licensing drones and their operators like we do for private aircraft and their pilots. Every drone (just like all aircraft) should be required to have a transponder so it shows up on radar. Finally, we need to have severe criminal penalties for anyone caught violating these rules. Still, one has to wonder at all these expensive high-tech solutions for the problem when a 12-gauge shotgun loaded with the right type of shot would take care of the problem in short order!!!",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "slacktoad",
                "time": "21 December, 2018",
                "context": "While the shotgun idea certainly occurred to the authorities, from the videos it looks like it occurred to the drone operators too, they were zipping around in evasive maneuvers and staying at altitudes that would make them difficult targets.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "ignotus999",
                        "time": "21 December, 2018",
                        "context": "I understand that the reluctance to use snipers was due to concerns over stray shots and not inability to hit the target.  If the drone(s) were evading, they must be under direct control - which means their control signals can be traced and jammed.  They would also likely be within visual range of their controllers.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "slacktoad",
                                "time": "21 December, 2018",
                                "context": "True, but as usual with the case of some new threat, they didn't take the need for drone tracking and neutralizing seriously until such an incident occurred that caused real disruption and operational losses to someone.",
                                "good": "1",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "ZionistChristianConservative",
                "time": "21 December, 2018",
                "context": "It's already in the works.  The FAA is working with manufacturers now to find a low-cost, low-power and lightweight transponder solution",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "arkmark",
        "time": "21 December, 2018",
        "context": "Time to deploy the Army's new anti drone lazer tech to airports",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "californiamojo",
                "time": "21 December, 2018",
                "context": "Or a duck hunting gun",
                "good": "7",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "per89",
        "time": "21 December, 2018",
        "context": "Any duck hunter worth his salt and a 12 gauge shotgun would solve the problem for a lot less money.",
        "good": "9",
        "bad": "0",
        "replies": [
            {
                "user_name": "OrangeBowtie",
                "time": "21 December, 2018",
                "context": "You got that right!!",
                "good": "4",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "winmod97",
                "time": "21 December, 2018",
                "context": "I know some pretty good dove hunters too - like ME !",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "AlphaCentari",
        "time": "21 December, 2018",
        "context": "Just shoot them down.  What is the problem?",
        "good": "4",
        "bad": "0",
        "replies": [
            {
                "user_name": "princessroxana",
                "time": "21 December, 2018",
                "context": "God knows.",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "slacktoad",
                "time": "21 December, 2018",
                "context": "You can't use rifles, it's in a residential area; and airport security weren't equipped with hunting shotguns, and the training and protocols for using them on and around airport property.  It's not like they could have just put out a call for a bunch of hunters to show up and let them loose on airport grounds.  That would require security checks, residential gun use exemptions, and would be an insurance nightmare.",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "watchdoggie378",
        "time": "21 December, 2018",
        "context": "I believe Stephen Hawking warned about drones, not as if it would have changed anything. Actually I'm surprised someone didn't think of drone technology long before now with the RC industry we have had for so long.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "straightedge",
        "time": "21 December, 2018",
        "context": "Start shooting them down. Could also use Combat Drones to disable and trace.",
        "good": "4",
        "bad": "0",
        "replies": [
            {
                "error": "error"
            },
            {
                "error": "error"
            },
            {
                "user_name": "winmod97",
                "time": "21 December, 2018",
                "context": "Ducklk4 - Agreed. Maybe 00 Buck in 3.5\" mag - but still would need to be a heckuva lot closer.Ducklk4 -",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "ZionistChristianConservative",
        "time": "21 December, 2018",
        "context": "Commercial multicopter \"drones\" -- quadcopters, octacopters, etc -- all have a very limited flight time. About 15 minutes on average. Why hasn't Gatwick simply placed lookouts on rooftops with binoculars to follow these things back to where they land?",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "slacktoad",
                "time": "21 December, 2018",
                "context": "They probably did.  Reports say they have a \"person of interest\".",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "antihotair054",
        "time": "21 December, 2018",
        "context": "They should have despatched an RAF fighter aircraft to shoot down the drone.  There likely were thousands of aggravated holiday travelers who had their holiday plans disrupted. Also there needs to be tracking electronics at airports to identify the location of the person who is controlling the drone.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "PapawR1",
                "time": "21 December, 2018",
                "context": "Military drones, which are many times larger than these drones, are extreme difficult for a fighter to shoot down. Next to impossible for one to shoot one of these down. You use missiles at an airport with other planes in the air & the missile will be drawn to the larger target. Try to use the cannon on aircraft & all those rounds that miss will be hitting something on the ground like other aircraft, homes, cars, people, etc. Depending on how it's flying, a shotgun from the ground would be a feasible option but not a guarantee. They have technology that can do things, as the article stated, but it requires investing in & making that technology available at the airport.",
                "good": "1",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "slacktoad",
                "time": "21 December, 2018",
                "context": "Gatwick is a residential area.  What could a fighter fire at a drone that wouldn't end up embedded in someone's house?",
                "good": "3",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "Flyovercitizen16",
        "time": "21 December, 2018",
        "context": "Only because the brits were too cowardly to shoot them down. Spineless, neutered Europeans.",
        "good": "9",
        "bad": "0",
        "replies": [
            {
                "user_name": "DimsHaveNoPlatform",
                "time": "21 December, 2018",
                "context": "They would need guns to do that....and they're illegal.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "waldenhdj",
        "time": "21 December, 2018",
        "context": "Beware of all types of drones.  Maybe the most dangerous types are those that drone on and on in our government and the media.  They speak persistently in a dull, monotonous tone and spend years in dull or monotonous activity or in idleness droning their terms away.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "princessroxana",
        "time": "21 December, 2018",
        "context": "The British don't seem to be taking the problem seriously.",
        "good": "4",
        "bad": "0",
        "replies": [
            {
                "user_name": "hfarquar",
                "time": "21 December, 2018",
                "context": "Neither are we.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "error": "error"
    },
    {
        "error": "error"
    },
    {
        "error": "error"
    },
    {
        "user_name": "californiamojo",
        "time": "21 December, 2018",
        "context": "Man up, Britain.",
        "good": "4",
        "bad": "0",
        "replies": [
            {
                "user_name": "winmod97",
                "time": "21 December, 2018",
                "context": "Too late ....",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "Steve76020",
        "time": "21 December, 2018",
        "context": "So, why didn't they shoot it down?",
        "good": "4",
        "bad": "0",
        "replies": [
            {
                "user_name": "slacktoad",
                "time": "21 December, 2018",
                "context": "Airport security aren't equipped with hunting shotguns, or the training and protocols to use them.",
                "good": "2",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "Steve76020",
                        "time": "21 December, 2018",
                        "context": "They could call someone in who is, right?",
                        "good": "1",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "slacktoad",
                                "time": "21 December, 2018",
                                "context": "You can't just let civilians into a secure airport compound to shoot at things. There are security concerns, safety protocols, laws against civilian weapons use in residential and public spaces, insurance concerns, etc.",
                                "good": "2",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "user_name": "Steve76020",
                        "time": "21 December, 2018",
                        "context": "Hunting shotguns? who said anything about hunting shotguns?",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "error": "error"
                    }
                ]
            },
            {
                "user_name": "Steve76020",
                "time": "21 December, 2018",
                "context": "Umm...how about approved law enforcement types of people?  The ones with certification, weapons and the training to use them?  Who the heck said anything about civilians?  They (law enforcement) are in airports and handle issues all the time.",
                "good": "1",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "slacktoad",
                "time": "21 December, 2018",
                "context": "Not many cops would be certified on long barrel shotguns.  Imagine if it was a weapon he wasn't certified on, his personal weapon (not department issue), and shooting at an object not within police use of weapons protocols, and not an immediate threat to life.  It would not be approved, certainly on the spur of the moment.",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "slacktoad",
                "time": "21 December, 2018",
                "context": "What other weapon would you use in a residential area to shoot at a small flying object 300 or more yards away?",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "winmod97",
                        "time": "21 December, 2018",
                        "context": "300 yards ?  No such shotgun.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "slacktoad",
                                "time": "21 December, 2018",
                                "context": "That should have been 300 feet.",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "markmaki",
        "time": "21 December, 2018",
        "context": "I think this article screams more \"I need a proofreader!\" than \"let's do something about these drones!\"",
        "good": "2",
        "bad": "0",
        "replies": [
            {
                "user_name": "hfarquar",
                "time": "21 December, 2018",
                "context": "And thank you for being the grammar police. Now, how about addressing the content?",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "Incipio03",
        "time": "21 December, 2018",
        "context": "I believe I read another article awhile back that discussed specific hunting birds being trained to take out unwanted drones out of the sky over secure areas.  Maybe this is an idea.",
        "good": "3",
        "bad": "0",
        "replies": [
            {
                "user_name": "fahawks31",
                "time": "21 December, 2018",
                "context": "I LOVE THIS...THX U!",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "princessroxana",
        "time": "21 December, 2018",
        "context": "The British response was oddly lackidaisical to say the least. Almost like they preferred shutting down the airport to more proactive solutions.",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "SurlyDuffRedux",
        "time": "21 December, 2018",
        "context": "Let me guess..your company sells the exact products to address the \"problem\"",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "hfarquar",
                "time": "21 December, 2018",
                "context": "And it is a problem. It is people like you who bury there head in the sand that keep us in business.",
                "good": "4",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "idaholifestyle",
        "time": "22 December, 2018",
        "context": "Killer drone, it would assume the identity of the trespassing drone and when it returns to its home, boom!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "error": "error"
    },
    {
        "user_name": "brjn2",
        "time": "22 December, 2018",
        "context": "A helicopter with jamming equipment (to disable the drone) and radio tracker (to find the controller) would seem to be in order.\nAnd the perp, when caught, should be put in the stocks and placed where the inconvenienced travellers can reach him.  Rotten eggs, mushy tomatoes, wilted lettuce heads can be provided by the on-site restaurants.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jrb621",
        "time": "22 December, 2018",
        "context": "I give up, I read the story, watched the video, but didn't read or see how they stopped the drone or if the pilot just quit flying it.  Biggest question, why not just shoot it down, would take about 10 minutes, max.  They spent 72 hours doing what?",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "indyinde",
        "time": "22 December, 2018",
        "context": "There are a core of hard core sociopaths that are applauding this action.  The same type of person that derives glee from crashing a website or infecting computer systems 'for fun'.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "princessroxana",
        "time": "22 December, 2018",
        "context": "Gatwick seems to be perfectly happy shutting down even at unsupported reports of drones. Apparently no other solution appeals to them",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "LetsMAGAagain",
        "time": "22 December, 2018",
        "context": "We have the right to bear killer drones with arms as a part of a well rounded militia as prescribed in the second ammendament! MEGA!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "pilot222",
        "time": "21 December, 2018",
        "context": "I've been reading a lot of posts here about how to deal with the problem, from jammers to shotguns to nets to fines and prison. I don't think a lot of that would work for many reasons, but I have a sure-fire way to fix this problem. \n\nEvery time a drone interferes with commerce or aviation safety or even someone's sleep, just toss a small, tactical nuke into the area. The EMP from that will permanently ground any drones in the area. Perfect solution.\n\nI'm sorry. My sarcasm switch seems to be stuck in the ON position today.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "DATinVT",
        "time": "21 December, 2018",
        "context": "Is there really that much difference between a drone and a clay practice target? \n\n“Pull!”",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "error": "error"
    },
    {
        "user_name": "bede1319",
        "time": "22 December, 2018",
        "context": "Get one of those Navy Seal sharpshooter to blow it out of the sky.  The financial loss just might keep this clown from trying it again.  If not, get ANOTHER military sharpshooter to blow it to smithereens.",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "slacktoad",
                "time": "22 December, 2018",
                "context": "It's a residential area, firing into the sky with anything other than maybe buckshot is out of the question.",
                "good": "1",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "princessroxana",
                        "time": "22 December, 2018",
                        "context": "How about a shoulder mounted missile launcher?",
                        "good": "1",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "brjn2",
                                "time": "22 December, 2018",
                                "context": "A sniper with a radio-signal-detection scope (instead of heat vision) on his rifle.  Track down the root of the problem, not the toy he is playing with.",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "Sean-Seoltoir",
                "time": "22 December, 2018",
                "context": "Do you realize how difficult it is to hit a moving airborne target with a rifle?  Do you realize that if the shooter misses when he is firing in the air, the bullet will still be traveling at a lethal velocity when it does come to ground?  Do you realize that major airports in the UK are in well-populated areas?  Any round that could leave the confines of the airport property would be unacceptable.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "JimmyVerner",
                        "time": "22 December, 2018",
                        "context": "This is why you should use a shotgun.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "sufficientfun",
        "time": "22 December, 2018",
        "context": "The people flying the drone are probably the same ones selling the drone countermeasure equipment.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mayday2",
        "time": "22 December, 2018",
        "context": "A laser in the tower could have taken down the intruder.  Why not take the drone down and leave the airport open.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "error": "error"
    },
    {
        "user_name": "ducklk4",
        "time": "21 December, 2018",
        "context": "There should be a shut off access to the radio control in all drones. Then law enforcement can interrupt the signal and drop them to the ground or take over control. This will have to happen.",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "dusting",
                "time": "21 December, 2018",
                "context": "Wouldn't be all that difficult to modify.",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "Sean-Seoltoir",
                "time": "22 December, 2018",
                "context": "Well, with all the electric gimmicks being added to cars (keyless ignition and such), I would not be surprised if that didn't already exist (or will soon be added) in cars.  The thing with the drones though is that there are people who build their own drones, so any commercial backdoors like that would not apply.",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "dst6",
                "time": "22 December, 2018",
                "context": "No matter what they do some smart 17yr old will be able to figure out how to undo",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "saboog",
        "time": "21 December, 2018",
        "context": "Well... whack it and move on. What is the problem?",
        "good": "3",
        "bad": "0",
        "replies": [
            {
                "user_name": "Sean-Seoltoir",
                "time": "22 December, 2018",
                "context": "It's the UK, so what are they going to whack it with?  A cricket bat? :)",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "bede1319",
                "time": "22 December, 2018",
                "context": "The article is talking about if it comes to the USA.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "Sean-Seoltoir",
                        "time": "22 December, 2018",
                        "context": "If it comes to the USA, no problem... Just issue some drone-approved shotgun shells to the officers near the airport.",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "error": "error"
    },
    {
        "error": "error"
    },
    {
        "user_name": "tmctubes160",
        "time": "22 December, 2018",
        "context": "Is this the same London Airport that just a short time ago an Islamic Terrorist (Suicide Bomber) and his Terrorist Handler blew up. Killing innocent Civilians ?  We do Not need this coming to Our Country.. Build the Wall !   Fix our Out Dated Immigration Laws.. Tell the Democrats they will have to look some where else to get New Voters...",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "JimmyVerner",
                "time": "22 December, 2018",
                "context": "Walls won't keep out drones. It's too early to be drinking.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "alioli49422",
        "time": "22 December, 2018",
        "context": "Technical radar cross section advancement. Imaging on narrow and wide beam bands sweeping from numerous directions simultaneously. Discreet enough that organic intervention triggering a response differentiates between birds and drones. If a drone enters the perimeter an immediate response from the upper and lower house in London will form a committee to look into the matter before the end of next year.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "JimmyVerner",
        "time": "22 December, 2018",
        "context": "A few security guards with 12-guages out to do the trick. Personally, I can't wait until a drone flies over my property.",
        "good": "2",
        "bad": "0",
        "replies": [
            {
                "user_name": "slacktoad",
                "time": "22 December, 2018",
                "context": "These drones were flying two or thee hundred feet above ground and moving evasively.  Even a championship skeet shooter probably couldn't do it.  And they did have security with shotguns.",
                "good": "1",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "ducklk4",
                        "time": "22 December, 2018",
                        "context": "Exactly, with a shotguns effective range at 40 meters, a drone at 2,000 feet is safe from that.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "4givenbyhisgrace316",
                "time": "22 December, 2018",
                "context": "Sadly they are protected under FAA",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "4givenbyhisgrace316",
        "time": "22 December, 2018",
        "context": "Its called a gun, just like shooting clay pigeons.",
        "good": "7",
        "bad": "0",
        "replies": [
            {
                "user_name": "OliveCarrot",
                "time": "22 December, 2018",
                "context": "That's right. A shotgun loaded with 3 1/2 Turkey shot oughta do it.",
                "good": "6",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "4givenbyhisgrace316",
                        "time": "22 December, 2018",
                        "context": "Poor Londoners too bad they do not allow guns.",
                        "good": "4",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "ducklk4",
                        "time": "22 December, 2018",
                        "context": "With a 40 meter capability. Not really.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "disableretiree",
                "time": "22 December, 2018",
                "context": "I suddenly had one of my weird visions about the British and their very proper ways of doing things, and I was over run by the sight of hundreds of workers at UK's airports running around with butterfly nets.  Never the one to disturb the peace, eh Snuffy?",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "cwg1",
        "time": "22 December, 2018",
        "context": "I shot one down with a sling shot hovering over my property .......",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "pjdee",
        "time": "22 December, 2018",
        "context": "\"Hey, man. I was trying to get some cool nighttime videos of planes taking off. But every time I sent my camera drone over the runways, the air traffic all stopped. What's up with that? Huh?\"",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "fixitourselves",
        "time": "22 December, 2018",
        "context": "Shoot it out of the sky.  That is a one size fits all solution,",
        "good": "5",
        "bad": "0",
        "replies": [
            {
                "user_name": "ydraiggoch",
                "time": "22 December, 2018",
                "context": "Jamming works too. The frequencies needed to control one of those things are pretty easy to jam. Once jammed, it will crash, and can be recovered as evidence. \n\nIf I could jam sophisticated Russian systems fifty years ago, I'm sure we can do it better today. \n\nAlso, is anyone looking to see if this is part of a Russian or Chinese operation?",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "error": "error"
                    }
                ]
            }
        ]
    },
    {
        "user_name": "Bethcon3",
        "time": "22 December, 2018",
        "context": "If one hovers near my property, I`ll blow it out of the sky. get you Amazon packages another way. Period.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ydraiggoch",
        "time": "22 December, 2018",
        "context": "Some of those high flying drones cost thousands of pounds. Blow a few out of the sky with modern technology, and the punks will stop.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sstarke2",
        "time": "22 December, 2018",
        "context": "Russians",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "LouDE2018",
        "time": "22 December, 2018",
        "context": "Better solution would be to prohibit manufacturers from producing the damn drones, and marketing them to the general public. When there's money to be made, profits rule over saving lives, a key problem with a lot of products in the market that are misused for nefarious purposes.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "JebnickJones",
        "time": "22 December, 2018",
        "context": "The high school kids here have state tournaments where robots battle robots.  You mean to say that the military cannot develop counter-drone drones.  Mind-boggling.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "omeomi",
        "time": "22 December, 2018",
        "context": "I'm not sure the US would have the sense to shut down an airport - more likely a drone will bring down a plane full of passengers before the US takes action.   It's the famous American saying \"do something so it won't happen AGAIN\"....when there is a tragedy that should not have happened ONCE.",
        "good": "3",
        "bad": "0",
        "replies": [
            {
                "error": "error"
            }
        ]
    }
]