[
    {
        "error": "error"
    },
    {
        "user_name": "FranNC471",
        "time": "3 June, 2021",
        "context": "Scientific research is wonderful, but right now we have more pressing problems.",
        "good": "16",
        "bad": "16",
        "replies": []
    },
    {
        "user_name": "RedBug",
        "time": "3 June, 2021",
        "context": "What a GREAT IDEA to put liberals to work! Pay them to pilot and man rockets to Venus!",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "garlicnaan",
        "time": "3 June, 2021",
        "context": "I'm all for planet exploration, but you just know they're going to use Venus to perpetrate their \"climate change\" nonsense.",
        "good": "29",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "BlueClover",
        "time": "3 June, 2021",
        "context": "Venus was habitable until Dem Venusians used voter fraud to implement the Green New Deal.",
        "good": "59",
        "bad": "12",
        "replies": []
    },
    {
        "user_name": "chaffer",
        "time": "3 June, 2021",
        "context": "Yes please. Then soak the taxpayers for a few trill. Government's job is to build roads and keep us safe.",
        "good": "9",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "sassyandsowhat",
        "time": "3 June, 2021",
        "context": "What NASA has to say has no meaning for me.  It's what they DON'T say that I want to know about.  Considering they are a government agency and we support the government.  Every dime they spend is our tax money.  And we're the last to know.  Arrogant -- NASA and the black ops.",
        "good": "4",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "Fncisnumber1",
        "time": "3 June, 2021",
        "context": "Venus is just a hot Mars. Landers haven’t suffered the heat well.  ",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "carpenter4life",
        "time": "3 June, 2021",
        "context": "Send the liberals to Venus. Hope they burn up. It’s already hell there. So send them first class. ",
        "good": "15",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "rockdoc2",
        "time": "3 June, 2021",
        "context": "Highly doubtful, but NASA was never one to understand much about planetary and stellar evolution anyway.  I wouldn't worry....if it does happen it will be quite far in the future and humans will either have evolved and moved on or gone extinct; the latter being more likely.",
        "good": "18",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "eza283",
        "time": "3 June, 2021",
        "context": "This is a MONSTER waste of MONEY to leave beyond our planet for anything. ",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "supersecretsquirrel",
        "time": "3 June, 2021",
        "context": "send the leftist statists.  We'll keep the lights on.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mbradley4226",
        "time": "3 June, 2021",
        "context": "Umm....no. I can help NASA if they need it. It’s all laid out in the Bible. ",
        "good": "4",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "ReadyOnTheRight?-ReadyOnTheLeft?",
        "time": "3 June, 2021",
        "context": "What a collossal waste of  money.",
        "good": "5",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "NoDoubts046",
        "time": "3 June, 2021",
        "context": "You'd think money could be better spent on interstate highways and bridges.   But then again, that's just me.",
        "good": "6",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "davidcjones45622",
        "time": "3 June, 2021",
        "context": "No craft can long survive known surface conditions. The money could be better applied to lunar missions for a permanent presence.",
        "good": "39",
        "bad": "5",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "Apologize_in_the_Afterlife",
        "time": "3 June, 2021",
        "context": "Good place for  Greta Thunberg.",
        "good": "12",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "gonzajj",
        "time": "3 June, 2021",
        "context": "Please tell me we're not going there to say \"Ahah! This is what's going to happen to Earth!\" I mean it is one third closer to the sun, duh.",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "randy4usa",
        "time": "3 June, 2021",
        "context": "Pete B. says we should be probing Uranus.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bandito_01",
        "time": "3 June, 2021",
        "context": "Why not Jupiter's moons?",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rhugh",
        "time": "3 June, 2021",
        "context": "Biden has plans to explore uranus.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "supersecretsquirrel",
        "time": "3 June, 2021",
        "context": "whoopdefingdoo",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "iammyownfather",
        "time": "3 June, 2021",
        "context": "I wonder if this was one of the planets the Jews bragged about Destroying in their Talmud. Yeah there really could have been intelligent life there once. Just like what happened to Mars.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "iammyownfather",
        "time": "3 June, 2021",
        "context": "\"If the Jews and their Bolshevism wins then one day this planet shall once again float through the cosmos devoid of all life\" -Ad0lf H!tler",
        "good": "0",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "ACMEProducts",
        "time": "3 June, 2021",
        "context": "I think they're really going there to finally figure women out.",
        "good": "44",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "thunker54",
        "time": "3 June, 2021",
        "context": "Why always try to compare a alien world to Earth's standards?  Maybe Venus is the way it is because it was supposed to be that way.",
        "good": "26",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "wewil",
        "time": "3 June, 2021",
        "context": "Why? Does Venus have democrats too?",
        "good": "6",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "OliveBus",
        "time": "3 June, 2021",
        "context": "Nasa is too busy with black quotas.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "johngrun545",
        "time": "3 June, 2021",
        "context": "Venus is known as the earth's twin planet as far as size goes.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "LiberalLGBTrecruiter",
        "time": "3 June, 2021",
        "context": "Will give NASA the excuse to hire more scientists and forgo manned activities.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "MikeDarucki",
        "time": "3 June, 2021",
        "context": "In 5.4 billion years from now, the sun will enter what is known as the red giant phase of its evolution the earth will be consumed, and none of this will make any difference.",
        "good": "12",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "solace7",
        "time": "3 June, 2021",
        "context": "Good news.  Maybe we can build cloud cities there that float in the cooler layers of the atmosphere.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "lumenpraetorius",
        "time": "3 June, 2021",
        "context": "I have a summer home on Venus. Never use it.",
        "good": "37",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "gonzajj",
        "time": "3 June, 2021",
        "context": "The sun loses 4 million tons of mass per second and the earth is moving away from the sun 1.5 cm per year. So in a million years we'll be fine except still paying for the green new deal.",
        "good": "140",
        "bad": "16",
        "replies": []
    },
    {
        "user_name": "notmyheadaches",
        "time": "3 June, 2021",
        "context": "MASA just likes to waste money.   Help feed the homeless.  Hep educate those uneducated.  Help hose who have less than you.   Venus is closer to the SUN than we are.   You know that planet is cooked!!!’",
        "good": "1",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "OliveGoggles",
        "time": "3 June, 2021",
        "context": "Well if we ever had to leave we could live in venus' atmosphere as it has oxygen and water vapour. Just have to figure out how to get food and stay afloat...because the surface is a whopping 840 degrees and acidic.  I guess we could go sub terrainian. \n\nUntil we can make an atmosphere on Mars its a pipe dream.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "rightchange4us068",
        "time": "3 June, 2021",
        "context": "I'm guessing they speak in braille thats the reason for Venetian blinds",
        "good": "7",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "bandito_01",
        "time": "3 June, 2021",
        "context": "No wonder the \"UFO's\" don't want to make contact with us yet, we're still chasing our tails.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "DirtyHobo",
        "time": "3 June, 2021",
        "context": "Humans have occupied Earth for some 300,000 years.  A very minor time period of Earth’s existence of 4.6 billion years.  I would tend to believe that the human species will have managed to go extinct through some natural disaster, disease, war, or environmental catastrophe within the next 300,000 years.  Sure, maybe we’ll conquer Mars but at what cost.  Mars isn’t a very viable option anyway.  Very doubtful we’ll ever develop starships or any multi-light speed vehicles to reach other Earth like planets. Imagine, all of humanity gone for eternity and eventually devoured by the Sun in another 4.6 billion years…",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "PeterBravo545",
        "time": "3 June, 2021",
        "context": "I trust the Bible over any scientist any day. The Bible is the words of the creator of all things and He has plans that will be fulfilled after the 1000 year reign of Jesus Christ. I know that for a fact, because that's the God I serve.  He  has  never made a mistake in His revelations ....pb",
        "good": "4",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "madinmadison448",
        "time": "3 June, 2021",
        "context": "Venus is so much closer to the sun than earth there is nothing that could have prevented it from becoming too hot for life as we know it to survive, short of surrounding it with orbiting reflective panels to prevent radiant warming.  If earth starts to approach a runaway green house condition, we're going to have to bring back nuclear energy or at least use it to back up massive solar and wind energy.  Fossil fuels past another 50 to 100 years is just not in the cards for our planet.",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "oracularman",
        "time": "3 June, 2021",
        "context": "First! Learn to speak the language of the Universe. Then try finding if Earth will be like Venus. Waste of time, money and intellectual ability.",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "PeterBravo545",
        "time": "3 June, 2021",
        "context": "Tell NASA to save taxpayer's money, just read the Bible, the last Book in the bible The book of Revelation. They will have a verse by verse revelation of what the earth will be in the future. They will be in for some surprises.. a clue, it's going to be a paradise...... No tax money need to  be wasted at all.....pb",
        "good": "0",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "CyanCar",
        "time": "3 June, 2021",
        "context": "The money (we don't have) would be better spent propping up 3rd world dictatorships, wasteful government program spending, and defense contractors.",
        "good": "1",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "enofalcon",
        "time": "3 June, 2021",
        "context": "Obviously, people and equipment cannot survive long term on the surface of Venus (temperature, pressure, poisonous gases, etc.).  However, an enclosed gas-filled balloon permanently stationed at an altitude with an accommodating temperature is a distinct possibility for observation and study, and other purposes.  Probes, perhaps even manned probes, could be launched from the balloon for short term study of the surface.  By the way, I do not claim this as my original idea (though it sounds at least possibly feasible to me), I read about this strategy for colonizing Venus from another source, so smart people are at least looking into its feasibility.",
        "good": "5",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "RedFlower",
        "time": "3 June, 2021",
        "context": "Looks like a great 'Resort' planet for the 13% -",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Daisman215",
        "time": "3 June, 2021",
        "context": "Yep, in at least another 1000 years or more!",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "CyanTag",
        "time": "3 June, 2021",
        "context": "The heavens declare the glory of God;\n\n the skies proclaim the work of His hands.",
        "good": "7",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "GoldFish",
        "time": "3 June, 2021",
        "context": "I do think space exploration is important, but we need a better way of doing it. Perhaps invest in a space elevator so ships can be built at the edge of space.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "who'sthetrickster?",
        "time": "3 June, 2021",
        "context": "democrats burned venus, too?",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "DaDuke",
        "time": "3 June, 2021",
        "context": "Is this what happens in 7 years when AOC says we’re all going to die?  We just turn into Venus",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Hillarys_Thong",
        "time": "3 June, 2021",
        "context": "According to AOC we've only got about 10 years left anyway, so who cares?",
        "good": "14",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "CyanBasketball",
        "time": "3 June, 2021",
        "context": "Goddess on the mountain top\nBurning like a silver flame\nThe summit of beauty and love\nAnd Venus was her name\n\nShe's got it\nYeah, baby, she's got it\nI'm your Venus, I'm your fire\nAt your desire\nWell, I'm your Venus, I'm your fire\nAt your desire",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Michael572",
        "time": "3 June, 2021",
        "context": "Christians hate science and space, and capitalists don’t see the point in anything they can’t profit from. Why bother even putting the article on FOX? 🤔",
        "good": "3",
        "bad": "7",
        "replies": []
    },
    {
        "user_name": "more1776",
        "time": "3 June, 2021",
        "context": "The us ranks 24th in Science \n\nYou know right here on this planet.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "r_scottus151",
        "time": "3 June, 2021",
        "context": "Is NASA that stupid? Unless meteors hit, or you launch things out, the elements on your planets DO NOT CHANGE. The carbon, nitrogen, oxygen is still there.\n\nJust like here, we have transformed some but we didnt create it.\n\nVenus, is sulfer.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "jhnalaska",
        "time": "3 June, 2021",
        "context": "It's obvious that Venus at some point had cows.",
        "good": "41",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "sloanufop",
        "time": "3 June, 2021",
        "context": "Interesting what people post and believe. \nHere are some Venus facts:\nLike Mars and Earth, Venus are in the \"Goldilocks\" zone. Meaning it is in the right zone to heat the planet properly to support life.\nThe main theory on why it is so hot is because one side of the planet almost always faces the Sun. The mystery is why the side that faces away from the Sun is hot as well. It is theorized that a  'Green house\" effect heats the other side of the planet which holds in the heat collected from the sun side of the planet. Their are many other theories such as the solid core theory on this subject.\nThough one side of Venus almost always faces the Sun, it does rotate slower than it's solar year, but along with Uranus, in the opposite direction than all the other planets in our solar system.\nNASA's study should be interesting. Finding out why Venus is the way it is  could lead to humans colonizing it, but I don't see humans terraforming Venus until we can figure out how to get Venus rotating in a 24 hour period.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Indoctrination107",
        "time": "3 June, 2021",
        "context": "Nice CGI.  Fake pic of Venus.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "ehwtfynot",
        "time": "3 June, 2021",
        "context": "The story forgot to mention the poor Soviet Union.  Never the bride always a bridesmaid.  They managed to bury about a dozen probes on Mars.  Maybe 50 years they will manage to actually land one.  Or The moron in the White House will give them the secrets so they can finally join the party.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "searchkgbchurch",
        "time": "3 June, 2021",
        "context": "If we ever figure out how to live on Mars, the moon, or Venus, we will definitely do it by figuring out how to live underground on the least hospitable parts of the world like the Sahara, the Antarctic or under water without the routine resupply. Let's not kid ourselves.  We haven't invested much into that kind of living to think we can do that in another planet.",
        "good": "35",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "LordBaltimore",
        "time": "3 June, 2021",
        "context": "If infinity (measured in both space and time) multiplied by any number no matter how infinitesimally small, as long as it is not zero, equals infinity, then how many beings could there out there with your exact DNA sequence? How many Earthlike planets with Earthlike evolutionary patterns?",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "USMC_Drum_&_Bugle",
        "time": "3 June, 2021",
        "context": "I only need this rock to hold together for another 20 or 30 years, then it can collide with Venus for all I care.",
        "good": "11",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "USMC_Drum_&_Bugle",
        "time": "3 June, 2021",
        "context": "Men are from Mars; AOC should be shot into Venus.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "cate22",
        "time": "3 June, 2021",
        "context": "So this is why NASA wants to terminate SOFIA.  Keep ya hands OFF SOFIA..",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "TooWellToAttend",
        "time": "3 June, 2021",
        "context": "Anti Matters",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "Keep_it_Real444",
        "time": "3 June, 2021",
        "context": "NASA should just work up a \"WOKE\" report to support the new green deal and save the expense of a mission. It's all the Dems want, anyway, and they always get their way.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ackack1",
        "time": "3 June, 2021",
        "context": "It looks like China’s coverup has extended to Fox News.  Click the link and get a 404 error, but the stink is still there, and very strong.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "amerikarulez240",
        "time": "3 June, 2021",
        "context": "It appears that NASA needs to be reminded that the Sun is expanding ( global warming ) to the point where it will swallow Earth in a real distant future.   \"trust the science\".",
        "good": "8",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "adams795",
        "time": "3 June, 2021",
        "context": "ONLY If Earth's orbit moves 40 million miles closer to the sun, then there will be much warmer summers and winters.",
        "good": "8",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Tripod",
        "time": "3 June, 2021",
        "context": "The earth is already starting to look like Uranus. ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "gino13",
        "time": "3 June, 2021",
        "context": "Gosh, 90% of the population really is stupid",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "USMC_Drum_&_Bugle",
        "time": "3 June, 2021",
        "context": "Because you can never have enough maps of a planet's molten surface.",
        "good": "7",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "AJ6314",
        "time": "3 June, 2021",
        "context": "Spitball science. Climate Change and Covid pushed by the spitball “scientists”",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "r_scottus151",
        "time": "3 June, 2021",
        "context": "The only 3-4 options we have of colonizing the solar system is the Moon, Mars, Titan, Europa.\n\nThey have water, which we need to survive. The whole trick is radiation protection. Without that, we can not colonize.\n\nI mean, I was researching this the other week......Voyager 1 is still 300 years away from the Oort Cloud. The closest Star system is the Centauri, at 3.7 light years, at the edge of the Oort Cloud...Bard's Star..a little farther. 3,000 years away...and it drifts farther away.\n\n10 million years ago, there was a star only 0.7  light years away. It hit the Oort Cloud, and was most likely responsible for one of our mass extinctions.\n\nStars do not rotate the core of the Milky Way at the same speed.",
        "good": "7",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "OrangeBottleOpener",
        "time": "3 June, 2021",
        "context": "I have said for years that the way the politicians have been acting it seems clear that they know the Earth will die soon.  Which is why billionaires are trying to build rockets to Mars.  Just because we live here doesn't mean our planet is supposed to be around forever.  I wouldn't be surprised if all planets had life on them at some point.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Shuman59",
        "time": "3 June, 2021",
        "context": "The Earth will absolutely turn into Venus! When the Sun starts to die and it becomes a red giant, dont think much of us will be around to see that by then !",
        "good": "6",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "Hillarys_Thong",
        "time": "3 June, 2021",
        "context": "Ecclesiastes 8:17 Then I saw all the work of God, that man cannot find out the work that is done under the sun. However much man may toil in seeking, he will not find it out. Even though a wise man claims to know, he cannot find it out.",
        "good": "17",
        "bad": "8",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "captainsolon",
        "time": "3 June, 2021",
        "context": "Libby Morons will try to convince you humans destroyed Venus with 'man made climate change'.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "hillary’s_cankles_speak",
        "time": "3 June, 2021",
        "context": "Waste of money.",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "jawa904",
        "time": "3 June, 2021",
        "context": "What if the aliens did that to Venus and are swinging back around because we're next?",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "LiberalTearsLubricateMyGuns",
        "time": "3 June, 2021",
        "context": "Would it be possible to build many windmills and then position every cow’s anus orthogonally to these windmills such that we can use a cows wind to generate clean energy to offset the effects of cow wind?",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "AL.Lopez",
        "time": "3 June, 2021",
        "context": "Zoom out on the Venus pic above to about 75 - 67%. Do you see the two dark areas for the eyes, the one for the nose at the center, and the larger one for the mouth? Amazing.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "RedCone",
        "time": "3 June, 2021",
        "context": "At this point I'm more concerned about what the democrats will do to this planet than I ever was climate change",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "pinboy446",
        "time": "3 June, 2021",
        "context": "Thats why we need the green new deal right america!!! I'm joe methane biden and i approve this message.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "rw_yt",
        "time": "3 June, 2021",
        "context": "She's got it.  Yeah, baby, she's got it.",
        "good": "12",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Tim1952",
        "time": "3 June, 2021",
        "context": "I guess Klaatu has already been to Venus...\n\" Gort will return and turn your Earth to a burned out Cinder\"",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Tim1952",
        "time": "3 June, 2021",
        "context": "Gee aren't all the planets going to be burned to a crisp when the Sun expands to engulf all our whole solar system..5 billion years from now ...what the big deal",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "bunkerinspector578",
        "time": "3 June, 2021",
        "context": "Hot temperatures and gaseous tornadoes?  Sounds like Donald Trump's colon after a few hamberders...",
        "good": "2",
        "bad": "10",
        "replies": []
    },
    {
        "user_name": "RogerMushmoore",
        "time": "3 June, 2021",
        "context": "Lost habitable world, yay we’re headed that direction with Joe Blow in charge.",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "sho'nuff",
        "time": "3 June, 2021",
        "context": "When you back out and look at it on a geologic timescale, then back out a little more, the demise of Venus lines up almost perfectly with the release of the Chevy Suburban.  Coincidence?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "xtase",
        "time": "3 June, 2021",
        "context": "The only rainbow that matters is the one God puts in the sky, that same one your local scientists can only studer to explain.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Watcher2022",
        "time": "3 June, 2021",
        "context": "Venus is probably the hardest planet to learn about in the Solar System, or even outside the Solar System. The others just take a long time to get to. \n\nVenus is close, but atmospheric pressure and lead-melting temperatures destroy space probes (ours and Russians) almost as soon as they land.",
        "good": "23",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "ramvarg1973",
        "time": "3 June, 2021",
        "context": "According to scientists, a Mars size planet called Thea hit the Earth and that caused the creation of the moon. If the Earth survived a planetary impact, what can be worse? Earth was not made in China, this blue planet was carefully designed to survive even mankind and the actions of men is nothing to compared to what Earth has faced before.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "follower-of-the-x",
        "time": "3 June, 2021",
        "context": "Maybe NASA should ask Musk to terraform Venus, to cool it,\nso that it will become  another Earth.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dertod374",
        "time": "3 June, 2021",
        "context": "Anyone losing sleep at night over this?",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "HarryBaals404",
        "time": "3 June, 2021",
        "context": "3 plus years of Joe Biden and America will end up like Venezuela.",
        "good": "21",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "chile10001488",
        "time": "3 June, 2021",
        "context": "\"...The other mission will study the planet’s surface in hopes to learn \"why it developed so differently than Earth...\"\n\nIt was so disappointing to learn that most of the fears of global warming stemmed from the climate of Venus as if being, on average, 25,000,000 miles closer to the sun had nothing to do with it. They say they want to find out if there were ever any oceans on the planet but they would be a lot happier if they found proof that cattle once wandered the plains of the planet and farted their way to extinction.",
        "good": "15",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "LiberalTearsLubricateMyGuns",
        "time": "3 June, 2021",
        "context": "As long as we go 100 percent green within the next 5 years, I’m sure we will be OK.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "LiberalTearsLubricateMyGuns",
        "time": "3 June, 2021",
        "context": "I’m shocked AOC hasn’t cancelled swalwell",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Tim1952",
        "time": "3 June, 2021",
        "context": "Better get busy living...",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "buddye138",
        "time": "3 June, 2021",
        "context": "The bigger question is, Will the U.S. end up like Venezuela with this inept Administration?",
        "good": "15",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Groot321",
        "time": "3 June, 2021",
        "context": "I think we are destined to be a gas giant.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "SagittariusA*",
        "time": "3 June, 2021",
        "context": "Yes, the Earth will eventually end up like Venus. In a few billion years, as the sun expands, the earth will either get devoured by the sun or burnt to a crisp. I wouldn’t worry about it though. Humanity probably won’t last that long. ",
        "good": "21",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "nevercave",
        "time": "3 June, 2021",
        "context": "I'm totally over  Mars and really wish we would get back to the Moon.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "nestoftheeagle1",
        "time": "3 June, 2021",
        "context": "Under the Biden Administration the conclusion will be Global Warming.   There save taxpayers a few Billion on that Hoax.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "usnavy_vet",
        "time": "3 June, 2021",
        "context": "What a bunch of rubbish. Venus was never like earth and earth will NEVER be like Venus. ",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "nighthawk588",
        "time": "3 June, 2021",
        "context": "Venus is where dems come from",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "freedomRequiresChoice",
        "time": "3 June, 2021",
        "context": "$500 million to answer a question nobody cares to know and one that likely will be summed up with \"Venus is inhabitable by life that evolved on Earth, because it's much closer to the sun\". There you go, I'll charge a couple million, and I'm thinking Tom Wagner could learn a lot about life if he took up a job as an Amazon delivery driver, and be much more useful to society.",
        "good": "6",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "nj2fla",
        "time": "3 June, 2021",
        "context": "Plymouth you beat me to the punch....Very funny!!!!...I was wondering if the mummy  the dummy and destruction terror and violence for PROFIT Inc....(blm to you lefty)  visited Venus in one of their  past lives? the evidence appears apparent  !!!",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "scfarmer298",
        "time": "3 June, 2021",
        "context": "with democrats running things, earth will end up like Pluto...forgotten.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "croodness",
        "time": "3 June, 2021",
        "context": "Give Dems a chance!!!LOL They sent jobs to China and their citys are choking. Dems actually made it worse for the world . 15% of Californias pollution is from China.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "CitizenOfClownWorld",
        "time": "3 June, 2021",
        "context": "AOC sez we have 3 years...TOPS...before we end up like Venus.",
        "good": "5",
        "bad": "2",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "okiguess943",
        "time": "3 June, 2021",
        "context": "To destroy any planet, just send a space ship full of Democrats.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "scoben",
        "time": "3 June, 2021",
        "context": "Mostly harmless...",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "kornfed151",
        "time": "3 June, 2021",
        "context": "Venus has an atmosphere that can crush a car. Density of an atmosphere holds more heat. That’s why it’s very warm at sea level and cold in the mountains. Can’t compare the two planets",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "okiguess943",
        "time": "3 June, 2021",
        "context": "I say we give Democrats their own planet, Mars for example.  We'll even let them rename it to the planet Marx.",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "mr1776",
        "time": "3 June, 2021",
        "context": "Then what do you do with this “data”?   It’s science agency welfare.  I can think of a hundred scientific exploration initiatives that would be a better use of OUR money that would yield real and usable data. ",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "PlymouthRocks",
        "time": "3 June, 2021",
        "context": "Venus, one of the original victims of Climate Change...",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "sjeffery28",
        "time": "3 June, 2021",
        "context": "I hope so! ",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "C4Myself",
        "time": "3 June, 2021",
        "context": "When will Kamala visit there?",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "smokeg",
        "time": "3 June, 2021",
        "context": "AOC said the world would end in 12 years, so who cares about Venus.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "badshemp149",
        "time": "3 June, 2021",
        "context": "How much time do we have? Should I start spending my retirement savings now?",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tpc",
        "time": "3 June, 2021",
        "context": "The dumbest story of the day......so far",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "LastAmericanPatriot",
        "time": "3 June, 2021",
        "context": "What a load of pseudo science trash. Venus has no magnetic field to block radiation and the planet has practically no rotation so one side is constantly baking. Any similarity to earth is pure Science Fiction. ",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "repentsinners",
        "time": "3 June, 2021",
        "context": "Runaway greenhouse effect.  What more do you need to know?",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "TimothyOneTen",
        "time": "3 June, 2021",
        "context": "One nice, big solar flare in the right direction and the earth is toast, literally.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "JonesyOH",
        "time": "3 June, 2021",
        "context": "Hey NASA, it doesn't take a rocket scientist to realize that, just like Mercury,  Venus is outside our Sun’s habitable zone.  Unless the sun were to cool considerably, Venus is highly unlikely to have ever been habitable.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dan5047628",
        "time": "3 June, 2021",
        "context": "God destroys the Earth, be ready",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "lostlink_returns",
        "time": "3 June, 2021",
        "context": "NASA is looking for the SUV junkyards that are sure to cover the surface of Venus, a sure fire indicator of where all the atmospheric CO2 in the Venus atmosphere came from. 😛",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "otter",
        "time": "3 June, 2021",
        "context": "The sun is dying and gives off more heat as it novas. The earth is also moving closer to the sun as it's  gravitational pull increases.  There's  nothing to do. Study the oceans.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Balcon5407",
        "time": "3 June, 2021",
        "context": "who cares, just live for the day just live",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "onyoursixinca",
        "time": "3 June, 2021",
        "context": "I know Fauci says I'm \"low\" IQ, but I'm sure that Venus doesn't have little humans/life walking around cause of that big ol hot thing called the Sun being too close...\n\n  Just a idiotic guess, but darn, it sure does make since to this deplorable.\n\n  Go ahead and spend a lot of fossil fuels to confirm this though (going to Venus) and then cry \"global warming\" for me living life.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "inoit",
        "time": "3 June, 2021",
        "context": "What is wrong with our closest rock? The Moon?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "Hondoxp589",
        "time": "3 June, 2021",
        "context": "We can study Mars, and perhaps visit some day, but Venus? It will roast our space craft and crush it like a paper cup. The surface pressure is 1350 psi and the temperature 847 degrees in the shade. It is very hard to study Venus compared to mars.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ProudAmericanSon",
        "time": "3 June, 2021",
        "context": "I’ve always believed, when the sun was younger, it was hotter. Earth was at that time like what Venus is now. Mars was at that time in Goldilocks zone and much more like earth. As the sun continues to cool, Venus will become more Earth like, and the Earth will become more like Mars. Nothing we do will change this progression, but we can work towards moving to Venus one day, (probably millions of years from now if humans are still around). I think some ancestors of man once may have migrated here from Mars.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "lostlink_returns",
        "time": "3 June, 2021",
        "context": "I think NASA's probes to Venus should be carrying heat tolerant, cyanobacteria that can thrive in the Venus atmosphere.  You know, oxygenate the Venus atmosphere, cool that fire ball planet with a little bacteria powered terra forming.  Sell the real estate, to pay for the colonization of cold, dry, dusty, Mars.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jcc62",
        "time": "3 June, 2021",
        "context": "why is it so hot on venus ?\n\nthey are 25.71 million miles CLOSER........\nTHERE SAVE YOU (NASA) 500 MILLION DOLLARS......",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "markabbott",
        "time": "3 June, 2021",
        "context": "The answer is NO !",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "timothybrooks",
        "time": "3 June, 2021",
        "context": "ASTROOMY ALERT.  Tonight at Midnight a rare site will be visible.  Face due North.  Bend forward and look South, up between your legs and, at a 60 degree angle, you can see the rings around Uranus.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ImissToddStarnes",
        "time": "3 June, 2021",
        "context": "Yay science.\n\nBoo bible god.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "lostlink_returns",
        "time": "3 June, 2021",
        "context": "\"One will study the planet’s atmosphere, which could shed light on whether the planet once had an ocean. The other mission will study the planet’s surface in hopes to learn \"why it developed so differently than Earth.\"\"\n\nOne theory, Venus developed hotter than earth, because it is closer to that big furnace in the sky.",
        "good": "11",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "twistedmister",
        "time": "3 June, 2021",
        "context": "\"Will Earth end up like Venus? NASA hopes to find out\"\n\nYes, it will and we only have about 7 years left. \n\n-- AOC",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "karebru",
        "time": "3 June, 2021",
        "context": "\"why it developed so differently than Earth.\"\nNothing in the universe is \"developed.\" It is all in a constant state of development. Including the earth.\nAdapt and hang on for the ride.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "GrumpyBob",
        "time": "3 June, 2021",
        "context": "Shouldn’t they study Uranus first? That could explain a lot of human behavior. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dirkbroadcloth",
        "time": "3 June, 2021",
        "context": "Just as likely, slow heat death and loss of carbon in the biosphere due to natural sequestration.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "pagana",
        "time": "3 June, 2021",
        "context": "So don't worry about polluting the atmosphere.  Live your life and burn your garbage if you want.",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "heartland601",
        "time": "3 June, 2021",
        "context": "These cats are obsessed with finding evidence of the spontaneous nature of life.  They have a religious fervor that is unmatched by the most ardent believers in the god of Abraham.   They believe without question that if you get together a sack of minerals, baked them, shake them, jump up and down, and hold your mouth just so you will get a marvelous result, a bacterium.  They cannot accept the simple truth so evident that the earth and its life are specially created along with all the rest of universe.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "gabbyjohnson471",
        "time": "3 June, 2021",
        "context": "Its possible to study Venus, we need to send something indestructible to its highly toxic atmosphere...let's send Stacy Abrams",
        "good": "5",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "FudgeFactor700",
        "time": "3 June, 2021",
        "context": "Well, the more you learn, the less you know.  But keep on learning.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sgtchemistry225",
        "time": "3 June, 2021",
        "context": "I would argue that we already know that Venus is covered with an ocean.  \nNot an ocean of water, but an ocean of supercritical CO2.  They should \nsend some coffee on a round trip to be the first people to decafenate \ncoffee using another planet.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "notalib.",
        "time": "3 June, 2021",
        "context": "Let liberals run everything. We will be like venus in no time.",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "CyanTag",
        "time": "3 June, 2021",
        "context": "When I consider thy heavens, the work of thy fingers, the moon and the stars, which thou hast ordained;\n\n What is man, that thou art mindful of him? and the son of man, that thou visitest him?",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "bensue",
        "time": "3 June, 2021",
        "context": "anderson cooper and don lemon scolded NASA for this mission. they want to explore uranus",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "USMC_Drum_&_Bugle",
        "time": "3 June, 2021",
        "context": "AOC says they should take some pictures of Neptune on the way to Venus to save some money.",
        "good": "5",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "JIMBOC733",
        "time": "3 June, 2021",
        "context": "We must put more funding into science!! It’s sad that we have barely advanced day to day life other than touch screen phones. If Nikola Tesla was more supported and funded by the scientific community we’d live in a totally different world today. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "CyanTag",
        "time": "5 June, 2021",
        "context": "If everything from entangled electrons to atoms to living cells is actually hooked up and intercommunicating somehow, then connectivity just might be the key to a whole new way of understanding the universe. When we shift to the paradigm that everything is energy, suddenly many seeming conundrums begin to make a lot of sense. So far, the hunt for a medium of information exchange has lead scientists on a merry chase cooking up vortices and waves theories, space-time twists, superstrings, and quantum foam. Even the ancient concept of the ether has been resurrected as a possible answer to entanglement. But the simplest, most elegant theories take us straight back to creation and the idea that everything is energy and information when all is said and done it is obviously a created universe, created by God himself.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dan5047628",
        "time": "3 June, 2021",
        "context": "on the moon and mars they found dirt. On Venus molten dirt",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "edd911",
        "time": "4 June, 2021",
        "context": "Anything is better than sending more rovers to take pictures of more Mars rocks.  We already know it once had flowing water, quit showing us more pictures proving it once had flowing water.  No more panoramas of red hills made of red rocks. Enough already.  Bring on Venus.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "One_Hand_Clapping",
        "time": "3 June, 2021",
        "context": "The Venusians didn't take climate change seriously either.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "cmsgt(ret)89",
        "time": "3 June, 2021",
        "context": "waste of money",
        "good": "1",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "BlackCloud277",
        "time": "3 June, 2021",
        "context": "Well, the way the earth is going it might be the right course of action before we develop the ability for interstellar travel. We wouldn’t want to infect any other planetary systems with our earthly human disease. And I ain’t talking about the China virus either. Our race isn’t worth preserving. ",
        "good": "2",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "CyanTag",
        "time": "4 June, 2021",
        "context": "“God [is] the author of the universe, and the free establisher of the laws of motion.”\n—Physicist and chemist\n Robert Boyle\n(actual scientist)",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "NotVisible",
        "time": "4 June, 2021",
        "context": "I always wonder if we can terraform Venus.  It might be easier than Mars as atmosphere is already there.  A few large nuclear explosions in atmosphere could reduce pressure and eventual release heat into space?  Just a thought.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "scion777",
        "time": "3 June, 2021",
        "context": "Boring.  The outer moons & Pluto/Charon should be where the resources should be going.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "CyanTag",
        "time": "4 June, 2021",
        "context": "Atoms are weird stuff, behaving like active agents rather than inert substances. They make unpredictable choices between alternative possibilities according to the laws of quantum mechanics. It appears that mind, as manifested by the capacity to make choices, is to some extent inherent in every atom. The universe is also weird, with its laws of nature that make it hospitable to the growth of mind. I do not make any clear distinction between mind and God. God is what mind becomes when it passes beyond the scale of our comprehension.”\n“Technology is a gift of God. After the gift of life it is perhaps the greatest of God’s gifts. It is the mother of civilizations, of arts and of sciences.” \n“You ask: what is the meaning or purpose of life? I can only answer with another question: do you think we are wise enough to read God’s mind?”\n \n–Physicist Freeman Dyson. \n(actual scientist)",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bear_creek_angus",
        "time": "3 June, 2021",
        "context": "Send all the climate change scientists there to do research.",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "HitewOwerp",
        "time": "3 June, 2021",
        "context": "Yet more fairytales and waste of our tax money by the atheist \"scientists\" at NASA whose main goal is to discredit God's work. More than time to shut down this useless entity and redirect the much needed funds to our military.",
        "good": "1",
        "bad": "7",
        "replies": []
    },
    {
        "user_name": "CyanTag",
        "time": "4 June, 2021",
        "context": "“Astronomers now find they have painted themselves into a corner because they have proven, by their own methods, that the world began abruptly in an act of creation to which you can trace the seeds of every star, every planet, every living thing in this cosmos and on the earth. And they have found that all this happened as a product of forces they cannot hope to discover…. That there are what I or anyone would call supernatural forces at work is now, I think, a scientifically proven fact.”\n\n–Robert Jastrow, the astronomer and physicist who founded NASA’s Goddard Institute of Space Studies",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Truonics",
        "time": "3 June, 2021",
        "context": "Cool.  Just don't let Elon develop the autopilot for the missions.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bobobrazilnuts(assorted)",
        "time": "3 June, 2021",
        "context": "Levity Thursday: John Gray's novel \"Men Are From Mars Women Are From Venus\" will have to include a 'woke' afterthought and new title. \"Men Are From Mars But Can Be From Venus Woman Are From Venus But Can Be In Uranus\"",
        "good": "0",
        "bad": "0",
        "replies": []
    }
]