[
    {
        "user_name": "midnightblue250",
        "time": "2 August, 2022",
        "context": "We can use “solar sails” to fly large shipments of people and goods to Mars.  A “solar sail” is basically just like. Regular sail - it uses the currents of hydrogen gas that exist in space to propel space ships through outer space. \n\nSolar sails are much more efficient and clean than the nuclear fuels we use for rocket ships. \n\nMars has air, water, soil,  metals, and a temperate zone where daytime temperatures of in the “sweater weather” zone. Martians can light a campfire and have plenty of warmth.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "zedaneski",
                "time": "9 September, 2022",
                "context": "Because some leftist professors told you so?",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "midnightblue250",
                        "time": "9 September, 2022",
                        "context": "I have a degree in Remedial Advanced, and a masters degree in Science. I drafted my thesis about Mars’ habitability, but I have not yet submitted it.  ",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "zedaneski",
                                "time": "9 September, 2022",
                                "context": "I know, I'm paying for fantasy",
                                "good": "0",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "midnightblue250",
                                        "time": "9 September, 2022",
                                        "context": "Mars is teeming with what we in the Science community refer to as “microbial life.”  That is, animals and plants who are too small to see - they are exactly the same size as atoms, give or take a few millimeters.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "midnightblue250",
        "time": "29 July, 2022",
        "context": "We know a lot about Mars, and clearly it is habitable. \n\nMars has “polar ice caps” just like Earth, so there is plenty of water - we just need to melt it and Mars will have oceans, rivers and lakes.  Once Mars has water, fish and plankton can be sent there. \n\nMars has red soil so that means there is plenty of iron. With iron we can make steel to build houses. \n\nMars has air, just like Earth but somewhat colder. We can breathe Mars’ air but we would need heating coils to warm it before we inhale. \n\nWe can fly giant mirrors to Mars to focus sunlight on the ice caps and warm the planet up. After that it’s just a matter of sending like fish, grass seeds, and the basic life forms to get the ecosystem ready for us people. Easy.",
        "good": "1",
        "bad": "2",
        "replies": [
            {
                "user_name": "PaulDF",
                "time": "29 July, 2022",
                "context": "Have you lost your mind? “Habitable”? Not in the slightest!  The multi-billions of dollars in transportation alone, not to mention the more multi-billions of dollars to create habitats to allow even a few human beings to live beyond 30 seconds in the Martian atmosphere, maker the term “habitable” a very expensive joke. Set up a post in Siberia, that’s habitable.  Put a research station in the middle of the Gobi desert, that’s habitable.  Both very expensive with need of constant and ongoing resupply.  Mars is as “habitable” as the interior of an active volcano.  Don’t be foolish.  Mars colonization is science fiction.  Let the robots do their work. It’s fascinating to learn more about Mars and our other space neighbors, but setting up vacation villas there is just an expensive and impossible pipe dream.",
                "good": "0",
                "bad": "2",
                "replies": [
                    {
                        "user_name": "thunker54",
                        "time": "29 July, 2022",
                        "context": "One of the main goals of the Artemis missions to the moon is to learn and develop ways to self-sustain. Taking all the samples, weather measurements, looking at the terrain, etc on Mars is to prepare for a sustainable post on Mars. Mars (and even the moon) has the resources to make our own oxygen, make our own fuel and to extract/recycle all the water we need, to grow our own food, etc.\n When it comes to science you have to look at the possibilities of the future with an open mind. Going in with a \"it'll never happen because it's too expensive\" will get you nowhere.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "thunker54",
                "time": "29 July, 2022",
                "context": "I'm all for space exploration but I must take issue with breathing Mars' air. Mars atmosphere is 95% CO2, 3% nitrogen but only traces of O2 - hardly enough to support human life (Earth has 21% O2). We could, however, create our own from the ice caps and other ice deposits. But we'd have live in pressurized shelters since Mars' atmospheric pressure is less than 1% of Earth's at sea level. Personally I think underground would be best due to the very high cosmic radiation getting to Mars' surface. Living on the surface without adequate shielding would fry a man in short order.",
                "good": "1",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "siriusdogstar079",
                "time": "29 July, 2022",
                "context": "Some people know a lot about Mars. You ain't one of them.",
                "good": "4",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "midnightblue250",
                        "time": "29 July, 2022",
                        "context": "Un, I have actually been there.  So I think I know a little bit more than you about Mars. But thanks for playing! 😂",
                        "good": "0",
                        "bad": "2",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "jfllive1",
                "time": "30 July, 2022",
                "context": "I'm not going until they have a Walmart...",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "midnightblue250",
                        "time": "2 August, 2022",
                        "context": "Bezos has spaceships now. Maybe Mars can get Amazon deliveries.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "zedaneski",
                "time": "9 September, 2022",
                "context": "According to FJB’s American-Hating administration, humans know all about melting ice caps … GOOD There-BAD Here",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "firstnlast",
        "time": "3 August, 2022",
        "context": "private business gets funding by accomplishing tasks quickly. government gets funding by accomplishing nothing.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "zedaneski",
        "time": "9 September, 2022",
        "context": "Billions and billions and billions of tax dollars spent; for a bag of rocks in 2033?  Sounds exactly like FJB’s college vote buying programs ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "fakeitgoodnasa",
        "time": "28 July, 2022",
        "context": "As in Hollywood, anything is possible..",
        "good": "3",
        "bad": "0",
        "replies": [
            {
                "user_name": "lycopine",
                "time": "28 July, 2022",
                "context": "as in jesus land, all is fake...",
                "good": "0",
                "bad": "1",
                "replies": []
            },
            {
                "user_name": "penguinsfan87",
                "time": "29 July, 2022",
                "context": "You're not welcome here.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "fakeitgoodnasa",
                        "time": "2 August, 2022",
                        "context": "Yet here I am. Deal with it.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "cleath",
        "time": "18 August, 2022",
        "context": "Every time they send something it's labeled the thing that'll solve the mystery. Over and Over.. Now, it's billions more to return something.. They won't be happy and it'll be we gotta spend billions to go there",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dan5047628",
        "time": "3 August, 2022",
        "context": "11 samples in a year not bad. \nSo in ten years IF they have the technology they will go find them and bring them back to Earth unless they have been buried in a sand storm. \n\nSo now after they crashed the first helicopter they are going to bring two more. I'm glad the Brandon administration has so much of our money to spend.",
        "good": "0",
        "bad": "0",
        "replies": []
    }
]