[
    {
        "user_name": "chileman",
        "time": "24 December, 2018",
        "context": "So 2 innocent people got trashed by the press and their neighbors because of a rush to judgement.",
        "good": "18",
        "bad": "0",
        "replies": [
            {
                "user_name": "ilovebede",
                "time": "24 December, 2018",
                "context": "We've seen it before ... when the FBI accused that poor security guard - who was doing his job - of planting the explosive device in Atlanta.The man's life was destroyed and he died well before his time. Great work FBI - you can put that in your book of successes along with Ruby Ridge, Waco and the Unabomber, whose brother turned him in. Why don't you spend your time cleaning out your own house and take on real criminals like Jesse Jackson, Hillary Clinton, Al Sharpton - too many to name really.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "Boneszzfeed",
                        "time": "24 December, 2018",
                        "context": "Boy! You hit the nail on the head with that post.",
                        "good": "12",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "stupedaso",
                        "time": "24 December, 2018",
                        "context": "Yeah, I can tell you read the article.  There's no mention of the FBI.  That was the Sussex police.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "ilovebede",
                                "time": "24 December, 2018",
                                "context": "Well ... duh ... I can tell you didn't read my comment. I'm merely saying that we've seen what happens before when there is a rush to judgment by law enforcement - no matter where they are located. Go back to bed.",
                                "good": "7",
                                "bad": "1",
                                "replies": [
                                    {
                                        "user_name": "frizztop",
                                        "time": "26 December, 2018",
                                        "context": "He ain't named stupedo for nothin'!",
                                        "good": "3",
                                        "bad": "0",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "SquabbyMan",
        "time": "23 December, 2018",
        "context": "Time to call in Sherlock Holmes.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "2ndnlong",
        "time": "24 December, 2018",
        "context": "The droning was from Parliament.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "Bubbacrow",
        "time": "24 December, 2018",
        "context": "I've seen a drone with a real honest-to-god flamethrower on it clearing power lines of debris. All you would have to do is bump the drones propeller to down it. What am I missing here?",
        "good": "6",
        "bad": "0",
        "replies": [
            {
                "user_name": "chucklestheclown270",
                "time": "25 December, 2018",
                "context": "All you really need is a high power transmitter in the same band as the drones use (2.5 GHz?) and a highly directional antenna (shielded 20 element Yagi). This could be used to overload the drone's receiver's front end and cause the offender to lose control. Something like what I suggest would be no bigger than a small shoulder mounted rocket launcher.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "Bubbacrow",
                        "time": "25 December, 2018",
                        "context": "What do you have against flamethrowers? Merry Christmas brother.",
                        "good": "1",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "chucklestheclown270",
                                "time": "30 December, 2018",
                                "context": "Used correctly by a competent person a flame thrower is a useful tool, but in this case it doesn't have the range required and has too much risk of collateral damage.",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "happyasapigin",
        "time": "23 December, 2018",
        "context": "I don't get why they could not stop it.\nRadio Frequency and GPS jammers would cut the drones communications\nHelicopters or other drones with nets to snag it\n12  gauge shotgun with #10 shot would shred it without ground collateral damage\nEMP device like RF Safe-Stop used on cars would scramble the drones electronics\nRam it with another drone\netc etc etc",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Octavian343",
        "time": "24 December, 2018",
        "context": "The reason for such fear by authorities is that for under $25 you can build an EMP device that will destroy all electronics within a 1,000 foot radius. The EMP device can be mounted on a drone and used to disable the flight computers and control systems on the aircraft.\n\nOnce a drone with an EMP device downs a passenger plane then people the world over will come to realize just how dangerous air travel truly is in this modern age.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "1965Barracuda",
                "time": "24 December, 2018",
                "context": "Total  \"$25\"  BULL!",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "frizztop",
                        "time": "26 December, 2018",
                        "context": "Even 10,000 bucks would be considered cheap compared to the damage it could cause",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "grumpyrep",
        "time": "24 December, 2018",
        "context": "Doesn't anyone have a shotgun over there. Birdshot comes down virtually harmless. Drone comes down Period.",
        "good": "5",
        "bad": "0",
        "replies": [
            {
                "user_name": "1965Barracuda",
                "time": "24 December, 2018",
                "context": "The drone was at 2,000 feet.  Shotguns at best have a range 300 feet.",
                "good": "2",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "notlatereither",
        "time": "23 December, 2018",
        "context": "Perhaps Scotland Yard can call our FBI for help. They'll send a backflipping dancer right over.",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "vo142857",
        "time": "23 December, 2018",
        "context": "At least they had decency to clear suspects instead of claiming \"insufficient evidence\".",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "TheHardPoint",
        "time": "24 December, 2018",
        "context": "After hours of Waterboarding and the inhuman torture of having to listen to continuous Ultra Left Wing New World Order Islam favoring brain screwing speeches, as in drivel, piped directly through head-phones...  The innocent suspects were released to a Mental Hospital for observation and hopefully recovery form the ordeal...",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "traditionallady",
        "time": "27 December, 2018",
        "context": "Make it simple ban drones it solves the whole problem.limit them to government and select businesses as intended. Then you know who to look at.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "Phovos",
                "time": "20 January, 2019",
                "context": "Wow, another \"let's confiscate\", screw your rights, ding bat.   \nOverreacting much? Technophobe?",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "error": "error"
    },
    {
        "user_name": "jmorcan897",
        "time": "25 December, 2018",
        "context": "Hobby drones are easy to crash with a jammer. Every police department should have one.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "anyany1980",
                "time": "25 December, 2018",
                "context": "It’s actually very difficult.  The cheesy demo video is just a concept.  Nothing like that exists.  Dji has software that gives a backdoor to its drones, but it’s a 10,000 setup only sold to airports.  So, your wrong.",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "GreenMnM",
        "time": "25 December, 2018",
        "context": "The real news is that the couple that were arrested were detained on suspicion and interrogated for 36 hours without an attorney present because the male had a model remote controlled helicopter and they lived near the airport.  They were later released because they both were nowhere near the airport when the \"drone incursion\" occurred.  No warrant.  No evidence.  Just a hunch gets you arrested.  I think they should sue for false arrest.",
        "good": "8",
        "bad": "0",
        "replies": [
            {
                "user_name": "jmorcan897",
                "time": "25 December, 2018",
                "context": "British law nearly aways favors the state over the individual. The British lawyers who helped write the US Constitution screwed us up, too.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "samsausage",
                        "time": "26 December, 2018",
                        "context": "Too bad you feel screwed by our constitution. You may want to check on moving to South Africa or Zimbabwe. Their constitutions may be ideal for you, but only if you are a black person.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "frizztop",
        "time": "26 December, 2018",
        "context": "We here in Israel have a missile defense system called Iron Dome, which can detect and acquire an incoming missile, calculate its projected trajectory and, within seconds, launch an anti missile missile to blow the hostile incoming rocket out of the sky, if the hostile rocket is destined to land in a populated area.\nA little bit of software modification and the system should be able to handle drones.  \nBuy an Iron Dome system from us for every airport and problem solved. \nHeck, haggle with us and you might even be able to buy 10 and get 1 free.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "gregorius",
        "time": "25 December, 2018",
        "context": "Small, agile, hard-to-spot (and also hard-to-hit) remotely controlled drones are the military revolution of the 21st century. This may be just the beginning.",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "error": "error"
            }
        ]
    },
    {
        "user_name": "RyanTexan",
        "time": "24 December, 2018",
        "context": "It's actually easier to just print the news of when Government doesn't fail.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "frizztop",
        "time": "26 December, 2018",
        "context": "Of interest to me and not mentioned in the article is how the cops got hold of this couple in the first place,. I am assuming there are hundreds if not thousands of people living around the airport. Did the cops just blindly throw a stone and arrest the people in the house where the stone fell?",
        "good": "2",
        "bad": "0",
        "replies": [
            {
                "user_name": "Phovos",
                "time": "20 January, 2019",
                "context": "Yup, that's how cops work.   And once the arrest you, they toss a coin, head they win, tails you lose.\nYou has the fritz alright.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "PurpleAnchor",
        "time": "25 December, 2018",
        "context": "So in other words, there may not have even been a drone, just people \"reporting\" they saw one.  Hmm.  I guess people have a new way to disrupt flights with nothing more than a phone call.",
        "good": "3",
        "bad": "0",
        "replies": [
            {
                "user_name": "thefutilityman",
                "time": "25 December, 2018",
                "context": "I saw videos.  Were they actual drone incursions or file footage?",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "my_2_sense",
        "time": "27 December, 2018",
        "context": "Now that that's been settled, who done it?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "hipp56",
        "time": "25 December, 2018",
        "context": "Since IT IS GB I am surprised they don't require licences for all drones just like they regulate everything else there.",
        "good": "3",
        "bad": "0",
        "replies": []
    }
]