[
    {
        "user_name": "pinboy446",
        "time": "5 May, 2021",
        "context": "We need a space junk cleaning.",
        "good": "11",
        "bad": "0",
        "replies": [
            {
                "user_name": "flipper973",
                "time": "5 May, 2021",
                "context": "They're working on it. A giant vacuum cleaner.",
                "good": "4",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "ish407",
        "time": "5 May, 2021",
        "context": "I live 30 miles from the cape and get to experience these launches just by walking out my front door and looking to the east. It never ceases to amaze me how SpaceX has nailed rocket launches down to a methodical science. Sadly I don’t feel the same “wow factor” that I did when the STS program was still in effect but hey at least now I get to see launches almost on a weekly basis.",
        "good": "7",
        "bad": "2",
        "replies": [
            {
                "user_name": "n3wtym3",
                "time": "5 May, 2021",
                "context": "I'm jealous.  That's one heck of a porch view, 407.\n/cheers",
                "good": "4",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "thebestpolicy",
        "time": "5 May, 2021",
        "context": "There's more junk now floating around this planet thanks to nasa and Musk than Carter's liver pills!",
        "good": "1",
        "bad": "2",
        "replies": [
            {
                "error": "error"
            }
        ]
    },
    {
        "user_name": "starstreams",
        "time": "5 May, 2021",
        "context": "Once deployed and operational, there won't be a government on the planet that won't attempt to take control of them. UN, international treaties will all come together to track, control, and dictate to the population.",
        "good": "6",
        "bad": "5",
        "replies": [
            {
                "user_name": "n3wtym3",
                "time": "5 May, 2021",
                "context": "I hear what you're saying and don't come in assuming you agree with their (proposed) viewpoint.\n  Unlike, I WILL assume, the down-voters do :/\nHave a good Wednesday, SS",
                "good": "1",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "BlueBattery",
        "time": "5 May, 2021",
        "context": "great example of the narrow minded  misinterpreting what they see.....fake news101....",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "BlueMustache",
        "time": "5 May, 2021",
        "context": "Saw them over Texas a few weeks ago.  Pretty cool.  Still waiting for my Starlink kit to arrive.  C'mon Elon, I live in the country and need this really bad.",
        "good": "9",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "rolltide#1",
        "time": "5 May, 2021",
        "context": "I don't believe aliens are visiting our planet. However I would like to know what was filmed by the space station recently.",
        "good": "1",
        "bad": "1",
        "replies": [
            {
                "user_name": "starstreams",
                "time": "5 May, 2021",
                "context": "I agree. Not aliens. The people in charge do not want the average person to have any access to the \"alien\" technology.  The only thing alien about it is their alienation of us.",
                "good": "4",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "dreamofsiargao",
        "time": "5 May, 2021",
        "context": "They aren't triangle shaped by any chance are they?",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "OnePunch",
        "time": "5 May, 2021",
        "context": "dems be cameras tracking us drug deals !",
        "good": "2",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "SSN-664",
        "time": "5 May, 2021",
        "context": "Bull we's knows racist white lights when we's see em time for another mostly's peaceful protest \n                                                                                                                                            ------BLM",
        "good": "12",
        "bad": "7",
        "replies": []
    },
    {
        "user_name": "marrapash",
        "time": "5 May, 2021",
        "context": "I have shown my friends some of the UFO's I see travelling through the sky every night, but they say they are only airplanes. However if I can't identify them they're UFO's to me.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "thunker54",
        "time": "5 May, 2021",
        "context": "People seem to have this need to believe in extraterrestrial life and/or supernatural stuff.  I have a friend who ALWAYS jumps to \"UFO\" or \"Ghosts\" any time something happens he doesn't understand.  Once he swore it had to be an \"alien spaceship.\"  When I researched it and showed him the news report that what he saw, in the same location at the same time was a spent Russian rocket, he denied it - insisting it HAD to be aliens.  You just have to shake your head at people like that and move on.  If they are happy believing in the LEAST likely explanation, then I guess it doesn't hurt anybody.",
        "good": "4",
        "bad": "1",
        "replies": [
            {
                "user_name": "flipper973",
                "time": "5 May, 2021",
                "context": "I'm more concerned about the amount of space junk than I am aliens.",
                "good": "5",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "JD'Huntsville'AL",
                "time": "5 May, 2021",
                "context": "then I guess it doesn't hurt anybody.\nYES, it does. Remember, they get to vote.",
                "good": "5",
                "bad": "3",
                "replies": []
            }
        ]
    },
    {
        "user_name": "mrcharliek",
        "time": "5 May, 2021",
        "context": "How do people on Fox know how to feel about this since Trump hasn't commented yet. Is this a good thing? Or are these Dominion satellites being run by the deep state to track the covid vaccine microchips that have been implanted in our arms?  Hurry up Donnie, your people need to know.",
        "good": "2",
        "bad": "3",
        "replies": [
            {
                "user_name": "flipper973",
                "time": "5 May, 2021",
                "context": "You need to know. That's screamingly obvious every time you log in.",
                "good": "1",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "FOADDEMS",
                "time": "6 May, 2021",
                "context": "What, your handlers are still fixated on Trump, huh? After what's going on at the border, I guess you bleating sheep need something to fixate on? 100 days of pathetic DemocRATic pandering for more mindless voters, trying to turn this Nation into a fascist regime, a one party system, and the centrist voters are wondering what the hell they were thinking. Maybe one day soon your handlers will give you something else to mindlessly slobber over, like Caitlyn Jenner perhaps?",
                "good": "0",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "bohica98",
        "time": "5 May, 2021",
        "context": "Am I going end up having to buy yet another stinking service to use this?",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "jameswalters",
                "time": "5 May, 2021",
                "context": "You replace your current internet with it. You don't need to have both.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "error": "error"
    },
    {
        "user_name": "justsoldier",
        "time": "5 May, 2021",
        "context": "Pretty amazing I remember first satellite that only beeped, Elon has transformed space as much as any country has.",
        "good": "10",
        "bad": "2",
        "replies": [
            {
                "user_name": "flipper973",
                "time": "5 May, 2021",
                "context": "I find it fascinating. Everything about it. But, there are days when I'm a bit concerned that Elon is sending a huge amount of stuff into space. Some of it is crashing back to Earth. Intact.",
                "good": "1",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "rumrunner1",
                        "time": "5 May, 2021",
                        "context": "Those satellites are small and will burn up completely upon reentry.",
                        "good": "1",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "flipper973",
                                "time": "5 May, 2021",
                                "context": "Yes. Those will but other things aren't. I still want it to continue. Even with the risk. I've always seen space as our next frontier.",
                                "good": "1",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "AZbil",
                "time": "5 May, 2021",
                "context": "Elon can still beep he just recorded it now so he can leave to find a charging station in Gila Bend AZ and one in Maricopa AZ and one in Chandler, AZ and one in Phoenix AZ and one in Scottsdale AZ another one in Apache Junction, AZ and a tow truck to get to one in Tucson AZ etc....beep...beep.\nTurn the beeper off for extended range.",
                "good": "0",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "ProudRINO",
        "time": "5 May, 2021",
        "context": "Good for Fox!  After running that ridiculous article about UFOs the other day, I didn't think they would dare run the truth.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "JD'Huntsville'AL",
        "time": "5 May, 2021",
        "context": "Shows how easily people are duped into believing the impossible. \"Oh, my. Look at that string of lights. NOTHING human could have made that -- it MUST be extra-terrestrial.\" 9-9",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "AZbil",
        "time": "5 May, 2021",
        "context": "I still think they were moon pies did anybody taste one?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Truonics",
        "time": "5 May, 2021",
        "context": "aw shucks.  I was looking forward with glee to more fake UFO reports.",
        "good": "0",
        "bad": "1",
        "replies": []
    }
]