[
    {
        "user_name": "jared-taylor-amren-01",
        "time": "13 May, 2022",
        "context": "Some how, in some way, this thread will turn into a liberals vs conservatives debate.",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "Taiter",
                "time": "13 May, 2022",
                "context": "Well it is the liberals fault there is a dark side of the moon. ",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "CompetenceNotEquity",
        "time": "13 May, 2022",
        "context": "OMG!  This means we will solve inflation, high gas prices, gender confusion, CRT, the border crisis and everything else caused by Marxist and Fascist Democrats!  Finally!  Maybe now Liberals will not be so freaked about global warming!   Hallelujah!",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jeffhere",
        "time": "13 May, 2022",
        "context": "moon-weed, alright man!!",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dlnt",
        "time": "13 May, 2022",
        "context": "Exciting!",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "sherlockhomeless169",
        "time": "13 May, 2022",
        "context": "So when does Lowes start selling bags of lunar soil in the garden section?",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "politicalzoo",
        "time": "13 May, 2022",
        "context": "I've seen non scientists grow plants in a closet using nothing but water and chemicals.\nNot impressed...",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "OliveDice",
        "time": "13 May, 2022",
        "context": "Two plants grew eyes.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "ew1usnr",
                "time": "13 May, 2022",
                "context": "\"Feed me, Seymour\".",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "lefthandedrightminded067",
        "time": "13 May, 2022",
        "context": "Great. We’re supporting alien farmers over our own. 🥴",
        "good": "7",
        "bad": "0",
        "replies": [
            {
                "user_name": "gremlis",
                "time": "13 May, 2022",
                "context": "This administration prefers aliens over Americans.\nJust look at our Southern border.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "GreenChefHat",
        "time": "13 May, 2022",
        "context": "soon cannabis plants in space!",
        "good": "3",
        "bad": "0",
        "replies": [
            {
                "user_name": "mattsmithy",
                "time": "13 May, 2022",
                "context": "Space Weed trending on social media.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "error": "error"
    },
    {
        "user_name": "holdmybeer2",
        "time": "13 May, 2022",
        "context": "Oh wow! But, but.... Al Gore invented the Moon.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "billybob3000",
        "time": "13 May, 2022",
        "context": "Why is that surprising? Plants are already growing on 30 year old lava flows on the Big Island.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "GreenButterfly",
        "time": "13 May, 2022",
        "context": "That sounds great, as long as moon dwellers can develop a taste for thale cress that is less than six days old...oh...and stick it through their space helmets without suffocating or freezing to death.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "realdisplayed613",
        "time": "13 May, 2022",
        "context": "Spending billions to get dirt. Great idea.",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "jeffmork491",
        "time": "13 May, 2022",
        "context": "It will not work. Plants require nutrients that are provided by chemical mean or by decaying matter. The moon has no decaying matter. I can sprout a plant for 6 days on anything. ",
        "good": "25",
        "bad": "2",
        "replies": [
            {
                "user_name": "user46317",
                "time": "13 May, 2022",
                "context": "Have you been out to Kansas lately?  Take a look at what our food grows in these days and tell me you think it looks better than dirt from the Moon.",
                "good": "1",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "ddt305",
                "time": "13 May, 2022",
                "context": "Yep. A lot of wasted time and money for nothing significant.",
                "good": "0",
                "bad": "6",
                "replies": [
                    {
                        "user_name": "beadgBass",
                        "time": "14 May, 2022",
                        "context": "Read the original article, which is open access. There is a lot there that is significant.",
                        "good": "3",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "sherlockhomeless169",
                "time": "13 May, 2022",
                "context": "Green energy doesn't work either, but that hasn't stopped them from eliminating fossil fuel at every turn.  Maybe as part of the Green New Deal we'll be replacing Earth's soil with lunar dirt...with our tax money of course.",
                "good": "3",
                "bad": "5",
                "replies": [
                    {
                        "user_name": "conservativeintexas",
                        "time": "13 May, 2022",
                        "context": "Seems to me that there are still a few things that run on fossil fuel. Fossil fuel implements will be here for ever.",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "dash_riprocky",
                "time": "13 May, 2022",
                "context": "I've sprouted things in a wet paper towel.  Nothing to see here.",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "mattsmithy",
        "time": "13 May, 2022",
        "context": "You do a Mark Watney and take a bunch of big dumps (aka Johnny Deppy \"Grumpies\") and mix that in with the soil. You will be guaranteed to have a bumper crop of potatoes (aka Irish Grumpies).",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "NunSuch931",
        "time": "13 May, 2022",
        "context": "What good is the “soil “ if there’s no nutrients in it? Better off with hydroponics I would think.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Taiter",
        "time": "13 May, 2022",
        "context": "I bet the moons low gravity could make some enormous THC crystals. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "nothingbuta",
        "time": "13 May, 2022",
        "context": "Like, how much for lunar weed, dude?",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "Foreverusa",
                "time": "13 May, 2022",
                "context": "Twenty bucks but don’t ask how much for shipping ",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "OliveDice",
        "time": "13 May, 2022",
        "context": "Why did it take so long NASA to do the experiment?",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "user46317",
        "time": "13 May, 2022",
        "context": "This is good news.  It means that even our current galactically incompetent agricultural practices might leave a viable planet for whatever emerges after we've destroyed ourselves and most other life on Earth.",
        "good": "2",
        "bad": "3",
        "replies": [
            {
                "user_name": "endymio",
                "time": "13 May, 2022",
                "context": "The sky isn't falling, Chicken Little.  In fact, food production has risen steadily and dramtically every single decade for the last two centuries.   We're not \"destroying\" anything.",
                "good": "2",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "WhiskeyLima",
                        "time": "13 May, 2022",
                        "context": "A, stay on focus or us commoners will start to think.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "crampon54",
        "time": "13 May, 2022",
        "context": "…next up… Moon Weed… I bet it’s really out of this world…",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "bubba_d",
                "time": "13 May, 2022",
                "context": "Cheech and Chong plan to go to the moon ",
                "good": "2",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "bantytfv508",
                        "time": "13 May, 2022",
                        "context": "How am I driving?",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "crampon54",
                "time": "13 May, 2022",
                "context": "The Right Stuff",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "z3patriot",
        "time": "13 May, 2022",
        "context": "Check with John Kerry to see how this would effect climate change. We have to assure the Moon is woke.",
        "good": "19",
        "bad": "3",
        "replies": [
            {
                "user_name": "sherlockhomeless169",
                "time": "13 May, 2022",
                "context": "We should send him to the moon to ride around on his bike for the rest of his miserable existence.",
                "good": "0",
                "bad": "2",
                "replies": []
            }
        ]
    },
    {
        "user_name": "nayrb01",
        "time": "13 May, 2022",
        "context": "I'm no UF professor but I do farm and grow lots of things, and one thing I know for sure is just about anything will sprout in just about anything if the seeds are ready and watered, how long it last after that depends on many factors. not impressed by the third grade science study.",
        "good": "57",
        "bad": "4",
        "replies": [
            {
                "user_name": "11B3A",
                "time": "13 May, 2022",
                "context": "The seeds have just enough nutrients to be self-supporting and then will depend on the soil.  In this case, the equivalent to just silica sand.  Nothing surprising is seen here.",
                "good": "17",
                "bad": "1",
                "replies": []
            },
            {
                "user_name": "user46317",
                "time": "13 May, 2022",
                "context": "Bravo!   But don't underestimate third grade science.  Look arounds at what passes for adult science these days.",
                "good": "11",
                "bad": "2",
                "replies": [
                    {
                        "user_name": "endymio",
                        "time": "13 May, 2022",
                        "context": "It's better science than what passes for \"climate change\" research these days.",
                        "good": "5",
                        "bad": "5",
                        "replies": [
                            {
                                "user_name": "perkalator",
                                "time": "13 May, 2022",
                                "context": "I have this person muted. But I can guess. Doesn’t realize a watered seed will propagate in anything. If it survives to produce is a different story.",
                                "good": "0",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "user46317",
                                        "time": "13 May, 2022",
                                        "context": "You have him muted but don't feel constrained from commenting anyway?  I have a guess as to your party affiliation.  Anyone want to start a pool?",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": []
                                    }
                                ]
                            },
                            {
                                "user_name": "kwitchyerbeliakin",
                                "time": "13 May, 2022",
                                "context": "Climate change research is actually quite strong. It is not my line of research, but as an experienced scientist who has done a lot of refereeing of manuscripts, I can judge scientific research fairly well. You might not like the conclusion of anthropogenic global warming, but nearly every scientist in the world agrees that it is an obvious conclusion.",
                                "good": "4",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "endymio",
                                        "time": "13 May, 2022",
                                        "context": "Sorry, you just failed the basic test of the scientific method, despite your \"appeal to authority\" logical fallacy.  The success of any theory is judged not by counting noses, but by its predictive power.   The predictions of CAGW (catastrophic anthropogenic global warming) are many -- and they are all wrong.  Every last one of them.",
                                        "good": "0",
                                        "bad": "4",
                                        "replies": [
                                            {
                                                "user_name": "kwitchyerbeliakin",
                                                "time": "13 May, 2022",
                                                "context": "Fair enough. But first, learn what 'theory' means in science.\nThen tell us all how the predictions have failed. It appears to most objective observers that the predictions have come true with a vengeance.\nSo give us some evidence to the contrary. I don't mean what you read on a blog, I mean solid evidence that we can all assess.",
                                                "good": "4",
                                                "bad": "0",
                                                "replies": [
                                                    {
                                                        "user_name": "endymio",
                                                        "time": "14 May, 2022",
                                                        "context": "Go back and read the IPCC's first assessment report, in 1990.   Even though human emissions have dramatically exceeded their worst-case estimates, temperature increases have been far smaller than predicted.    Their predictions as to crop loss, drought increases, hurricane frequency increase, ocean rise acceleration -- all horribly wrong.     The fact remains that the planet IS warming -- but very, very slightly. And most of the effects of that warming will be positive, not negative.",
                                                        "good": "0",
                                                        "bad": "3",
                                                        "replies": [
                                                            {
                                                                "user_name": "kwitchyerbeliakin",
                                                                "time": "14 May, 2022",
                                                                "context": "You want me to go back to 1990, when accelerated global warming had only been confirmed in the early 1970s? Yes, they got some details wrong, but in principle they got most things right. So let's ignore the past 32 years of research. Models have become much more accurate, and Earth's warming is in the upper range of those models. Let's ignore that our planet is warmer and got warmer than in any other interstadial since the ice age began some 900,000 years ago. Let's ignore that CO2 levels topped out at 285 ppm in the previous three interstadials, and we are now at 419 ppm (with methane and other greenhouse gases up as well). Let's ignore that all of the top 10 warmest years in the historical record have been in this century, with the last decade far exceeding previous decades. Let's ignore the fact that sea level rise recently tripled from 1 mm per year to 3 mm per year, and with warmer temperatures on both poles, continental ice is melting faster so sea level rise will continue to accelerate.\n\nAs for the alleged rise of CO2 being \"positive, not negative,\" that is but a joke. Any benefits for crop growth in the northern regions are far offset by increased desertification elsewhere. Meanwhile agriculture is suffering everywhere, but especially in Australia -- it is a smaller continent so the agricultural changes are felt more rapidly and profoundly than here in North America.",
                                                                "good": "3",
                                                                "bad": "0",
                                                                "replies": [
                                                                    {
                                                                        "user_name": "endymio",
                                                                        "time": "14 May, 2022",
                                                                        "context": "ROFL, they got it right \"in principle\"?  The entire concept of positive-feedback based accelerated warming has been disproven by the data.  Despite the fact that human carbon emissions are 4X higher than they were in 1960, and 10X higher than in 1920, the earth isn't warming any faster.   Hurricane frequency is decreasing, sea level is rising much slower than it was 5,000 years ago, and global crop production is at the highest point in human history by far.  The sky isn't falling, Chicken Little.",
                                                                        "good": "0",
                                                                        "bad": "4",
                                                                        "replies": [
                                                                            {
                                                                                "user_name": "kwitchyerbeliakin",
                                                                                "time": "14 May, 2022",
                                                                                "context": "Well that response was entirely predictable. I've seen it so many times before, even though it is all false. You folks are impervious to facts, so you just parrot what your minders have told you to say, without looking at objective data such as what I presented.\nI am sorry, but I can no longer help you until you learn to think for yourself.",
                                                                                "good": "3",
                                                                                "bad": "0",
                                                                                "replies": [
                                                                                    {
                                                                                        "user_name": "endymio",
                                                                                        "time": "14 May, 2022",
                                                                                        "context": "I'm sorry to be a heretic standing against your religion of global warming.  But facts are indeed just that -- facts.   A scientific theory is judged by its predictive ability.  Whether you look at the global warming predictions from 1982, 1992, or 2002, none of them have come to pass.",
                                                                                        "good": "0",
                                                                                        "bad": "4",
                                                                                        "replies": []
                                                                                    }
                                                                                ]
                                                                            }
                                                                        ]
                                                                    },
                                                                    {
                                                                        "user_name": "sciencerocks",
                                                                        "time": "14 May, 2022",
                                                                        "context": "Well stated, but apparently it went WAY over the head of endymio.",
                                                                        "good": "1",
                                                                        "bad": "0",
                                                                        "replies": []
                                                                    }
                                                                ]
                                                            }
                                                        ]
                                                    }
                                                ]
                                            },
                                            {
                                                "user_name": "ArneSaknussem",
                                                "time": "14 May, 2022",
                                                "context": "You sound just like the Crreationists do. Anti-science, no substance.",
                                                "good": "3",
                                                "bad": "0",
                                                "replies": []
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "user_name": "arigatōjakkuwagonJō",
                        "time": "13 May, 2022",
                        "context": "These little gender questioned people will be the future of our country buddy!",
                        "good": "0",
                        "bad": "3",
                        "replies": []
                    },
                    {
                        "user_name": "angzarr",
                        "time": "13 May, 2022",
                        "context": "I know. Dissapointing.\n\nBut now I wonder who's responsible for the computer I'm working on, the networking that connects me, the computer that sometimes serves as a phone and would have taken up an entire room not too long ago that I carry in my pocket, the car I drive that can practically go farther between servicing than a car used be able to go over its entire life, those cars that drive themselves, my TV that gives me a better picture, takes up less room and less power than my last one and manages to cost less  as well, the technology that made it possible for me to be up and walking the dog the day after kidney surgery instead of weeks of recovery ... \n\nAll the people that you rely on to provide all the comforts of modern life would vigorously disagree with your third grade assessment. They can design and deliver all that incredible technology. What are your qualifications to judge?",
                        "good": "1",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "user46317",
                                "time": "13 May, 2022",
                                "context": "Huh.  If you drive a car, use the GPS system, or have heavy equipment deliver stuff, dig a hole, or pick up trash on your behalf, you're talking about me.  \nBSEE, MSEE, MBA.  In short, I'm an engineer who has had a front row seat to see how science is used and how it is turned to profit.\nBut I've had to watch medical science, social science and climate science from the outside as an interested person.  Enough to turn the stomach.",
                                "good": "0",
                                "bad": "1",
                                "replies": [
                                    {
                                        "user_name": "angzarr",
                                        "time": "14 May, 2022",
                                        "context": "You earned the exact same degrees as my father did. But there's a lot of EE and little BIO. I'm CS and MA myself, no BIO here either.\n\nI tried to find out more, but I couldn't find anything beyond the NASA press release at this point. The technical document is probably still under peer review.\n\nWhat I did find was that just like the standard mouse, there's the standard plant, Arabidopsis thaliana, basically broccoli's cousin. It been studied to death and there's even data about how it reacts in low gravity. You just don't go throwing some marigold seeds in there to see what happens.\n\nThey used soil samples from three different missions and volcanic ash as a control. None of the lunar samples did as well as the control and there were measurable differences in the soil from each mission.\n\nHere's the interesting part - because they know so much about Arabiwhatever, they're able to sequence RNA from the test plants and match what they see with the existing data. Because their dataset is so extensive they can pinpoint the exact stressors causing the stunted grown, and that gives the direction for genetically modifying a plant that can deal with the conditions.\n\nI've found that sometimes the other guy's job is a lot harder than it looks.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "drd64",
                "time": "13 May, 2022",
                "context": "Yep. Anybody who does their own landscaping knows that weeds and some grass can grow just about anywhere, including cracks in cement.",
                "good": "2",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "lakegirlaz",
                "time": "13 May, 2022",
                "context": "I for one hope Luna soil is able to grow plants. Then the Dems can live on the moon.",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "StudiesShow",
                "time": "13 May, 2022",
                "context": "You really read my mind. I grow pot in Rockwool insulation 🤣. Plants will grow in just about anything as long as it has Nitrogen, Phosphorus, and Potassium.",
                "good": "1",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "firstnlast",
                        "time": "13 May, 2022",
                        "context": "and the right ph",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "SageoftheAges",
                "time": "13 May, 2022",
                "context": "I planted  seeds in a wet paper towel when I was 8 and it grew! Then they died. So if we spread wet  paper towels over the surface of the moon we are good!",
                "good": "6",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "fedupbob",
                "time": "13 May, 2022",
                "context": "I regularly test grass seed stored in my basement before fall planting.  A moistened paper towel in covered plastic container not only sprouts the seeds but keeps them growing for over a month.  I see the same thing with grass seed spilled on the driveway during lawn planting.  As long as you keep it moist it will happily grow for weeks on concrete.",
                "good": "2",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "bikepharm",
                "time": "13 May, 2022",
                "context": "Was thinking nearly the same thing.",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "johnsmithusa1776",
                "time": "13 May, 2022",
                "context": "If people aren't up to NASA standards for hiring scientists under their equity program for 3rd graders, then just protest until it's lowered even more. SpaceX will be on Mars, while NASA is trying to get a cardboard box to fly. Yes, AOC, we know cardboard is recyclable too.",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "donwooly",
                "time": "13 May, 2022",
                "context": "I was about to post the same information, till I saw your post and all I need to post is \"ditto\". As far as their surprise I thought \"duh!\".",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "Gn+4gtn",
                "time": "13 May, 2022",
                "context": "Your correct. Basic plant Bio 101.  The “see or “nut” contains all it needs generally speaking until soil nutrients and light supplement  growth.  ",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "ConspiracyRealist1984",
        "time": "13 May, 2022",
        "context": "You can grow crops in water if you give the right food (hydroponics). \nSo the question is, did they use fertilizer? \nSeems like a non-story.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Civil_Whites",
        "time": "13 May, 2022",
        "context": "Let me know when you grow something on the moon. I can get pants to sprout in a wet paper towel",
        "good": "9",
        "bad": "1",
        "replies": [
            {
                "user_name": "3013422jt",
                "time": "13 May, 2022",
                "context": "You grow pants?",
                "good": "1",
                "bad": "1",
                "replies": []
            },
            {
                "user_name": "Usacitizen199",
                "time": "13 May, 2022",
                "context": "The pants had stunted growth so I guess they are shouts!",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "1Rebel007",
                "time": "13 May, 2022",
                "context": "I'm sure seeds would sprout in a box of nails it they had enough water.",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "endymio",
        "time": "13 May, 2022",
        "context": "\"All the plants .... looked the same up until about day six.\"\n\nWhat sort of \"scientists\" are these?  Seeds will sprout in literally anything if kept moist.  It's only after the first week or so that they begin to start drawing nutrients from the soil.\"",
        "good": "19",
        "bad": "2",
        "replies": [
            {
                "user_name": "widethoughts",
                "time": "13 May, 2022",
                "context": "\"NASA finally doled out 12 grams to the University of Florida researchers\n early last year, and the long-awaited planting took place last May in a\n lab.\"\nAre they saying they did these tests with less than half an ounce of lunar soil? The last lunar landing was 50 years ago in 1972. What are they saving them for if it's not to use them to test?",
                "good": "4",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "firstnlast",
                "time": "13 May, 2022",
                "context": "the same \"scientists\" that tell us the wuhan virus came about in \"nature\"..",
                "good": "1",
                "bad": "5",
                "replies": [
                    {
                        "user_name": "beadgBass",
                        "time": "13 May, 2022",
                        "context": "Actually those are different scientists who demonstrated by sequencing SARS-CoV-2 that it was of zoonotic origin. In other words, the coronavirus that causes Covid-19 originated in nature (no quotes needed.)",
                        "good": "4",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "endymio",
                                "time": "14 May, 2022",
                                "context": "The genetic sequencing showed no such thing, and the research claiming such have been shown to be conflicted with special interest.  You're about 18 months out of date.  Do try to keep up.",
                                "good": "0",
                                "bad": "2",
                                "replies": [
                                    {
                                        "user_name": "beadgBass",
                                        "time": "15 May, 2022",
                                        "context": "The initial genetic sequencing by a multinational team and the conclusion of a zoonotic origin was initially questioned. That is good, as that is how science works.  But since the coronavirus and its variants have been sequenced by virologists/geneticists around the world with no special interests other than getting at the objective analysis of the origins of SARS-CoV-2. In September last year in the journal Cell, a metastudy of these publications concluded that the origin of of the coronavirus was zoonotic.\nI just did a search of subsequent publications on the issue, and there have been no objections so far from the scientific community.\n\nDo try to keep up. In the interim, please learn some basics about science.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": [
                                            {
                                                "user_name": "endymio",
                                                "time": "15 May, 2022",
                                                "context": "Why do you liberals always believe it's ok to lie?  The metastudy in Cell did not \"conclude\" anything.  It stated that the \"most parsimonious explanation\" was a zoonotic transfer, but that, to quote, \"the possibility of a laboratory accident cannot be dismissed, and may be near impossible to falsify\".  In other words, they concluded we may never know with any certainty.",
                                                "good": "0",
                                                "bad": "1",
                                                "replies": [
                                                    {
                                                        "user_name": "beadgBass",
                                                        "time": "15 May, 2022",
                                                        "context": "Maybe you should learn what \"most parsimonious\" means.",
                                                        "good": "0",
                                                        "bad": "0",
                                                        "replies": []
                                                    },
                                                    {
                                                        "user_name": "beadgBass",
                                                        "time": "15 May, 2022",
                                                        "context": "P.S. I don't know where you get the idea that I am a \"liberal.\"\nIt just shows your complete lack of objectivity.",
                                                        "good": "0",
                                                        "bad": "0",
                                                        "replies": [
                                                            {
                                                                "user_name": "endymio",
                                                                "time": "15 May, 2022",
                                                                "context": "Sell it elsewhere, Cupcake.  False-flaggers are easy to spot.  And don't try to change the subject.  You lied about the study and its conclusions, and even had you not, its authorship taints it entirely.",
                                                                "good": "0",
                                                                "bad": "1",
                                                                "replies": [
                                                                    {
                                                                        "user_name": "beadgBass",
                                                                        "time": "16 May, 2022",
                                                                        "context": "I am sorry that scientific reality does not fit your politically convenient false narrative.",
                                                                        "good": "0",
                                                                        "bad": "0",
                                                                        "replies": [
                                                                            {
                                                                                "user_name": "endymio",
                                                                                "time": "16 May, 2022",
                                                                                "context": "The only \"scientific reality\" here, Princess, is your attempt to lie about the conclusions of a scientific study.",
                                                                                "good": "0",
                                                                                "bad": "0",
                                                                                "replies": [
                                                                                    {
                                                                                        "user_name": "beadgBass",
                                                                                        "time": "16 May, 2022",
                                                                                        "context": "Perhaps you failed to notice that it was a metastudy of many research publications. I told the truth. I am sorry that it went over your head.",
                                                                                        "good": "0",
                                                                                        "bad": "0",
                                                                                        "replies": [
                                                                                            {
                                                                                                "user_name": "endymio",
                                                                                                "time": "16 May, 2022",
                                                                                                "context": "You lied, plain and simple.  It was a metastudy, yes -- but it did not 'conclude\" that Covid was natural in origin.  It merely stated their belief that this was the \"most likely\" scenario, and specifically stated it could not rule out a lab leak origin.    Do you get it now, Cletus?",
                                                                                                "good": "0",
                                                                                                "bad": "1",
                                                                                                "replies": []
                                                                                            }
                                                                                        ]
                                                                                    }
                                                                                ]
                                                                            }
                                                                        ]
                                                                    }
                                                                ]
                                                            }
                                                        ]
                                                    }
                                                ]
                                            },
                                            {
                                                "user_name": "endymio",
                                                "time": "15 May, 2022",
                                                "context": "From the BBC:  \"A classified US intelligence report [says] three researchers at the Wuhan laboratory were treated in hospital in November 2019, just before the virus began infecting humans in the city....\"",
                                                "good": "0",
                                                "bad": "1",
                                                "replies": [
                                                    {
                                                        "user_name": "beadgBass",
                                                        "time": "15 May, 2022",
                                                        "context": "So?",
                                                        "good": "0",
                                                        "bad": "0",
                                                        "replies": [
                                                            {
                                                                "user_name": "endymio",
                                                                "time": "15 May, 2022",
                                                                "context": "Try to keep up.  In 2019, the PRC invokes emergency protocols, shuts down the Wuhan Virology lab, takes its DNA database offline, and installs entirely new safety measures.   A few weeks later, workers from the lab show up in local hospitals with severe Covid symptoms -- BEFORE the first case from this wet market ever appeared.   And immediately after the world discovers this information, China destroys every sample the lab possesses, which makes it impossible to ever determine exactly what they were working on, and when.",
                                                                "good": "0",
                                                                "bad": "1",
                                                                "replies": []
                                                            }
                                                        ]
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "sciencerocks",
                "time": "14 May, 2022",
                "context": "From what I've seen of your other posts on this article, you are in no position whatsoever to question the value of scientific research. Sprouting was the least interesting part of this research, though it showed that the moondust was not toxic to the germinating seeds. What was interesting was how the plants failed, and how they differed among samples from different sites on the moon.\n\nPlease do not confuse poor journalism with the actual science involved.",
                "good": "1",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "endymio",
                        "time": "14 May, 2022",
                        "context": "From what I've seen of your past posts, you should leave not only the science to others, but history, political, social, and military analysis as well.  We've known since the 1970s that moondust contains highly reactive compounds, which would need to be neutralized to act as an effective soil medium.  This \"research\" demonstrated no more than basic facts of biochemistry: roughly equivalent to a high school project demonstrating that adding fertilizer to plants allows them to grow better.",
                        "good": "0",
                        "bad": "2",
                        "replies": [
                            {
                                "user_name": "spinynorman262",
                                "time": "15 May, 2022",
                                "context": "Your arrogance far exceeds your paltry knowledge of science. Funny how you attack one of the few real scientists that we have commenting here.",
                                "good": "1",
                                "bad": "1",
                                "replies": [
                                    {
                                        "user_name": "endymio",
                                        "time": "15 May, 2022",
                                        "context": "Posting under your alternate account, I see.   Do you honestly believe you're fooling anyone?",
                                        "good": "0",
                                        "bad": "2",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "Raetel8591",
        "time": "13 May, 2022",
        "context": "Great…. Now can you do something for the food supply here at home !!!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ragtimer",
        "time": "13 May, 2022",
        "context": "I can't wait to eat some moon salad!",
        "good": "1",
        "bad": "1",
        "replies": [
            {
                "user_name": "WhiskeyLima",
                "time": "13 May, 2022",
                "context": "I thinks you have already started.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "ragtimer",
                        "time": "13 May, 2022",
                        "context": "I started with the moon pizza.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "CMAG🇺🇸",
        "time": "13 May, 2022",
        "context": "It seems that life would be much simpler on the Moon!  ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "nayrb01",
        "time": "13 May, 2022",
        "context": "The more interesting question is why choose a weed (thale cress)  that already has a reputation of growing in just about every soil environment, how about something more like actual food.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "williamm23",
                "time": "13 May, 2022",
                "context": "Potatoes, would be a valid test.",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "nayrb01",
        "time": "13 May, 2022",
        "context": "I hope no one here has sent their kids to UF for Horticultural and paid a LOT of money to learn what they should have learned in grade school.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "leevancleef",
        "time": "13 May, 2022",
        "context": "The moon is flat.",
        "good": "2",
        "bad": "0",
        "replies": [
            {
                "user_name": "WhiskeyLima",
                "time": "13 May, 2022",
                "context": "Looked flat in the picture I saw.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "the1stbest_54467",
        "time": "13 May, 2022",
        "context": "When can expect that extra potent 'Moon Weed' to hit the illicit drug market...?",
        "good": "7",
        "bad": "0",
        "replies": [
            {
                "user_name": "pic966",
                "time": "13 May, 2022",
                "context": "oh the dark side!",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "LostForWords720",
        "time": "13 May, 2022",
        "context": "Druggies— It would give a whole new meaning to the term, “All spaced out”",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "raregenxer",
        "time": "13 May, 2022",
        "context": "It took them over 50 years to do this???",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "SpongeJoe_DumpinPants_",
        "time": "13 May, 2022",
        "context": "\"The fact that anything grew means that we have a really good starting point, and now the question is how do we optimize and improve,\" said Sharmila Bhattacharya, NASA's program scientist for space biology.\n\nTranslation: \"I'll do anything to keep my job.\"",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "RedCherries",
        "time": "13 May, 2022",
        "context": "Space is fake.  Just FYI.  It’s just another one of their deceptions.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "greg2024backagain",
        "time": "13 May, 2022",
        "context": "An expensive way to grow a garden",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "alleycat99",
        "time": "13 May, 2022",
        "context": "Wait!?? Since 1969 we are just testing this??? Oh, that's right...we thought it was made out of cheese!!",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "lcconservative",
        "time": "13 May, 2022",
        "context": "Did they use lunar atmosphere and lunar water?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bubba_d",
        "time": "13 May, 2022",
        "context": "isn't the moon made of cheese?",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "buster_bluth",
                "time": "13 May, 2022",
                "context": "Maybe they grew mold.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "imoverherenow999",
        "time": "13 May, 2022",
        "context": "Any soil that retains water should support the growth of most seeds.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "ReadyOnTheRight?-ReadyOnTheLeft?",
                "time": "13 May, 2022",
                "context": "A little mulch, a little nitrogen, and voila,  you haven't learned anything new.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "ReadyOnTheRight?-ReadyOnTheLeft?",
        "time": "13 May, 2022",
        "context": "Nobody will ever live on the moon, or Mars.  It's pointless.",
        "good": "1",
        "bad": "2",
        "replies": [
            {
                "error": "error"
            }
        ]
    },
    {
        "user_name": "buster_bluth",
        "time": "13 May, 2022",
        "context": "Meh. Put the right nutrients in any kind of granular substrate and it will grow seedlings.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "TheDoctor742",
        "time": "13 May, 2022",
        "context": "Took em fifty years to figure this out? ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "FoxViewersHateReality",
        "time": "13 May, 2022",
        "context": "So the seeds sprouted - BIG DEAL. You still need NUTRIENTS for plants to actually grow.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "goat34",
        "time": "13 May, 2022",
        "context": "I’ll bet there’s real science going on with this stuff but for the love of Pete spare us from such sophomoric news releases. ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sassyandsowhat",
        "time": "13 May, 2022",
        "context": "I think they sprouted because of the water they were given.  The soil simply held them up.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "imsmarterthanyou873",
        "time": "13 May, 2022",
        "context": "\"Researchers had no idea....\"  They should have found different researchers. Science has pretty well figured out what it takes to grow a plant.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "ReadyOnTheRight?-ReadyOnTheLeft?",
                "time": "13 May, 2022",
                "context": "6000 years ago.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "murdoc926",
        "time": "13 May, 2022",
        "context": "U got to start somewhere?? So this is good science despite results.. problems no worry .. we lost life mercury mission  ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "WhiskeyLima",
        "time": "13 May, 2022",
        "context": "\"Researchers had no idea if anything would sprout in the harsh moon dirt\" knowing the chemical composition of the dirt beforehand they must not be real intelligent researchers. I think they are trying to add a little drama here.",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "godislove558",
                "time": "13 May, 2022",
                "context": "Probably looking for more funding.",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "wiseguy2017527",
        "time": "13 May, 2022",
        "context": "You could also bring tanks of water and grow hydro based plants packed with nutrients and not susceptible to the same troubles of oxidized growth.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "soldierscotty095",
        "time": "13 May, 2022",
        "context": "Seeds will sprout in anything. But the soil has to be conducive to life. Do a soil analysis. Amend the soil accordingly, and you will grow plants. Is it feasible? IDK?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ronfloth",
        "time": "13 May, 2022",
        "context": "Only took 45 years to figure it out ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "it's-ame,mario!",
        "time": "13 May, 2022",
        "context": "Most seeds will sprout anywhere.",
        "good": "4",
        "bad": "0",
        "replies": [
            {
                "user_name": "bantytfv508",
                "time": "13 May, 2022",
                "context": "With water.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "SeekHim",
        "time": "13 May, 2022",
        "context": "How many k-billion dollars spent for this experiment I wonder. There are many soils here on earth that could be used to feed people which actually would be helpful.  All the continued spending to go explore other planets and we still have places here on earth that hasn't been explored seems like a waste.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "luk3",
        "time": "13 May, 2022",
        "context": "That's nothing compared to the potatoes Matt Damon grew on Mars.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jonwik3",
        "time": "13 May, 2022",
        "context": "You can grow anything where water exist",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "williamm23",
        "time": "13 May, 2022",
        "context": "Does it really mean anything? I can get a sprout in a jar of glass marbles. There is a lot more in an active growing soil, minerals and biological elements.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jmichaelj",
        "time": "13 May, 2022",
        "context": "A seed will germinate laying on a slab of concrete if you keep watering it. And it can live and grow in a pot full of styrofoam beads so why are they excited that a seed germinated and then struggled to survive.",
        "good": "10",
        "bad": "0",
        "replies": [
            {
                "user_name": "vol_in_socal899",
                "time": "13 May, 2022",
                "context": "NASA has become Woke.  I'll leave it at that.",
                "good": "1",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "trumpstormy2024020",
                        "time": "13 May, 2022",
                        "context": "I am sure you are qualified to clean toilets at NASA.",
                        "good": "3",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "jmichaelj",
                                "time": "13 May, 2022",
                                "context": "About as sure as I am that you don't have the first clue as to what NASA's qualification standards are.",
                                "good": "0",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "angzarr",
                                        "time": "14 May, 2022",
                                        "context": "His reply was witty.\n\nYour retread was not.\n\nReally? The best you can do is, \"I know you are but what am I?\" It's not fifth grade anymore dude, you need to up your game.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "angzarr",
                "time": "13 May, 2022",
                "context": "A seed won't germinate and grow in potash no matter how much you water it. Is lunar soil more like potash or styrofoam beads? A chemical analysis would give you the expected answer, but science doesn't accept the predicted answer until it's been tested. It's finding where the actual doesn't match the predicted that leads to figuring out how to make better predictions. The only way to find out - try it, ie. perform an experiment. One time in a million you don't get the expected result, but you have to go through the other 999,999 to find it.\n\nI imagine that some of their excitement is due to just plain getting a result. After putting time and effort into something and having it come to a conclusion, whether the answer's boring or not, tends to make people happy.\n\nEngineers and scientists get excited about things other people don't and vice versa. Throw a big company meeting to get spirits up for a major initiative and you'll have the folks in marketing, sales, etc. all hyped up while the engineers are wondering why their time is being wasted on such nonsense. Announce that everybody is getting another 8G of RAM in their computer and the engineers and scientist will be dancing in the hallways while the business team barely notices the announcement.",
                "good": "3",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "truth007",
                        "time": "13 May, 2022",
                        "context": "Very good explanation, thanks.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "jmichaelj",
                        "time": "13 May, 2022",
                        "context": "Point being, a seed needs moisture and acceptable temperature to germinate. It can grow without any sort of media covering it's roots whether it's soil or moon dust, or potash, (AKA hydroponics). Nutrients can be provided in the water they are supplied with. So unless potash damages the roots in some way or does something to prevent the water or the nutrients in the water from reaching the roots, a plant will grow in it. So what have they accomplished with this? They proved the lunar soil doesn't kill the seed.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "angzarr",
                                "time": "14 May, 2022",
                                "context": "I had a longer explanation somewhere else, but idea is basically this: They used a plant they have a lot of data on. After the plants grew they sequenced their RNA, and by matching it up with the data they already have they were able to pinpoint exactly which stressors are stunting the plants and what genes are involved. With that knowlege they can start genetically modify a plant that does well in that soil.",
                                "good": "0",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "jmichaelj",
                                        "time": "14 May, 2022",
                                        "context": "The first sentence of your first response is false so why should anyone trust the rest of what you have to say on the subject.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "apatriot831",
        "time": "13 May, 2022",
        "context": "Just think, if we can colonize the moon, we can all be lunatics!",
        "good": "3",
        "bad": "0",
        "replies": [
            {
                "user_name": "thanatos",
                "time": "13 May, 2022",
                "context": "Democrats ALREADY Are.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "redandblessed",
        "time": "13 May, 2022",
        "context": "LGBT plus can talk. A 3rd grade political science experiment.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "SecretSelf",
        "time": "13 May, 2022",
        "context": "i used to sprout seeds under my bed on wet paper towels. water does the sprout magic.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mkk250",
        "time": "13 May, 2022",
        "context": "This is what we spend tax dollars on? Try sending some liberal up to moon",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "PeterBravo545",
                "time": "13 May, 2022",
                "context": "on a one way trip....pb",
                "good": "2",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "jesssayin",
        "time": "13 May, 2022",
        "context": "Everything sprouts in a little moisture, and these \"scientists\" are astounded?  Need to wait a few days Professors!",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "luv2step",
        "time": "13 May, 2022",
        "context": "I could swear that I saw on TV that this is a high school science project. I remember them being interviewed awhile back and how excited they were. If this IS their project then they should be recognized. Just sayin...",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "GMA970",
        "time": "13 May, 2022",
        "context": "Don't need to grow anything. Just build a Whole Foods or Costco and fill it with food from Earth. No astronauts will starve.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Robro646",
        "time": "13 May, 2022",
        "context": "The moon? There’s no Walmart there! ",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "LaBruce13",
                "time": "13 May, 2022",
                "context": "Yet!",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "dannos",
        "time": "13 May, 2022",
        "context": "So is the point of this experiment is to show that if we want to grow plants on the moon, then...do it indoors, use moon dirt (gathered from less exposed places), use seeds from earth, & use water from earth. Really, that is earth (moon) shattering news!  NOT",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "RobertLedford647",
        "time": "13 May, 2022",
        "context": "WHY did they WAIT So Long ?????????????????",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "greedva",
        "time": "13 May, 2022",
        "context": "Sounds crazy to me.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "captbly123",
        "time": "13 May, 2022",
        "context": "Seeds sprout in just anything that’s not poison if waters added. The problem which is mentioned is they are all stunted. A bunch of stuff will have to be added to the lunar dirt for any fruit or vegetable to grow edible. To point where it may still be more feasible to not use it.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "RecognizeTheTruth119",
        "time": "13 May, 2022",
        "context": "Of COURSE everything sprouted.\nYou can sprout seeds in water, a wet tissue, or just about anything. Seeds contain within themselves all they need to sprout and set out roots and a stem when activated out of their dormant state (via water).\n\nBut everything did NOT grow well. Lack of nutrients, inability to pull minerals, etc. from the lunar \"soil\", produced slow growing, stunted, and inconsistent growth.\n\nAs expected.\nOnly the earth was made to be inhabited.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jvm3",
        "time": "13 May, 2022",
        "context": "What a terribly misleading headline. And what a totally pointless story. Moon dust is not “soil,” and it has no organic material from which plants can draw nutrients. To believe otherwise is like believing in alchemy. ",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "bandito_01",
        "time": "13 May, 2022",
        "context": "The only thing surprising about this \"experiment\" is that they are surprised at the outcome.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Robro646",
        "time": "13 May, 2022",
        "context": "I get plants to root in rockwool. 😜✌️",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cyanvalvespring",
        "time": "13 May, 2022",
        "context": "Wow!!! They thought of that quick.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "JS2332",
        "time": "13 May, 2022",
        "context": "they call themselves scientists and are surprised.  the composition of both are alike, just add air and water",
        "good": "0",
        "bad": "1",
        "replies": [
            {
                "user_name": "brewingbiker201",
                "time": "13 May, 2022",
                "context": "actually they are not that alike. there is a lot more to soil than \"dirt\". anyone who grows things knows this.",
                "good": "2",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "mkk250",
                        "time": "13 May, 2022",
                        "context": "Plant a garden every year. This is a waste of money done by the left ",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "butcher99",
        "time": "13 May, 2022",
        "context": "Well certainly they would sprout.  They will sprout in a glass of distilled water.  They will even grow until they use up all the nutrients in the seed itself.  If there are no nutrients in the moon soil they will just not grow.  Period. \n Ask a farmer",
        "good": "9",
        "bad": "0",
        "replies": [
            {
                "user_name": "sherlockhomeless169",
                "time": "13 May, 2022",
                "context": "100%.  They would sprout in Maxine Waters' wig if they were kept moist.  Of course they would die soon after.",
                "good": "1",
                "bad": "3",
                "replies": []
            }
        ]
    },
    {
        "user_name": "🐟Deliciousbass🐟",
        "time": "13 May, 2022",
        "context": "Big deal. I’ve had an Obama Chia head for years.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "sassyandsowhat",
        "time": "13 May, 2022",
        "context": "If this article is true, then NASA scientists are not scientists.  The plant responded to the water given it only.  It would take a while before the plant starts needing nutrients within the soil, aside from water.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "vetomania",
        "time": "13 May, 2022",
        "context": "I wonder what weeed would be like maaaan...",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "VikingsMatter606",
        "time": "13 May, 2022",
        "context": "Cool ! Lets turn up the vacuum -554 F degrees 2 degrees kelvin and lets see how they fair....So What ...ZZZZZZzzzzzzz   ...Please wake me up after Biden dead and gone.!!!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "foxisnotamerican",
        "time": "13 May, 2022",
        "context": "Maybe add some nutrients.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "razorsedgeartwork",
        "time": "13 May, 2022",
        "context": "Plants sprout entirely regardless of soil.  I'm not sure what they were trying to accomplish.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "zephyrjinx",
        "time": "13 May, 2022",
        "context": "I had a pile of sand dumped on my property years ago for some projects. Only used about half and since then it looks like Jurassic Park. It took NASA this long? BTW does the timing seem weird like maybe their trying to get more funding? How about we get the Baby Formula problem solved NASA???",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "PeterBravo545",
        "time": "13 May, 2022",
        "context": "Who can answer me this serious question?...Would a seed sprout and grow if it was watered only with urine ?....pb",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "DeplorableUltraMAGASemiFascist",
        "time": "13 May, 2022",
        "context": "Ima go out on a limb here and suggest a seed can grow for about 6 days before it needs nutrients from the soil.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "TexasYankee",
        "time": "13 May, 2022",
        "context": "Why did they wait 50 years to try? ",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "snoopcat",
                "time": "13 May, 2022",
                "context": "They ran out of stuff to do",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "bsmart001399",
        "time": "13 May, 2022",
        "context": "Just you wait until Chapter 2 when the plants start eating people.",
        "good": "2",
        "bad": "0",
        "replies": [
            {
                "user_name": "thanatos",
                "time": "13 May, 2022",
                "context": ",.. Revenge On The Vegans!",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "█▒█▒█╔╦╗g╦ô╚╩╝▒█▒█▒█WorldsMEANESTman",
        "time": "13 May, 2022",
        "context": "Great.. Moving on..",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "robertlee831",
        "time": "13 May, 2022",
        "context": "as any second grader knows, You can sprout  seeds in paper  towels ,someone is behind the curve here",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bantytfv508",
        "time": "13 May, 2022",
        "context": "Just took 52 years???? They should have checked this asap.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "middleofthepack",
        "time": "13 May, 2022",
        "context": "not sure how much of a role the substrate/dirt plays in the first 6 days anyway. I bet it mostly just takes moisture in that period. The dirt likely  served little purpose.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "snoopcat",
                "time": "13 May, 2022",
                "context": "Hold on now that's a very special dirt 10,000 bucks an ounce weighs less than regular dirt",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "igotpeanuts",
        "time": "13 May, 2022",
        "context": "If you read the whole story and look at the failures, this is a story that is entirely disgusting when it comes to so called \"Scientists\".\n\"All of the seeds sprouted. But within a week, the coarseness and other properties of the lunar soil stressed the small, flowering weeds so much that they grew more slowly than seedlings planted in fake moon dirt from Earth.\"",
        "good": "0",
        "bad": "1",
        "replies": [
            {
                "user_name": "angzarr",
                "time": "14 May, 2022",
                "context": "You can thank the author of the article, Bradford Betz of Fox News, for thinking you couldn't handle more than a third grade explanation. They were working on identifying which genetic modifications need to be made to adapt the plant to the soil.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "igotpeanuts",
                        "time": "14 May, 2022",
                        "context": "They are dragged down by the \"Woke\" generation that says All Astronauts need to eat NON GMO food on any 3 year journey.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "angzarr",
                                "time": "14 May, 2022",
                                "context": "It seems Bradford was right after all.",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "justpappystu600",
        "time": "13 May, 2022",
        "context": "The article seemed sort of vague about whether any types of fertilizer etc was used, but the described results weren't that encouraging regarding the potential for self supporting agriculture...",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "sherlockhomeless169",
        "time": "13 May, 2022",
        "context": "Maybe they should work on making baby formula instead.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "vorpal_sword",
        "time": "13 May, 2022",
        "context": "It’s almost as if seeds come with their own food supply.",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "DeplorableUltraMAGASemiFascist",
                "time": "13 May, 2022",
                "context": "If I were Darwin that's the direction I would head",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "spamreader1",
        "time": "13 May, 2022",
        "context": "Your tax dollars at work.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "thebige797",
        "time": "13 May, 2022",
        "context": "This was a waste of time and money. We would be foolish to start gardening on the moon. As a matter of fact it would be impossible. I guess it's handy to know that we can get soil from the moon if we run out of regular dirt here on earth.",
        "good": "2",
        "bad": "1",
        "replies": [
            {
                "user_name": "scodd",
                "time": "13 May, 2022",
                "context": "\"Fact\"? \"Impossible?\"...the story shows they did it. It is not impossible. It just needs more work.",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "thanatos",
                "time": "13 May, 2022",
                "context": "😂😂😂",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "B-USA253",
        "time": "13 May, 2022",
        "context": "WOW...IMPRESSIVE, One minor detail, YOU CAN'T JUST UBER TO THE MOON TO USE THEIR SOIL TO GROW THINGS?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "liveingratitude",
        "time": "13 May, 2022",
        "context": "I am completely stunned that there has not been exhaustive studies, experiments & papers published detailing everything imaginable that can be known about the lunar dirt! 50 yrs ago!!! What have they been doing? Walking around with jars of the dirt like Captain Jack Sparrow?",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "looking_glass",
        "time": "13 May, 2022",
        "context": "So this proves that we can bring back soil from the moon and grow plants in it.\n..that's good to know if we ever run out of soil here on Earth.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "PeterBravo545",
        "time": "13 May, 2022",
        "context": "An absolutely waste of money to return to the moon. It will never never be colonized, how do I know this? Just read the anointed word of God , the bible. Every word in that great book will be fulfilled in it's appointed time. Man has but  a few more years on planet earth then the judgement.....pb",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "fielddog",
        "time": "13 May, 2022",
        "context": "Big Deal ? seeds will sprout in a cup of water.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "jimbo358",
        "time": "13 May, 2022",
        "context": "Just trying to get their budget increased. Nothing to see here.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "richr1",
        "time": "13 May, 2022",
        "context": "Obviously based on this info the best soil is on the edge of the dark side of the moon. Use grow lights.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Scruffynerfherder",
        "time": "13 May, 2022",
        "context": "In the 1st grade we did the same thing with a wet paper towel. \nMind NOT blown. But how much taxpayer money was on this ?",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "goa✟lips",
        "time": "13 May, 2022",
        "context": "How does the Man in the Moon cut his hair? Eclipse it.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Anindependentthought",
        "time": "13 May, 2022",
        "context": "That’s amazing",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "LaBruce13",
        "time": "13 May, 2022",
        "context": "I've had Pothos plants live for years with no soil and nothing but tap water in a glass.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "thanatos",
                "time": "13 May, 2022",
                "context": "👏",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "Jimmy~Crack~CornPop!",
        "time": "13 May, 2022",
        "context": "& for the next experiment . . . . .  420 !",
        "good": "2",
        "bad": "0",
        "replies": [
            {
                "user_name": "goa✟lips",
                "time": "13 May, 2022",
                "context": "Moonrocks is a legit name for a strain of weed.",
                "good": "2",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "BigTex2008",
        "time": "13 May, 2022",
        "context": "uh....I've grown many gardens, and plants.\n\nget the seed to sprout isn't hard.\n\nget the plant to grow and produce is.\n\nthe earth was created by Jesus to be inhabited,  nowhere else will sustain life.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "dksia",
                "time": "13 May, 2022",
                "context": "You may just want to brush up on your first few chapters of Genesis.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "LaBruce13",
        "time": "13 May, 2022",
        "context": "Believe the science? ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "trumpstormy2024020",
        "time": "13 May, 2022",
        "context": "Most NASA scientists are Democrats...wired.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "elli5",
        "time": "13 May, 2022",
        "context": "lame.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tommyisatexan",
        "time": "13 May, 2022",
        "context": "No matter what, they're going to have to do some bio-mass conditioning of the soil. Lots manure, which will lessen the coarseness of the soil and add nutrients.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "goa✟lips",
                "time": "13 May, 2022",
                "context": "Sounds like a lot of bull.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "pasttimetofixit",
        "time": "13 May, 2022",
        "context": "\"For the first time\", what were they waiting for?\nWe can go back and get more.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Pinball-Wizard",
        "time": "13 May, 2022",
        "context": "Cool Bean! Sprouts or whatever, but IS it safe to eat?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "goa✟lips",
        "time": "13 May, 2022",
        "context": "If I had twelve grams of moon rocks...  well...  I'd be mainlining that stuff.",
        "good": "2",
        "bad": "0",
        "replies": [
            {
                "user_name": "thanatos",
                "time": "13 May, 2022",
                "context": "?????????",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "willitorwontit",
        "time": "13 May, 2022",
        "context": "Took sixty years before testing that?! That’s some red tape for ya",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "goa✟lips",
                "time": "13 May, 2022",
                "context": "It was stashed away in a warehouse at the back of the Smithsonian.  Takes time.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "thanatos",
                        "time": "13 May, 2022",
                        "context": "Next To Indiana Jones's Arc Of The Covenant.",
                        "good": "1",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "goa✟lips",
                                "time": "13 May, 2022",
                                "context": "Need an arc? I noah welder.",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "supreme_neanderthal",
        "time": "13 May, 2022",
        "context": "I just had some dried beans sprout in my sink with no soil. WOW!",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "squaretoround",
                "time": "13 May, 2022",
                "context": "You should maybe do your dishes a little more often.",
                "good": "1",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "supreme_neanderthal",
                        "time": "13 May, 2022",
                        "context": "there were no dishes, they sprouted in the strainer.",
                        "good": "0",
                        "bad": "1",
                        "replies": [
                            {
                                "user_name": "squaretoround",
                                "time": "13 May, 2022",
                                "context": "And you never cleaned the strainer with the dishes?",
                                "good": "0",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "supreme_neanderthal",
                                        "time": "13 May, 2022",
                                        "context": "I said there were no dishes.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "klingonthecat923",
        "time": "13 May, 2022",
        "context": "Big deal...\nSeeds will sprout in a wet paper towel - ask any first grader.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "trumpstormy2024020",
        "time": "13 May, 2022",
        "context": "NASA is looking for janitors for the bathrooms. All uneducated Trumplings lined up for jobs.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "GregL984",
        "time": "13 May, 2022",
        "context": "A seed will sprout in a wet paper towel, as the seed contains its own little supply of food (cotyledon) to get going the first few days while it starts growing in place. Cool opportunity for these UF students, but has a low benefit to society/publicly funded resources ratio.",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "goa✟lips",
                "time": "13 May, 2022",
                "context": "[hits blunt]     Dude, what if minerals and trace elements just disappeared?",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "GreenFlame",
        "time": "13 May, 2022",
        "context": "wow, i am amazed they waited this long to try it",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "DVermin",
        "time": "13 May, 2022",
        "context": "One small step for man, one giant leap for The Night of The Triffids.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "goa✟lips",
                "time": "13 May, 2022",
                "context": "I'm not scared, goats & triffids get along great.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "squaretoround",
        "time": "13 May, 2022",
        "context": "One question:  Did I pay for this?  We don't have formula to feed our babies.  But we are trying to grow stuff on the moon where we can't breath.  \nAm I the only one who feels like we are living in a cartoon?",
        "good": "2",
        "bad": "1",
        "replies": [
            {
                "user_name": "goa✟lips",
                "time": "13 May, 2022",
                "context": "I'm with you.  It's a Calvin & Hobbes cartoon, I believe.",
                "good": "2",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "thanatos",
        "time": "13 May, 2022",
        "context": "SO? Won't Flourish Without Water & Fertilizer. A Seed WILL Sprout. After That,.....",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "goa✟lips",
                "time": "13 May, 2022",
                "context": "...more water and fertilizer.",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "vol_in_socal899",
        "time": "13 May, 2022",
        "context": "Cool experiment for college kids, but... \n\n\"Researchers had no idea if anything would sprout in the harsh moon dirt\"\n\nReally?  Any botanists on the team?  They should have had a complete chemical analysis and a hypothesis of what would occur.  They probably did.  The writer may not be familiar with the scientific method.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "prairie17",
        "time": "13 May, 2022",
        "context": "Cool",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "elli5",
        "time": "13 May, 2022",
        "context": "Breaking news:   The universe is stuff that makes stuff.... It's well documented.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "goa✟lips",
        "time": "13 May, 2022",
        "context": "People, THINK before you pop bubblewrap.  The air inside came from China.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "MassaMassa",
        "time": "13 May, 2022",
        "context": "Don't get hopes too high when they try it on the moon and it's 1/6 gravity.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "solemnseahorse512",
        "time": "13 May, 2022",
        "context": "Maybe they could analyze the chemical composition of the soil and let us know what it consists of.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "I_saw_a_fairy_with_boots_and_dancin'_with_a_dwarf4",
        "time": "13 May, 2022",
        "context": "'Everything sprouted!'\n\nI said this too, after my weed seeds sprouted after germination.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "kobayashimaru",
        "time": "13 May, 2022",
        "context": "Ei-ei-oh-no",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "goa✟lips",
                "time": "13 May, 2022",
                "context": "Green Acres is the place to be\nFarm livin' is the life for me",
                "good": "2",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "VikingsMatter606",
        "time": "13 May, 2022",
        "context": "The moon is like glass. I don't see any organic material there. It must have been mixed with AOC and other waste material blended together to formulate soil. Straight up Moon soil ..I doubt it....Lot of Bunk.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "goa✟lips",
        "time": "13 May, 2022",
        "context": "[alien tour bus entering our solar system]\nalien: so they named all their planets after their Gods?\ntour guide: all but one\nalien: what's better than Gods?\ntour guide: [checks notes] dirt",
        "good": "2",
        "bad": "0",
        "replies": [
            {
                "user_name": "spaceman204",
                "time": "13 May, 2022",
                "context": "Weed..",
                "good": "1",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "goa✟lips",
                        "time": "13 May, 2022",
                        "context": "The Spice must flow",
                        "good": "2",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "nonpareil",
        "time": "13 May, 2022",
        "context": "There is that little problem of plants consuming carbon dioxide with very little of it in the moon's atomosphere and the fact that the existence of cold traps near the poles of the moon does not guarantee solid carbon dioxide.",
        "good": "1",
        "bad": "1",
        "replies": [
            {
                "user_name": "kobayashimaru",
                "time": "13 May, 2022",
                "context": "I'm sure a  proper greenhouse is part of the plan and we emit plenty of CO2",
                "good": "1",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "nonpareil",
                        "time": "13 May, 2022",
                        "context": "The insane cost and dubious feasiblity of hauling it there is likely what is most appealing.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "kobayashimaru",
                                "time": "13 May, 2022",
                                "context": "It can have applications here too...learning how to grow food in nitrate reduced soil",
                                "good": "1",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "nonpareil",
                                        "time": "13 May, 2022",
                                        "context": "Nah, we just haul the necessary nitrogen and ammonia fixing bacteria up there too!  And since there is at least minor rare earth concentrations we should look into mining those small concentrations and setting up moon manufacturing plants for the smart phone screens that we could haul back to earth.  Everybody would want a moon screen for their phone.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": [
                                            {
                                                "user_name": "kobayashimaru",
                                                "time": "13 May, 2022",
                                                "context": "Without food th manufacturing process is a dream",
                                                "good": "0",
                                                "bad": "0",
                                                "replies": [
                                                    {
                                                        "user_name": "nonpareil",
                                                        "time": "13 May, 2022",
                                                        "context": "It was sarcasm",
                                                        "good": "0",
                                                        "bad": "0",
                                                        "replies": []
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "IloveAmerica594",
        "time": "13 May, 2022",
        "context": "So there is no water on the moon . How are we going to solve that ?",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "spaceman204",
                "time": "13 May, 2022",
                "context": "ice does float in space..comets are always blowing it off their tails..",
                "good": "2",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "kobayashimaru",
                        "time": "13 May, 2022",
                        "context": "It is in meteorites too",
                        "good": "2",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "CorbinDallas",
                "time": "13 May, 2022",
                "context": "Nasa confirmed in 2018 that they had found water on the moon.\n\nmoon. nasa. gov /news/ 155/ theres-water-on-the-moon/",
                "good": "1",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "Ididn’tdoit833",
                        "time": "13 May, 2022",
                        "context": "Right!  Water on the moon would evaporate and you would have clouds and rain. There is no water on the moon except what was left in canteens by the astronauts. ",
                        "good": "0",
                        "bad": "1",
                        "replies": [
                            {
                                "user_name": "CorbinDallas",
                                "time": "13 May, 2022",
                                "context": "Wrong! There is water in the soil. Gotta remember there is still gravity to keep H2O nice and close to the moon. But I'm sure you have many more doctorates and spent 1000's of more hours of research than those troglodytes at NASA.",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "drmitofit",
        "time": "13 May, 2022",
        "context": "It's like trying to feed your baby in the Joe Biden economy. Only good for about 6 days.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "kobayashimaru",
                "time": "13 May, 2022",
                "context": "If only the hurricane gun was real",
                "good": "0",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "Ididn’tdoit833",
        "time": "13 May, 2022",
        "context": "What a waste of money!  Plants will grow just in water without soil. Hydroponics!",
        "good": "1",
        "bad": "3",
        "replies": [
            {
                "user_name": "kobayashimaru",
                "time": "13 May, 2022",
                "context": "Still need nutrients",
                "good": "1",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "dksia",
        "time": "13 May, 2022",
        "context": "It took real scientists and engineers to get us to the moon and back.\n\nWhat passes today as science is puzzling.  There was a time when children learned about seeds, sprouting, and growing.  It was common knowledge that, if kept moist, seeds sprout, and grow.  It was also common knowledge that seeds planted in crushed gravel didn't do well.  Everyone knew the soil needed nutrients to foster growth.\n\nThere is no organic matter in crushed moon rocks.  A competent third grade science fair participant could have run circles around these geniuses.",
        "good": "3",
        "bad": "2",
        "replies": [
            {
                "user_name": "angzarr",
                "time": "14 May, 2022",
                "context": "Don't believe what you read in the news, or at least expect it to be dumbed down.\n\nThey know a lot about the plant they used, so based on RNA sampled from the plants they were able to pinpoint the exact stressors on the plant and start working towards genetic modifications that will make it thrive in that soil.\n\nSeems like it was at least a fourth grade science fair project. Maybe even fifth grade.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "Artorious2469",
        "time": "13 May, 2022",
        "context": "So the plants died after starting to grow....great start now we know why nothing is growing on the moon....genius",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "airglider111",
        "time": "13 May, 2022",
        "context": "worse yet they got paid taxpayer money to prove plants grow in dirt.",
        "good": "1",
        "bad": "1",
        "replies": [
            {
                "user_name": "kobayashimaru",
                "time": "13 May, 2022",
                "context": "Space Force needs to eat",
                "good": "2",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "isayisaythatboyaintright",
        "time": "13 May, 2022",
        "context": "They don't seem to have learned anything sprouting seeds in wet napkins in elementary school.  Getting things to sprout is a gimme.  Growing things in it will be the problem.  Will need nutrients like a hydroponic system.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "johnnywb",
        "time": "13 May, 2022",
        "context": "It only took them 50 years.",
        "good": "2",
        "bad": "0",
        "replies": [
            {
                "user_name": "kobayashimaru",
                "time": "13 May, 2022",
                "context": "No nitrates in moon soil",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "johnsmithusa1776",
        "time": "13 May, 2022",
        "context": "Well, seeing how you can grow plants in plain water, a sponge, or a chia-pet head, why wouldn't this work?",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "wcupples01207",
        "time": "13 May, 2022",
        "context": "Anyone want to tell these \"Scientists\" the average annual rainfall on the moon, then have them explain how they will get their plants to even sprout.",
        "good": "1",
        "bad": "1",
        "replies": [
            {
                "user_name": "CorbinDallas",
                "time": "13 May, 2022",
                "context": "The lack of a dense atmosphere rich in carbon dioxide would also be an issue. Plants and agriculture would need to be cultivated under domes or underground.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "patrick808",
        "time": "13 May, 2022",
        "context": "Wishful dreaming. Sure... there is soil, but no oxygen, no water, intense radiation,... need the list get any larger? And what's the point anyway? In what reality is growing on the moon for consumption on Earth every remotely financially doable? What a waist of time and money!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "dad09253",
        "time": "13 May, 2022",
        "context": "This sounds like fake news to me. The lunar soil is sterile. It's not going to be of any use other than for what we would use sterile sand for here on Earth. All of the nutrients will need to be brought from Earth.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "kobayashimaru",
                "time": "13 May, 2022",
                "context": "Compartment space is the problem, need to bring as little as possible",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "insight3152",
        "time": "13 May, 2022",
        "context": "According to AOC the reason the plants died after 6 days is that the lunar soil obviously came from the dark side of the moon.  \"Even 5 year olds know that all living things need sunlight to grow\" she went on to say.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "kobayashimaru",
        "time": "13 May, 2022",
        "context": "I've got a bad feeling about this\n\nWe're all gonna be  lot thinner",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "goa✟lips",
                "time": "13 May, 2022",
                "context": "Sir, is this going to be a stand-up fight, or another bug hunt?",
                "good": "2",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "kobayashimaru",
                        "time": "13 May, 2022",
                        "context": "We're doomed",
                        "good": "1",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "goa✟lips",
                                "time": "13 May, 2022",
                                "context": "Well, why don't you put Newt in charge?",
                                "good": "1",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "kobayashimaru",
                                        "time": "13 May, 2022",
                                        "context": "Thats just great man that's just (expletive deleted) great...",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "dksia",
        "time": "13 May, 2022",
        "context": "Had been using \"fake\" moon dirt.  Must have been close to a gravel pit.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "drmitofit",
        "time": "13 May, 2022",
        "context": "So now there are fertilizer shortages on the Moon and the Earth. Thanks Brandon!",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "kobayashimaru",
                "time": "13 May, 2022",
                "context": "You're welcome (expletive deleted) Face",
                "good": "0",
                "bad": "2",
                "replies": []
            }
        ]
    },
    {
        "user_name": "captzeb309",
        "time": "13 May, 2022",
        "context": "Just add a little Miracle Gro.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "DoRealWork",
        "time": "13 May, 2022",
        "context": "Real stuff",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tbubs",
        "time": "13 May, 2022",
        "context": "“Everything sprouted”…….(and then jumped out of the tray and ate one of our student assistants). 😂",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dontbeajerk2019",
        "time": "13 May, 2022",
        "context": "Just send the astronauts to the moon with \"lunar bucks\" and have them go to the local grocery and buy what they need when there. EVERYONE knows food comes from the grocery store.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "AntonChigurh",
        "time": "13 May, 2022",
        "context": "Science and Fox News is an oxymoron .",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "thunker54",
                "time": "13 May, 2022",
                "context": "... yet here you are reading FOX news.",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "biden_trucker",
        "time": "13 May, 2022",
        "context": "and the water...oh yea..that's the secret formula",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "CatMing",
        "time": "13 May, 2022",
        "context": "The cost of building a moon base would be at least 100x what the space station cost.",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "celticharbor",
                "time": "13 May, 2022",
                "context": "Which in the US will be 100x more than it actually costs after all of the pork the politicians will strip off.",
                "good": "3",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "buckfoejiden336",
        "time": "13 May, 2022",
        "context": "A seed with germinate anywhere it receives sufficient quantities of water. Only after that does the soil need to contain sufficient nutrients for it to flourish.",
        "good": "11",
        "bad": "0",
        "replies": [
            {
                "user_name": "beadgBass",
                "time": "13 May, 2022",
                "context": "Out of curiosity, I read the original CB article to see what was exciting about germination. The article was primarily about how poorly they grew in a lunar regolith substrate, with no surprise about germination once water was added.",
                "good": "7",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "Afbafb",
        "time": "14 May, 2022",
        "context": "Everyone knows the moon is made of cheese...and that you can't grow spinach in cheese.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Orange8Ball",
        "time": "13 May, 2022",
        "context": "Germination requires water, oxygen, and the right temperature.  As long as those three things come together appropriate to the species, seed will germinate almost anywhere.  The scientist should not have been surprised that germination occurred.  If the seed had not germinated then there was likely something wrong with the seed or the conditions (water, oxygen, temperate) were not right.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "SecretSelf",
        "time": "13 May, 2022",
        "context": "Shouldn't the moon dust have high radiation from long exposure to the sun with no atmosphere? don't eat those mutant vegetables.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "jonathanpi",
                "time": "13 May, 2022",
                "context": "No.  Do you even know how radiation works?",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "SecretSelf",
                        "time": "13 May, 2022",
                        "context": "lol. apparently you do not. radiation levels on the Moon's surface are 200- to 1,000-times more than that on Earth's surface – and 2.6-times more than what astronauts onboard the International Space Station (ISS) are exposed to.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "jonathanpi",
                                "time": "13 May, 2022",
                                "context": "Radiation levels being high has nothing to do with if the rock is radioactive itself but more to do with the amount of solar radiation that is present.  This just shows that having access to information does not necessary mean that you are able to properly use it or understand it.\n\nSo, in terms children can understand, no.  Moon dust (on Earth) does not have high radiation from long exposure to the Sun.  The material itself would need to be radioactive to retain radioactivity.",
                                "good": "0",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "quietsmith",
                                        "time": "14 May, 2022",
                                        "context": "Thank you for explaining that so I didn't have to :D",
                                        "good": "1",
                                        "bad": "0",
                                        "replies": [
                                            {
                                                "user_name": "jonathanpi",
                                                "time": "15 May, 2022",
                                                "context": "You are quite welcome.  Hopefully, this helps our friend progress on their path to knowledge and understanding.",
                                                "good": "0",
                                                "bad": "0",
                                                "replies": [
                                                    {
                                                        "user_name": "quietsmith",
                                                        "time": "15 May, 2022",
                                                        "context": "You want a funny unrelated story? :D\n\nSomebody came up with the idea of taking a portable x ray machine to places like nursing homes so they could take the x rays on site rather than transporting patients. \n\nHis van got in an accident one afternoon.\n\nThe police show up, see the radiation symbol on the x ray machine and start having a panic attack to close down everything while the x ray tech is like 'First, its not turned on, second, even if it were it would be 'dangerous' for about 10 feet...'",
                                                        "good": "1",
                                                        "bad": "0",
                                                        "replies": [
                                                            {
                                                                "user_name": "jonathanpi",
                                                                "time": "16 May, 2022",
                                                                "context": "Well, I understand the abundance of caution the police displayed but that's hilarious.",
                                                                "good": "0",
                                                                "bad": "0",
                                                                "replies": []
                                                            }
                                                        ]
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "user_name": "miterknife",
                        "time": "18 May, 2022",
                        "context": "Knowledge without kindness. The world is full of it.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "jonathanpi",
                                "time": "18 May, 2022",
                                "context": "Exactly how 'kind' do you expect me to be?  The person I replied to asked a question and then immediately tried to advise people based on a flawed understanding of knowledge and reached a patently incorrect conclusion.  \n\nThere is a reason why we are instructed to listen twice as much as we speak.",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "miterknife",
        "time": "13 May, 2022",
        "context": "What nutrients are in moon dirt?",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "socalpal",
                "time": "15 May, 2022",
                "context": "probably none.......support matrix only, I suspect.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "taser317",
        "time": "13 May, 2022",
        "context": "All they have to do is make sure there is enough water.  You can grow plants in a bowl of water..",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "seelingthetruth",
        "time": "13 May, 2022",
        "context": "Seeds will sprout without soil. Growing into plants and producing food is another story. Just click bait.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "beereasonable",
        "time": "13 May, 2022",
        "context": "Where to get the water now...",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "beefy8888",
                "time": "13 May, 2022",
                "context": "Water was confirmed to be on the sunlit surface of the Moon by NASA on October 26, 2020.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "dogschnot",
        "time": "13 May, 2022",
        "context": "WOW!!!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "StrengthOfTen",
        "time": "13 May, 2022",
        "context": "Luckily only around 6% of people think the moon landings were fake.",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "biden_trucker",
                "time": "13 May, 2022",
                "context": "and they vote Democrat",
                "good": "0",
                "bad": "2",
                "replies": [
                    {
                        "user_name": "StrengthOfTen",
                        "time": "13 May, 2022",
                        "context": "Hadn't really thought about it that way. Decided to do a search on it and its kind of vague on moon landings.\n\nI did find a science journal article that seems to indicate more conservative people lean towards conspiracies.\n\nSearch for:\n\"Conservatives’ susceptibility to political misperceptions\"\n\nWarning, its very long.",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "beadgBass",
                "time": "14 May, 2022",
                "context": "That is way too many.",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "fakeitgoodnasa",
        "time": "14 May, 2022",
        "context": "Well of course everything sprouted. The soil is pulverized volcanic basalt from Arizona..",
        "good": "0",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "bitingmytongue252",
        "time": "13 May, 2022",
        "context": "1973 was when the time was right NASA",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Whatstheuseanyway",
        "time": "13 May, 2022",
        "context": "You can germinate seeds in wet paper towels..🙄",
        "good": "7",
        "bad": "0",
        "replies": [
            {
                "user_name": "exadore",
                "time": "13 May, 2022",
                "context": "air plants are cool too. Wouldn't work well on the moon though since there is no air.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "biden_trucker",
                        "time": "13 May, 2022",
                        "context": "carbon dioxide",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "Whatstheuseanyway",
                        "time": "13 May, 2022",
                        "context": "Yup. So it really isn't the soil it's the water.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "k3v1nt",
        "time": "13 May, 2022",
        "context": "cool. I grow all my vegetables in fiberglass cubes. this is not news",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "nukeprof",
        "time": "13 May, 2022",
        "context": "Maybe they can grow Moon Pies.",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "beefy8888",
                "time": "13 May, 2022",
                "context": "that would require RC cola.",
                "good": "4",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "feddupalso142",
        "time": "13 May, 2022",
        "context": "In the middle of the old 7 mile bridge between Marathon and Big Pine Key Florida, grows a tree, -----on concrete-------30 feet above water.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "koloa",
        "time": "13 May, 2022",
        "context": "NASA scientists? University of Florida scientists.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "AntonChigurh",
                "time": "13 May, 2022",
                "context": "Science and Fox News is an oxymoron .",
                "good": "0",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "biden_trucker",
        "time": "13 May, 2022",
        "context": "now just starve waiting for the potatoes to grow..",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "thomaswinslow009",
        "time": "27 May, 2022",
        "context": "T",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "VoteYourHeart",
        "time": "16 May, 2022",
        "context": "What's the big deal here? Seeds will sprout between 2 wet paper towels...",
        "good": "2",
        "bad": "0",
        "replies": [
            {
                "user_name": "lepetomane",
                "time": "17 May, 2022",
                "context": "...  or on asphalt  ...",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "quietsmith",
                "time": "18 May, 2022",
                "context": "Demonstrating that it may be possible to grow crops somewhere besides on planet earth.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "dan5047628",
                        "time": "18 May, 2022",
                        "context": "Growing food is easy. But It takes 2.6 acres of crops to feed 1 man for a year.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "quietsmith",
                                "time": "19 May, 2022",
                                "context": "It is easy on a lot of places on earth because plants evolved to grow here. \n\nHaving the conditions to grow food on another planet it something else.",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "realistinmotion",
        "time": "4 June, 2022",
        "context": "moon landing all fake, so all moon soil samples are fake too",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "MadDawg66",
        "time": "15 May, 2022",
        "context": "Weed? Another \"Buzzed\" Aldrin.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ssgb",
        "time": "19 May, 2022",
        "context": "\"After two days, they started to sprout!\" (AND 53+ YEARS)",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "HiThere428",
        "time": "11 June, 2022",
        "context": "You would think they would have done already.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "gorgonthetimid",
        "time": "21 May, 2022",
        "context": "Unfortunately, the plants spread overnight ingesting 2 technicians and a black cat called \"Midnight\".  We could plant these on the US/Mexico border!",
        "good": "0",
        "bad": "0",
        "replies": []
    }
]