[
    {
        "user_name": "rubiks6",
        "time": "29 June, 2021",
        "context": "Wow! We get to comment on a science article? That's amazing!\n---------------------------------------------------\n\n\"Study nixes life in clouds of Venus ...\"\n\nTold ya so.",
        "good": "0",
        "bad": "12",
        "replies": [
            {
                "user_name": "quietsmith",
                "time": "30 June, 2021",
                "context": "But, failure, since science is a massive conspiracy against you why would they not simply lie about this too? :D",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "MeOneGoodEye🏴‍☠️",
        "time": "28 June, 2021",
        "context": "There has been life on Uranas since the get go I guess someone needs to rub their nose in it..",
        "good": "2",
        "bad": "11",
        "replies": []
    },
    {
        "user_name": "thomjefferson",
        "time": "28 June, 2021",
        "context": "I wonder what the betting line is on where we find extraterrestrial life first.  Jupiter's moons look promising.",
        "good": "15",
        "bad": "1",
        "replies": [
            {
                "user_name": "rubiks6",
                "time": "29 June, 2021",
                "context": "No, they don't. I'm putting my money on finding none beyond Earth. The odds are in my favor.",
                "good": "1",
                "bad": "10",
                "replies": [
                    {
                        "user_name": "lycopine",
                        "time": "29 June, 2021",
                        "context": "Says you and your overactive imagination",
                        "good": "8",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "rubiks6",
                                "time": "29 June, 2021",
                                "context": "You’re a bit confused. You’re speaking backwards. I’m not the one imagining little green men.",
                                "good": "0",
                                "bad": "7",
                                "replies": [
                                    {
                                        "user_name": "lycopine",
                                        "time": "29 June, 2021",
                                        "context": "no, you're the one imagining super beings in the sky while believing and declaring them real.\nFruitcake kind of thinking as you posted above.",
                                        "good": "1",
                                        "bad": "0",
                                        "replies": []
                                    },
                                    {
                                        "user_name": "thomjefferson",
                                        "time": "29 June, 2021",
                                        "context": "I said \"extraterrestrial life\" not \"little green men.\"\nThis could be something as small as one celled organisms.",
                                        "good": "10",
                                        "bad": "0",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "user_name": "letsgetrel",
                        "time": "29 June, 2021",
                        "context": "It is a big universe out there. The odds are strongly against you.\nWhether or not we find other life in our lifetimes is another question. There the odds are slightly better for you ... but not much.",
                        "good": "11",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "rubiks6",
                                "time": "29 June, 2021",
                                "context": "\"The odds are in my favor.\" Upon what are you basing your odds? Bayesian statistics with a single data point? Get real.\n\nMy teachers taught me in third grade that if anything is multiplied by zero, the result is zero. If you multiply a dozen factors and one of them is zero, your result will be zero. Third grade math. Give it a try.\n\nWhat are the factors you are multiplying to get your odds? Use that God-given brain of yours and evaluate your assumptions.",
                                "good": "0",
                                "bad": "8",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "user_name": "quietsmith",
                        "time": "30 June, 2021",
                        "context": "No failure, the odds are in fact stacked against you :D",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "fakeitgoodnasa",
        "time": "29 June, 2021",
        "context": "\"Astrobiologist\"... hmm, do these folks actually get paid ??",
        "good": "0",
        "bad": "14",
        "replies": [
            {
                "user_name": "rubiks6",
                "time": "29 June, 2021",
                "context": "Astrobiology – The only \"scientific\" field of study in which you can earn a Ph.D. and yet for which there isn't a single shred of evidence. Isn't that ironic?",
                "good": "0",
                "bad": "8",
                "replies": [
                    {
                        "user_name": "lycopine",
                        "time": "29 June, 2021",
                        "context": "Theology - the only endeavor where one can earn a \"doctorate\" of divinity, the \nstudy of imaginary super beings as though they exist.\nWithout a shred of ANY evidence, EVER...",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "Hondoxp589",
        "time": "29 June, 2021",
        "context": "We are living in the golden age of astronomy. So many exciting missions taking place right now. We have learned more about our solar system and the heavens in the last 20 years then in all of human history. And what we have learned so far is that life is NOT abundant, it is extremely rare, and possibly completely unique to Earth. The strategy has been, \"Follow the Water\" in the search for life. And as the data streams in with negative results again and again and again, maybe it's time to accept the cold hard science. But that's not a bad thing. Accepting that life is unique and indigenous to Earth gives us a new outlook on our existence. And thats what scientific exploration is all about.",
        "good": "5",
        "bad": "1",
        "replies": [
            {
                "user_name": "rubiks6",
                "time": "29 June, 2021",
                "context": "\"... what we have learned so far is that life is NOT abundant, it is extremely rare, and possibly completely unique to Earth.\" \n\nPerfect. \n\nWell said, sir. I tried to give you 10 thumbs up but the chat software would only let me give you one.",
                "good": "0",
                "bad": "8",
                "replies": []
            },
            {
                "user_name": "lycopine",
                "time": "29 June, 2021",
                "context": "a measly few decades of data and you shut the door on exploration. People like you still believe the Earth is flat...",
                "good": "0",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "Hondoxp589",
                        "time": "30 June, 2021",
                        "context": "Reading comprehension. Go work on that.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "rubiks6",
        "time": "29 June, 2021",
        "context": "Oh, wow! We can comment. Who'da thunk it?\n--------------------------------------------------------------\n\nAstrobiology – The only \"scientific\" field of study in which you can earn a Ph.D. and yet for which there isn't a single shred of evidence. Isn't that ironic?",
        "good": "2",
        "bad": "13",
        "replies": [
            {
                "user_name": "lycopine",
                "time": "29 June, 2021",
                "context": "Theology, the only endeavor where one can earn a \"doctorate\" of divinity, the study of imaginary super beings as though they exist.\nWithout a shred of ANY evidence, EVER...",
                "good": "5",
                "bad": "2",
                "replies": []
            },
            {
                "user_name": "penguinsfan8771",
                "time": "29 June, 2021",
                "context": "You aren't welcome here. This article is for adults.",
                "good": "2",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "rubiks6",
                        "time": "29 June, 2021",
                        "context": "This comments section should only be for those who can actually formulate an argument but unfortunately, they let meatheads like you in here too.",
                        "good": "0",
                        "bad": "6",
                        "replies": [
                            {
                                "user_name": "beadgBass",
                                "time": "29 June, 2021",
                                "context": "\"This comments section should only be for those who can actually formulate an argument\"\n\nWhen are you going to start?",
                                "good": "5",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "rubiks6",
                                        "time": "29 June, 2021",
                                        "context": "Read my first comment above.",
                                        "good": "0",
                                        "bad": "3",
                                        "replies": []
                                    }
                                ]
                            },
                            {
                                "user_name": "penguinsfan8771",
                                "time": "30 June, 2021",
                                "context": "You believe in magic men in the sky. That disqualifies you from any scientific discussion.",
                                "good": "1",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "thomaswinslow009",
        "time": "29 June, 2021",
        "context": "There are probably ways for life to evolve that we can't even imagine.",
        "good": "17",
        "bad": "0",
        "replies": [
            {
                "user_name": "beadgBass",
                "time": "29 June, 2021",
                "context": "Exactly. What we have on Earth is unique, and life elsewhere would necessarily be unique as well.",
                "good": "11",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "rubiks6",
                        "time": "29 June, 2021",
                        "context": "What we have here on Earth is as sophisticated as it gets with these physical laws and it takes this level of sophistication for life to be life. So, look around you. This is life and this is what life looks like. There is no other life besides what there is here without other physical laws. The chemistry of life let’s you know it doesn’t get better than this and it can’t be less than this. Look around and enjoy the view.",
                        "good": "0",
                        "bad": "6",
                        "replies": [
                            {
                                "user_name": "beadgBass",
                                "time": "29 June, 2021",
                                "context": "As a zoologist, I very much enjoy the view and pass the love of nature on to kids of all ages the the nature center I run.\n\nYet, and I quote, \"The chemistry of life let’s you know it doesn’t get better than this and it can’t be less than this.\" I can certainly imagine a world better than than in which supposedly intelligent species are continuously killing off members of their own species in malice and misunderstanding. And it was less than this for nearly 4 billion years when life on Earth  was bacteria and nothing more. Now THAT would be a boring safari.",
                                "good": "6",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "rubiks6",
                                        "time": "29 June, 2021",
                                        "context": "My statement about “better” was about chemistry. Did I not make that clear? You were unable to process what I said. I probably didn’t speak clearly. Your response is non sequitur. \n\nAs a zoologist, do you have any familiarity with biochemistry?\n\nAs a zoologist, do you recognize that all creatures are designed? You did note how interesting animals are. Do you believe they each became the way they are through a series of accidents? Do you believe beavers became lumberjacks and dam builders through a series of accidents? Do you believe dragonflies became the exquisite flyers they are through a series of accidents?\n\nHave you ever heard of a Lamborghini emerging from two Corvettes crashing together? Do you think that in a trillion times a trillion times a trillion crashes between two Corvettes, a Lamborghini could ever emerge?\n\nA llama is more sophisticated than a Lamborghini. Llamas don’t come about by any series of accidents.",
                                        "good": "0",
                                        "bad": "6",
                                        "replies": [
                                            {
                                                "user_name": "beadgBass",
                                                "time": "29 June, 2021",
                                                "context": "You really should get a grip and read some middle-school biology.",
                                                "good": "4",
                                                "bad": "0",
                                                "replies": [
                                                    {
                                                        "user_name": "jonathanpi",
                                                        "time": "29 June, 2021",
                                                        "context": "It is that easy for you to dismiss his points, isn't it?  No comment on how information doesn't emerge from randomness and information is literally what our DNA is.",
                                                        "good": "0",
                                                        "bad": "4",
                                                        "replies": [
                                                            {
                                                                "user_name": "beadgBass",
                                                                "time": "30 June, 2021",
                                                                "context": "DNA as \"information\" is a popular analogy, but DNA is simply a molecule with complex interactions after billions of years of evolution. It is not \"information\" by any definition, although we can glean information about our evolutionary past by studying DNA.",
                                                                "good": "5",
                                                                "bad": "0",
                                                                "replies": [
                                                                    {
                                                                        "user_name": "jonathanpi",
                                                                        "time": "30 June, 2021",
                                                                        "context": "Until the scientific process can model exactly how DNA formed on its own, and how it was able to develop into the complexity it displays over the course of time, claiming the DNA is not 'information' is a baseless statement.  You want it to not be true because the alternative is unpalatable.",
                                                                        "good": "1",
                                                                        "bad": "1",
                                                                        "replies": [
                                                                            {
                                                                                "user_name": "beadgBass",
                                                                                "time": "30 June, 2021",
                                                                                "context": "It probably started with RNA, not DNA.\nWhat I want does not matter -- DNA is not information.",
                                                                                "good": "1",
                                                                                "bad": "0",
                                                                                "replies": [
                                                                                    {
                                                                                        "user_name": "jonathanpi",
                                                                                        "time": "30 June, 2021",
                                                                                        "context": "Doesn't matter what it PROBABLY started as.  Model it, show the process, explain the stages, and stop assuming things happened in the dark that arrived to what we have today.",
                                                                                        "good": "1",
                                                                                        "bad": "2",
                                                                                        "replies": [
                                                                                            {
                                                                                                "user_name": "lycopine",
                                                                                                "time": "30 June, 2021",
                                                                                                "context": "Oh, don't worry about that. Science will solve that problem, maybe not in your lifetime, but it will.\nAnd things that happen \"in the dark\" have readily been uncovered by science. Discovery of the predicted Higgs boson took over 20 years, photographing a black hole millions of light years away the same, scientific endeavors thought to be impossible take time.\nYou religious fanatics want proof NOW, like little whining children, so you cling to your invented super being to feel safe from burning in a fictional afterlife by following the interpretations of a centuries old, multiple language translated copy of a fictional book.\nTalk about being in the dark.",
                                                                                                "good": "0",
                                                                                                "bad": "0",
                                                                                                "replies": [
                                                                                                    {
                                                                                                        "user_name": "jonathanpi",
                                                                                                        "time": "30 June, 2021",
                                                                                                        "context": "The existence of the Higgs Boson (which we havent FOUND, but have detected something within the expected ranges) or of Black Holes doesn't have any relevance to the discussion at hand, specifically the origin of life and the information within the DNA molecule.\n\nWe are simply demanding incredible evidence to back up an incredible claim.  Nothing you have shown thus far is sufficient to convince a skeptic and only sufficient enough to convince those that already want to believe, or who were raised to accept it as truth.  I was part of that generation that was fed this information as truth until I started seeing the holes in the framework.  And they were fatal flaws.\n\nYou have no real understanding of religion, specifically the Christian faith (as you seem intent on hiding behind the word 'religion' rather than stating what you really have animosity towards), if you think believers are motivated by fear.",
                                                                                                        "good": "0",
                                                                                                        "bad": "0",
                                                                                                        "replies": [
                                                                                                            {
                                                                                                                "user_name": "lycopine",
                                                                                                                "time": "30 June, 2021",
                                                                                                                "context": "Detected something? The boson WAS found and black holes were \"detected\" too. So was the atom, quark and neutrino along with dozens of other particles. Your use of the word \"found\" is baseless. And it was YOU who brought up the issue of being in the \"dark\", which is exactly what those two entities were until confirmed by observation.\n\nSo what \"incredible\" claim do you need evidence for? You see holes in the \"truth\" so you invent a magical super being and claim it does everything you don't understand including what science hasn't discovered.\nAnd yeah, I have enough understanding of Christianity and I use the general word religion too as others do pretty much the same. Most believers in Christianity were coerced with fear as children, far too young to understand gods, devils, angels, h3ll, etc. ANd their parents coerce them to obey or they'll burn. What a way to grow up, constantly in fear without understanding why. After many years of this coercion the brainwashing is firmly in place, then they grow up and have children to repeat the cycle. That is how religion perpetuates itself and is clearly stated in the bible: \"be fruitful and multiply\". Keep the faith, religion and belief system going forever. When challenged it's \"onward Christian soldiers\", convert the heathen, if they don't convert, they cannot be saved and are less than human since they will burn in the afterlife.\n\nAll nonsense.",
                                                                                                                "good": "0",
                                                                                                                "bad": "0",
                                                                                                                "replies": [
                                                                                                                    {
                                                                                                                        "user_name": "jonathanpi",
                                                                                                                        "time": "30 June, 2021",
                                                                                                                        "context": "Yes, 'detected' something that fit the within the criteria predicted for the Higgs Boson.  If you've heard that we've found it, I'd like to see your sources on it.\n\nI am not responsible with how off tangent you want to get with examples you think are appropriate with disputing my opinion.  If you want to take 'in the dark' and extrapolate it towards unrelated subject matter, that speaks of a greater issue with your perspective that it does with my argument.\n\nChristianity does not equal religion.  It is a religion but Christianity is unique among the religions, despite how many people want to smear its teachings and where it allegedly borrowed material from.  They cannot directly challenge the teachings of Christ, which are morally superior to everything else, so they build a strawman by lumping it up with other religions.  Christianity claims all people are created in the image of God.  That doesn't change after death.\n\nThe incredible claim that I need incredible evidence for is that life sprung up from non-living materials and proceeded to change over time, gaining more an more complexity, that it eventually became every living thing we see today.  That things change over time is not being debated.  That things become more complex over time, and eventually become a new thing entirely?  Yeah, that's pretty incredible there.  We see things get worse... not better.",
                                                                                                                        "good": "0",
                                                                                                                        "bad": "0",
                                                                                                                        "replies": [
                                                                                                                            {
                                                                                                                                "user_name": "lycopine",
                                                                                                                                "time": "1 July, 2021",
                                                                                                                                "context": "The teachings of Christ are not \"morally superior\" to everything else, again just your biased opinion and shows your sacred righteousness and dominion over everyone else with your claimed moral superiority. There are thousands of religions and gods of which you know very few, so how can you claim superiority over them all?\nConfucius's teachings were as good and better with just one simple philosophy:\ndon't do to others as you don't want them to do to you. Written 500 years before Christ. Then his work was stolen and plagiarized to create the so called \"golden rule\".\nIf everyone lived with that philosophy, religion would be obsolete. The ONLY reason Christianity still exists is the coercive fear instilled to young children from birth, obey or burn. Why not let children learn many religions and decide for themselves? No, their parents need to coerce them to believe.\n\nOh, and your incredible claim question has nothing to do with evolution. How life originated is not known and any reputable scientist admits that, including myself. Part of the issue is the limits of language. What exactly is life? How do you define it? What are the necessary properties to call it life, etc.?",
                                                                                                                                "good": "0",
                                                                                                                                "bad": "0",
                                                                                                                                "replies": [
                                                                                                                                    {
                                                                                                                                        "user_name": "jonathanpi",
                                                                                                                                        "time": "1 July, 2021",
                                                                                                                                        "context": "The teachings of Christ are morally superior to every other moral teaching, and I'd be glad to debate with you by comparing each and every moral teaching you want to bring forward.  If I did not believe it was superior, I would be following another religion.  It is not prideful to speak the truth, though people throw accusation of such because they don't like the implication that they are wrong.\n\n\"Confucius's teachings' - AKA the golden rule - did not predate the concept, which was present in the earliest works of the Torah long before  Confucius was alive.  Christianity may have started with Christ, but its foundation is much, much older.\n\nYour statement about coercive fear requires evidence, and you have already displayed your ignorance of the Christian worldview.  And your statement about children being exposed to more religions and able to pick for themselves...  That happens more often than not.  Christianity is not genetic.  You don't become one at birth.  You choose to become one.  Ask many of the Atheists that came to the faith after decades of fighting against it.\n\nThe origin of life, and the universe, is the crux of the matter.  It always has been.  Without a correct lens to view the world, you only see what you want to see.  If you want a world without God and consequences for your actions, you invent an origin that does not require Him.",
                                                                                                                                        "good": "0",
                                                                                                                                        "bad": "0",
                                                                                                                                        "replies": [
                                                                                                                                            {
                                                                                                                                                "user_name": "lycopine",
                                                                                                                                                "time": "1 July, 2021",
                                                                                                                                                "context": "You have regressed to coercion and self righteous arrogance of your truth claims as most religious fanatics do. You don't hold any moral superiority over anyone so to tell someone they are \"wrong\" will indeed provoke them. This is what leads to violence. Not a Christian value, is it.\nYour coercion starts by telling me I will have \"consequences\" for not believing and that I have \"invented\" an origin. That is EXACTLY what I posted you people do earlier. When parents start religious coercion on children far too young to understand it, they use images of h3ll, devils and burning if the children don't believe and obey. How can a child make a choice, as you falsely believe? They are scared of the consequences, EXACTLY what you just tried to pull on me. Except your coercive tactics don't work on educated people. Children don't have that skill. Some call that brainwashing.\n\nI did NOT invent ANY origin. Read my post again. I will repeat. I plainly and clearly stated: \"I don't know\".\n\nAs for the concept of the renamed golden rule, where in the ancient Torah did that appear? Regardless, Confucius still wrote it completely independent of the Hebrews, so the philosophy is not unique and it is irrelevant who first postulated it, IF what you claim is true.",
                                                                                                                                                "good": "0",
                                                                                                                                                "bad": "0",
                                                                                                                                                "replies": [
                                                                                                                                                    {
                                                                                                                                                        "user_name": "jonathanpi",
                                                                                                                                                        "time": "1 July, 2021",
                                                                                                                                                        "context": "I have made no attempts to coerce you with threats of anything.  You are the one projecting actions and behavior to me based on what you believe about me, and using them in turn to dismiss my claims.  Classic strawman fallacy.  Perhaps you have some personal history with people that have represented the Christian faith poorly, and that is coloring how you respond to others who are Christian.  It is quite interesting to me, since it was very similar behavior that intrigued me about the Christian faith, and the actions of those who claimed to represent it, and that caused me to really dig into it, so that I could discover for myself what the big deal was.\n\nNo, you haven't \"invented\" anything.  You are merely adopting theoretical explanations for the origin of the universe that sound good to you, even as you claim you don't know how it happened.  The common thread is, you reject other explanations that include material you simply do not want to believe.  Sure, you claim it is unscientific, but so are some of the more fantastical explanations for the cause of the big bang.  Its just less personal and personally impactful.  \n\nAs far as where Confucius received his inspiration for the 'golden rule', it doesn't matter where or when he it occurred, or from whom.  I never claimed enlightenment is unique to one particular religion or another.  My worldview, however, offers an explanation as to why people from different times and places can arrive at the same conclusions.  Does yours?",
                                                                                                                                                        "good": "0",
                                                                                                                                                        "bad": "0",
                                                                                                                                                        "replies": [
                                                                                                                                                            {
                                                                                                                                                                "user_name": "lycopine",
                                                                                                                                                                "time": "1 July, 2021",
                                                                                                                                                                "context": "Yeah, actually you did attempt coercion, in classic religious fashion I might add, regardless of how you spin it. The very FACT you tell me I will have \"consequences\" for not believing IS coercion. Here's your post:\n\"If you want a world without God and consequences for your actions, you invent an origin that does not require Him.\"\nThat now make you a liar.\nI don't dismiss your claims, I simply called them YOUR truth claims and pointed out the self righteous arrogance and coercion that goes along with it and that your religion has no monopoly on moral superiority. I backed that up with the simple FACT of Confucius's philosophy. If all humans followed that, religion would be obsolete.\n\nAgain, you falsely claim I have \"adopted\" explanations for the BB. Let me state for the third time: I don't know.\nWhat other explanations for the BB are there? I am not aware of any.\nIndependent thought has happened throughout human civilization, another famous example besides Confucius (you never proved the ancient Torah had it) is the invention of calculus by Leibniz and Newton.",
                                                                                                                                                                "good": "0",
                                                                                                                                                                "bad": "0",
                                                                                                                                                                "replies": [
                                                                                                                                                                    {
                                                                                                                                                                        "user_name": "jonathanpi",
                                                                                                                                                                        "time": "1 July, 2021",
                                                                                                                                                                        "context": "\"consequences for not believing\" - Never said that.  You aren't listening.  Not really.  I've stated that your behavior will have consequences.  YOU EVEN QUOTED IT!  Who is the liar now?  Your belief is not required.\n\nI have already given you alternate options that you won't consider for the origin of the universe, one in particular that does not violate the laws of causality.  You dismissed it out of hand and retreated to the \"I don't know\" hole, rather than think for yourself, even when it becomes uncomfortable.  If I made any assumptions about your motivations, they weren't flippant.  They might be incorrect but they were based on what I've seen in your responses, not assumptions I've invented and pulled from my own past.",
                                                                                                                                                                        "good": "0",
                                                                                                                                                                        "bad": "0",
                                                                                                                                                                        "replies": [
                                                                                                                                                                            {
                                                                                                                                                                                "user_name": "lycopine",
                                                                                                                                                                                "time": "2 July, 2021",
                                                                                                                                                                                "context": "Wron again, my friend. THe context of god and consequences follows your sentence. \"World without god AND consequences for your actiontions\".  The only intpretation of that is believing. Either that, or your writing need more clarification.",
                                                                                                                                                                                "good": "0",
                                                                                                                                                                                "bad": "0",
                                                                                                                                                                                "replies": []
                                                                                                                                                                            }
                                                                                                                                                                        ]
                                                                                                                                                                    }
                                                                                                                                                                ]
                                                                                                                                                            }
                                                                                                                                                        ]
                                                                                                                                                    },
                                                                                                                                                    {
                                                                                                                                                        "user_name": "jonathanpi",
                                                                                                                                                        "time": "1 July, 2021",
                                                                                                                                                        "context": "Due to character limits, I could not fit all of this in one post:\n\nYou asked where the 'golden rule' was in the Torah.  I am surprised you were not able to do a simple google search for the material:  \n\n\"You shall not take vengeance or bear a grudge against your kinsfolk. Love your neighbor as yourself: I am the LORD.\"  - Leviticus 19:18\n\nThere is a lot of discussion on how old that book is.  We know for sure that it was codified and written in its entirety around  538–332  BC.  But, as an oral tradition, it is centuries (or a thousand years) older.",
                                                                                                                                                        "good": "0",
                                                                                                                                                        "bad": "0",
                                                                                                                                                        "replies": [
                                                                                                                                                            {
                                                                                                                                                                "user_name": "lycopine",
                                                                                                                                                                "time": "1 July, 2021",
                                                                                                                                                                "context": "Just as I am surprised you didn't do a simple google search for the tens of thousands of articles and papers on the absolute and total debunking of ID. I provided a few examples of which you haven't addressed.\nOral tradition does not count and the 538 BCE is around the same time as Confucius wrote his. So what?\nTaking vengeance and holding a grudge is not the same as the Confucian philosophy. That is easily interpreted as \"you have been wronged, turn the other cheek\". The Confucian philosophy is directed at the individual's behavior, not a reaction to it, a much broader guiding principle.",
                                                                                                                                                                "good": "0",
                                                                                                                                                                "bad": "0",
                                                                                                                                                                "replies": [
                                                                                                                                                                    {
                                                                                                                                                                        "user_name": "jonathanpi",
                                                                                                                                                                        "time": "1 July, 2021",
                                                                                                                                                                        "context": "As I explained to you already, and having to repeat myself again does not improve my opinion of you on this matter, I am not going to continue to debate the issue of ID until you provide specific sources (not just \"go look at this) so that we can be on the same page.  Now, stop being petty, and we can discuss this like adults.  \n\n\"Oral tradition does not count\" - Says who?  You?  Good thing you are not in charge of determining what is, and is not, applicable evidence.  Either way, the book was codified at that time.  It likely existed in various forms before then and the materials lost to time.  Saying an oral tradition doesn't count is like saying 'algebra didn't exist before we wrote its rules down', even though it did exist and worked long before we 'discovered it'.  \n\n\"vengeance is different...\" - Yeah, let's just skip the part about loving your neighbor as yourself, as if it doesn't make the entire statement that much clearer.  That is so intellectual honest of you...  Its like you didnt even take the time to think the implications of that statement out before you posted...  Oh... right.  That's been an obvious trait you've displayed several times already.",
                                                                                                                                                                        "good": "0",
                                                                                                                                                                        "bad": "0",
                                                                                                                                                                        "replies": [
                                                                                                                                                                            {
                                                                                                                                                                                "user_name": "lycopine",
                                                                                                                                                                                "time": "2 July, 2021",
                                                                                                                                                                                "context": "I already listed several SPECIFIC sources for the thorough ID debunking. Apparently you did not see them. And there are tens of thousands more.\nOral \"tradition\" is not verifiable and in court and it's called hearsay for a reason. So it's not me deciding. Just because you make a claim like that you still can't prove it. Good thing there are courts and other methods to prevent the inaccuracies of hearsay since you would create a disaster believing it.\nI did NOT skip the love thy neighbor part. Love thy neighbor after he burns your house down out of vengeance. That makes great sense, doesn't it? Vengeance was the first, which is what I addressed. Why was vengeance first or for that matter, why was it even there?",
                                                                                                                                                                                "good": "0",
                                                                                                                                                                                "bad": "0",
                                                                                                                                                                                "replies": [
                                                                                                                                                                                    {
                                                                                                                                                                                        "user_name": "jonathanpi",
                                                                                                                                                                                        "time": "2 July, 2021",
                                                                                                                                                                                        "context": "Who's arguing evidence in a court room?  A court room doesn't use the same standards as the scientific community, which doesn't use the same standards of proof that common people in society use to make general decisions about what is reality or not.  Seems you have a shifting definition of what is and is not evidence, OR you haven't clearly defined what it is and stepped into the conversation with a couple of assumptions built in.  \n\nThe two statements are complimentary, but each stand on their own.  When you are wronged, do not seek out vengeance.  Love you neighbor as yourself.  If you do that later, you do not do the former.  Why was the vengeance part first?  It only matters to those interested in nit-picking the passages for loopholes rather than taking it at face value.  That's like asking why Spanish has different places for their verbs and nouns in their sentence structure.",
                                                                                                                                                                                        "good": "0",
                                                                                                                                                                                        "bad": "0",
                                                                                                                                                                                        "replies": []
                                                                                                                                                                                    }
                                                                                                                                                                                ]
                                                                                                                                                                            }
                                                                                                                                                                        ]
                                                                                                                                                                    }
                                                                                                                                                                ]
                                                                                                                                                            }
                                                                                                                                                        ]
                                                                                                                                                    }
                                                                                                                                                ]
                                                                                                                                            }
                                                                                                                                        ]
                                                                                                                                    }
                                                                                                                                ]
                                                                                                                            }
                                                                                                                        ]
                                                                                                                    }
                                                                                                                ]
                                                                                                            }
                                                                                                        ]
                                                                                                    }
                                                                                                ]
                                                                                            },
                                                                                            {
                                                                                                "user_name": "beadgBass",
                                                                                                "time": "30 June, 2021",
                                                                                                "context": "I do biological evolution, not life origins.\nI'm a zoologist, not a biochemist.\nI'll be interested in what they come up with, but it is really irrelevant to evolution.",
                                                                                                "good": "2",
                                                                                                "bad": "0",
                                                                                                "replies": [
                                                                                                    {
                                                                                                        "user_name": "jonathanpi",
                                                                                                        "time": "30 June, 2021",
                                                                                                        "context": "I don't care what branch of science you work in.  Everything ties back to the same question.  Where did the information come from?  You should understand how complex DNA is in your field of work.",
                                                                                                        "good": "0",
                                                                                                        "bad": "1",
                                                                                                        "replies": [
                                                                                                            {
                                                                                                                "user_name": "beadgBass",
                                                                                                                "time": "30 June, 2021",
                                                                                                                "context": "Yes, I know how complex DNA is.\nAnd once again, it is not information.\n\nIts origin, again, is not a question of evolution but of biochemistry. Likewise, people often ask me about the the origin of the universe, but I leave that to the cosmologists and physicists. Neither are questions of evolutionary biology.",
                                                                                                                "good": "1",
                                                                                                                "bad": "0",
                                                                                                                "replies": [
                                                                                                                    {
                                                                                                                        "user_name": "jonathanpi",
                                                                                                                        "time": "30 June, 2021",
                                                                                                                        "context": "It is information.  You can even look up the definition of 'information' and see how it is linked to genetic expression in the example.\n\nYou might not agree but that is an entirely different argument.",
                                                                                                                        "good": "0",
                                                                                                                        "bad": "1",
                                                                                                                        "replies": [
                                                                                                                            {
                                                                                                                                "user_name": "beadgBass",
                                                                                                                                "time": "30 June, 2021",
                                                                                                                                "context": "In the world of biology, where we understand how DNA evolves, we do not consider it be information. That is just an analogy, not a reality.",
                                                                                                                                "good": "1",
                                                                                                                                "bad": "0",
                                                                                                                                "replies": [
                                                                                                                                    {
                                                                                                                                        "user_name": "jonathanpi",
                                                                                                                                        "time": "30 June, 2021",
                                                                                                                                        "context": "Oh, really?  You know how DNA evolves?  Mutations and natural selection, right?  Sounds like the DNA is changing, that is for sure.  But evolving...?  Which particular meaning of the word are you using here?  It can mean several different things.  From simply changing to developing more complexity over time.\n\nI am not asking this flippantly.  I am curious.  I've never heard of us being able to see DNA achieve greater complexity in the lab.",
                                                                                                                                        "good": "0",
                                                                                                                                        "bad": "1",
                                                                                                                                        "replies": []
                                                                                                                                    }
                                                                                                                                ]
                                                                                                                            }
                                                                                                                        ]
                                                                                                                    }
                                                                                                                ]
                                                                                                            }
                                                                                                        ]
                                                                                                    }
                                                                                                ]
                                                                                            }
                                                                                        ]
                                                                                    }
                                                                                ]
                                                                            },
                                                                            {
                                                                                "user_name": "lycopine",
                                                                                "time": "30 June, 2021",
                                                                                "context": "We don't want it to be true, we want to UNDERSTAND how it works and evolved so we KNOW what the truth really is, instead of declaring it's \"too complex\" and the invent a super being to explain it.\nSpeaking of unpalatable alternatives, that's EXACTLY what organized religion and its adherents try to prevent. Anything and anyone that dare challenge their sacred righteous belief system must be silenced. And usually through coercion, threats, punishment, torture and execution. Galileo and Darwin are two cases in point.\nYou modern day religious fanatics are no different.",
                                                                                "good": "2",
                                                                                "bad": "1",
                                                                                "replies": [
                                                                                    {
                                                                                        "user_name": "jonathanpi",
                                                                                        "time": "30 June, 2021",
                                                                                        "context": "Wanting it to be true and wanting to know what the truth can both be true at the same time.  They are not mutually exclusive goals.  They can be at odds when you want to believe something so bad that you overlook other explanations.\n\nPlease. Organized religion are not trying to prevent the truth from being known.  They feel they have a monopoly on the truth and those who truly believe they hold the truth are not afraid to have their beliefs challenged, and proven true.  The ones using threats, punishment, torture and execution are those secularists that want to force the world along the path they deem correct.  Others are backwards religions that are hypocritical in their own beliefs.",
                                                                                        "good": "1",
                                                                                        "bad": "1",
                                                                                        "replies": [
                                                                                            {
                                                                                                "user_name": "lycopine",
                                                                                                "time": "30 June, 2021",
                                                                                                "context": "Oh, you got it all figured out. Except you ignore the centuries of history where organized religion, specifically the Christian religion, has used coercion, threats, sacred violence, torture and murder on the \"other\" because it is the one \"true\" religion and has the one \"true\" god. And if you don't believe as they do, you are less than human and cannot be \"saved\". When Christian beliefs are challenged that is what the organizational leaders do.  That's why UN intelligent design was invented here in modern times since Christian fanatics can't coerce, threaten, torture and murder people who don't believe them in western civilization any longer. Their master plan, as exposed in the \"Wedge Document\", is to spread conservative Christian religious thinking in public schools to indoctrinate ALL children the way they do their own. Can you not see that? Or are you too afraid to look at the history, reality and truth?",
                                                                                                "good": "2",
                                                                                                "bad": "1",
                                                                                                "replies": [
                                                                                                    {
                                                                                                        "user_name": "jonathanpi",
                                                                                                        "time": "30 June, 2021",
                                                                                                        "context": "I have forgotten nothing.  People have used whatever means and methods they have access to in order to justify their own desires and actions.  People acting against church doctrine did result in horrible things happening in the past, even as people before them inflicted horrible things on the people trying to spread a message of peace, love and acceptance.\n\nThe thing is, I don't blame a religion for the actions of those that claim to be religious.  Just like I don't blame every atheist for the actions of every secular, non-religious person who committed atrocities in the past.  I blame people for their individual actions.",
                                                                                                        "good": "0",
                                                                                                        "bad": "0",
                                                                                                        "replies": [
                                                                                                            {
                                                                                                                "user_name": "lycopine",
                                                                                                                "time": "30 June, 2021",
                                                                                                                "context": "Ok. Then in the religion of peace, love and acceptance, i.e. Christianity, true adherents are few over the centuries. The vast majority aid and abet, stand and watch, listen and follow their leaders, participate indirectly and directly using righteous beliefs as reinforced by their leaders and biased beliefs to perform the atrocities. Nazi Germany is the latest example with over 70% of its population being \"good\" Christians. The coercive nature of organized religion is insidious and once it gains a majority in a country, it takes over the government, then can use the resources to coerce others and inflict pain, misery and death to the non believers.",
                                                                                                                "good": "1",
                                                                                                                "bad": "1",
                                                                                                                "replies": [
                                                                                                                    {
                                                                                                                        "user_name": "jonathanpi",
                                                                                                                        "time": "30 June, 2021",
                                                                                                                        "context": "There have been many times more 'true adherents' over the centuries than not.  You are somehow just hung up on the ones that gained power and rocked the boat, to coin a phrase.  Understandable but you still need to keep it in context.  There have always been evil people.  Start acting like that is a reality and stop pretending groups are responsible for the actions of the evil individuals.\n\nThere were very few 'good' Christians that acted in Nazi Germany, and they were the ones that helped hide the Jews under threat of their own lives.  I'd argue that most Christians are not 'good' at all.  Christ himself sad that many will call his name and he would reply that he never knew them.  Actions and behavior are indicators of faith, not words or claims.\n\nSuch is why we have taken great care to separate the government from religion in the western world.  But, fanaticism is inevitable as government will become its own religion (as it is quite near to doing right now) and seek to impose itself on the country again.  It is only through strict tenets that evil is kept at bay.",
                                                                                                                        "good": "1",
                                                                                                                        "bad": "1",
                                                                                                                        "replies": [
                                                                                                                            {
                                                                                                                                "user_name": "lycopine",
                                                                                                                                "time": "1 July, 2021",
                                                                                                                                "context": "No, there are NOT many times more \"true adherents\", all those \"true adherents\" stood by and LET their religious leaders and followers commit all those atrocities over the centuries.\nThere are very few \"good\" Christians anywhere throughout history.\n\"WE\" have NOT taken great care to separate government from religion in the USA. Even today, there are Christian fanatics passing laws mandating biblical creationism be taught as science in public school, just like the \"wedge Document\" proved. And this has been going on since Columbus brought Christianity to the Americas, over 500 years of coercion, destruction and death for the \"other\".\nOrganized religion = death",
                                                                                                                                "good": "0",
                                                                                                                                "bad": "0",
                                                                                                                                "replies": [
                                                                                                                                    {
                                                                                                                                        "user_name": "jonathanpi",
                                                                                                                                        "time": "1 July, 2021",
                                                                                                                                        "context": "People are cowards and many hold beliefs because they are convenient.  It is easy to recognize those when they allow evil to flourish and do nothing to stop it, yet no one wants to recognize the actions and behaviors of a stable and peaceful society for the long periods of time before, where they kept everything in check.\n\nAnd, I knew that you would confuse the separation of church and state, and hyper-focus on the religious aspects infiltrating the government.  Your kind always does because of the animosity you hold towards religion (Christianity).  Let me clear it up for you.  The Constitution never meant to keep religion out of the government.  It meant to keep the government out of religion.  Our Constitution was made for a moral and religion people, and is whole inadequate to the governing of any other.  I am paraphrasing, but surely you are familiar with the statement?  You make such a big deal about being aware of history, yes?",
                                                                                                                                        "good": "0",
                                                                                                                                        "bad": "0",
                                                                                                                                        "replies": [
                                                                                                                                            {
                                                                                                                                                "user_name": "lycopine",
                                                                                                                                                "time": "1 July, 2021",
                                                                                                                                                "context": "Your opinion on the Constitution keeping government out of religion is false. The doctrine is \"separation of church and state\" as interpreted by legal scholars including SCOTUS. When religious fanatics, usually Christians, pass laws mandating biblical creationism be taught as science in public school, THAT is religious coercion, using the government to advance their beliefs. The USA is not a theocracy just because the majority of the population declares itself Christian. (And of course we both know the majority of those calling themselves Christian, aren't).",
                                                                                                                                                "good": "0",
                                                                                                                                                "bad": "0",
                                                                                                                                                "replies": [
                                                                                                                                                    {
                                                                                                                                                        "user_name": "jonathanpi",
                                                                                                                                                        "time": "1 July, 2021",
                                                                                                                                                        "context": "Please.  Separation of Church and State does not even exist within the Constitution itself.  I am not about to sit here and attempt to educate you on the matter while you invent intentions and motivations for a portion of the population you clearly do not understand.\n\nI don't want the USA to be a theocracy.    But it is turning into one, being controlled by secularists that will eventually undermine the core tenets of the Constitution (namely every human has rights endowed by their Creator), and being violating its own teachings when the opportunity allows for such things to be justified.  It is nothing new.  Happens all throughout human history.",
                                                                                                                                                        "good": "0",
                                                                                                                                                        "bad": "0",
                                                                                                                                                        "replies": [
                                                                                                                                                            {
                                                                                                                                                                "user_name": "lycopine",
                                                                                                                                                                "time": "1 July, 2021",
                                                                                                                                                                "context": "Where did I state that phrase was in the Constitution? It is a DOCTRINE interpreted by legal scholars, INCLUDING SCOTUS.\nDo I need to educate you that the Constitution REQUIRES interpretation?",
                                                                                                                                                                "good": "0",
                                                                                                                                                                "bad": "0",
                                                                                                                                                                "replies": [
                                                                                                                                                                    {
                                                                                                                                                                        "user_name": "jonathanpi",
                                                                                                                                                                        "time": "1 July, 2021",
                                                                                                                                                                        "context": "I am aware that certain people require the Constitution to be interpreted in certain ways to justify their beliefs on certain things.  Others need to be updated for more modern issues that weren't possible to foresee when it was written, however... separation of church and state were not one of them.  What is being bickered over is how far the definition of 'government' extends (any person receiving income from the government, for example).\n\nThe issue extends to laws made by the government that intrude on the freedom of religious practice, and the speech thereof.  It is really that simple.  People just want it to be more.\n\nI apologize for misreading your last post.",
                                                                                                                                                                        "good": "0",
                                                                                                                                                                        "bad": "0",
                                                                                                                                                                        "replies": [
                                                                                                                                                                            {
                                                                                                                                                                                "user_name": "lycopine",
                                                                                                                                                                                "time": "2 July, 2021",
                                                                                                                                                                                "context": "\"certain people require interpretation\" huh? Now that's a hoot. SCOTUS was put in the Constitution to do EXACTLY THAT, interpret the laws, as all courts do. That is absolutely necessary to live in reality.\nYour bible is constantly being interpreted.\nANd how about religious fanatics passing laws mandating their religion, e.g. biblical creationism, be taught in public schools as science",
                                                                                                                                                                                "good": "0",
                                                                                                                                                                                "bad": "0",
                                                                                                                                                                                "replies": []
                                                                                                                                                                            }
                                                                                                                                                                        ]
                                                                                                                                                                    }
                                                                                                                                                                ]
                                                                                                                                                            }
                                                                                                                                                        ]
                                                                                                                                                    }
                                                                                                                                                ]
                                                                                                                                            }
                                                                                                                                        ]
                                                                                                                                    }
                                                                                                                                ]
                                                                                                                            }
                                                                                                                        ]
                                                                                                                    }
                                                                                                                ]
                                                                                                            }
                                                                                                        ]
                                                                                                    }
                                                                                                ]
                                                                                            }
                                                                                        ]
                                                                                    }
                                                                                ]
                                                                            }
                                                                        ]
                                                                    }
                                                                ]
                                                            },
                                                            {
                                                                "user_name": "lycopine",
                                                                "time": "30 June, 2021",
                                                                "context": "It's very easy to dismiss debunked garbage like UN intelligent design, which is exactly what rubix has always offered up.",
                                                                "good": "2",
                                                                "bad": "0",
                                                                "replies": [
                                                                    {
                                                                        "user_name": "jonathanpi",
                                                                        "time": "30 June, 2021",
                                                                        "context": "Information does not come from a vacuum.",
                                                                        "good": "0",
                                                                        "bad": "0",
                                                                        "replies": [
                                                                            {
                                                                                "user_name": "lycopine",
                                                                                "time": "30 June, 2021",
                                                                                "context": "Oh, And what \"information\" are you referring to?\nAnd the \"quantum jitters\" IS a vacuum, where matter pops in to existence from NOTHING.\nYou do know that UN intelligent design has been thoroughly debunked as religious garbage since it was INVENTED by two Reagan era religious fanatics whose primary agenda was to \"legitimize\" biblical creationism, right?",
                                                                                "good": "1",
                                                                                "bad": "0",
                                                                                "replies": [
                                                                                    {
                                                                                        "user_name": "jonathanpi",
                                                                                        "time": "30 June, 2021",
                                                                                        "context": "Just because you don't know where something is coming from does not mean it is coming from nowhere.  That is magical thinking.\n\nThe more we learn about the complexity of DNA, the less room there is for the molecule to have developed through random processes, or accidental mutations.  Until you can show through a proper model how these things can occur without intellectual manipulation, you can never debunk the intelligent design argument.",
                                                                                        "good": "0",
                                                                                        "bad": "1",
                                                                                        "replies": [
                                                                                            {
                                                                                                "user_name": "lycopine",
                                                                                                "time": "30 June, 2021",
                                                                                                "context": "Wrong. UN intelligent design has already been debunked many times over and as I already stated, it was INVENTED by religious fanatics to \"legitimize\" biblical creationism. Got it? \nUN-ID is not and never will be an explanation for life, abiogenisis, evolution or any other scientific inquiry.\n\nIf you even partially understood quantum mechanics, quantum electrodynamics or quantum field theory you'd have a tiny idea of what our universe is doing.\nYOU are the one using magical thinking, inventing a super being to explain things you don't understand or use that debunked and idiotic \"argument from incredulity\" --- \nOOOO things are too complex to happen that way, therefore a super being did it.",
                                                                                                "good": "1",
                                                                                                "bad": "0",
                                                                                                "replies": [
                                                                                                    {
                                                                                                        "user_name": "jonathanpi",
                                                                                                        "time": "30 June, 2021",
                                                                                                        "context": "No, intelligence behind the design has not been debunked.  Mainstream science just doesn't like the idea of letting a 'god' figure into the room.  Plenty of them are more than wiling to accept that life started elsewhere and was seeded across the universe, but this just kicks the can down the road to where it originally started.\n\nI understand quantum mechanics quite well (or, rather, the current theories on it).  Don't make assumptions about my base of knowledge just because you disagree with me.  We all have the same evidence to work with.  I just don't make  assumptions that fly in the face of causality.  Every effect had a cause.  For something to appear, something caused it to appear, even if you can't figure out what did it.",
                                                                                                        "good": "0",
                                                                                                        "bad": "0",
                                                                                                        "replies": [
                                                                                                            {
                                                                                                                "user_name": "lycopine",
                                                                                                                "time": "30 June, 2021",
                                                                                                                "context": "Yes, it HAS been debunked as I stated before. You haven't studied the history and invention of UN ID as I have.\nMainstream science doesn't care about super beings since they are human inventions used to explain things not understood. Putting an invented entity in any scientific inquiry must have a falsifiable hypothesis, such as the prediction of the HIggs boson or black holes. A super being is not falsifiable, rendering it useless and meaningless in scientific inquiry.\nYour \"cause and effect\" example is a case in point. You haven't figured it out yet so you assign a super being to explain it. Why not use an invisible intergalactic fire breathing giant cockroach as the cause, it inhales the matter and exhales fire that causes the matter to appear?\nSuch nonsense.\nAnd if you understood quantum mechanics \"quite well\" you'd know all about the jitters and vacuum energy and the matter-antimatter particles coming apart at the event horizon of black holes. Matter appearing and disappearing constantly, throughout the entire observable universe.",
                                                                                                                "good": "1",
                                                                                                                "bad": "0",
                                                                                                                "replies": [
                                                                                                                    {
                                                                                                                        "user_name": "jonathanpi",
                                                                                                                        "time": "30 June, 2021",
                                                                                                                        "context": "I am not going to go around and around arguing with you about intelligent design being debunked or not.  As I said before, do not assume my level of familiarity with the subject just because I disagree with you.  Provide the sources for the 'debunking' of the argument and the scientific methods used to do so.  \n\nI am well aware of the theories, assumptions and projections of what may or may not occur at the event horizon of a black hole.  We haven't observed any of these things happening but even if they did, that doesn't mean they appear or disappear into and out of nothing.  They go somewhere and come from somewhere.  To think any different is LITERALLY magical thinking, just like people used to think flies simply came into existence out of rotting material.\n\nAs for my argument of causality, I do not need to 'invent' a super being.  One is required by logic alone.  To create time, space and matter, it must be timeless, spaceless and immaterial.  For something to 'cause' the first effect, it must exist before all causes and effect.  We know the universe had a beginning.  Or do you disagree with the current cosmological model?",
                                                                                                                        "good": "0",
                                                                                                                        "bad": "1",
                                                                                                                        "replies": [
                                                                                                                            {
                                                                                                                                "user_name": "lycopine",
                                                                                                                                "time": "30 June, 2021",
                                                                                                                                "context": "So you can't look up the history of the invention of UN-ID, nor the thorough debunking yourself huh? I got it, that would be unpalatable to you. Plus I already debunked it as science. Once again: THERE IS NO FALSIFIABLE HYPOTHESIS. DEBUNKED in one sentence! Got it?\nFrom irreducible complexity to accelerated nuclear decay, all have been shown as nonsense. Look it up yourself, though you not might like what you find.\nWhy is it that only religious fanatics push ID as real science when it can't even meet the criteria to get past the hypothesis stage?\n\nAs for your rather idiotic claim that it's only \"logical\" to assume a super being to explain cause and effect, that claim falls under the realm of philosophy, NOT science. Your presumption that \"to create time, space and matter\" a super being must be \"timeless, spaceless and immaterial\" fails outright. How can any \"being\" have those properties in reality? To answer that question, religious fanatics invent a super being that exists in nothingness.\n\nWe know our OBSERVABLE universe started with the BB, we don't know what happened before that. And this has been confirmed rolling time back to 10^-35 seconds along four completely different lines of inquiry, all of which have had observations and corresponding data collected over decades.",
                                                                                                                                "good": "0",
                                                                                                                                "bad": "0",
                                                                                                                                "replies": [
                                                                                                                                    {
                                                                                                                                        "user_name": "jonathanpi",
                                                                                                                                        "time": "30 June, 2021",
                                                                                                                                        "context": "\"So you can't look up the history...\" - I'll stop you there.  You are assuming I am incapable of doing something or of lacking access to the same materials as you.  Again.  Quit it.  I have reached very different conclusions than you have about the matter and I have access to the SAME evidence as you do.  Since you persist on arguing over the matter, I have asked you to provide the source that has convinced you.  I will not argue with you about it until we can be sure we are on the same page, with the same material.\n\nAll claims on the history of the universe, where no man has borne witness to, cannot replicate, or do we possess a time machine, is a practice in philosophy.  I did not think you ignorant enough to be unaware of that fact, but perhaps you are.  Logic itself doesn't exist, not in any physical form in this reality.  Neither does mathematics.  Or science.  They are all metaphysical constructs we use to understand the universe.  Throwing away philosophy just because you don't like it, ... well, that's foolish. \n\nRight, the universe began with a bang.  As far as we project and assume.  We can't push it back further because time essentially began there.  Space began there.  Energy became light and matter.  The physical laws of the universe began there.  We have no frame of reference beyond it.  But something caused it all.  I call that something God.  You can call it whatever you want.  We can, however, both agree that it was a miracle.",
                                                                                                                                        "good": "0",
                                                                                                                                        "bad": "0",
                                                                                                                                        "replies": [
                                                                                                                                            {
                                                                                                                                                "user_name": "lycopine",
                                                                                                                                                "time": "30 June, 2021",
                                                                                                                                                "context": "So what is your take on the ID \"wedge document\" then? What is your response to my post that ID in NOT science because it does NOT have a falsifiable hypothesis? Two of the primary ID arguments, irreducible complexity and accelerated nuclear decay have been shown to be false numerous times. ID has ZERO published studies and data other than in religious works, why is that?\nThese are just a few of the sources and arguments you can refute. Good luck.\n\nIt is not necessary to \"bear witness\" or \"replicate anything\" to prove things in nature. That's the old \"falling tree in the forest doesn't make a sound\" ignorance. Crimes are solved by forensics as are cosmological problems. The scientific tools of physics and mathematics allow the human mind to understand nature and is the language of nature that we can understand to some degree. No super being is created to explain anything, a scientist would simply say \"I don't know, I'll figure it out\". Philosophy crosses over the boundary of the scientific method when super beings are postulated. And since it is impossible to prove the existence of a super being, that renders it UN scientific.\n\nAs for the \"cause\" of the BB, we don't even know if there was a cause. You stop short of admitting that. It's possible, philosophically, for another universe prior to the BB coalesced to the singularity, or maybe there's a pulsing of matter-antimatter, etc. we simply don't know. You and religious adherents create a god instead of saying you don't know.",
                                                                                                                                                "good": "0",
                                                                                                                                                "bad": "0",
                                                                                                                                                "replies": [
                                                                                                                                                    {
                                                                                                                                                        "user_name": "jonathanpi",
                                                                                                                                                        "time": "30 June, 2021",
                                                                                                                                                        "context": "\"Two of the primary ID arguments, irreducible complexity and accelerated nuclear decay have been shown to be false numerous times.\"  - As I said, provide your source.  I will not continue to debate this.\n\n\"It is not necessary to \"bear witness\" or \"replicate anything\" to prove things in nature\" - Depends on what you mean by 'prove things'.  You want to convince a skeptic that things work a certain way, you must show them.  You want to make claims that alter the fundamental assumptions of origins, you must prove them definitively.  This is what it means to provide incredible evidence for incredible claims.  Otherwise, an uncaused caused is just as logically sound as any other theory you can provide on the origins of the universe.  \n\n\"its possible for another universe to have...\" - Blah, blah, blah.  As I said before, causality requires an initial cause.  If a universe caused this one, then one caused that one.  Keep rewinding until your mind breaks or you admit that something had to have kicked started the whole thing.  Had to have CHOSEN to start it because forces don't act on their own, they simply are.",
                                                                                                                                                        "good": "0",
                                                                                                                                                        "bad": "0",
                                                                                                                                                        "replies": []
                                                                                                                                                    }
                                                                                                                                                ]
                                                                                                                                            }
                                                                                                                                        ]
                                                                                                                                    }
                                                                                                                                ]
                                                                                                                            }
                                                                                                                        ]
                                                                                                                    }
                                                                                                                ]
                                                                                                            }
                                                                                                        ]
                                                                                                    }
                                                                                                ]
                                                                                            }
                                                                                        ]
                                                                                    }
                                                                                ]
                                                                            }
                                                                        ]
                                                                    }
                                                                ]
                                                            },
                                                            {
                                                                "user_name": "quietsmith",
                                                                "time": "30 June, 2021",
                                                                "context": "Nobody said it does clown :D",
                                                                "good": "1",
                                                                "bad": "0",
                                                                "replies": [
                                                                    {
                                                                        "user_name": "jonathanpi",
                                                                        "time": "30 June, 2021",
                                                                        "context": "Elaborate on how information can emerge without intelligence behind it.  I'll wait.",
                                                                        "good": "0",
                                                                        "bad": "1",
                                                                        "replies": [
                                                                            {
                                                                                "user_name": "lycopine",
                                                                                "time": "30 June, 2021",
                                                                                "context": "First we'll wait for your definitions of information and intelligence...",
                                                                                "good": "0",
                                                                                "bad": "0",
                                                                                "replies": [
                                                                                    {
                                                                                        "user_name": "jonathanpi",
                                                                                        "time": "30 June, 2021",
                                                                                        "context": "The dictionary too hard for you?\n\nIntelligence:  the ability to acquire and apply knowledge and skills.\n\nInformation: what is conveyed or represented by a particular arrangement or sequence of things.  (\"genetically transmitted information\" is right there as an example in the definition)",
                                                                                        "good": "0",
                                                                                        "bad": "0",
                                                                                        "replies": [
                                                                                            {
                                                                                                "user_name": "lycopine",
                                                                                                "time": "30 June, 2021",
                                                                                                "context": "well let's see know. The ocean is able to sort rocks by size and organize them in to distinct rows with a smooth transition between sizes. That requires knowledge of rock sizes and the ability to move them and the capacity to understand the different sizes and organize them accordingly, i.e. information.\n\nConcept too hard for you?\nNext....",
                                                                                                "good": "0",
                                                                                                "bad": "0",
                                                                                                "replies": [
                                                                                                    {
                                                                                                        "user_name": "jonathanpi",
                                                                                                        "time": "30 June, 2021",
                                                                                                        "context": "No, apparently the concept of information is too difficult to you.  It is amazing that you are capable of communicating as it is without realizing, consciously, exactly what information is.\n\nWhat is conveyed or represented by the arrangement of rocks by ocean currents?  Think about that.  Information is not just the arrangement of objects by size or smoothness, but has a meaning that is conveyed by a particular arrangement of objects by size and smoothness, something that another intelligent being can understand.",
                                                                                                        "good": "0",
                                                                                                        "bad": "0",
                                                                                                        "replies": [
                                                                                                            {
                                                                                                                "user_name": "lycopine",
                                                                                                                "time": "30 June, 2021",
                                                                                                                "context": "Oh. So now you add to your definition that ANOTHER \"intelligent\" being \"can understand\"? \nLet's see now. The ocean knows what its doing by organizing the rocks, the critters living near the arrangement know this and can take advantage of the arrangement and don't have to go looking for the right sizes. So the ocean and the critters are communicating with one another and understand each other.\nNext...",
                                                                                                                "good": "0",
                                                                                                                "bad": "0",
                                                                                                                "replies": [
                                                                                                                    {
                                                                                                                        "user_name": "jonathanpi",
                                                                                                                        "time": "30 June, 2021",
                                                                                                                        "context": "I am not adding anything to my definition.  Something being 'conveyed or represented' must be conveyed TO something possessing the ability to perceive it, or capable of understanding what is being represented.  \n\nAre you going to take this seriously, or are you merely going to attempt to shoe-horn in your incredibly misrepresented idea of what information is, and try to bend the examples to fit your own narrative?  Your example of the ocean and the critters within DO NOT SHOW ANY EXCHANGE OF INFORMATION.",
                                                                                                                        "good": "0",
                                                                                                                        "bad": "0",
                                                                                                                        "replies": [
                                                                                                                            {
                                                                                                                                "user_name": "lycopine",
                                                                                                                                "time": "30 June, 2021",
                                                                                                                                "context": "Oh. In your OPINION they don't. Tell us how and why the ocean organizes rocks and how and why critters that use such rocks know where it's located? That is information exchange at its most basic level. Plus it also shows more evidence of evolution. Those critters found the most advantageous place to seek shelter and thus now live where they know it can be obtained. Didn't happen by accident or need a designer for critters to perceive, observe, understand and act.\nAre you going to take this seriously or are you merely going to ignore plain, simple and basic facts to negate this most elegant example.",
                                                                                                                                "good": "0",
                                                                                                                                "bad": "0",
                                                                                                                                "replies": [
                                                                                                                                    {
                                                                                                                                        "user_name": "jonathanpi",
                                                                                                                                        "time": "30 June, 2021",
                                                                                                                                        "context": "The ocean does not 'organize' rocks.  Basic processes, which we call natural laws, filter more dense and less dense materials based on the buoyancy within the given medium.  This is not information.  This is physics.  Critters use advantageous locations in order to protect themselves.  This is adaptation, not evolution (in the greater sense of the word).  An exchange of information would be these sea critters directing more of their own kind to these locations to make use of them.\n\nYou are not, and I fear are incapable of, presenting any kind of 'elegant' examples of the exchange of information.  I do not argue that the ocean movements shift materials around.  That is a fact.  I do not argue that sea critters make use of specific types of materials.  That is a fact.  What is not a fact is that this is an exchange of information.",
                                                                                                                                        "good": "0",
                                                                                                                                        "bad": "0",
                                                                                                                                        "replies": [
                                                                                                                                            {
                                                                                                                                                "user_name": "lycopine",
                                                                                                                                                "time": "30 June, 2021",
                                                                                                                                                "context": "I don't buy your reasoning. The laws of physics do indeed cause organization out of chaos, one of the fundamental principles of evolution. That is a fact. It works in the rock example and works on RNA and DNA. And exchange of information DOES happen with critters as new ones observe what others are doing and replicate their activities, passing down information to the surviving generation, another elegant example of evolution. The RNA/DNA of these critters undergoes tiny changes where the surviving generation incorporates more information, such as choosing rock color and shape for adaptation to survive better. That is also a fact.",
                                                                                                                                                "good": "0",
                                                                                                                                                "bad": "0",
                                                                                                                                                "replies": [
                                                                                                                                                    {
                                                                                                                                                        "user_name": "jonathanpi",
                                                                                                                                                        "time": "30 June, 2021",
                                                                                                                                                        "context": "Organizing is not information.  Look back on the definitions I gave you and THINK about them.  Fractal patterns, or other ordered patterns, that occur in nature are not information.  They are merely repeating patterns.  I suspect you are using a very loose definition of what you consider to be information (something like 'data' or 'stimuli') and are muddying your own waters with it.\n\nTelling me that the genetic code of the critters CHANGE based on what environment they occupy is not helping your argument.  I expect that to occur because DNA is information, specifically information that alters itself in response to various different things (especially environmental) and has the ability to return to its previous state.",
                                                                                                                                                        "good": "0",
                                                                                                                                                        "bad": "0",
                                                                                                                                                        "replies": [
                                                                                                                                                            {
                                                                                                                                                                "user_name": "lycopine",
                                                                                                                                                                "time": "30 June, 2021",
                                                                                                                                                                "context": "Actually fractal patterns are indeed information and they are NOT repeating patterns, e.g. each snowflake is unique and IS a fractal pattern. You need to study physics more. Leonard Susskind showed that in holograms is but one example. I am still using the definition of what you gave, and it is nebulous at best.\nChanges in critter DNA happens on a random basis, however, it is NOT the primary reason behind evolution, that is natural selection. Critters that survive pass on their DNA, random changes occur and a few change the critter for enhanced survival for the next generation, most changes do nothing a fewer are detrimental.",
                                                                                                                                                                "good": "0",
                                                                                                                                                                "bad": "0",
                                                                                                                                                                "replies": [
                                                                                                                                                                    {
                                                                                                                                                                        "user_name": "jonathanpi",
                                                                                                                                                                        "time": "30 June, 2021",
                                                                                                                                                                        "context": "Perhaps you need to slow down and actually read what I wrote thoroughly.  You assumed that I called fractal patterns repeating patterns, when I separated them from other 'repeating patterns' in my statement.  Work on your reading comprehension skills.  You will be confused less often.  Also, again, stop assuming my knowledge base on matters.  You have been wrong three times already.\n\nChanges in critters DNA do not just occur randomly.  They happen all the time.  Even in the same organism on a daily basis, though likely not in all the cells of the organism and not likely in the reproductive cells.  DNA is a dynamic protein.  \n\nYou are incorrect on this matter, however:  \"most changes do nothing a fewer are detrimental.\"  Most changes are detrimental to an organism.  Most of them do nothing immediately observable due to the redundancy built in to the DNA itself.",
                                                                                                                                                                        "good": "0",
                                                                                                                                                                        "bad": "0",
                                                                                                                                                                        "replies": [
                                                                                                                                                                            {
                                                                                                                                                                                "user_name": "lycopine",
                                                                                                                                                                                "time": "1 July, 2021",
                                                                                                                                                                                "context": "Here's your verbatim post:\n\"Fractal patterns, or other ordered patterns, that occur in nature are not information.  They are merely repeating patterns.\"\n\"THEY, includes fractal pattern in sentence two.\nYou need work in writing clearly.\nI am totally correct on how DNA changes, most do nothing, a few enhance and very few are detrimental. That is FACT. You post DNA changes don't happen \"randomly\" they happen all the time. The changes ARE random.\nFinally, you are obviously NOT a scientist or even an informed layman.\nDNA is NOT a protein. Your credibility is completely lost with that statement.",
                                                                                                                                                                                "good": "0",
                                                                                                                                                                                "bad": "0",
                                                                                                                                                                                "replies": [
                                                                                                                                                                                    {
                                                                                                                                                                                        "user_name": "jonathanpi",
                                                                                                                                                                                        "time": "1 July, 2021",
                                                                                                                                                                                        "context": "*yawn*\n\nSo, you are finally at the point of attacking written grammar when we are conversing in a manner similar to spoken word and dismissing my opinion with an argument from authority?  Next come the character attacks.  Wake me up when you actually have something meaningful to add to the conversation.  We have gotten well off topic at this point.",
                                                                                                                                                                                        "good": "0",
                                                                                                                                                                                        "bad": "0",
                                                                                                                                                                                        "replies": [
                                                                                                                                                                                            {
                                                                                                                                                                                                "user_name": "lycopine",
                                                                                                                                                                                                "time": "1 July, 2021",
                                                                                                                                                                                                "context": "Yawn***\nYOU were the one that attacked my reading comprehension skills, I, in turn, showed your writing skills need work.\nNow on topic, my last post clearly showed you know NOT of what you write, saying DNA is a protein when it is not.",
                                                                                                                                                                                                "good": "0",
                                                                                                                                                                                                "bad": "0",
                                                                                                                                                                                                "replies": [
                                                                                                                                                                                                    {
                                                                                                                                                                                                        "user_name": "jonathanpi",
                                                                                                                                                                                                        "time": "1 July, 2021",
                                                                                                                                                                                                        "context": "I will concede that I misspoke about DNA being a protein.  That sort of thing happens, as we are all human and communication is not perfect.  What is not acceptable is you assuming I am ignorant of what I speak of because of a simple incorrect statement.  You are obviously not willing to be a honest opponent in this discussion if you want to engage in those tactics.",
                                                                                                                                                                                                        "good": "0",
                                                                                                                                                                                                        "bad": "0",
                                                                                                                                                                                                        "replies": [
                                                                                                                                                                                                            {
                                                                                                                                                                                                                "user_name": "lycopine",
                                                                                                                                                                                                                "time": "2 July, 2021",
                                                                                                                                                                                                                "context": "So your excuse for calling DNA a protein is \"it happens all the time, we are human\", huh?\nYou ask so many questions about DNA, make statements about it in numerous posts, and you make such a glaring error?\nSorry, I don't buy that excuse. I think you did indeed believe DNA is a protein until I called you on it.",
                                                                                                                                                                                                                "good": "0",
                                                                                                                                                                                                                "bad": "0",
                                                                                                                                                                                                                "replies": []
                                                                                                                                                                                                            }
                                                                                                                                                                                                        ]
                                                                                                                                                                                                    }
                                                                                                                                                                                                ]
                                                                                                                                                                                            }
                                                                                                                                                                                        ]
                                                                                                                                                                                    }
                                                                                                                                                                                ]
                                                                                                                                                                            }
                                                                                                                                                                        ]
                                                                                                                                                                    }
                                                                                                                                                                ]
                                                                                                                                                            }
                                                                                                                                                        ]
                                                                                                                                                    }
                                                                                                                                                ]
                                                                                                                                            }
                                                                                                                                        ]
                                                                                                                                    }
                                                                                                                                ]
                                                                                                                            }
                                                                                                                        ]
                                                                                                                    }
                                                                                                                ]
                                                                                                            }
                                                                                                        ]
                                                                                                    }
                                                                                                ]
                                                                                            }
                                                                                        ]
                                                                                    }
                                                                                ]
                                                                            },
                                                                            {
                                                                                "user_name": "quietsmith",
                                                                                "time": "30 June, 2021",
                                                                                "context": "Well first of all let's back up a step.\n\nDo you acknowledge nobody said \"it's all random\" or it \"emerges from randomness\"?\n\nRetract that and admit nobody has made that argument and that you were wrong for suggesting anyone did make that argument and we can proceed to your next step :D\n\nYour next step will be learning what actually is and is not \"information\". It's \"information\" only when we look at it and transfer it into a method that makes sense in our brain. DNA is no more \"information\" than any other series of molecules is. \n\nIn no way shape or form is it \"information\" like an intelligence would create. An intelligence that by the way you seem to think filled DNA with a lot of mistakes and a flawed copying mechanism.",
                                                                                "good": "1",
                                                                                "bad": "0",
                                                                                "replies": []
                                                                            }
                                                                        ]
                                                                    }
                                                                ]
                                                            }
                                                        ]
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            },
                            {
                                "user_name": "lycopine",
                                "time": "29 June, 2021",
                                "context": "that's what the tiny and feeble brains of religious fanatics believe, the rest of us know better...",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            },
                            {
                                "user_name": "quietsmith",
                                "time": "30 June, 2021",
                                "context": "Gotten around to reading the article and references on abiogenesis yet failure?",
                                "good": "1",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "jonathanpi",
                "time": "29 June, 2021",
                "context": "Sure, there might be.  Until we can figure out exactly how life sprung up in the first place, we might have a shot at figuring out how it can do it elsewhere.  Until then, we've got nothing but fantasy.",
                "good": "1",
                "bad": "2",
                "replies": [
                    {
                        "user_name": "ArneSaknussem",
                        "time": "29 June, 2021",
                        "context": "We're getting close on the origins of life, so it is more than just fantasy.",
                        "good": "8",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "jonathanpi",
                                "time": "29 June, 2021",
                                "context": "How does one measure how 'close' we are until we are actually there?",
                                "good": "0",
                                "bad": "2",
                                "replies": [
                                    {
                                        "user_name": "rubiks6",
                                        "time": "29 June, 2021",
                                        "context": "“How does one …?”\n\nHe fed you a meaningless statement.",
                                        "good": "0",
                                        "bad": "4",
                                        "replies": [
                                            {
                                                "user_name": "jonathanpi",
                                                "time": "29 June, 2021",
                                                "context": "I am aware of that.  I was challenging the meaningless statement so that he'd have an opportunity to actually think about his response and see it for the meaningless statement it was.",
                                                "good": "1",
                                                "bad": "4",
                                                "replies": [
                                                    {
                                                        "user_name": "ArneSaknussem",
                                                        "time": "30 June, 2021",
                                                        "context": "And I just answered it with multidisciplinary science.",
                                                        "good": "3",
                                                        "bad": "0",
                                                        "replies": [
                                                            {
                                                                "user_name": "jonathanpi",
                                                                "time": "30 June, 2021",
                                                                "context": "No, you did not answer the question.  You talked a lot around the question but failed to answer how you measure 'how close we are'.  We don't know the end point until we get there.  Claiming we are close means nothing without knowledge of the final destination.\n\nEither way, the more we learn about DNA, the more we cannot ignore that what it is could not have arrived by chance.  Neither the initial formation of the first self-replicating molecule of protein, or the nearly infinite complex lattice work of basic DNA.",
                                                                "good": "0",
                                                                "bad": "0",
                                                                "replies": []
                                                            }
                                                        ]
                                                    }
                                                ]
                                            },
                                            {
                                                "user_name": "ArneSaknussem",
                                                "time": "30 June, 2021",
                                                "context": "I never write meaningless statements. That is your arena. See my answers to PI.",
                                                "good": "2",
                                                "bad": "0",
                                                "replies": [
                                                    {
                                                        "user_name": "rubiks6",
                                                        "time": "30 June, 2021",
                                                        "context": "Your words >> _\"We're getting close on the origins of life ...\"_\n\nThat is a meaningless statement. What does \"close\" mean? It is a filler word for an unspecified amount. It's fluff.\n\nYes, you sometimes write meaningless statements.",
                                                        "good": "0",
                                                        "bad": "1",
                                                        "replies": []
                                                    }
                                                ]
                                            }
                                        ]
                                    },
                                    {
                                        "user_name": "ArneSaknussem",
                                        "time": "30 June, 2021",
                                        "context": "Well, we know a lot more than we did 10 years ago. And 10 years ago we knew a lot more than we did 10 years before that. We have all the building blocks of life on Earth known to exist naturally. That has been known for decades. Now we have RNA world as a proven viable concept, We have complexity theory demonstrating that not only can life arise, but that it probably did so more than once. We have geochemical data from Earth's earliest rocks, pinpointing the origin of life even before we have fossilized cells of prokaryotes.\n\nI'd say that gets us quite close the answer to the most vexing question of all of science.",
                                        "good": "3",
                                        "bad": "0",
                                        "replies": [
                                            {
                                                "user_name": "rubiks6",
                                                "time": "30 June, 2021",
                                                "context": "What we know a lot more of is how little we know. What we understand more clearly is how insurmountable the problem of spontaneous generation really is.\n\nWhile other scientific fields of study are moving forward by leaps and bounds, researchers are no closer to understanding abiogenesis than were Miller and urey. We only discover more and more how difficult spontaneous generation is.\n\nLook up \"Cell Theory\" in Wikipedia, see what tenet 3 is.\n--------------------------------------------\n\nMy questions:\n\n1) What are the building blocks of life? (Should be an easy question, if we're \"so close.\")\n\n(Don't even bother with question 2 if you can't answer question 1.)\n2) What does it mean \"RNA world is a proven viable concept\"? Has any RNA based been discovered or made? Any whatsoever? (Don't try to snowball me. RNA world has exactly the same issues as DNA world, in fact more. RNA world is dead.)\n\n3) How does complexity theory demonstrate that life can arise? Has life ever been demonstrated to \"arise\"?\n\n4) (Here's the doozy) Where did life begin?\n---------------------------------------------\n\nYou've got a lot of smoke and mirrors. You've got a deed to ocean front property in Nevada and a big promise. Just because you were foolish enough to buy it does not mean I'm going to take it off your hands. I'm not buying it.\n\nListen – I'm not attacking you. I'm attacking the origin-of-life researchers that have sold you and everyone else their garbage. Look more carefully into these things.",
                                                "good": "0",
                                                "bad": "1",
                                                "replies": [
                                                    {
                                                        "user_name": "quietsmith",
                                                        "time": "30 June, 2021",
                                                        "context": "Quit pretending cell theory supports your nonsensical creationist babble :D \n\nAlso since you never read the article on abiogenesis, or the references for it, you can quit blabbling about Wikipedia.",
                                                        "good": "2",
                                                        "bad": "0",
                                                        "replies": []
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            },
                            {
                                "user_name": "rubiks6",
                                "time": "29 June, 2021",
                                "context": "No we’re not. Every tiny discovery shines light more clearly on how truly clueless we are. Stop fooling yourself.",
                                "good": "0",
                                "bad": "5",
                                "replies": [
                                    {
                                        "user_name": "themythbuster909",
                                        "time": "30 June, 2021",
                                        "context": "Stop projecting your own ignorance on others. We have lots of evidence that life originated by molecular natural selection. We don't have a comprehensive theory for the origin of life. We don't have enough evidence yet to say for sure how life originated, but we have lot more evidence than people like you think we have. Stop being willfully ignorant.",
                                        "good": "2",
                                        "bad": "0",
                                        "replies": []
                                    },
                                    {
                                        "user_name": "quietsmith",
                                        "time": "30 June, 2021",
                                        "context": "Well, as true as it may be that we keep finding more questions the more we look.\n\nAt least we accept the explanations for the questions we have some answers for and don't just scream \"everything in a conspiracy against Jesus!\"",
                                        "good": "1",
                                        "bad": "0",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "user_name": "rubiks6",
                        "time": "29 June, 2021",
                        "context": "Life “sprung up” when a being with sufficient power and wisdom chose to create life. Surely life must have a sufficient cause to exist.",
                        "good": "2",
                        "bad": "4",
                        "replies": [
                            {
                                "user_name": "lycopine",
                                "time": "29 June, 2021",
                                "context": "says you with ZERO proof, evidence or data...",
                                "good": "3",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "rubiks6",
                                        "time": "29 June, 2021",
                                        "context": "Wow. Impressive retort!\n\nOr maybe not.",
                                        "good": "0",
                                        "bad": "3",
                                        "replies": [
                                            {
                                                "user_name": "lycopine",
                                                "time": "30 June, 2021",
                                                "context": "WOW!!! such an impressive explanation for life -- a designer created it in your imagination. ZERO proof, ZERO evidence, ZERO data. A great fabrication...",
                                                "good": "1",
                                                "bad": "0",
                                                "replies": [
                                                    {
                                                        "user_name": "rubiks6",
                                                        "time": "30 June, 2021",
                                                        "context": "_\"... an impressive explanation for life ...\"? What have you got to offer? Hmmm ...? Anything?",
                                                        "good": "0",
                                                        "bad": "0",
                                                        "replies": []
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            },
                            {
                                "user_name": "jonathanpi",
                                "time": "29 June, 2021",
                                "context": "As likely as an explanation as any other.  Either explanation currently requires forces or events outside of current scientific explanation, so I suppose miracles are on the table too (and no, I don't mean in just the religious sense).",
                                "good": "1",
                                "bad": "3",
                                "replies": []
                            },
                            {
                                "user_name": "quietsmith",
                                "time": "30 June, 2021",
                                "context": "\"I don't know therefore god\" still doesn't work for you.",
                                "good": "1",
                                "bad": "1",
                                "replies": []
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "why101",
        "time": "29 June, 2021",
        "context": "If life could survive the radiation Jupiter emits, then gas giants may be the source of biological life on earth.  Also it would indicate that biological life is ubiquitous through-out the universe, as gas giants appear common in other solar systems.",
        "good": "9",
        "bad": "1",
        "replies": [
            {
                "user_name": "rubiks6",
                "time": "29 June, 2021",
                "context": "Electromagnetic radiation is far different than nuclear radiation.\n\nAs for life, Earth is still the only place you'll find it.",
                "good": "2",
                "bad": "8",
                "replies": [
                    {
                        "user_name": "beadgBass",
                        "time": "29 June, 2021",
                        "context": "You sound awfully sure of yourself. How will you react when you are proven wrong?\nWill you be depressed or will you look at the universe with renewed wonderment?",
                        "good": "11",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "rubiks6",
                                "time": "29 June, 2021",
                                "context": "Why should I waste my time considering your counterfactual question? It’s good for a science fiction plot — nothing more. \n\nI like Star Trek. I’ve read all of Isaac Asimov’s fiction. Bicentennial Man is my all time favorite movie. It has no space ships or aliens at all. \n\nIf you believe in space ships and aliens you’re a fruitcake.",
                                "good": "0",
                                "bad": "9",
                                "replies": [
                                    {
                                        "user_name": "lycopine",
                                        "time": "29 June, 2021",
                                        "context": "space aliens? Like gods? So you just admitted you're a fruitcake!!\n\nLOLOL",
                                        "good": "7",
                                        "bad": "0",
                                        "replies": []
                                    },
                                    {
                                        "user_name": "beadgBass",
                                        "time": "29 June, 2021",
                                        "context": "Space ships and aliens? Where did I say that?\nI guess technically even microbial life on another planet would be 'alien' but I doubt that you thought it through that far.",
                                        "good": "9",
                                        "bad": "0",
                                        "replies": [
                                            {
                                                "user_name": "rubiks6",
                                                "time": "29 June, 2021",
                                                "context": "As I just told someone else — \n\nSorry, but explorers will not be providing support for abiogenesis because it doesn’t happen. Life only comes from life.",
                                                "good": "0",
                                                "bad": "11",
                                                "replies": [
                                                    {
                                                        "user_name": "ArneSaknussem",
                                                        "time": "29 June, 2021",
                                                        "context": "\"Life only comes from life.\"\nThat is a mere speculation on your part that has no basis in science or logic.",
                                                        "good": "9",
                                                        "bad": "0",
                                                        "replies": []
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "user_name": "quietsmith",
                        "time": "30 June, 2021",
                        "context": "Got any evidence for that failure? Other than 'science is a conspiracy'?",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "sciencerocks",
        "time": "29 June, 2021",
        "context": "\"Where there is water there is life.\" That aphorism certainly fits here on Earth, but it doesn't necessarily apply to life elsewhere. Exobiologists need to open up their playbooks to the possibility of life without water, as certainly evolution took a very different course on other planets.",
        "good": "16",
        "bad": "1",
        "replies": [
            {
                "user_name": "rubiks6",
                "time": "29 June, 2021",
                "context": "You need to open up a first year chemistry book. And you're a college professor in a scientific field? wow.",
                "good": "0",
                "bad": "11",
                "replies": [
                    {
                        "user_name": "ArneSaknussem",
                        "time": "29 June, 2021",
                        "context": "And he's a darn good professor, from what I've read of his work.  He is much smarter than you and can think outside the box. He is absolutely correct that life could evolve without water. There are SO many possibilities.",
                        "good": "11",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "rubiks6",
                                "time": "2 July, 2021",
                                "context": "If he understood basic chemistry, he would know the complexities of biological chemistry demand a solvent which only water has the right properties. \n\nBesides — after H², H²O is the most abundant compound in the universe. Why would you even waste your thought energy thinking about life without water. That’s just silly. It’s not hard to find water. It IS hard to find life. \n\nLife only comes from life.",
                                "good": "0",
                                "bad": "3",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "user_name": "lycopine",
                        "time": "29 June, 2021",
                        "context": "you need to close the bible and understand it's not a science textbook, just historical fiction -- at best...",
                        "good": "3",
                        "bad": "1",
                        "replies": []
                    },
                    {
                        "user_name": "quietsmith",
                        "time": "30 June, 2021",
                        "context": "Quit pretending you know the first thing about science when you reject all of it and think it's a conspiracy :D",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "rubiks6",
                "time": "3 July, 2021",
                "context": "You are poison to the church of Jesus Christ. You reject the Word of God and that makes you poison. You sicken everyone you touch and those who are weak, you kill completely. How many young people who grew up in the church, went off to college, entered your classroom, learned the human origins you teach, and received from you the idea that the Bible is not true from page 1, and walked away from Jesus Christ, never to be seen again? You turn weak Christians into nominal Christians if not non-Christians. You present gifts to Satan everyday. You, yourself are a Christian in name only. You play the part but you don't believe in the Jesus Christ of the Bible. You've made up you own Jesus Christ – one that would let you keep your academic career and your reputation for you value the praise of men more than you value the praise of God.\n\nSince you have declared Jesus Christ to be a liar before men, he will declare you to be a liar before the Father and you shall receive the payment that is due to liars.\n\n_\"... for they loved the glory that comes from man more than the glory that comes from God.\"_\n– John 12.43 (ESV) (Read it in context starting at verse 36.)\n\nI don't actually expect that verse to have any impact on you, for I know you reject the Word of God and twist it to your own desired meaning.",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "rubiks6",
                "time": "3 July, 2021",
                "context": "When you change the beginning of the story, you also change the end of the story.",
                "good": "0",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "beenherebefore348",
        "time": "28 June, 2021",
        "context": "Send any or all Democrats to check it out.",
        "good": "1",
        "bad": "11",
        "replies": []
    },
    {
        "user_name": "ronswansonrules",
        "time": "30 June, 2021",
        "context": "While the search for extraterrestrial life is fascinating, it seems to be the only time astronomy makes the news.   There are so many mind-blowing phenomena in the universe that do not involve finding life such as the volcanoes on Io, the hydrocarbon lakes on Titan, and the cryovolcanoes on Triton. A greater focus should be put on finding intelligent life on Earth.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "OliveGoggles",
        "time": "3 July, 2021",
        "context": "I tried using my telescope to look at jupiter once but kept seeing Uranus 🔭",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "error": "error"
            }
        ]
    },
    {
        "user_name": "rubiks6",
        "time": "2 July, 2021",
        "context": "Oh you poor, sad affeists. Trying so desperately to find life somewhere looking for support for your silly spontaneous generation idea. \n\nLook here — life only comes from life. The first biological life was created by God here on planet Earth to be part of a rich environment for Mankind who is the focal creature on this planet. God Himself became a man. That’s how important Mankind is to God’s narrative. \n\nThere is no biological life on Mars, on Venus, on the moons of Jupiter or Saturn, or around distant stars. It’s only here, on this Earth — nowhere else. Get over it, affeists. Your god is dead. “Time” has no ideas. Material has no wisdom. And the universe has no intentionality. The true, living God is a person with these attributes — wisdom, power, desire. It is He that created life and this Earth is where He put it. \n\nOpen your eyes, affeists. Your looking for your glasses and they’re right on your head. When you meet God, you will see Him clearly.",
        "good": "0",
        "bad": "1",
        "replies": [
            {
                "user_name": "lycopine",
                "time": "2 July, 2021",
                "context": "OOOOO, the arrogant, self-righteous truth claimer raises his ignorance yet again.\nOOOOO, it's toooooooo complex to happen, therefore my imagined god did it.\nOpen your brain to accept the FACT that gods exist ONLY in your imagination, no where else.\nMaybe you can get treatment for those decades of religious brainwashing and coercion, fear of burning and being careful every moment not to commit a \"sin\" because you'll BURN for eternity. Since my god declared it and it's written in the bible so it must be TRUE!!!! OOOOO, we're sooooooo scared of burning for eternity in an afterlife we must obey.\n\nHow's it feel to live in constant fear and subject your 5 children to it? And it's a good thing you didn't adopt any more as they are spared from your fearful coercion....",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "rubiks6",
                        "time": "3 July, 2021",
                        "context": "I'm not self-righteous. I exchanged my unrighteousness for the righteousness of Jesus Christ. I am declared righteous because righteous Jesus Christ paid for my sins on the cross. Now I have obtained eternal life because I have Christ's righteousness.\n\nSir – I have no fear. Jesus Christ died for my sins. I have eternal life. Eternal life is eternal.\n\n_\"For I am persuaded that neither death nor life, nor angels nor principalities nor powers, nor things present nor things to come, nor height nor depth, nor any other created thing, shall be able to separate us [the servants of Jesus Christ] from the love of God which is in Christ Jesus our Lord.\"_\n– Romans 8:38-39 (NKJV)\n\nWhat's pathetic is that you choose to remain a slave to sin. Jesus Christ has paid the price to buy you out of your slavery. He is a better master, I assure you.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "lycopine",
                                "time": "3 July, 2021",
                                "context": "You are a self righteous arrogant religious truth claimer with ZERO evidence of your righteousness or truth or that of your imaginary god. You believe in all that nonsense since you to were coerced to believe it as religious followers do. You didn't trade in anything, you just believe you did and believe there's some kind of eternal afterlife and need reassurance you won't be burning in it.., My oh my, quite ridiculous delusions you have...\n\nAnd what's really pathetic is you attempt to coerce anyone else who doesn't believe your delusions with your false and fearful biblical nonsense. But since you are comfortable with your delusions, I assure you I won't tattle to your god all of your sins.\n\nOh, and your NKJV is a translated copy of a translated copy of a translated copy of supposedly the original Dead Sea scrolls. And we all know how much gets lost in translation...\n\nLOLOL",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "omegadog",
                "time": "4 July, 2021",
                "context": "As a man of faith, I have to total disagree with you about earth having the only life.  Nowhere in the bible does it say we are the only life God created.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "rubiks6",
                        "time": "5 July, 2021",
                        "context": "There are angels, too, but I don't know much about them. I've read about them and I've heard them talked about in sermons. I am surprised to learn there is much more information about angels in the Bible than I realized but I have not given them a great deal of attention.\n\nAs for corporeal life, God told us specifically what the celestial bodies are for and it was not for life. Plants were created on the third day, before the Sun, Moon, and stars even existed. \n\nGod can do what He wants and He doesn't have to tell us everything He does but scripture seems to imply that life is in Heaven, where God lives, and on Earth, where Man lives, and the Bible doesn't even hint that life might be anywhere else.\n\nHowever, your last sentence is not false (not considering life in God's Heaven).",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "omegadog",
        "time": "4 July, 2021",
        "context": "Science is too focused on looking for life as it is on earth.  I am betting the first life we discover on another planet or in space, will not be like anything we expect it to be.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dan5047628",
        "time": "30 June, 2021",
        "context": "Can't wait until they run out of planets and moons to search for life on. Then we can spend NASA's budget on something worth while.",
        "good": "1",
        "bad": "1",
        "replies": [
            {
                "user_name": "lordzeon",
                "time": "1 July, 2021",
                "context": "Like the never ending welfare.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    }
]