[
    {
        "user_name": "Command_Shift_Right",
        "time": "29 August, 2022",
        "context": "NASA= Government money bleed compared to Elon and the private sector. SpaceX could have accomplished artemis missions years ago had they been tasked... And they wouldn't have been boasting about the color and flavor of the people to be launched.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "muckraker0011",
        "time": "28 August, 2022",
        "context": "Absolutely pathetic. After 51 years, NASA will shoot a rocket around the moon without a human. Then they will send another one with a robot on board. \nWHAT ! Why all this non-human drama when we SUPPOSEDLY have already landed numerous missions and humans on the moon. \nIn 1969 NASA supposedly sent men to the moon with less technology than what is in the cell phone. In 51years we have developed technology thousands of times more powerful and accurate since then but NASA is having to go through all these tests, and billions of $, to make sure it is safe. I just read where they are concerned about the heat shield on the capsule on re-entry. WHAT!  After dozens of re-entries, not just space capsules, but also the space shuttle. And, they are worried about this. \nAnswer:  Because no humans have ever been to the moon",
        "good": "0",
        "bad": "5",
        "replies": [
            {
                "user_name": "chinatopcat",
                "time": "29 August, 2022",
                "context": "Accidents happen. Supposedly landed on the moon? ",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "letsgetrel",
                "time": "29 August, 2022",
                "context": "Laughably incorrect, you are.",
                "good": "4",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "thelip95032",
        "time": "28 August, 2022",
        "context": "Why are we spending money to do this, we already went to the Moon.",
        "good": "3",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "presidentdiaperfacepoopypants",
        "time": "29 August, 2022",
        "context": "Just go to Arizona, it's closer and about the same.",
        "good": "0",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "action_jackson",
        "time": "30 August, 2022",
        "context": "I like to post and read posts in the science section to get away from all the right wingers.",
        "good": "1",
        "bad": "1",
        "replies": [
            {
                "user_name": "endymio",
                "time": "30 August, 2022",
                "context": "Science like ... a man can change into a woman simply by closing his eyes and wishing hard?",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "carter505",
        "time": "29 August, 2022",
        "context": "South Pole puts us closer to the communist rovers on the dark side. Imagine their confusion if we quietly sent over one of our rovers to their camp sight on the dark side when everything’s recharging. That’s just mean. We could probably still do it but we’ll say it was the Brits. “Roger waters of Pink Floyd asked if we could deliver this copyright infringement cease and desist letter. We’re going to investigate but for now, you guys gotta clear clear out? \n\nWuhan said that?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "chinatopcat",
        "time": "29 August, 2022",
        "context": "Claim the moon as sovereign UNITED STATES TERRITORY, as should have been done as soon as Armstrong planted the Flag.",
        "good": "0",
        "bad": "4",
        "replies": [
            {
                "user_name": "slacktoad",
                "time": "29 August, 2022",
                "context": "We signed a treaty in 1967 expressly prohibiting any nation claiming the Moon as their own, as did every other developed nation.  In 1967 the Soviets were still ahead of use in most space milestones so there was a good chance they could have gotten there first and claimed it themselves.",
                "good": "2",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "chinatopcat",
                        "time": "29 August, 2022",
                        "context": "So….a treaty will prevent a bad actor of today from claiming it? I don’t think so…..",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "slacktoad",
                                "time": "29 August, 2022",
                                "context": "Anyone can say they claim anything, China could claim Alaska as theirs.  It's just a word, and that word has no power unless they have the military might and motivation to occupy and protect that claim.  \n\nIf we claimed the Moon in 1969 it would have done little to stop  Russia from going there, and likewise if they claimed it first.  But having a treaty on your side might have affected whether it resulted in war or not.\n\nWe are a nation of laws, and international treaties are part of our laws.  So us claiming the Moon would have been a violation of the law in 1969, and still is, so we won't do it.",
                                "good": "0",
                                "bad": "1",
                                "replies": [
                                    {
                                        "user_name": "endymio",
                                        "time": "30 August, 2022",
                                        "context": "Oops, the treaty to which you refer wasn't even written until the late 1970s ... and was never ratified anyway.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": [
                                            {
                                                "user_name": "slacktoad",
                                                "time": "30 August, 2022",
                                                "context": "I'm referring to the Outer Space Treaty of 1967, which was signed and ratified by both the U.S. and Soviet Union in 1967 and acceded by China in 1984.  Look it up.",
                                                "good": "0",
                                                "bad": "0",
                                                "replies": []
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "user_name": "dan5047628",
                        "time": "29 August, 2022",
                        "context": "And you think Biden will honor it.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "slacktoad",
                                "time": "29 August, 2022",
                                "context": "Firstly, although NASA says they want to land people on the Moon by 2025, space industry watchers think that’s virtually impossible; they haven’t even designed a lander yet. Most think 2028 Is more likely, but even that’s optimistic given congress’s lack of funding support. So it’s unlikely Biden, or even Trump, will be making that decision. \n\nAnd while it is possible for a nation to withdraw from the 1967 Outer Space Treaty, given one year’s notice, even if we did that it would not really be enforceable in international law to claim the whole Moon. There is no precedent for that in history, even in the golden age of exploration nations like Spain, Portugal and Britain were unable to claim the entirety of the Americas. The most you could get away with is to claim an area of the Moon you are prepared to settle in and protect. Nobody would accept a blanket “no trespassing” sign on the Moon, especially China or Russia.",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "user_name": "endymio",
                        "time": "30 August, 2022",
                        "context": "Wrong.  Neither the US, nor Russia, nor China ratified that treaty.   It's essentially meaningless.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "slacktoad",
                                "time": "30 August, 2022",
                                "context": "Wrong.  The Outer Space Treaty of 1967 was signed and ratified by the Soviet Union and the U.S. in 1967, and acceded  (joined after coming into force) by China in 1984.  It's binding international law and is the cornerstone of all space law.",
                                "good": "0",
                                "bad": "1",
                                "replies": [
                                    {
                                        "user_name": "endymio",
                                        "time": "30 August, 2022",
                                        "context": "My apologies; I didn't believe that earlier treaty barred claims of sovereignty, but apparently it does.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "sciencerocks",
        "time": "28 August, 2022",
        "context": "This is exciting. The James Webb Space Telescope, and our Mars missions are probably scientifically more import. This site had a banner for this mission exclaiming \"Return to Space!\"\nThat is rather insulting to NASA which has been very active in space, including astronaut-scientists on the ISS.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "longlivelee620",
        "time": "28 August, 2022",
        "context": "I sincerely hope we do; we desperately need something to be proud of as a nation.  A national effort to return to the moon may be something we can rally around.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "letsgetrel",
                "time": "29 August, 2022",
                "context": "My friends and colleagues rallied around the amazing Mars missions. We marvel at the continuous experiments on the ISS. And who could not be proud of the Webb space telescope and the important new things we are already learning about our universe, along with spectacular images that put us in our place on Earth, the only planet we have for now.\n\nIf Americans were more interested in science, then we could all be proud of the magnificent achievements of NASA and their partners. A chest-thumping return of humans to the moon is of much less importance.",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "thetattler",
        "time": "29 August, 2022",
        "context": "I hope it makes it, otherwise it will end up being a big Artemis Pyle....Badump bump.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "oldching",
        "time": "30 August, 2022",
        "context": "Typical NASA under Biden administration:  Joe has a leaky diaper, NASA has a leaky SLS.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "fakeitgoodnasa",
        "time": "30 August, 2022",
        "context": "“The moon is essentially gray.. no color.. looks like plaster of Paris..”\nJim Lovell",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "*1*",
        "time": "30 August, 2022",
        "context": "Elon will beat NASA and eventually do it himself with STARSHIP.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "fakeitgoodnasa",
        "time": "30 August, 2022",
        "context": "Will NASA use plaster of Paris moon models like they did back with Apollo for their ‘lunar orbit’ shots ?",
        "good": "0",
        "bad": "0",
        "replies": []
    }
]