[
    {
        "error": "error"
    },
    {
        "user_name": "Miles_Footpounds",
        "time": "8 January, 2020",
        "context": "\"a Predator drone, is said to have an operating range of up to 2,000 km (1,243 miles)\" Gotta make sure to include those miles in parenthesis for the recalcitrant Americans only!",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "daisytherabbit",
        "time": "8 January, 2020",
        "context": "Well given that their missiles have a 25% fail rate if the sample yesterday was any indication, who cares how many drones they have. Half of them will fall from the sky.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "broncodano",
        "time": "8 January, 2020",
        "context": "well arent Tomahawk cruise missiles drones too?\n\ntechnically speaking of course...",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Italian1219",
        "time": "8 January, 2020",
        "context": "why do these people always try to build up Iran. our military and intel know EXACTLY what Iran has , where they got it and how the Paid for it (OBAMA)",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "LogCabinRepub72",
        "time": "8 January, 2020",
        "context": "Look Ma.. Target practice!",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "botfencepost",
        "time": "8 January, 2020",
        "context": "And don't underestimate the power of the United States of America.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "pammar",
        "time": "8 January, 2020",
        "context": "They can't launch them if they're deceased.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "hcarian",
        "time": "8 January, 2020",
        "context": "For every drone attack, we take out an airfield. Very quickly they'll need to rename their \"Air Force\" to \"Drone Force\".",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "theloon809",
        "time": "8 January, 2020",
        "context": "You certainly have that right!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "OCfreeguy",
        "time": "8 January, 2020",
        "context": "Drones need to be guided. Take out their controllers and they are less effective. Unless they are missiles.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "No1fromnowhere",
        "time": "8 January, 2020",
        "context": "Let's not forget the super-secret stealth drone Obama let them have.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "FJTraveler",
        "time": "8 January, 2020",
        "context": "The \"powerful\" Iranian army reminds me of Sadaam's terrifying Republican Guard. They quickly changed their rally cry from \"DEATH TO AMERICA\" to \"GEORGE BUSH! GEORGE BUSH! GEORGE BUSH!\" as they surrendered in droves.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "PREZ.45",
        "time": "8 January, 2020",
        "context": "They have our technology.\nObama gave them a beautiful sample to copy.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "TriggeredLemmings",
        "time": "8 January, 2020",
        "context": "I don't think anyone is going to underestimate Iran's drones, but they're no match for the technology that the USA has in the air.  It would be fun using them for target practice.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "RobertinTampa",
        "time": "8 January, 2020",
        "context": "sanction them park the 7th fleet to stop any aid...wait for the civil war to happen",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Tommy2112",
        "time": "8 January, 2020",
        "context": "I wonder if they are as accurate and reliable as the 1/3 of the missiles they sent that failed to explode or reach their targets?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "josephus",
        "time": "8 January, 2020",
        "context": "It kind of reminds me of the Mig-25 era. To quote Wikipedia - \"The appearance of the MiG-25 sparked serious concern in the West and prompted dramatic increases in performance for the McDonnell Douglas F-15 Eagle then under development in the late 1960s. The capabilities of the MiG-25 were better understood in 1976 when Soviet pilot Viktor Belenko defected in a MiG-25 to the United States via Japan. It turned out that the aircraft's weight necessitated its large wings.\"\n\nNotice that their drone looks like a copy of one of ours. We don't know what's inside or what the avionics are. We can be like this author and work ourselves into a lather or look at it this way: they have so many because they don't work so well.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "EricPedersen1001",
        "time": "8 January, 2020",
        "context": "It's a blow up doll",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "snake82118",
        "time": "8 January, 2020",
        "context": "And if Iran uses a swarm of drones they risk everything they own being blown off the face of the Earth.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "hcarian",
        "time": "8 January, 2020",
        "context": "Drone swarms for you apocalyptic folks out there:\n\nRev. 9:3 And out of the smoke locusts came down on the earth and were given power like that of scorpions of the earth.\nRev. 9:7 The locusts looked like horses prepared for battle. On their heads they wore something like crowns of gold, and their faces resembled human faces.\nRev: 9:9 They had breastplates like breastplates of iron, and the sound of their wings was like the thundering of many horses and chariots rushing into battle. \nRev: 9:10 They had tails with stingers, like scorpions, and in their tails they had power to torment people for five months.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "wilycoyote",
        "time": "8 January, 2020",
        "context": "Iran still doesn't seem to understand America's ability to jam all signals and crash drones, etc. It could prove to be a fatal mistake",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tlang1",
        "time": "8 January, 2020",
        "context": "Paid for by the Obama regime to help his fellow mullahs.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rukdnme1946",
        "time": "8 January, 2020",
        "context": "OK, so their drones against Our Tomahawks...Any Bets.!!...",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Kamala'sPimp",
        "time": "8 January, 2020",
        "context": "Paid for by the US Taxpayer, thanks Obama.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "someguy1234",
        "time": "8 January, 2020",
        "context": "Iranian drones are not a problem.\n\nAmerica's problem are the Democrats' drones the Liberals who like drones love to be told what to think and do by their Dim leaders and mainstream media.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mojavejim56",
        "time": "8 January, 2020",
        "context": "Remember how scary the Red Republican Gaurd was supposed to be?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "OrangeCone",
        "time": "8 January, 2020",
        "context": "Hello. EA-18G Growler? You got this? Ok. Cool. Happy hunting.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "itdoesnotmatternonya",
        "time": "8 January, 2020",
        "context": "Obama depleted our military only to turn around and arm his brothers in the Middle East. In the dictionary, treason has no verbiage accompanying it, it only has a picture of Obama and HRC holding hands next to it.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "itdoesnotmatternonya",
        "time": "8 January, 2020",
        "context": "Another strike by them that results in another death of an American will result in their destruction and they know it. The might of America and the patriot that sits in the oval office should not be under estimated again.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "johne37179",
        "time": "8 January, 2020",
        "context": "Maybe we could send them some of our drones - like Pelosi, Nadler or Schiff.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "AlabamaKnight",
        "time": "8 January, 2020",
        "context": "Using them for decades? Hmmmm..lol..hmmm.. Well reports out of colorado and nebraska about drones with 6 ft wing span flying night details over the trucking corridor..unclaimed by any of our peeps..so get ready for red dawn..the FBI own reports states we have maaaany terrorists in 5000 armed camps in rural america..our traitors are trying to disarm us so we have no fighting chance? Im just wondering because we all seeing they are not hiding this is washington..already a civil war there..they just refuse to let our leader lead and they back terrorists and then call us names to our face, squelch our freedoms daily..destroy OUR culture..that of freedom. We need reports on flying objects over our homes the military not claiming..cant trust amazon not to be in bed with this new world order take over..i think much of the world really doesnt want it..just those who live in unfree countries..misery like company..good ones escape here..religious persecution..now we live in a world that wants to control everyones move..the legal ones..they letting bad guys go right infront of us..all those fbi agents n cia traitors need to be arrested and this take over of our country must be stopped..wake up..its just so sad how dumbed down ..half our country is now illiterate and we have worse health records then poor countries..now we let IRAN save face..please..lol..and then put out info they have drones to murder more people with..umm hope he doesnt use them..is everyone in kindergarten?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bradinriorancho226",
        "time": "8 January, 2020",
        "context": "Will the drones STOP incoming missiles ?   I know fighter jets and missiles will bring down drones!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "JLAinFranklinTn",
        "time": "8 January, 2020",
        "context": "One or two big ones could take all their toys out...",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "chile10001488",
        "time": "8 January, 2020",
        "context": "The problem with iran and it's store of drones is that all flight paths lead back to tehran...the same flight paths our missiles would take should they use their drones.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "wilycoyote",
        "time": "8 January, 2020",
        "context": "Smart drones from China are cheap, easily fitted with munitions, is it possible that Iran has thousands intended to be a swarm attack?",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "eda377",
        "time": "8 January, 2020",
        "context": "Irans stupidity should not be underestimated",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "wilycoyote",
        "time": "8 January, 2020",
        "context": "Obama believed that America should kneel, not flaunt it's strength. Sad times",
        "good": "14",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "wilycoyote",
        "time": "8 January, 2020",
        "context": "No doubt Iran was making holes in the desert, they know better than to directly kill us soldiers. That's why they use proxies",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "magabeliever",
        "time": "8 January, 2020",
        "context": "Stolen tech",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mackiethunder1",
        "time": "8 January, 2020",
        "context": "Thanks Obama for giving Iran drone technology.  He actually \"asked\" them to return it.  Sheesh!  It should have been blown up!\n\n\"On 5 December 2011, an American Lockheed Martin RQ-170 Sentinel unmanned aerial vehicle (UAV) was captured by Iranian forces near the city of Kashmar in northeastern Iran. The Iranian government announced that the UAV was brought down by its cyberwarfare unit which commandeered the aircraft and safely landed it, after initial reports from Western news sources disputed claimed that it had been \"shot down\". The United States government initially denied the claims but later President Obama acknowledged that the downed aircraft was a US drone. Iran filed a complaint to the UN over the airspace violation. Obama asked Iran to return the drone. Iran is said to have produced drones based on the captured RQ-170.\"",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "wilycoyote",
        "time": "8 January, 2020",
        "context": "Tech is increasing exponentially. Even I can download ai that talks and understands to control my house. Why couldn't the Iranians have smart drones?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "broken_sky",
        "time": "8 January, 2020",
        "context": "Without Ayatollah Obama Iran has no hope of being a significant world power.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "gregorybg",
        "time": "8 January, 2020",
        "context": "The associated press is the Devil's spokesman...always",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "INFIDEL50",
        "time": "8 January, 2020",
        "context": "In honor of the previous administration they named their drones MohamedObamas. They first thought since they are just mindless drones they were going to name them just plain Bidens.",
        "good": "22",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "avoidpartylines",
        "time": "8 January, 2020",
        "context": "So their drone program ramped up the year AFTER Obama released their funds. That has to just be a coincidence.....",
        "good": "22",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "Trumpsda’man2020",
        "time": "8 January, 2020",
        "context": "Drone superpower? Iran’s arsenal of unmanned aerial vehicles should not be underestimated, expert warns.....”\n\nOf course not. I doubt our military will not be underestimating ANYTHING those people are capable of. And they are capable of much I’m sure. But they best not be underestimating our President and our outstanding military or it will be at their peril. \n\noh & maybe bobo or one of his former team might want to warn Iran & anyone else who wants to kill our people that it will no longer be tolerated under this strong leadership.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "NFTG",
        "time": "8 January, 2020",
        "context": "We should never underestimate our enemies.  We should never bow to them, either.\n\nThe marsh-mullahs had to save face, so they launched an attack.  They are backwards, not stupid.  They missed on purpose because they knew POTUS would stomp a mudhole in their collective chests.\n\nWe killed SoLong,Mani.  He had it coming.\nIran responded.\nThis can be the end of it, if the Iranians keep being 'not stupid'.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "steeltele054",
        "time": "8 January, 2020",
        "context": "They have drones; we have Patriot and Iron Dome...And we can turn that pipsqueak satrapy into an uninhabitable radioactive desert in an afternoon's time. Much of the Nation says we should.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rational4real",
        "time": "8 January, 2020",
        "context": "Fearmongering...Iran only scares libs.",
        "good": "23",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "PurpleCloud",
        "time": "8 January, 2020",
        "context": "The name “Reaper” is cooler.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Antiracist471",
        "time": "8 January, 2020",
        "context": "it is actually over estimated",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "broken_sky",
        "time": "8 January, 2020",
        "context": "Iranina drone technology is 20 years behind US technology. The US will soon have a new drone paradigm. The MQ-series is being dropped. The MQ-10 (Predator C), Avenger will be the last of the Predator drones.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "happiestgolfer",
        "time": "8 January, 2020",
        "context": "I think Iran realizes that Trump is no Obama or Bush. He will retaliate like no other President in my lifetime.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "prudehomme",
        "time": "8 January, 2020",
        "context": "Why did not Obama make every one Love us?  If he were so successful we would not be having the problems we do now-",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Timeline1955",
        "time": "8 January, 2020",
        "context": "It’s rumored that one F35 or  F22 can fry the Eletronics of any drone on the battlefield today.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "wilycoyote",
        "time": "8 January, 2020",
        "context": "Simple thermite on a cheap drone could take out a tank. An RPG head( shaped charge) could take out armor. Not to mention chemical and biological",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "jbert2014",
        "time": "8 January, 2020",
        "context": "Same nonsense we were told about Iraq before we defeated them in the 100 hour war.",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "μολωνλαβε",
        "time": "8 January, 2020",
        "context": "Iran is still trying to rebuild and fly the F-4s it got from the US in the 1970s....  and failing.\n \nTheir drone technology can be lethal, but mostly to their own citizens.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Buzzymuzwelle",
        "time": "8 January, 2020",
        "context": "We can drop a missile in anybody's back pocket.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "isisinhouston",
        "time": "8 January, 2020",
        "context": "Be afraid. Filling you with fear is what the media does. Simple brainwashing 101.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "CyanBullhorn",
        "time": "8 January, 2020",
        "context": "Sure, they have 2 million drones. 1000000000 tanks, 200000 bombers and 5 million idiots.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rollxtidexroll",
        "time": "8 January, 2020",
        "context": "\"Drone superpower? America’s arsenal of unmanned aerial vehicles should not be underestimated, expert warns\"",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "MrSpockdoesntcare",
        "time": "8 January, 2020",
        "context": "This guy is full of it and is looking to get his name out.\nIrans drone system is not anywhere near sophisticated.",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Fresh-Air",
        "time": "8 January, 2020",
        "context": "kind of hard to fly a drone without RF.....or operators.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "g.herbert",
        "time": "8 January, 2020",
        "context": "How come they didn't use these last night?",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "diablosandwic_H",
        "time": "8 January, 2020",
        "context": "we kill the number two Iranian in exchange for 15 holes in the sand. \n\nThat ladies and gentlemen is the Art of the Deal",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tuxjr",
        "time": "8 January, 2020",
        "context": "Nobody questions Irans missile capabilities.  They are probably our missiles that Obumma smuggled into Iran.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Nyrepublucan",
        "time": "8 January, 2020",
        "context": "Yes...no it is doubtful they have a very good program or they would have boasted about it. It's in their nature.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "GoldPumpkin",
        "time": "8 January, 2020",
        "context": "looks like a pea pea",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "listener1717770",
        "time": "8 January, 2020",
        "context": ".... And then there are the missiles that failed for various reasons.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ChicagoBoss",
        "time": "8 January, 2020",
        "context": "Yes, Iran's painted rust has been blessed by allah the pagan god.",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "PurpleBike",
        "time": "8 January, 2020",
        "context": "Crap lets just surrender then and give them another 150 billion works for the left",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "KnowledgeisTruth",
        "time": "8 January, 2020",
        "context": "In addition to billions of dollars, obama gave iran drone technology.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Chronic-o-meter",
        "time": "8 January, 2020",
        "context": "They are remote controlled planes, and Iran does not have the same sophisticated satellite communications system that many other operators do.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "MrSpockdoesntcare",
        "time": "8 January, 2020",
        "context": "Yeah I think Bagdahdi and Soleimani don’t think US drones are all that!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "💣toxicfeminism💣",
        "time": "8 January, 2020",
        "context": "Bought and paid for by the Obama administration.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "nocreepyjoeorkameltoe",
        "time": "8 January, 2020",
        "context": "Trump should send Rosie O'Donnell to rumble through Iran with her blow hole spewing full blast.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "VotingforTrump2020👍👍",
        "time": "8 January, 2020",
        "context": "No we shouldn't underestimate Iran's arsenal because they had 150 billion to build with that Obama gave them!",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "waveslin",
        "time": "8 January, 2020",
        "context": "This expert must be a master at Lego block building.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Fly0ndeewall",
        "time": "8 January, 2020",
        "context": "Yeah, they pioneered their drone industry off the backs of our technology.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "abraham12",
        "time": "8 January, 2020",
        "context": "I don't think our military and intelligence services are \"underestimating\" Iran.  Their information is most likely more detailed than this guy.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Lover of America ❌",
        "time": "8 January, 2020",
        "context": "150 Billion given to them by Obama can buy a lot of state-of-the-art weapons. I wouldn't be surprised if they already have a nuke. Thanks Obama.",
        "good": "13",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "MrSpockdoesntcare",
        "time": "8 January, 2020",
        "context": "Soleimani was interviewed about his recent trip to Iraq.\n” He said it was a blast”",
        "good": "13",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sboroman",
        "time": "8 January, 2020",
        "context": "Divide the estimated number of missiles they have by 15 and that's how many senior officials we have to off for them to run out.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "key21",
        "time": "8 January, 2020",
        "context": "Iranians reverse engineered one of our drones brought down when Obama was in office.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "grobnik",
        "time": "8 January, 2020",
        "context": "yes, the dudes that spent years and years in a stalemate war with an Iraq military that the US went through and decimated in about 8 days....",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "burtb424",
        "time": "8 January, 2020",
        "context": "Well Obama did Just fly them our Most advanced drone and just gave it to them. Sure they copied much of it with help from China and Russia!",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "KeepCalm2020",
        "time": "8 January, 2020",
        "context": "O-Bomb-O's $150 billion gift buys a lotta drones LOL",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sprather881",
        "time": "8 January, 2020",
        "context": "Let's be completely honest.....should any nation be underestimated? Seems kinda idiotic to suggest. You can underestimate Iceland and have that be bad. Underestimating anyone would be a stupid idea with consequences at the national level and the personal level. Pretty stupid to suggest!",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mikeb270252",
        "time": "8 January, 2020",
        "context": "....and we can all thank Obama for Iran having that arsenal",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sboroman",
        "time": "8 January, 2020",
        "context": "Maybe we just fire our weapons from 2001 km off their shores.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "OliveBee",
        "time": "8 January, 2020",
        "context": "I heard these same rantings before we kicked Saddam Hussein's tail, twice.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "wheresmymule?",
        "time": "8 January, 2020",
        "context": "Hahahahahahahh, they sending drones to NYC???",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mig66851",
        "time": "8 January, 2020",
        "context": "Iranian propaganda",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "XbuckoX",
        "time": "8 January, 2020",
        "context": "one of ours miraculously landed intact for them during the obama regime...",
        "good": "18",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "FakePeachMints",
        "time": "8 January, 2020",
        "context": "Clinton have nukes to N. Korea.\nBarry gave our best drone tech to Iran and TRIED to give Iran Nukes. And gave Iran $150 Billion in unmarked billes.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mytruthhurtsyou",
        "time": "8 January, 2020",
        "context": "don't underestimate the dark side...",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "skihunter",
        "time": "8 January, 2020",
        "context": "Well 0bama did give them one",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "BackOff3030",
        "time": "8 January, 2020",
        "context": "Who the heck is underestimating anything outside of the Communist Democrats underestimating President Trump's resolve, determination and love for America?",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Roger.Dee1000",
        "time": "8 January, 2020",
        "context": "This is just more propaganda to justify American aggression in the Middle East at the behest of Israel. The Middle East has nothing to do with American interest and we need to stop fighting these Jewish wars.\n\nAmericans should not die to defend the interests of a foreign country. Kushner, Adelson, Singer, Wolfowitz, the Jewish neoconservative establishment, AIPAC. It's a disgrace!",
        "good": "0",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "pantycutioner",
        "time": "8 January, 2020",
        "context": "If your not sure of how the country has been ramping up its drone activity in recent years.  You're not paying attention.  Please direct all future inquiries to Mr. Obama I'm sure he'll clear it up for you.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "frazil56",
        "time": "8 January, 2020",
        "context": "pioneering its own UAVs.”....pretty sure mom's basement gamers are superior, I\"ll give them credit for that",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sendum2northkorea705",
        "time": "8 January, 2020",
        "context": "Many thanks to Obama for giving Iran terrorist BILLIONS in cash!!!  He's the biggest fraud to ever walk the USA and should be imprisoned for treason.",
        "good": "16",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "reasonablewhiteman",
        "time": "8 January, 2020",
        "context": "Heard the same about Iraq's .... \nBut they have bought some very modern weapons but somehow doubt they received quality training on their use",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "PascoArt049",
        "time": "8 January, 2020",
        "context": "Iranian drones paid for by Obama's stacks of cash. I would like to say what Iran could for Obama with one of their drones, but don't like getting an early morning knock on my door by you know who.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "OliveFlower",
        "time": "8 January, 2020",
        "context": "Never underestimate the Power of the United States Military",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Roger.Dee1000",
        "time": "8 January, 2020",
        "context": "Israel helped lie us into Iraq over fake intelligence about WMDs.\n\nAnd now we are supposed to fight another Jewish war in Iran?\n\nIt is completely insane and American needs to get our right now!",
        "good": "1",
        "bad": "8",
        "replies": []
    },
    {
        "user_name": "RedWeights",
        "time": "8 January, 2020",
        "context": "Obviously they have good drones as they bought them with all the billions we opened up for them. Why the average liberal is incapable of understanding this is beyond me. You know life is not a big college campus after all. Duhhhhhhhh",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "LOLWhat???",
        "time": "8 January, 2020",
        "context": "LOL! Let me get this right; these Iranian Maroons couldn't defeat Iraq in an 8 year war, and you are afraid of them? If we kill 30,000 Iranians in a war they will most likely kill 5,600,000 at their funerals.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "GoldPumpkin",
        "time": "8 January, 2020",
        "context": "this story was brought to you by the Obama administration",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cal2177",
        "time": "8 January, 2020",
        "context": "Never trust a democrat with your country's freedom nor your underage daughter.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "armedforliberty",
        "time": "8 January, 2020",
        "context": "Drones are a big nothingburger when it comes to all-out warfare. They are useful against low-level targets. They are otherwise too easy to shoot down.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "FakePeachMints",
        "time": "8 January, 2020",
        "context": "\"The only thing we have is fear itself! Sell it!\" - contemporary Democrats.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "KatKnapp",
        "time": "8 January, 2020",
        "context": "Ooooh...don't underestimate Iran.  Whoa.  Maybe we should should all get scared.  Wait, I think my knees are shaking.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "wheresmymule?",
        "time": "8 January, 2020",
        "context": "I asked a young man his thoughts about drones.  His response?  See those power lines over there??",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Westerdude68",
        "time": "8 January, 2020",
        "context": "If you google Seth J Frantzman you don't get anything regarding education or credentials.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rrrdog",
        "time": "8 January, 2020",
        "context": "lol.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mercenary76",
        "time": "8 January, 2020",
        "context": "they will not be able to deploy drones if they are swiftly targeted with nuclear armed ballistic missiles .",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "BlueCupcake",
        "time": "8 January, 2020",
        "context": "These are no doubt the same \"experts\" who told us how fearsome Saddam Hussein's military was, too.",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "KatKnapp",
        "time": "8 January, 2020",
        "context": "Fact is Texas could form a local militia that could take down Iran.",
        "good": "23",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "🍊OrangeManWon!!!🍊",
        "time": "8 January, 2020",
        "context": "We don't underestimate anything when it comes to war but no one in the world should underestimate our strength and the resolve of our military.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dazedandbemused",
        "time": "8 January, 2020",
        "context": "With the $150 Billion Obama gave them they have a huge fleet of Drones and Missles!",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "PurpleBottleOpener",
        "time": "8 January, 2020",
        "context": "Its all just \"rumors of war\". Relax.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "earlyprimate",
        "time": "8 January, 2020",
        "context": "nor should they be over estimated",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Cowabunga!",
        "time": "8 January, 2020",
        "context": "Never underestimate any adversaries capibilities.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "MolliCat",
        "time": "8 January, 2020",
        "context": "the last thing our people have done is under estimate...yes the irans weapons are dangerous...I think ours just may be more dangerous",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "CyanUmbrella",
        "time": "8 January, 2020",
        "context": "Iran a small cantina in TJ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cal2177",
        "time": "8 January, 2020",
        "context": "If I understand the military correctly, when they contract to have a drone designed they also contract to find a way to defeat it. Just in case.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Ko'olau",
        "time": "8 January, 2020",
        "context": "DRONES don't win wars. They're slow and easy targets. They're a lot like Saddam's tanks. Sitting targets!!! Iran is no match for US military superiority. A war would be over in days. Yet securing a lasting peace would be near impossible.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Bud1",
        "time": "8 January, 2020",
        "context": "and Iran does not know what we have in our arsenal.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "wonderwhom",
        "time": "8 January, 2020",
        "context": "If only they could shoot straight.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sjv4071974",
        "time": "8 January, 2020",
        "context": "Even Iran knows they have not even a snowballs chance. \nThat's why nobody was injured in last nights performances.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "turtletank",
        "time": "8 January, 2020",
        "context": "Just shut down their gas pipelines from Russia and India. \nLet the Iranians walk to their next terrorist rally.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "FakePeachMints",
        "time": "8 January, 2020",
        "context": "Imma go out on a limb and believe that the clunkers that fell without blowing up in those Iraqi fields,\nwere not intentional.\n\nSorry CNN.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cdciii",
        "time": "8 January, 2020",
        "context": "Iran has drones for weapons?  They need to learn from the best. Democrats have been droning immoral moralistic opinion in weaponized form for many years now...",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "CharlieBob",
        "time": "8 January, 2020",
        "context": "Thanks Obama, their arsenal got a bump with your pallets of cash.",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "neacemr",
        "time": "8 January, 2020",
        "context": "I am not worried.  Iran has been in a slow brain drain under 40 years of theocratic indoctrination.  They don't have the brain power to win a war against even Israel.  And the USA? Fuhgeddaboudit!",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Wilfordbrimley",
        "time": "8 January, 2020",
        "context": "In December Trump's fan club was saying that Bolton was a \"war monger\". They were applauding Trump \"bringing home the troops\". Today they are clamoring for war. What trick will Donald have them do next? Follow his twitter account to find out!",
        "good": "0",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "demsrdimwits",
        "time": "8 January, 2020",
        "context": "Any semi-modern missile battery would turn those drones into confetti.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "OrangeLeaf",
        "time": "8 January, 2020",
        "context": "We crashed a few in Iran during the Obama administration. That drone looks really familiar! LOL",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "avoiceinthewoods",
        "time": "8 January, 2020",
        "context": "I have two acronyms that have meaning in this situation AWACS and EMP.  We can see them and shoot them down and if all their electrical equipment is fried to a golden crisp, they are not flying anything!",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "CyanUmbrella",
        "time": "8 January, 2020",
        "context": "The Nothing of all Wars",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "wheresmymule?",
        "time": "8 January, 2020",
        "context": "Masters of War",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "kj33582!2Gl",
        "time": "8 January, 2020",
        "context": "no one is underestimating Iran, they plan to drop a nuclear bomb on us and Israel, someday, they have all the time in the world.  Of course they'll only be a big hole where Iran use to be if they do that, so much for the cradle of civilization.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "CharlieBob",
        "time": "8 January, 2020",
        "context": "\"Good people on both sides\"....\"Pallets of cash\", turnabout is fair play.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cal2177",
        "time": "8 January, 2020",
        "context": "Is there a drone that hunts down and kills other drones?",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "canuckcowboy",
        "time": "8 January, 2020",
        "context": "Looks like the same drone that Obama landed in Iran.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "lindy1988",
        "time": "8 January, 2020",
        "context": "Those drones are useless after the fleet gets bombed.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "kevin9800137",
        "time": "8 January, 2020",
        "context": "I remember under Obama when Iran captured our most advanced drone",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Bartt",
        "time": "8 January, 2020",
        "context": "Thanks Obama for allowing Iran to bring down one of our drones and stealing the technology",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "GoldFan",
        "time": "8 January, 2020",
        "context": "It looks like the Deval 16. The arab supercar that had brake discs from a 74 pinto but had 5000 horsepower",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "yodaddyisme2",
        "time": "8 January, 2020",
        "context": "The article fails to mention that the US can easily project air superiority from it’s carrier task force in the gulf.  The drone bases and their command and control support would be among the first targets eliminated in an all-out conflict.\n\nIt’s foolish to suppose Iran would be able to use drones in any significant way if we decided to eliminate them.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sendum2northkorea705",
        "time": "8 January, 2020",
        "context": "The first thing we should do is carpet bomb them with bacon bits, seriously!",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "DuhBears",
        "time": "8 January, 2020",
        "context": "Iran.....Pfft.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "TrumpCanada",
        "time": "8 January, 2020",
        "context": "Trump should not be underestimated.   A couple of Iranian Terrorist leaders learned that the hard way recently.",
        "good": "15",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "davidsmithwick938",
        "time": "8 January, 2020",
        "context": "I still think we attack and take all their military might away from them.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "1sparky",
        "time": "8 January, 2020",
        "context": "I see your drone and I raise you a B-52",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "deasley0293",
        "time": "8 January, 2020",
        "context": "I double dog dare them to invade the mainland of the U.S., they won't know what hit them, when the dust settles all that will be left of Iran is a lake.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cswapp",
        "time": "8 January, 2020",
        "context": "Just curious, is anyone else as tired of bought-and-paid-for ‘experts’ and their opinions as I am?",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "denverrez",
        "time": "8 January, 2020",
        "context": "Let's not 'over estimate' it either. Over estimating Saddam's capabilities led to a lot of this.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "bigphil63",
        "time": "8 January, 2020",
        "context": "Funny that the UAV in the picture looks too much like an MQ-9 Reaper to be coincidence.  Must have gotten their hands on some downed birds in Afghanistan and reverse engineered it.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "RedLocomotive",
        "time": "8 January, 2020",
        "context": "EMP them out of the sky. \n\ni brought my dinosaur who eats forcefield dogs.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dg50484",
        "time": "8 January, 2020",
        "context": "They need to take this part out of the head line - \"expert warns.\" Because we are obviously not talking to an \"expert.\"",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "transposition",
        "time": "8 January, 2020",
        "context": "Any drone that the Iranians have, that is big enough to carry a conventional weapon large enough to worry about, is easily detected on radar and can be dealt with accordingly. Even easier just to jam or spoof them.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "RedLocomotive",
        "time": "8 January, 2020",
        "context": "either the regime has to go, or the arsenal.  Because They can’t have both.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "demsrdimwits",
        "time": "8 January, 2020",
        "context": "Its easy to reverse engineer the appearance of a drone...not so easy to reverse engineer the brains within. Just ask the chinese.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "PurpleFlower",
        "time": "8 January, 2020",
        "context": "Obama: \"Iran, you didn't build that\".",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "DannyPaul01",
        "time": "8 January, 2020",
        "context": "The only thing the Iranians hit last night was a commercial aircraft carrying 82 of its own citizens.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "michaelt127",
        "time": "8 January, 2020",
        "context": "Whatever...if...that were true we'd have seen that before now in the gulf",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "RULibs4Real",
        "time": "8 January, 2020",
        "context": "This \"expert\" sounds like a pro Iran propagandist.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rickybobby753",
        "time": "8 January, 2020",
        "context": "Whaaaaaaaaahahahahahah - I fear the Shahed 129 drone....whahahahahahaha!",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "falcoc",
        "time": "8 January, 2020",
        "context": "Their UAVs are complete junk. They look like complex US drones. It's basically a shell with hobby grade RC model components in them and some cameras. Very short ranges of a few kilometers. No sat contol link.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "john.howard",
        "time": "8 January, 2020",
        "context": "Yes, it's impressive what Iran's engineers can do with a little PVC pipe and some cardboard.",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Progmmr",
        "time": "8 January, 2020",
        "context": "It looks remarkably similar to a US Predator.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Bossydonkey",
        "time": "8 January, 2020",
        "context": "Heard all this garbage before the 1st gulf war - which was over in less than a day. Iran poses zero threat to the US. They are just a murderous bunch of Holocaust denying zealots that are constantly stirring up conflict across the Middle East. Trump finally slapped them down and needs to keep it up.",
        "good": "14",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sendum2northkorea705",
        "time": "8 January, 2020",
        "context": "I'll bet the Obamas love Persian rugs, and prayer mats.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "LuciusCorneliusSulla945",
        "time": "8 January, 2020",
        "context": "Just a few more targets to shoot.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "transposition",
        "time": "8 January, 2020",
        "context": "Reminds me of the lead-up to Gulf War I. We were going to suffer the \"mother of all battles,\" and the elite, Republican Guard would fight to the death. Turned-out to be a bunch of b.s., propagated in part by the liberal press.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "TrumpCanada",
        "time": "8 January, 2020",
        "context": "So is Hillary going to join the Dem Leader race or not?",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "RedScooter",
        "time": "8 January, 2020",
        "context": "Experts...more like left wing drones",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ozarkhowler",
        "time": "8 January, 2020",
        "context": "Yes Iran demonstrated its incredible arsenal and firepower last night!.....yawn",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mejustinroberts",
        "time": "8 January, 2020",
        "context": "Thanks Barry",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "EDeploribusUnum",
        "time": "8 January, 2020",
        "context": "So how many Predator drones did we give them in addition to all of that cash, Barack?",
        "good": "15",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Loveitorleave1776536",
        "time": "8 January, 2020",
        "context": "Democrats funded Iran's terror aspirations for decades to come.",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "elowery1981",
        "time": "8 January, 2020",
        "context": "Iran couldn't amount to a hangnail against the U.S. military and its arsenal on their best day. Did thou notice how nobody revealed why their missiles went where we ALLOWED them to go. Iran wanted to make plans they couldn't be blamed for. Menacing cowards,  nothing more.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Loveitorleave1776536",
        "time": "8 January, 2020",
        "context": "Democrats could not care less. Their share of the Iran deal was untraceable CASH.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "DemsLuvTerrorists",
        "time": "8 January, 2020",
        "context": "Anyone remember this ?\nDecoded footage obtained from captured US drone\nOn 7 February 2013, Iran released video of the RQ-170 stealth UAV.\nThe footage shows the drone coming in for a landing at the Kandahar base.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "SanookMan555",
        "time": "8 January, 2020",
        "context": "I take that bet.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "everyly893",
        "time": "8 January, 2020",
        "context": "Just what we need, another idiot savant.  Wars are won with good intelligence, logistics, and the taking and holding of ground.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "JasonUSA",
        "time": "8 January, 2020",
        "context": "Uhhhhh.....okay.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Wilfordbrimley",
        "time": "8 January, 2020",
        "context": "When Rand Paul agrees with Trump, Fox News wheels the anorexic hobbit out in front of the TV. \nWhen he disagrees with Trump, they lose his number.\nA few weeks ago Rand Paul applauded Trump for bringing home the troops. I get the feeling that we won't get the chance to hear his opinion on this latest event. Trump has tweeted his marching orders to Fox News several times and letting them know when they aren't doing their job right.",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "72069",
        "time": "8 January, 2020",
        "context": "They need sophisticated communication ability too.  Beyond Iran, I would expect jamming to degrade these substantially.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Thethirdeye359",
        "time": "8 January, 2020",
        "context": "yeah\nTheir drone program really picked up when\nObomos landed our most advanced drones\nUndamaged in Iran",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sjv4071974",
        "time": "8 January, 2020",
        "context": "Trump batting clean-up for Barry and knocks it out of the park",
        "good": "12",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "GoldFan",
        "time": "8 January, 2020",
        "context": "To the credit of the Iranian regime....they are not cowards unlike the American leftists we put up with.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "RedScooter",
        "time": "8 January, 2020",
        "context": "Don't think that The U.S. military's super computers miss to much when they are running their scenarios.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "just_wanted_to_make_a_comment",
        "time": "8 January, 2020",
        "context": "Weird... it looks exactly like ours.  Yeah they did it all on their own.  Okay...",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "aocforhire934",
        "time": "8 January, 2020",
        "context": "Who said they're underestimated? Trump is just saying what ever they lay down he will raise them ten fold...",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Christian97",
        "time": "8 January, 2020",
        "context": "Iran is absolutely, in any sense of the word, not a \"superpower\".",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "faithbased",
        "time": "8 January, 2020",
        "context": "It would be a better statement that Iran should not underestimate the resolve of CIC TRUMP",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "misternh",
        "time": "8 January, 2020",
        "context": "I'm glad Trump started Space Force. That's going to come in clutch one day. Thank you President Trump.",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Extremophile",
        "time": "8 January, 2020",
        "context": "Just how far can you throw one of those balsa wood planes??",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "RedScooter",
        "time": "8 January, 2020",
        "context": "Notice both China and Russia go silent when America starts shaking the bat...",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "BlueBoomerang",
        "time": "8 January, 2020",
        "context": "And what do we have on our side - a Cusineart?",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "BlueRadio",
        "time": "8 January, 2020",
        "context": "The multi-million dollar Global Hawk Surveillance Drone packed with the most sophisticated electronics in the world that was recently sacrificed by Trump (shot down by Iran back in June) was detecting /locating electromagnetic noise signatures created by underground IR-6 nuclear centrifuges enriching weapons grade material. The Global Hawk sent back the locations of hidden underground enrichment facilities before it was destroyed. My guess is that the IR-6's are located underneath \"Cultural Sites\" to make hitting them unthinkable.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Biden=FakePresident",
        "time": "8 January, 2020",
        "context": "This should all be degraded in real time. No reason to delay, they continue to provoke and disrupt the Middle East.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "TinMan3",
        "time": "8 January, 2020",
        "context": "Had Obama been President when Iran attacked our embassy, his reaction would have been to ask what America did to deserve it.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "nightfly12",
        "time": "8 January, 2020",
        "context": "Yes,...we saw how massively effective they were. lol",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "GreenProcessor",
        "time": "8 January, 2020",
        "context": "Never underestimate an enemy..period. Al Qaeda used our own military communications satellites to chat with each other before. Fact",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "follow",
        "time": "8 January, 2020",
        "context": "\"It is never wise to underestimate the enemy.\" Mrs. George Custer",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "NCF8710",
        "time": "8 January, 2020",
        "context": "Was this the same 'expert' that over estimated the military might of the Iraqis?",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "selfishly",
        "time": "8 January, 2020",
        "context": "I think we are more advanced having already developed toilet paper.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ultrastealth",
        "time": "8 January, 2020",
        "context": "We are about to field lasers that will make the Iranian drones just expensive garbage.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Rdr2",
        "time": "8 January, 2020",
        "context": "We really need to worry about their copies of Russian and Chinese Sunburn missiles. More than anything else they pose a threat to our fleet and we don't appear to have much of a counter. IF they hit a carrier they could sink it.",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "TinMan3",
        "time": "8 January, 2020",
        "context": "Democrats: \"We should be afraid of Iran.\"\n\nRepublicans: \"Iran should be afraid of us.\" (And they are, hence their pathetic saving-face missile \"attacks\" of sand pits).",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sjv4071974",
        "time": "8 January, 2020",
        "context": "Trump will be reelected by going to \"Peace\" with Iran.......\nButtercups were screaming about starting WWIII  just last week.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jccrowder",
        "time": "8 January, 2020",
        "context": "Enough with the childish fear-mongering already. Yes, Iran has a military, they have a huge network of militia operatives, and they have a propensity to sew chaos. But they also have an understanding that they could easily be destroyed. The people in power there want to remain in power and that would end in a fiery flash if they keep pushing their luck.",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "DemsLuvTerrorists",
        "time": "8 January, 2020",
        "context": "Iran's drone capabilities really flourished after Obama became preisdent.\nObama was even kind enough to deliver Iran one of our new Stealth drone in 2013.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "gwposter526",
        "time": "8 January, 2020",
        "context": "How much military support has China given Iran?  China support of bad actors such as North Korea and Iran needs much more coverage in the media.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "gallowspoll",
        "time": "8 January, 2020",
        "context": "I seriously doubt the Pentagon is underestimating anything when it comes to them or anyone else for that matter.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "swami.",
        "time": "8 January, 2020",
        "context": "OK expert.   That’s why they backed down.  Warned Iraq so they could tell the US about the strike ( which Iran knew they would ) so minimal destruction and no casualties or injuries.  \n\nThey needed to look 👀 good at home because otherwise they are toast.   \n\n\nP.S.    EXPERT : Anyone more than 25 miles from home with a briefcase.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "dg50484",
        "time": "8 January, 2020",
        "context": "James Rogers and Seth Frantzman are idiots.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "nemesisdeliberales",
        "time": "8 January, 2020",
        "context": "This US Citizen says... \"The United States arsenal of unmanned aerial vehicles should not be estimated.\"\n\nNor should ANy of our military capabilities.\n\n#MAGA #KAG #Trump2020 #VoteRed #LiberalsLie #IranSuckIt",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "RetiredVet-mike",
        "time": "8 January, 2020",
        "context": "we should never take or enemies for granted regardless of who they are. but, we also need to rationally assess them; iran may be a \"power\" with drones, but our intel and defenses are beyond them.  taking nothing for granted, i would think we are very well attuned to that and have mechanisms in place to deal with them.",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "charliesantos",
        "time": "8 January, 2020",
        "context": "Iran don't push TRUMP he will destroy you",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "OscarsMadison",
        "time": "8 January, 2020",
        "context": "Iranians have way to much time on their hands .",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "TinMan3",
        "time": "8 January, 2020",
        "context": "Trump bloodied Iran's nose, and Iran backed down. They have no cards to play. America could destroy their oil infrastructure (and economy) in a day.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "*RussianBot*",
        "time": "8 January, 2020",
        "context": "Stinger missile target practice.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "OscarsMadison",
        "time": "8 January, 2020",
        "context": "Who gave them that? They certainly didn’t build it.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "HarryCallahan_2211",
        "time": "8 January, 2020",
        "context": "Drones, financed by Obama and Biden's shipment of cash.",
        "good": "12",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "nightfly12",
        "time": "8 January, 2020",
        "context": "Trump = 33\nCamel sniffers = 0\n\nSo far.....",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "nightfly12",
        "time": "8 January, 2020",
        "context": "Had to be a mindless lib writing this article.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "idon'tcare564",
        "time": "8 January, 2020",
        "context": "I think they were spoiled.........Decades of chanting death to America, taking our embassy, killing our soldiers, funding terrorism, trying to build nukes and Obama still sent over a plane load of cash........They got use to thinking they could raise cain and make threats and the money and attention poured in.......And then Trump came along, and frankly I think they have finally grasped that things could change and in fact that guy might actually blow them to bits and destroy  their playhouse...Probably a pretty good gig playing the role of religious cleric and supreme leader........Probably pays well with incredible benefits....Better tone down for a while, until we get some spineless liberal  back in the White House.......",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "GreenProcessor",
        "time": "8 January, 2020",
        "context": "Their surface to air missiles are no joke either.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "bl_from_fla035",
        "time": "8 January, 2020",
        "context": "We have at least 52 \"hard targets\" ... IRAN is intelligence wise stupid ... If U don't believe that; go ask Snowden for his \"Now Living Forever\" in Russia opinion ... PS: He'll need $$ ... LOL",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "SecureSborder",
        "time": "8 January, 2020",
        "context": "that's true of any country. i'm pretty sure they won't use it tho. 10 missiles on 1 target. my shotgun does better.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Winecounrty63",
        "time": "8 January, 2020",
        "context": "We could take out everything that tried to get of the ground so there is that",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "nightfly12",
        "time": "8 January, 2020",
        "context": "I'll take America over the goat lickers.",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "OscarsMadison",
        "time": "8 January, 2020",
        "context": "Oh please , stop trying to prop up Iran. We all know who and what they are.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Myco",
        "time": "8 January, 2020",
        "context": "Blaaahahahaha! Just like Iraq was supposed to have to worlds strongest military behind the US.....Pound Sand Iran.....",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "@oddswithliberals",
        "time": "8 January, 2020",
        "context": "I don't believe for one second they could be underestimated.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "DNCKillshighschoolkids387",
        "time": "8 January, 2020",
        "context": "I guess only our drones can be jammed and shot down. My God what idiots these people think we are",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "miked748",
        "time": "8 January, 2020",
        "context": "We heard the same things about the Iraqi military prior to desert storm......",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "FAKENEWSALERTS",
        "time": "8 January, 2020",
        "context": "Did i lock my car????????",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "hebrews1024",
        "time": "8 January, 2020",
        "context": "See what great toys you can get with $150 Billion....Thanks Obama",
        "good": "13",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "1Saltydawg",
        "time": "8 January, 2020",
        "context": "Iran's 2000-2500 ballistic missiles just got Trumped ......by one big boom.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Realityman",
        "time": "8 January, 2020",
        "context": "Iran is not a super power.. They are not someone that would give us much of a challenge.  Seriously people, we don't need to put up with their crap.",
        "good": "12",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "serapus",
        "time": "8 January, 2020",
        "context": "DJI make that?  What satellites have they launched to control it?  Haha",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "devylknyght",
        "time": "8 January, 2020",
        "context": "That looks like one of those foam airplanes we used to throw as a kid and the wings would fall off after 5 seconds.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "DemDeepStateIsReal",
        "time": "8 January, 2020",
        "context": "HAHAHAHAHAHAHAHAHA!!!\n\nAnything to make this a competition and potential for WWIII!!!\n\nThey are no match for us, \"DREAMERS!\"",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Greg1969",
        "time": "8 January, 2020",
        "context": "Iran has a huge educated scientific population.",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "faithbased",
        "time": "8 January, 2020",
        "context": "Little dogs bark the loudest",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "TinMan3",
        "time": "8 January, 2020",
        "context": "A single submarine in the Gulf could lay waste to the entire country. Get real, pal.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "DemsLuvTerrorists",
        "time": "8 January, 2020",
        "context": "Iran will reply heavily on ADA fire, and drone interruption of US. fighter /bomber aircraft\nDrones could be used a Kamikaze weapons or guided missile when dealing with US. manned aircraft.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Schattenkrieger",
        "time": "8 January, 2020",
        "context": "sure....no real intelligent person ever underestimates their enemy....but come on...it's iran.....i think we're on solid ground.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "johnnyslez",
        "time": "8 January, 2020",
        "context": "The drone is also capable of plummeting from altitudes as high as 50,000 feet in nearly the same number of smoking and or flaming fragments.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sjv4071974",
        "time": "8 January, 2020",
        "context": "USA is back-to-back World War Champs........Iran wants no piece of that.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Qservant",
        "time": "8 January, 2020",
        "context": "They must be the most powerful force in the world...their state owned TV said so.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "totalcraziness",
        "time": "8 January, 2020",
        "context": "If this is true, then all the more reason to destroy them.\n\nNancy and Chuck don't approve.   They think we should open our borders to them.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "DanS.",
        "time": "8 January, 2020",
        "context": "Israel is the drone King. They are King in many military ways.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "faithbased",
        "time": "8 January, 2020",
        "context": "I have no confidence that Iran will all of a sudden turn into a model world leader and be a major tourist attraction.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "coolgsd643",
        "time": "8 January, 2020",
        "context": "\"...similar size and shape to a Predator drone...\"    Well, yeah.  The obama administration allow a couple from the U.S. to fall into their hands and copy and 150 Billion dollars to manufacture.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "USKIWIdeplorable",
        "time": "8 January, 2020",
        "context": "Heads up Iran, just yesterday, A COINCIDENCE? The US Military launched the best weapons they had to the skies.\nYesterday the US Air Force stages \"elephant walk\" at Utah base, launches 52x F-35A fighter jets in a row.\n1.5 Trillion dollar investment, and with the order will pummel Irans infrastructure, oil and Atomic industries to dust.",
        "good": "9",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "WerWeist513",
        "time": "8 January, 2020",
        "context": "I guess we could find out if the U.S. Navy in the region still knows how to deal with kamikaze attacks (this time with drones).",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Streets",
        "time": "8 January, 2020",
        "context": "Iran vs USA?\n\nIran will be importing gas and HeeJabs.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Greg1969",
        "time": "8 January, 2020",
        "context": "The demonization of Iran is a Zionist plot.",
        "good": "2",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "TruthandJustice",
        "time": "8 January, 2020",
        "context": "When I read all the comments on this message board regarding the latest geopolitical upheaval, I scratch my head and wonder how did so many people obtained such great knowledge and wisdom with regard to such serious matters?",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "GoldRadio",
        "time": "8 January, 2020",
        "context": "These people do not even have toilets, never mind drones..lost a million men fighting equally inept Iraq over 8 years !!..too funny..",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "GoldDice",
        "time": "8 January, 2020",
        "context": "Iran will continue to drone on about their superiority. HA!",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "BeatTheHouse",
        "time": "8 January, 2020",
        "context": "Okay they have drones -- we're scared!!! Recall the war with Saddam Hussein where his military had the advantage because they were used to fighting in the desert.  They had tanks from Russia which were too hot inside in the desert and were no match for ours.  CNN was expecting a big win by Saddam's Republican Guard but they didn't count on our B52's carpet bombings!   \n\nThe best thing for the Mullahs is to deal with Trump who really wants peace.",
        "good": "9",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Zeus_Posiden",
        "time": "8 January, 2020",
        "context": "Mike Lee...calm down.  It would be irresponsible to go down the path of hypotheticals on what would have to happen for there to be a Declaration of War.  Cooler heads need to prevail in challenging times like these.",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "ZionistChristianConservative",
        "time": "8 January, 2020",
        "context": "Iran’s arsenal of UAVs shouldn't surprise anyone - especially when you consider that Obama handed them a near-intact RQ-170 drone and a couple of billion in untraceable cash\n\nAfter Russia and China, Barack Obama is Iran's greatest military ally",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "USKIWIdeplorable",
        "time": "8 January, 2020",
        "context": "Didnt the Mullahs just say on their media that they killed over 80 in the Blasts.\nThey mistook their own intel, thats how many were squashed rushing for the thousands of free meals offered at Soleimanis funeral if you attended.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "stop2think638",
        "time": "8 January, 2020",
        "context": "I think in the great drone fight, we probably have the edge.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "pace777",
        "time": "8 January, 2020",
        "context": "Nobody underestimates any country. We just happen to be better. 🤷🏻‍♂️",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ProudMarineVet",
        "time": "8 January, 2020",
        "context": "No match for an F-35 if that's the best they got...",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Buckery",
        "time": "8 January, 2020",
        "context": "To think prior President unaccountable cash fills terror arsenals.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dg50484",
        "time": "8 January, 2020",
        "context": "I was in Desert Storm. You know what our biggest concern was? Not killing everyone. That's no joke. We had to strategize our ordinance to keep from wiping everything off the map. That's a fact.",
        "good": "10",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "armedforliberty",
        "time": "8 January, 2020",
        "context": "The iranian drones have a range of 2,000 kilometers? Huh. Wonder how they get them up that high.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "i_just_stole_your_time",
        "time": "8 January, 2020",
        "context": "If they have drones, they could have confirmed kills.  Yet they used missiles on empty bases.  This was allowed by the US government to appease the Iranian people ignorant of the deal.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Chris732",
        "time": "8 January, 2020",
        "context": "We have sufficient technology to protect American assets from drone attacks. The real threat by drones would be softer targets such as civilian installations and smaller military forces out on patrol. If Iran were to target either of those categories, it would lead to a severe response and most likely war.\n\nFor them to make a successful attack against fully protected targets, they would need a significant number of drones. Rumor has it that certain drone companies contracting with the DOD are currently in the development and testing phases of next generation interceptor/killer UAV's.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "1stcorpsanv.",
        "time": "8 January, 2020",
        "context": "That drone is available from Amazon, with free shipping if you have prime",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "Kovidizfayke",
        "time": "8 January, 2020",
        "context": "Cmon...Really Fox. We have Over 500 war planes. Iran has 43 last graphic I saw. We dont need to be weary of Irans drones.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "R_Scottus",
        "time": "8 January, 2020",
        "context": "There is no doubt, Iran has the ability to throw some hard punches and connect with them. But they do not have the resources to go the full 12 rounds.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "paljo5",
        "time": "8 January, 2020",
        "context": "Didn't Iran shoot down one of our drones several yrs ago and managed to get sensitive technology information from it?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "plaintruth17",
        "time": "8 January, 2020",
        "context": "Sad but typical. Despite a obvious win for America and yes our President Trump “The New Fox News” puts out Iranian propaganda. Where is the news from the TIME magazine headline praising Trumps victory? Beware of “The New Fox News”",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "xlr58",
        "time": "8 January, 2020",
        "context": "Between the stampede and the aircraft shoot down ,  the Iranians have offed more terrorists than the  U.S. this week ! !",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "fnamelname",
        "time": "8 January, 2020",
        "context": "expert warns nothing from nothing leaves nothing!",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "liberadicator747",
        "time": "8 January, 2020",
        "context": "Iran appears to have weaponized Radio Shack.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "TinMan3",
        "time": "8 January, 2020",
        "context": "Trump has served the Mullahs notice. America will now hold them accountable for the murder and terrorism of their proxies, and we have the ability to take any of them out at a time of our choosing. The message was received, as evidenced by Iran warning us that the missile attack (into sand pits) was imminent.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bobhanlon762",
        "time": "8 January, 2020",
        "context": "The pictures prove that the Iranians can copy USA technology just as well as the Russians can. The only way to put the genie back in the bottle is to destroy the genie. Unlike most Islamic countries, Iran actually has a modern infrastructure. This makes it very susceptible to crippling infrastructure attacks. We really can send them back to the stone age - and they will notice the difference.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "KC2",
        "time": "8 January, 2020",
        "context": "Whys Iran may have a substantial arsenal of modern weapons they are short of capable people to operate them and leaders who know when to use them.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "FranNC",
        "time": "8 January, 2020",
        "context": "I don't think that a fiberglass model on a scaffold is much proof of anything.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "SouthrnAgitator",
        "time": "8 January, 2020",
        "context": "These the same guys who talked about Iraq's WMDs?",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cal_105898",
        "time": "8 January, 2020",
        "context": "I do not think that is a danger of Americans underestimating Iran's military,  since it appears a lot of Americans think that Iran is better armed than the US military. The US has unmatched power when compared to Iran.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "claudiusthefool",
        "time": "8 January, 2020",
        "context": "The basic lesson for Iran over the decades is that it needs to rid itself of its 8th century clerics and their dynastic rule over Iran since 1978!  Iran economically is a basket case and none of its military capabilities or exploits promise to make it a great economic or political power- it has major rivals in the Middle East including Egypt, Jordan, Saudi Arabia, and Turkey!  These other powers will not allow Iran to spread its interests without a high cost being paid!  In the next two generations, oil exporting nations will be marginalized as solar and other forms of non-fossil energy sources take over from the oil based industry and oil is the major export of Iran.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mindbendergnv",
        "time": "8 January, 2020",
        "context": "Drones... another Jeannie out of the bottle that we didn’t need in the mix!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "richlandwaindependants",
        "time": "8 January, 2020",
        "context": "America needs to be on guard at all times. Iran lies and lies and lies. \n\nAnd if I were Trump, I would add extra security around his properties. I'm thinking this could be personal to them......",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "urscreamin",
        "time": "8 January, 2020",
        "context": "The media is doing the same thing they did with Trump. Fear mongering. \n\nDon't this or don't do that, this might happen or that might happen.\n\n\"Don't vote for Trump, experts say recession in a year or less.\"\n\n\"Experts say Trump will start World War III.\"\n\n\"Experts say Hillary in a landslide, she cant lose!\"\n\nBottom line, anything the \"experts\" warn you against, is probably the best idea.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "check4321",
        "time": "8 January, 2020",
        "context": "Paper Mache.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "BlueBandAid",
        "time": "8 January, 2020",
        "context": "Funny how their drones look just like ours.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "higgs904",
        "time": "8 January, 2020",
        "context": "This article supports the notion that  last night's \"retaliation\" was simply a show for the people of Iran.   Iran could have done much more, but they don't want a war.   Our military would overwhelm them quickly, but it wouldn't solve anything.    We'd have regime change, and we've all seen how that works out.   President Trump is doing the right thing, and I greatly appreciate it.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "YugoIzzy",
        "time": "8 January, 2020",
        "context": "Obama to Iran’s drone scientists: “You didn’t build that, it’s the US Gov’t that did!",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "armedforliberty",
        "time": "8 January, 2020",
        "context": "A range of 2,000 km? That's a mighty long string for an iranian drone.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "JFra83",
        "time": "8 January, 2020",
        "context": "Um...ok. Let me think about that for a sec. Nope don’t care.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "quotefounders",
        "time": "8 January, 2020",
        "context": "Just saw headline - and this is exactly what was said about Sadam Husseins military in 1990 during the Gulf War - the mass of allies against Iraq then aside - Hussein's best republican guard was more afraid of the U.S.  And when the generals form Iraq met with Schwartcoff they were surpized at how many Iraqi's surrendered without shooting!",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jrsamples549",
        "time": "8 January, 2020",
        "context": "SURRENDER DOROTHY",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "SurveySays",
        "time": "8 January, 2020",
        "context": "Iran's arsenal should not be OVERestimated either.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "GreenProcessor",
        "time": "8 January, 2020",
        "context": "Seeing the same big talk used before 19 years in Afghanistan. You folks never learn do you?",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "charlesoliver",
        "time": "8 January, 2020",
        "context": "obama gave Iran the most advanced Drone in the world for free.\nI would think they could copy it with Russia's help.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "B.Conservative",
        "time": "8 January, 2020",
        "context": "Funny, these are the same \"experts\" that told us in the 90's that Saddam's republican guard was an elite force that we should be afraid of! Then when we invaded they threw up white flags immediately!",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "southern_pride",
        "time": "8 January, 2020",
        "context": "I really don't understand what everyone is so worried about. We have the most well equipped, most technologically advanced, best trained military force this world has ever seen and we are worried about Iran and their weaponry? There were those in 1990/1991 that thought Iraq would wipe us out and that we wouldn't have enough body bags to hold all the dead soldiers...It took less than two days to handle Saddam. Iran would be no different.",
        "good": "7",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Rjlee",
        "time": "8 January, 2020",
        "context": "It’s one of Iran’s relative strength and they use them for their asymmetrical warfare in the ME. They can wage war for cheaper while their adversaries spend more money on big military items. We have to find ways to neutralize that capability.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "syrinx242",
        "time": "8 January, 2020",
        "context": "Additionally, the Islamic Revolutionary Guard Corps Navy has challenged American ships in the Persian Gulf and flown UAVs close to U.S. aircraft carriers, according to the report.\n\nand.... what happened to that drone?\nwe shot it down...",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Taz123456",
        "time": "8 January, 2020",
        "context": "I guess $150 billion buys a lot of drones. Thanks Obama.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sos66",
        "time": "8 January, 2020",
        "context": "Yea - same stuff I heard before we annihilated Saddam Hussein's army in just days.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "username40",
        "time": "8 January, 2020",
        "context": "Expert my butt, chicken crap.  WE are the power (if Nancy and crew will let us 😏😉)",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "PrivatesectorA#1",
        "time": "8 January, 2020",
        "context": "Sadly American taxpayers financed their arsenal through the Obama deal  Sickening.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ZionistChristianConservative",
        "time": "8 January, 2020",
        "context": "AOC: It is our duty as Democrats to bow down to our Iranian overlords who seek the simultaneous destruction of America and Israel for it is the will of Sayyid Ali Hosseini Khamenei and because you know like, anti-American and anti-Semitic tweets are like so totally cool",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jimmymcgill339",
        "time": "8 January, 2020",
        "context": "Iran couldn't beat Iraq during an 8 year war. \n\nWe beat Iraq twice in a matter of days each time. Not worried about Iran.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Bodini",
        "time": "8 January, 2020",
        "context": "Barack Hussein O built Iran’s Military Power",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "fishman39541",
        "time": "8 January, 2020",
        "context": "The United States could wipe Iran off the map. Quit trying to scare people. The only way Iran does any damage is with terrorism. Isreal could also take out Iran. Not as fast but they would be successful. Our military budget equals the next 8 countries combined. Get out of here with that Iranian garbage.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Americant",
        "time": "8 January, 2020",
        "context": "Give me a break, these \"experts\" are nothing but old fools.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "sid[+]sauerfreedomfighter",
        "time": "8 January, 2020",
        "context": "Since IRAN funds most of the terrorism in the world we could wipe out most terrorism if we wiped out Iran.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Coolbreeze326",
        "time": "8 January, 2020",
        "context": "Or they could smuggle them into the U.S., assemble them in secrecy in sparsely populated areas, learn to fly them in squadrons, and attack us in say, Colorado or Kansas. That might be the explanation for recent mass drone sightings in those areas.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "treadlightly",
        "time": "8 January, 2020",
        "context": "compared to 3rd world countries, Iran is a superpower, otherwise...no.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bmac1957",
        "time": "8 January, 2020",
        "context": "I'll put the Buffs in Diego Garcia up against their drone force any day",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "LFSz",
        "time": "8 January, 2020",
        "context": "Pahhlease",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tnarrington",
        "time": "8 January, 2020",
        "context": "Looks a little bit like those big styrofoam planes you would get as a kid.  You throw them and they loop around overhead and divebomb the person that threw them.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "wacojohn647",
        "time": "8 January, 2020",
        "context": "\"Iran’s arsenal of unmanned aerial vehicles should not be underestimated\"    \n\nHAH!!  I 'estimate' they won't be able to launch a F A R T without electricity, a functioning Internet, fresh water supply, and all the other cripplng things we could do .... without ever leaving Arizona.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Glantry",
        "time": "8 January, 2020",
        "context": "Who cares, we could glass their entire country.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ZionistChristianConservative",
        "time": "8 January, 2020",
        "context": "2015: In a move favoring Iran over Israel, Obama threatens to veto any sanctions against Iran\n2015: The Republican-led Congress responds by inviting Israeli prime minister Netanyahu to address a joint session of Congress on the subject of Iran and the security dangers they pose to the region\n2016: As a final act of anti-Israel defiance, Obama pays Iran's ransom and releases all of that nation's $1.7 billion in frozen assets -- capping it off with a clandestine air drop of $400 million in untraceable US dollars on pallets that Tehran immediately uses to fund terrorism",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "TinMan3",
        "time": "8 January, 2020",
        "context": "I can't believe we're even mentioning Iran militarily in the same breath with America. It's a joke.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "psychstop",
        "time": "8 January, 2020",
        "context": "These same soft heads said the same thing about Saddam.    Oh the fear!!!!  Oh the fear!!!    I guess it works on the useful idiots.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ernieuncle773",
        "time": "8 January, 2020",
        "context": "Sorry, susan - not a lie.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Greg1969",
        "time": "8 January, 2020",
        "context": "Heres a good one for all of the trolls on Fox News. I was at a conference in Ottawa Canada two years ago. And this old  retired Israeli Air Force General was one of the featured speakers among many. He got up and shut down the whole charade....he said this: we have more Nuclear Weapons than Iran could ever dream of....our cities are more dispersed...their Cities are more concentrated, with Tehran being the most concentrated....we dont really care if Iran gets a nuclear bomb....that is just political posturing .....we can wipe them out faster than they can wipe us out and they know that.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "USKIWIdeplorable",
        "time": "8 January, 2020",
        "context": "Heads up Iran\nYesterday the US Air Force stages \"elephant walk\" at Utah base, launches 52x F-35A fighter jets in a row.\n1.5 Trillion dollar investment, \nWhos your daddy.......... and whos got the bigger stick?",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "charleswhieldon",
        "time": "8 January, 2020",
        "context": "It's been known for a very long time that Islamic terrorists hide their weapons in mosques, figuring they will be safe from attack because they are \"cultural sites.\" This is crazy needs to change.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "check4321",
        "time": "8 January, 2020",
        "context": "Most of their drones are walmart with M-80's attached.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "USKIWIdeplorable",
        "time": "8 January, 2020",
        "context": "What a joke.\nIran yesterday THREATENED Israel with massive attacks if Trump orders another strike.\nTrump should have fired a missile at the Ayatollahs mosque, Hezbollah would have attacked Israel, and Ireal would immediately have the justification to flatten Iran and Hezbollah in one swoop. Without consequence the US Military will help glass the entire region once and for all.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bigchuck55",
        "time": "8 January, 2020",
        "context": "Iran has developed a drone that can throw rocks. How cool",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "fabious",
        "time": "8 January, 2020",
        "context": "The entire point is to challenge the to contain just this - their developing more advanced weaponry.  Does not matter if we over or underestimate them; makes no difference on challenging them. \n\nAre think tanks just a bunch of stalls in a  bathroom?",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "keylargojohn",
        "time": "8 January, 2020",
        "context": "America's capabilities shouldn't be understated.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "RedMagnet",
        "time": "8 January, 2020",
        "context": "If I remember correctly Obama sent them a drone that mysteriously crash landed without much damage and they copied it for their own purposes. Just another gift from our Kenyan to Iran.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "ZionistChristianConservative",
        "time": "8 January, 2020",
        "context": "It is sickeningly ironic that the same Democrats who are rewarding criminals in San Francisco by refusing to arrest and convict serial thieves are also the ones defending Obama's returning nearly $2 billion [in untraceable cash] to Iran in his effort to help that regime continue funding world terrorism and its barbaric policies",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Americant",
        "time": "8 January, 2020",
        "context": "Are their drones more accurate than their missiles?",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "charleswhieldon",
        "time": "8 January, 2020",
        "context": "Very shortly, if not already, our armed forces will have directed energy weapons that will be able to destroy many things, including drones.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "pace777",
        "time": "8 January, 2020",
        "context": "Today’s liberals would be mourning the death of Hitler if Trump took him out.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sid[+]sauerfreedomfighter",
        "time": "8 January, 2020",
        "context": "IRAN funds most of the terrorism \nWe would wipe out most terrorism if we wiped out Iran.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tnarrington",
        "time": "8 January, 2020",
        "context": "Go read some of the behind the scenes info and you will quickly learn that most Iranians hated Soleimani.  The Iranian government actually had to threaten people and force them to get out on the street and protest for the cameras.  He was very brutal against Iranian citizens who were not hardliners.  Now the hardliners are just trying to use this to get the US to leave the middle east so they can do what they ulitmately want, which is to unite against Israel.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "orcini",
        "time": "8 January, 2020",
        "context": "Another expert...",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Stemchristie",
        "time": "8 January, 2020",
        "context": "Just like the Chinese and N Koreans, the Iranian stole this technology from the west and now are using it against us.\n\nHow did they steal it? They send their students to college here and allow many more to stay here and work.  They are taught and trained by socialist professors and liberals who gladly share our technology.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "faspro",
        "time": "8 January, 2020",
        "context": "Any advancement in Iran's military capabilities can be directly credited to past U.S. administrations.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Foxy",
        "time": "8 January, 2020",
        "context": "Trump has BIGGER FASTER DRONES...",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sid[+]sauerfreedomfighter",
        "time": "8 January, 2020",
        "context": "Perhaps Obama will have some more fundraisers to fund IRANs arsenal.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "DebsSharp",
        "time": "8 January, 2020",
        "context": "You watch, history will claim Trump as one of our greatest presidents and Obama as one of our worst.",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "jjsdietfitness",
        "time": "8 January, 2020",
        "context": "Looks like one of our old boneyard drones...lol.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "44years",
        "time": "8 January, 2020",
        "context": "All these facts from a magazine writer.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Americant",
        "time": "8 January, 2020",
        "context": "Iran are the ones doing the under estimating.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cal_105898",
        "time": "8 January, 2020",
        "context": "It is a tragedy that most American these days do not have any education or knowledge as related to wars or what they are. They do not teach them anything in schools anymore except wars are scary and evil. That is why people have been running around the last couple of days in a panic thinking the sky is falling screaming about the coming world war or war. They have not been taught the definition of war and the causes. They have no understanding of WW2, Korea, Vietnam, the gulf wars or the Afghanistan wars. Knowledge is power over your own life.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "*Tank-McQuade*",
        "time": "8 January, 2020",
        "context": "Irans military is probably equipped with Potato guns and bows and arrows. Yeah, send in the Marines to wipe them out. \n\nOoh-Rah! Get some",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "pspr",
        "time": "8 January, 2020",
        "context": "Don't worry, Mr. Rogers.  Our troops have been issued nets and fly swatters should Iran's drones show up.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "GoldChefHat",
        "time": "8 January, 2020",
        "context": "The problem with Irans drones is they have to takeoff and land somewhere. \n\nAnd we'll destroy those almost immediately if the balloon goes up...",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "OliveRing",
        "time": "8 January, 2020",
        "context": "Well, of course they should NOT be underestimated, Obama gave them billions of American taxpayer dollars so Iran could create the very best, right?  However, there is GOD and the power of prayer.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "FStone",
        "time": "8 January, 2020",
        "context": "They named their best drone the \"Thank You Obama I\".",
        "good": "9",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Photoman1955",
        "time": "8 January, 2020",
        "context": "In the end, we will need to destroy Iran and take out Kookoomehni too.  These sects that are commanding fundamentalist Islamic countries are the sects that believe Allah has commanded that the re-capture the original Islamic world and drive the \"infidels\" meaning other Islamic sects and of course, all \"non-believers\" into the sea.  That world is the entire Mediterranean region, from southern Spain to Afghanistan.  \n\nAnd they don't care if it takes 4 years or 400.  They are committed.  Modern Western secular governments don't seem to understand that level of religious ideology, not dissimilar to the Catholic Church of the 10th through 16th centuries.  There can never be real peace with these Islamic governments, unless we all surrender to Allah.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Americant",
        "time": "8 January, 2020",
        "context": "It's a lie. Iran is not powerful enough give us a good fight. We will destroy them in a week if we must. Only because there are so many targets. We will render any offensive weapons inoperable within hours.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "USKIWIdeplorable",
        "time": "8 January, 2020",
        "context": "Being fingered for funding those Ballistic Missiles isnt going to help Joe Bidens Bid much is it.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "texgeekdude",
        "time": "8 January, 2020",
        "context": "I expect that the USA knows how to jam all their stuff.  Admittedly they are hard to detect though.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Americant",
        "time": "8 January, 2020",
        "context": "How about we send a drone to Khomenis livingroom.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "RedBone",
        "time": "8 January, 2020",
        "context": "Iran has far more capable weapons then they used last night and if they really wanted to kill Americans they could have used them but (watch for it) they didn't. Unless Iran uses terrorism proxies they will never stand up and fight directly with the US. In a matter of days we could easily cripple their entire country and they fully understand this.",
        "good": "4",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "SirWhoRippedone",
        "time": "8 January, 2020",
        "context": "No worries, Iran bought their drones from the same arms dealer that sold them the ballistic missiles, they launched last night, and totally missed their targets.  Their focus is no longer on the United States, they are currently in an all out search for the arms dealer.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "DeaconR",
        "time": "8 January, 2020",
        "context": "So what. Why does the press dig up an \"expert\" that always warns us how big and bad our enemies are. Iran just did what it needed to do to save face with its people. According to all these experts every sheep herder with a big stick is to be feared. If they were that big and bad that would not have taken so many precautions to prevent from hitting anyone. They know the United States could crush them into the sand with little effort.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "CyanPumpkin",
        "time": "8 January, 2020",
        "context": "Obama Bin Biden used tax payer billions to fund Irans military",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "USKIWIdeplorable",
        "time": "8 January, 2020",
        "context": "The Obama Administration supported, helped fund, and provided tactical assistance and helped move Terror leaders onto the battlefield FACT.\nThe Obama Admin sends pallets of cash to the Mullahs, who in turn fund their own terror groups. FACT\n\nTrump came along and in one tweet, flattened 99.5% of Isis in 8 months.\nIn another tweet he expressed his happiness that one of the worlds worst terrorists is killed.\n\nPick a side, and vote accordingly Nov 2020",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "USKIWIdeplorable",
        "time": "8 January, 2020",
        "context": "If Iran has copied the older technology of the Downed US Drone.\nThe US Military will have a very blunt answer for them if they used them against US Targets.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "Americant",
        "time": "8 January, 2020",
        "context": "We have drone swarms.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "USKIWIdeplorable",
        "time": "8 January, 2020",
        "context": "To think thousands protest against the Iranian leadership, and under Soleimanis orders shot hundreds of civilians and many were thrown in the river.\nRemember that libs, when you are out protesting against Trump for Killing that Terrorist.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "motrparty",
        "time": "8 January, 2020",
        "context": "Yeah, \"similar to the Predator drone\"... that's because China stole our tech and sold it to them! And yet we still buy billions of dollars of their crap products. Made in USA only!",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "xlr58",
        "time": "8 January, 2020",
        "context": "I trained Iranian military members in the 70's , they are NOT technically competent. Without Russian and Chinese technical \"advisers \"  they would be living in the 7th century .",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "justthefacts768",
        "time": "8 January, 2020",
        "context": "Maybe the US has thousands of missiles targeted on Iran which includes their drone sites. Doubt if we didn't.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Americant",
        "time": "8 January, 2020",
        "context": "The \"experts\" love to tell us Iran is not Iraq suggesting Iran is a much tougher nation to defeat. Thats bull. We can defeat ANY of them exactly as we did Iraq. Only more efficiently and effectively than ever and Less collateral damage and more deadly.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Americant",
        "time": "8 January, 2020",
        "context": "Their Ayatollah should be attacked one after another like we do terrorist leaders.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "bigmaxxx718",
        "time": "8 January, 2020",
        "context": "No matter who our enemy is, the democrats will side with them.  Their \"Blame America First\" campaign will not work well at the ballot box.  There will be a re-election.",
        "good": "6",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "A_Republic_If_You_Can_Keep_It",
        "time": "8 January, 2020",
        "context": "Iran has the same number of active and reserve military as the US. They have missiles that can reach the entire middle east. They have a powerful drone program. They are fearless and like martyrs and suicide bombers. Yes, thanks Trump for making us safer. Not. And isn't the assassination of an Iranian General equivalent to assassinating the Secretary of Defense or Secretary of State? Has Trump become the terrorist?",
        "good": "4",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "myinterwebs",
        "time": "8 January, 2020",
        "context": "do you think america has the political will for a war with iran? i don't.",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "Owning.the.Cult",
        "time": "9 January, 2020",
        "context": "All you Iran War chickenhawks must have forgotten Cheeto's campaign promise to withdraw from the region and avoid the foolish and expensive wars of his predecessors.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "RedPopcorn",
        "time": "10 January, 2020",
        "context": "Kowtowing to terrorists may not be productive",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "grdane03",
        "time": "9 January, 2020",
        "context": "So does anyone think the mysterious drones flying in formation over colorado, wyoming and nebraska belong to the Iranians?",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "JimBoyd",
        "time": "8 January, 2020",
        "context": "The irony is the commander of the USS Harry Truman aircraft carrier that is currently in the Persian Gulf is Kavon Hakimzadeh, an Iranian American. He fled Iran during the revolution. I'm sure he'd be happy to wipe out the drone \"arsenal\". Another great LEGAL immigrant, making America great.",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Owning.the.Cult",
        "time": "8 January, 2020",
        "context": "Look at all the chickenhawks!",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "john.howard",
        "time": "9 January, 2020",
        "context": "UAV's painted to mimic Air Force One scheme?\n\nWhat will they think of next?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "deodorant4u",
        "time": "8 January, 2020",
        "context": "Clearly Iran realizes that they need more time to get their own nukes and want to de-escalate, for now. Don't count on any serious actions though, they hate the USA to the bone.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "edcurrents",
        "time": "8 January, 2020",
        "context": "Drones are good but their success depends on signals that can be blocked and messed with.  Simply send that drone on a reverse course, detonate payload and kick back.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Deutch",
        "time": "8 January, 2020",
        "context": "So Iran has previously enjoyed Rus hardware. Ohhhh!  Better worry",
        "good": "1",
        "bad": "0",
        "replies": []
    }
]