[
    {
        "user_name": "tar*****",
        "user_url": "https://news.yahoo.co.jp/profile/id/89XxqPGMa2IUb7DWyMWy/comments",
        "time": null,
        "context": "私だけが知っている神目線シリーズ\n\nコロナループの生成メカニズムは、万物の理論の視点から見れば、何も特別なところはない。\nそれは、現状の人間の理解が正しくないからで、磁気に対する理解が正しいなら、中学生なら理解出来るレベルだからだ。\n今回も、ひとつだけ教えよう。\n磁気・磁場・電磁気学を正しく理解したいなら、重力の発生メカニズムを理解することが、絶対的に必要だ。電弱統一理論や、大統一理論などのそれまでの常識にとらわれた・構築・蓄積された視点からでは無理だ。\n万物の理論で世界を見ると、全ての事象がひとつの根源的なメカニズムから成されていることがハッキリと分かる。\n４つの力の統一出来るだろう、などと考える状態にあること自体が間違いなのだ。\nつまり、現代の4つの力、それぞれの理解の仕方が間違っている。いや、理解したと思い込んでいるだけで何も知らないのだ。\n光の正体すら知らないことに気付いていない。",
        "good": 6,
        "bad": 32,
        "replies": [
            {
                "user_name": "tar*****",
                "user_url": "https://news.yahoo.co.jp/profile/id/89XxqPGMa2IUb7DWyMWy/comments",
                "time": null,
                "context": "例えば、太陽の表面より離れた上空、コロナの方が温度が100倍以上高い理由を人間は考えられず、磁場に答えを見出そうとする。\nこれは人間の間違った常識の代表的な例だ。\n何でも良いのだが、その存在を認めた物体が熱を発する、と言う場合には、人間は必ずその物体を熱源と決めつけてしまうのだ。太陽もその例にもれず、そう考えてしまうから思考が停止する。熱源から離れた方が熱いはずがない、との常識だ。\nこれは、熱の発生メカニズムの理解が間違っているからだ。\nこれを見た方へのサービスで書くが、全て熱は熱源から出ているのだ。\n何度も繰り返し言っているが、光は反射などというものはしない、て言っているのと同じことを言っているのだ。\n私の話を深く考えることが出来る者は幸いだ。それは幻想の世界から抜け出せる可能性があるからだ。\nそれが出来ない者は、常識に囚われていることにも気付くことはないが、それはある意味幸せなことだ。",
                "good": 5,
                "bad": 15
            }
        ]
    },
    {
        "user_name": "yks*****",
        "user_url": "https://news.yahoo.co.jp/profile/id/5nEBTmSBYWNYFDDoHHBa1w--/comments",
        "time": null,
        "context": "素人考えですが太陽が水素が核融合して燃えてるのなら可視光などで見た時に何故陸と空のような境界線があるのだろうかと思いました、地球と同じ岩石惑星で陸地がありあの太陽光はプラズマ放射されてる光とは考えられないだろうか？それなら太陽フレアの方が温度が高いのが説明がつくのでは？",
        "good": 1,
        "bad": 8,
        "replies": []
    },
    {
        "user_name": "ちょっと一言",
        "user_url": "https://news.yahoo.co.jp/profile/id/9h9LfMuQa3xItbZaUATsVe8-/comments",
        "time": null,
        "context": "磁力線がループしているのは、よくあること。\nだから、コロナもループしていても、おかしくはない。\n\nでも、目の錯覚で、実はループしていないという可能性も、否定できないだろうね。\n太陽って、こんなに身近にありながら、わからないことが多い。",
        "good": 0,
        "bad": 0,
        "replies": []
    },
    {
        "user_name": "wtx*****",
        "user_url": "https://news.yahoo.co.jp/profile/id/3VPK9myPfmjsBhUW8rbioQG6nQ--/comments",
        "time": null,
        "context": "昔は溶岩が吹き出るイメージだったけど放物線を作らないのでループとかチューブとか言うらしい。エネルギーはエネルギーに寄り添う性質がある（だから宇宙にはフィラメント構造が多い）ので太陽は放出されたエネルギーの一部を重力場により戻してる、ループはその通り道だと思う。",
        "good": 1,
        "bad": 3,
        "replies": []
    },
    {
        "user_name": "tako********",
        "user_url": "https://news.yahoo.co.jp/profile/id/5DRmEZSMa3rdKuR.GWG.jA--/comments",
        "time": null,
        "context": "最新の衛星画像の説明が、ビニールチューブとレースの手作り感満載の模型なのが、楽しいギャップです。",
        "good": 14,
        "bad": 1,
        "replies": []
    }
]