[
    {
        "error": "error"
    },
    {
        "user_name": "Ragingconservative461",
        "time": "15 May, 2021",
        "context": "So what....California and Oregon are liberal states. No one cares, but them. Let them dry up and die. ",
        "good": "19",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "popoli2020049",
        "time": "15 May, 2021",
        "context": "Poor resource management by the democratic run state of Oregon.  Can't feel sorry for these folks, they vote them in and the brains dead leaders turn a once great state like oregon into a wasteland and radicals.  Leadership folks is all that is needed.  RIP",
        "good": "162",
        "bad": "7",
        "replies": []
    },
    {
        "user_name": "Misscosmo",
        "time": "15 May, 2021",
        "context": "Can those states do anything right?",
        "good": "72",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "jams",
        "time": "15 May, 2021",
        "context": "They might be without water but I`ll bet their pronouns are just what the Doctor ordered !",
        "good": "76",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "mikerotch",
        "time": "15 May, 2021",
        "context": "Just keep voting for democrats  who want open borders and doling out free benefits. The population has overrun the resources because of democrat policies. Now they scream they have no water when immediately to the West is an endless supply. Build desalinization  plants. Yeah I know it costs more, but you democrats love to throw money around.",
        "good": "194",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "key42",
        "time": "15 May, 2021",
        "context": "But hey, lets allow millions and millions more people into our country to use our resources, it's okay right?",
        "good": "314",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "Iliveinreality",
        "time": "15 May, 2021",
        "context": "Pretty long article..",
        "good": "1",
        "bad": "8",
        "replies": []
    },
    {
        "user_name": "ConcernedAmericanPatriot",
        "time": "15 May, 2021",
        "context": "I have lived in OR since 2004. This spring and winter compared to all others (and some have been similar but not as bad)  --- it just has not rained that much --- its dry. Its been warm and the last frost --- was super early --- all the blossoms early ...not good.\n\nMAGA",
        "good": "212",
        "bad": "7",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "djpage315",
        "time": "15 May, 2021",
        "context": "The\"jet\" boat in the picture has an outboard motor.  Hard to believe anything that is published these days.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "RollTide311",
        "time": "15 May, 2021",
        "context": "Heaven forbid we don’t funnel that water to illegals in CA.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "isthiswhatyouvoted4",
        "time": "15 May, 2021",
        "context": "So the US government redirected water years ago to create farm land and now Mother Nature is kicking back so the same government is trying to reverse their earlier decision thereby hurting the farmers. But liberals still think the Federal Government is the best thing since sliced bread. Insanity!",
        "good": "214",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "whynothink",
        "time": "15 May, 2021",
        "context": "Most folks do not refute climate change - just the cause. As Joe said - we contribute to 15% of the pollutants and no matter what we do it won't matter much.",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "improviseadaptovercome",
        "time": "15 May, 2021",
        "context": "Now is this due to global warming....or global cooling? Or, hey what are they blaming everything on this week?\n\nBy the way, the pictured \"jet boat\" has an outboard (propeller) engine in plain sight.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "Junkdrawer8675309",
        "time": "15 May, 2021",
        "context": "You get what you vote for.  Not sure if they noticed there is plenty of water to the west of them.  However it’s not the cheapest source",
        "good": "168",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "notsure954",
        "time": "15 May, 2021",
        "context": "Maybe Slo Joe can put H-dog in charge of the water crisis in Oregon like he did for the Border Crisis.  You think you will get some help?  Oregon loves Biden.",
        "good": "28",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "usisdone",
        "time": "15 May, 2021",
        "context": "Shut the water off to the homeless people in Portland.  That should irrigate several thousand acres.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "wyleecoyote",
        "time": "15 May, 2021",
        "context": "Our government would love to help but unfortunately we are tied up at our southern border trying to solve a crisis that we created to show Trump how much we hate him.",
        "good": "73",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "denzelle",
        "time": "15 May, 2021",
        "context": "We need that water for lawns, golf courses and backyard swimming pools.  The food supply is not a priority.",
        "good": "112",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "don2947",
        "time": "15 May, 2021",
        "context": "And in two weeks they'll be complaining about floods.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ShadyJ",
        "time": "15 May, 2021",
        "context": "That is not a jetboat in the picture.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Rockinit774",
        "time": "15 May, 2021",
        "context": "Can't Joey sign an executive order throwing some money at them to fix this? Oh that's right, it's all going to the Palestinians and illegal immigrants.",
        "good": "25",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Gulfman43",
        "time": "15 May, 2021",
        "context": "The only constant is change. We will survive this climate cycle. The salmon will come back, or not. We adapt and move forward. That's what we do.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "ferr3312",
        "time": "15 May, 2021",
        "context": "Government mismanagement. Proof that letting the government run something usually turns out poor.",
        "good": "31",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "drphill",
        "time": "15 May, 2021",
        "context": "\"We're from the Federal Bureau of Reclamation and we only want to help you.\"\n\"Oh yeah, and you don't get any water.\"",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "salahadin666",
        "time": "15 May, 2021",
        "context": "love how these stories bring out all the climate change whackos",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "BuckFoeJiden",
        "time": "15 May, 2021",
        "context": "Both states are next to something called an Ocean, how can they possibly have a problem with water? Never heard of the process called desalinization?",
        "good": "44",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Calsp3",
        "time": "15 May, 2021",
        "context": "Removal of the dams on the river also removed water storage capacity which might mitigate the effects of the ever occurring droughts. ",
        "good": "32",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "maxknows",
        "time": "15 May, 2021",
        "context": "Oh go ahead, add another million or two illegal immigrants.  They only use about 80 to 100 gallons of water each every day.",
        "good": "31",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Allenwilnc",
        "time": "15 May, 2021",
        "context": "Where’s uncle biden, thought he was the next best thing to god! ",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "don2947",
        "time": "15 May, 2021",
        "context": "Why does a jet boat have an outboard motor on it?",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "conservativevoter224",
        "time": "15 May, 2021",
        "context": "Hey Oregon, why don't you blow up some more dams like you've done in the past instead of using fish ladders.  That way you can experience even worse conditions!  Oh and while you're at it have a few more out of control fires due to your poor forest management.  I lived in that beautiful but horribly run state for 17 years.  I know the kind of irresponsible things that state government does there.  Oh and Portland, you're getting just what you voted for with Wheeler and Brown.",
        "good": "333",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "spectrum123",
        "time": "15 May, 2021",
        "context": "Oh well. Run it dry and no one can complain about controlling it.",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rtfm81",
        "time": "15 May, 2021",
        "context": "Never let Liberals get near your natural resources.",
        "good": "13",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "dazedandconfused150",
        "time": "15 May, 2021",
        "context": "Ole Dan and I, with throats burned dry, and souls that cry for water...\n\nCool, clear water",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Jotn",
        "time": "15 May, 2021",
        "context": "What will they do? Vote for the same filthy thieves over and over. It’s called feeding the dog that bites you.",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "megamind69",
        "time": "15 May, 2021",
        "context": "We’re from the government and we’re here to help.",
        "good": "14",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "acqcon408",
        "time": "15 May, 2021",
        "context": "Joe will put Hee Hee Harris in charge, that will get the problem resolved!  Just not in her lifetime.",
        "good": "20",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "GeneralLee068",
        "time": "15 May, 2021",
        "context": "State of Jefferson or die trying!",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "monterrey49",
        "time": "15 May, 2021",
        "context": "Move Portland protestors there. ",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "occer",
        "time": "15 May, 2021",
        "context": "Stop complaining suckers. Priorities. Illegals need water first. Joe.",
        "good": "10",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "tdsbullfighter",
        "time": "15 May, 2021",
        "context": "Good thing the only people still there don't bathe.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "marginal",
        "time": "15 May, 2021",
        "context": "Don't worry, Joe has it all under control. He'll send Kamala to that border next.",
        "good": "7",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "joecars",
        "time": "15 May, 2021",
        "context": ".... divert all the Portland water to saving the fish   .... much better choice  !!!",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bluecollarcountry",
        "time": "15 May, 2021",
        "context": "Enjoy the bears when they come looking for new food sources.",
        "good": "13",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "occer",
        "time": "15 May, 2021",
        "context": "I love Bidens America. How about you? Water, fuel shortages, high inflation. Forced to wear masks. Everything costs more. World in turmoil. Great to be a liberal hey.",
        "good": "22",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "godspeaksmath",
        "time": "15 May, 2021",
        "context": "Just be thankful this is happening in Oregon-California and not America.",
        "good": "17",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "joecars",
        "time": "15 May, 2021",
        "context": "..... 97% of the fish are infected with C shasta ..... is that China shasta  ???? .... is Dr. Fauci involved  ???",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "pmuench",
        "time": "15 May, 2021",
        "context": "I HAVE THE SOLUTION ! ! !\n\nDo like CA, and the politicians your and CA's people vote for, and open the borders and invite immigrants for massive immigration.  Nothing will relieve water demand like an increase in population.\n\nDoes that sound like nonsense?  Well just imagine what the population with functioning brains think about your choices.",
        "good": "6",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "pastordean726",
        "time": "15 May, 2021",
        "context": "I thought the climate change dims were in charge of the weather? You mean with all the money thrown at climate change it hasn’t done anything? Hum the dims aren’t God after all. ",
        "good": "8",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "climbr11",
        "time": "15 May, 2021",
        "context": "Well this is the Democrats again guys,\n\n I live in this area and I have a big problem with this article it’s not that bad this year I can’t believe they’re turning it off, Democrats love to create catastrophes when they are not there,.. and as to the bald eagles they are going to die anyway on the blades of wind turbines, also a Democrat piece of equipment!\n\nWhere are you sierra club getting paid off to keep your mouth shut?\n\nPlus you got to get women out of these types of power positions \n\nthey’re not good at these jobs they make too many emotional decisions!",
        "good": "14",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "houndog…",
        "time": "15 May, 2021",
        "context": "Maybe these states should have been developing more reservoirs and spening less time on their liberal projects the last few years??   ",
        "good": "48",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "changed2republican",
        "time": "15 May, 2021",
        "context": "The Governors of these 2 states should be investing in desalinization plants and other alternative water sources rather than handing out stimulus checks and benefits to illegal border crossers.",
        "good": "482",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "Christian97",
        "time": "15 May, 2021",
        "context": "Which is dying faster; America or Joe?",
        "good": "12",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "wolfcreek243",
        "time": "15 May, 2021",
        "context": "California and Oregon... who cares?",
        "good": "6",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "pugil",
        "time": "15 May, 2021",
        "context": "Are the salmon natural to those waters? \nWere they planted by the government?\n\n\nMichigan back in the 1960's introduced Salmon and coho into Lake Michigan. up until that time Lake Michigan had the best lake perch fishing in the world. My dad and I would go out and limit out in no time with buckets full of 13 - 14 inch lake perch. The Government introduced the salmon. Now it is rare to catch a lake perch over 8 - 10 inches and those are few and far between. But I guess the government knows best, right?",
        "good": "448",
        "bad": "14",
        "replies": []
    },
    {
        "user_name": "lookingforwork",
        "time": "15 May, 2021",
        "context": "Perhaps it is California that needs its water turned off. They suck the nation dry on everything.",
        "good": "18",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "youwant",
        "time": "15 May, 2021",
        "context": "Mismanagement is what liberals do. \nThe last few years has brought an enormous amount of snow and rain to the west coast, but much of it was released into the oceans because their reservoirs are in such bad shape. Maybe instead of giving away their money in guaranteed income they should reinforce their damns for their irrigation and drinking water. Just a thought.",
        "good": "11",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "AG-7947",
        "time": "15 May, 2021",
        "context": "On the west coast it all about population mass and the inability of the natural resources to support it.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "davidcjones45622",
        "time": "15 May, 2021",
        "context": "The drought will continue and worsen based on dendrochronology and paleontological evidence of cyclical droughts along the  western areas of the Americas.\n\nSure glad that thousands of new residents are not crossing the southern border to further stain critical natural resources.That would be a real mess.",
        "good": "327",
        "bad": "7",
        "replies": []
    },
    {
        "user_name": "lastman_standing",
        "time": "15 May, 2021",
        "context": "And this has absolutely nothing to do with supposed climate change. Look up the effects of a grand solar minimum. But idiotic state and federal regulators aren’t helping the situation. Prepare and stock your shelves now because this will only get worse. We are just entering the minimum cycle. Food shortages and hyper inflation are on their way.",
        "good": "18",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "CyanDog",
        "time": "15 May, 2021",
        "context": "You just cant fix any woke is a joke Dem run down blue state's cities leading authoritarian anarchist Dem politicians. Dem and RINO obstructionists against MAGA.",
        "good": "5",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "ILTH",
        "time": "15 May, 2021",
        "context": "Don't worry people! Any problems this may cause will be fixed when the White House sends you a CHECK!!! $$$$$ :) :) :)",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "occer",
        "time": "15 May, 2021",
        "context": "Sorry. Joe confiscated dams to build tent cities for illegal immigration. Be a true liberal and give away everything to support the liberal cause.",
        "good": "20",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "CyanCarrot",
        "time": "15 May, 2021",
        "context": "Scoop up all the dead fish and drop them on the Whitehouse lawn. Joe Byyydin",
        "good": "8",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "realist12345678",
        "time": "15 May, 2021",
        "context": "When will people realize that the climate is changing and that the consequences of not taking action will eventually dwarf the costs of taking action?\nThis is yet another brick in the wall.\nThe one we are running headlong into.",
        "good": "2",
        "bad": "11",
        "replies": []
    },
    {
        "user_name": "copatriot671",
        "time": "15 May, 2021",
        "context": "Keep on burning dinosaur fuel!",
        "good": "3",
        "bad": "14",
        "replies": []
    },
    {
        "user_name": "CharlieWaffles550",
        "time": "15 May, 2021",
        "context": "Never vote democrat.",
        "good": "22",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "wingshot8546",
        "time": "15 May, 2021",
        "context": "california-oregon border??   aaah, too bad.",
        "good": "8",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "groovygirl",
        "time": "15 May, 2021",
        "context": "The left coast deserves everything they get ! A lot of their problems are self created! ",
        "good": "16",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "winstonkafka",
        "time": "15 May, 2021",
        "context": "Thing could always be worse.  Sad but true.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "GaryJB",
        "time": "15 May, 2021",
        "context": "Maybe your being punished by the almighty. ",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "americangirl25",
        "time": "15 May, 2021",
        "context": "People who need water are now considered \"far right\"?",
        "good": "10",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "nmeast",
        "time": "15 May, 2021",
        "context": "Do not whine.  You have a WHOLE OCEAN to draw water from.  Instead of funding all your illegal aliens and homeless, you should have been building desalination plants, to take care of your water needs.",
        "good": "30",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "GeneralLee068",
        "time": "15 May, 2021",
        "context": "XX state of Jefferson",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "justinplayfair",
        "time": "15 May, 2021",
        "context": "Yeah, but at least the darter snails are safe so we all can sleep well at night.",
        "good": "23",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "THX-138",
        "time": "15 May, 2021",
        "context": "Just more proof of insane lib management !",
        "good": "7",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "FJB!",
        "time": "15 May, 2021",
        "context": "Poor water and land management",
        "good": "8",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "saggydrawers",
        "time": "15 May, 2021",
        "context": "Noticed they used a photo on the Foxnews front page that shows lots of dead Salmon.  What they are not telling you those salmon were on their way to deaths door as they are heading upstream to spawn and die.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "DarthSabreth",
        "time": "15 May, 2021",
        "context": "It doesnt help that the biden regime allowed drug cartels to set up pot farms that use in upwards of 10 million gallons of water a day.",
        "good": "71",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "OliveBullhorn",
        "time": "15 May, 2021",
        "context": "Bring in some more illegal aliens!\n\nThat’ll fix it! 😘",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "041712670",
        "time": "15 May, 2021",
        "context": "Cali, Oregon(and Wash) are the most beautiful and scenic places on Earth, I lived in all 3.  The trouble is the people are fckt.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "changed2republican",
        "time": "15 May, 2021",
        "context": "Newsom should have used all of that money he wasted on benefits, stimulus checks, housing for illegal border crossers on alternative water sources. DUH!",
        "good": "17",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Atlasshrugged2020",
        "time": "15 May, 2021",
        "context": "another Biden catastrophe.",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "error": "error"
    },
    {
        "user_name": "Birddawg🐾",
        "time": "15 May, 2021",
        "context": "You couldn't pay me enough $$ to live in either of those states...",
        "good": "12",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "libbert4me",
        "time": "15 May, 2021",
        "context": "Lots of exceptional drought areas in the western US.  Expect more pain, or total relocation, for hardworking agriculture families.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rightside101",
        "time": "15 May, 2021",
        "context": "They voted for Biden so I wish a plague on their houses.",
        "good": "6",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "greenbeanmean",
        "time": "15 May, 2021",
        "context": "I have driven the coast of California a few times. Why is it that I see rivers of fresh water flowing into the ocean?",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "BettyCO",
        "time": "15 May, 2021",
        "context": "Wake up libs. This is what happens when you keep voting liberals in. It doesn’t happen overnight. ",
        "good": "4",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "wamba",
        "time": "15 May, 2021",
        "context": "Worthless article as it offers no discussion of solutions.",
        "good": "2",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "badoggoodog",
        "time": "15 May, 2021",
        "context": "Once again a natural variation in the climate and they are not prepared yet they want to spend trillions and throw millions back into poverty in a futile attempt to “change the climate” rather than prepare for the inevitable changes and variations that occur and have occurred since long before man and will continue long after. \nDemocrats act as if this is the first drought in California. Why were they not prepared?",
        "good": "420",
        "bad": "7",
        "replies": []
    },
    {
        "user_name": "rukiddingme?152",
        "time": "15 May, 2021",
        "context": "West coast, you are a mess!",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "thebestisyettocome764",
        "time": "15 May, 2021",
        "context": "Drought -trumps fault\nBoarder crisis -trumps fault\nGas Shortage- trumps fault\nCOVID- trumps  fault\nRacism - trumps fault \nDefund police - trumps  fault\n\nEllen’s show canceled - trumps fault.\n\nSee the pattern here?\n\nRed States Rule! \nMAGA  AGAIN! 2024! ",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "FoxisrunbyRINOsandDems",
        "time": "15 May, 2021",
        "context": "These people  REFUSE to reason with US. Openly. Brazenly. With great unrelenting leftist hubris.\n\nSo what are we to do? Sympathy and Empathy are out.  What's left?",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "FoxisrunbyRINOsandDems",
        "time": "15 May, 2021",
        "context": "They vote Democrat.\n\nAnd God is a just God. \nCause and effect. \nAlso see every democrat city.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dogwood061",
        "time": "15 May, 2021",
        "context": "Just think of the state of the art desalination plants California and Oregon could have if they weren't spending the money on non functioning bullet trains, criminal trespassers and the homeless hoards liberalism created.",
        "good": "40",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "downtwoearth",
        "time": "15 May, 2021",
        "context": "Wind farms are changing the way rain clouds get blown in",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Atlasshrugged2020",
        "time": "15 May, 2021",
        "context": "Nefarious ploy to crush the farmers once and for all",
        "good": "6",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "tsb8c",
        "time": "15 May, 2021",
        "context": "Still \"Ridin' with Biden\"? They're walking in the east due to no gas and nothing to drink in the west due to no water. Leave it to lefties to manage themselves into oblivion.",
        "good": "22",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "koofasa",
        "time": "15 May, 2021",
        "context": "This is what happens when you try to manipulate Mother Nature.  She won’t have it.",
        "good": "19",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tphilly5",
        "time": "15 May, 2021",
        "context": "You get what you vote for.  Got to protect baby smelt so can’t build a proper water management system.",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "NeedAmericaFirstParty",
        "time": "15 May, 2021",
        "context": "Must be due to the air pollution caused by BLM and ANTIFA burning down the cities.",
        "good": "8",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "socialistmao",
        "time": "15 May, 2021",
        "context": "After Oregon and California voted for a total idiot, their whining is falling on deaf ears.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "DruidSupporter",
        "time": "15 May, 2021",
        "context": "No climate change, everything going swimmingly! Oops.",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "montysan",
        "time": "15 May, 2021",
        "context": "Blue states can't manage natural resources because they let their bleeding hearts get in the way of doing things the right way.   Liberal science isn't based on facts its based on drama.",
        "good": "20",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sharpster",
        "time": "15 May, 2021",
        "context": "Little joe doesn't think this is a problem. After all, his pants are constantly wet and he doesn't know why.",
        "good": "6",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "LordBaltimore",
        "time": "15 May, 2021",
        "context": "In Oregon they're still pondering why there seem to be no LGBTQ fish and what to do about it.",
        "good": "23",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "brunsk42326",
        "time": "15 May, 2021",
        "context": "I have an idea, let's bring millions of people from other country's here. ",
        "good": "31",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "FoxisrunbyRINOsandDems",
        "time": "15 May, 2021",
        "context": "Lefties are doing for America what they did for the Amazon.\n\nDon't be a Xenophobe.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "BlueBulb",
        "time": "15 May, 2021",
        "context": "it can always get worse",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "independent1984",
        "time": "15 May, 2021",
        "context": "It didn’t rain in Southern or Eastern Oregon last year either, was that Trumps fault?",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "askmenow7",
        "time": "15 May, 2021",
        "context": "Well this is just more land to build apartments on.  Those antifa/BLMers burned down Portland, they need some place to live while they plot their next uprising.",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "GQP_Warrior",
        "time": "15 May, 2021",
        "context": "At least the GQP believes that humans have no impact on the climate",
        "good": "0",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "Sadbuttrue458",
        "time": "15 May, 2021",
        "context": "....and we're only into Joe's fourth month....\n\n...God help us.",
        "good": "22",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "clype",
        "time": "15 May, 2021",
        "context": "If Biden's goal is to correct climate change by the year 2050, why would any lib/dem want to spend tax dollars when AOC said the world will end in 7 more years?",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "OlivePlane",
        "time": "15 May, 2021",
        "context": "Why does fox always label the “far right” but ignore the “far left”? The Capitol people were rioters, but yet the people in Seattle, Portland, LA, San Francisco, Denver, Chicago, Baltimore, Kenosha, ... were protesters... after Billions of dollars of damage.",
        "good": "13",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rambolives",
        "time": "15 May, 2021",
        "context": "How do liberals solve a water shortage? \nInvite tens of thousands of thirsty illegals to come live there.",
        "good": "12",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rightside101",
        "time": "15 May, 2021",
        "context": "Democrats were warned this would happen and IGNORED the warnings.  You  can’t fix stupid.",
        "good": "10",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "CyanBucket",
        "time": "15 May, 2021",
        "context": "You guys start doing your rain dance I'll go find my divining rod. We're going to need all the help we can get.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "observer101",
        "time": "15 May, 2021",
        "context": "Here's an IDEA!   Most communities have \"water/waste treatment plants that process all waste waters.  After treatment that water is pumped underground, or into the ocean... In some areas of the country that same \"TREATED waste water\" is sent to a \"secondary treatment plant\" and the water coming from that is about 98% clean, and is then USED to irrigate golf courses, and some \"farming\" areas.... THAT WAY THE WATER IS REUSED, and FILTERED by mother nature, RATHER THAN BEING LOST FOREVER.... The same could be done in the west.... THNK AHEAD A BIT.....",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "johnny421",
        "time": "15 May, 2021",
        "context": "This is what happens when liberals are in-charge.  They've been destroying damns in the Pacific Northwest for decades.  Huh?  Droughts happen.  Would be nice to have a large storage of water when that happens.  I wonder how you go about doing that?",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rightside101",
        "time": "15 May, 2021",
        "context": "Should have built the reservoirs that were predicted to be needed over 50 years ago. I love watching Democrats suffer because they are idiots.",
        "good": "18",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "thinkertoy",
        "time": "15 May, 2021",
        "context": "Another classic example of our government at work.  Undoing what Mother Nature created because they thought they knew better and resources were unlimited.  Morons.  This is a reason to keep government control at a minimum.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "socialistmao",
        "time": "15 May, 2021",
        "context": "The real reason is the homeless need a bathtub.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "peterparker123",
        "time": "15 May, 2021",
        "context": "according to climate changers, the earth has survived 4billion years, gone thru many changes already, but its somehow a big deal now? yeah okay! even using their own evolution logic, it makes zero sense.\n\nthe Truth is, the earth was Created 6thousand years ago, made perfectly, then ruined by sin. now this earth WILL pass away with a great heat,will be burned up as predicted in the Bible, and a new heaven and a new earth will be made. \n\nJesus is the Way!!!",
        "good": "4",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "visionstatement",
        "time": "15 May, 2021",
        "context": "The reason this is happening is because they did not rake their forests",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "LOGIC372",
        "time": "15 May, 2021",
        "context": "Another Boarder Crisis, hang on Oregon, Harris is on her way.......",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "abraham12",
        "time": "15 May, 2021",
        "context": "Since the 1990's, California DEMOCRATS have continued to REFUSE to build additional reservoirs, resulting in more and more water shortages.  While California's population has grown in this 25-30 year period, California's reservoir capacity has NOT.\n\nNo surprise California has WATER PROBLEMS.  These are POLITICAL WATER PROBLEMS and won't be solved until Democrats quit trying to buy water from other states, much like their \"electricity brown out and black outs,\" which have been caused by California thinking they can BUY instead of generate more electricity.",
        "good": "777",
        "bad": "26",
        "replies": []
    },
    {
        "user_name": "84engineer",
        "time": "15 May, 2021",
        "context": "Note that the government is protecting the suckers at the expense of everyone and everything else.",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ranger911",
        "time": "15 May, 2021",
        "context": "OVER-POPULATION.....OVER-FARMING......NOT ENOUGH WATER.......\n\nNOW YOU ARE PAYING THE PRICE......\n\nYOU KNEW WHAT THE PROBLEMS WERE AND DECIDED TO IGNORE THEM FOR POLITICAL PURPOSES !!!\n\nENJOY !!",
        "good": "9",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "earthlingsoneandall",
        "time": "15 May, 2021",
        "context": "Progressive's mismanage just about everything, yet they still believe that they can control the weather and nature itself.",
        "good": "39",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jqk582",
        "time": "15 May, 2021",
        "context": "Nothing to do with climate changes. Everything to do with \"federal regulators\" attempting to scuttle the economic infrastructure. Isn't it time for that overdue revolution that Jefferson spoke of from time to time?",
        "good": "63",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "j682",
        "time": "15 May, 2021",
        "context": "They left one major subject out. With all that water no longer available, small fires will be a big issue. Just imagine what the big fires will be.",
        "good": "36",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "americanfirst841",
        "time": "15 May, 2021",
        "context": "I have an Idea:  Build a series of dams on the various rivers to hold excess water for the years that are dry.    You can fish it. Drink it. Use it to make power even.",
        "good": "44",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "occer",
        "time": "15 May, 2021",
        "context": "You can't educate a liberal. They will hand over Billions to pay for illegals when those Billions could solve water problems forever. Let them suffer.",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Comeinrangoon",
        "time": "15 May, 2021",
        "context": "Once again, the fed-ups in action.  Incompetent, unaccountable, uncontrolled.  ENOUGH!",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "MrBuckFiden",
        "time": "15 May, 2021",
        "context": "how is biden going to fix this?",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "FoxisrunbyRINOsandDems",
        "time": "15 May, 2021",
        "context": "Dems have sent in their crack water team.\nThe flight from Flint arrives later today.",
        "good": "19",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "StopTheSqueal2021",
        "time": "15 May, 2021",
        "context": "The drought is affecting the entire West including the red states of Arizona and Texas.  \nBut don't let that get in the way of a little California bashing.\nFox knows how to trigger its sheep.",
        "good": "0",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "AppalachianAmerican!",
        "time": "15 May, 2021",
        "context": "You elect Democrats and then complain about it. For years environazis have forced more and more water to be dumped into the ocean. And now you’re dry. ",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "thegreatunwashed164",
        "time": "15 May, 2021",
        "context": "Stories about West Coast droughts really irrigate me.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "MajorBubba018",
        "time": "15 May, 2021",
        "context": "If we're lucky a bunch of Libs will die of thirst and starvation.",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "pmoss",
        "time": "15 May, 2021",
        "context": "Maybe Mayor Wheeler and ANTIFA can burn down the guvmint’ bldgs and open it back up until it runs dry then protest about who stopped the rain.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "whowuddathunk",
        "time": "15 May, 2021",
        "context": "Bill Gates is behind all of this.  Crush the farmers and he will swoop in and 'steal' their farms for pennies on the dollar.  After that, the flood gates will be open and there will be an abundance of water.",
        "good": "5",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "wiseowl032",
        "time": "15 May, 2021",
        "context": "So the US government redirected water years ago to create farm land and now Mother Nature is kicking back so the same government is trying to reverse their earlier decision thereby hurting the farmers. But liberals still think the Federal Government is the best thing since sliced bread. Insanity!",
        "good": "13",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "pelicanbrief",
        "time": "15 May, 2021",
        "context": "that's not a jet boat as described in the picture .. what happened to journalism? .. oh alternative fact ..    my bad !!",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "recorddeathsbodybagbiden",
        "time": "15 May, 2021",
        "context": "Awesome means this summer they will deal with being turned to ash",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "GQP_Warrior",
        "time": "15 May, 2021",
        "context": "Turn the wind turbines backwards to draw rain clouds toward the coast",
        "good": "10",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "allenc802",
        "time": "15 May, 2021",
        "context": "Ma nature has had just about enough of antifa & blm. She figures if she kills everything she'll get at least some of the filth",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "Ididn’tdoit833",
        "time": "15 May, 2021",
        "context": "People who believe they can plan better than Mother Nature always f it up. 2/3 of this planet is water. Thats not enough?  If Biden wanted an infrastructure project, it’s not social programs, it’s this problem. Use the money the Democrats have stashed away for election year vote purchases to build the desalination treatment plants. ",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "AZConservative1",
        "time": "15 May, 2021",
        "context": "California environmental policy has prevented any new reservoirs from being built for decades — despite a huge increase in the state’s population.  The dems have done this to themselves.",
        "good": "80",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "memefirst",
        "time": "15 May, 2021",
        "context": "Another excellent example of cumulative effect, of a government run by Democrats.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "CyanToast",
        "time": "15 May, 2021",
        "context": "biden is in charge of this mess.\n\ndemocrat cultists voters are solely responsible.",
        "good": "5",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "independent1984",
        "time": "15 May, 2021",
        "context": "I live in Eastern Oregon, the drought is real, it’s barely rained the last two springs and we only got one snow storm",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "chipwatson",
        "time": "15 May, 2021",
        "context": "Is this God punishing the godless?",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "t9ekeuy3",
        "time": "15 May, 2021",
        "context": "StupidASS MAGAs can't read.....The entire region is in extreme or exceptional drought, \nthere is NO water to divert, that river feeds 2 STATES\nyes, it is climate change - but hey, F it, let them all move to TX and suck up the water there",
        "good": "0",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "rightside101",
        "time": "15 May, 2021",
        "context": "Watching more towns burn because of Democrat  policies will be fun. You know the 50 billion dollars the libs forced the utility company to pay to the residents of the town of Paradise all went to the lawyers who donate to only to Democrats. Lol. Enjoy. The state Democrats won’t let the utility companies cut down trees around the power lines so more will homes will burn in this drought.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Peelbacktheonion936",
        "time": "15 May, 2021",
        "context": "California drained their water table.  This problem has been going on for decades.   The ground has sunk by feet in areas.  The greedy took till there was no more.",
        "good": "9",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "DemsareEvil205",
        "time": "15 May, 2021",
        "context": "maybe the west coast will dry up and blow away, far far away, take your trash and politicians with you, don't feel sorry for them",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ClassicConservative",
        "time": "15 May, 2021",
        "context": "If trump shut off the water the libs would blow a gasket... Biden does it and it’s the wildlife paying their “fair share” ",
        "good": "12",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "djohnson",
        "time": "15 May, 2021",
        "context": "Blow up the dams , the salmon were there first , or are the democrats turning into mean old republican's .  Besides the climate doom Sayers can't say anything, this has happen in the past , 127 years ago.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "TheBenightedworldofDems",
        "time": "15 May, 2021",
        "context": "All these man made problems are not connected to Global warming, send John Kerry he’ll fix it",
        "good": "7",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "john.howard",
        "time": "15 May, 2021",
        "context": "\"A severe drought is creating a water crisis not seen in more than a century\"\n\nSo don't go blaming 'global warming' or coal for this.",
        "good": "20",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "liberaser",
        "time": "15 May, 2021",
        "context": "It's strange how Earth works, as when some areas experience droughts, while other places in our World will receive too much rainfall.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "johnny421",
        "time": "15 May, 2021",
        "context": "It would sure be nice to have a bunch of reservoirs right now in Oregon.  Oh wait, the Dems blew them ALL UP!!!",
        "good": "8",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "super_decathlon",
        "time": "15 May, 2021",
        "context": "I think California should spend hundreds of billions of dollars more on its \"virtual\" high speed rail. AND never never invest in reservoirs or water management.",
        "good": "77",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "ktmer",
        "time": "15 May, 2021",
        "context": "The land of many liberals and government control can never seem to manage their own house.  Well good for them, they would rather step over dollars to pick up pennies because pennies make them feel good.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "razecs",
        "time": "15 May, 2021",
        "context": "Groupthinkers like change except when it's the weather. \n\nChange boys into girls and girls into boys, that's a great idea. \nThe weather changes by 1 degree and isn't exactly the same as it was yesterday but follows a regular weather cycle? It also upsets Greta Thunberg? We need trillions of dollars to pretend to stop it.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "mrl!btard",
        "time": "15 May, 2021",
        "context": "they are communist, who cares but other commies.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "merckx576",
        "time": "15 May, 2021",
        "context": "Global climate change.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "tsudonymn",
        "time": "15 May, 2021",
        "context": "Politicizing nature never goes well. In time, the politicians die but the damage they do lives a long, long time.",
        "good": "9",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "canmac",
        "time": "15 May, 2021",
        "context": "Amazing, talk about infrastructure, why not convert some water flow westward and avoid flooding in areas such as Winnipeg, Canada.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rebel",
        "time": "15 May, 2021",
        "context": "California is a mess!",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bufordtpisser",
        "time": "15 May, 2021",
        "context": "Best way to tell if a program will fail is if it has the word government in its name.",
        "good": "33",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "PurplePuzzle",
        "time": "15 May, 2021",
        "context": "It's no problem for me, I love the heat. Oregonians should be glad their state is finally drying up! It's such a soggy wet mess most of the time anyway. It's the dirtiest state I've ever seen too! You environmentalist are doing a horrible job, clean that mess up!!",
        "good": "3",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "Sniffy_McBiden",
        "time": "15 May, 2021",
        "context": "maybe they (BLM) should stop setting so many fires and wasting water?",
        "good": "10",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "pelentan",
        "time": "15 May, 2021",
        "context": "So the city-folks will get their water.  But the farmers won't.  Any question on what type of \"government\" stole DC?",
        "good": "14",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "holden659",
        "time": "15 May, 2021",
        "context": "Better build another canal to drain the NORTHERN CALIFORNIA VALLEY of it's water.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "SchoolingLiberals",
        "time": "15 May, 2021",
        "context": "All the protected birds, fish etc. are thriving.  What's the problem?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "irregularjoe",
        "time": "15 May, 2021",
        "context": "..............Biden is sending Kamala to the Oregon/ California border , saying residents there could use a good laugh....",
        "good": "16",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "armjr",
        "time": "15 May, 2021",
        "context": "I think the problem is perfectly obvious to any thinking person.  There needs to be more diversity in the management levels of the U.S. Bureau of Reclamation...",
        "good": "17",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "StopTheSqueal2021",
        "time": "15 May, 2021",
        "context": "Republicans are so funny.\nEvery problem we now face is the current president's fault because it's on his watch.\nWhile every positive action like ending the pandemic and the economy roaring back is just leftover actions from the previous president.\n\nBut we heard this after Obama and Clinton's presidencies too.  Republicans trash the country and Democrats fix it.  But the right wants to blame the left and take credit where they can.",
        "good": "0",
        "bad": "19",
        "replies": []
    },
    {
        "user_name": "rightside101",
        "time": "15 May, 2021",
        "context": "Camille Calimlim Touton, is a Democrat who has no idea what she is doing. Another Xiden loser.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "AllIcansay767",
        "time": "15 May, 2021",
        "context": "So sad. Those are such beautiful states to visit. Just too liberal to live in.",
        "good": "17",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Mountainsmoma",
        "time": "15 May, 2021",
        "context": "So global warming was worse 114 years ago?",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "abbynormal2021",
        "time": "15 May, 2021",
        "context": "I wonder if it’s time to stop letting millions of immigrants flow over the border? Keep expanding the population , we need ever more irrigated farmland to feed everyone",
        "good": "14",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "911carbon601",
        "time": "15 May, 2021",
        "context": "Oh, but California can sell water to Nestle. After all they are in business to sell water commercially. The state was complaining because Nestle was using more water than they were paying for. Hmmm. California can afford to sell their water even though there is a shortage. Quit complaining then.",
        "good": "21",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Greg1969",
        "time": "15 May, 2021",
        "context": "It is almost as if God has turned his back on the West Coast.",
        "good": "11",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "crcnwadavid",
        "time": "15 May, 2021",
        "context": "Clearly due to coronavirus.....Or systemic racism......Or the tyrannical patriarchy......Or whatever else Democrats can dream up to throw trillions at it and skim as much as they can.......",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bushwhacker99",
        "time": "15 May, 2021",
        "context": "Government involvement is why the Aral Sea dried up under socialism with if voters don’t elect more conservatives it will happen here",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "raregenx'er",
        "time": "15 May, 2021",
        "context": "10's upon 10's of millions of people flocked to the west coast over the last century or so due to beautiful scenery and great weather. What they didn't realize was that during most of this period, the 20th century, was an unusually wet period for that region. It is now reverting back to what it normally was for millennia. a semiarid dessert.  \n\nWait until the \"big one\" hits. The region is waaaay overdue for a massive earthquake. Remember earthquakes.  \n\n\"Flyover country\" not seeming so bad now.",
        "good": "34",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "mydog'shumandaddy",
        "time": "15 May, 2021",
        "context": "Stop making babies.",
        "good": "1",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "questions4u",
        "time": "15 May, 2021",
        "context": "So is this proof positive that the environmentalist have no idea how to manage in the real live world?\nYes it does.",
        "good": "14",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Sniffy_McBiden",
        "time": "15 May, 2021",
        "context": "it's raining in my red state, life is good.",
        "good": "19",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "holden659",
        "time": "15 May, 2021",
        "context": "I remember, as a little kid back in the early  '60's, walking around out on the surface of Goose Lake, which crosses the Oregon-California border.  Much of the lake was covered with several inches of salt.  And, you could feel the water moving around under each step.",
        "good": "17",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "vn632",
        "time": "15 May, 2021",
        "context": "Water, water everywhere and not a drop to drink.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Blood_on_Dems_Hands",
        "time": "15 May, 2021",
        "context": "Another Biden crisis. Democrats will propose billions of dollars for abortions in Africa to solve the issue.",
        "good": "23",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "realjms13",
        "time": "15 May, 2021",
        "context": "I’ll trade you gasoline for water. Meet me in Saint Louis",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "john.howard",
        "time": "15 May, 2021",
        "context": "Even though its just Oregon, I still feel bad for the last vestiges of decent Americans still living in that state.\n\nWhen Portland burns to the ground because all the fire hydrants are dry, I won't shed many tears.",
        "good": "38",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "GoldSubmarine",
        "time": "15 May, 2021",
        "context": "Elizabeth on her way to do a rain dance?   no worries joe may subsidize a water pipeline from Canada for a 10% cut while using money for leverage  that was never his. his son may run the operation.",
        "good": "15",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "buggsy1",
        "time": "15 May, 2021",
        "context": "Trumps fault. Everything else  is.",
        "good": "0",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "ljtalaska079",
        "time": "15 May, 2021",
        "context": "Look at the wealthy having large swimming pools filled all the way up with water and maintained in California and Oregon.  They have a different set of rules.",
        "good": "47",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Atlasshrugged2020",
        "time": "15 May, 2021",
        "context": "cut off the gas , cut off the water , get a vaccine , close your business .. see how easy this is",
        "good": "14",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Atlasshrugged2020",
        "time": "15 May, 2021",
        "context": "If you all get vaccinated we will turn the water back on .. see how easy this is",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ImFromAmerica",
        "time": "15 May, 2021",
        "context": "\"Drought, food shortages, war in the middle east, ten fold illegal immigration this month, drugs flowing in... none of this matters.  Everyone is a racist, let's focus on that!\"  - any CNN news anchor.",
        "good": "23",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "americanfirst841",
        "time": "15 May, 2021",
        "context": "I recommend we build a series of dams to save water for drought years.  Saves the fish too.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jblakster",
        "time": "15 May, 2021",
        "context": "A major fix was proposed to California...trap and divert the trillions of gallons of snow and rain runoff to the reservoirs. The democrats refused it because tree huggers said it would damage some ecosystems. Instead, it all runs into the ocean. ",
        "good": "58",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "templarknight484",
        "time": "15 May, 2021",
        "context": "can't have ours dems go to another country!",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "fredley",
        "time": "15 May, 2021",
        "context": "This is what happens when you have millions  of people living in a desert.  This was bound to happen eventually with or without climate change.  Irrigation and farming in this region have never been sustainable with such large water demands by various groups. ",
        "good": "122",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "yonken",
        "time": "15 May, 2021",
        "context": "I saw the title and figured it was Maxine ....Waters that couldn't get any worse.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "usafflyboyc5",
        "time": "15 May, 2021",
        "context": "It won’t be long, before hearing how much money needs to be put in for climate change.  Even though they had the same problem over 100 years ago. Sounds more like a cycle.",
        "good": "802",
        "bad": "17",
        "replies": []
    },
    {
        "user_name": "IllegitimateJoe#NOTMYPRESIDENT!",
        "time": "15 May, 2021",
        "context": "It's a complicated problem but luckily the solution is simple.\n\nVote Republican.",
        "good": "49",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "earlofoil",
        "time": "15 May, 2021",
        "context": "Like California----how many water storage projects did they not approve --- because of environmentalist.",
        "good": "24",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "abraham12",
        "time": "15 May, 2021",
        "context": "So go tell the Democrats in the statehouse, Oregon or California.",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "saysitasiseeem",
        "time": "15 May, 2021",
        "context": "Damn... I'm surprised no one blamed President Trump for this...",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "recorddeathsbodybagbiden",
        "time": "15 May, 2021",
        "context": "Old saying goes you get what you vote for and elections have consequences",
        "good": "32",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "k9andcannons",
        "time": "15 May, 2021",
        "context": "The reason that there is a catastrophic impact to the environment is because of the man made, government controlled irrigation system. Man should live within the means of the environment, not profoundly change it in such a manner that it can no longer support itself nor the population of people within it.",
        "good": "1.1K",
        "bad": "43",
        "replies": []
    },
    {
        "user_name": "earlofoil",
        "time": "15 May, 2021",
        "context": "And how much money is being spent on hi-speed rail from LA to SF?",
        "good": "16",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "33:12Psalm",
        "time": "15 May, 2021",
        "context": "Remembered when everything bad was TrumpF's fault,\nNOW the hatred from the other side.\nITS Biden's fault.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tedstriker007",
        "time": "15 May, 2021",
        "context": "But hey, let's continue to allow two million legal immigrants and millions more illegals freely waltz in. Unless conservatives pick up environmentalism and use it to bludgeon the liberals, we won't have a country left.",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Sniffy_McBiden",
        "time": "15 May, 2021",
        "context": "tell Nancy to quit watering her lawn",
        "good": "12",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "grumpers",
        "time": "15 May, 2021",
        "context": "but those dopes they keep electing spend $billions on choo-choo's that go nowhere.\nComplete morons, all...",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jcc62",
        "time": "15 May, 2021",
        "context": "Oregon’s Klamath County is experiencing its driest year in 127 years...\n\nso it was drier in 1894...funny that was before ford made cars (1902-03)...\n\nand we are causing \"climate change\"",
        "good": "23",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cmac66",
        "time": "15 May, 2021",
        "context": "Shut down the farms. It happens. Remember the dust bowl?\nIf you can shut down the oil and gas industry for the environment, you can certainly shut down some California potato farmers for the same reason",
        "good": "12",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "iseestorms58",
        "time": "15 May, 2021",
        "context": "Don’t tell me that god isn’t punishing the west coast for their major sins and anti Christian views. ",
        "good": "8",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "john.howard",
        "time": "15 May, 2021",
        "context": "How about a pipeline from Canada that transfers water, instead of oil?",
        "good": "3",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "dougintexas",
        "time": "15 May, 2021",
        "context": "The Feds have an answer for everything.  What are the farmers going to do with a few million dollars in relief funds.  But bottled water?",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "americanfirst841",
        "time": "15 May, 2021",
        "context": "All that water from the rivers just flows into the ocean . What a waste.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "crustini123",
        "time": "15 May, 2021",
        "context": "Weather is cyclical.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Tombstone324",
        "time": "15 May, 2021",
        "context": "As usual California can screw anything up with their liberal policies !",
        "good": "19",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "athinker",
        "time": "15 May, 2021",
        "context": "Request letters for fire fighters to serve in Western states have already been sent out to help with upcoming wildfires.  Please be careful in words and deeds as no one wishes another out of control wildfire to damage landscape or lives.  Thank you to all working to prevent this type of stuff in the future as individuals, groups, agencies and politicians work to bridge our ecosystems management into the future.   Upgrading practices certainly benefits everything and everyone.",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "maso1947461",
        "time": "15 May, 2021",
        "context": "It all just comes down to bureaucratic inefficiency overpowering the efficiency inherent in the free market system and it is because of the hidden agenda behind the public school system that has brainwashed the last two or three generations of useful idiots. It's that simple. It really is...!",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "asfreedomflies",
        "time": "15 May, 2021",
        "context": "Ironic that Oregon is experiencing a drought when it's total rainfall over the past 12 months is on the high side of average at 27.4 inches of rainfall. \n\nSo now that we know Oregon is getting rain, where is the rain going after it hits the ground? \n\nDid the democrats in charge intentionally drain the main reservoirs at an accelerated rate to cause trouble for the working class down stream?",
        "good": "799",
        "bad": "36",
        "replies": []
    },
    {
        "user_name": "Poopypantscheated",
        "time": "15 May, 2021",
        "context": "But I thought water levels were rising and we were all going to drown with the melting of the glaciers?",
        "good": "22",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "JamesTittle",
        "time": "15 May, 2021",
        "context": "Meanwhile we are sending billions and billions to other countries! ",
        "good": "23",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "redryder996",
        "time": "15 May, 2021",
        "context": "The problem is mismanagement and over development on the west coast, not climate change. In the 1930s, California was granted permission to build an aqueduct to take water from the Colorado river. It was a much debated, controversial decision then and now. Given the dry summer climate, it is impossible to provide sufficient water year around to satisfy the agricultural needs and the over population needs. Climate liars turn a blind eye to history.",
        "good": "64",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "duraman",
        "time": "15 May, 2021",
        "context": "People use a story like this to push climate change and you always read a weather related incident as the worst since a previous date in this case 127 yrs. So 127 yrs ago it was worse.",
        "good": "14",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "wokeuptoday",
        "time": "15 May, 2021",
        "context": "This is Trumps fault for withdrawing from the Paris Climate Agreement.  Climate change is real!",
        "good": "0",
        "bad": "20",
        "replies": []
    },
    {
        "user_name": "recorddeathsbodybagbiden",
        "time": "15 May, 2021",
        "context": "When you spend your tax dollars on endless socialist social programs and not on what's necessary to keep the state running you get  issues  like this ... Liberal incompetency at it's best",
        "good": "27",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "putzthedog",
        "time": "15 May, 2021",
        "context": "The Green New Deal will fix this, LOL!",
        "good": "13",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "maso1947461",
        "time": "15 May, 2021",
        "context": "It all just comes down to bureaucratic inefficiency overpowering the efficiency inherent in the free market system and it is because of the hidden agenda behind the public school system that has brainwashed the last two or three generations of useful idiots. It's that simple. It really is...!",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "kilobravo556",
        "time": "15 May, 2021",
        "context": "Wildfires, drought, pestilence, violence. I just can't wait to vacation there.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "error": "error"
    },
    {
        "user_name": "Anti-Liberalism",
        "time": "15 May, 2021",
        "context": "Trump was blamed for hurricanes and tornadoes months after he took office.....so this is Biden's fault, right?",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "PurpleApple",
        "time": "15 May, 2021",
        "context": "It could be worse  you could all be like India at this moment.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "refelec",
        "time": "15 May, 2021",
        "context": "It could be worse, Biden is still president!!!!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "shipmatemcm8",
        "time": "15 May, 2021",
        "context": "Probably used all the water extinguishing the fires in Portland.",
        "good": "8",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "recorddeathsbodybagbiden",
        "time": "15 May, 2021",
        "context": "Hey libs I have an idea, lets run a pipeline from all those melting glaciers down to California and use the water to fix your failed states. That way the oceans will not rise and you will not burn to a crisp..just an idea",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dek",
        "time": "15 May, 2021",
        "context": "Let me guess, are these Democratically run states? I feel terrible, not.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "CyanScissors",
        "time": "15 May, 2021",
        "context": "It's those blasted white supremacists again.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "deepthought",
        "time": "15 May, 2021",
        "context": "We are the government and we are here to help you...",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Gene28570",
        "time": "15 May, 2021",
        "context": "Welcome to Venezuela Norte.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "RedPuzzle",
        "time": "15 May, 2021",
        "context": "When man plans, God laughs.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rforreason",
        "time": "15 May, 2021",
        "context": "Another case of Democrats Destroying Everything they Touch.",
        "good": "10",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "stormyd",
        "time": "15 May, 2021",
        "context": "So I am going to guess that the Salmon prices will be much lower this summer, right??",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Sniffy_McBiden",
        "time": "15 May, 2021",
        "context": "hey all you fakes in CA....Water is more important than Botox.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "PurpleCoathanger",
        "time": "15 May, 2021",
        "context": "It's been a dry spring.....funny how the weather works...",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sender9999",
        "time": "15 May, 2021",
        "context": "Humans do impact the environment, 40+ million  more than in 1894.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "snowflakeslayer997",
        "time": "15 May, 2021",
        "context": "Just think... the worst in 114 years... if we would have had the female dog AOC around back then, we wouldn’t have this problem! This area would be a liberal utopia flush with water fish and Democrats.... ahh What a paradise",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ronfloth",
        "time": "15 May, 2021",
        "context": "Direct $ from stupid liberal spending to desalination of seawater. No- brainer",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "PurplePuzzle",
        "time": "15 May, 2021",
        "context": "Kate Brown is a mo Ron. She just keeps copying what California does and expects a different outcome.\nHer and Ted need to go, quickly!",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "brjn2",
        "time": "15 May, 2021",
        "context": "The first-impulse Democrat answer to every problem: \"No you can't have __X__.\"\nIn contrast , Republicans and Conservatives look for another source of __X__ or a substitute that will work well enough to get through the crunch.",
        "good": "12",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Jaguarized076",
        "time": "15 May, 2021",
        "context": "Now is the time to invest in land in Klamath County!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "144point9or99point83plus",
        "time": "15 May, 2021",
        "context": "The problem is that the fish are confused.  1st Fauci told them that a mask wouldn't work against (bacteria known as C. shasta); then he said to wear a mask, then 2 masks, now no mask.  What's a fish to do?",
        "good": "42",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "saynotosubliminalmessaging",
        "time": "15 May, 2021",
        "context": "Keep letting the illegals in by the thousands every day so we can have an even bigger water shortage.",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Pepper_",
        "time": "15 May, 2021",
        "context": "AOC: “Climate Change!” All preventing “climate change” is is the modern day Tower of Babel. It is man trying to play God to prevent natural disasters such as these. I’m not saying they are not detrimental to the environment; I am only saying that these things happen, history has shown that the earth has gotten warmer and warmer throughout history.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "vietnamvet034",
        "time": "15 May, 2021",
        "context": "Where I live in Colorado it too is experiencing a drought. We are experiencing a dry weather cycle, nothing more, nothing less.",
        "good": "12",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "texmom32",
        "time": "15 May, 2021",
        "context": "Wonder how this affects the legal grower of weed?  Are they getting their water needs met? Fluff food crops and wildlife as long as folks can get high and the state can charge the extra tax.",
        "good": "35",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "earlofoil",
        "time": "15 May, 2021",
        "context": "Just think how many dams could have been built with the money being spent on hi-speed rail from LA to SF",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "AG-7947",
        "time": "15 May, 2021",
        "context": "Simple fact.....farming anywhere that requires irrigation to produce crops is a risky business. They grow rice in California. Anyone see the picture here?",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "elapache'",
        "time": "15 May, 2021",
        "context": "The O'biden Administration will do what has bee done for Kalifornia for decades, Steal from the producers, providers and workers and Give to Kalifornia.",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "polban1",
        "time": "15 May, 2021",
        "context": "Our planet is in a state of precession, it wobbles like a top. This is a known and accepted fact of science. The cycle is estimated to be around 26,000 years... and the result is that our \"weather sectors\" move around the planet. It's why we have seashells in deserts, ancient forests under lakes and oceans, ice carved valleys in warm climates, etc.  There is nothing new or strange or unknown about this. The planet doesn't stop this process because humans built something near water at the moment.",
        "good": "1.6K",
        "bad": "72",
        "replies": []
    },
    {
        "user_name": "itsupsidedown",
        "time": "15 May, 2021",
        "context": "California needs to build more reservoirs. 80% of the water runs out to the ocean. Environmentalist refuse to allow new reservoirs",
        "good": "7",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "AirforceVet55",
        "time": "15 May, 2021",
        "context": "Severe droughts, savage hurricanes, earthquakes, Israel under assault, inflation, border crisis, riots in Blue states, Bumbling Biden in office...\n\nYou'd think that someone is trying to get our attention.",
        "good": "7",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "CU-Buffs",
        "time": "15 May, 2021",
        "context": "Biden replied, “Well, instead of harvesting crops or salmon, those people can go find good-paying jobs in Green Energy.”",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "enzo219",
        "time": "15 May, 2021",
        "context": "Constant droughts, power grid shortages, massive homelessness.  Hmmm...what should we do?  I know!  Let's have an open border policy because we need more people here dependent on government!  We'll promise FREE everything, harvest votes and remain in power forever!!!  - Gavin Newsome",
        "good": "15",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "George1970",
        "time": "15 May, 2021",
        "context": "It's refreshing to see a real newsworthy piece on Fox. Just reporting news that's important,  a river drying up, salmon and the ecosystem affected.  No sensationalised drama from Carlson or Hannity. A real good ( but unpleasant) news story.\n\nWell done Fox.",
        "good": "1",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "Sniffy_McBiden",
        "time": "15 May, 2021",
        "context": "maybe they can self appropriate Indian Rain Dancers?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "FigNooton",
        "time": "15 May, 2021",
        "context": "Forget the cities and the people who run them for a moment and think about the beauty of all that land and the surrounding area.  It really is beautiful country and part of our USA!  Anyone who appreciates fantastic wine from Oregon wine country can appreciate the fine product they produce.  It's always sad to hear when the land is mis-managed, but like everything else... if you break it...fix it!",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "conservativeaz",
        "time": "15 May, 2021",
        "context": "Liberal cities and states.  If people want to be homeless and check out of society.....let them.\n\nBut cut them off.  Let them do as they want, live off the land.  Let them make choices like the rest of us have to.  No free drugs or needles, no free food, no free alcohol.  If they want free food let them go to religious food banks who are so good at helping the needy for a short religious service.  They can decide.\n\nSpend you money on state infrastructure.  Maybe some of these homeless will decide it's not worth the aggravation and will get a job instead.  Think, income instead of constant outgo.  State tax revenue, too. \n\n You can't make them but you can make it more attireactive to work and produce instead of taking and sapping the tax payers.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "hotroddude",
        "time": "15 May, 2021",
        "context": "Biden hates wildlife...",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sef1902546",
        "time": "15 May, 2021",
        "context": "So let's see, what caused this?\nNatural cycling of the earth?\nMan-Made Glo-bull cooling?\nMan-Made Glo-bull warming?\nNaw, now I remember!\nAl Gore's second invention, Man-Made glo-bull climate change!\n\nTemperature goes up:  OMG! IT'S MAN-MADE GLO-BULL CLIMATE CHANGE!\nTemperature constant:  OMG! IT'S MAN-MADE GLO-BULL CLIMATE CHANGE!\nTemperature goes down:  OMG! IT'S MAN-MADE GLO-BULL CLIMATE CHANGE!\n\nScott",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "yasteril",
        "time": "15 May, 2021",
        "context": "Another good example of what happens when you put democrats in charge of something.",
        "good": "13",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jackovspades",
        "time": "15 May, 2021",
        "context": "Ya need MORE illegal aliens.  They'll help the water problem go away.",
        "good": "10",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "recorddeathsbodybagbiden",
        "time": "15 May, 2021",
        "context": "These people need to give up farming and get trained to do solar jobs and coding,  farming according to liberals is a low skill uneducated job that anyone can do",
        "good": "12",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "kswck",
        "time": "15 May, 2021",
        "context": "We can't give you water-that is our inventory. If we give it away, we will have nothing TO inventory.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "OliveCandy",
        "time": "15 May, 2021",
        "context": "Biden is flooding the nation with illegal immigrants who consume resources at the same time he is supposedly concerned about the climate.",
        "good": "7",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "erbappalachia",
        "time": "15 May, 2021",
        "context": "If they had run some pipes inland from the sea to a few key water sources, along with desalination plants, the crisis might not be near as bad. Just saying.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "misterbagel",
        "time": "15 May, 2021",
        "context": "Just more well-intended Government assistance. Where are the rational thinking people?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Alotta.Anger",
        "time": "15 May, 2021",
        "context": "So start a pipeline from the COLUMBIA river to the area.\nThe I-5 waterline.\nThe RR goes there, send tanker cars.\nDeal with it.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Zebulon1776",
        "time": "15 May, 2021",
        "context": "Is there anything still good in “the once great state” of California anymore, that liberal socialist government hasn’t destroyed?",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "guest1234567890173",
        "time": "15 May, 2021",
        "context": "\"Reclaimation\" District.   Says it all.  The disaster was created 100 years ago when the government and greedy business people thought they could overrule nature.  Nature usually wins.\n\n\nStop living in swamps and deserts.  Live where the free flowing water and naturally occurring dry land is, not where you want it to be.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bidenisanemptyshell",
        "time": "15 May, 2021",
        "context": "Better tax those salmon, too",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "lucid101",
        "time": "15 May, 2021",
        "context": "NO QUIET ON THE WESTERN FRONT.\nThe liberal Gestapo is still celebrating the election of the head of the BIDEN CRIME FAMILY in \nPortland, Seattle and also Denver. The burning, looting and shooting is continuing. No law and order, no bail and no jail. \nThe new America under JUNKYARD JOE.",
        "good": "7",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Sniffy_McBiden",
        "time": "15 May, 2021",
        "context": "the poor animals, going to die because of liberalism.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "jerryclc",
        "time": "15 May, 2021",
        "context": "I hope they don't move here.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "oldmanpops",
        "time": "15 May, 2021",
        "context": "So once again man in his infinite wisdom thinks they can do better than God. This is a perfect metaphor for Libs who think they know how to solves economic problems Unintended consequences will reap their ugly heads years down the road and the Libs will blame someone else.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "harrybonar3",
        "time": "15 May, 2021",
        "context": "Sound like we need is some more \"human Infrastructure\".",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "integridad",
        "time": "15 May, 2021",
        "context": "\"Must be global warming.\", I'll take climate change for $100, Alex. \nCouldn't be the draconian illiterate policies pushed by the Sierra Club and the Lefties in the country.",
        "good": "10",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "dalbur",
        "time": "15 May, 2021",
        "context": "Create lots of small pipelines from Northern Oregon to the area using the plastic straws that they have outlawed use of for drinking.",
        "good": "13",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "elapache'",
        "time": "15 May, 2021",
        "context": "How are NBC, CBS, ABC and CNN going to work Racism into this one?  Give it a bit, Waters will show up, and not the \"waters\" they need.",
        "good": "8",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "theobservers481",
        "time": "15 May, 2021",
        "context": "You gave 4 million to turn the gas pipeline back on, how much are you offering me to ask my Lord to turn the rain back on?",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "chillywilly88",
        "time": "15 May, 2021",
        "context": "That reservoir been drying up for over 20 years. They just crying cuz they can't use their jet boats in the water anymore.  Guess they better tell that mean ol Nancy to start using the out house.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "druzod",
        "time": "15 May, 2021",
        "context": "Disaster is Democrat leadership .... this always happens when they are in control",
        "good": "14",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "bidenisanemptyshell",
        "time": "15 May, 2021",
        "context": "Gee, its almost like millions of people amassing in a desert wasn't a smart thing",
        "good": "7",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "kswck",
        "time": "15 May, 2021",
        "context": "I am sure that California's policies have Nothing to do with this problem.",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "rhett2019",
        "time": "15 May, 2021",
        "context": "Cut off the supply to the west coast of California first......save the wildlife and salmon....at least they serve a good purpose.",
        "good": "7",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "editherudite882",
        "time": "15 May, 2021",
        "context": "The environmentalists want the artificial infrastructure out and wilderness in.  That is done by getting the consumption type people out.  If these people are gone, things will go back to natural.  The fish, eagles, wildlife will return.  Fires and drought are good at reducing the number of consumption type people.  Note the new type of people in California are willing to live in a box, occupy themselves with electronic devices, ride public transportation.  They are not the mountain men of 150 years ago.  The whole purpose for this is so that the ultra-elite will have more to enjoy.  The ultra-elite being the royals of previous times.",
        "good": "45",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "forrest142",
        "time": "15 May, 2021",
        "context": "More gloom and doom coming from fox, all in an attempt to drive fear in the Republican community and dive a wedge between republicans and democrats.  You’ll notice how any issues in a republican state, fox paints a much different view of the severity",
        "good": "0",
        "bad": "11",
        "replies": []
    },
    {
        "user_name": "elapache'",
        "time": "15 May, 2021",
        "context": "Global Warming, Global Warming,,,,uhh Climate Change, yea, that's it, Climate Change!",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "steve76",
        "time": "15 May, 2021",
        "context": "This crisis is by design.\nQuit the WEATHER MODIFICATION through CHEMTRAILS. \nTHE CAUSE.",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "lucid101",
        "time": "15 May, 2021",
        "context": "Critical Race Theory and Cancel Culture are what the liberal fascists care about along with sanctuary cities and open borders.\nTHE LIBERAL DESTRUCTION OF AMERICA CONTINUES.",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "nhglenn",
        "time": "15 May, 2021",
        "context": "Maybe they can farm Cactus ? This is what happens when one turns their backs on God and believe they are the higher power as it has happened many times in history. Maybe the cretins in Hollywood have the answers?",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "OilersSpill1199",
        "time": "15 May, 2021",
        "context": "178,000 illegals walked in last month, where do they go to the bathroom during their journey, on average 12 pounds of trash per illegal, you think you have an environmental issue? LOL, wait until Mays numbers come out 200,000 easy!",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "tuffngruff",
        "time": "15 May, 2021",
        "context": "Lord help us. Now we're in for another six months of liberal wackos whining about climate change.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Granite72",
        "time": "15 May, 2021",
        "context": "Systemic Racism . ( well isn't everything these days )",
        "good": "10",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "longdrive",
        "time": "15 May, 2021",
        "context": "Imagine that, a government run project, with virtually no oversight, literally drying up overnight.",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "PurpleBowtie",
        "time": "15 May, 2021",
        "context": "I'm guessing the illegals are all bathing in what's left",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "truthisbias3",
        "time": "15 May, 2021",
        "context": "there is more water in Oregon than needed,    this is a government that will do anything to appease the Chinese ,    Buy Chinese salmon,,,,,,,,,,,      Obama did the same for his coffee buddies.",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "stopthemadness368",
        "time": "15 May, 2021",
        "context": "Sounds like some folks need to get together and remove some “barriers” under the dark of night...",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Urbancide",
        "time": "15 May, 2021",
        "context": "Excessive population is the problem - driven by DemocRAT greed for power and control.  Imagine there was no transportation of food and energy sources into NYC.  Where would the millions of people living there get it.  They produce no oil, they produce no coal, the land and water is so contaminated with human waste and byproducts they can’t grow anything and the few remaining fish are too toxic to eat!  DemocRATs did this!  CA has had water issues for generations.  It’s a dry state!  Yet, DemocRATs want more and more people (voters) coming there!  When I was a young researcher I attended a short course on the Environmental issues the San Fransicko Bay taught by professors at Berkeley.  They whined and bemoaned the man-made environmental problems in the bay saying federal help was needed so they could use their resources to attract more business to the area.  And that’s what it is all about in DemocRAT run cities - increasing the tax base!  DemocRATs always need more money and when their people become tax dependents vs contributors they just get more people!  Problem is most of the people DemocRATs attract are new dependents!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "buzzkill2021",
        "time": "15 May, 2021",
        "context": "You can thank the enviro-fascists and Leftists for blocking dam construction over the last 60 years",
        "good": "3",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "earlofoil",
        "time": "15 May, 2021",
        "context": "I wonder if CA will require Tinseltown to not re-fill  their pools",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Sniffy_McBiden",
        "time": "15 May, 2021",
        "context": "I do CARE,  about the animals.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Watchfulvoter",
        "time": "15 May, 2021",
        "context": "This disaster is because all CA and OR have in Government are Democrats...They flood their states with illegal immigrants, which produces over population, over building, over use of the in ground water aquifers.  Then they fail to put in the required desalination plants or ANY long term planning.....but hey they have their (bird killing, ineffective) wind farm up....Dems are the worst leaders you could possibly elect..",
        "good": "10",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "maytrix306",
        "time": "15 May, 2021",
        "context": "Here in the northeast the spring has been cooler than usual and the water is just perking up out of the soil. I am still waiting for the water table to drop so I can mow the last 3 acres of lawn. I am not complaining, I choose to live here. If you choose to live in a desert then stop complaining about the lack of water.",
        "good": "8",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "race-american",
        "time": "15 May, 2021",
        "context": "The tennessee river is ruin by the TVA we have plenty of high priced electric but with dumping poop in the river the fish are not eatable",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "seafordva",
        "time": "15 May, 2021",
        "context": "The West Coast is Utopia! Yeah, right. You can have it Libs.",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "williamroot",
        "time": "15 May, 2021",
        "context": "This is infrastructure, how much of the administrations plan goes to addressing situations like this?",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tampabayboy",
        "time": "15 May, 2021",
        "context": "I thought all the strict CA regulations on emissions, energy alternatives, etc that were put in place decades ago would solve these environmental problems???",
        "good": "44",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "RedCoffee",
        "time": "15 May, 2021",
        "context": "For right now I would think about finding solutions to save the quality of the water. There may be things that could help. I am not a scientist, but I do have smaller scale filtration experience. I wonder if it would be helpful to pump the water with the bad bacteria through tankers (truck or train) filed with charcoal.  I would think that since this major issue recurs that water filtration stations should be built to reach the deepest parts of the water where the bacteria issue occurs. As water levels go down in the future, the filtration would be more effective because there would be much less to filter. Good bacteria keeps bad bacteria at bay. I know that is a lot of water, but life and commerce depend on the water supply and any filtration is an improvement over no filtration. I also wonder if there is a plant or anything that can be introduced to these waters that would use and cycle the bad bacteria. \nI do know that governments can't change the weather through redistribution of wealth, jobs and energy sources. Weather cycles change. They always have. They always will. What governments need to do is GOVERN. Be ready to adapt to changing weather conditions.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "GreenGoggles",
        "time": "15 May, 2021",
        "context": "Whole west coast is a mess.  They are supposedly the people of conservation and \"natural living\"  but they are just leftie hypocrites.  Especially the celebrities.  Bunch of losers.  And Portland and Seattle are just plain crazy cities.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "asfreedomflies",
        "time": "15 May, 2021",
        "context": "I'm sure Climate Change has much to do with this drought that isn't a real drought since Oregon's 12 month average is on the high side of normal.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "lockedandloaded",
        "time": "15 May, 2021",
        "context": "Time for a new system. if there was only a big pool of water to take water from...it's to simple to take the salt out of the ocean water...",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "CaptainHook",
        "time": "15 May, 2021",
        "context": "Water will be the end commodity that people will actually go to war for.  People have been fighting for water since the beginning of time and this will continue because water is life!  As our earth cycles through its natural processes certain areas will become drought stricken with other parts of the world will flood, just ask the dinosaurs about this matter---if you go to Washington a lot of them still live there in the Senate. Only thing we can do about this is CONSERVE -CONSERVE-CONSERVE our most precious resource WATER! This will require a lot of hardships but to maintain what we have it will be critical to our way of life!",
        "good": "8",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "ImFromAmerica",
        "time": "15 May, 2021",
        "context": "democrats see a dying fish.... this is horrible! open that valve and use all water available to flood the river, now!\n\nrepublicans see a dying fish.... hmm this is a problem, let's think of a realistic solution to solve this that doesn't cause a different problem somewhere else.",
        "good": "4",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "AG-7947",
        "time": "15 May, 2021",
        "context": "A number of great lake states decades ago......passed laws to protect the water in our lakes. They figured it was only a matter of time before the west coast started looking at building a pipeline.",
        "good": "15",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "earlofoil",
        "time": "15 May, 2021",
        "context": "Libbies are not very smart---their heart might be in a admirable position but their brain is in their head up their backside-----droughts happen---what do you do---build dams-----",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "Sniffy_McBiden",
        "time": "15 May, 2021",
        "context": "1880's Gold Rush to this.  Liberalism completely destroyed CA",
        "good": "8",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "whatsup#",
        "time": "15 May, 2021",
        "context": "2 governors that don’t know how to govern ! Ever heard of “ Plan Ahead “ ? 2 wasted states with same problems year after year but no solutions. I think newsum went to the french laundry to think about it ",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "trumpfan58",
        "time": "15 May, 2021",
        "context": "You tear down all your dams and you get stupid.. Liberals are like locust they destroy everything they touch..",
        "good": "10",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "PMOpinion",
        "time": "15 May, 2021",
        "context": "I’m sure the marijuana industry will always receive the amount of water it needs to flourish. ",
        "good": "9",
        "bad": "2",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "tadahzip",
        "time": "15 May, 2021",
        "context": "Jewish lasers are at it again.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Tacos4Me",
        "time": "15 May, 2021",
        "context": "Nothing lasts forever",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "GoldPumpkin",
        "time": "15 May, 2021",
        "context": "Shortly before the Great Tribulation period begins Christ gave things to look for.  \n\n\"And Jesus answered and said unto them, Take heed that no man deceive you. False Christs. For many shall come in my name, saying, I am Christ; and shall deceive many. And ye shall hear of wars and rumours of wars: see that ye be not troubled: for all these things must come to pass, but the end is not yet.  For nation shall rise against nation, and kingdom against kingdom: and there shall be famines, and pestilences, and earthquakes, in different places.   All these are the beginning of sorrows\" (Matthew 24.)\n\nAll of these things are happening right now.",
        "good": "11",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "Shaherie",
        "time": "15 May, 2021",
        "context": "We are systematically killing Mother Earth inch by inch, little by little. No governmental regulation will EVER correct natures way.  The human race is colossally stupid. ",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "sharkeybites",
        "time": "15 May, 2021",
        "context": "I'm so glad to see numerous dam projects underway. Wait, oh never mind",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "languidandbittersweet196",
        "time": "15 May, 2021",
        "context": "So glad I don't live out there with all those liberal waste products.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "GreenGoggles",
        "time": "15 May, 2021",
        "context": "No salmon?  Let them eat ice cream......Nancy Pelosi",
        "good": "10",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "TSRFBruce",
        "time": "15 May, 2021",
        "context": "No words of wisdom for those affected. Man made the valley green through water projects. If nothing has changed in the last twenty years the only hope is for rain to fill the basins. If the government has changed the system for \"tribal or enviorenmental\"  reasons there is no hope.and a lot of farmers will be going under and native americans shoppiing online. Our tiny seventy acres in TN had ponds that provided  catfish and water for livestock. Since we moved here in 2002 all three are just holes in the ground. The springs that the families used to get water from runs eight months a year.  We've been waiting almost twenty years for the water to come back just for our pleasure not out of necessity. All we know how to do is pray for rain.",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "noneyabusiness055",
        "time": "15 May, 2021",
        "context": "They had a wonderful documentary about how water in that region and all over CA was being diverted from its natural course to supply  farming and other needs.\n\nCA is constantly suffering from wildfires.  It's no surprise.  They mismanage their economy,  their housing market,  their police, so no surprise they mismanage their natural resources causing a lot of the disasters that occur there.",
        "good": "58",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Sniffy_McBiden",
        "time": "15 May, 2021",
        "context": "why don't they desalinate?",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "yellowstone",
        "time": "15 May, 2021",
        "context": "Time to think out of the box, need leadership and folks need to roll their sleeves up. Unfortunately there is no leadership anymore in government for the people, there is only pseudo leaders lining their power and pockets. Somehow the re-set is needed, Washington right now is irrelevant, they can’t see how to run or lead not only the country, but the influence we use to have in the world. I totally blame leftist ideas and movement. The real virus is craniorectal inversion, for which there is no vaccine and the left is overwhelmingly infected with it.",
        "good": "14",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "hillbilly54",
        "time": "15 May, 2021",
        "context": "Dumb liberals running Govt. Govt involved. There’s your answer to this issue.",
        "good": "8",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "conservativevic",
        "time": "15 May, 2021",
        "context": "God is trying to get the attention of these two liberal heathen states.",
        "good": "7",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "rhett2019",
        "time": "15 May, 2021",
        "context": "Cut water to all Dem politicians, environmentalists, Hollywood and those that don't speak English first.........the salmon and wildlife at least serve a purpose.",
        "good": "14",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "ohmy",
        "time": "15 May, 2021",
        "context": "Mankind screws everything up",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "hillbilly54",
        "time": "15 May, 2021",
        "context": "What party runs both these states?  Bingo!!!",
        "good": "15",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "redskunk1",
        "time": "15 May, 2021",
        "context": "Biden’s America!   Lol",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "CounterRev22",
        "time": "15 May, 2021",
        "context": "Take that white people.  This is Pocahontas' environmental racism if ever there was!",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "integridad",
        "time": "15 May, 2021",
        "context": "I'm waiting for the waves of locusts.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Poolboy_Nestor",
        "time": "15 May, 2021",
        "context": "The good news is , I beat windmill cancer, and global warming is a hoax.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "bidenslyin",
        "time": "15 May, 2021",
        "context": "The fish didn’t die of natural causes. They all committed suicide due to being in Democratic states. ",
        "good": "13",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "lovemycountryAmerica",
        "time": "15 May, 2021",
        "context": "Pipeline from east and midwest flooding area would solve the problem and create jobs. Oh wait, pipelines bad but droughts good!",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "voidwoken",
        "time": "15 May, 2021",
        "context": "Lemme guess, it's because of red states.  Or maybe it's Trump's fault.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ConservativeThinker287",
        "time": "15 May, 2021",
        "context": "I thought once Trump left everything was gonna be sunshine and unicorn farts?\n\nperhaps they should have saved all those liberal tears",
        "good": "9",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "snwflkpukes",
        "time": "15 May, 2021",
        "context": "So?",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "sarasotaorbust",
        "time": "15 May, 2021",
        "context": "i read this whole story wondering about how it was written and the slant of the story. Then i looked an saw it came from the AP. What a waste of time.",
        "good": "8",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "driveby_poster",
        "time": "15 May, 2021",
        "context": "Obviously the result of Global warming, and it is imperative that the west coast states raise taxes on themselves to fight it... or they will die.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "AlvinAmerica",
        "time": "15 May, 2021",
        "context": "Reporters are showing to consistently be as ignorant and ill informed as most politicians. The boat in photo in no way resembles a jet boat and, the first\nindicator is that is has an outboard motor hanging on the transom.",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "languidandbittersweet196",
        "time": "15 May, 2021",
        "context": "Biden gets in the oval office and the country goes to hell.",
        "good": "16",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "funfolks",
        "time": "15 May, 2021",
        "context": "To much land in California has been converted to farmland or something else in a place that was never intended to be anything but natural. To many rivers, stream and landscapes were diverted to support un-natural growth. You reap what you sow.",
        "good": "16",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "asfreedomflies",
        "time": "15 May, 2021",
        "context": "Okay...I remember now! This is not a drought as much as it is the reservoirs being low.  \n\nSo now; what caused the reservoirs to drop to dangerous levels since we have established that Oregon is at a normal average of 27.4 inches of rainfall over the last 12 months?  \n\nThink ! ! ! Think ! ! !\n\nCould it be all the massive arson fires started by BLM and ANTIFA during the last year of 2020 to oust Trump in furious hate? \n\nThousands of acers destroyed by arson from the democrats \"Brown Shirt\" militia is the main cause of Oregon's water problems.\n\nYou elect stupid...and you get stupid!",
        "good": "12",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "simotan",
        "time": "15 May, 2021",
        "context": "that \"jet\" boat has an outboard motor on the back? It makes me wonder if anything else in the story true!",
        "good": "3",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "ohmy",
        "time": "15 May, 2021",
        "context": "Mankind enjoys playing God and screws everything and I mean everything up 🙄🙄🙄",
        "good": "8",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "berzrkr50",
        "time": "15 May, 2021",
        "context": "There must be a delta smelt or snail darter somewhere that needs saving, huh?",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "edd911",
        "time": "15 May, 2021",
        "context": "Blue state blues.  Maybe they should outlaw soda straws. Oh, wait . . .",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "ralphzero",
        "time": "15 May, 2021",
        "context": "Other than more money, what's the Left's solution to this?",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "americanfirst841",
        "time": "15 May, 2021",
        "context": "I have an Idea:  Build a series of dams on the various rivers to hold excess water for the years that are dry.    You can fish it. Drink it. Use it to make power even.\n\nMeanwhile make the greenie Luddites   farm with a stick for a living.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "PurpleFan",
        "time": "15 May, 2021",
        "context": "Stupid Liberals..Baaaa Waaa.😂 Spending their money on hopeless project.. Like giving State money to Illegals.. Now the Demon really knocking at their Door..Trump was right again.. Newsom Mismanagement of State Funds.. is Proof  you never Ever want DEMOCRATS  run any type of Government.. You want Proof Clowns.. The money that Both Governors from Oregano and California could have Built  3 (Desalination Plants) Which the Output would far exceed all water requirements.. for Community and Farmers..Fact. the cost is virtually the same as per 1000 gallons..   Stupid Democrats.. WOW 😂😂😂😂😂😂😂😂😂",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "herndoggie",
        "time": "15 May, 2021",
        "context": "Desal plants powered by nuclear plants, there solved two problems.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "blazerswampthing",
        "time": "15 May, 2021",
        "context": "Oh look, another crisis for the Biden administration.  That has to be some sort of record.  At least he can say this crisis is not his fault, but I bet the results will be.",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "mrwrightbro",
        "time": "15 May, 2021",
        "context": "Border, gas, water, middle east, more to come.   No way Slo Joe can live up to the last 4 years of peace, prosperity and $2 gas.  Biden's \"new normal\".",
        "good": "17",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "truthisbias3",
        "time": "15 May, 2021",
        "context": "The gov needs to water an over populated country,     BY SELLING WATER!",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "ToddZarnecki",
        "time": "15 May, 2021",
        "context": "Geeez another blue state major issue.  tsk tsk",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "masspsychosis",
        "time": "15 May, 2021",
        "context": "when you try to turn desert mountain land into farmland 😒... idiots",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Pine🌲top",
        "time": "15 May, 2021",
        "context": "Once again government agencies destroyed   The lives of hundreds of people with mismanagement also the people that have been here before anyone else this is a wake up call but also not a surprise government runs nothing well when will people learn when your hungry and there is nothing for you  and you are stupidly asking the government for help and they gave it away to other country’s and the thousands of immigrants that are pouring into our country Biden is a fool the actor s are fools anyone who thinks the government is the answer are fools  ",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "hillbilly54",
        "time": "15 May, 2021",
        "context": "Water, energy, and wildfires won’t be solved in CA until you change from liberal to conservative. Don’t believe it?  Then keep suffering. Ignorance is doing the same thing over and over again and expecting different results. Remember your dumb liberal politicians don’t suffer. The people do.",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "redskunk1",
        "time": "15 May, 2021",
        "context": "What’s the illegitimate President going to do about yet another crisis on his watch?",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ltecs",
        "time": "15 May, 2021",
        "context": "Give everyone access and the amount they desire until none is left. When there is no water there will be no argument.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "QuestionEverything796",
        "time": "15 May, 2021",
        "context": "Just another federally run failure. ",
        "good": "7",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "CoastieSnowJob",
        "time": "15 May, 2021",
        "context": "Fool with Mother Nature...oh, and elect dims.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "mc130ip",
        "time": "15 May, 2021",
        "context": "Amazing.  I haven't been to Oregon in many years, but the last time I was there, the trick was to get it to stop raining, not start raining.",
        "good": "27",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "PurpleBowtie",
        "time": "15 May, 2021",
        "context": "You know the Northern CA mtns and forests are full of illegal marijuana operations, that's where the gang members from Mexico send all the future dreamers.  It's also where a lot of white women disappear after going hiking.  I am guessing they are diverting watersheds to irrigate their crops.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "408-208line",
        "time": "15 May, 2021",
        "context": "Both states are ran by Democrats. Is anyone surprised?",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "jhwjr",
        "time": "15 May, 2021",
        "context": "It's a bit of a shame that they are secularist.  They might have learned something from Joseph.  Though, I have little respect for liberals and their ability to plan sensibly.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ursopc",
        "time": "15 May, 2021",
        "context": "“See, just another example of   how Trump is to blame. He should have done something about this 80-90 years ago and we wouldn’t have this situation” - AOC",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "languidandbittersweet196",
        "time": "15 May, 2021",
        "context": "Whenever  liberals are in charge of a city, it turns into a stinky mess.....used needles, trash, human waste, tent, illegals, high crime. Good going libs.",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "chuck4084",
        "time": "15 May, 2021",
        "context": "Yet another reason to leave California and Oregon.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "herndoggie",
        "time": "15 May, 2021",
        "context": "Desal plants powered by nuclear plants, payed for by dems ...there problems solved",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "CyanTeepee",
        "time": "15 May, 2021",
        "context": "well when you start messing with nature and diverting water away from its natural flow this is what happens",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "EtslayOgayAndonbray",
        "time": "15 May, 2021",
        "context": "DARPA anyone?",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "americanfirst841",
        "time": "15 May, 2021",
        "context": "The leftist democrat liberal is the root cause of virtually every problem in America.",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "graptemy",
        "time": "15 May, 2021",
        "context": "Those states allow all the water they need from wet winters and snow melts to run\ninto the ocean. They will not divert that water into reservoirs because the liberals\nsay it has environmental consequences and democrats want the money for their\nsocial programs like sanctuary cities for criminal invaders. Ohio farms run\nvery well on 40 inches of rain a year. Oregon gets 200 inches per year in these\ncoastal mountains but watches it run into the ocean. The loony left again.",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "billspill",
        "time": "15 May, 2021",
        "context": "The rule is Nature First. \nShut off water to the people who can transport it in bottles, tanks and trucks, whereas Nature cannot.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "AmericanThinker",
        "time": "15 May, 2021",
        "context": "Is Newsome still letting fresh water run into the Pacific ?",
        "good": "6",
        "bad": "0",
        "replies": []
    }
]