[
    {
        "user_name": "jameswolf2",
        "time": "7 December, 2019",
        "context": "I wonder how the Russian ADA system will handle a HARM. I say time to find out.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "SensibleMe",
        "time": "7 December, 2019",
        "context": "This should be a act of war.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jw29635",
        "time": "7 December, 2019",
        "context": "The End of the Babylon that we call America.\nBecause the majority of this nation’s people have rejected Jehovah God and His Son, a time of ruin is coming upon the land.\nChina and Russia will go quiet for a long period of time, lulling the U.S. into a false period of looking away from the two countries, until they have put us to sleep.\nIn the darkness of the night, in the dead of winter, on the eve, in the middle of the night, on one of the holidays, Thanksgiving or Christmas, New Years, Russia and China, who will have joined themselves together, will launch an attack upon this nation like has never been seen before in the world. It will come so fast that this country will not be able to respond to save themselves. \nThis country is not ready for such an attack and will fall in the burning hellfire that will destroy much of this country. For those who think the Pearl Harbor attack was terrible, well, you have never seen anything like what will come upon the United States. Those who believe we are such a pure and righteous nation are so misguided. We will fall, and only God Himself, if it will even be His wish, may not save this land. \nThe people who love the Lord God and His Son will suffer physical pain and death with all the rest. Our joy, however, is that God chose His elect to be given belief and faith in Jehovah God and His Son, Messiah, the Lord Jesus Christ, and that has caused us to be holy and righteous in the spirit of our mind. We have been spiritually saved IN Chris",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "straightedge",
        "time": "7 December, 2019",
        "context": "If nothing's to be done about it, what difference does it make?",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "WingsofSilverB727",
        "time": "7 December, 2019",
        "context": "Fair Game !!!!!!!!!!!!!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "EDeploribusUnum",
        "time": "7 December, 2019",
        "context": "Libya has money to buy Russian air defense equipment?  Since when?",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "buteyewill",
        "time": "7 December, 2019",
        "context": "They had been flying it in circles for weeks waiting for it to get shot down...It was all old technology...so what they might be trying to figure out, is why everything looks so 1980's..yet the cameras are still moving around, as if it were alive and watching them... I wonder who's watching who, with that \"shot down\" drone...",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "villum753",
        "time": "7 December, 2019",
        "context": "Return US sovereign property or we will send more sovereign armement their way. Simple.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "carlislej",
        "time": "7 December, 2019",
        "context": "HARM  stands for homing anti-radar missile.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "buster_bluth",
        "time": "7 December, 2019",
        "context": "Real story: Cheap decoys are used to locate missile positions for tactical planning.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "OlympiaBeerMan",
        "time": "7 December, 2019",
        "context": "Anyone want to bet the wreckage is already in Russia?",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Trump-DeSantis-2024",
        "time": "7 December, 2019",
        "context": "Thank Obama. He and Hillary took Libya out and made it a vacuum for communist opportunities. Don’t kid yourself. Both Russia and China are fighting these these spoils of our war.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Furnando",
        "time": "7 December, 2019",
        "context": "Libya was pretty stable until Hillary conspired to have Gadhafi overthrown and this is what you get today. A country in Chaos thanks to her.",
        "good": "18",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "Spicolli",
        "time": "7 December, 2019",
        "context": "So the Russians are in Libya because of Benghazi?",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "OliveCarrot",
        "time": "7 December, 2019",
        "context": "Russia and China taking over Africa anyway let them have it.",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "bollingsucs1137",
        "time": "7 December, 2019",
        "context": "Trump already declared this as fake news.",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "error": "error"
    },
    {
        "user_name": "Viking-75",
        "time": "7 December, 2019",
        "context": "The Air Force pilot flying the drone from an office in Florida suffered no injuries.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "lerenard",
        "time": "7 December, 2019",
        "context": "Hillary is so proud of the Arab Spring, which led to stability and peace in the region!!!",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "GoldTeepee",
        "time": "7 December, 2019",
        "context": "Seems like Russia has a much more substantial role in Libya since Obama and Clinton took out Gaddafi....",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Quatoo",
        "time": "7 December, 2019",
        "context": "And.....we do nothing but whine?! Take out the AD outfit that shot it down.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "FREEtoVOTE",
        "time": "7 December, 2019",
        "context": "Do drones get hazardous duty pay — or the “folks” stateside that fly them?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "excelsior01",
        "time": "7 December, 2019",
        "context": "Time to start knocking some Russian assetts out of the sky.",
        "good": "17",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "GW_wingz07",
        "time": "7 December, 2019",
        "context": "I'm sure the Russians have had time to update their records of improvements to the drone by now.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "toomanywars",
        "time": "7 December, 2019",
        "context": "The USA wrecked Libya under Obama/Clinton, which resulted in the rise of terrorist factions there and lead to massive numbers of refugees flooding in boats to Europe, many of whom died on the way.  We have little standing to complain about the current problems there.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "jwcllc",
        "time": "7 December, 2019",
        "context": "I'm sure the Intel knows exactly where the \"shoot down\" came from.  Now is the time to exterminate the guilty parties.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "holyspiritguidesus",
        "time": "7 December, 2019",
        "context": "Hillary and Obama were the true Russian assets.  Seems like Russia is taking over half of the middle East thanks to them.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Christian97",
        "time": "7 December, 2019",
        "context": "Russia has a long standing habit of shooting things down, including airliners, and they are never held accountable.  Time to smack them with a few hundred cruise missiles",
        "good": "17",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "daviddigregorio",
        "time": "7 December, 2019",
        "context": "When we take out the location, we won't know who was there.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "daviddigregorio",
        "time": "7 December, 2019",
        "context": "However, Russian authorities have denied using military contractors in any foreign operation. They claim any civilians who may be fighting abroad are volunteers. The Libyan National Army has also denied receiving foreign backing.\n\nTake the Russians at their word, and wipe out whoever is there.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "lastPatriotstanding",
        "time": "7 December, 2019",
        "context": "I don't blame them for shooting it down, Obama sent 1000's of drones into Libyan air space dropping 10's of thousands of bombs , bombing schools and hospitals just so his Muslim Brotherhood cronies could take control of oil wells. All with out the approval of congress",
        "good": "8",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "dave140",
        "time": "7 December, 2019",
        "context": "The wreckage is in Moscow by now.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "AKHandyman54",
        "time": "7 December, 2019",
        "context": "We've seen this story before. The story, however, doesn't explain when the U.S. inserted their own \"contractors\" (Navy SEALS). We'll never know what exactly happened ... that is until one of our own gets killed.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "kaceyhemway",
        "time": "7 December, 2019",
        "context": "Uh yeah bro, you ain't getting it back.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "SkyRider",
        "time": "7 December, 2019",
        "context": "Hillary Clinton and Barack Obama's RUSSIA PUTIN RESET BUTTON at work in Syria!",
        "good": "22",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "FreedomsLastDays",
        "time": "7 December, 2019",
        "context": "Hillary gave Russia the plans anyway. And since O we have no secrets left. How do you think O is buying his latest mansion?",
        "good": "10",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "SkyRider",
        "time": "7 December, 2019",
        "context": "Pelosi, Schiff, Schummer, Nadler's COMMUNIST PARTY scam getting shot down in Syria American citizens.",
        "good": "3",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "beelove37",
        "time": "7 December, 2019",
        "context": "“Don’t worry. Tell vlad after the election I will have more flexibility”. Obama on a hot mic",
        "good": "26",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "SkyRider",
        "time": "7 December, 2019",
        "context": "Yo! George Soros Lap Dancer PELOSI. Who and what stood by and let RUSSIA, RUSSIA, RUSSIA, PUTIN, PUTIN, PUTIN, invade Crimea comrade Pelosi. YOUR MAGIC MARXIST BARACK HUSSEIN OBAMA, AND HIS CORRUPTED VP BIDEN. That's who, and what Pelosi. Your NEW WORLD ORDER GLOBALIST SALINIST SCAM. Ya! It's falling apart Pelosi. Your Communist Party is being destroyed.",
        "good": "14",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "Gato78",
        "time": "7 December, 2019",
        "context": "Yes the Russians are moving into Libya in force to support Haftar in the ongoing civil war there. They've set up air, ground and naval forward areas along the Libya coast. Recall that Hillary and her \"Arab Spring\" set the stage for turning Libya into a training base for Jihadist groups and general anarchy that has led to years of civil war. Same goes for Tunisia. Yeah Hillary, that's your legacy, the completely failed \"Arab Spring\" that totally backfired.",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "daviddigregorio",
        "time": "7 December, 2019",
        "context": "Someone should remind Putin that Obama isn't in office.",
        "good": "22",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "QST1",
        "time": "7 December, 2019",
        "context": "Obama created this mess in Lybia!",
        "good": "29",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "beelove37",
        "time": "7 December, 2019",
        "context": "3 years in and trump has not gotten us into a new conflict. In fact.... he has gotten us out of some. Truly a peacetime president.",
        "good": "25",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "lab17",
        "time": "7 December, 2019",
        "context": "HOW ABOUT THEY PAY FOR IT?...IN THE BILLIONS",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "TrueNorthConservative",
        "time": "7 December, 2019",
        "context": "Obamas weak approach has set a bad precedent, President Trump is being attacked by political rivals for trying to re-establish America’s reputation as the leader of the free world. Make no mistake, when the bill comes due, nobody will be mocking Trump or America, they’ll all be desperately trying to step back from the crowd to avoid being the one picked to pay.",
        "good": "20",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "JVanCleef",
        "time": "7 December, 2019",
        "context": "When you arm terrorists, they will attack you.  When will we learn this?\n\nAt least one of Haftar's planes just got shot down.  Trump will be sad.",
        "good": "0",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "shellback3x",
        "time": "7 December, 2019",
        "context": "Barry woulda apologized and insist we pay for the Russian missile.",
        "good": "35",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "CommonCentzzz126",
        "time": "7 December, 2019",
        "context": "Same Russians that Libby Trolls keep saying Trump is in Cahoots with?",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Country*Before*.....",
        "time": "7 December, 2019",
        "context": "Play stupid games, win stupid prizes\nYou may have erased the name soviet union, but you did not erase the mentality of the people, Russia, soviet union, w/e you choose to call it..\nsame thing",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "toomanywars",
        "time": "7 December, 2019",
        "context": "Mercenaries, by definition,  are not under the control of an state government.  Complaining about Russia being behind this is a farce.  Maybe if US mercenaries were in Libya they'd be in violation of some US law, but if so, it would seem Russians have more freedom than Americans do.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "porman783",
        "time": "7 December, 2019",
        "context": "The US Military should take our Commander-in-chiefs lead and retaliate...there's no need in whining about it and our enemy's disrespect this reaction...we need more aggressive leaders in the battle field",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "PurpleScissors",
        "time": "7 December, 2019",
        "context": "We should disband the U.S. Africa Command. Nothing good will come of any endeavor in Africa, and the thought of hundreds of thousands of post-conflict refugees being airlifted into the United States makes me cringe. Isn't that how we acquired Obama and Omar?",
        "good": "21",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "CyanPlane",
        "time": "7 December, 2019",
        "context": "Do as you please. We will do nothing.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "coldspringjohn775",
        "time": "7 December, 2019",
        "context": "What makes the author of this article believe the drone was the model depicted?",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "kamboyer",
        "time": "7 December, 2019",
        "context": "I know where's its at.  Back in Russia being reverse engineered!",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Colo805",
        "time": "7 December, 2019",
        "context": "6,000 military bases and 586 overseas\nthe justification for those is listed below ....\ncrickets",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "SiFractis",
        "time": "7 December, 2019",
        "context": "Trump will do nothing again except claim it wasn’t Russia.",
        "good": "0",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "JJ654",
        "time": "7 December, 2019",
        "context": "This is the mess created by Barrack and Hillary",
        "good": "15",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Randall Horton",
        "time": "7 December, 2019",
        "context": "Trump’s bestie Putin would never shoot down an unarmed U.S. drone over Lydia!",
        "good": "1",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "BahBahBlueSheep",
        "time": "7 December, 2019",
        "context": "Maybe we should \"mistake\" some russian contractors for terrorists then with a couple of hellfire missiles...",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Tieu_Phong",
        "time": "7 December, 2019",
        "context": "Somehow “We demanded the drone back” doesn’t sound very forceful or strong enough.  At least blow up the air defense or the perpetrator.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tbone747",
        "time": "7 December, 2019",
        "context": "Its either in Mainland China or Russian by now",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Bitterklinger688",
        "time": "7 December, 2019",
        "context": "That poor drone was just getting his life together.  Going to church, gonna enroll in community college in spring.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "thevirginsmanchild",
        "time": "7 December, 2019",
        "context": "Obama overthrew Qaddafi for some stupid reason which got our ambassador and few other brave Americans killed ,,,started the Arab spring,,,the civil war in Syriaand then he created ISIS and equipped and funded them,,,,the world ended up a far biggest mess because of obama......obama wasn’t just the worst thing to ever have happened to America but for the world as well.....how sad....how very sad that hundreds of thousands of people have been killed because of him......",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Leatherneck1369918",
        "time": "7 December, 2019",
        "context": "I miss the Reagan GOP when Republicans knew the Russians were the enemy \n\nWolverines!!!!!",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dmdelker",
        "time": "7 December, 2019",
        "context": "There goes a cool $123 million.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "💣toxicfeminism💣",
        "time": "7 December, 2019",
        "context": "Obama had more time to help Putin annex Crimea after the 2012 election.",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "TruthBKnown4",
        "time": "7 December, 2019",
        "context": "Volunteers with that kind of weaponry.  Russian assets for sure shot it down.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "realenergy1234",
        "time": "7 December, 2019",
        "context": "When are we going to grow a pair and take out that missile battery?  I'm sick of losing drones to these enemies.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "polly541",
        "time": "7 December, 2019",
        "context": "My pot growing neighbor tried to shoot down my unarmed drone.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Uamuseme2",
        "time": "7 December, 2019",
        "context": "Can we at least have on whose authority we are operating drones in Libya?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "GreenBottleOpener",
        "time": "7 December, 2019",
        "context": "Reckless deployment of surveillance asset. \nIf AFRICOM was aware of Russian origin batteries in the area capable of downing an unprotected drone then why was it sent out like a Christmas present?\nAll the Intel available did not result in actionable rescue attempt when Benghazi went down. It's time to focus more on the border than the shores of Tripoli.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "FLZMAN",
        "time": "7 December, 2019",
        "context": "Bring all our troops home and let the folks who pretend they are our allies fend for themselves.  End all foreign aid unless we get something tangible in return.  Its time American soldiers quit dying for other countries national ambitions.  They need us far more than we need them.  We need to quit giving our money and our lives to prop up counties that really dont appreciate it.  Throw the UN out and quit funding there worthless programs",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tocqueville",
        "time": "7 December, 2019",
        "context": "That's a pretty good air defense that can hit a drone over Libya all the way from Russia.\nJust WOW!;-)",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "ND1971",
        "time": "7 December, 2019",
        "context": "Would you just leave Libya alone!  President Obama and Hillary fixed that country years ago.",
        "good": "7",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "JVanCleef",
        "time": "7 December, 2019",
        "context": "I'm still in shock that Republicans hate Dems so much that they are crying over Qaddafi - the same terrorist Reagan tried to kill.\n\nIs it because Trump invited him to stay at his house in Bedford 10 years ago?\n\nLibyans rose up and overthrew the tyrannical terrorist who tortured and murdered his own citizens.  Isn't that what Trump and his cult want Iranians to do?",
        "good": "1",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "———————",
        "time": "7 December, 2019",
        "context": "So will #DroneLivesMatter protest over the shooting of a unarmed drone  ?",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "justdotherighting750",
        "time": "7 December, 2019",
        "context": "Next time,  send an ARMED drone,  programmed to return fire in the direction of anything that threatens it...",
        "good": "8",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "rightstermeister#1",
        "time": "7 December, 2019",
        "context": "Oh didn't you know?    We're supposed to be allowed to spy on and bomb any Middle Eastern country we want to, but no one else is allowed to do it.",
        "good": "4",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "BSer",
        "time": "7 December, 2019",
        "context": "Seems the US military is having a really hard time keeping track of their drones.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "OldVettesRule",
        "time": "7 December, 2019",
        "context": "Another screw up by someone and our adversary has a prime example of our technology. These things have everything but a toilet paper dispenser so why can't they jam any radar that would direct a \"missile\" towards them?",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "GoldCherries",
        "time": "7 December, 2019",
        "context": "Well, they probably need missle practice on relatively slower and lumbering drones which happen to be unarmed.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "WhistleDixie",
        "time": "7 December, 2019",
        "context": "Some of my honeybees are drones.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "patsteg",
        "time": "7 December, 2019",
        "context": "It was over the capitol of a foreign government that we are not at war with.  They had every right to shoot it down.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "watcherofnews",
        "time": "7 December, 2019",
        "context": "The Iranians shot down the last one.  Now one in Libya.  That makes two down.  Unanswered.\nMaybe using drones is not the smartest choice.  Satellites would if there's one over the area. \nOtherwise we need boots in the sky, if 'looking' is that important.\n\nbtw, Obama (international military coalition, aka leading from behind) built this situation too.  another one of his failures.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "esox07",
        "time": "7 December, 2019",
        "context": "Time to take down one of theirs.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "WattaJerko",
        "time": "7 December, 2019",
        "context": "'Army General Stephen Townsend told the outlet he believed Russia's air defense operators at the time \"didn't know it was a U.S. remotely piloted aircraft when they fired on it.\"'\n\nUhhh, Steve-o. Suppose it had been a commercial airliner. Would that have been any more or less egregious? Those 'Russian mercenaries' should all be hamburger by now.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "OrangeCloud",
        "time": "7 December, 2019",
        "context": "Do our satellites keep track of our drones?",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "💣toxicfeminism💣",
        "time": "7 December, 2019",
        "context": "Thanks to Obama and his pink line over 500k Syrians lost their lives.",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mchristie",
        "time": "7 December, 2019",
        "context": "Why are we building these $100M clay pigeons.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "MrStevietRI",
        "time": "7 December, 2019",
        "context": "Nothing to see here.  Trump and Putin will continue to hold hands under the table at important Summits.",
        "good": "2",
        "bad": "8",
        "replies": []
    },
    {
        "user_name": "notcalifornia",
        "time": "7 December, 2019",
        "context": "I hope we are using the cheap drones",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bubbawithab",
        "time": "7 December, 2019",
        "context": "Thanks Obama.  Leading from his behind...",
        "good": "12",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "thomaswinslow",
        "time": "7 December, 2019",
        "context": "I really think we need to get the hell out of all these areas and let them fight it out and to hell with them....should they get hostile against us then we blow hell out of them....",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Krebbs",
        "time": "7 December, 2019",
        "context": "Putin is laughing because our government is too busy trying to overthrow a rightfully elected President instead of watching the shop.\n\nGood job Democrats.",
        "good": "59",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "PresidentBonespurs",
        "time": "7 December, 2019",
        "context": "Shot down by trumps friend...and puppetmaster....Putin!",
        "good": "2",
        "bad": "12",
        "replies": []
    },
    {
        "user_name": "juliet7bravo",
        "time": "7 December, 2019",
        "context": "So Hilllary and Obama handed Libya to the Russians?   \"I came, he died...Russians win!\"?",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "theirish822",
        "time": "7 December, 2019",
        "context": "When you cant get high enough to avoid being shot down and still able to perform surveillance and attacks, Space Force doesn't sound so far fetched now does it. He who has the highest \"ground\" wins.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "fnviewer",
        "time": "7 December, 2019",
        "context": "Must not be using stealth drones.  I guess fuel weight and volume limit the locations they can fly from.  Why not have a helo carrier that can operate low cost stealth drones from the med sea?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "prophett",
        "time": "7 December, 2019",
        "context": "No more unwinnable proxies wars! It is time to put Putin on notice. I know someone is going to reply Nuclear Armageddon. My answer is Putin may be a narcissist, but he isn't stupid. Mutually assured destruction means both the US and Russia disappear from this earth. The United States Military can easily beat them in a conventional action. Sink a few ships and demolish a couple air bases, I guarantee you Putin's overblown ego will disappear.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "1fordtech1",
        "time": "7 December, 2019",
        "context": "They dont know where it is NOW that they have turned it over to China for duplication",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "richardhead325",
        "time": "7 December, 2019",
        "context": "Nice to see our new allies, the Russians and the Saudis, repaying our friendship this week. Can’t wait to see what sort of tribute Erdogan has in store for us.",
        "good": "3",
        "bad": "2",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "EyeMwethstewpid",
        "time": "7 December, 2019",
        "context": "The surveillance product is immediately deleted when the airframe is compromised. It's uploaded in real time, so it's not necessary for \"get smart\" self destruct explosions. It's a smoldering heap of expensive scrap metal for the finder.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mikem1355080",
        "time": "7 December, 2019",
        "context": "And why is Russia defending Libyan air space?",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "reddgreenn",
        "time": "7 December, 2019",
        "context": "Libya has been a disaster since Oblame-a got involved. . .",
        "good": "18",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "aussiekelpie",
        "time": "7 December, 2019",
        "context": "Fly in a countries air space expect to get shot down.",
        "good": "7",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "utie",
        "time": "7 December, 2019",
        "context": "every where clinton went the russians were quick to follow!!",
        "good": "12",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Chad97z",
        "time": "7 December, 2019",
        "context": "They keep it so they can do reverse engineering and acquire intelligence.  And they didn't know it was a U.S. drone?  who else has drones like us?",
        "good": "14",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Jajobright",
        "time": "7 December, 2019",
        "context": "AOC is a good looking woman.  Russia just jealous of US because she is from here",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "braneworld",
        "time": "7 December, 2019",
        "context": "$500M here. $500M there.\nIt adds up.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "pullyourheadoutp",
        "time": "7 December, 2019",
        "context": "Funny why don't we fly drones over the country that actually kills us the most?",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "DIRK-DIGGLER",
        "time": "7 December, 2019",
        "context": "Trumps military....",
        "good": "2",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "notcalifornia",
        "time": "7 December, 2019",
        "context": "I hope the expensive drones have anti intercept tech on them.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ConservativelyYours",
        "time": "7 December, 2019",
        "context": "\"The U.S. Africa Command is demanding the return of the aircraft's wreckage\"\n\nDream on....",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "PurpleSnow",
        "time": "7 December, 2019",
        "context": "Mr. Putin., are you responsible for this? NO, Mr.Trump.\nSounds good to me, Putin says \"No\" and i believe him.",
        "good": "3",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "controllfreak",
        "time": "7 December, 2019",
        "context": "So go get it, you've asked nice now ask not so nice.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "gsaogb",
        "time": "7 December, 2019",
        "context": "Why is a US drone flying over restricted airspace?",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "travelinmanrr",
        "time": "7 December, 2019",
        "context": "Why haven't they installed self destruct devices that can be be remotely detonated in  these things yet?",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jaywye",
        "time": "7 December, 2019",
        "context": "Our larger drones should have self-destruct thermite charges on them,that also can be triggered by a coded satellite signal.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "CyanStrawberry",
        "time": "7 December, 2019",
        "context": "America is their worst enemy, no leadership, direction, generals mostly are sausy hounds.  Less and less honorable people are joining",
        "good": "0",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "zeemann909",
        "time": "7 December, 2019",
        "context": "My take on this then since it's not the russian military, returning fire on volunteers would be OK then",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "veryevilloki",
        "time": "7 December, 2019",
        "context": "Can we start installing self-destruct devices on these, please?!",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "vo142857",
        "time": "7 December, 2019",
        "context": "Can we make useless drones that are cheaper than Russian air defense missiles, and fly them more often?",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "VoteRepublican130",
        "time": "7 December, 2019",
        "context": "They didn't know it was a US drone? Only stupid democrat voters would believe that.",
        "good": "12",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "wetmedic564",
        "time": "7 December, 2019",
        "context": "Well... I got to go with Russia on this one.  A USA drone flying around in any country outside the USA and not in international air space is fair game.\n\nThe question of \"who\" shot it down isn't important.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "BlueGrassExpress",
        "time": "7 December, 2019",
        "context": "Why haven't we equiped these larger drones with self defense capability???",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ArticleCritic",
        "time": "7 December, 2019",
        "context": "Russia will have edward Snowden reprogram this drone and then they will use it to spy on the U.S.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "grot706",
        "time": "7 December, 2019",
        "context": "Any foreign leader, please pretend that you respect and/or fear Trump. It will greatly improve the pathetic lives of his cult members. They have so little.",
        "good": "5",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "exordis",
        "time": "7 December, 2019",
        "context": "Look up the \"Wagner Group\". In spite of its German-sounding name, this is an organization of Russian mercenaries comprised of former Russin military and, according to some sources, active duty Russian special forces (Spetznaz) \"on loan\" from their units. Wagner Group performs military operations for causes and reasons that benefit the Russian government but where the Russians want deniability.\n\nThey are reportedly active in Crimea and Eastern Ukraine, Syria, Sudan, Central African Republic, Madagascar, Libya, Venezuela, and Mozambique.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mrdna",
        "time": "7 December, 2019",
        "context": "This is nothing compared to the NSA, and now Congress, spying on it's own citizens.  Eisenhower, Kennedy, and Trump have all tried to warn us. keep being hypnotized by the Mockingbird media, foolish people. Ho Hum...",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "grot706",
        "time": "7 December, 2019",
        "context": "Why wouldn't Trump just order Russia to return the wreckage? Isn't Putin scared of Trump?\nCan Hannity be wrong?",
        "good": "2",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "HornedToad",
        "time": "7 December, 2019",
        "context": "So we are killing Russians in Libya and you expect them to return a drone we were using to target them.\nMakes perfect sense.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mrdna",
        "time": "7 December, 2019",
        "context": "Like the US didn't try to raise a Russian submarine once upon a time?  Welcome back to the cold war - that never went away!  There's probably a \"slaughter-bot\" out there with all our names on it.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "MinuteofAngle",
        "time": "7 December, 2019",
        "context": "This is one way to gain access to US technology and reverse engineer it to benefit themselves. The former USSR stole US data and designs routinely and it showed in their technology. Their execution was inferior but the modified designs of course were based on proven ones.\nChina is the same and has been stealing our technology for years, but they do it more from spies on our soil and in other nations than from cruder methods.",
        "good": "12",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "CyanFlask",
        "time": "7 December, 2019",
        "context": "How come every country we help destabilize descends into a civil war, becomes an ISIS stronghold, and causes us more long term problems? At some point we gotta question our approach to “solving” the worlds problems",
        "good": "3",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "mrgray",
        "time": "7 December, 2019",
        "context": "Russia shot down our drone? Let's blame Ukraine to cover for Trumps boss Putin.",
        "good": "2",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "ind1289480",
        "time": "7 December, 2019",
        "context": "The US with Secretary of State Clinton in charge created the mess in Libya by stabbing Moammar Gadhafi in the back after he had renounced terrorism. There would be no Russian \"volunteers\" in Libya had the US not created the chaos to begin with.",
        "good": "12",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "NoneYaBusiness",
        "time": "7 December, 2019",
        "context": "Yeah, that happens when you fly your stuff over another country's territory. BTW: There would be no civil war in Libya if the Obama and Hillary had not destabilized the country.",
        "good": "15",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "grot706",
        "time": "7 December, 2019",
        "context": "If Russians had done it on Obama's watch, cons would've accused him of being a liberal weakling.\nWhat is their excuse now?",
        "good": "3",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "Coffee6",
        "time": "7 December, 2019",
        "context": "When will they push a button to destroy a downed drone?? That's supposed to be solved already?",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "wills-7",
        "time": "7 December, 2019",
        "context": "OMG ... how many were killed?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "JohnGreen11",
        "time": "7 December, 2019",
        "context": "Sound like Air America?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ArticleCritic",
        "time": "7 December, 2019",
        "context": "That thing looks freakin expensive",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cambodia1fred",
        "time": "7 December, 2019",
        "context": "Thank you HillKillary for your getting us into this mess to begin with.  You were sitting on you duff and King Osama Obama was ignoring what he was being told.  So we are now faced with yet another mess that will never be cleared up.  And to think she wants another attempt at screwing up our country AGAIN.  When the records are all unsealed we will some day realize all the details of what this Obummer administration left us.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "realityblowz",
        "time": "7 December, 2019",
        "context": "U.S. forces killed 200 of these Russian mercs in 2/7/17. They tried to overrun a U.S. position at an oil field by the Euphrates river.  Only 1 U.S. ally was wounded during the incursion.  There was a large loss of Russian  armored troop carriers and mobile surface to air missiles platforms.  F-15's took those out and hellfire missiles from Blackhawks mopped up.",
        "good": "10",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "mrgray",
        "time": "7 December, 2019",
        "context": "Trump gargles Putin's meat so there will be no tweets about this act of aggression towards the US.  Maybe Ukraine did it?",
        "good": "0",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "scottgunn",
        "time": "7 December, 2019",
        "context": "“They say they don’t know where it is”\n\nShouldnt we know where it is?  There has to be tons of gps on that thing just for us to be able to control it remotely.  If they don’t know just send a cruise missile to the coordinates.  How about having a self destruct mechanism on these drones that cost millions and have sensitive technology on them?  Come on people be as smart as we think you are!",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Rufust.Firefly2018",
        "time": "7 December, 2019",
        "context": "I think our \"civilian warriors\" in Libya should shoot down a Russian aircraft, just to let them know two can play this game.",
        "good": "8",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "JmmTXFOXX",
        "time": "7 December, 2019",
        "context": "Trump has made Russia impotent and irrelevant. They don't mess with us much anymore.  Russian knows that Trump is just crazy enough to do the unthinkable.  Maybe the only time in Putin's life he has actually met someone like that.  In any event Trumps not going to be bullied by a 3 rate country, big guns or not.  Trump bullies Putin...not the other way around.",
        "good": "9",
        "bad": "3",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "GoldRadio",
        "time": "7 December, 2019",
        "context": "Didn't we leave a cell phone in so Google can track the wreckage?",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Bogo66",
        "time": "7 December, 2019",
        "context": "Maybe Hillary and Obama shouldn’t have turned Libya over to Islamic extremists and the Russians",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "GretnaBear",
        "time": "7 December, 2019",
        "context": "and theDon is mute to Putin's agression!",
        "good": "3",
        "bad": "3",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "smokedaddy1",
        "time": "7 December, 2019",
        "context": "What happened to the Self Destruction Button ? or was that an Option to ?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mrgray",
        "time": "7 December, 2019",
        "context": "Blame Obama for everything",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jkm49",
        "time": "7 December, 2019",
        "context": "Another major screw up by the past administrations.  Take out the terrible leaders of these countries, we think we are doing the right thing and behold before your eyes the terrible ones are replaced with someone much worse.  Saddam's disposal =Al-Qaeda, on Bush,  Iraq on Obama's neglect = Rise of ISIS and the Syrian threat by Obama cross Red Line Thr eat = Weakening of Assad, growth of ISIS and Libya now in state of chaos and anarchy after the death of M. Gaddafi = Shill=ery/Obama's lack of neglect.",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "GretnaBear",
        "time": "7 December, 2019",
        "context": "All the defense money can't change the fact that Trump neutered the GOP,  he neutered our military in the Middle East and Mattis left, then neutered the Navy brass last month .. DOD can't act without his approval tweets!!",
        "good": "1",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "RedBee",
        "time": "7 December, 2019",
        "context": "You can thank our Muslim leader, Obama and his hench-woman Hillary for the disaster that is Libya today.   Muammar Gaddafi had already agreed to forgo weapons of mass destruction and they offed him anyway.  What a 'great' leader '44 the Idiot' truly was !!  Thank goodness we have a real leader in the WH now !!!",
        "good": "22",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "BrokZagger",
        "time": "7 December, 2019",
        "context": "What is a nation to do when self-invested mercenaries from their boundaries go to attack or defend against interests that other nations are against? Bomb them? I mean, if Russians are over in Libya by not government decree, shooting down a drone, should Russia wipe out those soldiers of fortune?\nIf U.S. mercenaries are causing havoc somewhere, should our government knock them out?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "JoshuaV",
        "time": "7 December, 2019",
        "context": "Obama made this mess in Libya. I suppose it's Russian made air defenses provided by UAE not Russian per se.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mrgray",
        "time": "7 December, 2019",
        "context": "Russia shot down our drone.  You can blame Trump for his profound weakness toward Putin.  Trump will not say anything about this, much less do anything.",
        "good": "4",
        "bad": "7",
        "replies": []
    },
    {
        "user_name": "americapartyusa",
        "time": "7 December, 2019",
        "context": "The Military knows it was shot down and where; the up-link will tell them that.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "justanotherpers",
        "time": "7 December, 2019",
        "context": "Id it were may, I'd say nothing to avoid the humiliation associated with \"not knowing where it is\"?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Time4a3rdParty",
        "time": "7 December, 2019",
        "context": "These things should self destruct the moment they start to go down.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "OrangeHammer",
        "time": "7 December, 2019",
        "context": "So the Russian military gets an upgrade.  They get theirs the same way China does, they steal it.",
        "good": "4",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "PacificRant",
        "time": "7 December, 2019",
        "context": "Refer to crooked Hilary",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "mrdna",
        "time": "7 December, 2019",
        "context": "Remember when they said the cold war was over?  Things will get better they said.  There is a huge \"peace dividend\" they said...",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "freedomguide",
        "time": "7 December, 2019",
        "context": "No more wars if we can avoid it. Lets only use deadly force as a last resort. Don't forget that it was the USA, China, and Russia that defeated National Socialism in WW2.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cry409",
        "time": "7 December, 2019",
        "context": "MOAB",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "Quidproquoabuseofpower",
        "time": "7 December, 2019",
        "context": "So what is the coward Trump going to do? Play golf? I'm waiting for him to apologize with Russia like he did with Saudi Arabia for killing our soldiers",
        "good": "4",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "RockoJack",
        "time": "7 December, 2019",
        "context": "Hillary helped Russia take over Libya",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "enoughwaste",
        "time": "7 December, 2019",
        "context": "The Russians should compensate the US for property damage.  Those drones  cost $80 million !!!  The one Iran shot down was around that price. They are not the typical drone you buy off the shelf.  They come with computerized sensory equipment and the drone is the size of a plane.",
        "good": "1",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "GretnaBear",
        "time": "7 December, 2019",
        "context": "As Trump Wavers on Libya, an ISIS Haven, Russia Presses On ... \nDOD's General Waldhauser declared to Congress,  “The instability in Libya and North Africa may be the most significant near-term threat to U.S. and allies’ interests on the continent,”  In Libya, as elsewhere, Trump has been guided largely by his own instincts and by a small circle of advisers who have his ear but little in-country experience.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "thesummitsays",
        "time": "7 December, 2019",
        "context": "time to start taking out the missile batteries. keep hearing about how great or military capabilities are. time to use it.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "OrangeHat",
        "time": "7 December, 2019",
        "context": "Was it in international air space? Or Lybian airspace?   Would we shoot down a foreign drone in our airspace.   How high does something need to be to be out of a countries airspace?  Shooting down satellites is also a concern",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "BlueAirBalloon",
        "time": "7 December, 2019",
        "context": "Russia and China are not our friends and never will be!  I suggest we stop trading and doing any kind of business that support their countries!  They need to change and they need us more than we need them!",
        "good": "7",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "theotherlannister",
        "time": "7 December, 2019",
        "context": "Damn - time to get the tech guys working on the next set of counter-measures for our drones ...",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "PurpleFries",
        "time": "7 December, 2019",
        "context": "Another example of how Trump just lets Russia walk in and take over everything. Worst pathetic president ever.",
        "good": "2",
        "bad": "8",
        "replies": []
    },
    {
        "user_name": "omnioasis",
        "time": "7 December, 2019",
        "context": "Russia is in Libya,Syria and Yemen thanks to Obama's Arab Spring disaster.",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "quickfix099",
        "time": "7 December, 2019",
        "context": "Punch into your Search Engine \"Green Flag\" , Learn a pile more about what Facts are",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "SpanishPrincess",
        "time": "7 December, 2019",
        "context": "Why was the US sending drones over Libya?",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "kolv91",
        "time": "7 December, 2019",
        "context": "Every drone should have a nuclear device, if enemy get a drone they get a nuclear device. Boom!",
        "good": "1",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "socialisthogs",
        "time": "7 December, 2019",
        "context": "What the hell are the Russians doing in Libya?",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "Roosterpot",
        "time": "7 December, 2019",
        "context": "Get it back and send them a bill!",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "mecanik909",
        "time": "7 December, 2019",
        "context": "Why would we want it back in the condition it's probably in now. It would be a total loss.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "quickfix099",
        "time": "7 December, 2019",
        "context": "How does another country know if it is an Armed Drone or an unarmed Drone ? -- Answer is , is to shoot it down to find-out",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "LittleDale",
        "time": "7 December, 2019",
        "context": "It's sad the Russia can shoot down our Drones with their SAM. But we can't even shoot down the Drones from Yemen using our most advanced SAM that flew in Saudi and blew up the oil fields!",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "gsavr1",
        "time": "7 December, 2019",
        "context": "Sounds like we need to toss a 1/2 dozen cruise missiles into Moscow to remind Russia who's who",
        "good": "2",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "freedomguide",
        "time": "7 December, 2019",
        "context": "This is the Libya that the Obama Administration created. Oh the joys of an Arab Spring.",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "spongepuppet",
        "time": "7 December, 2019",
        "context": "Who knows what to believe anymore",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dos622",
        "time": "7 December, 2019",
        "context": "Trump and guiliani will add the drone to the list of stuff they are searching for in ukraine.",
        "good": "4",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "lookaway",
        "time": "7 December, 2019",
        "context": "Russia is not afraid of USA as long as Putin's buddy is in power.",
        "good": "1",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "OrangeLeaf",
        "time": "7 December, 2019",
        "context": "Moscow's role in the energy-rich country. We said this would happen if we didn't act first and Hillary let it burn.\nOh well what does it matter now?",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "fones",
        "time": "7 December, 2019",
        "context": "There is no shortage of people who have an adverse relationship with the truth in Russia and many parts of the Middle East. Colliding with the truth is as common as hair in those places.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "quicksilver5050",
        "time": "7 December, 2019",
        "context": "Don't they have the right to protect themselves even from us? Does it mater whos weapons they use, dumb, yes it does if it is our weapons it would be good.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "math_addict",
        "time": "7 December, 2019",
        "context": "CNN:\nPolice shoot unarmed drone...Russian Collusion involved.\n\nElementary school photos of the drone at 11:00. \nInterview with drone's mother to follow.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "quickfix099",
        "time": "7 December, 2019",
        "context": "They say that a Drone costs about $220 Million bucks , about enough cash to build 2 and a half F-35's -- What they do not say is that the Drone aircraft , by itself , If the cheapest part of that investment , the majority of that $220 Million bucks are in the systems on the ground that Fly them",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "CHAINSAWS",
        "time": "7 December, 2019",
        "context": "Libya - another failure in the legacy of Obama and Hillary.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "wildbill65",
        "time": "7 December, 2019",
        "context": "Time to develop a hunter drone for the purpose of downing other drones.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "KeepCalm2020",
        "time": "7 December, 2019",
        "context": "Fredo should call his mom to get the real scoop.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "quickfix099",
        "time": "7 December, 2019",
        "context": "A few years back , Area 6 , was built in the Nevada desert --Of course the Tin-Foil hatted , Area 51 Flakes claimed it to be another Area 51 --When in fact it is a Drone training school that was previously run out of Nellis AFB , the 547th Tactical airwing --It was relocated due to safety reasons to its own Area",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "OrangeBulb",
        "time": "7 December, 2019",
        "context": "We are so rich we give Russia free easy target practice.",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "TyrantswillfallwithGlorifiedPatriots",
        "time": "7 December, 2019",
        "context": "Hilary gave russia a Uranium mine so they must be our allies?   Right?",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "itsy_bitsy3",
        "time": "7 December, 2019",
        "context": "Retaliate!  Maybe in Crimea!",
        "good": "0",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "OrangeBulb",
        "time": "7 December, 2019",
        "context": "Dont know where our drone went down, or the location of the SAM. So much for intelligence.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "VoteOnlyRepublican2022",
        "time": "7 December, 2019",
        "context": "Bet the housing and expense stipend is pretty good.for those volunteers.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "quickfix099",
        "time": "7 December, 2019",
        "context": "In truth , the USA ought to respect the Air-space of other countries , much unlike they do now",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "PurpleCloud",
        "time": "7 December, 2019",
        "context": "And this is a surprise?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Opinionator",
        "time": "7 December, 2019",
        "context": "Are they stealing our technology, or are we giving it away?",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Turtlevoice",
        "time": "7 December, 2019",
        "context": "You can blame Obama and Hillary for the  disaster in Libya.\nHer famous quote  \"We came,  we saw,  Gadhafi dead!\"",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "OrangeBulb",
        "time": "7 December, 2019",
        "context": "Our drones arent very smart it would seem, ask Elon Musk for an upgrade maybe.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "merely.a.vapor",
        "time": "7 December, 2019",
        "context": "so, our military and it's tech are not impervious to destruction as We the People are led to believe ... who would have thought such a thing was possible",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Acanthuras",
        "time": "7 December, 2019",
        "context": "And we would shoot down any military drones flying over our capitol.., and we wouldn't give it back either.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "LGBRainbowWarrior",
        "time": "7 December, 2019",
        "context": "\"Army General Stephen Townsend told the outlet he believed Russia's air defense operators at the time \"didn't know it was a U.S. remotely piloted aircraft when they fired on it.\"\n\nYeah, right. Whatever.",
        "good": "12",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Dios",
        "time": "7 December, 2019",
        "context": "What's usually never told in these drone shoot downs is the cost. The one that was shot down over Iran this year was 110 million.",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "03WeThePeople",
        "time": "7 December, 2019",
        "context": "Using mercenaries allows them to do things that as a government they would be blasted, with mercenaries they achieve their goals regardless of world opinion.",
        "good": "9",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "NFTG",
        "time": "7 December, 2019",
        "context": "All that money spent on it and we don't have tracking devices on it?  China probably has it by now anyway.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "PresidentXiBidenping",
        "time": "7 December, 2019",
        "context": "''Hey Dmitri, I'll have more flexibility to negotiate with you and Valdimir you after you guys help me get re-elected''\n\n~ President Obama, Russia's friend.",
        "good": "58",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "OrangeBulb",
        "time": "7 December, 2019",
        "context": "Can probably buy the drone remains on ebay.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rockyballbuster418",
        "time": "7 December, 2019",
        "context": "They should have multiple self-destruct mechanism on-board to wipe any classified data or equipment in the event it's hit or captured.",
        "good": "8",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "DavidSpeck1",
        "time": "7 December, 2019",
        "context": "russia is consistently attacking the USA and trump is doing nothing about it.",
        "good": "1",
        "bad": "7",
        "replies": []
    },
    {
        "user_name": "DavidSpeck1",
        "time": "7 December, 2019",
        "context": "all Russians in the US have to be rounded up and subjected to extreme vetting. if they fail, we need to deport them immediately. They are the enemy.",
        "good": "3",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "Dios",
        "time": "7 December, 2019",
        "context": "So anywhere Obama interfered with Russia moved in and filled in the gap of his failures",
        "good": "9",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "coastman62",
        "time": "7 December, 2019",
        "context": "Should have left Khadafy alone, he gave up his nukes but Obama and Hillary wanted to act tough.  They are just losers!  I don't know how anyone could support them.",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "CharlieWaffles550",
        "time": "7 December, 2019",
        "context": "Imagine if we just pulled out of Europe and Asia and let them figure it out. It’s such a mess over there where we don’t have to really do anything.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ardethbey379",
        "time": "7 December, 2019",
        "context": "One thing is for sure, the US is not and cannot make Russia return this drone. Plus, the US would be far too afraid to shoot down a Russian drone knowing the consequences.",
        "good": "2",
        "bad": "7",
        "replies": []
    },
    {
        "user_name": "acceleration318",
        "time": "7 December, 2019",
        "context": "If your going to mess around near the enemy's boarders you have to expect something like this to happen. Slim to none chance of ever retrieving the remains.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "POTUSDJT",
        "time": "7 December, 2019",
        "context": "Don't worry about stolen technology.......China has the stolen drone plans and sold them to Putin years ago.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Commdog",
        "time": "7 December, 2019",
        "context": "Two things\nOne … the Drone was being used \"to assess the area's security and monitor for violent extremist activity.\"\nPositive assessment outcome.\nTwo …  Never going to get back what's left.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "eurometal",
        "time": "7 December, 2019",
        "context": "You should believe Russia when it says anyone fighting abroad under these circumstances is NOT controlled by its government, these are rogue/volunteers & some are even prosecuted by Russian government as they create negative aura aroudn world, in latst case 2 Russian mercenaries tortured an ISIS fighter, ending up in his dismemberment & set on fire, as revenge for what ISIS did to others incl to Jordanian pilote.  Be careful when you accuse Russia of \"this & that\"... there's a eason for everything & it's not always \"evil\" of Russia but proer/logical intentions.  You'd fight more & lose more personnel if Russians were NOT aiding fight against ISIS.  ISIS was enemy of EVEN Iran, our enemy, an enemy of our enemy isn't necessary friend though, but it shows how convoluted Middle east became... again, Moscow isn't always responsible for these rogue acts, don't discount it as a \"lie\", it's real.... Moscow can't control everything in its population for the same reason US can't control several of its citizens joining ISIS or whatever in past\n\nP.S. Typos dueto mobile device/tiny keyboard/busy fast typing",
        "good": "4",
        "bad": "2",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "error": "error"
    },
    {
        "user_name": "joshb",
        "time": "7 December, 2019",
        "context": "The USA has the power to fly drones into the airspace of other sovereign Nations without their permission.  However, those Nations are with their International rights to shot them down just like the USA would be.  I'm not sure the USA will ever stop treating the World as its backyard, but the Globalists are the Americans.",
        "good": "2",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "the_facts_of_life_are_conservative",
        "time": "7 December, 2019",
        "context": "Libya, Iraq, Iran, ISIS, Syria, the European refugee invasion...all world disasters created by the incompetent foreign policy of the incompetent Obama administration, that killed millions of humans and displaced millions more.",
        "good": "26",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "Dios",
        "time": "7 December, 2019",
        "context": "-Obama cancelled the missile defense shield for Europe as a favor for Putin. \n-He tried a regime change in Syria which failed and let Russia move in. \n-He tried a regime change in Libya which succeeded but allowed Russia to move in. \n-He gave Russia a free pass to take Crimea\n-Obama cancelled our shuttle program and paid Russia 11 Billion to take our astronauts up. \n-He allowed the sale of a big chunk of our uranium to be sold to Russia\n\nCrazy that the liberal media has never accused him of being a Russian asset.",
        "good": "21",
        "bad": "2",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "DavidSpeck1",
        "time": "7 December, 2019",
        "context": "russia is our number 1 enemy. It is time to send it back to the stone age.",
        "good": "2",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "another_nc_guy156",
        "time": "7 December, 2019",
        "context": "US Drone Shot Down in Foreign Country's Airspace",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "DankTroll",
        "time": "7 December, 2019",
        "context": "Long Live Putin",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "markmaki",
        "time": "7 December, 2019",
        "context": "Well, it could be worse - like an airliner.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "NeinAteSeven",
        "time": "7 December, 2019",
        "context": "Hey, leftist Dim Libs, I thought Trump was Putin's puppet...what happened to \"Russia, Russia, Russia\"??? Liberals are \"stoop-id\" beyond words",
        "good": "6",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "dairyteats",
        "time": "7 December, 2019",
        "context": "Maybe we should let them know we can play that game too. A lesson from life...don't let bullies push you around.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "bigmikegalaxy",
        "time": "7 December, 2019",
        "context": "Notice how this story just kinda drones on and on...",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "PurpleApple",
        "time": "7 December, 2019",
        "context": "Putin said they didn't do it and I believe him.\n-Donny",
        "good": "5",
        "bad": "11",
        "replies": []
    },
    {
        "user_name": "HossSpence973",
        "time": "8 December, 2019",
        "context": "Libya, another failure by sheikh obama",
        "good": "9",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "II2II",
        "time": "7 December, 2019",
        "context": "Hmm, need a trailing drone with anti-installation missiles.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "HadesHelmet",
        "time": "7 December, 2019",
        "context": "AOC is like, if i'm so dumb, how did i finish a jigsaw puzzle in 6 weeks, when box said 3 to 6 years...KAG!",
        "good": "15",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "Never2bknown",
        "time": "7 December, 2019",
        "context": "I found the Hillary Clinton quote of the day:  Oil-rich Libya descended into chaos in 2011 when an international military coalition helped rebels overthrow longtime autocrat Moammar Gadhafi. Islamic extremists have exploited the chaos to expand their reach in the country. Whats a POTUS?",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "skamble",
        "time": "7 December, 2019",
        "context": "Russian mercenaries fight for General Khalifa Haftar who is trying to defeat the Western recognized government in Tripoli. \nRussians need Libya as their attempt to have a naval base in Syria is uncertain depending on Assad's survival.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "II2II",
        "time": "7 December, 2019",
        "context": "Asking is nice... just go take it back.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "skamble",
        "time": "7 December, 2019",
        "context": "Do the French and Italians care if there will be a massive Russian navy just off of their shore?\nWhy is it Americans who always have to care about this?",
        "good": "11",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "mccracker",
        "time": "7 December, 2019",
        "context": "every major city in the M E has some kind of air defences. If its not American made it's Russian. has nothing to do with who is running it or who paid for it.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "anonymouse4",
        "time": "8 December, 2019",
        "context": "If only there was some way to punish russia for their aggression towards the US over the past 3 years...",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "error": "error"
    },
    {
        "user_name": "another_nc_guy156",
        "time": "8 December, 2019",
        "context": "Obama and Clinton had to \"liberate\" Libya because its government was friendly with Russia.  After military and humanitarian catastrophes, Libya is a failed country that nearly became another ISIS stronghold.  Way to go!",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "papamonkeydaddy566",
        "time": "7 December, 2019",
        "context": "so we lost a drone and have no idea what happend to it ... \nrock on american itelligence ...\n\ni know lets just go to war with russia over it.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "GreenAnchor",
        "time": "7 December, 2019",
        "context": "Why don’t they have self destruct explosives when shot down?",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "goobies566",
        "time": "8 December, 2019",
        "context": "glad like always we do the work they do there propaganda. be glad when we stop helping others cause they just flip on us, china ,russia,korea. it's a curse of are help. they think we have to service them.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "hunterantiques",
        "time": "7 December, 2019",
        "context": "If there not Russian troops or your allies , are they not fair game in a war zone until you know otherwise . And they shot first .",
        "good": "5",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "sactowntruth",
        "time": "7 December, 2019",
        "context": "\"Oil-rich Libya descended into chaos in 2011\". \n\nYa, because Hillary Clinton and two other war mongering women pushed the U.S. and our Allies to enforce a \"no fly zone\", which meant the Libyan military was not able to operate to defend the nation against rebels. \nThe rebels spread lies about the libyan government, such as it was raping women, which was one of the excuses for military action. \n\nWhat followed, after Hillary got her way was a humanitarian crisis, tens of thousands of deaths, the destruction of the Libyan economy, which actually ran a healthy surplus prior to Hillary's folly, the murder of our Ambassador,  the increase of terrorist in the country and a wave of illegal immigrants flooding Europe, changing the landscape of several European countries, bringing with them crime and terror as the E.U. forces countries to accept and assist the immigrants. \n\nThe whole Hillary/Obama endorsement of the rebels have been a disaster, which at least Obama has had enough courage to admit.",
        "good": "7",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "irritatedboomerpatriot66",
        "time": "8 December, 2019",
        "context": "See?  This is why we can't have nice things.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "BillyRedwolf",
        "time": "8 December, 2019",
        "context": "I would live on beans and cornbread just to stop the USA from doing business or fighting in the middle east...you see, we can live on beans and cornbread...they cannot...they can grow neither...Food is the key to world peace..control it you control everything...",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "coastlinecascott",
        "time": "8 December, 2019",
        "context": "Now we know why Hillary wanted khadafi out",
        "good": "9",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "SkpOD661",
        "time": "8 December, 2019",
        "context": "Let’s see what the USN Seals can do against their Russian counterparts. I shudder to think.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "FoetorFartus",
        "time": "8 December, 2019",
        "context": "Im getting the impression here today that Trumpers are totally fine with this, but that's hardly surprising!  Well, I prefer the 'one of ours for one of theirs' approach.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Teddy48",
        "time": "8 December, 2019",
        "context": "Look we have spilled a great deal of blood in Europe, Asia and Africa why not stop this  cycle, and bring our troops home and take care of this side of the  Hemisphere. Making this side of the  hemisphere great get rid of drugs, human  trafficking. Now that doesn't mean our government should get in solved in running governments and if they don't want us there we leave and never to come back unless they attack us. But we could build our military and our space force so its 2nd to None. Bring peace and  prosperity to those who want it",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "MikeO",
        "time": "8 December, 2019",
        "context": "Guess the Russians are still upset about the one-sided Battle of Khasham.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "freedomofreledgion",
        "time": "9 December, 2019",
        "context": "Lose a drone fly another armed on on same path with AWACS support and pound the missile launch site to dust.",
        "good": "7",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Fuggnutz",
        "time": "9 December, 2019",
        "context": "Arm the drones so they can take out those missile batteries as soon as they are targeted.  We might still lose the drone, but at least we get something in return.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sstarke2",
        "time": "8 December, 2019",
        "context": "Would we return the plane to the Russians under the similar circumstances? Before we studied it inside out? Why expect something different from the others?",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cadetbonespur",
        "time": "8 December, 2019",
        "context": "Oh, it's the Russian, well, that's ok then.  After all this is Trump's America.",
        "good": "0",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "BillyRedwolf",
        "time": "8 December, 2019",
        "context": "Leave the Middle East..stop selling them food...stop all trade and let them eat sand...Let them continue their 5K year old wars..and let them do what they want, never go back unless they provoke us..and if we go back, make it like Germany in ww2...carpet bombs work....Their oil is worth nothing without food to eat.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Gonja",
        "time": "8 December, 2019",
        "context": "Look what Hillary and Obama started... Benghazi is only the beginning now that Russian special forces are involved in this civil war.",
        "good": "10",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "BluePin",
        "time": "8 December, 2019",
        "context": "That'll happen when the US flies drones in someone else's air space.  What did the taxpayers lose on that brilliant strategy?  Those drones ain't cheap.",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "sstarke2",
        "time": "8 December, 2019",
        "context": "In any unclear situation blame the Russians.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "JVanCleef",
        "time": "8 December, 2019",
        "context": "Can Republicans explain why they are mad at Obama for the death of Qaddafi who LIBYANS killed and FRANCE supplied the lion's share of military support for?\n\nRemember, Qaddafi was a terrorist who killed hundreds of Americans.\n\nHe MURDERED more Americans than Iran did.  The hostage crisis was nothing compared to Pan Am 103 or the Berlin nightclub bombings or the assassinations that he carried out on American soil.\n\nAnd yet you want Iranians to rise up and overthrow their Supreme Leader while remaining bitter about the Obama administration carrying out a policy that Reagan would have supported.\n\nIs your hate for Americans so great that you would side with a TERRORIST over Americans of another political party?",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "rradina",
        "time": "8 December, 2019",
        "context": "Of course they don't know where it is.  it's probably in Russia somewhere being studied by their scientists so they can steal technology.  Hopefully the United States has a kill switch that wipes everything out so that we don't lose any of our proprietary stuff.  Of course I could be naive.  they might already be on the inside stealing technology like during the Manhattan project",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Trilobite",
        "time": "8 December, 2019",
        "context": "Trump is playing games with Pukin instead of confronting him.  Russia is at its last leg now.",
        "good": "2",
        "bad": "6",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "MorningStar",
        "time": "8 December, 2019",
        "context": "Those pesky Russians always up to mischief.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "uspatriot9",
        "time": "8 December, 2019",
        "context": "Those Drones are way too easy to shoot down.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Teddy48",
        "time": "8 December, 2019",
        "context": "I wonder if United States wasn't in the region who then would the terrorist and Russian be attacking? Why should we even be in the region especially in the Middle East. Do we really need to be in the Middle East to make America Great",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "monroedoctrine",
        "time": "8 December, 2019",
        "context": "Maybe their computer game players are better than ours.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "socialismisareligion",
        "time": "8 December, 2019",
        "context": "Russia \"intervening\" on some side's behalf in Libya: BAD.\nU.S. \"intervening\" on some side in Libya: GOOD.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "DmitriDonskoi",
        "time": "10 December, 2019",
        "context": "Let's try again.  Fox censors you when you point out a factual error, so here we go:  When a Libyan participant in a Libyan civil war shoots down a drone, that's not \"Russian air defenses\" that did that.  Those would be \"Libyan air defenses.\"  \n\nWhen the Saudis shoot something down, you don't say \"US air defenses\" were in the fight, not even if the Saudis use US equipment manned by private US military contractors.  You say \"Saudi air defenses.\"   Let's keep the story straight.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    }
]