[
    {
        "user_name": "that.boy.aint.right",
        "time": "15 September, 2022",
        "context": ".45 Double-Stacks",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "freedom-liberty673",
        "time": "14 September, 2022",
        "context": "Those who break the law and fight with police, rather than comply, want to defund the police.  Police are an asset and essential to communities.  Stop attacking police.  Comply with law enforcement, stop breaking the law.  Criminals are the only ones attacking the police.",
        "good": "13",
        "bad": "0",
        "replies": [
            {
                "user_name": "mrmacktitties",
                "time": "18 September, 2022",
                "context": "Yield obey comply undertjreat of electrocution",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "azulthedefiler",
        "time": "14 September, 2022",
        "context": "The myth of Police brutality and \"too quick to violence\" needs to end. Present ONE case of an innocent non-criminal subject to this.  Just ONE. ",
        "good": "11",
        "bad": "0",
        "replies": [
            {
                "user_name": "1789defender",
                "time": "14 September, 2022",
                "context": "TRY READING TODAYS NEWS.  There are TWO of them.\n\nClear Creek, CO. >>  You find the other one.",
                "good": "0",
                "bad": "3",
                "replies": [
                    {
                        "user_name": "Vae_Victus",
                        "time": "15 September, 2022",
                        "context": "Still babbling little girl? \nYou people are the root of 68% of gun violence.  Let's educate the 13% on how to contribute to society instead of destroying it.\nPolice your own race instead of blaming everyone else.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "deplorableinfidel218",
                                "time": "15 September, 2022",
                                "context": "She pretends to care about police when she posts her bogus stats about cops being shot in red states, but you can see what she really thinks of police.",
                                "good": "3",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "user_name": "deplorableinfidel218",
                        "time": "15 September, 2022",
                        "context": "What does \"too quick\" mean to you?   The Clear Creek video shows officers talking to the man for over an hour trying to get him to come out.  In the end he had a knife and made a move for one of the officers near his door.  I probably wouldn't have fired, but I wasn't there and didn't see or know what those officers did.",
                        "good": "2",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "jamvee1942",
                        "time": "18 September, 2022",
                        "context": "Thug armed with a knife lunged at an officer and was shot . . .  Boo-Hoo.  One less criminal threatening people.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "picircle7",
                        "time": "18 September, 2022",
                        "context": "'Today's news'...  Did that include the officer's statement..?  Just do what the nice police officer tells you to do, and you'll be able to do it again tomorrow...",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "gottakag",
        "time": "15 September, 2022",
        "context": "Too many are too fat and lazy already.  All they need are more toys to play with....",
        "good": "0",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "gig73",
        "time": "15 September, 2022",
        "context": "I favor the good old \"technology\", GUNS!!!",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "1789defender",
        "time": "14 September, 2022",
        "context": "If you really want to do something to help our police officers, how about \"educating\" the politicians in the 28 GOP led states that do not regulate the private sales of firearms.\n\nIn those 28 GOP led states, that is where the VAST BULK of police officers are shot.",
        "good": "0",
        "bad": "16",
        "replies": [
            {
                "user_name": "dogbreath761",
                "time": "14 September, 2022",
                "context": "You again?  \n\nHow about taking a long walk in Chicago's Garfield Park neighborhood this Friday or Saturday evening.",
                "good": "7",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "CAB3448",
                "time": "15 September, 2022",
                "context": "democratic cities in red states...clarified for ya....Miami, Memphis, Atlanta, New Orleans, Louisville...just to name a few, and mostly the 13%...js",
                "good": "3",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "22889964",
                "time": "15 September, 2022",
                "context": "Stats or source please",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "deplorableinfidel218",
                        "time": "15 September, 2022",
                        "context": "Don't get her started.  She's the queen of bogus FBI stats.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "deplorableinfidel218",
                "time": "15 September, 2022",
                "context": "How about educating the politicians in liberal cities, where most of the violent crime is?\nIn those dim led states, that is where the VAST BULK of repeat offenders are committing violent crimes.  Dead and incarcerated criminals can't buy guns from private sales.",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "jga092",
        "time": "15 September, 2022",
        "context": "God bless our police officers,they are truly the thin blue line protecting us the best that they can from utter chaos.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rockdude49",
        "time": "14 September, 2022",
        "context": "The technology should be enhancements for a fully funded police force to provide better service to the communities they serve.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Patriot658676969",
        "time": "15 September, 2022",
        "context": "Gets the blm crowd to court quicker so they can be released to continue their destruction! ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "lioneldyck",
        "time": "14 September, 2022",
        "context": "The best way to support the police is for the DA's and Judges to actually enforce the laws. Don't release criminals and don't give them a slap on the wrist. If the police have provides enough information then deny bail as well.",
        "good": "17",
        "bad": "0",
        "replies": [
            {
                "user_name": "hapki259",
                "time": "14 September, 2022",
                "context": "They will not do it since Democrats stated they want defund police. Hate is what Democrat produces in fake news with it propaganda of hate the Constitution.",
                "good": "5",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "blackrifle026",
        "time": "21 September, 2022",
        "context": "The police could improve the public opinion of themselves, by getting rid of bad police officers.  ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "thinkitbuildit",
        "time": "15 September, 2022",
        "context": "All this money spent for high tech surveillance.\n  We already know who the criminals are.\n  Funny how Republican Counties run by Sheriffs that \nstand by the oath they have taken, do not have near the \nviolent crimes as Democratic Counties or repeat offenders.\n   Guess the republicans do not know what they are doing\nbecause supposedly we are destroying America and its democracy.\nFunny how I feel freedom all around me in the red Counties, \n then I visit a democratic City and all I see and feel is pain, \n   poverty from a selfish greedy ideology.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "picircle7",
        "time": "18 September, 2022",
        "context": "I'm sure technology is nice, but you can't beat eye-to-eye conversations and hands-on policing...  Defund Democrats.!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "gatorsr1",
        "time": "15 September, 2022",
        "context": "How about no contact speeding tickets. A camera unit in the police car snaps a pic of the \noffenders license plate and also records the speed of the offending vehicle and the results\nare sent to the court then to the driver's address for payment of the fine.",
        "good": "0",
        "bad": "1",
        "replies": [
            {
                "user_name": "display_name",
                "time": "15 September, 2022",
                "context": "Driver and car owner may not be the same. Who pays the ticket?",
                "good": "1",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "jamvee1942",
                        "time": "18 September, 2022",
                        "context": "The car owner (never lend your car to anyone).  If it's your kid, you'd probably wind up paying anyway.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "jamvee1942",
                "time": "18 September, 2022",
                "context": "In Egypt the cops didn't stop you to give you a traffic ticket unless there was an accident involved.  They recorded your license plate and when you went to renew you annual registration, you got hit with any traffic fines that were due or they confiscated your license plates.  Simple and efficient!",
                "good": "0",
                "bad": "1",
                "replies": []
            },
            {
                "user_name": "Winginit5278",
                "time": "20 September, 2022",
                "context": "They already have cameras on most toll bridges near where I live. That sounds kind of a similar concept. The biggest problem I see with that is that if somebody is driving dangerously, then knowing that they have a ticket might deter them from doing it on again on the way back home",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "mrmacktitties",
        "time": "19 September, 2022",
        "context": "Better stop shredding these compartmentalized papers and burning in fireplace shredder compartment",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mrmacktitties",
        "time": "19 September, 2022",
        "context": "The what like six in 78all these redundent contradictory laws",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "headed4heaven393",
        "time": "16 September, 2022",
        "context": "We can't make people become cops. If no one decent wants to be a cop, then we have to lower standards to get anyone to take the job...a la Mexico.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "djmaga",
        "time": "15 September, 2022",
        "context": "ALL politicians should take basic firearms training and learn the 4 cardinal rules of gun handling. They should learn State Gun Laws!!! They should also be required to take several \"ride alongs\" with Officers.\nIf they do not comply they are not Police supporters!",
        "good": "2",
        "bad": "0",
        "replies": [
            {
                "user_name": "headed4heaven393",
                "time": "16 September, 2022",
                "context": "And use of force trainings and simulations, so they see what few options police have.",
                "good": "3",
                "bad": "0",
                "replies": []
            }
        ]
    }
]