[
    {
        "user_name": "odysseus320",
        "time": "6 August, 2022",
        "context": "I’m 100% for winning the space race again. It’s vital for our national pride, national security , and achievement. But why are we sending “ Shaun” ? Send a daring person. Send an average citizen who is brave and knows the risks. That will show the world our character. ",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "slacktoad",
                "time": "6 August, 2022",
                "context": "NASA has already lost 17 astronauts, many under what were considered unnecessarily risky conditions. Sending a person on a first flight of a new spacecraft would not be seen as \"daring\", it would be seen as reckless and foolhardy.  If the spacecraft failed to make it back to Earth the idea of a person dying alone in space and their body forever in orbit would sour Americans on space travel for generations.\n\nEven during the '60s we never launched humans on new rockets, in fact the only rocket in the world to ever have humans on its maiden flight was the space shuttle.  NASA wanted to do the first flight by remote control, but it was going to land in California and it was considered unacceptable to have a giant glider flying over highly populated SOCAL with no pilots on board.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "odysseus320",
                        "time": "7 August, 2022",
                        "context": "If that person knows the risks , and his / her acceptance of that risk is universally conveyed , then that person is a pioneer. It sends the signal we are going to be a nation that makes space travel an accessible reality to common people. Serving common people. That is a bragging right that should be won by the greatest nation on earth. We are already doing it with billionaires and their cliques , with Blue Origins and Virgin Galactic. That is visionary. We need risk takers. Ones who voluntarily divorce themselves from making a space company liable. That is a pioneering spirit. Those astronauts died knowing the risks. Has that stopped our drive to reach the moon ? And soon, Mars ? Human progress  has been built on taking existential risks. If we do not do it , a brutal nation like China will do it. We do not want a CCP dominated space domain. We need more than just trained astronauts and billionaire elites being the stewards of space. We need US. ",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "slacktoad",
                                "time": "7 August, 2022",
                                "context": "It doesn't matter whether someone accepts the risk, there's always somebody ready to do something dangerous to get his name in the history books.  But NASA is trying to repair its reputation after two shuttle crews were killed because NASA stretched the boundaries of safety.\n\nTaking risks may be may be noble and worthwhile if there's no other way to achieve something great, but in this case the job of testing a new rocket can be, and always has been, easily done remotely. \n\nSo putting someone on board is nothing more than a publicity stunt, like a guy jumping off a skyscraper with a parachute. That doesn't make America look bold and \"visionary\", it make us look like foolish attention-seeking stunt performers, like on some kind of reality TV show.  \n\nAnd even the Chinese and Russians never put humans in the first launches of their rockets.",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "GFM2012",
                "time": "15 August, 2022",
                "context": "Send Joe Biden. For all our sakes.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "fakeitgoodnasa",
        "time": "4 August, 2022",
        "context": "Well if you’re going to fake another lunar mission, you might as well fake it with a cartoon character.",
        "good": "1",
        "bad": "4",
        "replies": [
            {
                "user_name": "GFM2012",
                "time": "15 August, 2022",
                "context": "Lunatic. LITERALLY.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "siriusdogstar079",
        "time": "4 August, 2022",
        "context": "Why are we wasting billions of tax payers' money on sending stuffed animals to the moon when that money could be better spent giving tax breaks to billionaires?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dande-man",
        "time": "4 August, 2022",
        "context": "For all of the negative comments. Going to the moon is not a waste of money. Like all good things government, anything they do costs to much. The SLS at 2 billion per launch is not sustainable. It basically takes 10% of NASAs entire yearly budget to launch one rocket..not including the payload. Simple math shows this is basically a non-starter. We should spend that money more efficiently, say with SpaceX, to get us there OR find a way to reduce the cost of SLS.  Going to the moon could prove to be invaluable if we, for example, mine hydrogen 3 which has the potential to solve our energy problems, set up science outposts to expand our knowledge of the universe, and forge our way to the planets providing a way to make mankind and life itself sustainable somewhere other than earth.",
        "good": "3",
        "bad": "0",
        "replies": [
            {
                "user_name": "crustyashchief",
                "time": "15 August, 2022",
                "context": "Mine Hydrogen?  Seriously?  That doesn't need the moon bub.  Electrolysis, powered by nuclear reactors would fill tanks and tanks of hydrogen without much effort at all.  Go back to basic chemistry class.",
                "good": "0",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "GFM2012",
                        "time": "15 August, 2022",
                        "context": "You need to go back and take a class in thermodynamics. You probably believe that EVs are “clean” because they run on electricity, regardless of the ultimate energy source (coal and oil).",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "dande-man",
                        "time": "15 August, 2022",
                        "context": "Maybe you should look up what hydrogen 3 is and then we can have a conversation. You clearly have no idea what you are talking about.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "GFM2012",
                "time": "15 August, 2022",
                "context": "Mined hydrogen-3 from the moon will “solve our energy problems.” We might as well stick up on green cheese while we’re there. ",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "dande-man",
                        "time": "15 August, 2022",
                        "context": "True we have about as much chance to power the country green cheese as we do with solar panels and wind generators. They cannot do the job. Why don't you do some reading and see how Germany is doing.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "YetHereYouAre",
                "time": "23 August, 2022",
                "context": "Should have sent a Kerbal....",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "dan5047628",
        "time": "4 August, 2022",
        "context": "Did they remind them why the USA quit going to the moon? \nThere isn't anything there but dirt.",
        "good": "0",
        "bad": "2",
        "replies": [
            {
                "user_name": "dande-man",
                "time": "4 August, 2022",
                "context": "Wrong. The \"dirt\" you speak of could prove to be invaluable to us. There is H3 there which could prove to solve our energy problems. Also we can put science outposts and telescopes there to help us better understand the universe. There are many reasons to go to the moon not the least of which is to explore and learn.",
                "good": "4",
                "bad": "1",
                "replies": []
            },
            {
                "user_name": "odysseus320",
                "time": "6 August, 2022",
                "context": "Yeah. Until China puts weapons up there. Think they won’t do it ? Science fiction? That’s how they think. Controlling space lanes is next. ",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "stephandrake",
                "time": "8 August, 2022",
                "context": "Wrong. NASA spokesman and astronaut Don Petit annouced five years ago that NASA \"destroyed\" the technology to travel to the moon \"and it's been a painful process to rebuild that technology\". \nIn other words: \"NASA never really went to the moon\".\nYou can verify all this with search of your own. Always a good idea to research the truth for yourself. Remain a sheep and the crooks running NASA will close the door and laugh at you.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "GFM2012",
                        "time": "15 August, 2022",
                        "context": "OMG we still have people like this. Flat earth, too?",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "stephandrake",
                                "time": "18 August, 2022",
                                "context": "OMG - we still have people like this, disregarding the words of NASA spokesman and former astronaut? Russian collusion, too?",
                                "good": "0",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "stephandrake",
                                        "time": "18 August, 2022",
                                        "context": "To anyone curious, search for one of the best examples of that \"lost\" technology: NASA's own close up photographs of the Lunar Module. It is an absolute joke, constructed with laughably flimsy side panels, scotch tape, curtain rods, foil ... you have got to see it for yourself to really appreciate it. Well worth the laugh alone. :-) Don't miss it.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "jimjames17",
        "time": "4 August, 2022",
        "context": "Sean na Keeragh? Is he an Orangeman?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "drumsandgunsandgunsanddrums",
        "time": "5 August, 2022",
        "context": "I thought that was Warren the Ape when I saw the thumbnail at first.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "odysseus320",
        "time": "6 August, 2022",
        "context": "NASA needs to learn to expedite / trim its bureaucracy. Space X runs circles around it. On the day Space X sent the first private manned space flight into orbit, it was a milestone. We were back in the game. But it barely got attention. On that same day , A three time convicted felon got the hero’s applause , George Floyd. We need an accelerated moon and Mars program. For national security. Something that can’t be eclipsed by a felon passing a counterfeit 20. ",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "GFM2012",
                "time": "15 August, 2022",
                "context": "But what about Obama’s Muslim outreach program for NASA? You know, to make them feel better about themselves…",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "display_name",
        "time": "4 August, 2022",
        "context": "To boldly go where no sheep has gone before. - with apologies to Mr. Roddenberry.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "conaug",
        "time": "5 August, 2022",
        "context": "Send Pelosi instead",
        "good": "2",
        "bad": "0",
        "replies": [
            {
                "user_name": "bsmeretired",
                "time": "14 August, 2022",
                "context": "and leave her there.... please!",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "stephandrake",
        "time": "8 August, 2022",
        "context": "NASA is both a criminal organization and an extreme embarrassment to a once great nation called \"America\".",
        "good": "1",
        "bad": "1",
        "replies": [
            {
                "user_name": "bsmeretired",
                "time": "14 August, 2022",
                "context": "Have you confused NASA with the Democratic Socialist party?  One has brainiacs, the other has maniacs.",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "jessiam",
        "time": "9 September, 2022",
        "context": "What a great way to get kids to think about space exploration!  Years ago, NASA involved Snoopy in the space program.  That got me thinking a bit about space as a kid.  I think Shaun the Sheep has a lot more impact with kids around the world than Snoopy did!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "CorrupticratParty",
        "time": "15 August, 2022",
        "context": "Godspeed Sean for a safe launch and safe lambding! 🐑",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "alvawolf",
        "time": "7 August, 2022",
        "context": "Simon pegg should do Shaun of the sheep parody in space=)",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "crustyashchief",
        "time": "15 August, 2022",
        "context": "That's cool.  Shaun the Sheep is a cool show, great for any age and because of how it is done, great for any language because everything is done in a fashion that uses no language.  For me, and I am mid fifties, it's a way to relax to something silly that I can still enjoy at my age.  There's quite a few episodes of Shaun wanting to go into space or has aliens in them.  If you haven't seen them, sit with your kids, or grand-kids and enjoy laughter with them.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "DarwinIsStillRight",
        "time": "6 August, 2022",
        "context": "And Wallace and Gromet will fill the other two seats .. .  They heard the moon was made of cheese . .",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "CorrupticratParty",
                "time": "15 August, 2022",
                "context": "Oh lord no! Wallace and Gromet only appeal to lobotomy patients.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    }
]