[
    {
        "user_name": "Scruffynerfherder",
        "time": "2 September, 2022",
        "context": "I long for peace like that day again. ",
        "good": "23",
        "bad": "0",
        "replies": [
            {
                "user_name": "DSSDarkstorm",
                "time": "2 September, 2022",
                "context": "Ok, well drop a couple more nukes.",
                "good": "3",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "Mr8ch855",
                        "time": "2 September, 2022",
                        "context": "On Moscow and Beijing...",
                        "good": "3",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "DSSDarkstorm",
                                "time": "2 September, 2022",
                                "context": "We'll name them Fried Eyes and Big Nose.",
                                "good": "3",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "Mr8ch855",
                                        "time": "2 September, 2022",
                                        "context": "How about Caviar and Sushi?\n(two fish products i hate)",
                                        "good": "1",
                                        "bad": "0",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "user_name": "rubyreddress",
                        "time": "2 September, 2022",
                        "context": "I can think of a few countries that should be “cat boxes”!!!",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "1951stu",
                        "time": "2 September, 2022",
                        "context": "Or get rid of Biden.",
                        "good": "2",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "*It_Is_Written",
        "time": "2 September, 2022",
        "context": "** Before the \"Mighty Mo\" was stolen by Hawaii to be put on display, it was home ported for many years in Bremerton, Washington at the naval shipyard. In Bremerton, I visited her on four occasions always bringing new guests to witness this great naval vessel where the signing of the WWII peace declaration was held.\n  A grand piece of American History, my fellow Washingtonians were grieved at the political decision to tow her to Hawaii thus making it difficult for most Americans to visit her. Now, she can only be seen by those making the trip to Hawaii and thus most Americans will never get the chance to pay their respects to this great piece of American history. Truly a shame that politics was the only reason she was stolen away...",
        "good": "9",
        "bad": "3",
        "replies": [
            {
                "user_name": "alwaysreagan",
                "time": "2 September, 2022",
                "context": "Stolen?  It's in PH as a symbol of the end of the war in the pacific, right there near the USS Arizona, the beginning of the pacific war.  Are there any other war items you and other Washingtonians would like to claim as their own?  Just how many more visits do you deserve?",
                "good": "9",
                "bad": "1",
                "replies": []
            },
            {
                "user_name": "Mr8ch855",
                "time": "2 September, 2022",
                "context": "Was she \"stolen\" or \"transferred\"? I'm pretty sure the Skipper has to go where the DoD tells him/her to go -personal feelings aside..",
                "good": "2",
                "bad": "1",
                "replies": []
            },
            {
                "user_name": "talos1",
                "time": "2 September, 2022",
                "context": "The USS Missouri is currently on display at Pearl Harbor, in Oahu, Hawaii.  Did you know that Hawaii is part of the USA?  Anyone can get on an aircraft, and fly to Hawaii, as I have done.  I spent an entire day at Pearl Harbor, but I didn't see everything, so I need to go back.  Also, don't miss the US Army Coast Artillery Museum, at Waikiki Beach.\nI also did a main deck tour of USS Missouri, about 1988, when she was back in service.  That was in San Francisco harbor.\nUSS Missouri was part of the Iowa Class of USN battleships, and was first commissioned in  1944.  She also served during the Korean War against communist \"North\" Korea, and Communist China, and during the Gulf War of 1991.",
                "good": "8",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "q2xl034",
                        "time": "2 September, 2022",
                        "context": "The first shots of the Gulf War were fired from the “Mighty Mo,” as cruise missiles were launched from her.",
                        "good": "3",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "jobudclown",
                        "time": "2 September, 2022",
                        "context": "Hawaii gave us O'Bama. According to the fake birth certificate. Do I look impressed? No.",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "political_pessimist",
                "time": "2 September, 2022",
                "context": "In one powerful visit you can see the start of WW2 and the end of WW2.  I couldn’t think of a more appropriate way to honor the sacrifices of the greatest generation.",
                "good": "5",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "iceman25",
                "time": "2 September, 2022",
                "context": "The state of Washington had their chance to keep a truly iconic battleship of WWII.  The USS Washington was the only US battleship in WWII to square of with another nations battleship when she annihilated the Japanese battleship Kirishima at Guadalcanal.\nThe ship was offered to the state, but they didn't want her, so she was scrapped instead.  You can visit her sister ship, the USS North Carolina, in Wilmington, NC.",
                "good": "1",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "d'artagnan0962",
                "time": "2 September, 2022",
                "context": "I worked at Bremerton for many years and had the privilege of standing watches on the Missouri while it was there (impressive ship, inside and out!). I watched when it was towed from Bremerton for the last time and by lucky coincidence I was in Hawaii when it arrived there. They towed it parallel to Waikiki on a long cable so it looked like it was under power, the sight made chills run down my spine. I was at Pearl Harbor the next day, adjacent to the channel entrance when it was towed in, it was an awe inspiring sight. I was sorry to see her leave Bremerton but she is definitely where she belongs, a permanent symbol in the place where the war started with a terrible defeat that in the end victory was ours!\n\nI've seen many an aircraft carrier and they are indeed impressive warships with tremendous striking power for sheer pyschological impact they don't hold a candle to the sight of a battleship like the Mighty Mo with those huge guns.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "drtyburd",
        "time": "2 September, 2022",
        "context": "I probably needed to reflect on that if I wasn't too worried about the highly efficient nature of your presidentes destruction of what all those heroes fought for.",
        "good": "1",
        "bad": "1",
        "replies": [
            {
                "user_name": "Mr8ch855",
                "time": "2 September, 2022",
                "context": "huh? Not quite sure what you're saying there, buddy..",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "drtyburd",
                        "time": "2 September, 2022",
                        "context": "Thank you for being honest.  I will say a prayer for you.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "Mr8ch855",
                                "time": "2 September, 2022",
                                "context": "I'm still trying to decipher what you said. Care to drop a hint?",
                                "good": "0",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "drtyburd",
                                        "time": "2 September, 2022",
                                        "context": "I dont know a way to do it that's not furthermore condescending, so I'll stop and let you have whatever victory you are after.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "tired_of_this535",
        "time": "2 September, 2022",
        "context": "I've been to the USS Arizona but the Mo wasn't there when I went.  It's on my bucket list but as someone who lived through WWII as a child, I need to hurry up.  In my opinion, we were too kind to the Japanese.  After what they did in Nanking, Bataan, Bonin Island and other places they got off easy.  I would have crispy crittered the whole country.",
        "good": "24",
        "bad": "2",
        "replies": [
            {
                "user_name": "q2xl034",
                "time": "2 September, 2022",
                "context": "They didn’t receive the half of what they deserved for their many atrocities during WW2.",
                "good": "12",
                "bad": "2",
                "replies": []
            },
            {
                "user_name": "talos1",
                "time": "2 September, 2022",
                "context": "Japan went to war against the US and Britain, after Churchill and FDR cut off all supplies of oil to Japan.  Before the oil embargo, Japan considered Stalin's \"evil communist empire\" as the main potential enemy.  Stalin was worried that Japan might join the European Axis Powers in the war against the USSR.   The Japanese Army favored this course of action, especially since there were some oilfields on Northern Sakhalin Island, which was controlled by the USSR.\nFor this reason, Stalin did his best to promote a war between the USA and Japan.  In the end, Japan chose to go after the oilfields in Dutch Indonesia, which meant war with the USA and Britain.  Japanese Navy bombers sank HMS Prince of Wales and HMS Repulse on Dec 10 1941, near Singapore.  Note that Japan was allied with the British Empire during WW-1, and took over the German colony in China (Tsingtau), and the German Pacific Islands. \nSome interesting books:\n\"The New Dealer's War\", by Thomas Fleming\n\"Stalin's War\", by Sean McMeeken\n\"Stalin's Secret Agents\", by Evans and Romerstein\n\"Infamy\", by John Toland",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "exiledcitizen",
        "time": "2 September, 2022",
        "context": "Will the U.S. be successful in taking Guadalcanal again as CHINA becomes the new controller of the Solomon Islands ?  I doubt it !",
        "good": "6",
        "bad": "0",
        "replies": [
            {
                "user_name": "healfrac",
                "time": "2 September, 2022",
                "context": "I think it will be Australian and New Zealand troops  that will be leading the charge this time.",
                "good": "5",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "Mr8ch855",
                "time": "2 September, 2022",
                "context": "sleepy joe will just hand it over to them..\nWhere is Pappy Boyington when you need him?!",
                "good": "7",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "q2xl034",
                        "time": "2 September, 2022",
                        "context": "We need more men like Pappy Boyington and his Black Sheep Squadron who flew the bent wing bird known as the F4U Corsair, or as the Japanese referred to them as, “Whistling Death.”",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "leftturnedright",
        "time": "2 September, 2022",
        "context": "Japan owes US serviceman’s families reparations.",
        "good": "5",
        "bad": "1",
        "replies": [
            {
                "user_name": "mouseonthemoon832",
                "time": "2 September, 2022",
                "context": "Free Hondas and Toyotas for all!",
                "good": "4",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "leftturnedright",
                        "time": "2 September, 2022",
                        "context": "Sushi and personal watercraft.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "Mr8ch855",
                        "time": "2 September, 2022",
                        "context": "Flat screen TVs and those really weird square water melons they have...",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "elmerjfudd640",
        "time": "2 September, 2022",
        "context": "Joe biden will be the next to surrender on the Mighty Mo",
        "good": "5",
        "bad": "0",
        "replies": [
            {
                "user_name": "stingray075",
                "time": "2 September, 2022",
                "context": "Biden doesn't deserve to come aboard the Mighty MO ",
                "good": "3",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "troyd4st",
                "time": "2 September, 2022",
                "context": "Biden thinks the Mighty Mo is one of the three stooges.",
                "good": "2",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "specialagentzero",
        "time": "2 September, 2022",
        "context": "Joe surrenders everyday.",
        "good": "8",
        "bad": "1",
        "replies": [
            {
                "user_name": "Mr8ch855",
                "time": "2 September, 2022",
                "context": "His Depends surrender every hour: \"Enough! Please stop with the prune juice!\"",
                "good": "4",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "CorrupticratParty",
                        "time": "2 September, 2022",
                        "context": "Talk about an atrocity!",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "Costambar",
        "time": "2 September, 2022",
        "context": "Japan only surrendered because of the atomic bombs dropped. But for what I have seen.  In the battlefield.  They we're actually winning.",
        "good": "1",
        "bad": "16",
        "replies": [
            {
                "user_name": "SickFreak",
                "time": "2 September, 2022",
                "context": "you really need to learn history. ",
                "good": "5",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "Costambar",
                        "time": "2 September, 2022",
                        "context": "So what was the need for the atomic bombs?? If America was winning why the bombs??",
                        "good": "0",
                        "bad": "1",
                        "replies": [
                            {
                                "user_name": "Mr8ch855",
                                "time": "2 September, 2022",
                                "context": "Shortest path to victory. If you had read your history, you would have discovered that the US was planning Operation Downfall -the land invasion of the Japanese islands, which was planned for November, 1945. Had the atom bombs not been used, we would have gone forward with that invasion. Operation Downfall would have made D-Day look like a beach picnic. The War Department was estimating US casualties in the millions; as the Japanese had demonstrated that they would not surrender..",
                                "good": "4",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "tfbaby",
                                        "time": "2 September, 2022",
                                        "context": "You sir are very correct.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": []
                                    },
                                    {
                                        "user_name": "Costambar",
                                        "time": "2 September, 2022",
                                        "context": "The atomic bombs we're dropped in civilian crowded cities.  Not military targets.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": [
                                            {
                                                "user_name": "Mr8ch855",
                                                "time": "2 September, 2022",
                                                "context": "Um, wrong. Hiroshima had a rather large munitions plant, a massive army base, as well as being the HQ of the 2nd (Japanese) Army. Nagasaki wasn't originally selected as a target, as Maj. Sweeney and his B29, Bocscar, intended to Bomb Kokura, but there was too much cloud cover that morning. Nagasaki was a target of opportunity..",
                                                "good": "2",
                                                "bad": "0",
                                                "replies": []
                                            },
                                            {
                                                "user_name": "tired_of_this535",
                                                "time": "2 September, 2022",
                                                "context": "During all out war, there are no civilians.  As a civilian working in an aerospace defense plant I always considered myself a target.",
                                                "good": "2",
                                                "bad": "0",
                                                "replies": [
                                                    {
                                                        "user_name": "Mr8ch855",
                                                        "time": "2 September, 2022",
                                                        "context": "Sounds like something my grandfather once said; \"In war, boy, there are only two kinds of people, the winners, and the dead.\" He saw action in the Ardennes Forest and the Ruhr, 1944/45",
                                                        "good": "0",
                                                        "bad": "0",
                                                        "replies": []
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "Mr8ch855",
                "time": "2 September, 2022",
                "context": "Um, no they weren't. They were beaten by early 1945. When the B29s Operation Meetinghouse (the firebombing campaign) in the spring, it wasn't long until 2/3 of Japan was obliterated and that was with napalm. The 2 atom bombs were just icing on that cake -probably meant to scare the Russians more than force the defeat of Japan...",
                "good": "1",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "tfbaby",
                        "time": "2 September, 2022",
                        "context": "The Russians also declared war on Japan immediately after the bombs, rolling over them in China. Japan feared occupation by Russia much more than by the US. Stalin would have literally gutted them.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "Mr8ch855",
                                "time": "2 September, 2022",
                                "context": "By 1945, we knew we were going to be in a Cold War with Russia. Stalin was in no position to occupy Japan, let alone attack them. His forces in the East were stretched super thin and he was having issues with the Chinese/Mongolian border -as China and Russia fought several border wars before, during, and after WWII. We dropped the atom bombs (i think) to make Stalin think twice about messing with us as Japan was going to be our occupation sphere..",
                                "good": "0",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "tfbaby",
                                        "time": "2 September, 2022",
                                        "context": "Partly correct, but you are wrong about Stalin and Japan, he was rolling over them in Manchuria after the forces were release from their struggle with Germany. Japan surrendered not from the bombs alone, they feared Stalin. That was the original subject, you strayed. Japanese history is where I encountered that perspective.",
                                        "good": "1",
                                        "bad": "0",
                                        "replies": [
                                            {
                                                "user_name": "Mr8ch855",
                                                "time": "2 September, 2022",
                                                "context": "Correct. But Stalin never had designs on Japan, as I stated, we and the Japanese thought he did.",
                                                "good": "1",
                                                "bad": "0",
                                                "replies": []
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "user_name": "tanker335",
                        "time": "2 September, 2022",
                        "context": "That is an assumption that liberals in the 60's convinced themselves to be fact. Truman didn't give a seconds thought to Russia. This was all about avoiding the invasion of Japan.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "Mr8ch855",
                                "time": "2 September, 2022",
                                "context": "I never said it was fact, it's my assertion -based on documents that were found after the US left Japan in 1951. MacArthur (head of the US occupying forces) had serious thoughts about Russia being so close and had expressed his concerns about Soviet interference. The atomic bombs, therefore, in my opinion, served two purposes..",
                                "good": "2",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "tanker335",
                                        "time": "2 September, 2022",
                                        "context": "MacArthur wasn't in the loop concerning the Manhattan Project. I'm sure he had his post war concerns but that was to come after the bombs were used.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": [
                                            {
                                                "user_name": "Mr8ch855",
                                                "time": "2 September, 2022",
                                                "context": "No, he wasn't aware of the particulars of the Manhattan Project, until sometime in late July -but he did know something very big was in the works..",
                                                "good": "0",
                                                "bad": "0",
                                                "replies": [
                                                    {
                                                        "user_name": "tanker335",
                                                        "time": "2 September, 2022",
                                                        "context": "Truman. who authorized the attack, didn't know about it the day FDR died. That is how tight a lid they kept on this.",
                                                        "good": "1",
                                                        "bad": "0",
                                                        "replies": [
                                                            {
                                                                "user_name": "Mr8ch855",
                                                                "time": "2 September, 2022",
                                                                "context": "True, as Truman wasn't a very popular fellow around the WH in those days; i suspect FDR's cabinet kept him out of a lot of things..",
                                                                "good": "0",
                                                                "bad": "0",
                                                                "replies": [
                                                                    {
                                                                        "user_name": "tanker335",
                                                                        "time": "2 September, 2022",
                                                                        "context": "They didn't know who he was. Fun fact. FDR met with Truman a total of two times in his fourth term.",
                                                                        "good": "0",
                                                                        "bad": "0",
                                                                        "replies": []
                                                                    }
                                                                ]
                                                            }
                                                        ]
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            },
                            {
                                "user_name": "Mr8ch855",
                                "time": "2 September, 2022",
                                "context": "Truman didn't care about the Russians, not yet anyway -but MacArthur did, and the two didn't like one another very much. MacArthur was thinking ahead to the Cold War, Truman was still stuck in WWII mode..",
                                "good": "2",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "tfbaby",
                                        "time": "2 September, 2022",
                                        "context": "This is accurate, according to a conglomeration of written records.",
                                        "good": "1",
                                        "bad": "0",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "user_name": "talos1",
                        "time": "2 September, 2022",
                        "context": "Actually, Japan was defeated when their Navy and merchant marine were almost totally destroyed, which was achieved by early 1945.  At that point, they had no means to continue the war.  An invasion, of the use of atomic weapons was not necessary to get them to the \"peace table\".\nWe should have used the atomic weapons against Stalin's \"evil communist empire\" the USSR, if necessary, to get the Red Army and NKVD out of Eastern Europe (including the Baltic States and Ukraine).  Stalin didn't get his first atomic weapon until 1945, even with the help of his agents in the FDR administration, at within the Manhattan Project.  Stalin gave Kim Il-sung the \"go ahead\" to invade \"South\" Korea in 1950.\nSome interesting books:\n\"Stalin's War\", by Sean McMeeken\n\"Stalin's Secret Agents\", by Evans and Romerstein\n\"Churchill's Third World War\", by Jonathan Walker",
                        "good": "1",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "Mr8ch855",
                                "time": "2 September, 2022",
                                "context": "But don't forget that Japan itself, was still a threat, hence Operation Downfall -which was set to go In November. It was either drop the bombs and hope Japan surrenders, or invade and cost millions of American lives -not to mention wiping out the Japanese people.",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "gatorsr1",
                "time": "2 September, 2022",
                "context": "My recommendation would be not to say something like to any WWII Veterans still\naround. You'll get a lesson in history if you do if they don't knock your head off..",
                "good": "2",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "Mr8ch855",
                        "time": "2 September, 2022",
                        "context": "And to most of them, their memories are still fresh when it comes to that time; be prepared for a real lesson in history should you encounter one..",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "tanker335",
                "time": "2 September, 2022",
                "context": "The Japanese public figured out the war wasn't going their way when all of Japans \"great victories\" were getting closer and closer to home.",
                "good": "6",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "Mr8ch855",
                        "time": "2 September, 2022",
                        "context": "The smart ones always knew better; you can't keep millions of soldiers, sailors, and airmen from writing letters back home...",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "tanker335",
                                "time": "2 September, 2022",
                                "context": "Between censorship and a sunken merchant fleet you'd be surprised. The infamous Letter's from Iwo Jima never left the island.",
                                "good": "0",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "Mr8ch855",
                                        "time": "2 September, 2022",
                                        "context": "Like us, the Japanese ground-pounder often wrote in code. More information made it back to the home islands than most people realize. My own grandfather's letters from Germany were written in code, every 10th, 11th, and 12th letter, across the 1st, 2nd, 3rd and so-on sentence spelled out a German town or village he went through. My grandmother showed me his letters and his system",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "gabechzz",
                "time": "2 September, 2022",
                "context": "No. They were getting ready to surrender anyways after being fire bombed into nothing. But the. you can't give out loans to rebuild a country that hasn't been destroyed. There was no logical or strategic reason for kamikaze attacking pearl harbor other than to bring the US into war. Which doesn't make sense bc we wasn't going back to war with everything going on. Why fly halfway around the world attack a few ships and then do nothing to capitalize afterwards? But just sit back and wait for retaliation that wouldn't of come without pearl harbor? For a country that specialized in warfare for a thousand years, makes zero sense. Unless someone wanted Japan to be the way it is now.",
                "good": "0",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "talos1",
                        "time": "2 September, 2022",
                        "context": "There were no Kamikaze involved in the Pearl Harbor attack, on Dec 7, 1941.  Japan went to war against the US and Britain, after Churchill and FDR established the oil embargo against Japan, in 1941.  They attacked to US fleet at Pearl Harbor, and the British fleet at Singapore, prior to capturing the oilfields in the Dutch Indonesia.",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "BookLover@Heart840",
        "time": "2 September, 2022",
        "context": "Too bad half the people in this nation now think America isn’t free enough and that they don’t have enough civil rights. If we had lost that war minorities wouldn’t exist. ",
        "good": "32",
        "bad": "1",
        "replies": [
            {
                "user_name": "Mr8ch855",
                "time": "2 September, 2022",
                "context": "Take out the words \"civil rights\" and put in the word \"freebies\" and you've nailed it..",
                "good": "4",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "alvawolf",
                "time": "2 September, 2022",
                "context": "Not sure if it’s true but remember hearing a story awhile ago at a NATO conference in France that a U.S. general  over heard a frenchy say why do we have to speak english at these conferences.  U.S. general replied if it wasn’t for us you’d be speaking German",
                "good": "2",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "bigjoemufferaw999",
        "time": "2 September, 2022",
        "context": "The Japanese culture seemed so alien to Westerners at that time. They would never surrender, very few prisoners were taken. They would volunteer for kamikaze missions and their treatment of POW's was horrendous. That's why the atomic bombs were deemed necessary.",
        "good": "8",
        "bad": "0",
        "replies": [
            {
                "user_name": "gabechzz",
                "time": "2 September, 2022",
                "context": "They were deemed necessary bc they had to be used on a live city to show what they were capable of to the world. Japan was bombed into oblivion before the atomic bombs were ever dropped. Paper and wood didn't hold up well. There was zero other reason for using those bombs. We produced enough tanks and planes and arms to make California 60 billion dollars. All those planes in that photo? Why bring another opponent into war with you when your already invading several countries? And the US had already said they wasn't returning to war just prior to pearl harbor. But being attacked, nobody asked any questions. ",
                "good": "0",
                "bad": "7",
                "replies": [
                    {
                        "user_name": "Mr8ch855",
                        "time": "2 September, 2022",
                        "context": "Not quite. Had the atom bombs not been used, we would have had to invade the Japanese home islands. If we thought resistance was ferocious on Okinowa, just think what going house-to-house in Tokyo would have been like. It was either the atom bombs or Operation Downfall -where the War Department was predicting 7-figure US casualties. The Japanese civilian populace would have been obliterated for sure. A tough decision, but the right one.",
                        "good": "6",
                        "bad": "1",
                        "replies": [
                            {
                                "user_name": "talos1",
                                "time": "2 September, 2022",
                                "context": "The Japanese Navy and merchant marine was destroyed by early 1945.  At that point, Japan did not have the imports of food, oil, coal, and steel to enable them to continue the war.  They would have been forced to the \"peace table\", without an invasion, or without the use of atomic weapons.\nOur atomic weapons would have been more useful in forcing Stalin's Red Army and NKVD out of Eastern Europe (including Poland, the Baltic States, and Ukraine).  The communist dictator didn't get his first atomic weapon until 1949.  He launched the Korean War in 1950.",
                                "good": "3",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "Mr8ch855",
                                        "time": "2 September, 2022",
                                        "context": "Japan may not have been able to field a modern, mechanized fighting force, but the civilian population was being whipped up into a frenzy -how Americans were going to eat their children and so-on. War Department estimates for the invasion put the Japanese civilian casualties at 90%+. Operation Downfall was in its final preparations. It was going to happen, as ships and men were being transferred out of Europe and pre-positioned in Australia, Hawaii, anywhere they could put them. The Japanese were not concerned about \"going to the peace table\" in the least -they were beaten by early 1945, yet they still unleashed the Kamikaze on our ships -those are not the actions of a nation that is ready or willing to negotiate for peace..",
                                        "good": "2",
                                        "bad": "0",
                                        "replies": [
                                            {
                                                "user_name": "talos1",
                                                "time": "2 September, 2022",
                                                "context": "Japan was putting out \"peace feelers\" via Sweden and the USSR, before the dictator Stalin launched his invasion of Manchuria and Korea.  The Battle of Okinawa (which was part of the Japanese homeland) took place in April of 1945, which resulted in the sinking of the last two major warships of the Japanese Navy, and the destruction of about 1500 Japanese Army and Navy aircraft.\nWith all imports of food, oil, coal, and steel cut off, Japan had no means to continue the war, whether or not we invaded, or used atomic weapons.  Eisenhower and MacArthur agreed with this blockade strategy.  \nThe Japanese government was looking for a way out of the war, as long as Stalin's communist \"barbarians\" were kept out of Japan.  Stalin did manage to grab the Kuril Islands and South Sakhalin Island.  Anyway, our atomic weapons would have been more useful against Stalin's communist empire, the USSR.\nSome interesting books:\n\"The New Dealer's War\", by Thomas Fleming\n\"Stalin's War\", by Sean McMeeken\n\"Stalin's Secret Agents\", by Evans and Romerstein\n\"Churchill's Third World War\", by Jonathan Walker",
                                                "good": "0",
                                                "bad": "0",
                                                "replies": []
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "recon23",
                "time": "2 September, 2022",
                "context": "Maybe they forsaw drag queen story hours.",
                "good": "4",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "repmujnoom",
        "time": "2 September, 2022",
        "context": "wonder what news programs & web sites will mention it? & I'm sorry but there is NO way we could gear up manufacturing & field the fighting military that won that war today, much have the citizens chip in like they did then.",
        "good": "20",
        "bad": "0",
        "replies": [
            {
                "user_name": "canadianlivinginus",
                "time": "2 September, 2022",
                "context": "The next war will be cyber.",
                "good": "0",
                "bad": "3",
                "replies": []
            },
            {
                "user_name": "toomuchdebt",
                "time": "2 September, 2022",
                "context": "You are right in what you say.",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "Yeah,So?",
        "time": "2 September, 2022",
        "context": "Once know as VJ Day and celebrated like July 4th. Same for VE Day.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "38swchp",
        "time": "2 September, 2022",
        "context": "It's not a World War unless France surrenders.",
        "good": "5",
        "bad": "0",
        "replies": [
            {
                "user_name": "jimjames17",
                "time": "2 September, 2022",
                "context": "You need a history book, they didn't surrender in WW1",
                "good": "1",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "38swchp",
                        "time": "2 September, 2022",
                        "context": "Maybe not officially but you wouldn't have known it.",
                        "good": "0",
                        "bad": "1",
                        "replies": [
                            {
                                "user_name": "jimjames17",
                                "time": "2 September, 2022",
                                "context": "Actually they fought up until the victory and lost more men fighting than the UK did",
                                "good": "0",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "Mr8ch855",
                                        "time": "2 September, 2022",
                                        "context": "France lost nearly twice as many men in WWI as the Brits..",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": [
                                            {
                                                "user_name": "jimjames17",
                                                "time": "2 September, 2022",
                                                "context": "I wouldn't doubt it it",
                                                "good": "1",
                                                "bad": "0",
                                                "replies": []
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "adrianosmoto760",
        "time": "2 September, 2022",
        "context": "They should have let the Big Dog alone that was asleep on the porch . They wont ever make that mistake again .",
        "good": "10",
        "bad": "0",
        "replies": [
            {
                "user_name": "Mr8ch855",
                "time": "2 September, 2022",
                "context": "Yamamoto warned the High Command, but they didn't listen...",
                "good": "13",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "q2xl034",
                        "time": "2 September, 2022",
                        "context": "Yes indeed, they awakened the sleeping giant and filled him with a terrible resolve.",
                        "good": "5",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "Mr8ch855",
                                "time": "2 September, 2022",
                                "context": "Apocryphal line, but essentially correct -Yamamoto had studied at Harvard and lived and worked alongside Americans for several years -he knew exactly what kind of a people we were and what our response would be once attacked..",
                                "good": "6",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "d'artagnan0962",
                                        "time": "2 September, 2022",
                                        "context": "He told the High Command that the IJN could do whatever was asked of it for about six months and after that Japan should be looking to make peace. His estimate was spot on.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "canadianlivinginus",
        "time": "2 September, 2022",
        "context": "And the UK finally finished paying the US back for support in 2020...",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "Mr8ch855",
                "time": "2 September, 2022",
                "context": "Good, now i can stop bagging on them; though, they do make it easy -what with the whole tea and crumpet eating thing and their messed up teeth...",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "canadianlivinginus",
                        "time": "2 September, 2022",
                        "context": "Ha! They have changed in the last 40 years... As we all have.",
                        "good": "2",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "Mr8ch855",
                                "time": "2 September, 2022",
                                "context": "I kid, truly. I've worked alongside many Brits, both here and in the UK -great bunch of chaps; serious drinkers, and boy do they get fired up during \"football\" games over there!",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "CorrupticratParty",
                "time": "2 September, 2022",
                "context": "I thought it was earlier than that.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "chartard",
        "time": "2 September, 2022",
        "context": "Japan stood up and got their teeth knocked out.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "Costambar",
        "time": "2 September, 2022",
        "context": "The war with Japan, Was pretty much equal. When it came to military assets. The U.S did not have todays satellites and smart bombs.  The war was soldier to soldier. and for what I've seen in many history documentaries.  Japan was defeating the United states.   And the atomic bombs we're dropped out of desperation",
        "good": "0",
        "bad": "17",
        "replies": [
            {
                "user_name": "Mr8ch855",
                "time": "2 September, 2022",
                "context": "Not true, friend. The Japanese did put up a ferocious fight, make no mistake, but they couldn't resupply like we could. The war in the Pacific became a war of attrition and the Japanese were losing men, materiel, and most importantly, aircraft and skilled pilots to defend their nation from a naval assault -which was coming closer and closer each day. Hence the Kami-Kazi was born out of desperation -not the actions of an \"equal\" opponent that was \"beating us\"...",
                "good": "9",
                "bad": "0",
                "replies": []
            },
            {
                "error": "error"
            },
            {
                "user_name": "healfrac",
                "time": "2 September, 2022",
                "context": "Gee so I guess my grandparents made a mistake by celebrating the liberation of their hometown in the Central Philippines from the Japanese in 1944  And the commemoration of the victory at the Battle of Leyte Gulf, the greatest naval battle in history is all a mistake.",
                "good": "1",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "q2xl034",
                "time": "2 September, 2022",
                "context": "Believe that if you want but we were on the Japanese’s doorstep, not the other way around.",
                "good": "3",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "Mr8ch855",
                        "time": "2 September, 2022",
                        "context": "Indeed. If we were being beaten, when did the Battle of Honolulu occur? The Battle of Long Beach? Or the Battle of San Francisco, or Portland, or Seattle?",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "11B3A",
                "time": "2 September, 2022",
                "context": "Don't get your history from old Tokyo Rose broadcast recordings...",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "christian478",
        "time": "2 September, 2022",
        "context": "To all who served and fought in wWII especially to those who mader the in ultimate sacrifice.\nThank you for your service.",
        "good": "32",
        "bad": "0",
        "replies": [
            {
                "user_name": "stanm",
                "time": "2 September, 2022",
                "context": "That includes the germans?",
                "good": "0",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "Mr8ch855",
                        "time": "2 September, 2022",
                        "context": "A soldier, sailor, or marine doesn't fight for his flag, he fights for the guy next to him in the foxhole. Every side suffered, and every side made the Ultimate Sacrifice. Right or wrong means squat when it's raining steel all around you..",
                        "good": "3",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "artios",
        "time": "2 September, 2022",
        "context": "History reveals the death and mayhem humanity continues to make throughout the centuries.",
        "good": "2",
        "bad": "0",
        "replies": [
            {
                "user_name": "gabechzz",
                "time": "2 September, 2022",
                "context": "All to keep a few at the top of the pyramid.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "Mr8ch855",
                        "time": "2 September, 2022",
                        "context": "War is good for business, you understand..",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "TheRepublicMatters🎬",
        "time": "2 September, 2022",
        "context": "That is when nation building worked. The honorable Japanese people we just as civilized in their own ways and accepted a better way to build a great nation. God Bless them !!",
        "good": "2",
        "bad": "1",
        "replies": [
            {
                "user_name": "stanm",
                "time": "2 September, 2022",
                "context": "What they did when they invaded china shows they weren't civilized",
                "good": "2",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "Mr8ch855",
                        "time": "2 September, 2022",
                        "context": "20,000 tons of Napalm and two atomic bombs can \"civilize\" a people quicker than you realize!",
                        "good": "2",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "coenginerd",
        "time": "2 September, 2022",
        "context": ".....six pens????  Heck, Barry used more than that when he signed the Unaffordable Care Act; and let's not even get into Queen Nancy, who gave away more that to her impeachment managers lol.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "nothingbuta",
        "time": "2 September, 2022",
        "context": "Dugout Doug hid in Australia during the war! The Navy and Marines won the war in the Pacific!",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "Mr8ch855",
                "time": "2 September, 2022",
                "context": "Well, he was no George Patton, was he?",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "nothingbuta",
                        "time": "2 September, 2022",
                        "context": "MacArthur should have been court martialed after the debacle in Manila!",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "squibman31",
        "time": "2 September, 2022",
        "context": "My uncle never really got over that war. He was supposed to be on the Arizona but was instead on the other side of the island running a gopher errand for his commanding officer. He never would talk about it beyond that.",
        "good": "21",
        "bad": "0",
        "replies": [
            {
                "user_name": "Mr8ch855",
                "time": "2 September, 2022",
                "context": "Is your uncle still with us? I wish my grandparents were -both grandfathers fought in WWII, only one came home. The one that did, made it to 1987 -i miss his humor and his counsel..",
                "good": "9",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "glidingbuzzard680",
                "time": "2 September, 2022",
                "context": "I had 2 great uncles who went from southern Italy up to the north.  They said they would never talk about the war.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "stanm",
        "time": "2 September, 2022",
        "context": "Ww2 ended when the soviets took berlin",
        "good": "0",
        "bad": "6",
        "replies": [
            {
                "user_name": "StevenE",
                "time": "2 September, 2022",
                "context": "Sigh.....here we go.",
                "good": "5",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "stanm",
                        "time": "2 September, 2022",
                        "context": "The war should be called fascism vs communism. The nazis saw communism as their ideological adversary and Germany sought to destroy the bolshevik state",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "ABNRGR77",
        "time": "2 September, 2022",
        "context": "Thank you for all that have served, we honor these true American Patriots.\nWith their contributions to ending WWII and their contributions to our society afterwards.\nWe appreciate your sacrifices.",
        "good": "54",
        "bad": "0",
        "replies": [
            {
                "user_name": "Mr8ch855",
                "time": "2 September, 2022",
                "context": "We could never honor that generation enough. I still look up to them more so than the baby-boomers (my parent's generation) or even Gen X (mine). The Greatest Generation lived through the Great Depression only to be drafted to fight in the most violent, destructive conflict in human history.. and they did it without whining about it..",
                "good": "39",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "gabechzz",
                        "time": "2 September, 2022",
                        "context": "And they didn't ever have to in the first place and managed to leave the world to the leftists in the process.  But it's always good to be a part of something ain't it? Who decides which genocides were worth fighting for? Whoever had the most money bc that's all it came down to and here we are, a straight downhill line right were we are now from back then. You're spouting propaganda nonsense that is ores any sensible argument about what happened. They'd have been better off throwing the ignorant war mongers out of office Instead of being duped to fight for Europe, who we fought to get away from in the first place. While Asia is communist and Europe is socialist bc of our country, and all paid for by us, we accomplished exactly nothing but what the leftists wanted the whole time.",
                        "good": "1",
                        "bad": "9",
                        "replies": [
                            {
                                "user_name": "Mr8ch855",
                                "time": "2 September, 2022",
                                "context": "Explain to me please how the people of the 1930s and 40s could have \"thrown the ignorant war-mongers out of office\" -when dealing with the likes of Hitler, Mussolini, Tojo, Stalin, etc. They were never really elected to office; they took it by force, and anyone who opposed them were turned into air pollution. I'm not spouting propaganda (where did you get that nonsense from), i'm stating the truth -they were the Greatest Generation and i don't hold them responsible for their offspring turning into hippies and degenerates..",
                                "good": "8",
                                "bad": "0",
                                "replies": []
                            },
                            {
                                "user_name": "usedtobeademocrat515",
                                "time": "2 September, 2022",
                                "context": "It's good to defend your country when its attacked. I don't get your point????",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "user_name": "usedtobeademocrat515",
                        "time": "2 September, 2022",
                        "context": "No all were drafted. my old man volunteered when he was 15-had to have grandma and grandpa's signature.",
                        "good": "4",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "fido1959",
                                "time": "2 September, 2022",
                                "context": "He had to lie about this age.! But, many young men enlisted way too young. All\n Heroes!",
                                "good": "2",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "error": "error"
            }
        ]
    },
    {
        "user_name": "cirikili",
        "time": "2 September, 2022",
        "context": "The Greatest generation are sorely missed. ",
        "good": "49",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jimjames17",
        "time": "2 September, 2022",
        "context": "Ridiculous to claim the world war started by a Euro  conflict  when the French and UK declared war on the Germans. You can easily say it started with China and the Japanese a couple years earlier.\n It became a world war when it spread throughout the world later.",
        "good": "7",
        "bad": "1",
        "replies": [
            {
                "user_name": "Mr8ch855",
                "time": "2 September, 2022",
                "context": "I had a history professor at San Mateo JC who asserted that World War 2, was just in fact, a continuation of World War 1 -with a 21 year Time Out. While i didn't agree with him, his presentation and his reasoning were very solid and his case was very sound -difficult to refute if you had been there..",
                "good": "10",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "jimjames17",
                        "time": "2 September, 2022",
                        "context": "I can see that in Europe, same belligerents, some of the same aims but Japan was on the other side in WW2.\n Italy was on the other side too.",
                        "good": "3",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "dos622",
                        "time": "2 September, 2022",
                        "context": "Amazing that the germans rebuilt for a generation and attacked europe again...",
                        "good": "2",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "gabechzz",
                                "time": "2 September, 2022",
                                "context": "Well when things go according to plan. ",
                                "good": "2",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "user_name": "gabechzz",
                        "time": "2 September, 2022",
                        "context": "The orchestration of WWI didn't end with the desired outcome for those pulling the strings so another WW was necessary. Money making. Communism spreading. ",
                        "good": "2",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "thindirtline",
        "time": "2 September, 2022",
        "context": "That's when an adversary lost with dignity.",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "Mr8ch855",
                "time": "2 September, 2022",
                "context": "..and top hats and crisp black suits. Keepin' it classy in Tokyo Harbor!",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "peace-maker59",
        "time": "2 September, 2022",
        "context": "My father and three of my mother's brothers were part of the greatest generation who each served in different branches of the military in the same time period. My Dad, U.S. Army Veteran was there during the surrender of Japan while serving in the Asia-Pacific Campaign. Recently lost Dad to the ravages of dementia four months shy of his 100th Birthday, but long before he passed, he often imagined he was still over there with his Army buddies, a few who remained close friends after the war and kept in touch throughout the rest of their lives.",
        "good": "71",
        "bad": "0",
        "replies": [
            {
                "user_name": "lonestar46821",
                "time": "2 September, 2022",
                "context": "God bless your dad",
                "good": "19",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "TripleGear",
        "time": "2 September, 2022",
        "context": "JUST CAN'T WAIT......   Until these inbred Socialists formally surrenders to the US....",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Pinball-Wizard",
        "time": "2 September, 2022",
        "context": "And Biden tries to start another civil war here the day after but I'm not falling for it.",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "JamesMarlow854",
        "time": "2 September, 2022",
        "context": "The Japanese got what they deserved for starting the war and all the atrocities they committed in the Pacific. We were way to easy on their leadership. Hirohito should have been hanged with Tojo, but we gave him a free pass. \n\nI don't blame the Chinese for hating the Japanese as they do, after all the bad that they did.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "buckaroobob142",
        "time": "2 September, 2022",
        "context": "Amazing, what two nukes can accomplish.  I wonder about WW III.  Joe Biden is making that a real possibility. Next time, we might be on the receiving end of a Nuclear Strike.  Why would China or Russia want to wait for us to launch?",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "jacobmccandles235",
        "time": "2 September, 2022",
        "context": "I wonder how many WW2 vets see our country. To me we're at war with these faciast Democrats with Biden(Hitler) in charge.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bugholes",
        "time": "2 September, 2022",
        "context": "And then, the Chinese invaded Korea. Starting the Korean War,.... Which Truman messed up the end of.",
        "good": "0",
        "bad": "2",
        "replies": [
            {
                "user_name": "AG-7947",
                "time": "2 September, 2022",
                "context": "You're forgetting that Truman also allowed the French to recolonize Southeast Asia. We all know where that got us.",
                "good": "4",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "bugholes",
                        "time": "2 September, 2022",
                        "context": "Nope, didn`t forget that. The French, as usual, lost another war,...",
                        "good": "2",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "bartonbaron",
                                "time": "2 September, 2022",
                                "context": "\"as usual\"\n\nExplain.",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "user_name": "hindukushmts",
                        "time": "2 September, 2022",
                        "context": "Revisionist history is NEVER good!",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "OrangePlane",
                        "time": "2 September, 2022",
                        "context": "Ho Chi Minh sought our support to keep the French out.  We rejected him.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "hindukushmts",
                "time": "2 September, 2022",
                "context": "AFTER MacArthur wouldn't stop at the Yalu River! The Chinese warned him...Truman did the right thing by firing him saving the United States.",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "OrangePlane",
                "time": "2 September, 2022",
                "context": "The war began when the North Koreans invaded South Korea",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "namrats853",
        "time": "2 September, 2022",
        "context": "God bless them ...a few years ago we went to Hawaii and we were on the Missouri and couldnt help notice how the signing area was smaller than i envisioned.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mtnbikguy",
        "time": "2 September, 2022",
        "context": "There wasn’t anything that happened to Germany or Japan that they didn’t deserve and more.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "congosquare",
        "time": "2 September, 2022",
        "context": "Thank God for the atom bomb!",
        "good": "3",
        "bad": "0",
        "replies": [
            {
                "user_name": "birki1990",
                "time": "2 September, 2022",
                "context": "Estimates predicted there would be one million American casualties if we did a Normandy type invasion of Japan. The Japanese would not give up. Fat man, and little boy finally ended it all.",
                "good": "7",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "beachbum483",
                        "time": "2 September, 2022",
                        "context": "They always go with the worst case scenario in order to justify something unjustifiable. 1 million people is nothing compared to the survival of the species. However, the nuke has likely up to this point already prevented another major world war. Let's hope that trend keeps up because the alternative is extinction.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "steevareno",
                                "time": "2 September, 2022",
                                "context": "\"Justify something unjustifiable\" ?  Your knowledge of history is sorely lacking and wokeness clouds your thinking.  One million Americans and untold millions of Japanese military and civilian lives were also saved by dropping the atomic bombs. The Soviet Union declared war on Japan and would have kept any land it occupied. Quite possible that because of the atomic bombs shortening the war, we don't have a communist North Japan and a free South Japan.",
                                "good": "0",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "beachbum483",
                                        "time": "8 September, 2022",
                                        "context": "According to the worst case scenario, which is what they always go with....duh",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": [
                                            {
                                                "user_name": "steevareno",
                                                "time": "8 September, 2022",
                                                "context": "According to the likely case scenario! Please unwoke yourself. A mind is a terrible thing to waste.",
                                                "good": "0",
                                                "bad": "0",
                                                "replies": []
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "holycow289",
        "time": "2 September, 2022",
        "context": "My Uncle was a Gunnery Officer on the Ticonderoga when she took two Kamakazis and he survived to tell me about it. I will never forget him.\nSeems like today we have a coward as Commander in Cheif who did a big diservice to everyone pulling an instsnt retreat out of Afgahnistan embolding our enemies so that we may have another world war.",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "FigNooton",
        "time": "2 September, 2022",
        "context": "This was a historic day, no doubt.  The old Japan was gone and the new Japan needed purpose. Enter American statistician, W. Edwards Demming to guide them industrially giving focus to quality over quantity.  The people had the discipline and the zeal to put Demming’s ideas into play and Japanese products went from junk to sought after items.  The Demming award soon became a goal for businesses to achieve.  If a business won one, it was a big deal and meant something.  In 1989, the first US company to win one was Florida power and light.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "thinkinghmmm",
        "time": "2 September, 2022",
        "context": "That was the the last war the United States won. Everything after that was never fought to win.",
        "good": "9",
        "bad": "0",
        "replies": [
            {
                "user_name": "sirwhompy",
                "time": "2 September, 2022",
                "context": "I don't think that's quite right. Grenada and The first Gulf War come to mind right off the top.",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "d'artagnan0962",
                "time": "2 September, 2022",
                "context": "The definition of \"win\" was what changed. Our soldiers, sailors, airmen, and Marines still did their part; it was the politicians who dropped the ball.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "spfish",
        "time": "2 September, 2022",
        "context": "Yeah, well....we will just ignore all this because of the ummm....you know...........",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rfloyd399",
        "time": "2 September, 2022",
        "context": "So they bring out the anniversary of the burning of Atlanta yesterday but leave out today being the anniversary of the Great London Fire in 1666?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bob’",
        "time": "2 September, 2022",
        "context": "We took a tour of the battleship. It has cruise missile tubes mounted on it from when it fought in Gulf War 1. They have the deck marked where the signing took place. Deck is covered with strips of teakwood to prevent slipping.  The size of the cannon shells was impressive, 3 or 4 feet long, couple feet thick, 2,000 pounds, and very accurate. Cafeteria line was called the Truman Line.  It’s docked at Ford Island as if guarding the Arizona Memorial.",
        "good": "3",
        "bad": "0",
        "replies": [
            {
                "user_name": "iceman25",
                "time": "2 September, 2022",
                "context": "Just a head up, they are not called canons.  They are technically called naval riffles, but at the very least, call them guns.  The guns on the Missouri are Mark 7 16\"/50cal, arguably the most powerful naval riffle ever mounted on a battleship.\nThe HE (high explosive) shells stood around 5ft tall and weighed 1900lbs, while the super heavy AP (armor piercing) shells stood right 6ft tall and weighed 2700lbs.  Truly awesome weapons.",
                "good": "3",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "raccolta861",
                        "time": "2 September, 2022",
                        "context": "In other words, Firing a volkwagen acuratly and hitting your target 23 miles away.",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "billybob243",
                        "time": "2 September, 2022",
                        "context": "i visit the Iowa in LBCh every chance i get.  ",
                        "good": "3",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "sirwhompy",
                        "time": "2 September, 2022",
                        "context": "There were also shells with nuclear warheads developed for the Iowa Class Battleships. Those would of been the most powerful naval rifles ever built. ",
                        "good": "3",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "iceman25",
                                "time": "7 September, 2022",
                                "context": "You are referring to the W23 \"Kate\" shells.  There is still debate whether any of the Iowa's actually deployed with these shells.\nThey were only in service from '56-62 I believe. ",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "user_name": "talos1",
                        "time": "2 September, 2022",
                        "context": "I have toured USS Missouri twice, once at Pearl Harbor, and once in San Francisco (1988) when she was back in operations.  I also toured USS New Jersey in San Francisco, when she had returned to operations.\nNote that the Japanese battleships IJN Yamato and IJN Musashi were each armed with nine 18.1 inch/45 caliber guns.",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "bidenitits",
        "time": "2 September, 2022",
        "context": "It's amazing how different Japan is today and how kind the people are. I'd rather live in japan than in the US",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "vetsop1",
                "time": "2 September, 2022",
                "context": "BYE",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "consequence",
                "time": "2 September, 2022",
                "context": "Okay Tojo!",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "PoopyPantsJoeiskillingUS",
                "time": "2 September, 2022",
                "context": "Helps that there are no \"dark complexion\" individuals running around committing 90-95% of the crimes. Guess the Japanese don't believe in diversity, or better still,don't want it.",
                "good": "1",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "recon23",
        "time": "2 September, 2022",
        "context": "Look at what they gave us and we threw away. Sad really, thanks boomers.",
        "good": "3",
        "bad": "2",
        "replies": [
            {
                "user_name": "AG-7947",
                "time": "2 September, 2022",
                "context": "The boomers spoil their kids kids and it's been downhill from there",
                "good": "3",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "hindukushmts",
                        "time": "2 September, 2022",
                        "context": "Both my \"spoiled\" sons served in the Marines, both got college degrees, both are working. My \"spoiled\" daughter's motivation is off the charts with a college degree and a six digit salary. You got it ALL figured out!",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "hindukushmts",
                "time": "2 September, 2022",
                "context": "That's a broad stroke of condemnation there. It would be better to challenge specific events and Leaders before making such a comment. I served 31 years for multiple Presidents, Secretaries of State, Defense Department, good, bad, and the unfortunate. Tone down the careless rhetoric...",
                "good": "0",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "2Afreedom258",
        "time": "2 September, 2022",
        "context": "I truly wish I lived in those days. Truly had an America to fight for. People were better. Honor and dignity. That was the greatest generation. Now we have transgenders, cell phones and video games. 😆",
        "good": "41",
        "bad": "0",
        "replies": [
            {
                "user_name": "shark20",
                "time": "2 September, 2022",
                "context": "Who knew , you can bet that generation are probably rolling over in their graves  , can’t say as I would blame them either as they were the “ greatest “ no doubt .",
                "good": "11",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "AG-7947",
        "time": "2 September, 2022",
        "context": "My father's ship was there. They were landing  occupation troops.",
        "good": "3",
        "bad": "0",
        "replies": [
            {
                "user_name": "bugholes",
                "time": "2 September, 2022",
                "context": "Mine was in the 1st Marine Division, Third Amphibious Forces. He went on to Tientsin, China for a good while.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "AntonChigurh",
        "time": "2 September, 2022",
        "context": "Yet Trump called our fallen Heroes  \"losers and suckers\"...",
        "good": "0",
        "bad": "7",
        "replies": [
            {
                "user_name": "brandonblowsbetter",
                "time": "2 September, 2022",
                "context": "\"TDS\" very strong with this Brandon acolyte.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "Confederate4eva",
        "time": "2 September, 2022",
        "context": "I`ve always thought Emperor Hirohito got of extremely light by not attending the ceremony in person was kind of  cowardly IMHO. \nLucky me viewed McArther lying in state in Norfolk, Virginia back in the 60`s",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mike0953",
        "time": "2 September, 2022",
        "context": "When I was at the Naval Academy from 1981 to 1985 The table that they signed the surrender on was just tucked away in a little corner at the Naval Academy just prior to going into King Hall where we would eat our meals. An artifact like that needs a better home. ",
        "good": "4",
        "bad": "1",
        "replies": [
            {
                "user_name": "hindukushmts",
                "time": "2 September, 2022",
                "context": "\"The Naval Academy Museum recreates the scene onboard with the original table, tablecloth, and a signed version of the surrender document.\"",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "JoesFreakShowCabinet",
        "time": "2 September, 2022",
        "context": "And soon to come on this day in history we’ll read the of how Joe Biden, installed democrat president had declared war on half the nation.",
        "good": "12",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "nraforlife",
        "time": "2 September, 2022",
        "context": "I had the honor of stepping on hollowed ground in Pearl Harbor this past January - as I stood at the USS ARIZONA MEMORIAL Im 70 years old and had tears for the 1,108 young men 18-23 years of age that are still entombed with her hulls - And the USS Missouri restored to former glory and the magnificent center piece of the ending of WW2 - Also visited the punchbowl military cemetery so beautifully built for our nations hero’s and tears poured for the graves I graves I came across - 25 unknown - 19 unknown - 5 unknown and on and on as they were buried right after Japan bombed Pearl Harbor - my wife and I want to say THANK YOU to 2 retired military women who were at the PunchBowl that helped us find my Uncles grave they were a blessing and Angel guardians of the thousands buried there - I hope many get to do as I did as I was so honored and proud to be an American and sad to see so many who died to protect our freedoms and our current government threatening our freedoms to this day",
        "good": "33",
        "bad": "0",
        "replies": [
            {
                "user_name": "rubyreddress",
                "time": "2 September, 2022",
                "context": "Reading your comment and the other comments and article I have tears running down my face   My heart and soul are grieving the losses and courage of that generation.  It is sad that in such a short span of time this country has forged its way to hell. Lord help us and, as I know you have Bless those before us that struggled to create and protect our country.  They themselves must be grieving the loss of what they gave their lives for!",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "jminc",
                "time": "2 September, 2022",
                "context": "Boy how things have changed . Now the government can’t tell you what a woman is and is still unsure which bathroom to use .",
                "good": "20",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "wasntme!",
                "time": "2 September, 2022",
                "context": "Also amazing are the newer names on the list. Old guys who wanted to be buried with their shipmates.  Call it what you want, survivor’s remorse, or something else. Those lives were never the same after that. ",
                "good": "10",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "sandidande2",
                "time": "2 September, 2022",
                "context": "So, a question.  Do you see any parallels between Japan in the 1930s and China now?\n\nI do!",
                "good": "1",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "proudwhiteguy#1",
                "time": "2 September, 2022",
                "context": "I also visited the Pearl Harbor Memorial about 2 years ago now.  I was 43 years old at the time and was overwhelmed with a sense of solemn pride.",
                "good": "2",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "consequence",
        "time": "2 September, 2022",
        "context": "The Republic of China was represented on the USS Missouri as a member of the allied effort to defeat Japan.  Soon Japan would drop all claims to Manchuria and Taiwan and surrender them to ROC Forces.  Unfortunately, Communist bands working behind the lines in Manchuria forced the surrender of Japanese troops in their areas and gained territory and arms before ROC Forces could arrive.  Meanwhile, Soviet Forces robbed Manchuria bare of equipment which should have belonged to the ROC  and also provided arms to the Communists.  Manchuria would become the first scene of fatal losses of the ROC Forces.  Meanwhile, on Taiwan, the Communists were weak and there was no Soviet interference so Taiwan would be saved by ROC Forces.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "1average_joe",
        "time": "2 September, 2022",
        "context": "On 20 January 2021, President Joe Biden began surrendering to all of America's enemies, both foreign and domestic.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "nuuser",
        "time": "2 September, 2022",
        "context": "Japan needs to re-arm & go for Nanking #2.",
        "good": "3",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "bubbajr273",
        "time": "2 September, 2022",
        "context": "The article left out one crucial piece of information for this date in 1939, the Soviet Union invaded Poland Sept 2,1939",
        "good": "4",
        "bad": "1",
        "replies": [
            {
                "user_name": "OrangePlane",
                "time": "2 September, 2022",
                "context": "9/17/39, actually.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "bubbajr273",
                        "time": "2 September, 2022",
                        "context": "If you read your history correctly, Nazi Germany invaded Poland 9/1/39, USSR followed suite 9/2/39",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "OrangePlane",
                                "time": "2 September, 2022",
                                "context": "Source, please.  I stand by the 17th.  May have been some infiltration before then but official date is 9/17.",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "arienne22",
        "time": "2 September, 2022",
        "context": "My Grandpa was a Marine who fought in the Pacific theater and on his 22nd birthday, he received the news that Japan had surrendered. Happy birthday Grandpa!",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "prdog",
        "time": "2 September, 2022",
        "context": "A beautiful day ,a sad day , a memorable day ,a day that should remind us of what the cost of war really causes.. May this never happens again... ",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "seeker412",
        "time": "2 September, 2022",
        "context": "And as part of the US component of the fleet gathered in Tokyo Bay was the submarine tender USS Proteus. One of the many crew members watching the ceremony was Seaman Bernard Schwartz. While this name may seem unfamiliar, he was the star of many movies later in life, under the name of Tony Curtis.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "noneyer",
        "time": "2 September, 2022",
        "context": "I could be wrong but I think Japan held Korea for decades before 1931 and it's invasion of China.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "azponchovia",
                "time": "2 September, 2022",
                "context": "Yes, they invaded Korea in 1910 and held it for 35 years until 1945.",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "Babezilla",
        "time": "2 September, 2022",
        "context": "The USS Missouri, otherwise known as the Mighty Mo, is a fabulous ship! The tour of this ship gives a fantastic review of history!\nThank to all the men and women who have served our great nation! ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "WhereRULaddyBuck",
        "time": "2 September, 2022",
        "context": "United States Treasury Department was established this day also in 1789.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "studsail",
        "time": "2 September, 2022",
        "context": "Just think how it would have ended if Joe Biden had been President. Thank God he wasn't.",
        "good": "14",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "areosmith",
        "time": "2 September, 2022",
        "context": "all those white men!!!! but let's make the statues look black or at least have black in em...",
        "good": "1",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "agbjr57",
        "time": "2 September, 2022",
        "context": "Dad was US Navy, served throughout the Pacific. By September 1945 he was twenty-one, a battle-hardened 'old man' who had seen far too much of what no one that age should ever have to see. It stayed with him for the rest of his life, never spoken of but nevertheless seared into his memories. Shortly before he passed away Dad said about his wartime generation, \"We're all going now, when we're gone will anyone remember what we did, what we had to do?\" I assured him HIS nation would never forget, I pray OUR nation never does. God bless all those who have served and continue to preserve OUR Constitutional Republic.",
        "good": "13",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "SCPOUSNRET707",
        "time": "2 September, 2022",
        "context": "A world at peace till June 1950.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "noneyer",
        "time": "2 September, 2022",
        "context": "My uncle was a sea going Marine during war 2.  Even though he had a wife and two children he was recalled for the Korean war.\n\nKorea was the first draft with \"education deferment\".  Rich young men could go off to college while men who served six years previously in WW2 went to war again.",
        "good": "4",
        "bad": "0",
        "replies": [
            {
                "user_name": "CPO(SW)ret690",
                "time": "2 September, 2022",
                "context": "Actually there were deferments granted by both sides during the the Civil War",
                "good": "2",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "noneyer",
                        "time": "2 September, 2022",
                        "context": "Really official college deferments?  That isn't the same thing as buying a stand in at all.\n\nList a few \"deferments\" during the Civil War.",
                        "good": "1",
                        "bad": "1",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "BidenCrimeSyndicate",
        "time": "2 September, 2022",
        "context": "Biden surrendered to the Taliban in the bed of a Toyota pickup truck. Same scene, different setting.\n ",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "robb63545",
        "time": "2 September, 2022",
        "context": "That's what the Greatest Generation, a generation that sacrificed for their neighbor, could accomplish.  Doesn't seem we will see their like any time soon.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ebittencourt",
        "time": "2 September, 2022",
        "context": "WWII did not end yet\n The US can't survive without it's military-industrial complex. No matter what and how. It's a curse",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "ELH845",
        "time": "2 September, 2022",
        "context": "And Obama said how it hurt him to see pictures of the Japenese surrendering. How was he ever president? My wife's grandfather fought in WWII, Purple Heart recipient, many years later, had to have both legs amputated from war wounds. Freedom cost him a lot.",
        "good": "8",
        "bad": "0",
        "replies": [
            {
                "user_name": "bone_head",
                "time": "2 September, 2022",
                "context": "when did he say that?",
                "good": "1",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "hindukushmts",
        "time": "2 September, 2022",
        "context": "If you haven't read John Toland's, The Rising Sun, you're clueless about this whole event. BUT pictures are fun to comment on...",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "CPO(SW)ret690",
        "time": "2 September, 2022",
        "context": "Saw Mighty Mo on the horizon in the NAG during Desert Storm. Majestic. 10 years later I would walk her decks at Pearl where I was stationed on a guided Missile Destroyer. Arizona at the berth just in front of the big M.  Still majestic and right where she needs to be.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "parabellum-in-2024",
        "time": "2 September, 2022",
        "context": "Fought again, we would lose.  Our media would have blown every secret mission. Gutless appeasers would prevail.  Woke culture would render American industry impotent.  Normandy would be a disastrous massacre. The Japanese would hurl us back into the sea at Iwo Jima and Okinawa; and the Nazis would beat us to the bomb. MAGA NOW, MAGA TOMMOROW, MAGA FOREVER",
        "good": "4",
        "bad": "1",
        "replies": [
            {
                "user_name": "bone_head",
                "time": "2 September, 2022",
                "context": "actually, what was different is that both parties put country first and actually worked together on most issues.  But you totally would not understand that, based on your last line",
                "good": "1",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "hyperdrivedave",
        "time": "2 September, 2022",
        "context": "Without those atomic bombs? Who knows?",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "bartonbaron",
                "time": "2 September, 2022",
                "context": "The victory would have taken longer to achieve, and been meant more losses for both sides (but especially for the Japanese). Regular terror bombing might not have convinced Hirohito. If there were no atomic bombs, I think the Allies should have tightened the naval noose on Japan so it's no threat, continued to recapture occupied areas (Taiwan, Korea), continued military bombing to further reduce Japan's economy, and simply waited for it to see the light without risking huge losses through an invasion.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "guitar42541",
                        "time": "2 September, 2022",
                        "context": "Large scale invasion of japan would have been imminent and cost the lives of countless more of our U.S. Servicemen and Allies.......",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "bartonbaron",
                                "time": "2 September, 2022",
                                "context": "Agreed. Combined with the Allied indifference to the plight of the Japanese population, starving them and waiting for Hirohito to ask for surrender instead of invading and risking huge losses would be the better option. The rest of the world could carry on as if Japan didn't exist.",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "al_crapone",
        "time": "2 September, 2022",
        "context": "And then Barack Obama apologized for all of it.",
        "good": "4",
        "bad": "1",
        "replies": [
            {
                "user_name": "bone_head",
                "time": "2 September, 2022",
                "context": "did he?  When?",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "wbwill",
        "time": "2 September, 2022",
        "context": "--the Day of Infamy's conclusion--and then the benevolent USA helped Japan back into a democratic society--NOT Socialist--just like South Korea--too bad our current Pres. missed the the example--",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ihavenomouthandimustscream",
        "time": "2 September, 2022",
        "context": "Defeating the white nationalists was also heroic.",
        "good": "0",
        "bad": "6",
        "replies": [
            {
                "user_name": "TexasPatriot1955",
                "time": "2 September, 2022",
                "context": "Have ever fought for anything or anybody? Or just sit at home and complain ",
                "good": "8",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "ihavenomouthandimustscream",
                        "time": "2 September, 2022",
                        "context": "I'm offering praise for the defeat of the Nazis.\nThat bothers you?",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "jmjral",
                "time": "2 September, 2022",
                "context": "Was that a quote from King George III?",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "ihavenomouthandimustscream",
                        "time": "2 September, 2022",
                        "context": "Nope, me.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "jle1",
        "time": "2 September, 2022",
        "context": "The document was/is at the Ronald Reagan library",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "agbjr57",
                "time": "2 September, 2022",
                "context": "Same can be said of the document at the West Point Museum. Truth is those are original copies, the true original signed aboard the USS Missouri is in the National Archives.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "finn_mccool",
        "time": "2 September, 2022",
        "context": "If Biden was President back then, he would have been the one surrendering!",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "wesayso",
        "time": "2 September, 2022",
        "context": "Stood on that spot (bronze manhole cover) when the Missouri was in Bremerton. It was for me (being a war history enthusiast) a step back in time to that very day.",
        "good": "2",
        "bad": "0",
        "replies": [
            {
                "user_name": "ihavenomouthandimustscream",
                "time": "2 September, 2022",
                "context": "That would be cool.",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "hcarian",
        "time": "2 September, 2022",
        "context": "“The Philippines, Korea, Malaysia, Singapore, Taiwan, Thailand, Burma and French Indochina (Cambodia, Laos, Vietnam) were among the nations conquered and occupied by Japan”\n\nGood to see Taiwan referred to as a “nation”.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "FredMertz078",
        "time": "2 September, 2022",
        "context": "Dad never talked about his job as a coxswain on a Higgins boat during the war, but he had a deep and profound respect for our armed forces, especially the Marines. Mom told me after he passed that he admitted to her that he dropped off the Marines on the beaches alive, and brought back dead ones. Some of the faces he recognized. RIP Dad, my hero.",
        "good": "8",
        "bad": "0",
        "replies": [
            {
                "user_name": "sirwhompy",
                "time": "2 September, 2022",
                "context": "That was quite a dangerous job your father had. Believe me Higgins boats were a sought after target in themselves. If you could sink the boat on its way to the Beach, then that would be that many less men invading. He certainly is worth mentioning and memory for his sacrifices. Many times men were killed just a few feet away from the landing craft, I can only imagine the feelings he had in feeling he was taking men to their death. He was truly a hero in my mind. His memory is worthy of honor. ",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "RFBurns",
        "time": "2 September, 2022",
        "context": "Little of Japan's culpability of the war is taught to today's schoolchildren in Japan",
        "good": "9",
        "bad": "0",
        "replies": [
            {
                "user_name": "rookie97700",
                "time": "2 September, 2022",
                "context": "It never was taught as there fault!",
                "good": "5",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "OrangeCountyCA",
        "time": "2 September, 2022",
        "context": "Despite the Marshall Plan, why did Japan and Germany recover to stupendously in one generation while all our aid to the third world has been a complete flop?",
        "good": "1",
        "bad": "1",
        "replies": [
            {
                "user_name": "bone_head",
                "time": "2 September, 2022",
                "context": "The US took a heavy hand in the rebuilding of both countries.  Look at the stark difference between Western Germany and Eastern Germany.  The US and Allies developed the infrastructure of Western Germany, while Russia used the east as a buffer state and forward armed base.  \nFor the third world, we do not do that.  We provide funding and work with the host nation.  But in the end, it is up to them to make decisions.  Even in Afghanistan, we left much of the options to the Afghans.  we did not do that in Germany or Japan.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "OrangeCountyCA",
                        "time": "2 September, 2022",
                        "context": "You think the Ivory Coast, Chad, Guatemala, Honduras, or Nicaragua would be the next Korea or even Vietnam if the US had a heavy hand building them?",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "nychap1944633",
        "time": "2 September, 2022",
        "context": "Unapparelled bravery from the great generation. Congratulations to all of you.",
        "good": "7",
        "bad": "0",
        "replies": [
            {
                "user_name": "billybob243",
                "time": "2 September, 2022",
                "context": "god bless all our military.  fought with bravery and purpose",
                "good": "3",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "ihavenomouthandimustscream",
        "time": "2 September, 2022",
        "context": "“So, eleven hundred men went in the water… three hundred and sixteen men come out, the sharks took the rest, June the 29th, 1945. Anyway…we delivered the bomb.”",
        "good": "4",
        "bad": "0",
        "replies": [
            {
                "user_name": "OrangePlane",
                "time": "2 September, 2022",
                "context": "Many self-professed patriots on here have no idea what you are talking about.  Your date is off, btw",
                "good": "1",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "ihavenomouthandimustscream",
                        "time": "2 September, 2022",
                        "context": "I'm quoting the movie, not providing historical data.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "isittrue",
                "time": "2 September, 2022",
                "context": "USS Indianapolis, she was torpedoed and sunk by the Japanese submarine I-58 within the first hour of 30 July 1945.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "ironranger281",
        "time": "2 September, 2022",
        "context": "Another great day for America when Liberals surrender !\n\nIts too bad they reassembled in California .. I hope after their next defeat we never see their rise again !",
        "good": "5",
        "bad": "3",
        "replies": [
            {
                "user_name": "bone_head",
                "time": "2 September, 2022",
                "context": "how about realizing that this is not about you or liberals/conservatives.  It is about great deeds done by many years ago to defeat facist.",
                "good": "1",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "ironranger281",
                        "time": "2 September, 2022",
                        "context": "WOW you said man ... LOL \n\nAnd we men will have to rise again stop the facist rise again in California .. \n\nThank you for not serving !",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "plumbtired411295",
        "time": "2 September, 2022",
        "context": "Make a note of this day for your children and grandchildren. The left will try to cancel it soon. ",
        "good": "2",
        "bad": "3",
        "replies": [
            {
                "user_name": "bone_head",
                "time": "2 September, 2022",
                "context": "that makes no sense.  None at all",
                "good": "2",
                "bad": "2",
                "replies": []
            },
            {
                "user_name": "ihavenomouthandimustscream",
                "time": "2 September, 2022",
                "context": "Why would this be canceled specifically?",
                "good": "2",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "gamark63",
        "time": "2 September, 2022",
        "context": "While stationed in Guam in 2003.. Since the war it has become the poor Japanese \" Hawaii\"\nthose that cant afford the real thing or Australia, go there , lots of golf on the island.. \n that being said, a TGI Fridays had just opened up when they still had \" flair\" we sat at a booth that had the surrender signing picture.. the next time we went , it was gone. I wonder why..\nthe Japanese brutalized the island .  A Japanese soldier surrendered to the AF main gate in 1972 having lived on caves and stole livestock.  his commander had to call him to assure him the war was over  Shoichi Yokoi,",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "blackriflesmatter398",
        "time": "2 September, 2022",
        "context": "They \"awakened a sleeping giant\". Now, we're back to sleep.",
        "good": "4",
        "bad": "0",
        "replies": [
            {
                "user_name": "ihavenomouthandimustscream",
                "time": "2 September, 2022",
                "context": "Russia disagrees.",
                "good": "1",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "blackriflesmatter398",
                        "time": "2 September, 2022",
                        "context": "Is that why they are destroying Ukraine ?  Because they fear the USA ??",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "ihavenomouthandimustscream",
                                "time": "2 September, 2022",
                                "context": "Russia poked the giant and the giant is bleeding Russia white.\nPretend otherwise if you must.",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "rookie97700",
        "time": "2 September, 2022",
        "context": "And look at the country today, America is a lost country within itself, the president acting like adolf, and the doj and fbi are acting like the brown shirts!☠️☠️☠️☠️",
        "good": "7",
        "bad": "2",
        "replies": [
            {
                "user_name": "ihavenomouthandimustscream",
                "time": "2 September, 2022",
                "context": "Okay, Vlad.",
                "good": "1",
                "bad": "3",
                "replies": []
            },
            {
                "user_name": "bone_head",
                "time": "2 September, 2022",
                "context": "how about actually understanding history before making such ignorant comments.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "observer48",
        "time": "2 September, 2022",
        "context": "Deepest respect and gratitude to every man and woman who served and who continue to serve.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ihavenomouthandimustscream",
        "time": "2 September, 2022",
        "context": "Defeating the white nationalist fascists in europe was our greatest accomplishment during WW2.",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "jmwestward",
        "time": "2 September, 2022",
        "context": "Both greatest days or events in recent Japan history involved America: Commodore Perry's black ship sparked Japan's push for modernization, creating a power nation. And as it went down the wrong way into imperialism, we American woke them up again and that changed them into a second phase with a prosperous democracy. We benefited from this also, as Japan is our best ally in the all-important Eastern Asia.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sparkatooly",
        "time": "2 September, 2022",
        "context": "This story needs to be deeply driven into every American. Indeed \"THE GREATEST GENERATION\"",
        "good": "4",
        "bad": "0",
        "replies": [
            {
                "user_name": "donaldfurr",
                "time": "2 September, 2022",
                "context": "Great day for America in 1945 but there will still be WARS in the world when you have people like Putin and other bad actors like Iran and North Korea. ",
                "good": "3",
                "bad": "1",
                "replies": []
            },
            {
                "user_name": "isittrue",
                "time": "2 September, 2022",
                "context": "The Greatest Generation - Didn't whine about rationing, donated their pots and pans, bought war bonds, gave up nylon stockings, followed black out rules, grew victory gardens, etc. The entire country got behind the war effort.",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "TexasPatriot1955",
        "time": "2 September, 2022",
        "context": "My father served in Europe same as his father in WW1 , my grandson is a fifth generation warrior, my family gladly served this country, How people in this country forget to quickly, How the corrupt politicians could care less , it’s very sad ",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bobbybarone",
        "time": "2 September, 2022",
        "context": "Thank You to the greatest generation. Sadly we are seeing the fall of a great nation. A country that these men and women fought and died for. Thank You for your service",
        "good": "4",
        "bad": "0",
        "replies": [
            {
                "user_name": "ihavenomouthandimustscream",
                "time": "2 September, 2022",
                "context": "Our democracy will withstand these latest tests against the emerging fascism.",
                "good": "0",
                "bad": "2",
                "replies": []
            }
        ]
    },
    {
        "user_name": "Jack75715",
        "time": "2 September, 2022",
        "context": "My dad joined the Navy in April 1942.  He was 34 years old.  After boot camp a few months later he was in Tunisia.  They crossed the Atlantic in a group of LST’s.  He never spoke about anything else.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Tommy98466",
        "time": "2 September, 2022",
        "context": "The USS Missouri does not belong in Hawaii. It belongs in the lower 48 were many more people can view this historic battleship. Only rich people, besides the local Hawaiians, can view it today. There is no historical significance for it to be in Hawaii. Bring it home.",
        "good": "2",
        "bad": "1",
        "replies": [
            {
                "user_name": "blackriflesmatter398",
                "time": "2 September, 2022",
                "context": "\"No historical significance\" in Hawaii ?   Did you go to public school ?",
                "good": "2",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "Tommy98466",
                        "time": "2 September, 2022",
                        "context": "Well since you are a historical genius, please tell me why I am wrong? The fact that the Missouri is the same class of a battleship as the Arizona, does not mean that it belongs in Hawaii for few to view. The Missouri was not in Pearl Harbor on that day. If you want it docked at a significant place, in WWII history, anchor it in Tokyo Bay.  It belongs back in the lower 48.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "blackriflesmatter398",
                                "time": "2 September, 2022",
                                "context": "December 7, 1941.  THERE is your historical significance, DB.",
                                "good": "0",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "Tommy98466",
                                        "time": "2 September, 2022",
                                        "context": "The Missouri wasn't there. It wasn't built until 1944. Try again.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "ignotus999",
                "time": "2 September, 2022",
                "context": "Respectfully disagree.  The Missouri is docked at Ford Island, the epicenter of the attack on Hawaii on December 7, 1941, just 500 yards from the USS Arizona Memorial.  The beginning, and the end.\n\nMy dad served in the Navy in Hawaii during WW II.  He, my mother, and several members of our family have been among the 8 million visitors who have trodden her decks since she arrived in Pearl Harbor.  (Though not a member of her crew, for dad it wasn't the first time he'd been aboard)  My wife and I haven't been there yet, but we're making plans.\n\nHer sisters USS Iowa and USS New Jersey are also preserved as museum ships - Iowa in Los Angeles and New Jersey in Camden.  Frankly, attracting funding and visitors has been a problem for those two ships.  As a naval / maritime enthusiast, I think USS Missouri is better off in Pearl Harbor than on the mainland.",
                "good": "2",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "Tommy98466",
                        "time": "2 September, 2022",
                        "context": "In your opinion, tell me why the Missouri should be stationed in Hawaii?",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "ihavenomouthandimustscream",
                "time": "2 September, 2022",
                "context": "Hawaii is still home to Americans.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "truthhurtsallthetime",
        "time": "2 September, 2022",
        "context": "God Bless our Military. Get out and vote folks !",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "urdelusional",
        "time": "2 September, 2022",
        "context": "Looks like a lot of paperwork to me.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "smobe",
        "time": "2 September, 2022",
        "context": "I am humbly grateful for all our soldiers who fought for freedom around the world.\nMy dad was an Army soldier in Europe.  I know little of that part of his life; he rarely spoke of it.\nWe sure are a different country today.",
        "good": "4",
        "bad": "0",
        "replies": [
            {
                "user_name": "ihavenomouthandimustscream",
                "time": "2 September, 2022",
                "context": "We have made a great deal of progress, no doubt.",
                "good": "2",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "OrangePlane",
                        "time": "2 September, 2022",
                        "context": "Yes, we have, desegregation of the military being one of them.",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "vietvet66/67390",
        "time": "2 September, 2022",
        "context": "I fought with some great ones, but that generation was the best. ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "brownwatervet",
        "time": "2 September, 2022",
        "context": "Today's young adults don't even know there was a war.",
        "good": "7",
        "bad": "0",
        "replies": [
            {
                "user_name": "blackriflesmatter398",
                "time": "2 September, 2022",
                "context": "They're fully trained in woke-ness and CRT though.",
                "good": "2",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "supernaut869",
                "time": "2 September, 2022",
                "context": "Oh , they know there was a war, but it started because the United States dropped atomic bombs on Japan. ",
                "good": "1",
                "bad": "2",
                "replies": []
            }
        ]
    },
    {
        "user_name": "lumbago",
        "time": "2 September, 2022",
        "context": "My dad had managed to stay out of combat but was getting trained for the invasion of Japan.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Niksewk123",
        "time": "2 September, 2022",
        "context": "So now it's China and Russia. Who will come to OUR aid?",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "...ontheFly",
                "time": "2 September, 2022",
                "context": "… who ever it is… a Mushroom cloud may bring peace in America just like it did for  Japan. Our nation is a hucksters paradise.  ",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "ihavenomouthandimustscream",
                "time": "2 September, 2022",
                "context": "NATO.",
                "good": "0",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "polishparlay",
                        "time": "2 September, 2022",
                        "context": "GOOD LUCK.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "ihavenomouthandimustscream",
                                "time": "2 September, 2022",
                                "context": "Oh, some rando says good luck so now I'm worried.",
                                "good": "0",
                                "bad": "1",
                                "replies": []
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "furshizzle228",
        "time": "2 September, 2022",
        "context": "Thank God the Japanese finally came to their senses.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "isittrue",
                "time": "2 September, 2022",
                "context": "Actually, thank Little Boy and Fatman.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "lumbago",
        "time": "2 September, 2022",
        "context": "Few of us would be here today...if it was not for that war.",
        "good": "3",
        "bad": "0",
        "replies": [
            {
                "user_name": "ihavenomouthandimustscream",
                "time": "2 September, 2022",
                "context": "In what sense?",
                "good": "0",
                "bad": "2",
                "replies": [
                    {
                        "user_name": "lumbago",
                        "time": "2 September, 2022",
                        "context": "baby boomers",
                        "good": "1",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "ihavenomouthandimustscream",
                                "time": "2 September, 2022",
                                "context": "Ahh, I see what you mean.",
                                "good": "1",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "sparkatooly",
        "time": "2 September, 2022",
        "context": "The audio series \"Killing the Rising Sun\" is a spectacular depiction you won't find in history class. This should be curriculum in every school in this country.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "bone_head",
                "time": "2 September, 2022",
                "context": "the killing series are bubble gum history.",
                "good": "0",
                "bad": "3",
                "replies": []
            }
        ]
    },
    {
        "user_name": "ihavenomouthandimustscream",
        "time": "2 September, 2022",
        "context": "The Nazis targeted certain groups for hate so as to rally their base.\nThey hated people of color.\nThey hated men who love other men.\nThey hated trans people.",
        "good": "1",
        "bad": "1",
        "replies": [
            {
                "user_name": "WithOrWithoutAParachute?",
                "time": "2 September, 2022",
                "context": "So did/do the Russians.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "ihavenomouthandimustscream",
                        "time": "2 September, 2022",
                        "context": "Russians are fascists, no question.\nThey are a people prone toward totalitarianism as they have no strong democratic traditions.",
                        "good": "0",
                        "bad": "1",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "before_the_dark_times",
        "time": "2 September, 2022",
        "context": "Back when America Was Great. Now we have a SCOTUS judge that can't define a woman and women who think they are men serving in the military.",
        "good": "3",
        "bad": "0",
        "replies": [
            {
                "user_name": "ihavenomouthandimustscream",
                "time": "2 September, 2022",
                "context": "Trump tried to overthrow our democracy.",
                "good": "1",
                "bad": "3",
                "replies": [
                    {
                        "user_name": "polishparlay",
                        "time": "2 September, 2022",
                        "context": "U.S. is not a democracy.   Learn how to read.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "ihavenomouthandimustscream",
                                "time": "8 September, 2022",
                                "context": "Yes, it is.\nWe are a constitutional democracy, even if that upsets you.\nPoli sci grad specializing in political theory and international relations.",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "cpvet70",
        "time": "2 September, 2022",
        "context": "Amazing moment in history, seems like liberals have forgot to share our dreams with each other. That our propensity to have individual thought  and expression and live in a free society are a bad thing….",
        "good": "2",
        "bad": "0",
        "replies": [
            {
                "user_name": "ihavenomouthandimustscream",
                "time": "2 September, 2022",
                "context": "Says the guy hiding out in the Fox News Safe Space for Trump Voters.\nHave you ever looked into being self aware?",
                "good": "1",
                "bad": "3",
                "replies": []
            }
        ]
    },
    {
        "user_name": "orangeauthoritarian",
        "time": "2 September, 2022",
        "context": "Sure is different from Donald Trump's SURRENDER to the Taliban in August of 2020.",
        "good": "1",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "Toltriaco393",
        "time": "2 September, 2022",
        "context": "My father always told the story of being on one of those many ships - maybe the tenth or fifteenth in line - and by the time they entered the bay someone had already painted a \"Kilroy was here\" graffiti on bridge supports...",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jimjames17",
        "time": "2 September, 2022",
        "context": "\"The Philippines, Korea, Malaysia, Singapore, Taiwan, Thailand, Burma and French Indochina (Cambodia, Laos, Vietnam) were among the nations conquered and occupied by Japan during the war \"\nKorea and Taiwan had long been part of the Japanese empire by the 1940's. the empire was occupied by the allies  after the war, southern Korea and Japanese home islands by the US, northern Korea, Sakhalin and the Kurils by Soviets and Taiwan by the Republic of China.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "SheldonOtter",
        "time": "2 September, 2022",
        "context": "this day has the irony of being the day Japan surrendered and Russia declared war on Japan in 1945",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "BigPicture416",
        "time": "2 September, 2022",
        "context": "I did not realize Sept 2 was the anniversary. It should be a date remembered. I won't forget again.",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "catfisherman",
        "time": "2 September, 2022",
        "context": "My grandfather was a doughboy WW1, my father was a Marine in Pacific Theater WW2, my father-in-law was soldier in Europe WW2, my older brother Navy off the coast of Vietnam, I was Navy during Viet Nam and my younger brother was Navy.",
        "good": "4",
        "bad": "0",
        "replies": [
            {
                "user_name": "d'artagnan0962",
                "time": "2 September, 2022",
                "context": "Thank you to all of them for their service to our country!",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "spamfaceplant118",
        "time": "2 September, 2022",
        "context": "Served onboard both New Jersey and Missouri, re-upped onboard Arizona.  Thought about those who served onboard them before me everyday onboard. Magnificent ships manned by magnificent men!",
        "good": "3",
        "bad": "0",
        "replies": [
            {
                "user_name": "OrangePlane",
                "time": "2 September, 2022",
                "context": "The Arizona sank on December 7, 1941.  You re-upped on board.  You must be pushing age 100.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "zerozen275",
        "time": "2 September, 2022",
        "context": "That war was won by the Greatest Generation. That being the case, the Woke generation wants to make sure we are never that strong again.",
        "good": "2",
        "bad": "0",
        "replies": [
            {
                "user_name": "ihavenomouthandimustscream",
                "time": "2 September, 2022",
                "context": "Except that they serve with honor while you smear them from this Fox News Safe Space.",
                "good": "2",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "tomiron",
        "time": "2 September, 2022",
        "context": "Wait a second. Wasn't WWII the last war America won and wasn't it won by our completely segregated American armed forces of the time? So, does that mean segregation was/is good?",
        "good": "1",
        "bad": "3",
        "replies": [
            {
                "user_name": "ihavenomouthandimustscream",
                "time": "2 September, 2022",
                "context": "You are a Trump Voter who thinks segregation is a good idea?\nModerates - watch as not a single Trump Voters speaks out against this hateful and unamerican idea.",
                "good": "0",
                "bad": "4",
                "replies": [
                    {
                        "user_name": "lumbago",
                        "time": "2 September, 2022",
                        "context": "There was a time not so long ago when Democrat voters ...thought it was a good idea.",
                        "good": "2",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "ihavenomouthandimustscream",
                                "time": "2 September, 2022",
                                "context": "And you cannot muster the strength to call him out for his suggestion.\nThat tells moderates a lot - thank you.",
                                "good": "0",
                                "bad": "1",
                                "replies": [
                                    {
                                        "user_name": "lumbago",
                                        "time": "2 September, 2022",
                                        "context": "how do you know what I can and can't \"muster out\"?",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": [
                                            {
                                                "user_name": "ihavenomouthandimustscream",
                                                "time": "2 September, 2022",
                                                "context": "You didn't.\nYou had nary a bad word for the Trump Voter cheering segregation and instead chose pivot toward Dems.\nThat's who you are.",
                                                "good": "0",
                                                "bad": "1",
                                                "replies": []
                                            }
                                        ]
                                    }
                                ]
                            },
                            {
                                "user_name": "isittrue",
                                "time": "2 September, 2022",
                                "context": "Harry S. Truman, a Democrat, signed Executive Order 9981, creating the President's Committee on Equality of Treatment and Opportunity in the Armed Services. The order mandated the desegregation of the U.S. military.",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "user_name": "ToxicToad975",
                        "time": "2 September, 2022",
                        "context": "Ask your doctor about Sodium Cyanide..   for Fast, Effective Relief from Chronic TDS",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "ihavenomouthandimustscream",
                                "time": "2 September, 2022",
                                "context": "I'm always impressed by how well Fox has people like you programmed.\nAnytime you read something about Trump that you cannot defend you bleat out \"TDS\" like a well programmed sheep.",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "OrangePlane",
                "time": "2 September, 2022",
                "context": "No, it doesn't.",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "isittrue",
                "time": "2 September, 2022",
                "context": "Wait a second. Both Commanders in Chief during WW2 were democrats. Does that mean democrat Presidents are better warfighters?",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "ihavenomouthandimustscream",
        "time": "2 September, 2022",
        "context": "The Nazis targeted certain groups for hate so as to rally their base.\nThey hated people of color.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "LibertyProtector71",
        "time": "2 September, 2022",
        "context": "There may never be a greater team of Hero’s than those who served and led in both World Wars. ",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "🧻🚽💩🪠",
        "time": "2 September, 2022",
        "context": "If WW2 happened today, Democrats would surrender and apologize to the Japanese for being white colonizers and slavery.",
        "good": "4",
        "bad": "0",
        "replies": [
            {
                "user_name": "bob1395",
                "time": "2 September, 2022",
                "context": "Yes they would.  I was afraid that with any significant threat Obama woud have surrendered us too.  He would have done it in a heartbeat.",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "a900q4xa9",
        "time": "2 September, 2022",
        "context": "We should have dropped 10 atomic bombs on them. They started it, they deserved it.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Bumblebee7",
        "time": "2 September, 2022",
        "context": "The fact that ordinary people from the working middle class gave their lives for freedom makes Biden's speech all the more shameful.  Here is our current president making threats, instilling fear, and acting a like a dictator coming to shut down all dissention.  This is not what our fellow americans gave their lives for.  For a dictator using FBI, DOJ, IRS to attack his political opponents.  They did not give their lives so that he can shut down \"free speech\".  And take away our liberties using the power of the gov't.  This is a reminder that we must not ignore that the gift of freedom was given to us by those who gave their lives.  And we need to protect it more than ever now.",
        "good": "5",
        "bad": "1",
        "replies": [
            {
                "user_name": "ihavenomouthandimustscream",
                "time": "2 September, 2022",
                "context": "Oh grow up.\nBiden didn't hurt you and if he loses the next election we all know he'll leave office peacefully.\nYou need to cosplay being afraid because that's what your culture turns on now.",
                "good": "2",
                "bad": "7",
                "replies": [
                    {
                        "user_name": "ToxicToad975",
                        "time": "2 September, 2022",
                        "context": "A little too much vodka with your eggs and toast this morning....   perhaps..",
                        "good": "2",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "ihavenomouthandimustscream",
                                "time": "2 September, 2022",
                                "context": "Oh no, I've been accused of having a drink by a cosplayer.\nSad face.",
                                "good": "0",
                                "bad": "2",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "user_name": "sixrings000",
                        "time": "2 September, 2022",
                        "context": "DONKEY!",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "isittrue",
                "time": "2 September, 2022",
                "context": "What threat did he make against the ordinary people from the working middle class? When did he say he wanted to shut down free speech and take away our liberties? He didn't. Open you ears, clear your mind of the MAGA juice, listen to his speech again with an open mind instead of a pre-conceived or planted notion.",
                "good": "0",
                "bad": "2",
                "replies": []
            }
        ]
    },
    {
        "user_name": "lumbago",
        "time": "2 September, 2022",
        "context": "So what would global warming look like today...if 60 million people would have been allowed to remain alive and reproduce 4 generations for 80 years?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "theboxxerman",
        "time": "2 September, 2022",
        "context": "Very good article.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "snarkattack239",
        "time": "2 September, 2022",
        "context": "THIS IS WHY AMERICA !\n\nWe DO NOT allow their sacrifices to preserve our Nation be IN VAIN.\n\nWe CANNOT allow the SCOURGE OF AMERICA to imperil our nation ANY LONGER.\n\nEither by VOTE or by OTHER means the liberal scourge MUST be removed from our Institutions Of Learning and from within our Government.\n\nAmerica is at a turning point.. The Fall Of America is IMMINENT. Engage or witness her epitaph.\n\nMay GOD continue to bless our Nation, the greatest in history The United States 🇺🇸 Of America,\n\nDon’t bother libs.",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "OrangePlane",
                "time": "2 September, 2022",
                "context": "What \"other means\" did you have in mind?",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "justpappystu600",
        "time": "2 September, 2022",
        "context": "Rest in peace Valiant Ones, you will always be remembered...",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "f.a.",
        "time": "2 September, 2022",
        "context": "The last war we won.",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "Touchman",
        "time": "2 September, 2022",
        "context": "We won WWII fighting on two fronts. In just 4 years we manufactured 10s of thousands of aircraft, thousands of war ships, tanks artillery, and transported it sll over the world to our fighting forces, who defeated nazism, fascism and imperialism.  In only 4 years.  Today our government can’t even deliver functioning software in 4 years, and takes 10-15 years to deliver a handful of fighters of bombers!  Military commanders today are more concerned with white rage and wholeness.  I seriously wonder if America could ever mobilize, fight and win a war like that again.  But America has always seemed to do the right thing when it counts. ",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "missbella560",
                "time": "2 September, 2022",
                "context": "No chance we could do that again today.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "pachy",
        "time": "2 September, 2022",
        "context": "Not to joke about it, but I find it ironic - all the medals on the Japanese uniforms.\nThey forget one -\nWe Lost the Big One",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "ihavenomouthandimustscream",
                "time": "2 September, 2022",
                "context": "I played a great game of Vicky2 as Japan where I ended with Japan controlling a third of China and half the Pacific.\nMy Japan had no need to get into WW2.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "Jrpublic",
        "time": "2 September, 2022",
        "context": "Sadly, ignorant voters and corruption has placed us into the hands of our enemies, the most dangerous enemies we have ever faced as they control the very minds of our children via our schools.  We now fight within what our heroes of WWII fought from without.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "phillip123117",
        "time": "2 September, 2022",
        "context": "I just wish it were true that the holy mission has been completed",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "realright_learnit",
        "time": "2 September, 2022",
        "context": "Glad we had leaders then. Patton 2024!! Democrats will surrender within a month if WW comes around soon.",
        "good": "1",
        "bad": "2",
        "replies": [
            {
                "user_name": "isittrue",
                "time": "2 September, 2022",
                "context": "Franklin Roosevelt and Harry Truman, Presidents during WW2, were Democrats.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "...ontheFly",
        "time": "2 September, 2022",
        "context": "This generation of men will be storming the beaches with a girls bikini on, lazy, overweight, uneducated, fatherless, and the world owes them. The American Dream is dead. The greatest generation that ever lived vomits on todays standards. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bob1395",
        "time": "2 September, 2022",
        "context": "Today's dem party would try to arrest MacAurthur.  ",
        "good": "4",
        "bad": "0",
        "replies": [
            {
                "user_name": "isittrue",
                "time": "2 September, 2022",
                "context": "My grandfather served in the South Pacific. He didn't care much for MacArthur.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "polishparlay",
        "time": "2 September, 2022",
        "context": "If today, Americans would be bowing down to Japan.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "dbrint",
                "time": "2 September, 2022",
                "context": "That was Obama. ",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "imamagadeporable",
        "time": "2 September, 2022",
        "context": "Libs consider this an evil day in American history.",
        "good": "0",
        "bad": "1",
        "replies": [
            {
                "user_name": "ihavenomouthandimustscream",
                "time": "2 September, 2022",
                "context": "No, we do not.\nWhy the need to lie.",
                "good": "2",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "EngineerRetired",
        "time": "2 September, 2022",
        "context": "Charles R. Carter my friend from work was there. RIP Charles.  (I had not been born yet.)\nHe said all the ships were at battle stations with guns loaded.\nThe planes were armed and ready to wipe out any resistance.\n\nAfter the signing, He was in the first launch boat from the Missouri to the Dock with no guards. Just side arms.\nAt the dock they were greeted by Lines of fully armed Japanese Soldiers.\nA soldier tied up the launch.\nSaluted.\nThey got off the launch . All the Japanese soldiers saluted.\nThey proceeded down the docks lined by soldiers.\nAt the street they encountered Japanese civilians who walked off out of their way like water  parted at the Red Sea.\nWalked to the US Embassy guarded by Japanese Soldiers.\nThe Soldiers saluted.  Opened the gates and they walked in.\n\nThe War was Over. \n\nMacArthur created the modern Japanese Government.\nHe is respected by the Japanese for saving the Emperor and preserving their society.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "thebigguy963",
        "time": "2 September, 2022",
        "context": "How do we know the USS Missouri wants to identify as a she?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "pachy",
        "time": "2 September, 2022",
        "context": "On this day in history, January 6, 2021, WW III begins as Joe formally surrenders US.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "ihavenomouthandimustscream",
                "time": "2 September, 2022",
                "context": "Except that we're bleeding Russia white while smashing their economy.\nChina has taken note.\nWe're back after the disaster of the Bush2 Invasion of Iraq.",
                "good": "0",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "crazinessreins",
        "time": "2 September, 2022",
        "context": "Back when America was a truly great nation",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "plutoisaplanet",
        "time": "2 September, 2022",
        "context": "I don't see any Blacks in any of those photos.  They were probably in the galley fixing the victory meal.  That's racist!",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "lucabrasi940",
                "time": "2 September, 2022",
                "context": "It certainly was.",
                "good": "3",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "Jacko’diamonds",
                "time": "2 September, 2022",
                "context": "They we probably too busy stealing the silverware. ",
                "good": "0",
                "bad": "2",
                "replies": []
            },
            {
                "user_name": "OrangePlane",
                "time": "2 September, 2022",
                "context": "The military was segregated then. Blacks were often relegated to physical labor, etc.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "halo44327",
        "time": "2 September, 2022",
        "context": "Japan is in a better place now. Though we should leave their country. I think we can trust them on handling things on their end.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Touchman",
        "time": "2 September, 2022",
        "context": "Patton was right. He said, we’re going to have to fight the Russians sooner or later. We might as well do it now while we have our army’s right here in Europe. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Return_of_The_Great_'MAGA'_King_2024",
        "time": "2 September, 2022",
        "context": "The fly over during the ceremony consisted of 3,000 fighters and bombers.\n\nIt would have been an awsome sight to see.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Jacko’diamonds",
        "time": "2 September, 2022",
        "context": "Also, on this day in 1945, sloppy Joe Biden flew his B52 over the artic circle while saying to his crew.......right here you have your basic survival kit, $100 in Russian  rubles, one king James bible, two prophylactics, two candy bars, one 45 caliber pistol with two magazines.... The guy reminds me of Peter Sellers, kinda.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "lucabrasi940",
        "time": "2 September, 2022",
        "context": "The United States Of America never stood as tall as it did on September 2, 1945.",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "thebigguy963",
                "time": "2 September, 2022",
                "context": "September.",
                "good": "2",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "lucabrasi940",
                        "time": "2 September, 2022",
                        "context": "Of course, thank you.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "cootster",
        "time": "2 September, 2022",
        "context": "Too bad our surrender in Afghanistan didn't go this well ...",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "wormyourhonour",
                "time": "2 September, 2022",
                "context": "Yeah…5,000 Marines killed on Iwo Jima.  Some are still using 13 deaths as a political tool.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "jusslissen2me",
        "time": "2 September, 2022",
        "context": "I thought it was never called a surender because the Emperor was considered a god and the people would never accept it.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "the_light_in_dark_places",
                "time": "2 September, 2022",
                "context": "Watch the movie Emperor with Tommy Lee Jones.  Good movie.  The Emperor was the person who surrendered.  He did it over the radio in an address to the Japanese people and later to General MacArthur.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "316",
        "time": "2 September, 2022",
        "context": "This is what happens when you start a war against a once great country.",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "ihavenomouthandimustscream",
                "time": "2 September, 2022",
                "context": "You don't think we were great in 1941?\nBut we had been?",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "johne37179",
        "time": "2 September, 2022",
        "context": "It is fitting that we remember those who gave their lives and those who served to protect the country in World War Two. Approximately 100,000 American servicemen's  lives were lost each year during the war. That is roughly the same number of Americans we are losing each year to drug overdoses from the drugs coming across our open southern border. My family had three members who were veterans of World War Two. I can't help but wonder what they would think of the invasion and casualties we are suffering today because we have surrendered to an unarmed invasion and international criminals whom our president has given an open invitation to invade.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "leroy101",
        "time": "2 September, 2022",
        "context": "Those surrender pictures tell a story in themselves.  A very formal event with the Japaneses dressed in formal attire while MacArthur, and every officer was dressed in class C uniforms without even ties, jackets or pressed  clothing.   Also unknown to most WWII buffs the surrender was not unconditional as stated, but with special conditions making the Emperor untouchable. and even protected.  Unlike Germany there were very few war crime trials even though the atrocities  committed by the Japanese were as bad and even worse !",
        "good": "1",
        "bad": "1",
        "replies": [
            {
                "user_name": "ihavenomouthandimustscream",
                "time": "2 September, 2022",
                "context": "Most WW2 buffs do know that where I live.",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "consequence",
                "time": "2 September, 2022",
                "context": "They got the worst offenders and put an end to militarism and imperial worship in Japan.",
                "good": "1",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "retired1811",
                "time": "2 September, 2022",
                "context": "I’m a WWII buff and have travelled to many sites in Europe and the Pacific. There were a significant number of Japanese war crime trials but they just were not as hyped as Nuremburg. I have dove on the sunken Japanese wrecks at Truk Lagoon that were sunk during air raids in February 1944. Truk is a place few know about, since the U.S. military by passed it vs. invading. All of the U.S. pilots who were shot down during the attacks on Truk were tortured and murdered by the Japanese. Eventually, numerous Japanese were tried for that war crime and executed, but few people know this occurred.",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "mallard1",
        "time": "2 September, 2022",
        "context": "Nice to see today was remembered.\nMany served and some never came home",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bill511",
        "time": "2 September, 2022",
        "context": "These men and women of the WWII generation would be appalled of today's America. Today's government is what they were fighting against. America is not even a shadow of it's former self, and this is coming from someone who has fought and bled for this country.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "john84",
        "time": "2 September, 2022",
        "context": "By far the biggest mistake in Japanese history... attacking the US...",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "ihavenomouthandimustscream",
                "time": "2 September, 2022",
                "context": "That and maybe isolating and rejecting technology for hundreds of years.",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "Touchman",
                "time": "2 September, 2022",
                "context": "It was the only war in their history that they ever lost. ",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "retired1811",
        "time": "2 September, 2022",
        "context": "Having studied WWII for many years, I believe the world wide death toll is closer to 100 million. Russia and China alone each lost over 20 million people.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "acarl007",
        "time": "2 September, 2022",
        "context": "Guess Hirohito was not a God",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "PurpleCoffee",
        "time": "2 September, 2022",
        "context": "Both of my parents served in WW2.  My Father was on a mine sweeper and my Mother was a nurse on Guam.   The only thing my Dad would say was He and his crew mates had to live with the fact that they could be blown to tiny pieces at any second.  My mother was a nurse, and Guam was the first stop on the way home for soldiers injured in battle.  As you could imagine lots of the men and women had horrible injuries.  So, she never spoke about it, ever.   Like many of the great warriors from that time they have passed on, so I want to thank them and all who served in WW2.",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "wormyourhonour",
                "time": "2 September, 2022",
                "context": "Great post….",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "acarl007",
        "time": "2 September, 2022",
        "context": "If it was not for America\nThe Chinese would be speaking Japanese",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cassandracomplex",
        "time": "2 September, 2022",
        "context": "\"The holy mission has been completed.\"\n\nThis sentence speaks volumes on mankind.  We view warring upon our enemies as a sacred duty that is never ending until our enemies are crushed beneath us.  Mankind is a tribal predatory species.  We group with like minded individuals not only to share our culture but to defend it and most important to set out to actively attack other tribes.  Warring is in our nature.  Since man began organized warfare the world hasn't known a year of peace.\n\nWe grew to become the world's top alpha predator (nothing hunts us) and we are also a super predator (kill without cause).  War is a noble and higher calling to us.  To murder to place ourselves on the top is the EXACT reason we are the world's top apex predator for the rest of our existence.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "ihavenomouthandimustscream",
                "time": "2 September, 2022",
                "context": "You like murder?\nYou are a Trump Voter?",
                "good": "0",
                "bad": "2",
                "replies": [
                    {
                        "user_name": "cassandracomplex",
                        "time": "2 September, 2022",
                        "context": "To liken the two of those shows your level of intelligence; and offers my reason for offering little reply.  What a waste that would be.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "ihavenomouthandimustscream",
                                "time": "8 September, 2022",
                                "context": "Sure, the guy who claims war is noble can't defend that.",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "PurpleTag",
        "time": "2 September, 2022",
        "context": "kruschev told the world what communism would do in America. They are all but there. so close, so very close",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "ihavenomouthandimustscream",
                "time": "2 September, 2022",
                "context": "You think Khrushchev is going to come back and make us communists?",
                "good": "0",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "anonymousmobster",
        "time": "2 September, 2022",
        "context": "Fun Fact: After we dropped those bombs on Japan, our country and military were depleted and we needed to rebuild our military quickly in order to back up what we had just done. Our government cut costs everywhere they could to funnel money back into the war machine. After the advent of Thorazine in the early 1950's, the idea was sold to the public that this new wonder drug would allow the mentally ill to rejoin society. Except nobody was actually given the authority to to ensure these new outpatients take their meds. 70 years later our liberals are still without their safe spaces. We must rebuild our mental hospitals!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "siamsam",
        "time": "2 September, 2022",
        "context": "I salute my Father, Uncles Jimmy, Earl, and Carl...All helped get it done..Rest in Peace...We miss You!!!!",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "sirwhompy",
                "time": "2 September, 2022",
                "context": "I cant help but agree. My fathers first cousin was killed in action on August 9, 1945. He was lost on the USS Bullhead the last American submarine lost in World War 2",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "siamsam",
                        "time": "5 September, 2022",
                        "context": "My Father(Army) and Jimmy(Navy) survived unhurt, Carl(Marines) was bayoneted on Okinawa (yes, in the butt), recovered, assigned light duty on the \nMo., but said he could not see anything onboard Sept. 2...Earl(Army) shot through hip on Omaha Beach (came out where Carl's went in) recovered sent home..Lots of jokes flying when those guys were still around at July 4 picnics!",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "d'artagnan0962",
        "time": "2 September, 2022",
        "context": "Next to the USS Arizona at Pearl Harbor is a fitting place for the USS Missouri to be moored. The Arizona, killed by sneak attack on the first day of the war, still bleeding oil from her wounds after all these years, laying on the bottom with so many of her crew forever entombed; and next to her the Missouri, symbol of America's righteous retribution and victory on whose deck the Arizona's killers were forced to surrender.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "the_light_in_dark_places",
        "time": "2 September, 2022",
        "context": "We should always thank our vets but we should thank the Japanese as well.  Their decision to surrender in spite of having the means to keep fighting saved countless American and Allied lives.  The Germans fought almost to last, even when it was obvious they couldn't win and we lost many good people, as did they.  I know Truman leaned on them with some 'nuclear persuasion' but there were many in Japan who wanted to keep fighting.  Thank-goodness they didn't.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "consequence",
        "time": "2 September, 2022",
        "context": "A salute to the US 6th Army (Aust/New Guinea/Philippines) where my dad served and to the US 10th and 11th Air Forces (Aleutians/China/Burma/India) where my father-in-law served.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "humanitas",
        "time": "2 September, 2022",
        "context": "A prayer for the millions who died because of self interest ambitions of power.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "CDC1925",
        "time": "2 September, 2022",
        "context": "Our Great grandchildren will be also looking at this picture but another pictured that will be taken on the steps of the capital when the war that Biden is pushing for against the hard working American when the war is over and the anti Americans surrender unconditionally   It will be dated November 2024. God bless America",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Peteinny2",
        "time": "2 September, 2022",
        "context": "Did anyone in the administration even make note of this!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "archer464",
        "time": "2 September, 2022",
        "context": "The WWII started on Sep 1st, 1939 and ended on May 9th,1945.\nThe US and Japan fought until September but that doesn't represent world war. ",
        "good": "1",
        "bad": "1",
        "replies": [
            {
                "user_name": "consequence",
                "time": "2 September, 2022",
                "context": "Unless, you are China.  Their WWII began in 1931 when Japan took Manchuria and invaded China proper in 1937.",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "sirwhompy",
                "time": "2 September, 2022",
                "context": "Considering how many American, Australian, New Zealand, Chinese, Indian, and even Russian casualties occurred fighting the Imperial Japanese Military in places as diverse as Alaska and Burma, I must respectfully disagree with this assessment. Further, the war against Japan took resources that could also have been used in Europe and thus it was certainly a World War",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "dbrint",
        "time": "2 September, 2022",
        "context": "I wonder why it took the greatest generation to know that a man can't have a baby, doesn't belong in women's sports, shouldn't wear dresses, doesn't shoot up schools, etc ",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "russternj1000",
                "time": "2 September, 2022",
                "context": "You like how they segregated minorities and pretty much prevented women from getting jobs.",
                "good": "1",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "nodakfellow",
                        "time": "2 September, 2022",
                        "context": "No but I like how the sacrificed so much to make sure evil didn't take over the world. \nPeople today need a safe space if people say meany words that hurt their little feelings. That generation lost  close to a half a million men to make sure the world was safe.",
                        "good": "1",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "Touchman",
                                "time": "2 September, 2022",
                                "context": "We’ll said. Some people can only see flaws in America’s past, as measured by today’s standards.  In 75 years my grandchildren will learn that the greatest tragedy of the 2020’s was the promotion of transgenderism, wokeness, renewed segregation, and the feminization of boys.  ",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "user_name": "consequence",
                        "time": "2 September, 2022",
                        "context": "The US military segregated only one minority and women went to work in droves during WWII, but moms mostly stayed home to raise their children while dad was at war.",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "OliveDucky",
        "time": "2 September, 2022",
        "context": "Can't wait for China to do the same thing!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "YourHoliness",
        "time": "2 September, 2022",
        "context": "This is what happens when the military is allowed to win.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ady913",
        "time": "2 September, 2022",
        "context": "Exactly Six years from the day WW2 started on September 3: 1939 ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bruwor",
        "time": "6 September, 2022",
        "context": "Should have dropped 4 more atomic bombs and executed the Japanese delegation after signing surrender documents and thrown them into the bay.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "walkingat41",
        "time": "2 September, 2022",
        "context": "My father and his brothers were very happy Truman used the A-bomb,",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "blazerswampthing293",
        "time": "2 September, 2022",
        "context": "Its been a while since we had a rogue dictator reeking havoc on the planet.  Might be why the dems are fighting for their fascist agenda.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "America’sBattalion",
        "time": "2 September, 2022",
        "context": "Last time we declared War and worked as one Nation to win. Korea, Vietnam, Beirut Lebanon, Afghanistan ect. Bring back the draft. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "WSHE",
        "time": "2 September, 2022",
        "context": "During WW 2 America provided aide to China and let American fighter pilots join the Flying Tigers to fight against Japanese forces. \n\nNow fast forward to today and America is working with Japanese forces in training against possible attacks from China",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "seniorpop",
        "time": "2 September, 2022",
        "context": "A patriotic salute to you World War II Veterans!\nFamily is re-watching the \"Pacific\" series. The bravery, sacrifice and suffering of those that served cannot be overstated.\nThank you for the freedoms we enjoy!!",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "PurpleClover",
        "time": "2 September, 2022",
        "context": "🐒🗯",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "scorpssoul",
        "time": "2 September, 2022",
        "context": "RIP all you heroes!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "maxxx",
        "time": "2 September, 2022",
        "context": "And that would be the last war that the americans won.\nThey just don't make leadership the way they used to, let alone the men to carry out the commands with ruthless vigor.",
        "good": "0",
        "bad": "0",
        "replies": []
    }
]