[
    {
        "user_name": "harrybutwisker",
        "time": "28 July, 2022",
        "context": "It's abigfloatigrock",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "fakeitgoodnasa",
        "time": "28 July, 2022",
        "context": "Clearly Nasa is running low on Mars fakery, so they come up with this claptrap.",
        "good": "1",
        "bad": "7",
        "replies": [
            {
                "user_name": "quietsmith",
                "time": "29 July, 2022",
                "context": "I forgot the laugh track for your nonsense :D",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "fakeitgoodnasa",
                        "time": "30 July, 2022",
                        "context": "Laugh it up while you can kiddo.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "austindoc461",
        "time": "29 July, 2022",
        "context": "I would rather see this money go back as tax breaks then wasted on Mars drones.",
        "good": "0",
        "bad": "5",
        "replies": [
            {
                "user_name": "quietsmith",
                "time": "29 July, 2022",
                "context": "Yes, clearly the .5% of our budget that goes to NASA is going to amount to a lot in that regard.",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "mensaman",
        "time": "28 July, 2022",
        "context": "Why is there such a long wait to retrieve the samples? We have samples loaded and we wait till 2031? Musk will have a colony on Mars by then and their bar will be throwing out the first drunks.\nThey intend to launch in 2031 and we wait two years for the return? I guess Mars is in a suboptimal orbit to Earth.  I would have had a rover grab a handful, launch it and get it back by 2025.",
        "good": "6",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "chaffer",
        "time": "29 July, 2022",
        "context": "Keep spending. Can't have enough\n rocks.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "jrettinger",
        "time": "28 July, 2022",
        "context": "NASA resorts to any cheap gimmick for demanding billions of your tax dollars.",
        "good": "4",
        "bad": "5",
        "replies": [
            {
                "user_name": "mizzenmast",
                "time": "29 July, 2022",
                "context": "Agree ... First woman and minority on the Moon ... is a cheap gimmick, but not this one.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "Americansfirst755",
        "time": "28 July, 2022",
        "context": "as buzz just said out loud you should go to the moon first lier's ",
        "good": "1",
        "bad": "1",
        "replies": [
            {
                "user_name": "quietsmith",
                "time": "29 July, 2022",
                "context": "The people who told you that misrepresented what he said :D\n\nBut it's amusing when liars call others liars.",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "NWOequalsFail_2022",
        "time": "29 July, 2022",
        "context": "let's volunteer slo Joe a ride on one of those.  take IT thing Levine with him. 👍 ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "demsliecitiesdie",
        "time": "29 July, 2022",
        "context": "Why do we need rockets if we can get to Mars in a helicopter ? Asking for a Democrat.",
        "good": "2",
        "bad": "1",
        "replies": [
            {
                "user_name": "atsvrcoupe",
                "time": "30 July, 2022",
                "context": "Democrats are BUILDING those helicopters just like we built Perseverance.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "jcljedi",
        "time": "29 July, 2022",
        "context": "I do kinda wonder what the value is of the return part of this , considering we might very well already have a few people on mars by that time.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "tigers1968al",
        "time": "29 July, 2022",
        "context": "If we are going to spend money on this, it would be nice if NASA would show us more photos (not animations) and give more detail on what they find.  That's the least that they can do.",
        "good": "3",
        "bad": "0",
        "replies": [
            {
                "user_name": "coldsauce",
                "time": "29 July, 2022",
                "context": "You're right, though perhaps without fully realizing the additional technical hurdles that presents.  But I have long thought that Nasa underestimates the importance of public engagement, it's not some minor detail, not a web page design job for a summer student.  Scientist are good at what they do but they tend to hive off funding and PR to other departments.  They need to bake that into the design criteria.  A return to crewed exploration beyond LEO would probably solve the problem, but in the meantime, they need to remember - we're the paying customers - and we want a show.",
                "good": "3",
                "bad": "1",
                "replies": []
            },
            {
                "user_name": "Tarzaan",
                "time": "4 August, 2022",
                "context": "Can’t do that, evidence of ET would cause a panic ",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "yourkidding016",
        "time": "29 July, 2022",
        "context": "But affordable housing will have to wait. ",
        "good": "1",
        "bad": "1",
        "replies": [
            {
                "user_name": "quietsmith",
                "time": "29 July, 2022",
                "context": "I'm sure that the .5% we spend on NASA will magically make all of the public sector housing projects we've tried and failed at for years suddenly become thriving areas.",
                "good": "3",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "boundtoglory",
                "time": "29 July, 2022",
                "context": "affordable housing exists...",
                "good": "1",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "trumpwasademocrat",
                        "time": "29 July, 2022",
                        "context": "In rural Arkansas?   That's cause no real humans live there!",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "boundtoglory",
                                "time": "30 July, 2022",
                                "context": "No there are a lot of places that can be found - granted may not be where you want to be but definitely not urban Arkansas also may not be the house you dream of but a roof is a roof and this is coming from a person who was homeless with a wife and Kid for  a few months... We also survived about 18 years on one income and that time when we were homeless was because the house we were is was unsafe and caught fire... If you are doing life right and well, homelessness is usually because of a direct action of the person whom is homeless...",
                                "good": "0",
                                "bad": "1",
                                "replies": []
                            },
                            {
                                "user_name": "atsvrcoupe",
                                "time": "30 July, 2022",
                                "context": "I'd rather live in Mt. Ida, Arkansas (population 1160) than NYC.\n\nI've been there.  It's a nice place - not much besides the highway next to it and the trees and Ozarks all around it.  There's also a river nearby.",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "user_name": "atsvrcoupe",
                        "time": "30 July, 2022",
                        "context": "School choice exists too, but that doesn't stop the socialist demands to redistribute wealth from Republicans.\n\nTerm limits also exist:  It's called the ballot box.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "mizzenmast",
                "time": "29 July, 2022",
                "context": "I would much rather spend money on exploration than entitlement handouts.",
                "good": "2",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "yourkidding016",
                        "time": "29 July, 2022",
                        "context": "So far exploration has gotten us TANG.",
                        "good": "0",
                        "bad": "1",
                        "replies": [
                            {
                                "user_name": "mizzenmast",
                                "time": "30 July, 2022",
                                "context": "You should reconsider. If you are posting on a computer, or had any life-saving medical procedure, or own a cell phone, etc, etc, etc ... those all trace their development to science and technology made possible by the space program.",
                                "good": "1",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "yourkidding016",
                                        "time": "30 July, 2022",
                                        "context": "None of what you mentioned has made my life much better.",
                                        "good": "0",
                                        "bad": "1",
                                        "replies": [
                                            {
                                                "user_name": "mizzenmast",
                                                "time": "30 July, 2022",
                                                "context": "Well, that makes one of us.",
                                                "good": "0",
                                                "bad": "0",
                                                "replies": []
                                            }
                                        ]
                                    }
                                ]
                            },
                            {
                                "user_name": "boundtoglory",
                                "time": "30 July, 2022",
                                "context": "also mechanical heart and plenty of other innovative products and concepts that would have never been considered if they weren't problems that needed to be solved to explore space.",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "user_name": "yourkidding016",
                        "time": "29 July, 2022",
                        "context": "I don't want entitlements either. Young people can't afford $500,000 starter houses.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "mizzenmast",
                                "time": "30 July, 2022",
                                "context": "Then don't feel like you have to buy $500k starter houses. There are plenty of places in the country where young people can work and afford to live. It is not my responsibility to buy them houses in expensive places.",
                                "good": "0",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "atsvrcoupe",
                                        "time": "30 July, 2022",
                                        "context": "Most people aren't looking for $500K starter homes, but you know what $500K will get you in my neighborhood?   A home very similar to mine.  I paid less than half of that AND it's paid off too.  (well...less than half if you don't count the interest, but overall still less than $500K).\n\nI used to SHARE a $300 a month apartment with a Chemical Engineer and like he always said, \"Weed will get you through times of no money better than money will get you through times of no weed.\"   Just a little stoner humor there, but aside from the CRIME and the lack of heat during winter, sharing a $300 a month apartment wasn't so bad. I'm still 95% sure the burglar was the maintenance man in that apartment building - no way to prove it and it's not like the cops care about people who live in such low-rent housing.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": []
                                    }
                                ]
                            },
                            {
                                "user_name": "boundtoglory",
                                "time": "30 July, 2022",
                                "context": "unless you are in NY or California not certain where there are starter homes for that amount - plenty new ones being built in Texas that are between $180K - $350K many used homes going for less than that.",
                                "good": "0",
                                "bad": "1",
                                "replies": [
                                    {
                                        "user_name": "atsvrcoupe",
                                        "time": "30 July, 2022",
                                        "context": "I remember what my parents paid for the home in Texas that I spent most of my childhood in. It was far less than even $100K.  Now?   It's well over a MILLION and that's downplaying the value quite a bit.  I haven't looked in a few years, but easily $1.5 million, probably more. It was nothing fancy - just a ranch-style house about a mile from where my father went camping as a Boy Scout when he was a kid - because when he was a kid that whole area was undeveloped.\n\nMost people can't afford to live in houses like that.  I know I can't.  I'd love to live in that house, but my parents sold it and built their own house that cost far more money.  Maybe I'll inherit that.  LOL, no.  I don't want my parents house. I mean it's nice and everything, but I'd have to move back to Texas.  Still, I'd rather move back there than California or NY.  I actually lived in NY for a month. It was NOT NYC, so It was okay.  I saw .38 Special...in upstate NEW YORK.  Good show.  I'd go again if they were the same band they were back then. Too bad they're not.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": [
                                            {
                                                "user_name": "boundtoglory",
                                                "time": "30 July, 2022",
                                                "context": "Yeah my mom purchase the house we lived in for about 40K in a subdivision in north Harris county in the late '80's and it will probably go for 200K now but starter cars weren't 20K to 60K back then either. Our current house was purchased in '91 at 42K and is worth 187K now... wouldn't catch me in NY or California sorry you feel so out of place here in Texas this is my home and don't have any reason to leave it.",
                                                "good": "0",
                                                "bad": "0",
                                                "replies": []
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "user_name": "trumpwasademocrat",
                        "time": "29 July, 2022",
                        "context": "Housing the homeless would be too, well, Christian.   We can't have that....",
                        "good": "1",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "mizzenmast",
                                "time": "30 July, 2022",
                                "context": "I would help anyone who needs it AND would take my help. If you walked by and gave $1000 to a homeless person, it almost certainly would not go towards rent.",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            },
                            {
                                "user_name": "boundtoglory",
                                "time": "30 July, 2022",
                                "context": "Christians provide plenty of housing for the homeless time for the secularists to step up and pay their fare share - seeing how many christian pay taxes and tithe seems they are helping more...",
                                "good": "0",
                                "bad": "1",
                                "replies": [
                                    {
                                        "user_name": "atsvrcoupe",
                                        "time": "30 July, 2022",
                                        "context": "Jimmy Carter and Habitat for Humanity do a lot for homeless people, but Republicans despise them.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": [
                                            {
                                                "user_name": "boundtoglory",
                                                "time": "30 July, 2022",
                                                "context": "I am republican and volunteer for habitat - most of my church does also and yes they are republican so not sure you know what you are talking about. \n\n- Carter was a horrible president - may be a good person but wouldn't vote for him or anyone like him...",
                                                "good": "0",
                                                "bad": "0",
                                                "replies": []
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "user_name": "atsvrcoupe",
                        "time": "30 July, 2022",
                        "context": "Me too, but dig this:   McMansions are far more profitable than affordable housing.  The city where I live doesn't want a bunch of homeless people. We've already got a few just like every other city in the US. We've had them for YEARS.  Some of them look like refugees from the meat plant in the next county.  Seriously, they hire a lot of actual refugees and of course some of them are illegal.  There's nothing they can do about that unless they start paying a living wage.  Americans won't work in the plants. It's hard work. They use E-Verify but they still get raided by ICE and before they used E-Verify they got fined MILLIONS by the EEOC for trying too hard to keep illegals out of the work force.\n\nThere are some unscrupulous lenders who will give loans to people they know can't pay them off. The whole idea is to collect as much money as they can and foreclose on the home and sell it again which is far more profitable than steady income from low-rent housing.  They do the same thing with car loans too - even the leased ones.\n\nThere are 3 tiers of housing in my neighborhood. There are apartments, townhomes/condos and McMansions. There are no homeless people in my part of town. They're downtown or hanging out in front of stores that we would NEVER walk to. I don't give them money, but sometimes I buy them food.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "OliveRaindrop",
        "time": "29 July, 2022",
        "context": "GOPers have become so depressing these days. You all could turn the most beautiful day into a complaining about cloud size. Have a beer. Put your phones down (me as well), Listen to the first Zeppelin album, and have a great Weekend. Let’s pick it up again on Monday.",
        "good": "3",
        "bad": "4",
        "replies": [
            {
                "user_name": "quietsmith",
                "time": "30 July, 2022",
                "context": "The left cannot go five minutes without finding some reason to be outraged about something and if they have to go that long without whining about Trump, they'll fall to the floor and start having a medical episode. \n\nThe left is always throwing a screaming, raging, temper tantrum about something.",
                "good": "3",
                "bad": "2",
                "replies": [
                    {
                        "user_name": "atsvrcoupe",
                        "time": "30 July, 2022",
                        "context": "Did you read the comments here?   It's right-wingers who are angry. Us liberals love science.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "quietsmith",
                                "time": "31 July, 2022",
                                "context": "Uh huh.\n\nAnd cancel culture exists for a reason :D",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "solemnseahorse512",
                "time": "30 July, 2022",
                "context": "Why so partisan?",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "atsvrcoupe",
                        "time": "30 July, 2022",
                        "context": "Because they're fascists and racists.  The sooner you realize you're not welcome in our country, the better.  You are the enemy. You will be replaced.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "OliveRaindrop",
                                "time": "31 July, 2022",
                                "context": "Sorry I’m a little confused. So, who is the enemy?",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "hammer4481",
                "time": "30 July, 2022",
                "context": "Right, and do not worry about Monkey Pox, it's just another scam like CV 19 to get people vaccinated and lessen the population.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "hammer4481",
        "time": "30 July, 2022",
        "context": "Looking for ancient life on Mars? What idiocy, it cannot and never happened. All this money wasted for useless Mars rocks that will have the same elements as in earth rocks. God created the sun the perfect distance from earth to sustain life--no other planet in this solar system qualifies. This money would be better spent helping to solve the earth's pollution problems--not fake climate change.",
        "good": "2",
        "bad": "1",
        "replies": [
            {
                "user_name": "atsvrcoupe",
                "time": "30 July, 2022",
                "context": "NOWHERE in the Bible does it say  God didn't create life anywhere else.  Aside from angels (including the fallen ones) we don't know if He did or not.\n\nThere is a LOT that we can learn - and MINE from Mars and other \"heavenly bodies\".\n\nYour hate for science is so great that if everyone thought like you we would have gone extinct before we even evolved.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "hammer4481",
                        "time": "30 July, 2022",
                        "context": "Nope, I hate false science like germ theory, 9/11 fraud, etc. There are other planets with intelligent life on them--but nowhere near here. God will not allow sin-infected humans access to other inhabited worlds. No one and nothing \"evolved\" which is more junk \"science.\" Just loaded with false \"science\" are you not, 'eh?",
                        "good": "0",
                        "bad": "1",
                        "replies": [
                            {
                                "user_name": "atsvrcoupe",
                                "time": "31 July, 2022",
                                "context": "Did you ever take biology in high school?",
                                "good": "0",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "hammer4481",
                                        "time": "31 July, 2022",
                                        "context": "In college I took biology. What does that matter? Germ theory cannot be proven, there is not one shred of evidence it's true--but the drug and medical cartels make billions on fake viruses. Be careful here--you have no idea how to prove a microbe causes an illness, and it's not the junk science, \"virology\" which has never isolated a virus.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "sunshine1801",
        "time": "30 July, 2022",
        "context": "what is this doing to our ozone layer?? ",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "atsvrcoupe",
                "time": "30 July, 2022",
                "context": "The ozone layer is FIXED. What are you, Rip Van Winkle or something?\n\nNo thanks to Republicans who said the world would come to an end if we couldn't use CFCs for our ACs.  And donald trump who said his HAIRSPRAY  never left his penthouse apartment in trump Tower.  No doubt it all drifted down to the 45th floor which TERRORISTS own.\n\nThat's right. The entire 45th floor is owned by anti-American Jihadis who are not only terrorists but war criminals.  Trump was just BRAGGING yesterday about what GOOD FRIENDS HE IS WITH THEM.  \n\nAnd it only cost them $4.5 MILLION which according to trump is chump change - too bad he was DESPERATE for that money when he sold it to them.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "mrdeplorabletoyou4",
        "time": "30 July, 2022",
        "context": "\"Get to da choppa !\"",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "JesusRocks!",
        "time": "29 July, 2022",
        "context": "Bring samples back to Earth? What could possibly go wrong? Lol....isn't there a horror movie about this?",
        "good": "1",
        "bad": "1",
        "replies": [
            {
                "user_name": "eii",
                "time": "30 July, 2022",
                "context": "We might wind up with our own real-life Walking Dead scenario.",
                "good": "2",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "atsvrcoupe",
                "time": "30 July, 2022",
                "context": "I'm sure there is, but there's a lot of BAD science fiction out there.\n\nMy favorite bad sci-fi movie was Santa Claus Conquers the  Martians. That's a real movie from 1964 starring....PIA ZADORA (among others).  Don't get too excited, she's only a little girl in it.\n\nSanta Claus: No siree! We're going out the good ol' fashioned way. Prancer and Dancer and Donder and Blitzen, and Vixen and Nixon... oh, consarnit I get those names mixed up, but the KIDS know their names.\n\nTV News Announcer: Here's another UFO Bulletin: The Defense Department has just announced that the unidentified flying object suddenly disappeared from our radar screen. They believe the object has either disintegrated in space, or it may be a space ship from another planet which has the ability to nullify all radar beams.\n\nBetty: What are those funny things sticking out of your head?\nRigna: Those are our antennae.\nBetty: Are you a television set?\n\nRigna: Chochem is eight hundred years old, you can't dismiss the wisdom of centuries.\nVoldar: I can.\n\nHer SECOND movie was totally hot though.  She was 27 when she made Butterfly which is the ONLY other Pia Zadora I've seen....oh wait...I didn't even realize she was in Hairspray.  Okay, I've seen THREE Pia Zadora movies.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "Malakie457",
        "time": "29 July, 2022",
        "context": "Yea, while inflation grows, recession builds, the world starts to burn waiting for WWIII, taxdollars are being spent on something that is not needed, has no purpose and accomplishes nothing.  They already have samples now, they don't need more.  Not like Mars has 100 biomes on it any longer.  It's a big rock at this point.. Pretty obvious the best way to learn to survive, is to GO there, take lotsa food and water and protective gear along with some kind of radiation shielding..  What more do you need to know?",
        "good": "1",
        "bad": "3",
        "replies": [
            {
                "user_name": "quietsmith",
                "time": "29 July, 2022",
                "context": "I'm sure the .5% of our budget that NASA takes will solve all one much less all of those problems.",
                "good": "1",
                "bad": "1",
                "replies": []
            },
            {
                "user_name": "lycopine",
                "time": "29 July, 2022",
                "context": "says the poster who puts up garbage on fox about having a \"purpose\" and \"accomplishing\" anything...",
                "good": "0",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "Malakie457",
                        "time": "29 July, 2022",
                        "context": "So tell us all, what does the billions spent do for anyone?  Heck Orion started design before SpaceX was a known thing for most people... and it is STILL a money pit that now has no real purpose especially since for SpaceX has already used theirs how many times for real to move people and supplies?\n\nSo, tell us.  What has NASA done that has helped anyone at all in any manner for the BILLIONS of taxpayer dollars it has burned through?\n\nI am not a Musk fan at all but even I can see how he has shown that NASA is a money pit and nothing more.",
                        "good": "0",
                        "bad": "2",
                        "replies": [
                            {
                                "user_name": "lycopine",
                                "time": "29 July, 2022",
                                "context": "I don't know, what does the TRILLIONS spent on war do for anyone?\nIf you bothered to look up some of the inventions that have come out of NASA that have been commercially available for decades you'd know that.\nUsed velcro lately?",
                                "good": "2",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "Malakie457",
                                        "time": "30 July, 2022",
                                        "context": "We are not talking about war, we are talking about NASA.   War and combat is whole other issue.. keep focused.. this is about NASA.  Spending billions, producing nothing and giving the American people no value except excuses on why it takes 2+ decades to build a capsule others built in a few years and for WAY WAY LESS money.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": [
                                            {
                                                "user_name": "lycopine",
                                                "time": "30 July, 2022",
                                                "context": "It was YOU who stated \"what does (such and such) do for anyone\" in your complaint about spending. So my comment is DIRECTLY related to your whining.\nThen, of course, you failed to address the numerous inventions that have come out of the space programs of NASA that I posted, giving velcro as one example. The fact of the matter is, that scientific advancement produces all kinds of inventions that benefit humanity, except the war industry, whose ONLY purpose is to destroy and kill. And THAT is the industry the US spends more on than the top 10 countries COMBINED.",
                                                "good": "0",
                                                "bad": "0",
                                                "replies": [
                                                    {
                                                        "user_name": "Malakie457",
                                                        "time": "30 July, 2022",
                                                        "context": "buwahahahaha.. Nice try to obfuscate there.   Velcro?   Man are you really going to try and make bull up now for your argument?   Velcro was the invention of a Swiss engineer, Georges de Mestral In 1941, it was NOT invented by NASA.\n\nLet's say even if NASA invented something in the past..  You think that justifies the billions spent today of MY money?   I SAID LAST 2-3 DECADES of spending.  We already know they can't seem to even build a spacecraft.. They have been trying since 2006 with Orion.\n\nSo I say the same to you.. NAME ONE THING MY TAXDOLLARS have brought out of NASA in the last 2 decades...  ONE THING that makes the BILLIONS spent worth it.\n\nAnd before you go all ranting again about military stuff, I think the F35 is the biggest rip off of the American taxpayer ever.   But we are talking about NASA in this debate, not the military.",
                                                        "good": "0",
                                                        "bad": "0",
                                                        "replies": []
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "OliveRaindrop",
                "time": "29 July, 2022",
                "context": "You’re a real visionary.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "Malakie457",
                        "time": "29 July, 2022",
                        "context": "No I am a practical common sense person.. NASA is far from visionary.. And while I am no musk fan, he is more visionary than NASA has been for 5 decades at this point.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "atsvrcoupe",
                                "time": "30 July, 2022",
                                "context": "No, you're a Neanderthal and if everyone had your attitude we'd still be living in hovels on some feudal lord's land working like slaves.\n\nI would say caves, but there's not nearly enough caves for the world's population even 1000 years ago.\n\nWe wouldn't have clean water, electricity or even steam engines. The boats would all use sails or oars and we'd fight with swords, spears, and bow and arrows. We wouldn't even have gunpowder because nobody would have ever figured it out.\n\nWe would be devastated by disease and starvation which would at least keep the population low so there would be more caves for those of us lucky enough to get one.  I'd much rather live in a cave than a hut made of twigs. At least it would be warmer in winter and cooler in summer and I'd have shelter from the rain and snow and wind.  Hopefully it wouldn't flood. That's sometimes a problem in caves.",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "qwery57",
                "time": "30 July, 2022",
                "context": "Love it!",
                "good": "0",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "tyredcynic",
        "time": "29 July, 2022",
        "context": "If we're going to spend billions on space rocks, let's go mine some asteroids and turn a profit.",
        "good": "0",
        "bad": "1",
        "replies": [
            {
                "user_name": "quietsmith",
                "time": "29 July, 2022",
                "context": "It's going to take a lot more than the .5% of our budget NASA uses to do that.",
                "good": "1",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "atsvrcoupe",
                "time": "30 July, 2022",
                "context": "We're working on it. It won't be the government that does it though - at least not in the US.   China, India, Russia and others are all working on it too. Everybody wants a piece of that pie.    Musk is probably the one in the best position to do it, but it's not like planning your summer vacation. There's a lot of work to be done and a lot of BORING research.  Musk is good at BORING though.  He even founded The Boring Company which I really haven't heard much about lately.  Have they gone underground?  (that's a joke).\n\nWell, the Boring Company's website says they're busy working on several projects so that's good.  I'm sure there's some tech being developed there that could be used to mine asteroids or planets.  Getting a boring machine to one of them will be hard though.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "HoodoooVoodooBlood",
        "time": "31 July, 2022",
        "context": "Nichelle Nichols, Lt. Uhura on ‘Star Trek,’ Dies at 89",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "angelpr",
        "time": "29 July, 2022",
        "context": "Why not send all Earth Criminals to collect samples. Put them to good use.",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "coldsauce",
                "time": "29 July, 2022",
                "context": "We tried that once, called it Australia.  Their kids turned out to be quite likeable, resourceful people.",
                "good": "1",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "cphh16b",
                "time": "29 July, 2022",
                "context": "because of jim crow laws, just ask syacey abrams.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "MassaMassa",
        "time": "29 July, 2022",
        "context": "Not much benefit to society except for the motivation to overcome technological roadblocks with possible practical uses for the advances.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "trumpwasademocrat",
        "time": "29 July, 2022",
        "context": "It looks like someone used their cannabis vape cartridge as a model for their conception of the ascent vehicle!  Toke up!",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Driver1820",
        "time": "30 July, 2022",
        "context": "How much money is being wasted in this endeavor? We have veterans and homeless people here that need help. There goes our taxpayers money to fund a useless venture.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "uspatriot2020",
        "time": "29 July, 2022",
        "context": "Someone remind us again how many trillions we are in debt.",
        "good": "1",
        "bad": "1",
        "replies": [
            {
                "user_name": "quietsmith",
                "time": "30 July, 2022",
                "context": "I'm sure the .5% of the budget NASA uses up is causing that and not say, bloated social programs or a bloated military.",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "FrenchCreekCL",
        "time": "30 July, 2022",
        "context": "Gawd, the trillions of tax dollars sunk into the space program...for rocks.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Suburbanfarmer",
        "time": "29 July, 2022",
        "context": "While we pursue the scientific exploration of the moon, mars and beyond the Chinese are about to claim our moon as their territory. Science will come later after their conquests. ",
        "good": "1",
        "bad": "1",
        "replies": [
            {
                "user_name": "lycopine",
                "time": "29 July, 2022",
                "context": "my oh my, we sure have an over active imagination today, now don't we?",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "ConanTheUnpleasant",
        "time": "29 July, 2022",
        "context": "The only actual cost for this and other explorations is the scrap metal value of the tackle not returned to Urth. The rest of the 'expense' are wages paid to folks here. Even material costs ultimately end up as wages. Most everyone benefits from this.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "cchatel",
                "time": "29 July, 2022",
                "context": "No idea what you're talking about.",
                "good": "3",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "ConanTheUnpleasant",
                        "time": "29 July, 2022",
                        "context": "Which particular passage do you find difficult?",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "cchatel",
                                "time": "29 July, 2022",
                                "context": "\"actual cost for this and other explorations is the scrap metal value of the tackle not returned to Earth\"???\nThe cost is in the billions of dollars. Expensive scrap metal...",
                                "good": "0",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "ConanTheUnpleasant",
                                        "time": "29 July, 2022",
                                        "context": "Not so. Those billions will remain right here on the home planet. Making mortgage payments, being invested, buying clothes, etc. They aren't taking it there and burying it.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "GreenPalmtree",
        "time": "30 July, 2022",
        "context": "I would like to see NASA put together a mission's objectives, to be used as a design criteria, with equipment ideation composed by independent contractors, like Space X. Without private industry, we'd still be burning up \"use one time\" boosters.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "atsvrcoupe",
                "time": "30 July, 2022",
                "context": "Oh look. It's another Q without a clue.\n\nHave you been living under a rock for the last several decades?  You can thank people like me for designing Perseverance and most of us do work for private industry. I've never worked for the government - not directly anyway.  Of course all my income is taxed so I actually do work for them, but they don't pay me.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "GreenPalmtree",
                        "time": "30 July, 2022",
                        "context": "Thank You so very much. If you mean under a rock, as far as not being professionally connected to an aerospace company, then yes.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "GreenPalmtree",
                        "time": "30 July, 2022",
                        "context": "I am curious, what was your design role or system of expertise?",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "DemocratsAREtheVIRUS",
        "time": "30 July, 2022",
        "context": "They need to take that stuff to the space station and not to earth until it is completely checked to be safe.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "solemnseahorse512",
        "time": "30 July, 2022",
        "context": "In this day and age I wouldn't be surprised to hear a fight broke out on Perseverance on the way back to earth, and the authorities were waiting to take them all into custody upon landing.",
        "good": "0",
        "bad": "0",
        "replies": []
    }
]