[
    {
        "user_name": "Quietly",
        "time": "26 September, 2022",
        "context": "11 months to locate and arrest a man for pushing someone.\n10+++ FBI agents were necessary to apprehend this obvious dangerous pusher of people.\nI'm so relieved to know how my tax dollars are being utilized.\nNOT",
        "good": "14",
        "bad": "0",
        "replies": [
            {
                "user_name": "pbricco",
                "time": "26 September, 2022",
                "context": "I guess you believe he should be able to assault as he chooses!  He should be held accountable for his actions!",
                "good": "0",
                "bad": "3",
                "replies": [
                    {
                        "user_name": "camperspouse52",
                        "time": "27 September, 2022",
                        "context": "The elderly man verbally assaulted his son.  All charges were dropped including the civil charges.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "pbricco",
                                "time": "27 September, 2022",
                                "context": "Verbally Assaulted is not legal grounds for violence!",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "byinablink",
        "time": "26 September, 2022",
        "context": "So very proud of those FBI guys.  Assuming, of course, that they did find probable cause where local agencies couldn't, and assuming there were no more terrorists crossing our southern border, they could have saved the $ and manpower and called him on the phone to come in.  They might have lucked out and got a confession; you know, like the one they couldn't squeeze out of Hilary for all her felonious conduct.  Keep up the stellar work, boys!",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Geórge",
        "time": "26 September, 2022",
        "context": "Democrats are violating Americans' Constitutional right to freedom of religion and freedom of speech - two of the most fundamental rights within the foundation of America. Are Democrats tryig to abolish the Constitution?",
        "good": "2",
        "bad": "1",
        "replies": [
            {
                "user_name": "quizblog",
                "time": "26 September, 2022",
                "context": "you feel the freedom of religion means you get to force it on anyone?",
                "good": "0",
                "bad": "1",
                "replies": []
            },
            {
                "user_name": "jaffy",
                "time": "26 September, 2022",
                "context": "Assaulting an elderly man isn’t freedom of religion or speech.",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "4katydid",
                "time": "26 September, 2022",
                "context": "Pushing a 72 year old man to the ground is neither freedom of speech nor freedom of religion.  If you think it is, perhaps you have not read the Constitution.",
                "good": "0",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "atheistaz",
        "time": "26 September, 2022",
        "context": "A guy assaulted an elderly man twice and finally got arrested. So unfair, right?",
        "good": "1",
        "bad": "1",
        "replies": [
            {
                "user_name": "sfcrete7",
                "time": "26 September, 2022",
                "context": "Yes it was unfair.   When the individual received the letter in May he volunteered to come in and talk to the feds.  Yet the FBI showed up to the man's house early in the morning with 15 - 20 Agents, then shackled and cuffed him.  Why not just ask him to come in or at least only use 2 or three agents?   This was nothing but a scare tactic and has no place in our federal law enforcement.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "bart_bartley",
        "time": "26 September, 2022",
        "context": "No FBI involvement after people burned down pro rights headquarters and churches this past summer though. Fraudulent FBI at it again…political tool of the left.",
        "good": "25",
        "bad": "0",
        "replies": [
            {
                "user_name": "quizblog",
                "time": "26 September, 2022",
                "context": "fake news",
                "good": "0",
                "bad": "4",
                "replies": [
                    {
                        "user_name": "camperspouse52",
                        "time": "27 September, 2022",
                        "context": "What is fake about the news about the FBI.  Must be a Biden flunky.",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "phantom",
                "time": "26 September, 2022",
                "context": "FBI IS FOR BIDEN ONLY.",
                "good": "2",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "doloreshaze",
                "time": "27 September, 2022",
                "context": "There was FBI involvement. There was also FBI involvement in the gigantic increase in violence against abortion clinics, providers and patients.",
                "good": "0",
                "bad": "2",
                "replies": []
            },
            {
                "user_name": "scott186",
                "time": "1 day ago",
                "context": "That's ok tools can be broken if you know what I mean.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "hjm9318@yahoo.com",
        "time": "26 September, 2022",
        "context": "This article had a lot of responses earlier today. I attempted a response, but it failed to post. Now all the previous posts are wiped clean. Apparently questioning FBI current training and response gets items blocked and deleted. My question was why between 15 and 25 agents (depending on who you believe in this article), would be needed, with weapons drawn to serve an arrest warrant on one guy, that is at home with his wife and kids. I would think that about 80-90% of those agents could have been left to work on their own case loads. What is with all this false bravado of the FBI lately? It used to be a respected ageny of our government, but it seems they now just want to be feared and respected. You earn respect!!!",
        "good": "2",
        "bad": "0",
        "replies": [
            {
                "user_name": "glowingcurie",
                "time": "26 September, 2022",
                "context": "The FBI isn’t censoring your Fox comments, Agnes.  Settle down.",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "liberalideasarealwaysbad",
                "time": "27 September, 2022",
                "context": "FBI...rotted on the inside now",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "darrellparks49",
        "time": "26 September, 2022",
        "context": "With his wife and children in the house, he was going to get in a shoot-out with 20 FBI agents? Now that's what I call real logic.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sheltiego599",
        "time": "26 September, 2022",
        "context": "I am pro life but this guy did assault an elderly man. I don't care what he said to his son; you don't commit an assault. The FBI should have kept their nose out of it. The two men involved should have been respectful to each other.",
        "good": "3",
        "bad": "1",
        "replies": [
            {
                "user_name": "jaffy",
                "time": "26 September, 2022",
                "context": "I agree, assault isn’t the answer, but in doing so, he violated a 30 year old federal law, hence the FBI.",
                "good": "2",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "Unlikey",
                        "time": "26 September, 2022",
                        "context": "This is a case that normally gets handled at the local level despite the federal crime.   Bank robbery, mail theft, credit card fraud and 1000s of other crimes could be prosecuted federally but the vast majority get handled locally.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "doloreshaze",
                "time": "27 September, 2022",
                "context": "So ... the FBI should not investigate federal crimes?   Or should only skip the ones you are cool with?",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "cathroopers870",
                "time": "27 September, 2022",
                "context": "If he committed assault why didn’t he get so much as a ticket the day of?",
                "good": "1",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "Marie2018",
                "time": "27 September, 2022",
                "context": "Did he?  Or did a father protect his child from an aggressive adult?",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "1789defender",
        "time": "26 September, 2022",
        "context": "That's nonsense.  According to Spock and Captain Kirk, it never happened.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "paultan397",
        "time": "26 September, 2022",
        "context": "The FBI is going thru dry run for when they arrest the arsonists and vandals who attacked multiple pregnancy centers",
        "good": "4",
        "bad": "0",
        "replies": [
            {
                "user_name": "quizblog",
                "time": "26 September, 2022",
                "context": "fake news",
                "good": "0",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "dp1971",
                        "time": "26 September, 2022",
                        "context": "Not fake news. Jane’s Revenge is a real domestic terrorist group. They’ve vandalized multiple pregnancy centers. No arrests made so far -with the current DOJ not surprising.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "doloreshaze",
                "time": "27 September, 2022",
                "context": "... and the arsonists, vandals, stalkers, shooters who have attached multiple abortion clinics, providers and patients.  Right?",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "cathroopers870",
                "time": "27 September, 2022",
                "context": "Right…. Those people get passes under this administration",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "phantom",
        "time": "26 September, 2022",
        "context": "DEFUND THE F.B.I. PERID.",
        "good": "2",
        "bad": "0",
        "replies": [
            {
                "user_name": "elbowsmcfadden",
                "time": "26 September, 2022",
                "context": "O rly?",
                "good": "0",
                "bad": "1",
                "replies": []
            },
            {
                "user_name": "FDP",
                "time": "26 September, 2022",
                "context": "They enforced a law that has been on the books for years….you don’t have a leg to stand on.",
                "good": "0",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "zemmer",
        "time": "27 September, 2022",
        "context": "How dare they to arrest and charge a Christian for pushing down an old man.  We all know that god told them to do it!!",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "pappawtom",
        "time": "26 September, 2022",
        "context": "So, someone could indicate that he is going to do something dangerous and claim to be a Christian and the entire FBI shows up to arrest him expecting that he might have lots of weapons at his disposal.  Now if that individual worked it up to imply that there might be many with him then the number of FBI and other such federal agents would be there in large numbers and while they are all there then something really important happens elsewhere and because they were all beside themselves to arrest this individual that many die elsewhere because of it.  Sounds about right for this current administration, doesn't it?",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "hateseveryone",
        "time": "27 September, 2022",
        "context": "The FBI used to be respected...used to be. Now they are a worthless joke in need of defunding.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Lou_H.",
        "time": "27 September, 2022",
        "context": "When are the Portland antifa thugs going to be arrested?",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "fudgeman",
        "time": "27 September, 2022",
        "context": "A year ago, a man was pushed for verbally assaulting a 12-year-old boy. The Phili district attorney didn't see grounds for filing charges, a civil case was thrown out of court. And yet, a year later, the FBI sends 2 dozen agents to arrest this man with weapons drawn. As violent crime sweeps across America... Fentanyl smugglers kill 10's of thousands of Americans... and children are being trafficked across the US southern border, this is what FBI leadership CHOOSES to use its resources on. Incredible.",
        "good": "9",
        "bad": "0",
        "replies": [
            {
                "user_name": "marcr",
                "time": "27 September, 2022",
                "context": "Not disagreeing with the sentiment, but I don't think it's FBI leadership.  It seems more like local field agents in conjunction with the local federal prosecutor.  It's not like the entire national FBI staff changes with every administration, the vast majority of them have nothing to do with who the pres or AG is.  Even the current FBI director was appointed by the previous administration.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "fudgeman",
                        "time": "27 September, 2022",
                        "context": "I don't think it's local field agents, I think it's the leadership.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "liberalideasarealwaysbad",
                        "time": "27 September, 2022",
                        "context": "Any case that can be used to smear Christian Conservatives gets the nod from top brass... Christopher Wray needs to be fired ASAP ",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "glowingcurie",
        "time": "26 September, 2022",
        "context": "The problem is not that he is a “pro-life activist”.  The problem is that he assaulted someone in direct violation of the law.\n\nLearn to keep your hands to yourself, and it won’t lead to a perp walk.",
        "good": "2",
        "bad": "2",
        "replies": [
            {
                "user_name": "1Jerimiah1",
                "time": "27 September, 2022",
                "context": "See above",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "glowingcurie",
                        "time": "27 September, 2022",
                        "context": "Same rules apply.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "cathroopers870",
                "time": "27 September, 2022",
                "context": "Interesting that in three cases- the day of with the police, later with the DA, and then after that in a civil suit, he wasn’t charged with assault…",
                "good": "1",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "liberalideasarealwaysbad",
                "time": "27 September, 2022",
                "context": "Go back to watching CNN so you can be prepared to be on the wrong side of history again tomorrow ",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "Farmall46",
        "time": "26 September, 2022",
        "context": "If you believe the FBI, then we might have some farm land to sell you cheap in Antartica.  You would be the perfect individual to own it.",
        "good": "2",
        "bad": "0",
        "replies": [
            {
                "user_name": "elbowsmcfadden",
                "time": "26 September, 2022",
                "context": "As if you own any land anywhere.",
                "good": "0",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "1Jerimiah1",
                        "time": "27 September, 2022",
                        "context": "Talk about missing the point, wow!",
                        "good": "1",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "cathroopers870",
                                "time": "27 September, 2022",
                                "context": "Don’t tell him, let Farmall make his sale…",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "liberalideasarealwaysbad",
                "time": "27 September, 2022",
                "context": "Let all the liberals move to the Northeast states and the west coast...you can have it if you promise to just leave is normal folks alone forever. We don't think like you...WARPED!",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "1canorwegian",
        "time": "27 September, 2022",
        "context": "Under Biden America has become a police state with Biden weaponizing the FBI and DOJ, arresting those who don't stand with him.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "superbigsexy2",
        "time": "26 September, 2022",
        "context": "Break the law go to jail",
        "good": "0",
        "bad": "3",
        "replies": [
            {
                "user_name": "liberalideasarealwaysbad",
                "time": "27 September, 2022",
                "context": "Already dismissed by courts twice. Maybe you can't read because you went to a liberal public school! Awe...",
                "good": "1",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "Marie2018",
                "time": "27 September, 2022",
                "context": "Really? Ya missed a few Constitution rights and requirements and left out 'accused', 'trial', 'due process' and 'conviction'.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "zendarya",
        "time": "26 September, 2022",
        "context": "I don't think the FBI can be cleaned up.  Rather than try to clean house,  how about make 3 branches.  2 highly partisan branches that investigate political figures from the opposite side of the aisle.  The 3rd - largest, to investigate other threats to the USA.  The partisan groups need to coordinate intel and debate whether the information warrants and investigation.  Transparency is ever a requirement.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "pmanwaring",
                "time": "27 September, 2022",
                "context": "How about let’s just get all of the top leaders of these agencies FIRED & anyone who did what they demanded the boss said to do instead of telling the big boss no ! We have no moral compass going on in this country right now & a lot of it has to do with the breakdown of our top government agencies being ran by liberal lunatics",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "moonlightmile",
        "time": "26 September, 2022",
        "context": "pushing someone isn't much of an assault. all politics. the age of someone should not be a factor, and if it is, the older man should be arrested too for a verbal assault on a child.",
        "good": "3",
        "bad": "0",
        "replies": [
            {
                "user_name": "elbowsmcfadden",
                "time": "26 September, 2022",
                "context": "Assault in an area where that's a federal crime.\n\nSpelled it out for you.",
                "good": "0",
                "bad": "3",
                "replies": [
                    {
                        "user_name": "moonlightmile",
                        "time": "2 days ago",
                        "context": "again, pushing someone isn't much of an assault regardless of the crazy laws man comes up with.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "tony—c",
        "time": "26 September, 2022",
        "context": "Is the FBI worthless—or what?  You’d think they would be going after bigger fish.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "FDP",
        "time": "26 September, 2022",
        "context": "He crossed the line, legally speaking.\n\nThere would not be a line in all this mess if pro-life activists, in the past, had not MURDERED pro-choice physicians and seriously harassed those working and volunteering at the clinics.\n\nNaturally, after that happened, laws were set up —laws that you don’t like. You want to be able to aggressively challenge and, if you could get away with it, harm those near the clinics.  \n\nEveryone gets that…\n\nBut it is not going to happen the way you want it to happen..\n\nSo, he assaulted someone, an older individual, and they will make an example of him to deter others..\n\nYou know what..that’s life.",
        "good": "3",
        "bad": "7",
        "replies": [
            {
                "user_name": "fudgeman",
                "time": "27 September, 2022",
                "context": "According to the Philadelphia District Attorney's office, he didn't cross the line.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "allahBS",
        "time": "27 September, 2022",
        "context": "Fbi is a sham",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "diane00",
        "time": "27 September, 2022",
        "context": "With all the horrible crime going on that is being ignored and this is what the FBI cares about? Wow.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "F0l2saken",
        "time": "26 September, 2022",
        "context": "Americans need to be prepared for what to do when the Gestapo comes knocking for you.",
        "good": "5",
        "bad": "0",
        "replies": [
            {
                "user_name": "jaffy",
                "time": "26 September, 2022",
                "context": "Don’t break federal laws and they won’t, pretty simple.",
                "good": "2",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "rebelrouser",
                        "time": "26 September, 2022",
                        "context": "Yea...who' law's???  In a world everything upside down...",
                        "good": "0",
                        "bad": "1",
                        "replies": [
                            {
                                "user_name": "FDP",
                                "time": "26 September, 2022",
                                "context": "This law HAS BEEN on the books for YEARS. It is not new at all. And the world is not really upside down… take a deep breath.",
                                "good": "1",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "rebelrouser",
                                        "time": "1 day ago",
                                        "context": "What is evil is good what is good is evil...If you cannot see that you cannot see the Truth...I pray for you...",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "user_name": "cathroopers870",
                        "time": "27 September, 2022",
                        "context": "Not sure he did",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "norinos358",
        "time": "26 September, 2022",
        "context": "The FBI has become the American Gestapo.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "1Jerimiah1",
        "time": "27 September, 2022",
        "context": "How did the FBI \"know\" he had a firearm.  Be careful people, they are spying on conservatives one way or another.",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Frogman167",
        "time": "27 September, 2022",
        "context": "How many Jane's Revenge vandals of pro-life counciling facilities have been arrested? ",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "elbowsmcfadden",
        "time": "26 September, 2022",
        "context": "Wait, how can anyone assault an elderly man and then call himself \"Christian\" in any way?",
        "good": "1",
        "bad": "3",
        "replies": [
            {
                "user_name": "1Jerimiah1",
                "time": "27 September, 2022",
                "context": "Did you not read the story.  The other guy assaulted his son and he does have the right to defend his son.",
                "good": "2",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "liberalideasarealwaysbad",
                "time": "27 September, 2022",
                "context": "You libs don't give up supporting a lie as long as you get your routine bribes from Biden ",
                "good": "2",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "texeyeguy",
        "time": "26 September, 2022",
        "context": "I'd like to see the tape. Maybe the old guy just fell down on his own to instigate an assault charge.",
        "good": "2",
        "bad": "0",
        "replies": [
            {
                "user_name": "cathroopers870",
                "time": "27 September, 2022",
                "context": "Live never lie. Why would you even think that was a possibility",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "liberalideasarealwaysbad",
                "time": "27 September, 2022",
                "context": "Fair question. He is a liberal for sure and they lie all day every day because they want what they want and will do anything to het their way!",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "timetofightback514",
        "time": "27 September, 2022",
        "context": "Scrap the FBI and start over. It has been hijacked by criminals (Democrats), and they're now a criminal organization themselves.",
        "good": "2",
        "bad": "0",
        "replies": [
            {
                "user_name": "liberalideasarealwaysbad",
                "time": "27 September, 2022",
                "context": "FBI...Federal Bureau of Intimidation",
                "good": "3",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "doloreshaze",
        "time": "27 September, 2022",
        "context": "Dude knocked down a 72 year old twice.  This is a crime.\nOr, do you think that it is OK if Christians break the law?",
        "good": "1",
        "bad": "4",
        "replies": [
            {
                "user_name": "sanity-escapes-me",
                "time": "27 September, 2022",
                "context": "No charges were ever filed for the guy being knocked down and the \"Philadelphia district attorney declined to take up the case and that a private criminal claim filed by the 72-year-old was ultimately thrown out this summer.\" \nIs it possible to rephrase your ignorant comment?",
                "good": "4",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "liberalideasarealwaysbad",
                "time": "27 September, 2022",
                "context": "Pal, come and harass my son and see what happens to YOU!",
                "good": "2",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "BuckyDoo",
                "time": "2 days ago",
                "context": "My kid is standing in an abortion protest line and some 72 yr old guy starts yelling at him? I’d take a pop at him. What kind of 72 yr old goes off on a 12 yr old? ",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "allahBS",
        "time": "27 September, 2022",
        "context": "FBI HAS LOST ITS RESPECT OF MOST OF AMERICA 🇺🇸 \n-- now waiting for my front door to be kicked in and arrested by Democrat fbi",
        "good": "5",
        "bad": "1",
        "replies": [
            {
                "user_name": "rinos-r-us",
                "time": "27 September, 2022",
                "context": "Remember when Obama came and took all our guns ?   Me either.",
                "good": "3",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "liberalideasarealwaysbad",
                        "time": "27 September, 2022",
                        "context": "They want to but know they'll be shot in defense of our Constitution...have you heard of it???",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "sbrickman",
                "time": "27 September, 2022",
                "context": "The Trump cult opposes law enforcement because Trump is a criminal",
                "good": "0",
                "bad": "2",
                "replies": []
            }
        ]
    },
    {
        "user_name": "sbrickman",
        "time": "27 September, 2022",
        "context": "Trump cult members would hate their own mother if Trump told them to",
        "good": "0",
        "bad": "2",
        "replies": [
            {
                "user_name": "Villager18",
                "time": "27 September, 2022",
                "context": "Heavens no....just hate you and your ilk.",
                "good": "2",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "ilovefoxnews246",
        "time": "27 September, 2022",
        "context": "Republicans hate law enforcement.  ",
        "good": "1",
        "bad": "2",
        "replies": [
            {
                "user_name": "liberalideasarealwaysbad",
                "time": "27 September, 2022",
                "context": "More liberal lies...do you work for CNN or the Washington Post?",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "samuraidave",
        "time": "27 September, 2022",
        "context": "So the local DA and police decided there wasn't anything to prosecute in this instance, but Garland thought that the 72 year old male was being denied entrance to a health care clinic.\n\n1) My hat's off to the 72 yr old for needing reproductive health care assistance\n2) Planned Parenthood isn't a health care clinic\n3) No charges filed against a 72 yr old intimidating a 12 yr old child? \n4) Just one more example of the corruption in the DOJ",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mightyoz801",
        "time": "27 September, 2022",
        "context": "2 things here:\n1. Abortion is no longer part of the federal landscape as the Supreme Court has taken it out of federal hands and given it to the states. That in itself takes the federal protection status away from abortion clinics does it not, gives that to the states.\n\n2nd: Pro-life clinics or facilities are covered as well by these same laws are they not? The reasoning being used is \"it is all about women's access to women's Healthcare, is it not? In that frame of mind where does the FBI stand on the terrorists list with Jane's revenge, the group ALLOWED by the feds to burn and destroy Pro-Life facilities without the FBI showing up at their door.\n\nIt is called selective outrage or prosecution.\nThat is and does run contrary to the law.",
        "good": "4",
        "bad": "1",
        "replies": [
            {
                "user_name": "camperspouse52",
                "time": "27 September, 2022",
                "context": "I would call it persecution.",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "peter-frigate",
                "time": "27 September, 2022",
                "context": "More likely it is called someone who thinks they are perry mason but is not.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "any1wannapeanut",
        "time": "27 September, 2022",
        "context": "Sometimes... well usually if not always.. there is a price to pay for doing the right thing. \nFather was defensive of his son being verbally attacked. He pushed, took it to far in being physical, but understandable, and man fell. Now has to pay price. \nGlad for all involved it was a scrape and not a cracked skull, simple falls can be deadly. \nFBI apprehension, excessive. It's not that hard to send a single agent to door, ask if willing to come, if not call in rest. There was no indication the father was going to resist. Can all be done respectfully and without all the fanfare.",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "liberalideasarealwaysbad",
                "time": "27 September, 2022",
                "context": "Answer...NO. Liberals do not negotiate. Liberals demand you do exactly as they say...period! Doesn't matter that they're nearly always 100% wrong. Doesn't matter if they can be factually proven wrong. Modern liberal democrats govern like Communists and just beat you down or make you disappear!",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "liberalideasarealwaysbad",
        "time": "27 September, 2022",
        "context": "Gaslighting period. Any descent person knows the FBI is corrupt. This use of force and intimidation is a democrat strategy. The guy pushed someone harassing his son. If someone harasses my loved ones they'll get far worse. Because I own a firearm I guess they'll bring tanks and tactical nuclear weapons when they come for me. Fight vs flight...I fight!",
        "good": "2",
        "bad": "0",
        "replies": [
            {
                "user_name": "peter-frigate",
                "time": "27 September, 2022",
                "context": "You like to attack elderly people?",
                "good": "0",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "irefusetowearamask",
                        "time": "27 September, 2022",
                        "context": "That elderly person deserved it.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "bigoo",
        "time": "27 September, 2022",
        "context": "SCOTUS should have rescinded federal protection of pregnancy clinics. Sloppy house keeping. ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "peter-frigate",
        "time": "27 September, 2022",
        "context": "Don’t these people need to work?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "siylencedogood565",
        "time": "2 days ago",
        "context": "I pray those responsible for this repent and turn to Christ in truth before the end. The governments of the world will make their stand against Jesus, but those who make up their numbers will all lose.\n\nPsalm 2:1 Why do the nations rage and the peoples plot in vain?\n2 The kings of the earth set themselves, and the rulers take counsel together, against the LORD and against his Anointed, saying,\n3 “Let us burst their bonds apart and cast away their cords from us.”\n4 He who sits in the heavens laughs; the Lord holds them in derision.\n5 Then he will speak to them in his wrath, and terrify them in his fury, saying,\n6 “As for me, I have set my King on Zion, my holy hill.”\n7 I will tell of the decree: The LORD said to me, “You are my Son; today I have begotten you.\n8 Ask of me, and I will make the nations your heritage, and the ends of the earth your possession.\n9 You shall break them with a rod of iron and dash them in pieces like a potter’s vessel.”\n10 Now therefore, O kings, be wise; be warned, O rulers of the earth.\n11 Serve the LORD with fear, and rejoice with trembling.\n12 Kiss the Son, lest he be angry, and you perish in the way, for his wrath is quickly kindled.\nBlessed are all who take refuge in him.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Iamright911",
        "time": "27 September, 2022",
        "context": "No FBI to arrest all the Criminals in NY and CA beating people nearly to death on the streets and on camera! They just get released with no mail.  Definitely a political move - the FBI is so corrupt!",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "peter-frigate",
                "time": "27 September, 2022",
                "context": "Do you know what a federal law is?",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "irefusetowearamask",
                        "time": "27 September, 2022",
                        "context": "Do you have a law degree? ",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "peter-frigate",
                                "time": "27 September, 2022",
                                "context": "Do you know what spam is because i am getting a little tired of yours.",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "user_name": "Iamright911",
                        "time": "27 September, 2022",
                        "context": "Do you?  There was no Federal law broken in this case, it was defense of his minor son!  Same as any sane parent would do regardless of the location it took place!  It’s all a sham!",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "peter-frigate",
                                "time": "27 September, 2022",
                                "context": "What injuries did his son suffer?",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "want2believe_ts-13",
        "time": "27 September, 2022",
        "context": "No persecution here at all, don't assault someone and you won't be charged with a crime. \n-A Christian.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "aviator792",
        "time": "27 September, 2022",
        "context": "\"The law makes it a federal crime to use force with the intent to injure,\n intimidate and interfere with anyone because that person provides \nreproductive health care.\"\n\nThe 'victim' in this case was not 'providing reproductive health care' (as if killing children is 'health care'). He was verbally assaulting a 12-year-old boy who was exercising his First Amendment right to pray on a public sidewalk. No one was prevented from entering the clinic. The feds have no case. Every FBI agent who participated in this action violated their oath of office. That swamp will have to be drained when sanity returns to the federal government, hopefully in January 2025.",
        "good": "0",
        "bad": "1",
        "replies": [
            {
                "user_name": "want2believe_ts-13",
                "time": "27 September, 2022",
                "context": "None of which has been validated.  If he did indeed yell at the kid, that still gives the father no right to physically assault him.  They most certainly have a case.",
                "good": "0",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "irefusetowearamask",
                        "time": "27 September, 2022",
                        "context": "What law school did you graduate from?",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "peter-frigate",
                                "time": "27 September, 2022",
                                "context": "You do not need to go to law school to know that physically assaulting an elderly man is not a good thing nor is encouraging a minor to engage in this when they should be at school.",
                                "good": "0",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "irefusetowearamask",
                                        "time": "27 September, 2022",
                                        "context": "I want to see your law degree before you give me a legal lecture.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": [
                                            {
                                                "user_name": "peter-frigate",
                                                "time": "27 September, 2022",
                                                "context": "I did not mention the law.  I mentioned right and wrong, unknown concepts to your average trumpster.",
                                                "good": "0",
                                                "bad": "0",
                                                "replies": []
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "peter-frigate",
                "time": "27 September, 2022",
                "context": "Wasn’t it the wife who was not there who claimed the worker was verbally abusive?  Isn’t she also the one who made the claims about the fbi?",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "BuckyDoo",
                        "time": "2 days ago",
                        "context": "Sorry Peter. Your comment that the 12 yr old should have been at school instead of at a clinic, doesn’t bode well for you. That’s the parents choice and there is nothing wrong with that decision. The key question is why would the father react to some harmless old man? Maybe the old man wasn’t so harmless. Maybe the old man should have been home watching the Price is Right. ",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "mtwallet526",
        "time": "27 September, 2022",
        "context": "What do you think we should call the new FBI  ? Because its for sure going to undergo some major in house changes of personnel.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "skorpio2021",
                "time": "27 September, 2022",
                "context": "First name comes to mind ...Stasi",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "sbrickman",
        "time": "27 September, 2022",
        "context": "Christians? Nah.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "betterdays",
        "time": "27 September, 2022",
        "context": "In other FBI related news, FBI spokesman defended two recent iniatives:  the death penalty for parking tickets, and agents being authorized to shoot litterers on sight.",
        "good": "3",
        "bad": "1",
        "replies": [
            {
                "user_name": "liberalideasarealwaysbad",
                "time": "27 September, 2022",
                "context": "They will also be assisting you to vote by filling in your ballot for you thus guaranteeing a democrat communist win! ",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    }
]