[
    {
        "user_name": "nevski",
        "time": "4 hours ago",
        "context": "I have no doubt at all that America attacked the Norde Stream pipelines. Why you ask?\n\nBecause only a country that is in a frenzied effort to harm Russia would do it. What better way to harm Russia than to destroy gas revenues which accounts for about 30% of the Russian GDP. Besides, only America has the expertise to place 200 lb of deep-water high explosives 300 ft down from the surface of the Baltic Sea so expertly that it blows up a concrete encased heavy special alloy steel pipe. This can only be accomplished with either a manned submersible or a robotic one. \n\nAmericans are the devious culprits but they are too cowardly to admit it.",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "rtrim",
                "time": "2 hours ago",
                "context": "It doesn't take that much technology to put the explosives 300 ft deep.  Three or four people with technical diving training can do it using lift bags to control the descent of the explosives package.\n\n\"While the recommended maximum depth for conventional scuba diving is 130 ft, technical divers may work in the range of 170 ft to 350 ft, sometimes even deeper.\"",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "nevski",
                        "time": "1 hour ago",
                        "context": "American naval units were conducting deep water exercises a few months prior in the area where the explosions occurred. These exercises would have been a perfect cover and opportunity to place these explosives with a timer.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "rtrim",
                                "time": "1 hour ago",
                                "context": "Still not proof and others are just as motivated.  You first said nobody other than the Americans had the technical ability, which isn't true.",
                                "good": "0",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "nevski",
                                        "time": "1 hour ago",
                                        "context": "Besides. Why would Russia deliberately destroy two pipelines that cost billions and years to construct; was a vital link to supplying gas to Germany without having to pay tens of millions in transit fees to other countries; and whose revenues accounted approximately 30% of their GDP? No, the culprit is America.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "richfranklin261",
        "time": "1 hour ago",
        "context": "I wish we had a space program.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tarheel63728",
        "time": "26 minutes ago",
        "context": "Just in time for Vladdy to draft them and send them to Ukraine.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "wonderhorse",
        "time": "7 hours ago",
        "context": "First!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "OldBuffaloHunter593",
        "time": "8 minutes ago",
        "context": "Being sent to Kamikaze training.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "andythelawyer",
        "time": "6 hours ago",
        "context": "If they have any sense they'll stay in Kazakhstan.  Otherwise they'll be sent to the Ukranian front to fight and die.",
        "good": "1",
        "bad": "2",
        "replies": [
            {
                "user_name": "thebestpolicy",
                "time": "3 hours ago",
                "context": "You don't know what you're talking about!",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "tarheel63728",
                "time": "25 minutes ago",
                "context": "They should have stayed where they were. Now they're cannon fodder.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    }
]