[
    {
        "user_name": "OrangeLocomotive",
        "time": "16 September, 2022",
        "context": "The \"big picture\" is that without a sealed border we are not a sovereign country and nothing more than a Third World Country a Banana Republic, the U.S. is toast",
        "good": "43",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "liekillerv2",
        "time": "16 September, 2022",
        "context": "Social media is hardly a scientific survey. But then Dems ignore REAL statistics like...oh I don't know...illegal border crossing numbers.",
        "good": "77",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Yngwíe",
        "time": "16 September, 2022",
        "context": "You might not like President Trump’s personality or his “mean’ tweets, but Americans were much safer while he was President, the southern border was reasonably secure, prices were steady, gas prices we much lower, criminals were prosecuted, and foreign enemies respected us. Joe Biden, the Democrat-led Congress, and leftist state and local politicians are turning America into a third world country.",
        "good": "622",
        "bad": "8",
        "replies": []
    },
    {
        "user_name": "bailey05",
        "time": "16 September, 2022",
        "context": "Now we know why Dems have to cheat to win an election..",
        "good": "59",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "alfred.e.bydin",
        "time": "16 September, 2022",
        "context": "Have a good day MV dealing with your 50 person crisis.",
        "good": "52",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "smkymtn1776",
        "time": "16 September, 2022",
        "context": "Liberals think 50 illegals is a \"crisis\"?\n\nOh wait....it IS when it's in their own town.  If it's somewhere else, it's okey dokey.",
        "good": "116",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Yngwíe",
        "time": "16 September, 2022",
        "context": "We shouldn't be at this point. Biden should be put on trial for treason by keeping the southern border open. Further, another major problem is inflation. It is hard to believe that so many people in America do not see how Biden is destroying this country. Many Americans who have worked hard day in and day out for decades providing for their families and planning for retirement have to delay retirement. Some are wondering if they will ever be able to retire because of inflation, which continues to rise. Often, retirees have a fixed income. Rapidly rising inflation erodes a fixed income. Biden does not care whether people who have worked for a living and supported their families and paid taxes have enough money for basic living expenses. People need to pay for utilities, housing, food, water, clothing, healthcare, and more. Joe Biden only cares about his woke agenda and shutting down the oil and gas industries. We need a conservative Congress (with term limits) and we need a conservative president. Otherwise we will lose the country. Term limits -Voter ID!",
        "good": "1.3K",
        "bad": "19",
        "replies": []
    },
    {
        "user_name": "libsbcrazy423",
        "time": "16 September, 2022",
        "context": "So according to the intelligence challenged left two bus loads equals a humanitarian crisis\nBut two million walking thru our border states is nothing and the border is secured",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bosco33",
        "time": "16 September, 2022",
        "context": "Drop them off in front of obama's estate.",
        "good": "44",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jagxk",
        "time": "16 September, 2022",
        "context": "This is great stuff. It shows the same hypocrisy as \"no hate here\" signs.",
        "good": "113",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "ubstupid",
        "time": "16 September, 2022",
        "context": "Keep sending them ",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "walker64",
        "time": "16 September, 2022",
        "context": "Send another 10 planes. Keep it going until Democrats demand a secure boarder. ",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "six30nine",
        "time": "16 September, 2022",
        "context": "Obama lives there. How many times did I hear him say, \"spread the wealth\"? How many illegals has he invited into his multi-million-dollar mansion? Michelle can serve them and clean up after them. Oh wait, she has 100 servants to do that.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "PRSplayer",
        "time": "16 September, 2022",
        "context": "Dems need a taste of what they doing to endless small towns.",
        "good": "27",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "CG28",
        "time": "16 September, 2022",
        "context": "Dems are learning to put their money where their mouths are...🤫😅🃏",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "alpha",
        "time": "16 September, 2022",
        "context": "Send them a few thousand more per week by air,land and sea",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cattywampus932",
        "time": "16 September, 2022",
        "context": "The rich elite will not tolerate  these sub humans on there Island. They will ALL be removed and placed in a cesspool called Fall River or Somerset, Ma. These are trash towns where these elites believe they belong.\n\nThe current avg home price on Martha’s Vineyard is 1.2 Million Dollars, do you honestly think these Liberal Democrats are going to ALLOW these 50 people to stay… not a chance. These are the TRUE FASCIST’s of America. The rich liberals on Martha’s Vineyard",
        "good": "25",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "survive3moreyears",
        "time": "16 September, 2022",
        "context": "They don't like them in their community.  They want to help by donating money, sending used clothing and a few canned goods but don't come ruin our town.  How about next time you send a busload, supply them with tents so they can make their own beachfront property and stay awhile.",
        "good": "377",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "HeidiMarlow",
        "time": "16 September, 2022",
        "context": "Send more!!   ",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "itssummerwhysomanysnowflakes",
        "time": "16 September, 2022",
        "context": "you wanted to be a Sanctuary city, so deal with it now, if you cant walk the walk then dont talk the talk you mass liberals",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Redwave667",
        "time": "16 September, 2022",
        "context": "Keep sending them daily plane rides, liberals want open borders bring it to them.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "guapo419",
        "time": "16 September, 2022",
        "context": "Send some to Philly.   Fetterman needs to join this party.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "factsthathurt101",
        "time": "16 September, 2022",
        "context": "Great job MV!  But only providing food and shelter for people from other countries that show a complete disrespect for breaking our laws at their very first opportunity deserve more!",
        "good": "17",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "slippin'jimmy",
        "time": "16 September, 2022",
        "context": "You mean those ultra rich liberal areas don't have the infrastructure to handle a few needy migrants?!?\nWell, I guess they better get snappin' because MORE ARE COMING !",
        "good": "93",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "rmm711",
        "time": "16 September, 2022",
        "context": "Liberal heads exploding. \nOver 50 illegals?\nTo leave, these illegals must now swim an ocean vs a river.\nGood luck Martha's Vineyard...one more beautiful location spoiled by our government",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "horace",
        "time": "16 September, 2022",
        "context": "Lib infested politicians on Martha’s Vineyard want to give the illegals a ticket on the ferry back to Cape Cod and two breakfast tacos.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Expatalone",
        "time": "16 September, 2022",
        "context": "Hahahahahahahahaha!!!!",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "russternj1000",
        "time": "16 September, 2022",
        "context": "Fox is trying so hard to make something of this period meanwhile it looks like the people of Martha's vineyard gladly took in the immigrants and over welcoming them.",
        "good": "0",
        "bad": "9",
        "replies": []
    },
    {
        "user_name": "justatease",
        "time": "16 September, 2022",
        "context": "The Plane Boss...The Plane.....hahaha...Send more of them..Next one needs to be a 747 packed jam full. Lets see how they like it....",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "FloridaforTrump368",
        "time": "16 September, 2022",
        "context": "Send more!!!! ",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "walker64",
        "time": "16 September, 2022",
        "context": "My guess is the illegals are under police custody. Unlike when the drop them off at 2am in your home town they scatter like ants. ",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "trc1",
        "time": "16 September, 2022",
        "context": "Let's send James Taylor to Martha's Vineyard to sing to the migrants.   \nWhoa...wait a second...I just found out he already lives there.  This is a no brainer!!!",
        "good": "15",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "copper768",
        "time": "16 September, 2022",
        "context": "Beyond the realm. SEND MORE…elitist",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "realralph",
        "time": "16 September, 2022",
        "context": "Fox News should also report that the community received the immigrants so well, people volunteered to help them. They were fed and housed so better than most deplorables in red states!!!! \nAnd oh, we are registering them to vote then send them to red districts within blue states!!!",
        "good": "0",
        "bad": "7",
        "replies": []
    },
    {
        "user_name": "amosmoore40",
        "time": "16 September, 2022",
        "context": "Start sending more look for the more dangerous ones in the group maybe with MS13 tattoos send them there ",
        "good": "17",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "amosmoore40",
        "time": "16 September, 2022",
        "context": "Time we send them to Beverly hills now",
        "good": "18",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "234",
        "time": "16 September, 2022",
        "context": "Only way Dems can defend this is to attack the opposition for beating them at their own game.\nAnd it's not working",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "t@rdigr@de",
        "time": "16 September, 2022",
        "context": "Look to the future.  Four out of five Americans lives east of St. Louis.  About one third of the US's western territory is populated by around thirty million people.  Nebraskans will be bilingual.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ladodgers",
        "time": "16 September, 2022",
        "context": "If I was writing that tweet I would have used a synonym for \"screw.\"",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "williebotts1",
        "time": "16 September, 2022",
        "context": "Democrats need a new dependent class of people in the US, just not outside their front door.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "flcracker606",
        "time": "16 September, 2022",
        "context": "When I was there this summer everyone was complaining that they couldn’t find maid’s, dishwashers, and landscaper’s,  Win Win Win!  Send more   Train them to be ready for (season)",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Liberalismisamentaldisorder725",
        "time": "16 September, 2022",
        "context": "If they don't like it stop voting for it.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "biscuitcrux",
        "time": "16 September, 2022",
        "context": "This is possibly the best example of pointing out leftist hypocrisy that I've ever seen in my 70 years on the planet, and I think it's AWESOME that the Lying Left is pulling out their own hair trying to figure out what to do next. \nI don't think there's have a single move they can make that won't make them look bad. \nThat's GREAT! tee hee hee  :-D",
        "good": "39",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "SocialismKillsPeople",
        "time": "16 September, 2022",
        "context": "More and more likely that DeSantis will be our next President. Keep up the good work!",
        "good": "291",
        "bad": "7",
        "replies": []
    },
    {
        "user_name": "uwantthetruth",
        "time": "16 September, 2022",
        "context": "Dear Gov. DeSantis & Gov. Abbott,\nPlease give them what they ask for and send your next 10-15 transports direct to the island.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "pwg2020",
        "time": "16 September, 2022",
        "context": "Welcome to the party pal!",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "guyjoseph",
        "time": "16 September, 2022",
        "context": "I'm sure Obama has plenty of room in his home to house several illegals, if not he can send them to Joe in Delaware.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "digitusimpudicus",
        "time": "16 September, 2022",
        "context": "50 people is a humanitarian crisis? Send the to the obama's house they have room.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "hoolio17",
        "time": "16 September, 2022",
        "context": "Dear Border Governors-\n\nLawn and garden season is coming to a close and people have closed their pools, so the good people of Mahthas Vinyud don’t really have a use for Hispanics at this time.  Let’s try again in April.  \n\n- Thanks  \nMV Citizens",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "justatease",
        "time": "16 September, 2022",
        "context": "Funny how much hypocrisy when the shoe is on the other foot coming out of the liberal media and lefties....hahaha",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "southerncross",
        "time": "16 September, 2022",
        "context": "Other great destinations for Migrants: 1) Rehoboth Beach, DE; Beverly Hills, CA; Telluride, CO; Portland, OR;\nSeattle, WA; Santa Fe, NM; Boston, MA; Asheville, NC; Any town in VT,RI,CT. and drum roll..........Newark,NJ.\nThey will thank you later !",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "SlickWillyLives",
        "time": "16 September, 2022",
        "context": "MV residents are the biggest hypocrites in the world. They wanted windmills for electricity but not within view of MV.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "daveburns67",
        "time": "16 September, 2022",
        "context": "How is it that 50 people in one of the wealthiest areas in the country create a crisis.  They have over 300 available AirBnBs.   These rich people don’t need to rent than but rather compassionately give this housing to the people they invited.  Biden moved thousands to small cities across the country in the dead of the night to places that have not invited nor declared themselves sanctuary cities.",
        "good": "731",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "Freightshaker62",
        "time": "16 September, 2022",
        "context": "Again there are labor shortages in Texas and Florida in hospitality and the restaurant industries. Offer them work.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "snicklfritz449",
        "time": "16 September, 2022",
        "context": "What happens when the tourists come to Martha's vineyard, is there a crisis.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "7sfga101",
        "time": "16 September, 2022",
        "context": "Liz warren and newsome could use a few plane loads",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "presidentpotatohead249",
        "time": "16 September, 2022",
        "context": "I'm OK if they bus them off of the island. 🏝",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Democratsloveterrorist",
        "time": "16 September, 2022",
        "context": "Liberals love open borders till they land on their doorstep",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "kalmarman954",
        "time": "16 September, 2022",
        "context": "Bury them in what they voted for. You want open borders? We’ll give you open borders.",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "trumpisgod142",
        "time": "16 September, 2022",
        "context": "Wonder why the decline in Christianity?  Read the Fox News threads!",
        "good": "0",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "losingmycountry",
        "time": "16 September, 2022",
        "context": "If 50 create a crisis, send 500 so they can feel what a crisis really feels like. Put a tent city outside of Obama's place. Maybe he can get useless Joe to change policy.",
        "good": "23",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "williebotts1",
        "time": "16 September, 2022",
        "context": "When plantation owners housed and fed workers and used them to perform menial tasks they called it \"slavery\". when democrats house and feed illegals and use them to inflate the population in congressional districts to maintain power and have them vote illegally it's called \"tolerance\".",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Sherm101",
        "time": "16 September, 2022",
        "context": "Please send some IIs to Madison Wisconsin. I hear they are a sanctuary city also. There is a nice little bus stop right next to the State  Capitol building and they can certainly house a few on the UW Madison Campus.",
        "good": "215",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "oldfighterpilot",
        "time": "16 September, 2022",
        "context": "Oh, now you just gotta send more!",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "twinsofusa",
        "time": "16 September, 2022",
        "context": "It's a pretty simple case of impeachment against Biden for violating his oath of office. Failure to uphold the constitution and laws of this country.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "maverick1688",
        "time": "16 September, 2022",
        "context": "These people look like anything but refugees. ",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mtwallet526",
        "time": "16 September, 2022",
        "context": "Well sure. EVERYONE knew that Texas towns had all the infrastructure to handle thousands of illegals per day. That's why no one else prepped for that. No one else had OK'd the idea of hundreds thousands, millions of illegals flooding into  their town each and every day. In fact, no one had talked about such a thing. But that didn't stop the handlers of the bungler in chief. Liberals have no foresight. No fore thoughts, of what the consequences of their actions would bring. Or just don't care. Their 'special interest' of the moment gets theirs. And that is all that does matter to them.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "redbird053",
        "time": "16 September, 2022",
        "context": "You might not like President Trump’s personality or his “mean’ tweets, but Americans were much safer while he was President, the southern border was reasonably secure, prices were steady, gas prices we much lower, criminals were prosecuted, and foreign enemies respected us. Joe Biden, the Democrat-led Congress, and leftist state and local politicians are turning America into a third world country.",
        "good": "64",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "MountainRambler",
        "time": "16 September, 2022",
        "context": "They love them, they can have them ! The only good way to treat them is to send them all back to where they came from, and send ALL Liberal democratic with them !",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "uwantthetruth",
        "time": "16 September, 2022",
        "context": "Hey MV be careful what you ask for you may just get it.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ssgb",
        "time": "16 September, 2022",
        "context": "They think it's a crisis now, wait till winter months arrive and more \"illegals\" are dropped off!",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "redbird053",
        "time": "16 September, 2022",
        "context": "You might not like President Trump’s personality or his “mean’ tweets, but Americans were much safer while he was President, the southern border was reasonably secure, prices were steady, gas prices we much lower, criminals were prosecuted, and foreign enemies respected us. Joe Biden, the Democrat-led Congress, and leftist state and local politicians are turning America into a third world country.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "RafeMontagu",
        "time": "16 September, 2022",
        "context": "Biden — the bane of our existence!",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "militaryhistorian",
        "time": "16 September, 2022",
        "context": "It's not a humanitarian crisis when it's a border state, but it is on Martha's Vineyard, what Communist/liberal/socialist/democrat HYPOCRITES!\nSend them to Minneapolis, Detroit, Albany, DELAWARE! and all the other DNC strongholds.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "oldschool1971",
        "time": "16 September, 2022",
        "context": "\" RAWHIDE \"",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "loot&scootbiden",
        "time": "16 September, 2022",
        "context": "Send some Haitians. They need to experience other cultures.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "alanfromatlanta",
        "time": "16 September, 2022",
        "context": "Poor poor millionaires.  What are they to do.   Oh boo hoo hoo.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "lillyskywalker",
        "time": "16 September, 2022",
        "context": "Martha, Martie, Mart - Sanctuary, that is all the illegals want, you promised it and now deliver....\nAlways be careful what you vote for, you just might get it......Keep those Greyhounds rolling.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Greatcountry",
        "time": "16 September, 2022",
        "context": "Joe Biden has made our country a dumping ground for illegals and terrorist alike , he and the democrats have ruined Americas security and we all have to vote the radical democrats out of office, there are some good democrats but not many , everyone vote republican please vote Republican ",
        "good": "54",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "californiareason",
        "time": "16 September, 2022",
        "context": "Hypocrisy is the bedrock that Liberalism rests upon.",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Hockeytown741",
        "time": "16 September, 2022",
        "context": "Send thousands and see them melt down !!",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "justwokeup2016",
        "time": "16 September, 2022",
        "context": "Here's a crazy idea, close the border and only allow legitimate asylum seekers in. You're welcome.",
        "good": "19",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "kfgl",
        "time": "16 September, 2022",
        "context": "Hispanics are voting more and more for Republicans, so don't count your chickens before they hatch. Yes, the residents put on a good show in welcoming them, but now \"Get out waaaaaa\"",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "piratedoc1945",
        "time": "16 September, 2022",
        "context": "Send the tatted MS13 there by the thousands 😎",
        "good": "16",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sho'nuff",
        "time": "16 September, 2022",
        "context": "5 new roofing crews isn't a crisis.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "honestycounts458",
        "time": "16 September, 2022",
        "context": "Talk is cheap!! MV folks and leaders support ILLEGALS, just as long as they are not in their nice little towns, cities and island. I hope they get 10 more plane loads and one definitely needs to be Obama’s front yard. They know how to scale a fence…",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "justice60",
        "time": "16 September, 2022",
        "context": "Still laughing 😁😁",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "californiareason",
        "time": "16 September, 2022",
        "context": "Waiting for the stealth article about a month from now stating the loving, tolerant, enlightened Libs on MV shipped these people off to New Bedford.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "🐉OldMan",
        "time": "16 September, 2022",
        "context": "Amazing how bad it is when the \"liberal\" elite communities actually have to deal with the problems they are perpetuating on border communities.\nQuick, send many many more.",
        "good": "214",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "TexasIndependent680",
        "time": "16 September, 2022",
        "context": "Next time send double the number of illegals to MV with fentanyl to sell and distribute. ",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "bigbaduglyrepublican",
        "time": "16 September, 2022",
        "context": "We could...BUILD A WALL...that wouldn't let just anyone pass through with drugs and diseases that are a threat to the American people.....",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "semiacerbic",
        "time": "16 September, 2022",
        "context": "Send them to the Capitol Bldg., see if Nancy calls that an insurrection.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ontherightbecauseiamright",
        "time": "16 September, 2022",
        "context": "the only humanitarian crisis I see, which is glaring, is the Biden administrations affect on the free world. That is a crisis like no other!!!!",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tears",
        "time": "16 September, 2022",
        "context": "The administration is the most cowardice, ignorant, unintelligent administration this country has ever seen. Look at all the people working for Biden, shameful, they weren't hired for their expertise they were hired for their liberal standing and complexion.\n\nOUR GOVERNMENT SHOULD SEND OUR MILITARY TO THE BORDER AND STOP THIS INVASION\nTHIS IS A RESULT OF THE INCOMPETENCE OF OUR LIBERAL GOVERNMENT\nVOTE REPUBLICAN AND MAKE AMERICA GREAT AGAIN",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "toological",
        "time": "16 September, 2022",
        "context": "Use the Florida NG and fly in a cargo plane filled with them...",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "agrenadeforeveryliberal",
        "time": "16 September, 2022",
        "context": "Are we flying more there today?\n\nDon't relent.",
        "good": "19",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "snicklfritz449",
        "time": "16 September, 2022",
        "context": "Send along some taco trucks, put them on every street corner like we have here. They're going to love the breakfast tacos,try the charizo, potato, and egg, delicious.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "californiareason",
        "time": "16 September, 2022",
        "context": "\"Sanctuary City\" was a political jab at Donald Trump. In NO WAY did these Libs intend to help anyone but themselves!",
        "good": "34",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tompettysfamilyislame",
        "time": "16 September, 2022",
        "context": "They support \"equity,\" now they got it special delivery...",
        "good": "42",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "justatease",
        "time": "16 September, 2022",
        "context": "This needs to happen everyday until Biden is gone from office or they fix the problem they created....",
        "good": "41",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dannrad",
        "time": "16 September, 2022",
        "context": "Isn't it funny how when you send a few immigrants to Martha's vineyard now also and you're now all sudden it's a problem but you can send you can send hundreds of thousands to Texas Nevada everywhere but everywhere but liberal cities and And that that's OK but the moment you send them to liberal cities that claim they were sanctuary cities then we're doing inhumane things well the border that they're coming in it's overran they have to send them somewhere and the sanctuary cities are where they should go",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "velvet53",
        "time": "16 September, 2022",
        "context": "These people were misled, by Republicans.",
        "good": "0",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "DaftDims",
        "time": "16 September, 2022",
        "context": "Democrats accusing the governors of political motives is really rich. After all when  Democrats opened the borders wide open to let in millions of future Dem voters was not politically motivated? Peleeeeese.",
        "good": "37",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "toological",
        "time": "16 September, 2022",
        "context": "Keep sending them..50 a day every day.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "patriotsusa",
        "time": "16 September, 2022",
        "context": "Biden to Prison!!!   Send him now!!!",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "pons5",
        "time": "16 September, 2022",
        "context": "Hey...send me to Martha's Vineyard!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bigbobbydmoney",
        "time": "16 September, 2022",
        "context": "I would have given them tents as well. ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "fiscalsense",
        "time": "16 September, 2022",
        "context": "That's one of the richest locations in the country.  It's not their pocket books that are being affected.   It's the eye-sore that a bunch of migrants represent to those filthy-rich people that caused them to declare a \"crisis.\"  Typical \"not in my back yard\" response by a bunch of disgusting human beings.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "FJB20",
        "time": "16 September, 2022",
        "context": "Send a few thousand more.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Mick7881",
        "time": "16 September, 2022",
        "context": "When these rich snobs realize that no where is safe they'll finally start putting pressure on Biden and his flunky's.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "scotus9113",
        "time": "16 September, 2022",
        "context": "The answer is so easy and neither side  gives a flying flip. Enforce current law that punish those that employ them. Problem solved. ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mk101mk693",
        "time": "16 September, 2022",
        "context": "DeSantis is the man! keep up the good work!",
        "good": "7",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "mlm1112",
        "time": "16 September, 2022",
        "context": "How did the illegals get to Florida in the first place 🤔? Who sent them there",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "williambayer025",
        "time": "16 September, 2022",
        "context": "\"Martha’s Vineyard was slammed on Twitter ...\" --- Unfortunately, being \"slammed on Twitter\" only means something to lazy couch-jockey \"journalists\" who sit around in their pajamas reading tweets and watching CNN, MSNBC, and The View all day. In the real world, \"slammed on Twitter\" means nothing.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Kingrichard509",
        "time": "16 September, 2022",
        "context": "😂😂😂😂Humanitarian crisis. A bit of an exaggeration. If Biden was doing his job the only place the illegals would be sent is back to Mexico",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dsdambo",
        "time": "16 September, 2022",
        "context": "We gotta impeach this senile mean ole man....soon! like Jan soon.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "asianamerican",
        "time": "16 September, 2022",
        "context": "Secure the border (and / or) vote Republican: Problem  solve.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "balls304",
        "time": "16 September, 2022",
        "context": "Hopefully a few busses show up in Delaware near sleepy Joe's house that he has spent half his time at since he stole the election!\n\"LET'S GO BRANDON!",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "scwoftx",
        "time": "16 September, 2022",
        "context": "The Dems complaining about how small Martha's Vineyard is to be bussing illegals there. They have no clue how small all the border towns are they have forced to accept thousands..",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jackr1",
        "time": "16 September, 2022",
        "context": "We need many more buses to Marthas Vineyard.",
        "good": "9",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "smithwesson565",
        "time": "16 September, 2022",
        "context": "Keep ‘em coming !! Rich leftists must give up their homes to provide housing for illegals. Hotels must be comandeered by the authorities. Restaurants must be forced to provide meals.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "another_nc_guy156",
        "time": "16 September, 2022",
        "context": "Haha - a few illegals show up and liberals are suddenly declaring a CRISIS.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "buurga",
        "time": "16 September, 2022",
        "context": "Every day it gets better. Walk the talk Libs.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "charles63039",
        "time": "16 September, 2022",
        "context": "AZ TX and FL should organize transit of 10,000 illegals into a caravan, and convoy them to biden’s personal residence in Delaware",
        "good": "25",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "wolfhowl99",
        "time": "16 September, 2022",
        "context": "Liberals have zero ability to think big picture, except when it comes to elections. They can’t comprehend the border crisis because it’s happening elsewhere. I still remember Jim Acosta blasting Trump for saying migrants climbing the wall was an invasion, and he said that it’s happening hundreds of miles away, so it’s not an invasion.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "annie789",
        "time": "16 September, 2022",
        "context": "Send more.  Let THEM have to be the ones having to worry about their families and property for a change..",
        "good": "159",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jeramy",
        "time": "16 September, 2022",
        "context": "Don’t feel bad biden sent twice that number to my city in the middle of the night with no warning. Coincidentally a 1/3 of them had covid. He also said we were responsible for the illegals he trafficked. \nYou all were warned.\nLessons in practicing what you preach……\nSuch a crisis….",
        "good": "48",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "brandonhuthut",
        "time": "16 September, 2022",
        "context": "but it's OK to fly them to Florida at midnight, gotcha ",
        "good": "14",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "7sfga101",
        "time": "16 September, 2022",
        "context": "I'll bet that maxine waters would love a bushel of them",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jmjral",
        "time": "16 September, 2022",
        "context": "Hebritin nice in hamerika, hebrytin flee in hamerika...",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "timafvet",
        "time": "16 September, 2022",
        "context": "I think there must be an available bedroom or two at the obama estate...",
        "good": "14",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cjsteel",
        "time": "16 September, 2022",
        "context": "Maybe they need to vett them better... start with send all the face/neck tats up there.... seems like they love those people",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "californiareason",
        "time": "16 September, 2022",
        "context": "Sanctu-NIMBY Libbie said WHAT??",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "NeeCee66768",
        "time": "16 September, 2022",
        "context": "Biden won’t even go to the border.  That says volumes ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Styles77",
        "time": "16 September, 2022",
        "context": "Those leftist cupcakes are in a twist, and I love it!",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "freesouthafrica",
        "time": "16 September, 2022",
        "context": "ANC  , EFF TERRORISTS \n\nWHITE GENOCIDE \n\nRAMAPHOSA LANDS IN WASHINGTON FOR TALKS WITH BIDEN\nThe two leaders are expected to discuss topics covering infrastructure, investment and the pressing regional and global challenges facing both nations.\nNews24 SA\n\nBIDEN FOR TERRORISTS",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "spalted",
        "time": "16 September, 2022",
        "context": "Why have a government if it’s not going to enforce the law or defend the border?",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "justatease",
        "time": "16 September, 2022",
        "context": "THE BORDER IS CLOSED...ONLY AFTER ITS OPEN THEN ITS CLOSED AGAIN......\n\n\"Kamela Harris\"",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "gunny7454",
        "time": "16 September, 2022",
        "context": "you won liberals. congratulations. all those poor illegals you have sympathy for are here. your prizes will be delivered shortly. Thanks for playing. tune in Monday for our next mystery city. coming up next THE VIEW",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "art2021",
        "time": "16 September, 2022",
        "context": "Send them at least 25000 people every year and that is less than 1% of the problem.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tlt731",
        "time": "16 September, 2022",
        "context": "Immigrants ? Send them some smash and grabbers from Chicago and let's see if the Vineyard police force does a better job than Chicago's and if their DA provides a no bail release after their new citizens ransack a few climate concious waterfront mansions.",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "smlgov364",
        "time": "16 September, 2022",
        "context": "Keep sending them. DeSantis & Abbott have a long way to go to catch up to the number that Biden has been shipping into unsuspecting cities & towns, secretly in the dead of night, ever since he took office.",
        "good": "52",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bogeyfree",
        "time": "16 September, 2022",
        "context": "I understand there's some 2 grand a night resort complexes that should be available now.  Hope the people don't mind some new guests staying there on their dime.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "LoisSmith",
        "time": "16 September, 2022",
        "context": "delaware next.    they haven’t finished bidum’s tax payer funded wall yet",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "scottj",
        "time": "16 September, 2022",
        "context": "I can’t wait till they set up homeless camps at Martha’s Vineyard, that would be priceless.",
        "good": "22",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sy105",
        "time": "16 September, 2022",
        "context": "This is hilarious. 50 illegals show up in their little liberal enclave and it's a \"humanitarian crisis\". I read that they said they can't stay here so their solution is to send them somewhere else. That's exactly what the red state governors said and did, but to the left they're evil for doing that. Hypocrisy perfectly displayed",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "staymaga",
        "time": "16 September, 2022",
        "context": "Load up the planes and buses, clean out the prisons. Let the enjoy the liberal hypocrites. This is who we are. Where’s their compassion?",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "trump42020",
        "time": "16 September, 2022",
        "context": "I believe bus rides are a better value to send more per dollar.   Keep up the good work!",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "msattler066",
        "time": "16 September, 2022",
        "context": "The liberals are all sky screaming once the issue is actually brought to their front door....",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "itzamethebigguy",
        "time": "16 September, 2022",
        "context": "When will democrats ever wake up and see the real truth?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "shanie246",
        "time": "16 September, 2022",
        "context": "What's humanitarian about destroying your own country?  It's treasonous.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "itzamethebigguy",
        "time": "16 September, 2022",
        "context": "There's a reason Biden and Obama both built large walls around their compounds.",
        "good": "35",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "VenezuelanRealOposition",
        "time": "16 September, 2022",
        "context": "20% ov Venezuelans voted,fought and marched against communists to save the country..I am sure that at least 90% of these people (Mostly Venezuelans) voted and cheered for communism..I have no SYMPATHY for them...I am going to eat my DULCE DE LECHOZA...\n\nPS: DULCE DE LECHOZA was the treat which military coups used to eat when celebrating destrying the opposition in Vzla.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "juliettepug",
        "time": "16 September, 2022",
        "context": "Will ALL Americans be able to come together and do the right things when the terrorists that have been allowed to cross illegally without vetting begin attacking on our soil? What’s the point of having TSA at airports when terrorists can WALK across the border? ",
        "good": "64",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "7sfga101",
        "time": "16 September, 2022",
        "context": "The rubber is finally meeting the road and we're realizing exactly who the racists are.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "brandonhuthut",
        "time": "16 September, 2022",
        "context": "Liberia is still there and still the answer ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "patriotmel082",
        "time": "16 September, 2022",
        "context": "where are all the dim dims on here this morning where oh where are you?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "think4yourselfsage",
        "time": "16 September, 2022",
        "context": "I'd like to get a dog, a puppy.  Many benefits for this being a good choice.  However, given other responsibilities I have during the next 12 months, I cannot support having one.  I cannot dedicate time and resources to whatever vaccinations or vet requirements are for new pups, the training, the facilities, the perpetual food and water and cleanup for at least a year.  So, I'm taking the mature decision to postpone getting a dog.  \n\nAmazing how politicians are supposed to be looking out for the immediate and long term well-being of our country, and they can't even make basic decisions correctly.  Our politicians make decisions but never factor who will be responsible to see it through, how whatever bill will be funded perpetually, contingencies if things go awry, but will be the first to take credit if it's a success.  But let's go ahead and open our borders, let whatever diseases, criminals, and drugs into our country, but hold tax paying citizens accountable to our laws.  Many of the spotlight federal politicians need a complete turnover.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "juliettepug",
        "time": "16 September, 2022",
        "context": "Will ALL Americans be able to come together and do the right things when the terrorists that have been allowed to cross illegally without vetting begin attacking on our soil? What’s the point of having TSA at airports when terrorists can WALK across the border? ",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tnengr965",
        "time": "16 September, 2022",
        "context": "Welcome to our crisis which you support.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "marko77",
        "time": "16 September, 2022",
        "context": "waaaaaaaaaaa",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "flydutch541",
        "time": "16 September, 2022",
        "context": "What are they complaining about, they have ready landscapers and domestic servents at their finger tips. They should be happy.",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Thank-GodTrumpisDone",
        "time": "16 September, 2022",
        "context": "Wow. Human trafficking to make a political point. Don’t forget to go to church and ask for forgiveness. Real Christians.",
        "good": "1",
        "bad": "11",
        "replies": []
    },
    {
        "user_name": "americancitizen1606",
        "time": "16 September, 2022",
        "context": "Send more and give them tents 🏕!",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Stentorian",
        "time": "16 September, 2022",
        "context": "Other sites to consider: Montgomery County, Fairfield County and of course The Berkshires. ",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "weekendatbrandon’s",
        "time": "16 September, 2022",
        "context": "More liberal elite whiners… even though they’ve controlled the government for nearly 20 months they are still angry",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "slowride26",
        "time": "16 September, 2022",
        "context": "FUMARTHASVINEYARD",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "marshr",
        "time": "16 September, 2022",
        "context": "Welcome to the party, pal!",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "wickywoman",
        "time": "16 September, 2022",
        "context": "Our town has been crawling with them since Joe Biden thought it would be a great idea to fly them here in the middle of the night.....I say \"suck it up buttercups.....it is your turn now",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ynnhoj",
        "time": "16 September, 2022",
        "context": "Time to change their sign to: Welcome to El Viñedo de Martha.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "alexxx888",
        "time": "16 September, 2022",
        "context": "NONE of this was happening under President Trump.",
        "good": "41",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "doublebogeyman",
        "time": "16 September, 2022",
        "context": "One of those jets that landed in Martha's Vineyard should have been loaded up with their City Government officials and the Governor and flown back to Del Rio, TX if they wanted to see what a humanitarian crisis looks like. 100 Hondurans landing in the land of milk & honey is NOT a humanitarian crisis.",
        "good": "48",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "americancitizen1606",
        "time": "16 September, 2022",
        "context": "Send Detroit residents too!",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "arloplentyhawk278",
        "time": "16 September, 2022",
        "context": "These illegals who invaded out country got a first class ticket to a amazing vacation destination,  FREE...were fed, cared for and treated 10 times better than how they were treated a week ago...so everyone should applaud desantis for his loving support and the illegals should be welcomed in Martha's Vineyard",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "gunrsan",
        "time": "16 September, 2022",
        "context": "You heard them!! Send more…many many more!",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "conraddark",
        "time": "16 September, 2022",
        "context": "50 people coming in on their private jets would be called a \"fundraiser\".",
        "good": "7",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "nutzz",
        "time": "16 September, 2022",
        "context": "Send more and start a National Fentanyl death counter so we can put numbers to the level of the crisis.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "VenezuelanRealOposition",
        "time": "16 September, 2022",
        "context": "WARNING: Most good venezuelans left early.  Some good are still there but what USA is getting now is the lowest kind of humans in the country.....",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "panzervi",
        "time": "16 September, 2022",
        "context": "DeSantis proving once again the liberals are hypocrites; all talk and no show.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "alexxx888",
        "time": "16 September, 2022",
        "context": "A few dozen illegals in Martha's Vineyards present a \"crisis\", while HUNDREDS of THOUSANDS of illegals crossing our southern border do not?!?",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "redcan651",
        "time": "16 September, 2022",
        "context": "Maybe just build a wall",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "just_asking",
        "time": "16 September, 2022",
        "context": "Funny, marthasvineyardrentals currently lists '385 accommodations found'.  Seems like plenty of room to put up 50 people.",
        "good": "50",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ou81269",
        "time": "16 September, 2022",
        "context": "Homeless camps at the Vineyard would look rather smashing. ",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Tycobb649",
        "time": "16 September, 2022",
        "context": "lol. this is funny...",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "nostromo621",
        "time": "16 September, 2022",
        "context": "Maybe Martha's Vineyard should build facilities for migrants.  They have stickers all over town telling the world how welcoming they are.  I saw a TV clip of a woman complaining about those people.  It was funnier than a SNL sketch.",
        "good": "52",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Kingkong360",
        "time": "16 September, 2022",
        "context": "Wait till they start breaking into those empty houses of tge rich and loaded.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bigshlamunga",
        "time": "16 September, 2022",
        "context": "Love this so much.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "kraziewabbit156",
        "time": "16 September, 2022",
        "context": "LOL.... 2022, the new Underground Railroad to the North, except we're using planes and buses.\n\nDemocrats are peeved because they did the same thing initially flying them into red states and now they are getting a dose of their own medicine and can't do a thing about it.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "pennyrae",
        "time": "16 September, 2022",
        "context": "Hey folks of Martha's Vineyard - getting a taste of your own medicine is rather bitter, don't you think?",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Livedestruction",
        "time": "16 September, 2022",
        "context": "they need to bus them directly to Bidens home town where we are building his property border wall under taxpayer expense.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jagmaniac",
        "time": "16 September, 2022",
        "context": "10,000 more ASAP.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "thinkmore21212",
        "time": "16 September, 2022",
        "context": "All those summer homes will make great shelters for these folks...",
        "good": "37",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "presidentpotatohead249",
        "time": "16 September, 2022",
        "context": "They are probably off the Island already, crammed in a Boston Shelter, wondering about their life's decisions.",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Landthatilove102",
        "time": "16 September, 2022",
        "context": "Keep sending those buses ",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "grazer",
        "time": "16 September, 2022",
        "context": "Save the rich people!  (They remind us that King Charles isn't the only one who wants his shoe laces ironed.)",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "farnorth64",
        "time": "16 September, 2022",
        "context": "woohoo!!!! wtg ron!!  ship them all north. i guess they will have to build a new welfare building in the vineyards",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Jayba",
        "time": "16 September, 2022",
        "context": "I bet all 50 of them would be very comfortable in Obamas oligarch mansion.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "concerned73",
        "time": "16 September, 2022",
        "context": "Democrats want these illegals and there are plenty of mansions in Martha's vineyard that can house thousands of them, start by sending two dozen to the osama's house. They can learn to smoke cigarettes from the daughters.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "californiareason",
        "time": "16 September, 2022",
        "context": "Libs talk the talk, but they prefer to private jet the walk.",
        "good": "17",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "medalist1595",
        "time": "16 September, 2022",
        "context": "Can you young people see what frauds the liberal elites are, they are the fraud’s fraud.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "californiareason",
        "time": "16 September, 2022",
        "context": "Turn Martha's Vineyard into the new Alcatraz!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "liberty47322",
        "time": "16 September, 2022",
        "context": "Crisis?  With only about 50 to 100 illegals being dropped off?  Really?  What a bunch of croc!  Send them more, let them pretend they are rich socialites coming for a long visit.  What hypocrisy!  Send all the hot vacation spots that Obama, Biden, Peloski, and all the others go to to \"relax\"  (relax from what, messing our country up big time) bus loads every week, pile them in on top of each other like they do in Texas.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "susanisaacs",
        "time": "16 September, 2022",
        "context": "5,000 more, please, DeSantis! 🚍🚍✈✈🛩🛩🛥⛴🛳",
        "good": "15",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "willowz",
        "time": "16 September, 2022",
        "context": "LOL, send more, send 1000 next time, wake those rich democrats up to realize the border problem.  Love it when republicans fight like democrats.",
        "good": "33",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Venator",
        "time": "16 September, 2022",
        "context": "DeSantis is helping Democrats in Martha’s Vineyard provide the heartfelt compassion, care and “equity” they deeply feel for the less privileged and under-represented in society. Time for the caring residents of Martha’s Vineyard to walk the talk.",
        "good": "1K",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "mommabos597",
        "time": "16 September, 2022",
        "context": "This is now humanitarian crisis… New York City open some of their finest hotels… Let’s get those air B&Bs on board shall we? I mean those right on the beach could house at least 25 people each. We would only need a couple Airbnb’s. They have plenty of housing……….. really? Obamas home alone could probably hold all of them! Where is Michelle?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "screwus",
        "time": "16 September, 2022",
        "context": "Texas has spent more than $12 million and bused around 9,000 migrants up north.  So at this rate it will cost TexAss $933 million just to clear the 700,000 that came in the last few months.  bahahahahahah",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Tycobb649",
        "time": "16 September, 2022",
        "context": "THE DOLLAR STORE COMING NEXT.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Roc'in",
        "time": "16 September, 2022",
        "context": "Three cheers for DeSantis.......",
        "good": "18",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "🐶ScoutsHonor🐶",
        "time": "16 September, 2022",
        "context": "Just wait until their dogs are killed and their stuff starts walking off.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dblac2",
        "time": "16 September, 2022",
        "context": "The left think from their backside.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "longing4reagan634",
        "time": "16 September, 2022",
        "context": "Democrats: Open borders and the chaos that comes with it for you, not us. \n\nDon't be a Democrat and bring that shame on your family.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "themark331",
        "time": "16 September, 2022",
        "context": "and every democrat on the island is thinking, \"can we hire them cheaper than the ones we have now cutting our grass, doing our laundry, cleaning our pool and taking care of the kids?\"",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jeffkelly695",
        "time": "16 September, 2022",
        "context": "Sounds like they want More!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "fblmiggers",
        "time": "16 September, 2022",
        "context": "Vote Red 🗳 ☑️",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "CerebralInferno",
        "time": "16 September, 2022",
        "context": "Keep’em coming. Rapido!",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "inthenameofmonty",
        "time": "16 September, 2022",
        "context": "Love this attitude! This is what will keep the Senate Blue in November!!!",
        "good": "0",
        "bad": "7",
        "replies": []
    },
    {
        "user_name": "censoredstuff",
        "time": "16 September, 2022",
        "context": "listen to them wine that this is human trafficking.... yet  human trafficking at the border doesn't seem to bother them ",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "californiareason",
        "time": "16 September, 2022",
        "context": "Quick!! Send many boxes of Kleenex to the crying Libs on Martha's Vineyard...",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "4god&country",
        "time": "16 September, 2022",
        "context": "Rock On, Governor DeSantis. Keep those flights flying and buses rolling!!! \nAmerica stands with Governors DeSantis and Abbott!\nGod Bless thes Governors!!\nGod Bless America!!!",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mrando",
        "time": "16 September, 2022",
        "context": "Don't worry, the are hundreds of thousands more coming !!",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "BuenosNachos",
        "time": "16 September, 2022",
        "context": "Declaring your city a sanctuary has consequences",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "justsaying88888888",
        "time": "16 September, 2022",
        "context": "So it doesn’t register to any MAGA that all you offer is high fives for sick burns? 50 humans being lied to and used as pawns and this is the happiest I’ve seen this comments section in years. Solutions? Zero. Cackling at sick burns is all you deplorables have.",
        "good": "0",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "happy2beme",
        "time": "16 September, 2022",
        "context": "Everyone needs a housekeeper and lawn boy!  I would think this would be a great opportunity for both sides of the coin!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "grumpers",
        "time": "16 September, 2022",
        "context": "FLOOD MV with them, and be sure they all get a map to Barry's house ",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "CallMeIshmael",
        "time": "16 September, 2022",
        "context": "but all those tents would be in the way of the elite bicyclists!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "WETHEPEOPLE385",
        "time": "16 September, 2022",
        "context": "Send more please...  Gov Abbott doing exciting what Texans want!   He's got my vote!!  ",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "try.common.sense.first",
        "time": "16 September, 2022",
        "context": "🤣🤣🤣🤣🤣🤣",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "clevelandstater",
        "time": "16 September, 2022",
        "context": "Cry me a river MV.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Fox1527",
        "time": "16 September, 2022",
        "context": "Like to welcome the coastal elite to the crisis. 🤣🤣 mic drop. ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "californiareason",
        "time": "16 September, 2022",
        "context": "There are over 300 Air BnB rentals on MV, and I sure 90% of the owners voted Lib? You know what to do, oh Compassionate Ones!",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "pmag13",
        "time": "16 September, 2022",
        "context": "There are I believe approximately 560 sanctuary cities in America. Every border state dealing with the chaos Biden’s action has caused should get together and send these illegals to these cities that verbally have live in their heart for these illegals, just not in their backyard. If 10,000 crossed the border illegally every day, you could bus/fly 18 illegals daily to each at a  minimum cost to those of the southern borders,  your problem would be solved. Plus with all the love these 560 cities so far away from the border and the problem have for the folks in sure they will meet them at the bus/airplane drop off point to shower then with love and immediately house, feed, and find them work within their living community. Not a biggie that those that are citizens and need help will have their monies directed to help the illegals, cities of live👍",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "footballisround",
        "time": "16 September, 2022",
        "context": "... but what happened to \"diversity is our strength\"? The residents on MV are RACIST.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bigearl408",
        "time": "16 September, 2022",
        "context": "I’ve been to Martha’s Vine — the houses are huge and spacious.  Surely those houses have spare bedrooms and couches for the newly acquired residents.  👍 ",
        "good": "520",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "gyy229",
        "time": "16 September, 2022",
        "context": "I've mentioned it during obama years - send them to dems backyards. they might start paying attention.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "HeavilySeasoned",
        "time": "16 September, 2022",
        "context": "About what one expects from the enclaves of the so-called elite.  I remember the strident opposition of Ted Kennedy to wind turbines off the shore of the Kennedy compound.  What's good for the goose isn't necessarily good for the gander ... at least in the ganders' eyes.",
        "good": "432",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "IllegitimateJoe891",
        "time": "16 September, 2022",
        "context": "Leftists have zero self awareness.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "daspad",
        "time": "16 September, 2022",
        "context": "The Liberal Doctrine:  This is the right thing to do...in your neighborhood.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "youwant",
        "time": "16 September, 2022",
        "context": "Stop sending these innocent Latinos to Martha's Vineyard, keep them in the border state where they arrived and only send the dangerous felons with all their drugs to the liberal coast. FBJ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cause&effect",
        "time": "16 September, 2022",
        "context": "MV quickly dealt with the crisis by deporting every immigrant to nearby states.  Not one of the 50 was offered a job, housing, or welcomed by the Obamas.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "CFALCONE",
        "time": "16 September, 2022",
        "context": "LETS GO BRANDON ",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "fyffebarney",
        "time": "16 September, 2022",
        "context": "Why is Biden creeping up in polls.......why is Pennsylvania senate race close......are people in chicago....nyc.....d.c. .....BLIND?  The things going on today are more than political....Nearing Demonic....",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Eirik_Finn",
        "time": "16 September, 2022",
        "context": "Hewitt is a slavering dog for Trump.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rockybo766",
        "time": "16 September, 2022",
        "context": "The elite’s crying because they got 50 new residents this is classic. ",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "StarLord882",
        "time": "16 September, 2022",
        "context": "Future president DeSantis is doing the work for the \"American\" people.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "al42929",
        "time": "16 September, 2022",
        "context": "There is a lot of money in Martha's Vineyard. They can easily afford to handle 10,000 migrants.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "doofuslibtards",
        "time": "16 September, 2022",
        "context": "How about this great idea? Secure our southern border.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Montana’sclosed",
        "time": "16 September, 2022",
        "context": "Starting to sound like the democrats need to hold a group hug.  Boo Hoo.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Whoseurdaddy564",
        "time": "16 September, 2022",
        "context": "Again there is a double standard here. It was fine and dandy when Biden was having them placed on planes and flown all over the country at night under secrecy to Red States but holy Moly you can’t do that to liberal blue states who claim “they” care about these illegals more. Really?? I say ship them all to liberal blue states and sanctuary cities. These politicians said they loved everyone and we should let them in without vetting them or vaxing them! Once these illegals see the democrats don’t care about them maybe they will smarten up and vote Republican🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸",
        "good": "18",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "RightAgain",
        "time": "16 September, 2022",
        "context": "Maybe bus in a few thousand just south of town with camping gear and let them walk in.  Make it feel authentic for the \"elite\".  Start a nice little homeless campsite in a couple of the local parks.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "EnderWiggin",
        "time": "16 September, 2022",
        "context": "Democrat Hank Johnson from Georgia is worried that too many illegals sent to Martha's Vineyard may make the island capsize. lol",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "blackvelvet",
        "time": "16 September, 2022",
        "context": "Rolling, rolling, rolling, keep those busses rolling ...",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tombguard302",
        "time": "16 September, 2022",
        "context": "I wish I could play the sound of the evil \"Zurg\" laughing at this. Oh!! I would love to have the White House folks hear that while they flail.  Next, I am sure, will be for the Governors to be called names like we've not yet heard. They will be criminalized!!  I wonder how the courts will determine who is right and wrong when they review law!!  Newsome is the criminal!  I laugh at Merrick Garland.  He is simply angry because he is not on the Supreme Court.  The republicans will win in November and it will be time to pay the piper.  heeheehee",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Goferferlife",
        "time": "16 September, 2022",
        "context": "Gee, I wonder how many 13 percenters are allowed on MV? Obama's presents excluded. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "12goats",
        "time": "16 September, 2022",
        "context": "The Vineyard welcomed them with open arms, or arms pointing anyways...\"lawn care to the left, kitchen help to the right\"",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Bi_dumb",
        "time": "16 September, 2022",
        "context": "If the left is so concerned and passionate about illegals they should be sending planes to Texas and Florida to pick these people up and drop them off in all democrat areas. Mostly the rich elite liberal areas would be the first stop.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Eaglesnest13",
        "time": "16 September, 2022",
        "context": "I am sure at Martha’s Vineyard they already have illegals working for them what’s a few more in the garden mowing lawns washing windows raking leaves they should be used to slavery!",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Tycobb649",
        "time": "16 September, 2022",
        "context": "OOPS, I MEAN the 5dollar store... inflation you know...",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "gasman",
        "time": "16 September, 2022",
        "context": "The whining by these sanctuary liberal cities and now the mostly white Martha's Vineyard, is indicative of lefty Democrats. They loudly publicly announce their stances on so called humanitarian issues that put them above the other party, but when it comes down to living their holier than though declarations, the Dems complain and fold like a cheap suit. This is why no one should believe what Dems say especially when they cannot live it themselves. It applies to immigration, climate change, taxes, crime, education, or any other issue.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "concerned_conservative668",
        "time": "16 September, 2022",
        "context": "When illegals outnumber American citizens in Martha's Vineyard ten-to-one, they'll start to get the picture.  The more the merrier!",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Doesitmatter888",
        "time": "16 September, 2022",
        "context": "Wait?!!! What!!! \nI thought the border was secure?!!",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "goldsurfer2",
        "time": "16 September, 2022",
        "context": "Load up some cruise ships and drop them off at Barry and Big Mikes.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "NotVisible",
        "time": "16 September, 2022",
        "context": "Look what I did!  I voted for Biden!",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "mikeinbrig1",
        "time": "16 September, 2022",
        "context": "Send them to the Hamptons lots of empty houses the in the winter",
        "good": "13",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Really???????365",
        "time": "16 September, 2022",
        "context": "I wonder if they put out a “For Immediate Release” statement when tourist season starts with thousands of people coming to the island. Odd how they can accommodate them.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "omgit's1984",
        "time": "16 September, 2022",
        "context": "I said it before and I will say it again to Governors DeSantis and Abbott. Bravo!!",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "pennsyl-tucky",
        "time": "16 September, 2022",
        "context": "typical lib elite response \"allow these people into the country, give them everything they want, but not in my backyard \"",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mikeinbrig1",
        "time": "16 September, 2022",
        "context": "Hope they have winter clothes",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "speakeroftruth",
        "time": "16 September, 2022",
        "context": "Keep up the good work Red states.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "harris1260",
        "time": "16 September, 2022",
        "context": "Keep sending 'em.  This is getting fun.",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Goferferlife",
        "time": "16 September, 2022",
        "context": "And, how is it possible, according to the liberal global climate change crisis, that MV is still above water?",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bigred42",
        "time": "16 September, 2022",
        "context": "So sad to bad deal with it just as other parts of the country have done when your Democratic President has done to other places in our country. Do not cry stop illegals from entering our country",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "usmctherooster",
        "time": "16 September, 2022",
        "context": "No need to worry, they will just find the picnic tables and blast Mexican music all the while pulling out coolers of expensive meat that you paid for. Meanwhile you and your family eat hot dogs on a budget. Que pasón señor!",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tompettysfamilyislame",
        "time": "16 September, 2022",
        "context": "From Mexico to Martha's Vineyard and all on our taxdollars. Migrants these days have it (far) better than middle class Americans...",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "stillfree",
        "time": "16 September, 2022",
        "context": "How come Martha’s Vineyard (a place known for its wealth) is having a humanitarian crisis over this? More rules for the but not for me mentality. Elitist make me sick with their double standards and hypocrisy.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "fallfasterfool",
        "time": "16 September, 2022",
        "context": "Hey Abbott and De Santis. \nDONT FORGET\n SOUTHHAMPTON LONG ISLAND.\nlots of room in winter and they even have an airport.",
        "good": "35",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Moose512",
        "time": "16 September, 2022",
        "context": "Keep sending them by the truckload. ",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mongo2",
        "time": "16 September, 2022",
        "context": "It’s there Sanctuary compound.  I’ve been her 70 years and they don’t want me there either.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "themark331",
        "time": "16 September, 2022",
        "context": "Nothing changes until the NAACP figures out the democrat party is favoring hispanics over Africans",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jackatdallas",
        "time": "16 September, 2022",
        "context": "Humantarian crisis at Martha's Vineyard .. what a joke!!!!  True humantarian crisis is at the southern border and border towns, who take them in and figure out how to deal with Biden's failed policy on our borders.",
        "good": "13",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "choppock44",
        "time": "16 September, 2022",
        "context": "Keep sending them to Martha's !  Let's let them see what being run over by immigration problem really is.  ",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "themark331",
        "time": "16 September, 2022",
        "context": "Meanwhile not one of the new illegals will kill anyone tonight with a stolen gun, but at least 200 young black men will be killed tonight by other young black men and not one democrat will say a word about it, unless a cop or Caucasian is involved.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "KAG928",
        "time": "16 September, 2022",
        "context": "Two more plane loads will break the Vineyard - grab some popcorn.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "arloplentyhawk278",
        "time": "16 September, 2022",
        "context": "The next batch of  illegals should be given a tent,  and a map to OBAMAS 30 plus acres and told to pitch the tent and start a tent city, all free and hold their hands out for obama care...just like the rest of us who had that shoved down our throat when the anointed one was in office",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "charles63039",
        "time": "16 September, 2022",
        "context": "Hey DeSantis. Chicago could use a few thousand in a day too.",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "CharmingBeggar",
        "time": "16 September, 2022",
        "context": "Keep sending these illegals further north..  They were so brave as to put their lives in a trash bag and jump the fence, now lets see how they fair in a new england winter.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "robertsnyder124",
        "time": "16 September, 2022",
        "context": "People come here looking for a better life free from political persecution and games, only to find out the same mentality of politicians that have destroyed their countries are doing the same thing here. Just put a sign at the border that once they cross over there will be no work, the cost of living will be 500 times higher than where they just came from, and the American dream is dead.",
        "good": "31",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "laladelrio",
        "time": "16 September, 2022",
        "context": "I have to admit this is the best strategy by Abbott and Desantis. Brilliant is working!",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "don'taskme",
        "time": "16 September, 2022",
        "context": "I say send them even more! Instead of just a hundred, send them 1000!",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "w.r.dooomed",
        "time": "16 September, 2022",
        "context": "If there was another 911 type terror attack and another 1000 lives were lost, I'd betcha no one would say \" There were x amount of deplorables and x amount of lefties killed\".......it would be \"x amount of \"AMERICANS\" who lost their lives.......See how far off track we have become?  ",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "maelific71771",
        "time": "16 September, 2022",
        "context": "Just wait until they start grabbing women out for a morning jog like they do here in NJ.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Geochem",
        "time": "16 September, 2022",
        "context": "What ever happened to the thousands of children forcibly separated from their parents as a punishment for daring to seek help under Trump?  Please no speculations in your answers.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Just-The-Facts550",
        "time": "16 September, 2022",
        "context": "Too bad. So sad.  \nEver heard of white flight?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mrbreezeinaz",
        "time": "16 September, 2022",
        "context": "arrest the Biden crime family",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Montana’sclosed",
        "time": "16 September, 2022",
        "context": "Don’t Big Mike and Barry live there?  They are Surprisingly quiet.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "freedom62",
        "time": "16 September, 2022",
        "context": "Arent the leftys all about equity and inclusion! Well include them in your playground and treat them equal.if its good for all of us its good for marthas vinyard!",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "briand66995",
        "time": "16 September, 2022",
        "context": "Its becomes a Crisis ONLY when democrats are FORCED to deal with it",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "quietbystander",
        "time": "16 September, 2022",
        "context": "At least now they are noticing.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Thatswhatsheuttered",
        "time": "16 September, 2022",
        "context": "Pawns are a legitimate move in chess.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "pasta33",
        "time": "16 September, 2022",
        "context": "Keep sending them there.\nAlso think of the Hamptons and Beverly Hills.\nEven Kamala’s backyard is a nice dwelling area.",
        "good": "54",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "fedupwiththenews",
        "time": "16 September, 2022",
        "context": "Texas - send them ALL out of your state!",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "never_again681",
        "time": "16 September, 2022",
        "context": "Clearly there is plenty of space/land available there and public housing should be built to take on more illegals.  A perfect location for them to service the NIMBY's.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "axolotl147",
        "time": "16 September, 2022",
        "context": "Send 100,000 unvaccinated illegals to MV and another 100K to Rehoboth Beach.",
        "good": "20",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "laraza4u",
        "time": "16 September, 2022",
        "context": "empty out the southern state prisons of all violent felons and send them to martha's vinyard... keep them handcuffed, shackled, but send them, and let the mv elites deal with that humanitarian crisis...\n\n50 illegals is a humanitarian crisis?  lol... next the elites will be calling it an 'insurrection'...",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "karenjost",
        "time": "16 September, 2022",
        "context": "50 migrants.  Just enough to fill their open jobs for maids and gardeners.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "americanmadein64",
        "time": "16 September, 2022",
        "context": "cant the billionaires take care of them??????  why do we tax payers have to flip the bill????   should be tons of money in marthas ???????/",
        "good": "14",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "PeaceLibertyDignity",
        "time": "16 September, 2022",
        "context": "Step up liberals. You created the open border and sanctuary cities and counties. You promised to help these people. Own it and quit whining.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "PallMall",
        "time": "16 September, 2022",
        "context": "Invite the élite to the border for a week and join the border patrol on changing diapers on Unvax children, interview  Unvax men with ties to M-13 gangs, help the woman give birth, as well as pulling bodies out of the Rio Grand river and off the existing wall.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cause&effect",
        "time": "16 September, 2022",
        "context": "The Obamas took a page from Lori LIghtfoot and asked for federal help to build a wall around their compound and their town.",
        "good": "14",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "gbs3597",
        "time": "16 September, 2022",
        "context": "I have never, until now!!, given an ounce of credence to the ‘white supremacy theory’. But the elitist that occupy MV have opened my eyes!",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Tafo1",
        "time": "16 September, 2022",
        "context": "SEND THOUSANDS ASAP TO PHILLY 👍🏿🏳️‍🌈😷🌮",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "kterceira",
        "time": "16 September, 2022",
        "context": "I have a bunch more suggestions for bus rides if DeSantis or Abbott want the info. You can start with Newport Rhode Island.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Prgmr",
        "time": "16 September, 2022",
        "context": "Send em more!",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "guapo419",
        "time": "16 September, 2022",
        "context": "If any of these liberals would have ripped Biden for flying immigrants around the country then maybe they would have some creedance.......but they did not.   Therefore your current complaints are falling on deaf ears.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "gunny7454",
        "time": "16 September, 2022",
        "context": "can i get 2 aliens? the ranch down the road owns a donkey. i have a money-making idea",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "flydoc100ret",
        "time": "16 September, 2022",
        "context": "Just sharing with our good neighbors.  Enjoy.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "PincheGringo",
        "time": "16 September, 2022",
        "context": "Now it's time to double down so not to give the appearance of backing down.  Send 1500 up there this weekend.",
        "good": "18",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "starstreams",
        "time": "16 September, 2022",
        "context": "Donate to hire more busses.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "hairylegsjoe759",
        "time": "16 September, 2022",
        "context": "Don't forget Delaware!!!!! Specifically,  1209 Barley Mill Rd, Greenville.  Bidens home.",
        "good": "38",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Pphogg",
        "time": "16 September, 2022",
        "context": "\"Humanitarian crisis\" Right up there with a shortage of chardonnay eh lefties?",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rich1261",
        "time": "16 September, 2022",
        "context": "Keep up the good work Governor Desantis!",
        "good": "13",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "SpeedRacer1962",
        "time": "16 September, 2022",
        "context": "I would hate to see what it would be like if the border was open and not secure...",
        "good": "17",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "kurtpgh",
        "time": "16 September, 2022",
        "context": "Keep sending them, more and more.  To every elite liberal enclave you can think of.  Force the phony compassionate liberals to show their true colors.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "lbpinflorida",
        "time": "16 September, 2022",
        "context": "Chuck Todd's comment about no infrastructure in Martha's Vineyard. is correct but he forgets the infrastructure cages Obama and Biden built when they held office together. Move the cages to the Vineyard??",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "fedupwiththenews",
        "time": "16 September, 2022",
        "context": "I hear that Portland feels left out. Can you send a few thousand to Portland?",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "TrumpWasRight2024017",
        "time": "16 September, 2022",
        "context": "Keep sending them in masses by boat by plane - send as many as you can before they block flights.  Make sure they are the same the border states gets on a daily basis. The unvetted, sick/ diseased, ready to give birth, smuggling Fentanyl, criminals, thieves, etc.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "proudultramaga!!!",
        "time": "16 September, 2022",
        "context": "America is gone folks! Carry every where you go and watch your back!",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "themark331",
        "time": "16 September, 2022",
        "context": "Let's all give thanks Africa is not on our southern border, see there is silver lining!!",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "axolotl147",
        "time": "16 September, 2022",
        "context": "With all of these illegals coming to MV, MV will have the finest lawns and cleanest toilets.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Tafo1",
        "time": "16 September, 2022",
        "context": "I like the greeters in NYC who are told to hand out tooth brushes with a smile.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Ufilthyliberal",
        "time": "16 September, 2022",
        "context": "50? Only 50? He'll I chased more than that off my property just this morning.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tnron",
        "time": "16 September, 2022",
        "context": "This is delicious! ",
        "good": "34",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "themark331",
        "time": "16 September, 2022",
        "context": "I guess Joe is keeping all the women and children in the cages Obama built, because none are getting off buses or planes anywhere, nothing but young men.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "nene690",
        "time": "16 September, 2022",
        "context": "Obama have a big house so he should donate as shelter to be more humane! ",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "matthewstephen",
        "time": "16 September, 2022",
        "context": "open borders means open borders, including state open borders",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "kurtpgh",
        "time": "16 September, 2022",
        "context": "Since diversity is strength, Martha's Vineyard just got a lot stronger.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rdsouza",
        "time": "16 September, 2022",
        "context": "Mitch. Rona, Cornyn, Lindsey, Susan, ... , should be on their soapboxes praising the GOP GOVs. Instead we get crickets. Oh yes. bipartisanship from these RINOs.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Chgofire",
        "time": "16 September, 2022",
        "context": "I’m retired! I’ll volunteer to drive one of the buses there! ",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ivandupont",
        "time": "16 September, 2022",
        "context": "Pile all of them into NY ,Masechusets and Chicago and DC with Deleware on the top of the list !",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "themark331",
        "time": "16 September, 2022",
        "context": "If you really want to do some harm to Martha's Vineyard just send inner city democrats for a weekend",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "flglavin",
        "time": "16 September, 2022",
        "context": "The REAL crisis is at our southern border, and everybody knows it.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bilf",
        "time": "16 September, 2022",
        "context": "But, what about the REAL ISSUE...AMTRAK Brandon just acted to call for a strike of train workers, which he could pretend to solve. Shame on Republicans for changing the subject back to something other than Democrat destruction  of the economy.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "PrincessFiona",
        "time": "16 September, 2022",
        "context": "DeSanti Rocks! The residents on MV are freaking out. Apparently Chuck Baker has been told to remove them. Love it.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "allinclusive",
        "time": "16 September, 2022",
        "context": "The people who live and work on MV aren't coastal elites. They're in a great part of the country to be sure, but if you're targeting the millionaires who live there in the summer, they've now moved back to West Palm and other elite Florida cities. Just follow their yachts...",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "stone1776",
        "time": "16 September, 2022",
        "context": "Dear God thank you for sending us two Republicans with guts to stand up to the democRATS. This is why I voted for Trump ,don’t like a lot of trumps personality attributes but dear God he will fight for us.",
        "good": "75",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "redwingz",
        "time": "16 September, 2022",
        "context": "Amazing how fast the libbies bail when the  crisis comes to their doorstep. It's ironic the vhurches are the ones who rise and provide aid.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "LeskoBrandon🤡",
        "time": "16 September, 2022",
        "context": "So let me see if I got this correct. Two million people coming across the border in Texas is not a crisis but fifty people flown to Martha’s Vineyard is a crisis. I truly believe being a democrat is a mental disease. ",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "kterceira",
        "time": "16 September, 2022",
        "context": "50 freaks them out when border towns get millions. Triggered",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "nodees",
        "time": "16 September, 2022",
        "context": "Cloward and Piven would be so proud right now.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tiredofuseless100%",
        "time": "16 September, 2022",
        "context": "MV let’s make a deal, we in TX will deal with those 50 illegals causing a humanitarian crisis to y’all - hel let’s triple it to 150 and all you need to do in return is take the 500,000 illegals that we are having a difficult time providing IMMEDIATE food & shelter for; y’all so WORRIED ABOUT HUMANITARIAN - ..",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "buschwacker233",
        "time": "16 September, 2022",
        "context": "Send more.....I bet Massachusetts secures its border.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "themagicwand329",
        "time": "16 September, 2022",
        "context": "C’mon Man, Don’t regift Jill’s Tacos. Stop giving them away.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "imaosudad",
        "time": "16 September, 2022",
        "context": "Delaware needs lots more.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "fedupwiththenews",
        "time": "16 September, 2022",
        "context": "Watch them all mask up again. LOL",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "TheMegoSpider-Man",
        "time": "16 September, 2022",
        "context": "If DeSantis keeps doing these things he will beat Trump in the GOP primaries. Trump needs to DO SOMETHING TO STOP DESANTIS!",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "nchomeboy",
        "time": "16 September, 2022",
        "context": "These elite in Martha's Vineyard are in crisis mode because the don't know what to do with these illegals if they can't put them to work cleaning homes, cooking, caring for their children, doing maintenance or yard work.  They're like \"Eeewww\" you mean we have to take care of them?",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "repblicoftexas",
        "time": "16 September, 2022",
        "context": "Aspen Colorado is always looking for service people.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "timr270",
        "time": "16 September, 2022",
        "context": "Keep those buses rolling. Let me know where I can donate to these bus trips to “sanctuary cities”!",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ByeJoe2021",
        "time": "16 September, 2022",
        "context": "Rich white Martha’s Vinyard elite prefers foreigners not be near their mansions.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Alotta.Anger",
        "time": "16 September, 2022",
        "context": "I wonder how many illegals can be loaded into Martha's vineyard.  I'd offer to send at least 12 out of my own pocket.  Charter ALL the outbound flights so there are ZERO seats for the islanders to export the deposited ones for at least 2 months and keep sending IN the ILLEGALS.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "maryc899",
        "time": "16 September, 2022",
        "context": "Need any help driving the buses",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dc1999",
        "time": "16 September, 2022",
        "context": "Small border states are seeing 5,000+ per day.  Lefties want socialism so they need to share in the support",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "getouththeroad62",
        "time": "16 September, 2022",
        "context": "2 million illegals pour over the border in a year and they are whining about 50 dropped off in the STINKING WEALTHY Neighborhood???",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "txbart",
        "time": "16 September, 2022",
        "context": "The pampered and entitled elitists on Martha's Vineyard get upset when those brown, Taco people are allowed to be on their island. Virtue signaling is what they do. The thought of doing anything more gives them the vapors. The entire Northeast is that way.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "micky888",
        "time": "16 September, 2022",
        "context": "This is the greatest.  Republicans finally grew a pair.  Keep them coming, liberal hypocrisy for the world to see.  Lol.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "therowdyref",
        "time": "16 September, 2022",
        "context": "Compare and contrast: (1) the uproar caused by two Governors sending the \"uninvited guests\" to jurisdictions that are on the record as being \"Sanctuary\" for said guests; versus (2) the uproar caused when the Federal Government's privately chartered planes were shipping the earlier guests into jurisdictions that had made no such \"Sanctuary\" claim....",
        "good": "684",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "blkchwill",
        "time": "16 September, 2022",
        "context": "Hey Obama's, your new help is on the way!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rightside101",
        "time": "16 September, 2022",
        "context": "Time to drop them in front of the homes of every outraged liberal starting with the Lincoln Project.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "lynskyrd",
        "time": "16 September, 2022",
        "context": "yup-  as soon as the Liberals are actually forced to 'walk the walk'... it's all different.  it's a 'crisis'.  FIFTY people... not 50,000, not 5000, not 500 ---- FIFTY ????\n\nMy wife and I have had more people over for the holidays... and if you met my side of the family-  talk about Crisis. They fight over stuff that happened 30 years ago. ???\n\n\nAnd of course-  instead of identifying the real root of the problem- they cast blame on you know, the people that actually want to protect the country's borders.  The people that want to end human trafficking, drug smuggling, rampant crime and the over burdening of our social services that were NOT meant to hand out driver's licenses and cell phones to people from Mexico, Venezuela, etc.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "whateverfor",
        "time": "16 September, 2022",
        "context": "They don't even know what a crisis is. Take a trip to the southern border and see one first hands.  Clueless democrats. ",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "fedup65",
        "time": "16 September, 2022",
        "context": "Create a \"pipeline\" directly to \"sancuary\" cities... remember the old Toyota commercials..\"you asked for it, you got it\"",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "1bigone",
        "time": "16 September, 2022",
        "context": "It's OK for a Venezuelan to take a dump on your front yard, but it's not OK on their yards.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "AVillageIsMissingTheirLiberal",
        "time": "16 September, 2022",
        "context": "Secure the borders, this all goes away.\n\nProblem solved.  If only Chairman Xiden was coherent enough to understand this very simple concept.",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "queenv",
        "time": "16 September, 2022",
        "context": "As we all know... it's only a crisis when it affects them directly. Now put your promises to these people to work and quit crying. GRRRRR",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "themark331",
        "time": "16 September, 2022",
        "context": "it was the right thing to do and a humanitarian crisis, when they were breaking into country and staying in border states, now it is a federal emergency in DC, New York Chicago etc, they are screaming for federal dollars to meet their sanctuary city requirements",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "WildinFlorida",
        "time": "16 September, 2022",
        "context": "😆😅😂🤣",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "scroogeias",
        "time": "16 September, 2022",
        "context": "Need to send 1000 full buses at one time.    Let them really feel the pain at the southern border.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cliff55",
        "time": "16 September, 2022",
        "context": "Keep on bussing! I’m sure kennebunkport, Beverly Hills and the hamptons would welcome the illegals! ",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Bsshaw",
        "time": "16 September, 2022",
        "context": "Looked up ‘hypocrisy’ in the dictionary. It said “See Martha’s Vinyard”.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "DebraArab",
        "time": "16 September, 2022",
        "context": "I think Greg Price and Derek Hunter have it absolutely right. The governors of the border states need to continue sending the illegals to every sanctuary city. I'm waiting for them to send some to Nancy Pelosi in San Francisco and Governor Newsom in Sacramento, California. Maybe the illegals know that California is broke and don't want to go there.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "AVillageIsMissingTheirLiberal",
        "time": "16 September, 2022",
        "context": "If a few hundred to a Democrat city is a humanitarian crisis, then a few million is a holocaust to Texas, Arizona and Florida.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "msattler066",
        "time": "16 September, 2022",
        "context": "'Illegals in our front yards, oh, the humanity!!!'",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rightside101",
        "time": "16 September, 2022",
        "context": "Biden sent 70 plane loads to Florida without notifying the Governor or local officials a d dumped them at their feet.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "maryc899",
        "time": "16 September, 2022",
        "context": "Poor rich elite have to help the poor",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "1bigone",
        "time": "16 September, 2022",
        "context": "This wouldn't even be a problem if Joe enforced the law and didn't let these people in to begin with.  What is it about the word \"illegal\" that he doesn't understand?  Heck, the leftists won't even use the word.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "stltbr",
        "time": "16 September, 2022",
        "context": "\"What crisis?\" they said when those illegals were in Texas and Florida, now 50 people are a crisis in MV? It's pretty easy to call yourself a sanctuary city when it is near impossible for illegals to get there without help inside the USA... Send them more so Biden stop talking politics and secures the border.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "randysloan",
        "time": "16 September, 2022",
        "context": "martha's vineyerd is a working ranch how typical of republican's to send migrant's theyre",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "JAG763",
        "time": "16 September, 2022",
        "context": "17K year round population-swells to 250K in August. If 50 people in September overwhelm the Island what do 233,000 do in August?",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "silverfox78",
        "time": "16 September, 2022",
        "context": "listen Obama has 30 acres of  land enough to set up a nice tent city !!!!",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "gladius",
        "time": "16 September, 2022",
        "context": "Indeed. They want to be a \"sanctuary state\" for illegals?? Send them all.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ptortland688",
        "time": "16 September, 2022",
        "context": "\"All Are Welcome Here.\"  Hmmm . . . With what part of \"All\" do the residents of Martha's Vineyard have a problem?  \nPerhaps they could house the whoppingly overwhelming number of 50 illegals in Obama's $12 million, 7000 square foot, 7 bedroom/8 bath oceanfront Martha's Vineyard summer home.  I'm sure it's empty this time of year.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ralphzero",
        "time": "16 September, 2022",
        "context": "Hillary hires a bunch to create fake dossiers from South America.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "8mmmagnum",
        "time": "16 September, 2022",
        "context": "Keep sending the trash to the lib dumps.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "midtermjunkie",
        "time": "16 September, 2022",
        "context": "Liberals, socialists, communists and democrats wallow in hatred all while touting to be the beacon of acceptance and equality. They trample on the rights of the messengers of common sense and welcome chaos as if it's the charitable thing to do. Then they distance themselves from the very chaos they create and blame their enemies for creating it.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "davidpotter33",
        "time": "16 September, 2022",
        "context": "Keep sending them.  Send them to Delaware also.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "contractsnomore",
        "time": "16 September, 2022",
        "context": "So 50 illegals is a \"crisis\" for them??  That's laughable.  What happened to that sanctuary state status?  Keep sending them by the busloads until they understand the problem is also their problem!  This \"crisis\" is INTENTIONAL by the Brandon administration and it needs to stop.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rightside101",
        "time": "16 September, 2022",
        "context": "You. VOTED TO BECOME A SANCTUARY STATE AND OR CITY. Now you can put your money where your mouth is.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "woodster100",
        "time": "16 September, 2022",
        "context": "Bud them all to the desert 🌵 ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "pattlee",
        "time": "16 September, 2022",
        "context": "Obama and Clinton are only post presidents who got hundred millions $$$$ rich right away.  Drop them at Obama farm to show how Democrats do not like latino",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "SnedleyArmseller",
        "time": "16 September, 2022",
        "context": "I don't own a summer house on the cape, but if I did I'd let one or two of them stay there. Especially if they could clean and cook!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "wy66",
        "time": "16 September, 2022",
        "context": "The liberal media is all over this story.  They don't realize that Americans are now seeing the Democrats for the hypocritical whiners that they are.  The red wave is building...",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "oopsthereitis",
        "time": "16 September, 2022",
        "context": "One of the richest cities in the country, 98% white, 0 unemployment, 100% Democrat and they cant handle 50 migrents...and they are a sanctuary city. DO YOU PEOPLE NOW SEE WHAT THE DEMOCRATIC PARTY REALLY IS????? Do you?? The Democratic party doesnt care about immigrants, they dont care about Americans....all they care about is being rich, white and liberal so they can feel good about themselves AS YOU SUFFER.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Opus1161",
        "time": "16 September, 2022",
        "context": "Next, Rehobeth Beach, DE.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sinistra",
        "time": "16 September, 2022",
        "context": "Are the perverts peeking in the window and watching Obama and his husband's antics in their bedroom?\nHow horrible!\n🤣🤣🤣",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mkav",
        "time": "16 September, 2022",
        "context": "The border crisis is real and it's sad, frustrating and dangerous that it's getting worse.\nBorder states need help in managing the problem until if/when the federal government can actually develop a real border policy that protects the borders but also recognizes that the immigrants coming here are very similar to the original European immigrants: simply looking for a safer, better life. I don't pretend to have a viable solution.\nI agree saying 50 immigrants is a crisis is a bit hyperbolic.\nHaving said that: DeSantis and Abbott are spending a lot of money for a political stunt that is really not going to accomplish anything but further divide the country. Coincidentally, Abbott is up for reelection this year and his \"base\" loves this.",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "themark331",
        "time": "16 September, 2022",
        "context": "Flood Vermont, New Hampshire, Connecticut, Massachusetts etc... I dont think they even have let the Africans in yet, except Boston they are going down hill fast already.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bethc513",
        "time": "16 September, 2022",
        "context": "50 people! With a snap of a finger, these people hire an Event Coordinator to plan & give a 5 yro a Birthday Pony Party with more people than this! Thank you governors for being the “Powers of Truth”! ",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "kterceira",
        "time": "16 September, 2022",
        "context": "Be fair DeSantis, make sure you send a few buses to the quaint little Democrat strongholds on the Cape like Barnstable and Hyannis where the wealthy commute each summer. Chatham and Yarmouth. Oh, Oh and Nantucket!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ElleOop",
        "time": "16 September, 2022",
        "context": "I’m sure the Obamas and the others who have their second or third or forth homes on the Island, will be glad to host them until affordable housing can be built on the Vineyard for them. ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "anglothaibabe",
        "time": "16 September, 2022",
        "context": "Sharing is Caring......",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cjpatriot",
        "time": "16 September, 2022",
        "context": "Obama invited more than that to his super spreader party!",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rightside101",
        "time": "16 September, 2022",
        "context": "Put up tents on Obama’s lawn.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ssbn738g",
        "time": "16 September, 2022",
        "context": "Obama has a 10 bedroom mansion.  He has plenty of room to take them some in and show how altruistic he is.\n\nOh wait...it's all just virtue signaling.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Gamac863",
        "time": "16 September, 2022",
        "context": "How does Martha’s Vineyard have a humanitarian crisis and the border towns don’t?",
        "good": "33",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "thundervalleys",
        "time": "16 September, 2022",
        "context": "Raise your hand if you just want to say \" I love it - don't stop \" !",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "clownyfish",
        "time": "16 September, 2022",
        "context": "It's hard to understand how it's inhumane to be sent to the richest liberal area on the planet.... Island of a 1000 Yachts....\n\nYet they can't cough up some cash for poor brown skinned people... They can't diversify the 90% of White money going on there it seems...",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "row3na",
        "time": "16 September, 2022",
        "context": "They should be welcoming them as a new source of them employees because I imagine most of those people live on Martha's Vineyard have undocumented help working as gardeners, etc.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "manualjames",
        "time": "16 September, 2022",
        "context": "I'm sure all those Mega Rich Leftist Woke Democrats living in Martha Vineyard can afford to support 50 illegals, but they are Democrats, they Talk the Talk but never do the Walk. LOL.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "paychecktoday",
        "time": "16 September, 2022",
        "context": "Democrat \"logic,\" hypocrisy and incompetence: Border town, Eagle Pass, TX. Population 30,000. Should easily be able to handle 10s of thousands of foreigners. It's not a crisis. Sanctuary city DC. Population 702,000. Are overwhelmed and need National Guard support for 100s of foreigners. It's a crisis.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "justinthyme1786",
        "time": "16 September, 2022",
        "context": "It's working. Send more planes.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "whaaaaaaaaat",
        "time": "16 September, 2022",
        "context": "Oh my oh my what am I going to do with these people I invited over for you to take care of",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "themark331",
        "time": "16 September, 2022",
        "context": "When do the democrats start selling them again like they did the blacks",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "1bobross1",
        "time": "16 September, 2022",
        "context": "Bad news you don’t get a choice in the matter nobody cares what you think migrants are coming",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "buf2fla",
        "time": "16 September, 2022",
        "context": "They cant stand all 50 of those brown people being there at once and not serving as lawn cutters, maids or laundry personnel.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "OrangeMan2024002",
        "time": "16 September, 2022",
        "context": "I just wish that the southern states started the bussing program in the first few months of Brandon's open border policy. At least the fake news channels would have picked up the story. \nThey might have rethought the open door policy by now.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "texas_bluebonnet",
        "time": "16 September, 2022",
        "context": "There is no way the democrats are ever going to win this argument. And this is going to backfire on them. The people coming here aren't doing so to become a subjugated class of the democrat party.  They will not be voting for democrats.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "stanky888",
        "time": "16 September, 2022",
        "context": "Martha’s Vineyard humanitarian crisis but Antifa-BLM riots are not. Very interesting…",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mc48",
        "time": "16 September, 2022",
        "context": "It would seem fair that the Vineyard should have their fair share. For an island that size, 500 more would be appropriate. MV is a play land for  the super wealthy democrats, who are not as liberal as they say they are. Time to anti up",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sendit080",
        "time": "16 September, 2022",
        "context": "The upside is the shortage of good gardeners is over",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ralphzero",
        "time": "16 September, 2022",
        "context": "Is anyone sending migrants to Beverly Hills?",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "usetablib",
        "time": "16 September, 2022",
        "context": "Obama has 6900 sq. ft. mansion.  Certainly he can take in a few of these valued assets to the community.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "brvids558",
        "time": "16 September, 2022",
        "context": "I hope they send thousands and change the name to Martha’s viñedo. ",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "msattler066",
        "time": "16 September, 2022",
        "context": "You can say whatever you want to about liberals, but never stick their noses in the reality of the situation.  Then they get rather vocal.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "prussell1970",
        "time": "16 September, 2022",
        "context": "Gotta send at least enough that a shanty town will be required. I've said for a long time that the problem wouldn't be noticed until it showed up on THEIR doorstep. Well, there ya go Biden regime! MORE busses and planes please!",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bugs77",
        "time": "16 September, 2022",
        "context": "Regarding Martha Vineyard politics, the word you're looking for is hypocrites. They were fully in favor of an open border and accepting illegals. They saw no crisis. They declared themselves a sanctuary for illegals. Suddenly it becomes a crisis when they get illegals. Again, hypocrisy is the word you're looking for.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "msattler066",
        "time": "16 September, 2022",
        "context": "I think the 'Let them eat cake' argument has about run out for the poor liberals.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "fuki",
        "time": "16 September, 2022",
        "context": "Keep flying them into phony liberal locales.  The hypocrisy is unbelievable.  Just proves that liberals only like to be liberal with other people's money.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "texas_bluebonnet",
        "time": "16 September, 2022",
        "context": "Also, this administration is now meeting to consider possible litigation actions against Texas, Florida, and probably Arizona. I say bring it on. The only thing he can do to us after that is declare war. He has done everything else to try and destroy us.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mybuzzcomments",
        "time": "16 September, 2022",
        "context": "Send all you can to the Vineyard. Let them feel the pain of a border town.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ssbn738g",
        "time": "16 September, 2022",
        "context": "Just wait until the roadside taco stands begin to pop up.  The locals are really going to enjoy that.\n\nBTW, nothing against those stands.  I've gotten some great tasting meals from them, but I don't think the snobs on Martha's  Vineyard are going to be down with that.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bbboop",
        "time": "16 September, 2022",
        "context": "Democrats never let a good story go to waste even an exaggerated one. If Massachusetts thinks 50 is a humanitarian crisis, they should take a closer look at the border states. This is hypocrisy at its finest!",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "honk🇺🇸honk",
        "time": "16 September, 2022",
        "context": "It's a very nice place. Send them 100,000 more.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "MiaSanMia1900",
        "time": "16 September, 2022",
        "context": "White Liberals are sooo out of touch.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "zombasboy",
        "time": "16 September, 2022",
        "context": "Martha's  Vineyard wants to preserve their privileged status while the rest of the country has to be inclusive.....Amazing.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ralphzero",
        "time": "16 September, 2022",
        "context": "What do these migrants expect when they get here?  What do they think is going to happen?  Are they being interviewed?",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rightside101",
        "time": "16 September, 2022",
        "context": "You voted to be a sanctuary town? Wait for it.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rightside101",
        "time": "16 September, 2022",
        "context": "Too much diversity in a town over 90% white.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "aberj3",
        "time": "16 September, 2022",
        "context": "Of course they will.  The cruelty and using immigrants as political pawns is the point.  Nobody complains about abusing immigrants.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "justincase66",
        "time": "16 September, 2022",
        "context": "Florida has a great rail system, load up the \"Brightline\" and let er rip.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Grimsby63",
        "time": "16 September, 2022",
        "context": "Texas used to talk about seceding  right? Well, if they do, the \"boarder\" will move north and the United State of Texas can now SHUT DOWN THE SOUTHERN BOARDER on their own.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mbutch609",
        "time": "16 September, 2022",
        "context": "Who could ask for a better place to settle than Martha's Vineyard? Talk about Safe. This is the America they came for.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bobinswva",
        "time": "16 September, 2022",
        "context": "If you want to read something funny abut this visit the Babylon Bee . . . \"Hello, is this 911? Yes, there are brown-looking Latinx people outside my 20,000-square-foot seaside home, and they aren't even carrying leaf blowers,\" said a terrified Mavis McWhite to the dispatcher. \"They aren't even holding so much as a rake. They're up to no good. I'm scared! Please send help!\"",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "westfork",
        "time": "16 September, 2022",
        "context": "Keep sending them.  Overwhelm the place.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Goodluck289",
        "time": "16 September, 2022",
        "context": "Somebody really had their head way up whhere,,,,,, to call for immediate release updates on 50 immigrants ",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "kterceira",
        "time": "16 September, 2022",
        "context": "Always wondered why NYC never offered to reopen Ellis Island if they believed so in diversity and inclusion. Then I realized they learned their lesson the first time and made sure that they were as far from the action as possible. Load up some failing cruise ships and send them to Ellis, they still have the dock.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ThinkThinkAgain",
        "time": "16 September, 2022",
        "context": "Border security matters, wherever you are.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "themark331",
        "time": "16 September, 2022",
        "context": "The democrat mayor is thinking, \" I wonder if I give them each a couple tacos and rake, they will rake the beach for us?\"",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "trump-for-pres",
        "time": "16 September, 2022",
        "context": "Send more, a lot more.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cdub34",
        "time": "16 September, 2022",
        "context": "I love when they say the inheritor boarder that was in shambles from Trump. These people are sick",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bochanghan",
        "time": "16 September, 2022",
        "context": "Humantarian crisis? This is what happen under Kabul Joe for every 10 feet of southern border. FL gov just give you a taste how every small town in borser facing.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "socialisthater869",
        "time": "16 September, 2022",
        "context": "biden should Drop Dead! He and obama caused this horror! ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "p3jockey916",
        "time": "16 September, 2022",
        "context": "Only a \"crisis\" for Elitist Democrats when they have to ACTUALLY LOOK at it! I'd say Martha's Vineyard could easily accommodate 5,000 to 7,000 more illegals. Heck, that's just one day's worth pouring into Texas!",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "thinkfirst911",
        "time": "16 September, 2022",
        "context": "They need one hundred times this many in each city, to even come close to understanding the magnitude of the problem President Potato head has created.",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "guitaristry573",
        "time": "16 September, 2022",
        "context": "Keep those planes and buses moving!",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rdw158",
        "time": "16 September, 2022",
        "context": "Start sending them to Delaware - I'm sure Biden will welcome them - he's been sending them from the border to other states in the dead of night.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "morganvz092",
        "time": "16 September, 2022",
        "context": "Notice how libs hate Christians but who is helping these people...atheists?",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "gunny7454",
        "time": "16 September, 2022",
        "context": "wait till 1 or 2 aliens get murdered. it's going to happen. liberal cities will own it",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "citizen789",
        "time": "16 September, 2022",
        "context": "Dems have been using illegals as political pawns for decades. It's the only way they can get votes, by bringing in massive numbers of illegals to boost their ratings and expecting the American tax payer to pick up the bill. We're tired of it Dems. Go De Santis! Keep shipping them off to Dem states, it's the only way they will learn the pain felt at the border.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tomdx",
        "time": "16 September, 2022",
        "context": "TODAY we find out desatan LIED again.   The plane came from Texas NOT Florida.  He's desparate for any attention.  Filth.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "justicenetwork",
        "time": "16 September, 2022",
        "context": "LOVE the Liberals compassion,  LOL  Just Not in my back yard...define hypocrite for me",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "justicenetwork",
        "time": "16 September, 2022",
        "context": "LOVE the Liberals compassion,  LOL  Just Not in my back yard...define hypocrite for me",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Jeanbean305",
        "time": "16 September, 2022",
        "context": "Just shows the hypocrisy among the wealthy",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "SenilityJoe",
        "time": "16 September, 2022",
        "context": "Biden will build a wall around Obama's house at our expense.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rightside101",
        "time": "16 September, 2022",
        "context": "If I was DeSantis I would send another 100 TODAY.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "SniffTest",
        "time": "16 September, 2022",
        "context": "I would send them all to DC. It’s appropriate that the politicians suffer their own policies. And it’s hypocritical for the democrats to call it a humanitarian crisis when they said they welcome the illegals get cry when they show up. It’s hilarious.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "deanpatrick751",
        "time": "16 September, 2022",
        "context": "When we eventually arrest them for deportation The flood to the sanctuary cities will be epic.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tnmtnmn",
        "time": "16 September, 2022",
        "context": "In 2014, Massachusetts citizens had nearly $62 billion in earnings between them, according to data from the state Department of Revenue.\nThere are nearly 50 millionaires living on the island.  Let the residents and Massachusetts enjoy the diversity, Massachusetts can afford them.",
        "good": "634",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "gofigure379",
        "time": "16 September, 2022",
        "context": "The Vineyard could use a few Mexican Restaurants. Oh, don’t forget to vaccinate new arrivals also!",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "justicenetwork",
        "time": "16 September, 2022",
        "context": "LOVE the Liberals compassion,  LOL  Just Not in my back yard...define hypocrite for me",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "detrufe",
        "time": "16 September, 2022",
        "context": "start building schools and affordable housing.  start sanctuarying",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "nycinfla",
        "time": "16 September, 2022",
        "context": "Double the flights and buses . like I tell my neighborhood bartender keep em coming and if I start to throw up give me doubles 😜",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rookie97700",
        "time": "16 September, 2022",
        "context": "They get 50 and it’s a crisis, texas gets 4000 a day and it’s ignored, vote republican in November to stop the destruction of America!",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "go2urroom",
        "time": "16 September, 2022",
        "context": "Breakfast tacos for everyone!!!",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cam14",
        "time": "16 September, 2022",
        "context": "Send them 5000 see how they like that.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "skeetertown2300",
        "time": "16 September, 2022",
        "context": "I recently stayed on MV for two nights. Couldn't leave fast enough. What a bunch of uppity clueless individuals.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "fedupconcernedcitizen442",
        "time": "16 September, 2022",
        "context": "Ron abd Greg, you guys are genius’s!",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "riveroftears803",
        "time": "16 September, 2022",
        "context": "I think they should give them tents too and tell them to set them up right in town.  Oh, the horror!!",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "fedupconcernedcitizen442",
        "time": "16 September, 2022",
        "context": "More busses please!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "naturejock",
        "time": "16 September, 2022",
        "context": "She\n did not ask for Barrack Hussein Obama resign when he flew in and bused \naround thousands of refugees from a deal with the European Union.  He \nstacked rural areas in America with loyal voters from the Middle East \nand Somalia.  Where is AOC and some of her ILK from?????Why does Biden \ncomplain about this?  He was vice president to Obama when they flew the \nmigrants into America.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jerichowalls7days",
        "time": "16 September, 2022",
        "context": "Quoting the great philosopher, Nelson, from the Simpson's \"Ha ha\"",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "concernedcitizen1500",
        "time": "16 September, 2022",
        "context": "Keep 'em going Governors...  Well done.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "SailorDavey980",
        "time": "16 September, 2022",
        "context": "Anyone else notice a definite lack of libs commenting on this particular subject?\nI just can't stop laughing at them.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Willyr",
        "time": "16 September, 2022",
        "context": "Humanitarian crisis??  I am surprised the local government of Martha’s Vineyard even knows that phrase.  Ooh, must have overheard the ex-pres chatting at tea one day.  Start sending the illegals/migrants( no diff to me ) to Delaware immediately and keep it going, not just 2 buses.  Send 2 buses every day till they close the border.  ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "3finger",
        "time": "16 September, 2022",
        "context": "NIMBY.  They're not like you and I. They're different.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Kadoladola",
        "time": "16 September, 2022",
        "context": "I hope they KEEP sending, flood the city with them. Is it ok to inconvenient a few of the wealthy elite, YES they are flooding our Country with their policy of open borders, with No consideration for the people or States, So if they love it so much let them enjoy the benefits.",
        "good": "394",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "concernedcitizen1500",
        "time": "16 September, 2022",
        "context": "Notice there's not one coward liberal here to chat...",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "kterceira",
        "time": "16 September, 2022",
        "context": "Load up some failing cruise ships and send them to Ellis Island, they\n still have the dock. Always wondered why NYC never offered to reopen Ellis Island if they believed so in diversity and inclusion. Then I realized they learned their lesson\n the first time and made sure that they were as far from the action as possible.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Americanist",
        "time": "16 September, 2022",
        "context": "Democrats invented \"kids in cages\" and then brought them back and expanded them after Trump eliminated the need.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ShallNOTBeInfringed",
        "time": "16 September, 2022",
        "context": "If sending 2 flights of them gets this response from Brandon. Then send 10 flights of them a day.",
        "good": "15",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "osamequin",
        "time": "16 September, 2022",
        "context": "They need ebikes and scooters to get around on the unfamiliar island.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rightside101",
        "time": "16 September, 2022",
        "context": "Libs call it unChristian to send Democrats to blue sanctuary towns. Bahahahahaha",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "urbanlogic",
        "time": "16 September, 2022",
        "context": "The students are gone from Vineyard Haven. Bring in the new staff? The Elite do-gooders in MV need the servers and cleaning crews. How about a tent city or even a BIG hospital boat in the harbor? White Flight is back in fashion on the Vineyard.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Americanist",
        "time": "16 September, 2022",
        "context": "I support a complete and definitive overthrow of our government, including public executions for our current officials. I'm not joking, and I'm not alone.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "riveroftears803",
        "time": "16 September, 2022",
        "context": "The Vineyard elites will ferry them to New Bedford. No way will they allow them to stay on their posh island.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "americafirst!",
        "time": "16 September, 2022",
        "context": "They should send thousands",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sick_of_dims",
        "time": "16 September, 2022",
        "context": "Maaaatha's Vineyard just received a whole brand new crew of yard workers that can replace the current illegals and take less money!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Hjnh",
        "time": "16 September, 2022",
        "context": "Obamas mansion is vacant off season. ",
        "good": "12",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "floridalass167",
        "time": "16 September, 2022",
        "context": "Send more.....open up the billionaires closed mansions....the illegals would love it. ",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mtrelles",
        "time": "16 September, 2022",
        "context": "DeSantis should have supplied every alien with a new tent.  Instructing them to pitch it in a nice shady place near the beach.",
        "good": "6",
        "bad": "0",
        "replies": []
    }
]