[
    {
        "user_name": "westofnewyorkeastofcalifornia",
        "time": "15 December, 2021",
        "context": "So scientists are exploring and getting excited at God's handiwork.  But they do not need to fix or control anything.  It has been handled just fine since the beginning of time.  That goes for the climate too.",
        "good": "13",
        "bad": "8",
        "replies": [
            {
                "user_name": "thomaswinslow009",
                "time": "15 December, 2021",
                "context": "Like earthquakes, hurricanes, tornadoes, flood, meteorites, Viral pandemics, bacterial infections, deadly droughts. Yeah, your god has it ALL under control.",
                "good": "4",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "walterkertz",
                        "time": "15 December, 2021",
                        "context": "Yeah, it stands to reason that all you see is the destruction. Try harder, and you will know the greatness which you now ignore.",
                        "good": "2",
                        "bad": "1",
                        "replies": [
                            {
                                "user_name": "thomaswinslow009",
                                "time": "15 December, 2021",
                                "context": "And it stands to reason that you ignore certain aspects of nature in order to fool yourself into believing in myths.",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "user_name": "westofnewyorkeastofcalifornia",
                        "time": "15 December, 2021",
                        "context": "With nothing but sunny days and calm weather we would have unbelievable evil.  Droughts have stopped the bloodshed of wars, and natural disasters have humbled people and taught us to care about and help others.  Utter selfishness is the result of too much ease.  Look around you.  Open your eyes.  Those who bask in luxury also become degenerates for the most part.  God knows what He is doing and you are very myopic.",
                        "good": "1",
                        "bad": "2",
                        "replies": [
                            {
                                "user_name": "letsgetrel",
                                "time": "17 December, 2021",
                                "context": "\"With nothing but sunny days and calm weather we would have unbelievable evil.\"\nHmmmm. So the heaven that some of you Christians who haven't read the Holy Bible closely enough, would lead to \"unbelievable evil\"?\n\nYou might want to think this through again. Start with your own Holy Bible, and then face the realities of the world around you.",
                                "good": "0",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "westofnewyorkeastofcalifornia",
                                        "time": "17 December, 2021",
                                        "context": "I am very familiar with the  Bible.  You obviously are not.  Prophets and Apostles, including  Christ , from the beginning to the end have preached repentance.  It is a requirement for heaven as no unclean thing can abide God's presence.  The peace of heaven will be enjoyed by the righteous.  Righteousness does not need repentance.  But no one on the earth has achieved righteousness, hence the need for repentance to become worthy of heaven.  It is a great book.  You might give it a try.  But if not, try commenting on what you do know.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": [
                                            {
                                                "user_name": "letsgetrel",
                                                "time": "18 December, 2021",
                                                "context": "I've obviously read that great  Book more thoroughly and conscientiously than you.\nNowhere does it say anything remotely similar to \"With nothing but sunny days and calm weather we would have unbelievable evil.\"\nAnd you sound like one of those 'Christians' who only do what you do to get into heaven. That is a selfish motive. I don't really care about the afterlife, because nobody knows what it is like. I do what I do because Christ asked us to love others as He loved us. That is enough for me.",
                                                "good": "0",
                                                "bad": "0",
                                                "replies": [
                                                    {
                                                        "user_name": "westofnewyorkeastofcalifornia",
                                                        "time": "19 December, 2021",
                                                        "context": "Have you read about the flood of Noah's time?  The people living on the earth were so wicked God wiped them off the face of the earth, except for Noah and his family.  Or how the prophet ElIjah prayed to have the rain stop for three years and that caused a great famine?  He did this because people were so wicked.  Also, the Bible tells us a great deal about the afterlife.  Caring about the after life leads us to a greater desire to love and help others because knowing where we came from, why we are here, and where we are going gives us less love for materialism and more love of others.  But, surely you know this.",
                                                        "good": "0",
                                                        "bad": "0",
                                                        "replies": [
                                                            {
                                                                "user_name": "letsgetrel",
                                                                "time": "19 December, 2021",
                                                                "context": "Noah's story is a parable. As a geologist I know there was never a global flood in human times. It is a parable to tell us to be good stewards of the planet, and good to each other.\n\"the Bible tells us a great deal about the afterlife.\" Not really. And did you know there is little mention of heaven in the Old Testament and no mention of the other place.",
                                                                "good": "0",
                                                                "bad": "0",
                                                                "replies": []
                                                            }
                                                        ]
                                                    }
                                                ]
                                            }
                                        ]
                                    },
                                    {
                                        "user_name": "MakingItHappen919",
                                        "time": "30 December, 2021",
                                        "context": "You are approaching this backwards. \nGod DID create Eden, your beautiful, perfect garden.  It's because of Man's choice of evil that we were evicted from this place, with the goal of working hard at being Human to return to the garden. Like with anything we have, it is hard work and sacrifice that gets us to the prize.  It's easy to be evil.  It's harder to be good. \nThere is nothing wrong about the goal of returning to Heaven.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "user_name": "RHS",
                        "time": "22 December, 2021",
                        "context": "This world is not perfect but it’s still great to live in Gods universe. Perfect will come later in heaven. I hope you’re going.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "thomaswinslow009",
                                "time": "23 December, 2021",
                                "context": "Where is this \"heaven\" you speak of ?",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "sciencerocks",
                "time": "16 December, 2021",
                "context": "God made it clear that He wanted us to be good stewards of the planet.\nThat includes climate, which we have warmed at an ungodly rate.",
                "good": "7",
                "bad": "3",
                "replies": [
                    {
                        "user_name": "westofnewyorkeastofcalifornia",
                        "time": "16 December, 2021",
                        "context": "God gave us the resources to improve the quality of our lives.  Fossil fuels have played a large part in that happening.  The agenda to control climate has nothing to do with being good stewards of the planet.  It is purely political to control populations and weaken the freedoms God intended for us to have.  When evil people start trying to play god and interfere with God given freedom, God will speak and He controls the weather.",
                        "good": "2",
                        "bad": "5",
                        "replies": [
                            {
                                "user_name": "sciencerocks",
                                "time": "16 December, 2021",
                                "context": "Nobody is trying to 'control' climate. That would be ridiculous.\n\nBut anthropogenic global warming is a confirmed scientific reality. We must ameliorate what we have done with greenhouse gases, deforestation, albedo changes, etc. THAT would be good stewardship.",
                                "good": "5",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "westofnewyorkeastofcalifornia",
                                        "time": "16 December, 2021",
                                        "context": "I absolutely agree we should be good stewards of the earth.  I agree with you on deforestation.  I live among farmers and dairymen.   They are some of the greatest stewards of the land I know.  They are practical in what they do.  But, I do not bow to all scientific theory that is debated by other scientific theory.  And I love science.  Look what it has done.  However, I don't accept everything just because it says it is scientific.",
                                        "good": "2",
                                        "bad": "5",
                                        "replies": [
                                            {
                                                "user_name": "sciencerocks",
                                                "time": "16 December, 2021",
                                                "context": "Well, then you should read the science. 99.9% of the world's scientists don't concur on anthropogenic global warming for no reason. They data from multiple scientific disciplines all lead to yo the same ineluctable conclusion about what we have wrought on this planet. We need to be better stewards.",
                                                "good": "5",
                                                "bad": "0",
                                                "replies": [
                                                    {
                                                        "user_name": "MakingItHappen919",
                                                        "time": "30 December, 2021",
                                                        "context": "People like you who believe that this is \"confirmed\" are the people that actually don't know science.\nThe fuzzy lens that we have to see the recent past is not capable of giving us a good definition of the long term trend of climate.  \n If you truly understood how they have modeled climate, and then understood statistics, then you would understand...\nThe lack of precision tells us that we cannot EVER 'know' what the climate precisely was before we started actually measuring and recording it.  When you then take imprecise data and do calculations to extrapolate for some future prediction, you are literally multiplying errors.   Climate models are manipulated to show these changes. Anyone remember Al's hockey stick?",
                                                        "good": "0",
                                                        "bad": "0",
                                                        "replies": [
                                                            {
                                                                "user_name": "sciencerocks",
                                                                "time": "30 December, 2021",
                                                                "context": "I know the science very well. I use it in my own research on evolutionary rates of mammals in Africa. We have an excellent long-term record on past global temperatures.\nAs for modeling, about half of my published research papers use modeling and simulation. It works quate well.\nSo, yes, I understand exactly how the infamous 'they' come to verifiable conclusions.",
                                                                "good": "0",
                                                                "bad": "0",
                                                                "replies": []
                                                            }
                                                        ]
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "user_name": "alt_drab",
                        "time": "18 January, 2022",
                        "context": "What they don't tell you is every planet has also warmed, at the same rate.  To many coal plants on Mars?",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "sciencerocks",
                                "time": "18 January, 2022",
                                "context": "That is false.",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "user_name": "thisstinks",
                        "time": "10 February, 2022",
                        "context": "He also made it clear that he is turning up the heat \"8  And the fourth angel poured out his vial upon the sun; and power was given unto him to scorch men with fire.\"",
                        "good": "0",
                        "bad": "1",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "rtfm81",
        "time": "15 December, 2021",
        "context": "Shame they couldn't send the 'squad' along for the ride.",
        "good": "21",
        "bad": "3",
        "replies": [
            {
                "user_name": "Coolbreeze326",
                "time": "15 December, 2021",
                "context": "Was thinking the same thing about Sleepy Joe.",
                "good": "11",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "skeff",
                        "time": "15 December, 2021",
                        "context": "I can think of a whole Titianic's worth of them...",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "biackbenz",
                "time": "15 December, 2021",
                "context": "Maybe we could send pelosi. Maybe not, she would turn it into a ball of black ice and we would all freeze.",
                "good": "2",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "TotallyIndependent#1",
        "time": "15 December, 2021",
        "context": "There is great value in this research.  NASA has figured out that it is very hot this near the sun.  Biden thinks they have found the root cause of global warming.  He dem-splained to us that it sort of like holding a s'more in a campfire.",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Bill268",
        "time": "15 December, 2021",
        "context": "Sounds like more government ' pie in the sky ' waste of taxpayers money to me. Of course my job does not depend on projects such as this.",
        "good": "1",
        "bad": "2",
        "replies": [
            {
                "user_name": "wallyman2",
                "time": "15 December, 2021",
                "context": "The sun is by far the largest factor in affecting the earth's climate.  Having a better understanding of it hardly seems a waste of money to me.",
                "good": "2",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "onfulldisplay",
        "time": "15 December, 2021",
        "context": "Parker was traveling 62 miles per second! Almost as fast as Stacey Abrams getting to the all you can eat buffet.",
        "good": "9",
        "bad": "2",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "onfulldisplay",
        "time": "15 December, 2021",
        "context": "AOC finally had a \"brilliant idea\" she told them to go at night.",
        "good": "10",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "MeOneGoodEye🏴‍☠️",
        "time": "14 December, 2021",
        "context": "Boobs are like the sun\nYou can only stare at ‘em for a very short time. But if you wear sunglasses, you can stare at ‘em as much as you want.",
        "good": "25",
        "bad": "2",
        "replies": [
            {
                "user_name": "gofor22",
                "time": "15 December, 2021",
                "context": "Me - will the silicone filled boob begin to heat?",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "Brylcream_Boomer",
                "time": "16 December, 2021",
                "context": "Which is why Joe wears his Aviators all the time.......",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "RHS",
                "time": "22 December, 2021",
                "context": "Mama always said that if you stare at someone’s boobs too long you will go blind. Even with sunglasses. Lol",
                "good": "1",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "petepeterson300",
                "time": "10 February, 2022",
                "context": "But like the sun, boobs can be as difficult to approach close enough to touch. ",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "bbbwww",
        "time": "15 December, 2021",
        "context": "Hope they don't knock that flame out when they hit it with that probe.",
        "good": "4",
        "bad": "0",
        "replies": [
            {
                "user_name": "onfulldisplay",
                "time": "15 December, 2021",
                "context": "Don't worry AOC they are very careful.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "skeff",
                        "time": "15 December, 2021",
                        "context": "Kamala told them to go at night, so it would be cooler...",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "skeff",
                "time": "15 December, 2021",
                "context": "It would take a really long match to relight that pilot...",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "Brylcream_Boomer",
                "time": "16 December, 2021",
                "context": "That would take one really REALLY big BIC to get it relit.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "Oonga-Boonga.",
        "time": "15 December, 2021",
        "context": "As NASA does great things, Democrats are passing laws that forbid \"D's\" and \"F's\" in school so more black kids can become astronauts, neurosurgeons, engineers, and mathematicians.",
        "good": "10",
        "bad": "2",
        "replies": [
            {
                "user_name": "onfulldisplay",
                "time": "15 December, 2021",
                "context": "Amazingly they think this is good for them.",
                "good": "1",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "westofnewyorkeastofcalifornia",
                "time": "15 December, 2021",
                "context": "In the near future we will be back to finding alternatives to bridges and dying early.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "skeff",
                        "time": "15 December, 2021",
                        "context": "The way things are going, dying early is a bad thing? 🤨",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "error": "error"
    },
    {
        "user_name": "walterkertz",
        "time": "15 December, 2021",
        "context": "Meanwhile, BLM continues to burn down cities and smash & grab Christmas excursions.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "amaddog",
        "time": "15 December, 2021",
        "context": "\"By spending millions of dollars, the sun was found to be hot.\"",
        "good": "6",
        "bad": "1",
        "replies": [
            {
                "user_name": "merdydad",
                "time": "15 December, 2021",
                "context": "But not as hot as the Fox reporters on the sideline.",
                "good": "3",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "quietsmith",
                "time": "17 December, 2021",
                "context": "I'm sure you can find a NASCAR race to watch if science is too much for you :D",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "rwl",
        "time": "15 December, 2021",
        "context": "“The more I study science, the more I believe in God.” ~Einstein.",
        "good": "3",
        "bad": "1",
        "replies": [
            {
                "user_name": "g0disdead",
                "time": "16 December, 2021",
                "context": "Eistein was a pantheist.  He believed the universe was god. He definitely didn't believe in made up bible god.",
                "good": "0",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "rwl",
                        "time": "16 December, 2021",
                        "context": "Einstein: \"I'm not an atheist, and I don't think I can call myself a pantheist. I believe in Spinoza's God who reveals himself in the orderly harmony of what exists.\" So, either Einstein is confused about Yeshua & Yahweh’s existence, and/or you are confused about Einstein’s views, or both of you are displaying supreme ignorance of the Jewish Scriptures. \n\nIt’s too late for Einstein (we know where he’s going to spend everlasting life), but it’s not too late for you. Read Dr. William Lane Craig’s book ‘Reasonable Faith’ and watch some of his YouTube videos. 4.5 billion people out of 7 billion people on this planet believes that Yeshua is about to return. Start doing your homework, before it is too late to turn it in…..clock is ticking….",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "g0disdead",
                                "time": "16 December, 2021",
                                "context": "Lol.  Look at Spinozism and then get back to me.  Its form of pantheism....",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "skeff",
        "time": "15 December, 2021",
        "context": "It's not 'dust.' It's corona virus... Get it? 😏 🤣",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "hartnavy",
        "time": "15 December, 2021",
        "context": "Is Al Gore on the spacecraft?",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "djohnson",
                "time": "17 December, 2021",
                "context": "Al Bore invented the sun.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "jr92",
        "time": "15 December, 2021",
        "context": "After Joe Biden brokered the cease fire agreement that ended the 6 day war back in '67, he designed spaceships for NASA.",
        "good": "4",
        "bad": "0",
        "replies": [
            {
                "user_name": "WillySmith...Oh,Slap!!",
                "time": "16 December, 2021",
                "context": "Then Al Gore invented the world wide web and then Hillary Clinton bravely fended off a hail of bullets in Afghanistan",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "RHS",
                "time": "22 December, 2021",
                "context": "Lol",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "RalphtheBusDriver",
        "time": "15 December, 2021",
        "context": "Creepy Joe thinks Amtrak will someday travel to the sun. All Aboard!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Yourstruly,JackD.Rpr.",
        "time": "15 December, 2021",
        "context": "\"NASA spacecraft makes history, officially ‘touches’ sun for first time ever,\" however, the key is to land a man and/or a woman on the sun. Now this would be accomplishing so very much.",
        "good": "2",
        "bad": "0",
        "replies": [
            {
                "user_name": "gofor22",
                "time": "15 December, 2021",
                "context": "AOC says landing someone on the sun can only be done in winter when it is cooler.",
                "good": "5",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "RHS",
                "time": "22 December, 2021",
                "context": "They would have to go at night. Lol",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "ssozialismus-macht-frei234",
        "time": "15 December, 2021",
        "context": "...Scientists have also found that solar fluctuations can cause weather changes here on Earth but they hope to quell the information from the public so if you read this then you really did not...",
        "good": "7",
        "bad": "5",
        "replies": [
            {
                "user_name": "sciencerocks",
                "time": "16 December, 2021",
                "context": "Solar cycles have minor effects on our weather and is mere background noise in anthropogenic global warming.",
                "good": "5",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "ssozialismus-macht-frei234",
                        "time": "16 December, 2021",
                        "context": "...right now anthropogenic background noise is killing us...",
                        "good": "1",
                        "bad": "5",
                        "replies": [
                            {
                                "user_name": "sciencerocks",
                                "time": "16 December, 2021",
                                "context": "We all wish that anthropogenic causes of global warming were just background noise, but ALL of the scientific data from multiple disciplines show a profound effect. It is not killing all of us, but it is killing some.\n\nLet's get serious and right the ship with realistic solutions, not Democrat nonsense.",
                                "good": "1",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "lmikeneely",
                                        "time": "25 December, 2021",
                                        "context": "sorry, all of the scientific data you are looking at is not real and made up to meet the o=political science of the day.",
                                        "good": "0",
                                        "bad": "2",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "user_name": "lmikeneely",
                        "time": "22 December, 2021",
                        "context": "Should be saying \"major\" effect.  Data shows the solar effects are far greater than the \"political\" scientist want to admit",
                        "good": "1",
                        "bad": "1",
                        "replies": [
                            {
                                "user_name": "sciencerocks",
                                "time": "23 December, 2021",
                                "context": "When accelerated global warming was first realized some 50 or so years ago, the first thing climatologists looked at was solar variation. Since then we've been through a number of solar cycles, plus solar flares, etc., but they've had negligible effects on the rising Earth temperatures.",
                                "good": "0",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "lmikeneely",
                                        "time": "25 December, 2021",
                                        "context": "You're funny.  That is one big lie and I surprised you can make that statement.  Go look at the 2012 UN report on global waming.  It found that there was no evidence of global warming,  It also stated that the climate models predicted nothing and were totally inaccurate and that they need to include solar influences because solar influences had a much greater effect.  And why would anyone believe any \"climate\" scientists is beyond me, they are more political scientists who pander to political financing.  Go read about climategate.  After all the evidence that the \"climate\" scientist could find no evidence to meet their agenda that started to manipulate data and change data.  When they were caught, the head scientist, when he resign, made a great comment.  He hoped that they did not destroy so much data that if global warming was happening they could not detect it.",
                                        "good": "1",
                                        "bad": "2",
                                        "replies": [
                                            {
                                                "user_name": "sciencerocks",
                                                "time": "25 December, 2021",
                                                "context": "Your first sentence was true. I can be very funny.\nEvery other sentence you wrote is completely false.\nMerry Christmas!",
                                                "good": "1",
                                                "bad": "1",
                                                "replies": []
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "bkbearth'smightiesthero",
        "time": "15 December, 2021",
        "context": "So FOX will open the comment section on this but not on Leo Dicaprio having a problem with Meryl Streep doing a nude scene in a movie he's filming for NETFLIX, right??",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "doug941",
                "time": "15 December, 2021",
                "context": "What's the big deal? I don't want to see her fully dressed.",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "merdydad",
                "time": "15 December, 2021",
                "context": "My wife says Leo has been turning heads for years. I still think he looks like he has Growing pains.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "bkbearth'smightiesthero",
                        "time": "15 December, 2021",
                        "context": "Ever seen the movie \"The Wolf of Wall Street\"??",
                        "good": "1",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "merdydad",
                                "time": "15 December, 2021",
                                "context": "No. Something I should know?",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "RalphtheBusDriver",
                "time": "15 December, 2021",
                "context": "Meryl Streep must be 80 years old, not even Mr. Streep wants to see her naked.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "longdrive11",
        "time": "15 December, 2021",
        "context": "I watched Aerial America about Vermont and I can say without a doubt that has to be the most boring place on earth.",
        "good": "3",
        "bad": "1",
        "replies": [
            {
                "user_name": "upn2dwind",
                "time": "15 December, 2021",
                "context": "My next door neighbor was from Vermont and he said the same thing...",
                "good": "2",
                "bad": "1",
                "replies": []
            },
            {
                "user_name": "Brylcream_Boomer",
                "time": "16 December, 2021",
                "context": "Nice comedic Re-direct!",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "ljfell",
        "time": "15 December, 2021",
        "context": "tearing along at more than 62 miles (100 kilometers) per second.\n\n62 mps x 60= 3,720 mpm(minute) x 60 = 223,200 mph. That's roughly the distance to the moon from here. That sounds a bit off to me.",
        "good": "0",
        "bad": "3",
        "replies": [
            {
                "user_name": "rubiks6",
                "time": "15 December, 2021",
                "context": "It’s a big universe we live in. You’ll never wrap your head around it.",
                "good": "2",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "Brylcream_Boomer",
                        "time": "16 December, 2021",
                        "context": "Billy Bob said that same thing in Armegeddon.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "gofor22",
                "time": "15 December, 2021",
                "context": "\"killjoy:)\"",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "chiefsbrat",
                "time": "15 December, 2021",
                "context": "The Earth orbits the Sun at 18.5 mps. The probe is using the Sun's pull to increase it's speed.",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "earthmelt",
                "time": "17 December, 2021",
                "context": "The number is dead on...\nIt will go even faster as its orbit gets closer...\nMax speed will be about 430,000 mph...",
                "good": "1",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "ljfell",
                        "time": "17 December, 2021",
                        "context": "I checked it out...it still amazes me that technology has advanced to the point that mankind can build a probe that can hit those velocities, moving in and out of the corona, with the stresses of that massive gravity well.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "earthmelt",
                                "time": "18 December, 2021",
                                "context": "Hey LJFell...  Said another way (although rounding up),\nthe PSP will reach a max velocity of 0.1% THE SPEED OF LIGHT !!!!",
                                "good": "0",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "ljfell",
                                        "time": "18 December, 2021",
                                        "context": "I hope they thought of a way to measure for any time dilation effects to see if Einstein was on the right track.",
                                        "good": "1",
                                        "bad": "0",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "RHS",
                "time": "22 December, 2021",
                "context": "That’s great Matt. So how far do you think you could travel at 62 mi./s.?",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "CyanBattery",
        "time": "15 December, 2021",
        "context": "Finally!  A serious attempt to find the real cause of climate change!",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "solace7",
        "time": "15 December, 2021",
        "context": "Well, it would have been great if the reporter had taken the time to learn and tell us how they prevented the spacecraft from melting when so close to the sun.  The surface of Mercury, more than 4x further out, is said to be hot enough to melt lead.  How can electronics be kept alive at 8 million miles from the sun?",
        "good": "19",
        "bad": "0",
        "replies": [
            {
                "user_name": "ssozialismus-macht-frei234",
                "time": "15 December, 2021",
                "context": "...zackly, I waded through the whole story and never heard a Fahrenhiet, Celsius or even a Kelvin.....",
                "good": "12",
                "bad": "0",
                "replies": []
            },
            {
                "error": "error"
            },
            {
                "user_name": "skeff",
                "time": "15 December, 2021",
                "context": "It's Associated Press: They don't think we're smart enough to get beyond the 'shiny stuff,' and we shouldn't trust them to 'splain it. As for your question: A 4.5-inch thick, eight-foot diameter heat shield -- designed and manufactured by Canadian company Ultramet -- \"... protects the Parker Solar Probe and its instruments against the intense heat and energy.\"",
                "good": "12",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "CyanBattery",
                        "time": "15 December, 2021",
                        "context": "Maybe they had solar powered air conditioning.",
                        "good": "2",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "skeff",
                                "time": "15 December, 2021",
                                "context": "Maybe one o' them thar heat pumps?",
                                "good": "3",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "user_name": "earthmelt",
                        "time": "17 December, 2021",
                        "context": "Also, during closest pass, the solar panels fold up behind the heat shield...\nMeanwhile, the heat shield is actively cooled from water that is cooled\nfrom the \"back\" side of the spacecraft that faces deep space (very cold)...",
                        "good": "3",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "skeff",
                                "time": "15 January, 2022",
                                "context": "👍",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "rubiks6",
                "time": "15 December, 2021",
                "context": "The dark side of Mercury is just 23° above absolute zero.",
                "good": "0",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "merdydad",
                        "time": "15 December, 2021",
                        "context": "Which side is dark? Is it the other side?",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "SagittariusA*",
                "time": "16 December, 2021",
                "context": "There’s a difference between heat and temperature. High temperatures don’t always mean high heat. The probe is protected by a heat shield that is 11’ around and 4” thick. The probe only gets heated to around 2,500° F. The heat shield can withstand this. ",
                "good": "1",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "solace7",
                        "time": "16 December, 2021",
                        "context": "Yes, there is a difference between heat and temperature.  Heat is thermal energy and temperature is a measure of how much thermal energy there is in an object.  The space craft survives because it can radiate its thermal energy away into all of space (with a radiation temperature a few degrees above absolute zero) to compensate for radiant energy input from the sun.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "Brylcream_Boomer",
                "time": "16 December, 2021",
                "context": "AOC says they used Sunscreen",
                "good": "1",
                "bad": "1",
                "replies": []
            },
            {
                "user_name": "klasy",
                "time": "17 December, 2021",
                "context": "Sun Screen.",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "quitcallingmeracist!!!",
                "time": "18 December, 2021",
                "context": "When these folks write articles, they don't seem to find it important that they should answer the questions most people would want to know?  Why it didn't melt and how did they keep the electronics working were the first 2 things I was curious about! Maybe working in the Biden era there not concerned about the details. I just know after reading most articles I don't know any more than I did after reading the headline.",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "error": "error"
    },
    {
        "user_name": "rubiks6",
        "time": "15 December, 2021",
        "context": "We know the Sun rises each day. It’s relative. The Sun goes around the Earth. We all have a geocentric view of the universe.",
        "good": "0",
        "bad": "2",
        "replies": [
            {
                "user_name": "g0disdead",
                "time": "16 December, 2021",
                "context": "I sure hope you are kidding.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "rubiks6",
                        "time": "16 December, 2021",
                        "context": "I sure hope you know something about relativity. All reference frames are valid. You merely have to adjust your calculations for the reference frame you choose. The Earth is a perfectly valid reference frame. \n\nI knew I could get some sucker like you to reveal your ignorance of physics. \n\nYou dope.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "g0disdead",
                                "time": "16 December, 2021",
                                "context": "I didn't pick up on it because you are a science denying YEC shlump.   I mean you are only one step away from a flat earther...",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "quietsmith",
                "time": "17 December, 2021",
                "context": "No, we really don't :D",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "RalphtheBusDriver",
        "time": "15 December, 2021",
        "context": "Leave the sun alone, if you accidentally destroy the sun, we all die.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "imfortrump2020",
        "time": "15 December, 2021",
        "context": "\"touches’ sun for first time ever\"...Biden wanted to be the first to \"touch it\"",
        "good": "3",
        "bad": "3",
        "replies": [
            {
                "user_name": "djohnson",
                "time": "17 December, 2021",
                "context": "I think he already did and it fried his brain.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "treason_tracker",
        "time": "15 December, 2021",
        "context": "Joe Biden was so terrified when his personal Apollo 22 \"Space Plane\" was damaged so bad that War Hero Biden had to hold his breath in orbit for 8 minutes just to weld the door back on to get himself and his Dog back to Earth!",
        "good": "1",
        "bad": "1",
        "replies": [
            {
                "user_name": "RedSword",
                "time": "15 December, 2021",
                "context": "Still, it's quite an achievement for the man who grew up a poor coal miner's son, and who before acting as the Israeli liason to Golda Meyer during the 6-day war, drove a tractor-trailor for a living!",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "paladin3456",
        "time": "15 December, 2021",
        "context": "Sun, it's important you let me know right away if anyone touches you.",
        "good": "4",
        "bad": "0",
        "replies": [
            {
                "user_name": "treason_tracker",
                "time": "15 December, 2021",
                "context": "No...wait 20+ years to speak up, you'll get way more cash for your \"services\" by not reporting it right away.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "rubiks6",
        "time": "15 December, 2021",
        "context": "You are my sunshine 🎶\nMy only sunshine. 🎶\nYou make make happy 🎶 \nWhen skies are gray. 🎶",
        "good": "2",
        "bad": "1",
        "replies": [
            {
                "error": "error"
            }
        ]
    },
    {
        "user_name": "butwhat",
        "time": "15 December, 2021",
        "context": "So, does the Sun consider the Parker Probe a... corona virus... now?  Sorry, couldn't help myself...",
        "good": "17",
        "bad": "1",
        "replies": [
            {
                "user_name": "amaddog",
                "time": "15 December, 2021",
                "context": "I'm still laughing. Excellent!",
                "good": "1",
                "bad": "1",
                "replies": []
            },
            {
                "user_name": "wallyman2",
                "time": "15 December, 2021",
                "context": "ouch. . .",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "WillySmith...Oh,Slap!!",
                "time": "16 December, 2021",
                "context": "They are going to have to transmit a very large “anti-virus” file to the Parker Probe, so it doesnt infect the sun.  If not, it could be killing the universe and those who failed to properly vaccinate the Parker Probe would be responsible!   Someone send Fauci…",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "thomaswinslow009",
        "time": "15 December, 2021",
        "context": "They should have gone there at night.",
        "good": "5",
        "bad": "1",
        "replies": [
            {
                "user_name": "dan5047628",
                "time": "17 December, 2021",
                "context": "You've been listening to AOC again, lol.\nGood one",
                "good": "1",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "LetsGoBrandonAMillionTimes",
        "time": "15 December, 2021",
        "context": "No doubt the information obtained by this probe will be phenomenally useful to scientists, the real amazing part of this is that a vehicle could be constructed that can approach and dip into the corona of the star, and not suffer from melting down, frying the electronics, and overcome the radiation and send signals back that can be interpreted by receiving units.\nEngineers are amazing.\nMath and sceince are also amazing.\nThis week in the headlines was the repetitive headline with the claim that some people consider \"math\" to be \"racist\". I wonder how the African-American cosmologists that are fluent in the language of mathematics, and the engineers who are also similarly fluent feel about the headline that \"math\" can show a bias against people of color. What an immensely stupid argument an individual or group of individuals could present. \nProps to:\nProf. Hakeem Oluseyi, Distinguished Research Professor in the Department of Physics & Space Sciences at the Florida Institute of Technology\nDr. Beth A. Brown (NASA)\nDr. Arthur B.C. Walker, Univ of Illinois, Hansen Experimental Physics Laboratory\nDr. Neil DeGrasse Tyson, Hayden Planetarium NYC\nand a long list of others.\n\nDon't believe the hype of the communists trying to make this an issue of race and make excuses for an entire generation of people who want to make the ENTIRE Black race into children who cannot do math.\nPeople who apply themselves succeed. And if any person is weak in math, then they may have other skills.",
        "good": "4",
        "bad": "0",
        "replies": [
            {
                "user_name": "WillySmith...Oh,Slap!!",
                "time": "16 December, 2021",
                "context": "Wait, Wait, Neil DeGrasse Tyson …. the scientist who contributed to the downgrading of Pluto as a planet…hmmm …..not sure I would count him as a role model ….",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "scion890",
                        "time": "16 December, 2021",
                        "context": "since it falls into the same category as other 'dwarf planets' the official designation changed - nothing to get your knickers wound up over, Sheldon",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "LetsGoBrandonAMillionTimes",
                        "time": "17 December, 2021",
                        "context": "Wow! A couple things, Neil is not necessarily a role model, he is a scientist capable of understanding physics. (Please refer to the oiginal post to which you respond.)\nSecond, your statement has no logic behind it. Tyson and an international committee looked at the current definitions accepted by the other world scientists and joined in their majority opinion.\nIf you happen to be a scientist, you have opportunity to publish a counter-opinion. Please do if you fit that qualification.\nWhatever you decide, please refer back to the original post and read it again, see that your comment is unrelated to the subject matter. Merry Christmas.",
                        "good": "1",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "MakingItHappen919",
                                "time": "30 December, 2021",
                                "context": "He's also a flaming liberal who can't even bother to get his facts right on his TV show",
                                "good": "0",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "LetsGoBrandonAMillionTimes",
                                        "time": "30 December, 2021",
                                        "context": "Regardless of what he says on TV, he can still do math, can unravel the mysteries of higher math. That's what my OP was stating.\nDon't care if he votes for the Easter Bunny for Lord Mayor of NYC.\nWe are talking about math being racist - try sticking to the topic please.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "klasy",
        "time": "17 December, 2021",
        "context": "This is a hot topic for scientist!!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "djohnson",
        "time": "17 December, 2021",
        "context": "If the sun expands , say 100 feet out. how much more sunlight and heat will be released. Can those here on earth measure this? I just asking because I've read where Venus, Mars, and all the planets are warming ever so slightly. maybe part of the reason for global warming .",
        "good": "0",
        "bad": "1",
        "replies": [
            {
                "user_name": "davidleeroth",
                "time": "17 December, 2021",
                "context": "The effect wouldn't be noticeable, considering the fact that the sun does expand and contract on a regular basis... far further than 100 feet out.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "djohnson",
                        "time": "17 December, 2021",
                        "context": "but could it impact the Earths weather, Hotter/colder, 100 feet may not be much, but the size could be, \nthank you, for the reply, enjoyed it.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "quietsmith",
                                "time": "17 December, 2021",
                                "context": "Solar irradiance could yes, but the expansion and contraction of the sun wouldn't really affect that.",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            },
                            {
                                "user_name": "davidleeroth",
                                "time": "17 December, 2021",
                                "context": "Again.. read what I said.  The sun's atmosphere expands and contracts by a HUGE margin (relatively speaking) between 7-10 miles.  For a star, that's basically nothing and is still considered in equilibrium It's practically unnoticeable.  For us on earth, literally nothing changes.  When the equilibrium is finally broken, however, the sun will start expanding by thousands of miles.  THEN you'll start noticing negative impact on the earth. Heck during our trip around the sun at our closest point we're 91 million miles away and at our furthest we're 94.5 million miles away.  Even by that large of a change (3.5 million miles) it has almost no real impact on us.  The only thing that is going to matter is when the sun starts burning helium and increases in temperature.",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "<*.*>",
        "time": "16 December, 2021",
        "context": "Hot stuff.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dan5047628",
        "time": "17 December, 2021",
        "context": "So how many billion to find out what happens when you fly into the Sun??",
        "good": "0",
        "bad": "5",
        "replies": [
            {
                "user_name": "Cons_Indpdt",
                "time": "17 December, 2021",
                "context": "Smart people want to know this stuff... you can just keep picking your nose.",
                "good": "4",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "dan5047628",
                        "time": "17 December, 2021",
                        "context": "We already know what happens. Didn't need to spend billions to find out the sun is hot.",
                        "good": "0",
                        "bad": "1",
                        "replies": [
                            {
                                "user_name": "beadgBass",
                                "time": "18 December, 2021",
                                "context": "They found considerably more than that, but it is all over your head anyway (and I'm not referring to the sun).",
                                "good": "2",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "dan5047628",
                                        "time": "21 December, 2021",
                                        "context": "Ha ha ha, Insults come from those with nothing intelligent to say",
                                        "good": "0",
                                        "bad": "1",
                                        "replies": [
                                            {
                                                "user_name": "Cons_Indpdt",
                                                "time": "22 December, 2021",
                                                "context": "So do dumb questions about funding.",
                                                "good": "0",
                                                "bad": "0",
                                                "replies": []
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "dan5047628",
        "time": "17 December, 2021",
        "context": "The Fox Comedy, I mean Science section has been a little slow lately?\nWe need more articles to make fun of.",
        "good": "0",
        "bad": "5",
        "replies": [
            {
                "user_name": "quietsmith",
                "time": "17 December, 2021",
                "context": "You are the comedy.\n\nYou are what is made fun of.",
                "good": "2",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "dan5047628",
                        "time": "17 December, 2021",
                        "context": "I didn't drink the cool-aid",
                        "good": "0",
                        "bad": "1",
                        "replies": [
                            {
                                "user_name": "quietsmith",
                                "time": "18 December, 2021",
                                "context": "You guzzle it down like nobodies business and we keep showing you :D",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "error": "error"
            },
            {
                "user_name": "beadgBass",
                "time": "18 December, 2021",
                "context": "Even Fox knows more about science than you.\nWhy do you have to keep on changing your moniker? Have you really been kicked off that many times?",
                "good": "2",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "dan5047628",
                        "time": "21 December, 2021",
                        "context": "Fox hates it when you point out their Lies.\nThey like people like you that just believe anything they say",
                        "good": "0",
                        "bad": "1",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "americaisruinedbyimmigration",
                "time": "23 December, 2021",
                "context": "ohhh lordy!  To have such a pathetic life that you have time to get on a news feed that you don't even like and make moronic comments... its like when I go downtown and see all the sherbert colored hair do's and septum piercing weirdos..... I just smh and know that society in a whole is failing. \n\nlike you, a failure. ",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "jacques14",
        "time": "18 December, 2021",
        "context": "Is being that close to the sun feels like being a mile from Biden???",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "GoldFish",
        "time": "15 December, 2021",
        "context": "It's amazing that the device could still send data back after such a sizzling encounter.\nThere must be some kind of retractable antennae.\nI'm going to do some research on this.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "quitcallingmeracist!!!",
        "time": "18 December, 2021",
        "context": "Can someone explain how your scientist can predict the earth's climate and temp 100's of years in the future and my scientist can't tell me if it's going to rain tomorrow??",
        "good": "3",
        "bad": "0",
        "replies": [
            {
                "user_name": "quietsmith",
                "time": "19 December, 2021",
                "context": "Weather is based on rapidly changing short term conditions.\n\nClimate is based on long term conditions measured over decades.\n\nI can't tell you if it will rain in July in Arizona.\n\nI can tell you that the month of July will be hot and dry in Arizona.",
                "good": "4",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "dan5047628",
                        "time": "21 December, 2021",
                        "context": "Burrrrrp!",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "quietsmith",
                                "time": "21 December, 2021",
                                "context": "You forgot your red nose and overly large red shoes.",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "user_name": "sgtchemistry225",
                        "time": "21 December, 2021",
                        "context": "Actually, July is one of our wettest months in AZ.  It is the start of our annual monsoon.  Yes, it's still very hot, but it is also our wettest season.  That said, no climate model since the 1980's has accurately predicted the climate into the future.  They have all been amazingly inaccurate.  There is no grant money available from federal granting agencies for research into WHY these models fail so miserably.  All the money is in climate change alarmism.  That is not how science is supposed to work.  It's as though all grant money for geology is going to fund the Flat Earth Society.",
                        "good": "2",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "quietsmith",
                                "time": "21 December, 2021",
                                "context": "Fascinating.\n\nThe average precipitation for AZ in July is less than 1 inch, so while that may be 'above average', it doesn't change the fact that AZ is dry in July. It ranks 43rd overall for summer precipitation.\n\nSo yes, it is hot and dry in AZ in July.\n\nAnd you just get more wrong from there :D\n\nYes, climate models have been highly accurate for decades now as the globe warmed precisely as anyone who understands the physics knows it will when CO2 levels rise.",
                                "good": "1",
                                "bad": "1",
                                "replies": []
                            },
                            {
                                "user_name": "Cons_Indpdt",
                                "time": "22 December, 2021",
                                "context": "\"All the money is in climate change alarmism.\"\n\nThe majority of the money is funding science denialism, the only reason funding was increased for real science is to counter the anti-science nonsense. You are right, that is not how science is supposed to work. It is what happens when politics and financial interests try to influence the science. When the Flat Earth society raises millions to disseminate flat Earth nonsense, funding for legitimate geology will increase to counter the propaganda.",
                                "good": "1",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "Whereismymonkey",
        "time": "21 December, 2021",
        "context": "I am not impressed.  If you want to impress me, land astronauts on the sun.  AOC would probably volunteer first.",
        "good": "2",
        "bad": "0",
        "replies": [
            {
                "user_name": "dan5047628",
                "time": "21 December, 2021",
                "context": "AOC will land in at night when its safe, lol",
                "good": "1",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "rubiks6",
        "time": "16 December, 2021",
        "context": "Is that the stars in the sky or is it \nRain falling down?\nWould it burn me if I touched the Sun? Yeah\nSo big, so round.\n\nWell I need you, oh yea \nAnd ah — I’ve chosen you as the one for me, \nIs this LOVE baybay or is it \nJust \nConfusion.",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "beadgBass",
                "time": "18 December, 2021",
                "context": "For you it is always just confusion. Did Hendrix give you those psychedelic drugs?",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "rubiks6",
                        "time": "18 December, 2021",
                        "context": "What do you know about Jimi Hendrix? You’re a juvenile.",
                        "good": "0",
                        "bad": "1",
                        "replies": [
                            {
                                "user_name": "quietsmith",
                                "time": "19 December, 2021",
                                "context": "And you're a proven liar :D",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "user_name": "quietsmith",
                        "time": "19 December, 2021",
                        "context": "You'll have to forgive rubiks6 as he seems to think if he screams loudly enough all of science becomes wrong because Jesus said so.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "fakeitgoodnasa",
        "time": "24 December, 2021",
        "context": "This utterly outlandish claim has to be one of the most comical ever made by Nasa.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "nospinfromvegas801",
        "time": "21 December, 2021",
        "context": "Gonna be kewl when they find water on the Sun!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dan5047628",
        "time": "21 December, 2021",
        "context": "As to the water find on Mars.\nAl Gore invented Lying about Science.",
        "good": "1",
        "bad": "2",
        "replies": []
    }
]