[
    {
        "user_name": "bee76",
        "time": "8 May, 2019",
        "context": "I would be curious to know about the boar in Sweden. It seems strange that his levels were so high. It makes me wonder how often countries cover their own nuclear blunders by blaming Chernobyl. I’m not that well educated on radiation exposure, so I may be off base, but I would think that if the boar had radiation levels that high, then many other creatures in the region  should too. It shouldn’t be rare. Perhaps he came in contact with something more contained and a bit closer to home?",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "debtisachoice",
        "time": "8 May, 2019",
        "context": "AOC should go visit the location to see if there is anything she can do to help",
        "good": "20",
        "bad": "0",
        "replies": [
            {
                "user_name": "kaceyhemway",
                "time": "8 May, 2019",
                "context": "AOC just discovered a sink garbage disposal. Baby steps.",
                "good": "23",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "Freddy420",
        "time": "8 May, 2019",
        "context": "Haven’t heard much about Fukushima. That’s a pretty bad one too.",
        "good": "9",
        "bad": "0",
        "replies": [
            {
                "error": "error"
            }
        ]
    },
    {
        "user_name": "cms75",
        "time": "8 May, 2019",
        "context": "Who are the poor workers that are going to install the solar panels in that area!  Crazy!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "JohnDoedoe010",
        "time": "8 May, 2019",
        "context": "The left should be happy\nthey hate Russia",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "OlivePizza",
                "time": "8 May, 2019",
                "context": "Chernobyl was part of USSR/Russia at the time, but Ukraine is no longer under Russian control (Crimea, aside...of course)",
                "good": "3",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "JohnDoedoe010",
                        "time": "8 May, 2019",
                        "context": "Yeah ok there dictator is living large in \nrussia as the world sat back and did nothing. And still have Russian troops \nthere . Sad those people won the uprise\nthen russia stepped in Obama did nothing . Sad",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "OliveBottle",
        "time": "8 May, 2019",
        "context": "It is a beautiful place now, no people just nature and animals retaking the planet.",
        "good": "6",
        "bad": "0",
        "replies": [
            {
                "user_name": "RedBandAid",
                "time": "8 May, 2019",
                "context": "Ya mutant animals",
                "good": "11",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "OliveBottle",
                        "time": "8 May, 2019",
                        "context": "No they are actually not, do they have poison in their blood yes, but living more now than they did then.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "JasonBourne66",
                                "time": "8 May, 2019",
                                "context": "You're way off. Do some research. LOTS of mutations and oddities from the fallout. The animals are far from doing well and \"retaking\" the planet (whatever that's supposed to mean).",
                                "good": "0",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "culhane",
                                        "time": "8 May, 2019",
                                        "context": "please do site references for said 'research'...",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "uglious2000",
                "time": "8 May, 2019",
                "context": "Studies have shown even the insects are struggling so I'm not sure what you are referring to. Unless you read the article that was debunked. The \"scientists\" who reported that nature was thriving never even went there.",
                "good": "2",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "normaldude33",
                "time": "8 May, 2019",
                "context": "Weird thing to say...",
                "good": "1",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "grobnik",
                "time": "8 May, 2019",
                "context": "\"but living more now than they did then\"....not a zoologist, but apparently you did stay at a Holiday Inn Express last night.....ya kinda just made that up now didn't ya?",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "OliveBottle",
                        "time": "8 May, 2019",
                        "context": "Go there I haven't been but would love too, you pay I go, now watch the real thing yes some have a problem but do so everybody in life.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "error": "error"
    },
    {
        "user_name": "t24530",
        "time": "8 May, 2019",
        "context": "Despite all the bad press and the couple of rare accidents, it still seems that nuclear is the most efficient form of clean energy.   True, the rare accident is quite deadly but so is a plane crash.",
        "good": "6",
        "bad": "0",
        "replies": [
            {
                "user_name": "coop-atroop-a",
                "time": "8 May, 2019",
                "context": "Nuclear is tough.  The rewards are as great as the risk.  Personally, I think the reward makes it worth it so long as they're built smartly.",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "jasonpalex",
                "time": "8 May, 2019",
                "context": "The remnants of a plane crash don't cause illness long after the plane has crashed.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "lovesamerica!!",
                        "time": "8 May, 2019",
                        "context": "Except for the dead people",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "error": "error"
            },
            {
                "user_name": "normaldude33",
                "time": "8 May, 2019",
                "context": "Nuclear waste and it's impact on the environment is still an issue.",
                "good": "1",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "JasonBourne66",
                        "time": "8 May, 2019",
                        "context": "The nuclear industry has developed – and implemented – most of the necessary technologies required for the final disposal of all of the waste it produces. The remaining issue is one of public acceptance, and not of technological feasibility.\nThe amount of waste produced by the nuclear power industry is small relative to other industrial activities.",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "RegularWorkingJoe",
        "time": "8 May, 2019",
        "context": "relocate DNC headquarters there please",
        "good": "36",
        "bad": "0",
        "replies": [
            {
                "user_name": "stupidshouldbepainful",
                "time": "8 May, 2019",
                "context": "You mean another location? Who else would try to distract attention away from their own Russian involvment (i.e. Urranium One/Reset Button) that one who is guilt themselves?\n\nMe thinkith you protest too much!!!",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "memberliberty",
        "time": "8 May, 2019",
        "context": "Drones? Why didn't they just ask the people who still live there to do the survey? About a thousand former residents returned shortly after the accident, about a hundred still live there today.",
        "good": "5",
        "bad": "0",
        "replies": [
            {
                "user_name": "johngielisch",
                "time": "8 May, 2019",
                "context": "I doubt many of them have the education to do a proper survey.",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "StupidPeople101",
        "time": "8 May, 2019",
        "context": "Soon to be call Iran.  Yes.  Let us all keep ruining the ONLY planet to sustain human life.\nAs long as ego and greed rule the world ...",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "CA2020",
        "time": "8 May, 2019",
        "context": "What is up with including a 'slideshow' of the same exact wording in the story below it? I can understand embedding video that supports the story....but to click play only to see a 'powerpoint' presentation with music and the SAME WORDING from the story is a waste of time.",
        "good": "4",
        "bad": "0",
        "replies": [
            {
                "user_name": "jonathanpi",
                "time": "8 May, 2019",
                "context": "Some people assimilate information in a different way than you do.  Don't complain about it.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "dT.",
                        "time": "8 May, 2019",
                        "context": "So do real journalism and make a verbal report.  All they are doing is clipping and pasting text into a clip with ooh and awe sounds.",
                        "good": "1",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "jonathanpi",
                                "time": "8 May, 2019",
                                "context": "How you define real journalism is very selective and, quite frankly, too specific.  Let them present the news the way they want to present the news.  If you don't like it, move along to the other news networks.  All I care about is the facts.  I make up my mind on its accuracy.",
                                "good": "0",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "dT.",
                                        "time": "9 May, 2019",
                                        "context": "How about you contradict yourself even more?  If you want to see a clip, at least have audio.  Dont argue out of both sides of your mouth and then deny it at the same time.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": [
                                            {
                                                "user_name": "jonathanpi",
                                                "time": "9 May, 2019",
                                                "context": "What are you going on about?  What contradiction?  You don't get to dictate how the news is delivered.",
                                                "good": "0",
                                                "bad": "0",
                                                "replies": [
                                                    {
                                                        "user_name": "dT.",
                                                        "time": "9 May, 2019",
                                                        "context": "Wow!  Can you think for yourself at all?  All rkarins is saying is IF you're going to have a video clip, then at least have audio, so that YOU can \"assimilate the information\" in different manner.  Pasting the same text in a video clip does nothing different than just reading it in the base article.",
                                                        "good": "0",
                                                        "bad": "0",
                                                        "replies": []
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "dT.",
                "time": "8 May, 2019",
                "context": "I get videos that dont even correspond to the story.",
                "good": "2",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "jonathanpi",
                "time": "9 May, 2019",
                "context": "Oh, I can certainly think.  In fact, I happen to know that a video lacking audio (or having text replace it) is still another way of sharing the information.  As I said before, you are simply being too selective.  Your lack of ability to accept these minute differences is a problem you will need to work on if you ever hope to grow as a person.\n\nMy point is, stop complaining.  Go elsewhere if you don't like how the news is being presented.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "BlueBowtie",
        "time": "8 May, 2019",
        "context": "Chernobyl’s final weather forecast: “Overcast and 6000 degrees.“",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "glong1971",
        "time": "8 May, 2019",
        "context": "The HBO series about the disaster began last night...for the younger people, it would be a good idea to watch how socialists work.",
        "good": "22",
        "bad": "0",
        "replies": [
            {
                "error": "error"
            },
            {
                "user_name": "ENHJester",
                "time": "8 May, 2019",
                "context": "Most youngsters have already seen and learned about Chernobyl through the modern invention known as; The Internet. No need to waste your money on HBO.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "twosense",
        "time": "8 May, 2019",
        "context": "Between articles like this and the new \"Chernobyl\" miniseries on HBO, I am beginning to wonder if the environmental lobby is trying to stifle the renewed interest in nuclear power.",
        "good": "20",
        "bad": "0",
        "replies": [
            {
                "error": "error"
            }
        ]
    },
    {
        "error": "error"
    },
    {
        "user_name": "flymoe",
        "time": "8 May, 2019",
        "context": "Fukushima is worse than Chernobyl. Fukushima is still dumping radiated water into the Pacific. We won't know the extent of this damage for centuries to come. Humans need to develop other power sources than nuclear. Nuclear power is not the way to go.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "culhane",
                "time": "8 May, 2019",
                "context": "The sun is dumping massive radiation into the ocean:  solar power is not the way to go....\n\nWe know the damage of fossil fuel use very well now.\nModern, next generation nuclear IS the way to go.",
                "good": "7",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "mabazeshari",
                        "time": "8 May, 2019",
                        "context": "Put one in your back yard next to where your kids play. Then we will talk.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "liberalsbad",
                                "time": "8 May, 2019",
                                "context": "grew up 10 miles from nuclear power station.  been boating and swimming in the lake created to cool it.  it is the best and most efficient source of powering our demanding electrical grid.  still live 25 miles from the same plant that was built in the 80's.  I have 10 fingers and 10 toes.",
                                "good": "1",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "CyanHat",
        "time": "8 May, 2019",
        "context": "I know a teacher there after the blast who was ordered to clean the desks with soap and water, without protective gear and she ended up with thyroid cancer. Soap and water",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "amshandy",
                "time": "8 May, 2019",
                "context": "I was stationed in West Berlin at the time. We were told 'not to go out in the rain.'",
                "good": "1",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "CyanHat",
                        "time": "8 May, 2019",
                        "context": "Also, told not to buy /order Absolute Vodka at the time, because with winds were blowing in that direction. At that time Vodka was generally made  from Potatoes",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "johngielisch",
                "time": "8 May, 2019",
                "context": "Soap and water does remove surface contaminants. What did they do with the soapy water afterwards?",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "pspr",
        "time": "8 May, 2019",
        "context": "I watched that Chernobyl movie.  It's all good now.  Just don't eat the fish and you won't glow in the dark.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "OrangeQuill",
        "time": "8 May, 2019",
        "context": "Chelsea Handler blames Trump for Chernobyl",
        "good": "2",
        "bad": "0",
        "replies": [
            {
                "user_name": "AirNav74",
                "time": "8 May, 2019",
                "context": "Chelsea Handler's middle name is \"Chernobyl\"",
                "good": "4",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "error": "error"
    },
    {
        "user_name": "culhane",
        "time": "8 May, 2019",
        "context": "Pandoras Promise documentary included a field trip into Chernobyl zone, and details on after effects.\nNothing like the wild horror stories.  Other reactors at the site KEPT ON OPERATING for years.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ikem",
        "time": "8 May, 2019",
        "context": "This was such a great tragedy in world history.  So many people died and this area destroyed.  I hope we learned from this great mistake and never let it happen again.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "RedScooter",
        "time": "8 May, 2019",
        "context": "No telling what they are chem trailing us with now.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "error": "error"
            }
        ]
    },
    {
        "user_name": "UglyForest",
        "time": "8 May, 2019",
        "context": "There are people that refused to evacuate from Chernobyl and are still living there.  Mostly old women now.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "hopinavamom",
        "time": "8 May, 2019",
        "context": "It's only a matter of time before a Rave festival happens here...if it hasn't already...",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "trinibwoi",
                "time": "8 May, 2019",
                "context": "Look at the bright side, they won't need lights.  Everything will already have a green glow....",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "BlackBeagle",
        "time": "8 May, 2019",
        "context": "Send all our Mexicans there.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "ikem",
                "time": "8 May, 2019",
                "context": "now that wasn't funny.  Sorry.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "thereyagoagain",
                        "time": "8 May, 2019",
                        "context": "Just build a land bridge and put the word out that there is free everything there and they will all walk there on their own.",
                        "good": "5",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "ikem",
                                "time": "8 May, 2019",
                                "context": "if they choose to go on their own then that is on them.",
                                "good": "1",
                                "bad": "0",
                                "replies": []
                            },
                            {
                                "user_name": "thereyagoagain",
                                "time": "8 May, 2019",
                                "context": "Hell tell them all that the exclusion zone is a \"sanctuary Nation\"",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "ikem",
                "time": "8 May, 2019",
                "context": "comments like that are what liberals look for and exploit.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "thereyagoagain",
                        "time": "8 May, 2019",
                        "context": "And my comment was not funny either....just accurate.",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "error": "error"
    },
    {
        "error": "error"
    },
    {
        "user_name": "TrollhaterNumber1",
        "time": "8 May, 2019",
        "context": "Al Gore invented Radiation",
        "good": "15",
        "bad": "0",
        "replies": [
            {
                "error": "error"
            }
        ]
    },
    {
        "error": "error"
    },
    {
        "user_name": "Listenup25",
        "time": "8 May, 2019",
        "context": "Putin told Trump Chernobyl was fake news, Trump says he believes him.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "CharlesMartel07",
                "time": "8 May, 2019",
                "context": "The gullible calling others gullible. Amusing.",
                "good": "15",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "too_old",
        "time": "8 May, 2019",
        "context": "It's those 10 Ft squirrels you really have to watch our for.",
        "good": "3",
        "bad": "0",
        "replies": [
            {
                "user_name": "3manfan730",
                "time": "8 May, 2019",
                "context": "Man-Bear-Pig",
                "good": "7",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "thereyagoagain",
                        "time": "8 May, 2019",
                        "context": "A Wookalar!",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "thereyagoagain",
                "time": "8 May, 2019",
                "context": "It will bite your head off man.",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "thereyagoagain",
                "time": "8 May, 2019",
                "context": "He'll do you!",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "guitarz6",
                "time": "8 May, 2019",
                "context": "Not to mention the Killer Rabbits.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "too_old",
                        "time": "8 May, 2019",
                        "context": "Loved that movie. But hated how it made us drive in teenagers look. Deputy \"There is a herd of Giant Killer rabbits heading this way\" Teenagers \"Ok deputy\"",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "davewilcox",
        "time": "9 May, 2019",
        "context": "This would be a great place for Pelosi to mix up her evil brews for president Trump.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "karek40",
                "time": "9 May, 2019",
                "context": "Or the makeup to make her look young.",
                "good": "14",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "Cornbeef",
                        "time": "9 May, 2019",
                        "context": "As long as she applies it with a belt sander",
                        "good": "7",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "GreenSeahorse",
                                "time": "9 May, 2019",
                                "context": "30 coarse might work?",
                                "good": "7",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "devildog84",
        "time": "9 May, 2019",
        "context": "Homer Simpson would have never let this happen.  Doh !",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "MAGA1350",
        "time": "8 May, 2019",
        "context": "Seems like the perfect vacation spot for the Dems.",
        "good": "17",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Brickobonga",
        "time": "9 May, 2019",
        "context": "That’s a very large oof",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "gargoyle91",
        "time": "8 May, 2019",
        "context": "Welcome to our Future .",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "urmomsbox406",
        "time": "8 May, 2019",
        "context": "Build more nuclear plants in California, New York and Washington.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "LarryLarry",
                "time": "8 May, 2019",
                "context": "NO problem.. but then, while not 100% safe, the ones in the USA are a bit safer. And could be made to even higher standards. Done correctly, they work well and last a long time. \nThe real issue is the spent fuel rods. NiMBY. Can't say as I would blame anyone for fee;ing that way. So, need to figure that out first... just don't mix them in with cat litter....",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "urmomsbox406",
                        "time": "8 May, 2019",
                        "context": "Lots of room in the desert away from people.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "Cerebus",
                        "time": "8 May, 2019",
                        "context": "Use them to build a wall on the southern border.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "johngielisch",
                        "time": "8 May, 2019",
                        "context": "There is still unused fuel in the spent rods. There is no reason I know of other than policy they cannot be re-processed to recover unspent fuel and make new rods. We hava a place in Yucca mountain for long term storage of high level waste.  Use it.",
                        "good": "2",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "Ward82",
                                "time": "8 May, 2019",
                                "context": "They do re-process spent rods for fuel.  This is a large part of the waste management program for nuclear fuel.  They also account for the cost of waste management and take 100% responsibility for it.  No other energy production fields do this.  Nuclear is the most effective and least hazardous means of producing the energy needed by today's society.  And yes, deep underground storage is the most effective and safest means of disposal.",
                                "good": "2",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "johngielisch",
                                        "time": "8 May, 2019",
                                        "context": "Thank you for correcting me on the spent fuel. Yes, I have no issue with nuclear power.",
                                        "good": "1",
                                        "bad": "0",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "Ward82",
                "time": "8 May, 2019",
                "context": "I believe they should replace coal power plants as long as they retrain and utilize the coal plant operators to do it.  Coal miners would suffer, but maybe a retrain and relocation plan to uranium mines would work, IDK.  Nuclear is far more effective and much less hazardous when managed responsibly than any other means.  All of these \"eco-friendly\" methods look green but the production behind them is disastrous.",
                "good": "1",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "urmomsbox406",
                        "time": "8 May, 2019",
                        "context": "I have no problem with coal at all.  All these green people trying to limit the US don’t realize that we are not the problem.  The problem is China and India and the like.   If you were in LA in the late 70s you know how bad the air can be, look at it now and there is no comparison.  Stop punishing the US.",
                        "good": "3",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "Ward82",
                                "time": "8 May, 2019",
                                "context": "I personally do not have an issue with coal.  I am simply stating that nuclear is more cost effective, efficient, and safer than any other current means of energy production.  I enjoy spending my money elsewhere.",
                                "good": "0",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "urmomsbox406",
                                        "time": "8 May, 2019",
                                        "context": "👍🏿",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": []
                                    }
                                ]
                            },
                            {
                                "user_name": "AguaBonita",
                                "time": "8 May, 2019",
                                "context": "The US is part of the problem along with China and India.",
                                "good": "0",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "urmomsbox406",
                                        "time": "8 May, 2019",
                                        "context": "No its not.",
                                        "good": "2",
                                        "bad": "0",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "diehardconservative",
                "time": "8 May, 2019",
                "context": "And Hawaii",
                "good": "1",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "urmomsbox406",
                        "time": "8 May, 2019",
                        "context": "👍🏿",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "AguaBonita",
                "time": "8 May, 2019",
                "context": "Yes, it is. In terms of total annual CO2 emissions, China is #1, the US is #2, and India is #3.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "memberliberty",
        "time": "9 May, 2019",
        "context": "Read the survey, basically they found that the current levels of contamination are not \"evenly distributed.\" Most areas are totally fit for human habitation, though \"elevated above that of most natural sites.\"\n\nThe most contaminated area is an old spent fuel warehouse where \"exposure for just a few hours would dose a person with as much radiation as is normally absorbed over an entire year.\"\n\nThe average yearly exposure for a person from natural sources is about 700 millirem, so the site maxes out at 200ish millrem per hour. The maximum dose allowed by our government is 5 rem (5000 millirem) per year, which is so low there is no detectable risk, so one could tour the most contaminated parts of the area for over 24 hours without risk.\n\nInteresting study.",
        "good": "3",
        "bad": "0",
        "replies": [
            {
                "user_name": "GreenSeahorse",
                "time": "9 May, 2019",
                "context": "I will past Thanks though\nNot on my bucket list.",
                "good": "3",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "Chief117",
        "time": "8 May, 2019",
        "context": "No kidding.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Magnum8",
        "time": "9 May, 2019",
        "context": "Perfect place to house our illegal immigrants while they wait 9 years for their asylum cases to be heard",
        "good": "30",
        "bad": "1",
        "replies": [
            {
                "user_name": "Liberals_Byte",
                "time": "9 May, 2019",
                "context": "You win the Internet Comments Award of the Year!",
                "good": "4",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "rosco714",
        "time": "8 May, 2019",
        "context": "Whatta mess......ever seen those weird looking creatures living there now?",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "herbmeister",
        "time": "9 May, 2019",
        "context": "NONSENSE! Nuclear energy is the safe alternative to fossil fuels.  We need to concern ourselves with cow farts, skyscrapers and plastic straws if we're going to save the world.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tenbags",
        "time": "8 May, 2019",
        "context": "When asked for comment about this AOC replied....\"Yes I think Cher is very noble and a good democrat too\"",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "Ilaugh@libs",
        "time": "9 May, 2019",
        "context": "Now that is a great place for solar panels.",
        "good": "7",
        "bad": "0",
        "replies": [
            {
                "user_name": "GreenSeahorse",
                "time": "9 May, 2019",
                "context": "No the panels are reverse\nSo it catching the Ray's from the radiation 😉",
                "good": "7",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "error": "error"
    },
    {
        "user_name": "Jonathan585",
        "time": "8 May, 2019",
        "context": "When America is down by natural disasters, Russia will nuke California Washington Florida and N.Y. Accept Jesus repent forgive",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Bloodtrail23",
        "time": "9 May, 2019",
        "context": "make it the new congressional chamber.",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "SecureSborder",
        "time": "8 May, 2019",
        "context": "solar panels at the site? wth?",
        "good": "4",
        "bad": "0",
        "replies": [
            {
                "user_name": "RedRadio",
                "time": "9 May, 2019",
                "context": "who went and tied them in to the grid, those guys have to glow",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "gallowspoll",
        "time": "8 May, 2019",
        "context": "And this was just one nuclear reactor. Political party affiliation doesn't matter here. Mankind better wake the up. Hope I'm not here when the hits the fan.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "oregonusmaximus821",
                "time": "8 May, 2019",
                "context": "One nuclear reactor built with shoddy Soviet technology and \"safety\" protocols.",
                "good": "17",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "karek40",
                        "time": "9 May, 2019",
                        "context": "When the big world wide quake occurs safety protocols will not matter",
                        "good": "4",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "Brickobonga",
                                "time": "9 May, 2019",
                                "context": "That’s only if a asteroid hit earth and generated a 11 magnitude earthquake.",
                                "good": "1",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "lazer67",
                "time": "9 May, 2019",
                "context": "Oh no.  Political party affiliation Does Matter.  These were life long Communists that were responsible for this disaster.",
                "good": "5",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "gallowspoll",
                        "time": "9 May, 2019",
                        "context": "Missed my point. No big deal",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "Chief117",
        "time": "8 May, 2019",
        "context": "Nuclear power plants are extremely clean. The only reason that this plant fail was because the workers were not paid enough to care. That's communism for you.",
        "good": "22",
        "bad": "2",
        "replies": [
            {
                "user_name": "Sprinksavior612",
                "time": "9 May, 2019",
                "context": "Not clean really. What do you do with spent fuel rods? That’s my issue. Still got hot fuel rods and heavy water.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "NuclearBoy69",
                        "time": "9 May, 2019",
                        "context": "We already know what to do with spent fuel rods. Even if no legislation is ever passed for reprocessing the fuel or a permanent storage location, they can sit in the lots on plants in their concrete housing and pose zero risk to anyone at all. And there is essentially zero heavy water, considering almost every plant in the US is a light water reactor.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "douloschristos",
        "time": "9 May, 2019",
        "context": "The fruits of communism.",
        "good": "23",
        "bad": "1",
        "replies": [
            {
                "user_name": "TY'S",
                "time": "9 May, 2019",
                "context": "That is what AOC and company wants for the US",
                "good": "9",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "error": "error"
    },
    {
        "user_name": "nodammit",
        "time": "9 May, 2019",
        "context": "Ah those fun loving Russians such a great asset to this world.",
        "good": "12",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "CryMo",
        "time": "8 May, 2019",
        "context": "Third Trumpet in Revelation?  Chernobyl's direct translation from Ukranian is Wormwood.  Star=Nuclear, poisoned the waters.. etc etc..  Makes sense to me.  There is also a memorial there of an angel blowing a trumpet called the star of wormwood memorial..  Seems the whole world aknowledges this reality..",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "Hiding",
                "time": "9 May, 2019",
                "context": "Yes, the world is going to end in your lifetime! Forget all the other Christians who thought the same thing every generation - you are the one to finally experience it! Quick, sell all your stuff and live pure!",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "CryMo",
                "time": "9 May, 2019",
                "context": "Only a willfully ignorant troll would respond to my post like that.  Everything I stated was complete fact, yet you mock..  The bible talks about people like you..  Good luck with that my friend..",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "egagrickneprac",
        "time": "14 May, 2019",
        "context": "The lack of nightmarish man-eating mutant creatures emerging from Chernobyl is a grave disappointment.",
        "good": "6",
        "bad": "0",
        "replies": [
            {
                "user_name": "ThisGuyLovesAmerica",
                "time": "11 July, 2019",
                "context": "So. Much. This.",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "error": "error"
            }
        ]
    },
    {
        "user_name": "rockyballbuster418",
        "time": "9 May, 2019",
        "context": "There was a lack  of feedback of operating experience and the inadequacy of communication between designers, engineers, manufacturers, constructors, operators and regulators. These deficiencies, coupled with a lack of clear lines of responsibility, were critical factors in the events leading up to the Chernobyl accident.",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "ThisGuyLovesAmerica",
                "time": "11 July, 2019",
                "context": "In fairness to the workers at the nuclear facility, the USSR was basically run by Bernie Sanders and AOC for 70 years. Competence was virtually nonexistent.",
                "good": "6",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "failedtobanme",
        "time": "11 May, 2019",
        "context": "I know all of the radiation hotspots. I played that Call of Duty 4 mission a million times.",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "johnde43",
        "time": "9 May, 2019",
        "context": "FOX. Why in the hell do you show videos that play themselves with load narration that don't pertain to the article sometimes and when they do pertain to the article you put the caption in front of the video so you can't see it? So what is the sense in having videos?",
        "good": "46",
        "bad": "0",
        "replies": [
            {
                "user_name": "alioli49422",
                "time": "9 May, 2019",
                "context": "Is Fox, under new management, trying to chase away clientele? Trying to make people think less of a news worthy platform? I wonder.",
                "good": "4",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "joecrowe77",
        "time": "9 May, 2019",
        "context": "Chernobyl is plenty safe place for the proponents of nuclear power to live. They shouldn't take any women as the children might not be normal.",
        "good": "1",
        "bad": "8",
        "replies": [
            {
                "user_name": "Vandikar1",
                "time": "9 May, 2019",
                "context": "I'm a proponent of nuclear power.  Its the cleanest energy on earth.\n\nChernobyl was about the worst application of nuclear power ever designed.  \n\nYou should not blame proven science for bad engineering.",
                "good": "33",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "joecrowe77",
                        "time": "9 May, 2019",
                        "context": "Since you believe that nuclear power is safe, can they store the spent rods in your back yard. You could save money on electricity for your night lights.",
                        "good": "0",
                        "bad": "1",
                        "replies": [
                            {
                                "user_name": "NuclearBoy69",
                                "time": "9 May, 2019",
                                "context": "Spent rods housed in concrete will expose you to less radiation than walking your dog on a sunny day.",
                                "good": "0",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "joecrowe77",
                                        "time": "9 May, 2019",
                                        "context": "Why waste money on concrete, and storing them in caves, when you can store them in the garage of a nuclear power fanatic. Most supporters, and nuclear plant engineers, refuse to live, with their families, outside the front gate of a plant.\nOn March 28, 1979, Three Mile Island received a 5 of 7. Did you celebrate or cuss the engineers?.",
                                        "good": "0",
                                        "bad": "1",
                                        "replies": [
                                            {
                                                "user_name": "NuclearBoy69",
                                                "time": "9 May, 2019",
                                                "context": "I am one of the engineers and I lived right next to the plant I worked at.  In fact, 400 others who worked there lived there too, and a thriving community of people who had cheap electricity and clean air, along with a boosted economy thanks to the plant.  And I'd love for you to lecture me on Three Mile Island.  Do tell me what you know about pressurized water reactors and their various safety systems, and why they failed that day.  And while you're at it can you explain the safety systems that didn't fail and contained the melted reactor core inside of the vessel and helped contribute to the astronomical number of zero deaths or injuries?",
                                                "good": "1",
                                                "bad": "0",
                                                "replies": [
                                                    {
                                                        "user_name": "joecrowe77",
                                                        "time": "11 May, 2019",
                                                        "context": "Were you an engineer that designed and built the nuclear power plant or did just take someone else's word that every weld was perfect and move in. You can build in back up  security systems but not back up welds?\nInadequate training and human factors led to mechanical failure at Three Mile Island.\nNature finally got to the Fukushima plant. Plant water is still flowing into ocean and killing, or mutating all that it touches after 7 years. Fukushima plant has a long list of incidents and accidents as well as lying about them.\nAnd then there was Chernobyl. All the humans couldn't control theirs and the mechanical failures. Along with, Fukushima, Chernobyl was a level 7 event. Would you like to attend one of these events? There were people who died to be there.",
                                                        "good": "0",
                                                        "bad": "0",
                                                        "replies": []
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            },
                            {
                                "user_name": "jerryjanacek",
                                "time": "11 May, 2019",
                                "context": "What power generation method do you recommend? We're just learning about the tangential effects of wind, solar, etc.",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "Liberals_Byte",
                "time": "9 May, 2019",
                "context": "I bet you believe that climate change is caused by not enough democrats running the country too!",
                "good": "18",
                "bad": "0",
                "replies": []
            },
            {
                "error": "error"
            }
        ]
    },
    {
        "user_name": "Lbrentj",
        "time": "9 May, 2019",
        "context": "Fukushima is worse",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "edwordo",
                "time": "9 May, 2019",
                "context": "You're right, and the worst part about Fukushima is that unlike Chernobyl, the failure wasn't caused by design and engineering incompetence. Instead, it serves as a reminder that no matter how well-conceived a nuclear plant design may be, nature can cause it to fail.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "Hiding",
                        "time": "9 May, 2019",
                        "context": "That's a bit of an oversimplification. The design had numerous flaws, all pointed out years before the disaster. Additionally, massive human errors enabled Fukushima: the plant manager wasn't allowed to flood the reactors - Tepco was trying to salvage the plant for future use. Eventually the manager simply disobeyed and flooded them anyways, but that was too late.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "edwordo",
                                "time": "9 May, 2019",
                                "context": "Japanese nuclear plant regulation is exceptionally stringent, and the design flaws only became apparent after the event, or they would have been exposed and corrected. Japan is not some corrupt third-world country where something that would endanger the public could be swept under the table. In essence,  an earthquake followed by a tsunami was not a realistic scenario that anyone could have foreseen. GE engineers certified that plant as operationally sound numerous times. Tepco didn't  flood the reactor because they were legitimately afraid of an explosion and further release of radioactive gas into the atmosphere.",
                                "good": "0",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "Hiding",
                                        "time": "9 May, 2019",
                                        "context": "The reactor was deemed to have engineering flaws years before the disaster. Engineers were arguing to stop building reactors like this, shut these ones down and build safer ones. And, yeah, Japan's not a third world country, but it has a lot of corruption at the highest levels. Tepco is one of the worst offenders: they release radioactive water they're supposed to be storing whenever it storms near the reactors, claiming it leaked out, and releasing false data, pretending the leaks are small - only for details to emerge later than massive tons of radioactive water was released.\n\nTepco refused to flood the chambers because saltwater would irrevocably damage them. The plant manager was practically begging them to let him - thankfully, he went ahead and flooded them regardless, but sadly too late.\n\nAfter the disaster, the Governor of Tokyo stormed the HQ of Tepco and yelled at the CEO for 3 hours. The company has subsequently been nationalized, removing it from the hands of corrupt investors. So, yeah, it was partially a manmade disaster and Tepco executives bear the blame.",
                                        "good": "5",
                                        "bad": "0",
                                        "replies": []
                                    },
                                    {
                                        "user_name": "Hiding",
                                        "time": "9 May, 2019",
                                        "context": "Here are some quotes for you:\n\n\"It is a matter of record that in \n2002 TEPCO admitted to falsifying the results of safety tests on reactor one’s containment vessel. In previous decades, the company had doctored reactor shroud safety records. In \n2003, TEPCO prohibited inspectors from visiting reactors and later acknowledged that it systematically covered-up inspection data that showed cracks in reactors. Following a relatively small earthquake in \n2007, a fire ensued at another nuclear plant, and TEPCO masked the fact that hundreds of gallons of radioactive water leaked out.\"",
                                        "good": "3",
                                        "bad": "0",
                                        "replies": []
                                    },
                                    {
                                        "user_name": "Hiding",
                                        "time": "9 May, 2019",
                                        "context": "and, \"Regulatory Failure: The Fukushima Daiichi nuclear plant crisis is exposing the extent to which Japan’s powerful nuclear industry has been subject to lax oversight, or worse. For starters, the effectiveness of the regulator comes into question in light of TEPCO’s history of deceit. In assessing governance in the industry, it would be unfair to single out only one company, when the entire industry was not subject to proper oversight.\n\nIn 2007, Japan’s government and power industry were warned that plants like Fukushima Daiichi were not built to withstand major earthquakes. Between 2005 and 2007, atomic power plants in Onagawa, Shika, Kashiwazaki-Kariwa and Kushiwazaki were affected by tremors beyond those which they were built to withstand. Since the 1970s, safety inspectors at the \nU.S. Atomic Energy Commission (AEC) have warned that General Electric reactors, the type employed in Fukushima Daiichi, were vulnerable to explosions and radiation release if a meltdown occurred. Yet to date, no actions had been taken by the Japanese government to modify nuclear plant standards.\n\nLax oversight of existing regulations is also to blame. In \n2004, five workers were killed at a nuclear plant when superheated steam punctured a pipe. It was later discovered that the pipe had not been inspected in 28 years. In 2007, the Nuclear and Industrial Safety Agency (NISA) forced companies to reveal unreported safety breaches. Ultimately, seven out of 12 public utilities admitted to falsifying",
                                        "good": "3",
                                        "bad": "0",
                                        "replies": []
                                    },
                                    {
                                        "user_name": "BigDongKonger34",
                                        "time": "9 May, 2019",
                                        "context": "Impressive response.  Thanks for the info and explanation.",
                                        "good": "4",
                                        "bad": "0",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "user_name": "USN:78-82",
                        "time": "9 May, 2019",
                        "context": "You are quite simply wrong. Fukushima had a melt down due to a lack of coolant. A lack of coolant that was due to a poor placement of the emergency power generators. Had the generators not been taken out by the tsunami the reactors may well have survived.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "Sprinksavior612",
                                "time": "9 May, 2019",
                                "context": "Tell me then, how do you place generators that are tsunami proof? In a sealed room with a 500 ft snorkel? I’d like to know",
                                "good": "0",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "Hiding",
                                        "time": "9 May, 2019",
                                        "context": "Not in the basement, lol",
                                        "good": "8",
                                        "bad": "0",
                                        "replies": []
                                    },
                                    {
                                        "user_name": "NuclearBoy69",
                                        "time": "9 May, 2019",
                                        "context": "Most nuclear plants house emergency condensers ABOVE the reactor, with valves that fail OPEN with a loss of power.  This enables a natural pump that doesn't need electricity to operate to cycle out the steam, condense it, and lower the temperature and pressure inside the reactor (good old gravity).  Gravitational recirculation (steam flowing up to condensers, condensed water flowing back down into reactor) inside the reactor keeps it safe until you are able to get auxiliary power to the safety systems that rely on electricity to operate.  \n\nAt Fukushima, these emergency condensers were fed by electric pumps, which are usually powered by the emergency diesel generators.  These generators were the ones that were housed in the rooms that flooded and were inoperable.  The decay heat in the reactor (the fission chain reaction was stopped by the control rods) was unchecked, the water reacted with the zirconium in the fuel rod casing and produced Hydrogen, and the hydrogen ignited causing the explosions. \n\nSo no, you cannot make tsunami proof generators if you house them in the lower levels of the plant, but you can utilize passive safety systems that do not rely on those generators to stop an explosion.",
                                        "good": "2",
                                        "bad": "0",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "user_name": "elenageorge",
                        "time": "9 May, 2019",
                        "context": "Perhaps smaller, naval application style, reactors is a better idea.  Many decades ago, in the aftermath of a hurricane in Hawaii, the US Navy pulled a sub to the pier and powered the island.  Where seismically possible give large to medium-sized cities such a plant to power their electrical needs.  Harden the grid as a whole and shunt excess energy onward to those who need, or simply isolate each city grid fm the next.  In seismically active areas, use Cold War tech of \"rumble rooms\" to protect the plant fm loss of coolant due to earthquake.\n\nNuclear energy is clean and efficient when well designed and properly run/managed.  It cannot be done \"on the cheap.\"",
                        "good": "5",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "edwordo",
                        "time": "9 May, 2019",
                        "context": "Again, the response is typical 20/20 hindsight that' happens because when something horrible happens, there has to be a scapegoat. as someone pointed out, the tsunami took out the generators, which kept the coolant from circulating properly. The Japanese government and other investigative bodies long ago concluded that the Fukushima nuclear accident was caused by the tsunami, and the resulting loss of seawater pumps and all electrical power, not reactor design. GE certified that the generators, reactors and turbines were working properly at the time of the event. This is like looking a 9/11 and blaming the airlines for not putting re enforced cockpit doors in the airplanes.  Tepco was virtually strong armed into making an admission of guilt. No reasonable person would have foreseen an earthquake followed by a tsunami. And that's the problem with nuclear power. There's another unforeseen disaster waiting out there, and when it happens, the scapegoating process will begin all over again.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "Hiding",
                                "time": "10 May, 2019",
                                "context": "Nope.",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "Vandikar1",
                "time": "9 May, 2019",
                "context": "Always remember though to keep that catastrophe in perspective.\n\nNumber of people killed by the Tsunami:  20,000\nNumber of people killed by Radiation leak at Fukashuma:  0",
                "good": "4",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "Hiding",
                        "time": "9 May, 2019",
                        "context": "The top 3 execs at Tepco were charged with crimes that led to the deaths of many people. So Japanese prosecutors claim that the reactor meltdown killed people.",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "rockyballbuster418",
                "time": "9 May, 2019",
                "context": "The generators that were to provide coolant pumps their power in an emergency were fed by fuel tanks that floated and were damaged during the tsunami.  That was accounted for in the hazard analysis when developing their hazard controls for a flooding event.  \n\nThe Soviet system was flawed to the \"core\".  Their designs, construction, commissioning, operations and maintenance were not robust.  They also didn't share lessons learned from past events and accidents (which there were many) for fear of public or international scrutiny of their nuclear program.  As a result, they didn't learn and adapt to prevent the same or worse accidents.  Google: IAEA Chernobyl Report.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "error": "error"
    }
]