[
    {
        "error": "error"
    },
    {
        "user_name": "PMST33",
        "time": "9 May, 2021",
        "context": "Pipe down nasa.\nYou’re not in charge of the world.\nFurthermore, how are you even allowed to operate, as the US is bankrupt?",
        "good": "8",
        "bad": "47",
        "replies": []
    },
    {
        "user_name": "my10screennames",
        "time": "9 May, 2021",
        "context": "Great reporting.  So exactly where did it land?",
        "good": "2",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "sherlockhomeless169",
        "time": "9 May, 2021",
        "context": "I guess now that no one got killed by flying Chinese space trash, Fox is allowing comments on the story.",
        "good": "8",
        "bad": "45",
        "replies": []
    },
    {
        "user_name": "cdsmith11035",
        "time": "9 May, 2021",
        "context": "Like China cares what NASA has to say.",
        "good": "79",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "thecomingapocalypse",
        "time": "9 May, 2021",
        "context": "\"China plans 10 more launches to carry additional parts of the space station into orbit.\"\n\nTen more chances to kill someone.  So that's nice.",
        "good": "93",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "blazerswampthing",
        "time": "9 May, 2021",
        "context": "Chinas space program is still less dangerous than the Biden administration.",
        "good": "690",
        "bad": "17",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "tomx2",
        "time": "9 May, 2021",
        "context": "Meh.....why do the CHIComs need to be concerned or worried when they have a \"fiend\" in the White House?",
        "good": "105",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "kenndog",
        "time": "9 May, 2021",
        "context": "Biden's going to send the new Space Cadets after them.",
        "good": "41",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "tomx2",
        "time": "9 May, 2021",
        "context": "Kamela has been playing hardballs with Mexico/Central America on \"illegal reentry\".  Send Kamela to the CHIComs and talk about their illegal reentry.",
        "good": "11",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "rolaxride",
        "time": "9 May, 2021",
        "context": "While Biden congratulated the Communist Chinese for another successful rocket launch",
        "good": "23",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "papamonkeydaddy566",
        "time": "9 May, 2021",
        "context": "nelson is a weak coward china will do what they want and continue to do what they want, if they want to bring in sand make an island and put a runway on it they do it they don't have to ask nor do they care about the opinions of china's slave nation America",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "socal3102",
        "time": "9 May, 2021",
        "context": "China’ rocket debris falling somewhere on the world, Oh my! China’s virus being spread all over the world, Oh my! China lecturing the U.S. regarding the racism in America, OhMy! Joe Biden’s administration not reacting to what China is doing to the world, NO SURPRISE!",
        "good": "38",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "anotherwinner",
        "time": "9 May, 2021",
        "context": "China's been trashing the planet for decades but Biden let's them off the hook yet again with the Paris Accord.",
        "good": "458",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "rhett2019",
        "time": "9 May, 2021",
        "context": "More people got killed by Dems in Chicago last night than by any Chinese rocket.",
        "good": "42",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "chrisp1971",
        "time": "9 May, 2021",
        "context": "It came from a bat",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Gorillalaker",
        "time": "9 May, 2021",
        "context": "China made a big mistake. They didn't steal enough rocket reentry technology. Not to worry, time is on their side.",
        "good": "1.2K",
        "bad": "17",
        "replies": []
    },
    {
        "user_name": "gunsnguitars",
        "time": "9 May, 2021",
        "context": "I'm still waiting for severe retaliation against the CCP for the Wuhan virus.",
        "good": "32",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Conservamerican1",
        "time": "9 May, 2021",
        "context": "China pollutes everything they touch. They pollute our oceans with plastic, over fish our oceans throughout our world, they pollute the air and now they are fouling space with wild abandon. This isn't their first time. Several years ago they lost control of a satellite and decided to just blow it up in space. They are the most destructive race on earth.",
        "good": "224",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "memongo",
        "time": "9 May, 2021",
        "context": "I guess China hasn't quite managed to steal the intellectual property of missile guidance yet.",
        "good": "136",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "OilersSpill1199",
        "time": "9 May, 2021",
        "context": "Next thing you know China will release a deadly virus",
        "good": "22",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Vengence486",
        "time": "9 May, 2021",
        "context": "Yeah, nasa and the United States are not in charge of the world anymore. ",
        "good": "1",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "ac1987",
        "time": "9 May, 2021",
        "context": "It's not surprising that China doesn't care if one of their rockets lands in a populated area and injures or kills someone.  When have they ever shown respect for life?",
        "good": "48",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "metermd00368",
        "time": "9 May, 2021",
        "context": "They gave us Covid---.   Do we really think they care where their rockets land ?",
        "good": "41",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "jack.shapiro",
        "time": "9 May, 2021",
        "context": "\"economists from MIT and Boston College estimate that robots could replace 2 million workers in manufacturing by 2025. That could mean about 400,000 jobs displaced each year.\"                                   Excellent news. trumpers are being replaced with Robots and AI at record pace. trumpers are irrelevant to our economic future.",
        "good": "0",
        "bad": "28",
        "replies": []
    },
    {
        "user_name": "Mr.Wonderful505",
        "time": "9 May, 2021",
        "context": "Was hoping for Wuhan instead of water.",
        "good": "26",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jeffsims660",
        "time": "9 May, 2021",
        "context": "And....we should expect more of the Chinese WHY?",
        "good": "15",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ArtilleryOfficer",
        "time": "9 May, 2021",
        "context": "Debris landed? Nice...",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "gold",
        "time": "9 May, 2021",
        "context": "Looks like china translated the stolen technical plans incorrectly or \nsomeone here purposely put in the incorrect data to cause the chinese to have a failure.",
        "good": "23",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "govtoverreach140",
        "time": "9 May, 2021",
        "context": "Crickets from the White House. Hmm....",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "harrisontweed",
        "time": "9 May, 2021",
        "context": "The Chinese sure know how to make a splash.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mazchaz",
        "time": "9 May, 2021",
        "context": "Biden:  China,  for my next payment, let's go back to the wire transfers  !",
        "good": "27",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "LetRride",
        "time": "9 May, 2021",
        "context": "Oh, a sternly worded letter from NASA is going to stop them.",
        "good": "15",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "survivingpnw",
        "time": "9 May, 2021",
        "context": "\"It is clear that China is failing to meet responsible standards regarding their space debris,\"\n\nAnyone surprised?  Almost 4M dead worldwide from Covid19. Anyone ever hear an apology from China? I didn't think so...",
        "good": "458",
        "bad": "7",
        "replies": []
    },
    {
        "user_name": "FJB!",
        "time": "9 May, 2021",
        "context": "Meh, if it landed on americans so what?  what's Joe Biden going to do? start a war? Bwhahahahaha!\n\n-China",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "🅼🆁.🅱🅾🅾🅼🅱🅰🆂🆃🅸🅲",
        "time": "9 May, 2021",
        "context": "After doing some yardwork yesterday I sat down and had a cold beer.\nThe day was quite beautiful, and my drink facilitated some deep thinking.\nMy wife walked by and asked what I was doing. I said, \"Nothing.\"\nNow the reason I said \"nothing\" instead of saying \"just thinking\" is because she then would have asked, \"Thinking about what?\"\nAt that point I would have had to explain that men are deep thinkers about various topics, which would lead to other questions. She left me alone.\nAfter another beer I pondered the age old question:\nWhat is more painful, giving birth or getting kicked in the nuts?\nWomen always maintain that giving birth is way more painful than a guy getting kicked in the nuts, but how could they know?\nWell, after another beer or two, and some more heavy deductive thinking, I have come up with the answer to that question.\nGetting kicked in the nuts is more painful than having a baby. Even though I obviously couldn't really know, here is the reason for my conclusion:\nA year or so after giving birth, a woman will often say, \"It might be nice to have another child.\"\nI have never heard a guy say, \"You know, I think I would like another kick in the nuts.\"\nI rest my case.\nTime for another beer.",
        "good": "1.5K",
        "bad": "156",
        "replies": []
    },
    {
        "user_name": "rogee54",
        "time": "9 May, 2021",
        "context": "China could care less what we think. We can't even control our own streets.",
        "good": "53",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "billlandrens",
        "time": "9 May, 2021",
        "context": "Red China doing what Red China does.  Ignoring the safety of the rest of the world for their own selfish interests.",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "GreenCoffee",
        "time": "9 May, 2021",
        "context": "10 more launches. With 70% of earth covered by oceans this means a truly random re-entry of Chinese space junk will hit a sovereign countries  land 3 out of 10 launches. Great - like the pandemic they gave the world is not enough trouble.",
        "good": "61",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "pepper2001",
        "time": "9 May, 2021",
        "context": "This is the result of China stealing technology and not knowing how to use it.",
        "good": "20",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "LiveFreeorDieNH",
        "time": "9 May, 2021",
        "context": "Want to hit China where it hurts? Stop shopping at their warehouses: Walmart and Amazon.",
        "good": "25",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "hotwire",
        "time": "9 May, 2021",
        "context": "Pretty callused of China to have tons of space junk come crashing down with no known or given trajectory. Basically, China is playing Russian Roulette with the world. Well, they don't care, they purposely released a bioweapon on the world just to see the results. What kills me is the WHO let them do it.",
        "good": "70",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "Vengence486",
        "time": "9 May, 2021",
        "context": "Yeah, nasa and the United States can't go after the rest of the world so they attack their own people now! ",
        "good": "3",
        "bad": "6",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "dbme067",
        "time": "9 May, 2021",
        "context": "Joe Biden and Kamala Harris (whichever one of them is in charge) will issue an executive memo mandating that the USA send them $50,000,000,000 per year to be used entirely at their discretion to fix their space program and stop sending space junk into orbit, and the standard phrase \"For World Peace\" has been replaced with, \"Because It's Racist\".",
        "good": "13",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "CyanTurtle",
        "time": "9 May, 2021",
        "context": "The Chinese know exactly what they're doing. \nThey send a virus to kill people so they can sell more product and democrats follow along and defend them.",
        "good": "31",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "TankerIP",
        "time": "9 May, 2021",
        "context": "Wouldn’t it be funny if the thing landed on NBA headquarters! How would they spin that?",
        "good": "22",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "mdtrot",
        "time": "9 May, 2021",
        "context": "Well, what did you expect from a country that intentionally spawned a global viral pandemic?",
        "good": "40",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "chinapays1socialcreditperpost",
        "time": "9 May, 2021",
        "context": "\"It is clear that China is failing to meet responsible standards regarding their space debris.\"\n\nIt's clear China is failing to meet responsible standards regarding just about everything and communist-friendly progressives worldwide are more than happy to look the other way while pointing the finger at everyone else.",
        "good": "102",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "Bareknuckles!🦾",
        "time": "9 May, 2021",
        "context": "Biden’s idea of space program is social distancing",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "denzelle",
        "time": "9 May, 2021",
        "context": "I was hoping it would land on Wuhan.  Oh, well...",
        "good": "13",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "PurpleBottleOpener",
        "time": "9 May, 2021",
        "context": "Oh, a harshly worded letter. China is shaking.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Freedom!667",
        "time": "9 May, 2021",
        "context": "With China Joe and Ho in charge , they are running our country . Don’t expect any questions answered from anyone .  \nIt helps me a little just knowing I did not vote for these idiots , but it is sad .....",
        "good": "21",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "BuenosNachos",
        "time": "9 May, 2021",
        "context": "Never forget that Bill Clinton and Bernard Swartz<sp?> gave China our missile guidance technologies without being approved by Congress.",
        "good": "17",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "davegreen50",
        "time": "9 May, 2021",
        "context": "Sigh of relief. From pretty much everyone except the news media. They are secretly crying at the lack of a story. Not quite as bad as Geraldo's famous Al Capone fiasco, but along the same line.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "JustaGuy145",
        "time": "9 May, 2021",
        "context": "Not to worry. Joe's Infrastructure plan no doubt includes billions for China's space program....",
        "good": "211",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "shelbylovesglocks",
        "time": "9 May, 2021",
        "context": "China doesn't create technology they steal and copy it.  If they need better tracking and reentry technology we're going to have to wait until they're able to steal it.  Perhaps Beijing Biden will  give it to them as a thank you for killing us all with the China virus.",
        "good": "40",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "hughfarnham",
        "time": "9 May, 2021",
        "context": "Expecting China to act responsibly would be like expecting competency from the Biden administration. It's not going to happen.",
        "good": "1.6K",
        "bad": "40",
        "replies": []
    },
    {
        "user_name": "Chinese_Maniac",
        "time": "9 May, 2021",
        "context": "Because NASA has fallen behind China; that's how you fail your responsible standards lol.",
        "good": "1",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "eileenwright2262",
        "time": "9 May, 2021",
        "context": "The Chinese should have known where the debris would land. It's not rocket science. Never mind.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "50klikesandbanned",
        "time": "9 May, 2021",
        "context": "Call the Space Force! \n\nSpace force! Do do do, Space Force! We don't know what it does, but sounds coo- Space Force, don't tell people that it's just the Air Force because it's SPACE FOOOOOOOORCE!",
        "good": "2",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "clockwood",
        "time": "9 May, 2021",
        "context": "this is what happens when stuff is 'made in china\"  they only thing China made that lasted was COVID",
        "good": "47",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "joemules",
        "time": "9 May, 2021",
        "context": "I'm shocked to find China lacked responsibility.  Biden will be chastising NASA for their insensitive remarks.",
        "good": "71",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "myopinionisasgoodasyours",
        "time": "9 May, 2021",
        "context": "And China knows nothing will happen as long as the gutless wonder is in the White House.",
        "good": "25",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "pvtwheezy",
        "time": "9 May, 2021",
        "context": "Heavenly Harmony but with unholy chaos on Earth?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Dozer81635",
        "time": "9 May, 2021",
        "context": "Darn, I was hoping for a direct hit on Washington DC...",
        "good": "7",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Blood_on_Dems_Hands",
        "time": "9 May, 2021",
        "context": "Democrats are owned by the Chinese so don’t expect any action from them.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sheriffbing",
        "time": "9 May, 2021",
        "context": "Its a Rocket, not a China Rocket, geeeze. China will soon be blaming the USA and saying it is USA space debris. Yes, its ok to say USA debris, that is acceptable.",
        "good": "3",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "rhett2019",
        "time": "9 May, 2021",
        "context": "China.........\"Mess with us Joe and the 'Big Guy' checks will stop coming.",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Pepi4743",
        "time": "9 May, 2021",
        "context": "China is irresponsible on everything they do.  They don't care about human life ... PERIOD",
        "good": "14",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Dozer81635",
        "time": "9 May, 2021",
        "context": "And what's the feeble fool in the White House gonna do about it? Answer...NOTHING!",
        "good": "13",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "SchoolingLiberals",
        "time": "9 May, 2021",
        "context": "While the world watched and Joe slept, China used the opportunity to hack a major US gas line.",
        "good": "27",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "bornntruecitizen",
        "time": "9 May, 2021",
        "context": "Why it's  shades of TRUMP...everyone gangs up on China just like they did to him. Only problem is America 🇺🇸 deposed it's best asset. these are those consequences. ",
        "good": "51",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "papamonkeydaddy566",
        "time": "9 May, 2021",
        "context": "Fox news story template\n1. Headline about how someone stood up for themselves and took action ( use the word slammed at least 3 times a day ) \n2. cry about how it's not fair or someone broke a rule\n3. find out the person who stood up for themselves is irrelevant and with out power\n4. go to comment second to see thousands of fox listeners cheering on the action as if something happened\n5. republicans pacified by fox news \" job well done says the democrat party\"",
        "good": "3",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "ImOkAsIAm",
        "time": "9 May, 2021",
        "context": "China is an awful nation; however, American has had space debris fall to earth. ",
        "good": "0",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "ops692",
        "time": "9 May, 2021",
        "context": "The entire world should be boycotting China until it stops killing Uighers, stops wet markets, stops creating biological weapons, stops destroying civil rights in Hong Kong, stops its ambition to take over Taiwan, and stops an irresponsible space program.  If the world boycotted for just a few months, we could stop a lot of evil from China.  But the whole idea of a kind, peaceful world--that's just liberal talk for we will never confront evil because it's too hard and we like money and cheap stuff.",
        "good": "17",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "QuitThat",
        "time": "9 May, 2021",
        "context": "Every pair of solid booster rockets and Orange fuel tank from the US shuttle program got dropped into the ocean.  Now you want to get serious about stuff falling from space?",
        "good": "1",
        "bad": "10",
        "replies": []
    },
    {
        "user_name": "Choke-on-it-Liberals",
        "time": "9 May, 2021",
        "context": "This is how China does everything, and we encourage it by massive trade with them",
        "good": "19",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "error": "error"
    },
    {
        "user_name": "vegasbob",
        "time": "9 May, 2021",
        "context": "\" It is unclear why China put the rocket part into space.\"  -  Really? Unclear? It seems China has found another way to threaten the world without a nuclear attack!",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "usa3333",
        "time": "9 May, 2021",
        "context": "So now their sending their COVID into space?",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "thegreatdivide421",
        "time": "9 May, 2021",
        "context": "China is shaking in their boots.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mandevoshkes",
        "time": "9 May, 2021",
        "context": "Next one comes down on the WH",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Ex_Military",
        "time": "9 May, 2021",
        "context": "If it wasn't for the help given to them by U.S. Engineers under the Clinton administration, they would still be struggling to put rockets into space.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "SilenceDogood",
        "time": "9 May, 2021",
        "context": "Since most of the technology used to get the Communist Chinese in space was stolen from us, their failure to steal safety programs to prevent such potential calamities from occurring were very near the bottom of their \"things to steal\" list. That is because they care nothing for human life. They have no humanity, they have the Party. They have no empathy, they have the Party. They have no concern for people and their families, they have the Party. And the ComDems are doing their dead level best to imitate the Communist Chinese???? WHY!!! Unless they too have lost any semblance of respect for human life.........and sadly, that is indeed the case.",
        "good": "16",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "thecomingapocalypse",
        "time": "9 May, 2021",
        "context": "Quite clear from the comments here that China has engaged MANY of its army of troll posters to spin this story.  Fox needs to take action to block comments originating from China.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "ramvarg1973",
        "time": "9 May, 2021",
        "context": "'failing to meet responsible standards' Jesus....did we learn anything from Covid-19? I mean, China meeting responsibilities? That's like going to Chicago and being angry because thugs there are not following the gun laws of the city.",
        "good": "20",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "BlueCupcake",
        "time": "9 May, 2021",
        "context": "And does anyone think China gives a flip?? Nobody is holding them accountable for this, as well as their lack of participation in cleaning their environment, and of course the China virus. Wake up people!",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "americanfirst841",
        "time": "9 May, 2021",
        "context": "China is rogue nation that needs to be boycotted out of existence.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "j.l.friesen",
        "time": "9 May, 2021",
        "context": "I think NASA needs to give China a break.  I don't think NASA understands how hard it is to steal all the intellectual property you need for a complete round trip of a space vehicle.  China is also wondering why the world is concerned with a few fatalities that might happen with re-entry of space junk.  No one seems to be all that upset with them for killing 3.3 million people with a bad bat lab experiment.",
        "good": "66",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "MSgtCal",
        "time": "9 May, 2021",
        "context": "Did you really expect anything else from the Chinese Government?\n\nIf so, you are naive beyond belief. ",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "wuhanviralvideo",
        "time": "9 May, 2021",
        "context": "Stay tuned for more Chinese Roulette after these messages.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "lifetimeban",
        "time": "9 May, 2021",
        "context": "China fails to meet human  standards, so I don't think they care much about spacefaring standards.  China needs to be dealt with but we have an administration that chooses to go to bed with them.",
        "good": "42",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "ChinaVirus",
        "time": "9 May, 2021",
        "context": "Why are they referring Bill Nelson as a \"Senator\".  He is no longer a Senator.  He lost to Rick Scott.  Thank god.",
        "good": "7",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "jayj.jameson",
        "time": "9 May, 2021",
        "context": "Whew, that was a close call. It would have been terrible if Chinese technology landed in America and killed hundreds of thousands. We may have actually had to hold them responsible",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jrcampo251",
        "time": "9 May, 2021",
        "context": "Why is anyone really surprised. Standards and their words mean absolutely nothing. They have lied, cheated and stolen all the way.  When that didnt work they bribed and threatened.  They got what they wanted when Boring Biden and Catfish (No Brain) Harris were appointed to office by the left elite and left media.  To top that they even got the little guy (Hunter) in their pocket, along with the rest of the Biden Clan.",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "fakenewsfnn",
        "time": "9 May, 2021",
        "context": "I call it the CHINA ROCKET because it comes from CHINA.\n\nCNN and Xiden consider this racist.",
        "good": "11",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "ocalastud",
        "time": "9 May, 2021",
        "context": "who cares it was the most exciting thing to happen in the world this week. much more interesting than anything Biden or BLDM related.",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "vppacificocean",
        "time": "9 May, 2021",
        "context": "Hitting a Supertanker would have been within the margin of error.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "wokeuptoday",
        "time": "9 May, 2021",
        "context": "If Trump would have finished his Space Force, this wouldn't have happened.  Another broken promise, sad.",
        "good": "1",
        "bad": "15",
        "replies": []
    },
    {
        "user_name": "HoneyBadger375",
        "time": "9 May, 2021",
        "context": "The Chinese government could care less about any other country.  They are the most dangerous government in the world. Sorry Russia.  ",
        "good": "20",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "MrPoboy",
        "time": "9 May, 2021",
        "context": "That’s ok. I’m sure thy are doing everything they can to prevent climate change...said no one anywhere ",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "en0ughn0w",
        "time": "9 May, 2021",
        "context": "Biden will probably defund NASA, he finds responsibility repulsive.",
        "good": "13",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Joe’sDogHatesHim",
        "time": "9 May, 2021",
        "context": "Incompetent thief yam yams",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "notagrifter",
        "time": "9 May, 2021",
        "context": "China sez, get back to us after you clean up Portland.....Chicago.......SF.........LA.... in other words mind your own beeswax Big Guy. LOLOL",
        "good": "7",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "individualthought",
        "time": "9 May, 2021",
        "context": "Americans love buying cheap goods from these people.  Trade deficit will continue until Americans care.  Right now Americans  do not care.  They care about their savings account more.",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "justrightctr",
        "time": "9 May, 2021",
        "context": "This was a lot of something over nothing.",
        "good": "0",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "xdem",
        "time": "9 May, 2021",
        "context": "Don't make Joe take you out behind the shed, you'll be sorry.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jpen10",
        "time": "9 May, 2021",
        "context": "I was in the USAFSS somewhere a long time ago, doing something, waiting for a Chinese or Soviet rocket/missle to launch. Never saw a Chinese launch. I think we were tasked #3 or #4 for the Chinese.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "bugs77",
        "time": "9 May, 2021",
        "context": "The Paris Accord gives China a pass on polluting the earth, a pass to continue irresponsible behavior related to earth's environment. Given that, why should China expect to take space responsibly?",
        "good": "46",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Sand41",
        "time": "9 May, 2021",
        "context": "China could care less what we think.",
        "good": "16",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "billthor",
        "time": "9 May, 2021",
        "context": "China commits an act of bio terrorism by releasing an engineered virus on the world, with virtually no repercussions. And now we’re up in arms over space debris falling in the desert?",
        "good": "15",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "teepeevee",
        "time": "9 May, 2021",
        "context": "The three biggest threats to the planet:\n1) China\n2) Biden Administration\n3) The Deep State",
        "good": "27",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "QuitThat",
        "time": "9 May, 2021",
        "context": "I seem to remember a US Space Shuttle falling on Texas..... a few years back.",
        "good": "1",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "Jimmytheswift",
        "time": "9 May, 2021",
        "context": "First the China virus now the China rocket. Biden admin says we must wear masks and hard hats. Social distance so only one person gets smashed.",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "redzonedog755",
        "time": "9 May, 2021",
        "context": "Democrats and China planned to have the rocket fall on mar-a-lago but they screwed up again.",
        "good": "7",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "GoodCigarsNeverDie-TheyJustGetReincarnated",
        "time": "9 May, 2021",
        "context": "America will not hold China accountable for killing millions across the globe with their biological warfare weapon gone-wrong, so what makes NASA believe that China will actually care what anyone thinks if their space junk falls on someone's heads!??",
        "good": "20",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "jj778788",
        "time": "9 May, 2021",
        "context": "Get ready, they are going to do this over and over again. China does not care how many people they kill with rockets or virus.",
        "good": "18",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "thepistol907",
        "time": "9 May, 2021",
        "context": "Dims love China and they don't care if China is the world's largest polluter.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "honestgent",
        "time": "9 May, 2021",
        "context": "What virus ?\nWhat 100 foot long space junk ?",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "overmoon",
        "time": "9 May, 2021",
        "context": "China just killed 2 million people with the virus junk , I doubt they would worry about a few more.   I really think the world needs to stop buying their products.  Its odd that the world seems to accept their behavior and they seem to have no remorse.  So NASA is mad , who isn't.",
        "good": "19",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "max65",
        "time": "9 May, 2021",
        "context": "Communism has a long history of killing millions of people in the name of the revolution.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "LovePutin167",
        "time": "9 May, 2021",
        "context": "“NASA is fueling” that’s funny",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "johnw777785",
        "time": "9 May, 2021",
        "context": "NASA needs to be careful, China is Dementia Joe's boss and signs his paychecks",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "CyanCarrot",
        "time": "9 May, 2021",
        "context": "China OWNS the US, they OWN Europe. Get used to it.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "zooma454",
        "time": "9 May, 2021",
        "context": "Still awaiting for the three gorges dam to collapse.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "BetterRedthanBlue",
        "time": "9 May, 2021",
        "context": "The CCP will fire up their massive propaganda machine and have the world believing that the rocket came from one of their wet markets. Either that or frozen food.",
        "good": "16",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bktrider",
        "time": "9 May, 2021",
        "context": "nation's rogue..................................   somes it up",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "gary78",
        "time": "9 May, 2021",
        "context": "China failed to report a virus release from Wuhan that killed millions. Why would they react differently for this rocket?",
        "good": "15",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "deplorableo1",
        "time": "9 May, 2021",
        "context": "Too bad 10% didn't land on the Big Guy.",
        "good": "17",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "widescreen",
        "time": "9 May, 2021",
        "context": "\"The vast majority of items were burned beyond recognition during the reentry process,\" the report said.\n\nKind of like how China said Covid wasn't transmitted person to person. Or how not too many people had died there. Or how their PPE they were \"giving\" other countries was actually good quality.  \n\nI'm starting to think China may not be a very truthful brutal communist regime.",
        "good": "148",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "Clos2000",
        "time": "9 May, 2021",
        "context": "Didn't the U.S. have a lot of debris fall back to Earth when their space shuttles exploded?",
        "good": "1",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "gunvald",
        "time": "9 May, 2021",
        "context": "They should be happy the thing didn't hit them.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "hotrodfordanda$2bill",
        "time": "9 May, 2021",
        "context": "China thinks only of themselves in everything they do. Trump had it right. We need to disengage from this lawless regime.",
        "good": "30",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "Tropikaybay",
        "time": "9 May, 2021",
        "context": "Weak Dumbo Biden letting China do whatever they want.  They say you voted for this. ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "sherrysmith",
        "time": "9 May, 2021",
        "context": "When has China ever met responsible standards?",
        "good": "43",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "oneeskimo",
        "time": "9 May, 2021",
        "context": "Most of that space debris above us ...is ours and its is a hazardous problem.",
        "good": "1",
        "bad": "10",
        "replies": []
    },
    {
        "user_name": "sotiredofsnowflakes!",
        "time": "9 May, 2021",
        "context": "Uh...NASA?  Skylab?\n-Australia-",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "art0fwar1776",
        "time": "9 May, 2021",
        "context": "Looks like China wasn't able to steal the \"landing\" technology.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "error": "error"
    },
    {
        "user_name": "PunkyBrewster667",
        "time": "9 May, 2021",
        "context": "10 more launches? Now we have something to look forward to!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "SSN591",
        "time": "9 May, 2021",
        "context": "I’m sure that China is devastated by NASA’s rebuke.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "innocentbystander229",
        "time": "9 May, 2021",
        "context": "Like China cares what Bill Nelson thinks. As if we didn't already have enough senile old men in high.places.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "happy_one",
        "time": "9 May, 2021",
        "context": "Is anyone really surprised? COVID-19 is the direct result of Communist China failing to meet standards.",
        "good": "22",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "lifetimeban",
        "time": "9 May, 2021",
        "context": "Biden thought the Rockettes were coming",
        "good": "13",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "GreenLeaf",
        "time": "9 May, 2021",
        "context": "China is a ruthless Communist tyrant.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rusty1036",
        "time": "9 May, 2021",
        "context": "Since when is/does China care what the world thinks",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Jheim999",
        "time": "9 May, 2021",
        "context": "FBI, Left were so worried that Russia had secret tapes to hold over trump. Strange that no one in FBI or on the left sounding any alarms about Big Guy Biden receiving payday from CCP  surrogate company. These days are so dangerous. The Democrats in power are fueled by ideology, hate (for Trump, Conservatives, and Christians). and the lust for more power. Doesn't matter if they leave our country in tatters.",
        "good": "44",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Reality✔️",
        "time": "9 May, 2021",
        "context": "And not a peep out Biden on the Chinese rocket fail. Either he’s to oblivious to the situation, spineless or too busy cutting more illegal deals with the Chicoms. Wait, probably all three! Would have been a different message and consequences coming from DC with Trump.",
        "good": "66",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "contessa",
        "time": "9 May, 2021",
        "context": "And China laughs at the soon to be new China....  the late USA. ",
        "good": "13",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bktrider",
        "time": "9 May, 2021",
        "context": "and so we expect better from them releasing death and terror on all people including their own?",
        "good": "13",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "just_a_patriot",
        "time": "9 May, 2021",
        "context": "Nobody is fuming at China for \"meeting responsible standards\" at the Wuhan Lab......",
        "good": "23",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "GreenWeights",
        "time": "9 May, 2021",
        "context": "I was hoping it would come down on the large condo that went up, blocking my view of the sunsets over the river.",
        "good": "3",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "williampm",
        "time": "9 May, 2021",
        "context": "We have a new president  ... Its hap-hazard China",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "race:human",
        "time": "9 May, 2021",
        "context": "Love the Chinese people.  But it's time for them to rise up and take out the CCP.",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "paulhoylen",
        "time": "9 May, 2021",
        "context": "Beijing, we have a problem.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "rockfishhiker",
        "time": "9 May, 2021",
        "context": "The rocket was probably filled with vials of the COVID virus to be release in the atmosphere over the US.  China is our enemy.  All Chinese nationals should be ordered to leave the country with 15 days.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "secutor10",
        "time": "9 May, 2021",
        "context": "somewhere out there in the debri, is a tarp and flashlight from the Harbor Freight rocket.",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "RedCloud",
        "time": "9 May, 2021",
        "context": "Washington and Beijing are friends with benefits.\n\nMAGA",
        "good": "15",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "pwilkinson",
        "time": "9 May, 2021",
        "context": "What other \"responsible standards\" are they failing to meet.  The spray deodorant I used that's distributed by a well known American company stuck to my armpits.  I couldn't wash it off even with hot soapy water.  I had to pull pieces of it off with my fingers and then it stuck to my fingers.  God only knows what was in it.  It was made in China.",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tonysofla",
        "time": "9 May, 2021",
        "context": "China is building their own space station, the international space station is old and smell of cheap Russian vodka and cabbage.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tubeguy",
        "time": "9 May, 2021",
        "context": "China now claims we put that rocket debris into space and we are the irresponsible ones.  They're even distributing a heavily doctored video that shows some roundeyes in US military uniform unloading it into orbit to prove we did it.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rats",
        "time": "9 May, 2021",
        "context": "How much longer until the Bjden Administration forces NASA to hand over re-entry programs to China?",
        "good": "9",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Goldmanstein",
        "time": "9 May, 2021",
        "context": "A lot of China bashing here, yet they're smart enough not to have given themselves a 13% problem while their economy powers ahead passing that of the US in purchasing power years ago.",
        "good": "406",
        "bad": "41",
        "replies": []
    },
    {
        "user_name": "bo444444902",
        "time": "9 May, 2021",
        "context": "Uuuuh I’m sure China is intimidated by Sleepy Joe",
        "good": "30",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "baryohai",
        "time": "9 May, 2021",
        "context": "China rocket.  Chine virus.  Just more irresponsible Communist Chinese behavior.",
        "good": "28",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "eeebeee",
        "time": "9 May, 2021",
        "context": "This just in... the Chinese Government has just bought NASA from the Biden Administration.  Case closed.",
        "good": "36",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "jshawmann",
        "time": "9 May, 2021",
        "context": "yeah.... like we believe anything that Washington or Beijing ever says.           lol",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ejanitor944",
        "time": "9 May, 2021",
        "context": "Can you imagine living through the China virus and then getting hit in the back of the head by a Chinese rocket?...who wants neighbors like this.?",
        "good": "10",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "I’mNotDorothy",
        "time": "9 May, 2021",
        "context": "When has china ever done anything responsibly?",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Liberalsgotohell",
        "time": "9 May, 2021",
        "context": "I’m sure it’s Trumps fault. Tune into cnn for the latest!!",
        "good": "26",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "dogjaw988",
        "time": "9 May, 2021",
        "context": "I was rooting for a chunk to hit Labron James.",
        "good": "26",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "cyanvalvespring",
        "time": "9 May, 2021",
        "context": "China doesn’t care. We have spares.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "badtimes151",
        "time": "9 May, 2021",
        "context": "There are much bigger and much more damaging threats currently from China. Not sure why this small thing is making big news.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "patrack194",
        "time": "9 May, 2021",
        "context": "China doesn't care what NASA thinks because Biden is on their side!",
        "good": "22",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "printnamehere",
        "time": "9 May, 2021",
        "context": "Spokesman for the Chinese Space Agency replied to NASA — “No MSG”",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "derichsen",
        "time": "9 May, 2021",
        "context": "Let’s watch the left call everyone racist for calling the rocket a Chinese rocket. Lol",
        "good": "12",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "CyanBottleOpener",
        "time": "9 May, 2021",
        "context": "'It is unclear why China put the rocket part into space.'\nIt's clear to me! They are practicing to launch something over to the US. far worse than covid.\nWuhan lab is working on it right now.",
        "good": "17",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mygod,it'sfullofstars",
        "time": "9 May, 2021",
        "context": "The Chinese are complete irresponsible retards.  Among the least intelligent people on the planet and this rocket is just 1 of 11 they are planning to launch to build their Chinese orbiting spy station.  1 down; 10 more to go, coming to you from the country that visited the China Virus on the World.",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "mikeharmon200",
        "time": "9 May, 2021",
        "context": "Would you rather have a Chinese rocket or BLM/ANTIFA hit your city?",
        "good": "5",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "Biden'sbloodyhands",
        "time": "9 May, 2021",
        "context": "Biden, meanwhile released a statement from the White House: \"Hey, this oatmeal doesn't smell like small children like I ordered.  Take it back and bring me something that smells like 6-year old boys.  Malarkey!\"",
        "good": "4",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "muckus",
        "time": "9 May, 2021",
        "context": "What kind of ego do you have to have to worry about an object with a few 10s/100s of square feet of projected area (depending on how much it breaks up)  hitting you on a surface of a sphere that has a surface area of around 6,000,000,000,000,000 square feet? (Not that it’s truly random)",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "db3",
        "time": "9 May, 2021",
        "context": "Get used to it. China’s building a space station, so every few months this is going to happen. They don’t care about human rights, protecting the environment, intellectual property, or currency manipulation — so they’re not going to care about this. But hey, we can still fill up our houses with cheap stuff from China.",
        "good": "3.3K",
        "bad": "61",
        "replies": []
    },
    {
        "user_name": "OffOn1",
        "time": "9 May, 2021",
        "context": "biden...\" Made In China \"",
        "good": "20",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "bktrider",
        "time": "9 May, 2021",
        "context": "now what?\n\n that China is failing to meet responsible standards regarding their space debris,",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "path0gen",
        "time": "9 May, 2021",
        "context": "China and transparency are two words that should never be used in the same sentence. Just the same as Biden and transparency.",
        "good": "68",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "WasADemo",
        "time": "9 May, 2021",
        "context": "Josef Biden is not going to like you for talking smack about his China.  You will not like Biden when gets mad; after he wakes up.",
        "good": "9",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "ozo11",
        "time": "9 May, 2021",
        "context": "Boycott China if it says made in China put it back on this shelf",
        "good": "16",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "capkjk",
        "time": "9 May, 2021",
        "context": "China, #1 Nation for pollution, #1 for civil rights violations, and #1 in the eyes of the Dementia Joe Political machine.",
        "good": "22",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "derbigd",
        "time": "9 May, 2021",
        "context": "At least it’s not another piece of junk floating around. \nThere is an app called SkyView. It’s pretty cool. Shows you where stars, planets, comets are. \nIt also shows all the debris floating around. Leaving trash laying around in public areas is irresponsible and low class.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "vppacificocean",
        "time": "9 May, 2021",
        "context": "Buy Made in Mexico INSTEAD of Made in China.  Give Mexicans a reason to stay home and cut off cash flow to Communist China",
        "good": "18",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "hcarian",
        "time": "9 May, 2021",
        "context": "If it re-entered just 45 minutes later it would have hit Tampa, FL.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "likefrieswiththat",
        "time": "9 May, 2021",
        "context": "Ooh. China gets 'rebuked'. China no care, round eye.",
        "good": "18",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mizzlara🏴‍☠️",
        "time": "9 May, 2021",
        "context": "\"NASA is fuming\" ??? NASA can fume? Maybe NASA officials? and what about skylab?",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "RockinInTheCLE",
        "time": "9 May, 2021",
        "context": "So I guess there won't be a remake of the old movie \"The Gods Must Be Crazy\"?",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "gardner452",
        "time": "9 May, 2021",
        "context": "Biden will make a statement it’s Trump’s fault.",
        "good": "14",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "coalminer47",
        "time": "9 May, 2021",
        "context": "A rebuke from NASA is more insulting than anything Lunch Bucket Joe could ever say!  China will see it as a peer-to-peer deprecation, while anything Joe would say would be seen as joke espoused by a old man with dementia.  Look at the Alaska meeting.  A stick in the eye on our own soil!",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "SagittariusA*",
        "time": "9 May, 2021",
        "context": "Hey NASA, y’all do great work. That said, you don’t really have any room to talk about space debris. Between NASA and Roscosmos, you’ve both turned the orbit into a giant landfill with debris. ",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "hector25",
        "time": "9 May, 2021",
        "context": "China don't care. They know no one will do anything to them. Their only concern is that it doesn't crash back into China. When are we all going to learn this. Just like Climate change, They don't care if they pollute. they'll sign anything to go along with the world and fooled those western environmentalists and then do the opposite - more coal firing power plants being built, more coal mines opened, more pollution everyday etc.",
        "good": "3.8K",
        "bad": "98",
        "replies": []
    },
    {
        "user_name": "daviddownunder",
        "time": "9 May, 2021",
        "context": "The Chicoms are a bigger threat to world peace than Hitler or Obama ever were. They need to be taken out.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "deepwoods",
        "time": "9 May, 2021",
        "context": "While there is international concern about China's uncontrolled space debris, the United States and NASA have had their own incidents in the past.\nRemember SkyLab in 1979, when chunks of the deorbiting US complex \"accidentally\" hit parts of Australia?",
        "good": "1",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "bktrider",
        "time": "9 May, 2021",
        "context": "ouuuouuuuw.................they are doing bad things\n\n\"It is clear that China is failing to meet responsible standards regarding their space debris,\" NASA Administrator Sen. Bill Nelson said in a statement.\n\nthis is China............................they kill there own people",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "earlofoil",
        "time": "9 May, 2021",
        "context": "The Biden administration lecturing the Chinese is--well-- is like telling the supplier of your consumers goods we are really really mad--",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cpovet",
        "time": "9 May, 2021",
        "context": "The chicoms don’t care about NASA, ethics, international rules or agreements. The chicoms are going to do what the chocolate believe is good for the chicoms and the rest of the world be damned. And it started with a test of biological warfare - the chicom-19 virus",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "chile10001488",
        "time": "9 May, 2021",
        "context": "I hate to be the bearer of bad news but if china can't even figure out how to drop their rocket debris safely, how can anyone believe the space station they are building will maintain a safe orbit and not come crashing down to earth? That's one of the things that happens when a country relies on technology they have stolen rather than learning the science themselves. This is chinese roulette.",
        "good": "221",
        "bad": "8",
        "replies": []
    },
    {
        "user_name": "enclosed",
        "time": "9 May, 2021",
        "context": "WOW such world outrage, just like the China Covid. China must be shaking in their boots.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "victimrites",
        "time": "9 May, 2021",
        "context": "Biden will go into damage control mode to protect China’s interest.",
        "good": "11",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "majormarine",
        "time": "9 May, 2021",
        "context": "Excuse me Mr. Nelson, but China could care less what you have to say.  They own the Biden administration.",
        "good": "14",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "lamontcranstonthethird",
        "time": "9 May, 2021",
        "context": "It's all stolen tech anyway. If China had to rely solely on it's own technology they would be trying to send everything up with bottle rockets.",
        "good": "7",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "ConservativeThinker287",
        "time": "9 May, 2021",
        "context": "you actually expect the Chinese to adhere to rules?",
        "good": "13",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "PurpleCloud",
        "time": "9 May, 2021",
        "context": "Funny how folks here believe an errant rocket has crashed and no longer poses a threat to humanity but they can’t believe that Trump lost the 2020 election. 🤔🤣😆🤣",
        "good": "3",
        "bad": "11",
        "replies": []
    },
    {
        "user_name": "bktrider",
        "time": "9 May, 2021",
        "context": "as long as it does not fall into    Honk Honk Chinese place",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "error": "error"
    },
    {
        "user_name": "xidenloveschina",
        "time": "9 May, 2021",
        "context": "The Chinese will either a) say it was not their rocket debris or b) it is the United States fault.  They are inveterate liars.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "danlbrau",
        "time": "9 May, 2021",
        "context": "China doesn’t use proper safeguards in their bioweapon facilities, what leads anyone to think they care where their rockets land?",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jake67",
        "time": "9 May, 2021",
        "context": "Not to worry its only made of bamboo imported from North Korea",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rational-thinker",
        "time": "9 May, 2021",
        "context": "China could not care less what Nelson says or thinks. And if I read the article correctly, it did land in water, they just didn’t know why or where it was coming down. BTW, didn’t we have the same problem with SkyLab a few decades back?",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mizzlara🏴‍☠️",
        "time": "9 May, 2021",
        "context": "Virus, space junk? China does not care about people -- they have billions of 'em",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "hiflyer2001SP",
        "time": "9 May, 2021",
        "context": "NASA publishes their outrage just as if China gives a shxx.  China tell NASA go tell it to comrade Biden.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bktrider",
        "time": "9 May, 2021",
        "context": "Oh f\n\nChina plans 10 more launches",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dirtybirds",
        "time": "9 May, 2021",
        "context": "China don’t care about raining rocket debris down on the world or about spewing co2 into the air from coal fired power plants and they’re still building them! Why are we full steam ahead to wreck our economy when we only are only 15% of co2. China is strengthening while we fade. The destruction of our country is from within. ",
        "good": "503",
        "bad": "18",
        "replies": []
    },
    {
        "user_name": "4realfreedom",
        "time": "9 May, 2021",
        "context": "No one held them accountable for the virus. China gets a pass on everything.",
        "good": "13",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "UltraMagaMike",
        "time": "9 May, 2021",
        "context": "do whatever will be here to gather your pieces",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bgriffin",
        "time": "9 May, 2021",
        "context": "News flash.  China virus now in the Indian ocean.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Geminigirl338",
        "time": "9 May, 2021",
        "context": "They do not give a darn about the atmosphere or anything else, including PEOPLE!!\nAnd COVID is not the first virus they invented and sent across the globe!",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "polishadonis",
        "time": "9 May, 2021",
        "context": "This is NASA, USA leaders, and big companies fault.  Big companies were allowed to go over to China and produce products at a cheaper price.  Billions were made by these companies and they helped to build China's country.  You wouldn't think technology would be stolen and used for their own gains.  DUH!!  I'm sure this will be deleted by Fox's so called erasers.",
        "good": "16",
        "bad": "7",
        "replies": []
    },
    {
        "user_name": "UltraMagaMike",
        "time": "9 May, 2021",
        "context": "lets just say spacex is the king",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Make-Crime-Illegal-Again",
        "time": "9 May, 2021",
        "context": "Accidental Virus, Accidental Rockets... What's next?",
        "good": "7",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "bktrider",
        "time": "9 May, 2021",
        "context": "you mean there are people on the ground?\n\n\"It is critical that China and all spacefaring nations and commercial entities act responsibly and transparently in space to ensure the safety, stability, security, and long-term sustainability of outer space activities,\" Nelson said.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Patriot963",
        "time": "9 May, 2021",
        "context": "Who cares what the US says about this rocket. Maybe they should \"woke up\" and realize China is not afraid of a bunch of perverts.",
        "good": "3",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "erinmclaughlin",
        "time": "9 May, 2021",
        "context": "amazing, china is irresponsible, again...\n\nThey have something over the world that gives them great entitlement. in the meantime, we are all paying the price.",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Ex-Republican-REAL-CONSERVATIVE",
        "time": "9 May, 2021",
        "context": "Chinese technology, it’s always half of what it should be. But it gets done what it needs to get done for China.\n\nThis explains why they are still building new coal fired power plants.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "bktrider",
        "time": "9 May, 2021",
        "context": "'is it going to fall on me?  my family?...............Auuuuh  just shoot the ship",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "host4today",
        "time": "9 May, 2021",
        "context": "China Joe Biden will make sure they have the money and technology next time.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "razecs",
        "time": "9 May, 2021",
        "context": "\"There are estimated to be over 128 million pieces of debris smaller than 1 cm (0.39 in) as of January 2019. There are approximately 900,000 pieces from one to ten cm. The current count of large debris (defined as 10 cm across or larger) is 34,000.\"\n\nSpace is becoming the next Pacific garbage patch. Why aren't AOC and Kerry all over this? This could rain down on 3rd world countries and kill people trying to cross the border. AOC should fly up there tomorrow with a big refrigerator magnet and start the cleanup herself. Set an example.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "gonetoground",
        "time": "9 May, 2021",
        "context": "China will NEVER act responsibly  for anything.  Its not compatible with World Domination.  They still worship the legacy of Genghis Kahn. Ironically he died of the bubonic plague in 1227.  Gee I didnt know the Wuhan Virology Lab was that old! LOL",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "johnnycal",
        "time": "9 May, 2021",
        "context": "As if China cares what NASA thinks!",
        "good": "9",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "nuuser",
        "time": "9 May, 2021",
        "context": "The first government funded agency to publicly complain about China, in front of the World. You can bet the farm that the Bungle Administration will be firing the bulk of them.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "jake67",
        "time": "9 May, 2021",
        "context": "All of China's good steel is in Trump Towers. Said so himself",
        "good": "1",
        "bad": "9",
        "replies": []
    },
    {
        "user_name": "Freespeech337",
        "time": "9 May, 2021",
        "context": "Well let us just say China falls!",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mdtrot",
        "time": "9 May, 2021",
        "context": "NASA may have concerns, but you can bet that Nike, Coca Cola, and many other multi-national corporations don't care in the least.  Show them the money!",
        "good": "70",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "theworldhasgonenuts",
        "time": "9 May, 2021",
        "context": "People do not understand China.  Their goal is world domination.\nThey are rushing the process as fast as possible, hence their massive pollution problems, increasing theft of foreign intellectual property, cloning US aircraft from stolen drawings, a Navy nearly twice the size of the USN, rapid ICBM development, stolen dial-a-yield nuclear designs in mass production, etc.\n\nWe are assisting China as much as possible in their efforts to enslave us, but the real question is:  \"Will China pay slavery reparations after they enslave the world?\"",
        "good": "28",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "teamarrow",
        "time": "9 May, 2021",
        "context": "Why do morons think china cares about offending others or doing what ever they want. With all the blowhards in DC, do you really expect anything to take place. ",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "good_times_roll",
        "time": "9 May, 2021",
        "context": "Same kind of behavior back in the cold war days when nuclear tests were done. US and the Soviet, after having had learned the problem of exploding in the atmosphere, moved to underground tests. Yet, China continued above ground tests for awhile afterward.",
        "good": "22",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "lizoid",
        "time": "9 May, 2021",
        "context": "China and Biden have a lot in common.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "interested71",
        "time": "9 May, 2021",
        "context": "Someone should grow a set and hold China accountable for all there ridiculous behavior, Bumbling Biden is in there pocket so forget about him.",
        "good": "9",
        "bad": "3",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "carm571",
        "time": "9 May, 2021",
        "context": "How much space junk does the USA have orbiting earth?",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "mikejones2509353",
        "time": "9 May, 2021",
        "context": "If it would have it Canada, China  loving Trudeau would have sent them a billion for Space aid.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "wvjeffusa",
        "time": "9 May, 2021",
        "context": "china doesn't adhere to any kin of responsible standards...space debris, human rights, freedom of speech,  technological \nprivacy,  climate standards...they will do anything to become THE world power...",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "thewiseone71",
        "time": "9 May, 2021",
        "context": "China doesn’t give two shats about anyone except themselves and that’s just the elite selves.",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "goatgas",
        "time": "9 May, 2021",
        "context": "It’s a Trojan horse. The next one might carry an EMP. China is testing us...",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "bidenisanemptyshell",
        "time": "9 May, 2021",
        "context": "They ordered that rocket from Wish",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Starfish",
        "time": "9 May, 2021",
        "context": "Where are all the environmentalists?  China just polluted the ocean and killed bunches of sea life. Do you know all the cancer causing chemical residue, like hydrazine, that is now in the ocean? Where is Greta Thuneburg? Surely this caused a climate impact.\nOh, but the nuts don’t really care about the environment or climate, they just hate America and love China.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "bktrider",
        "time": "9 May, 2021",
        "context": "Hmmmmmm                        someone help me with this equation:\n\nChina = Responsible  \n\nby what math",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cheetobum",
        "time": "9 May, 2021",
        "context": "I made the mistake of believing NASA would be intelligent enough to realize that China cared about anything that wasn't China, the China that's building 50 new coal fired electric generating plants, the China that manufactured and released Covid19, the China who lets foreign political individuals invest in China so they can increase their wealth by looking the other way.  The China who provided young girls for Hunter Biden to frolic with as they taped it.  NASA don't be so stupid as I don't feel your acting",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "GWill134",
        "time": "9 May, 2021",
        "context": "Xiden says that his administration will never be bought by Russia. Xi Jin Ping says that’s because China already has. ",
        "good": "4",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "kcsparky231",
        "time": "9 May, 2021",
        "context": "Nothing that the Communist Chinese makes is worth a darn.  But then, no Communist nation ever has either.",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "thewiseone71",
        "time": "9 May, 2021",
        "context": "Old Bumbling Biden’s pals littering the world again while he makes life hell for us over here.",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "chrispeacock",
        "time": "9 May, 2021",
        "context": "Joe Biden and LeBron Lames will stick up for China!",
        "good": "7",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Mudstuffin0749",
        "time": "9 May, 2021",
        "context": "Damn, if it had only crashed another 3600 miles ENE!",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "🍻fizzyliftingdrinks🍻",
        "time": "9 May, 2021",
        "context": "The Chinese don't care about human rights. Why in the world would we expect them to care about space debris falling to earth? Liberals kind of live in an alternate reality in thinking that something they say is going to change the thinking and actions of the Chinese regime.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "LaFerrara",
        "time": "9 May, 2021",
        "context": "Hey come on man leave our friends alone according to Sleepy Joe.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "erasmus105",
        "time": "9 May, 2021",
        "context": "Our Secretary of Defense said that we would not shoot down the falling spacecraft. What we should do is shoot down the next one on its way up.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "prinhydro",
        "time": "9 May, 2021",
        "context": "Arrogant Chinos!  They could care less because they think they are the superior race.  Remember folks, buy NOT MADE in China.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ProudNavVet",
        "time": "9 May, 2021",
        "context": "Oh, I'm sure that rebuke by NASA has the ChiComs quaking in their boots.  They could NOT care less about the environment or any other western concern.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Mangie835",
        "time": "9 May, 2021",
        "context": "This is same China that the United States is sacrificing our energy economy to set example that China will follow. The same China that allowed the covid virus to kill to kill 500,000 Americans. Biden & the Democrats are up to something else they cannot be dumb enough to believe China will do anything about the climate unless it’s to their advantage. Are Democrats really that stupid or is there a hidden agenda ",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Chinese_Maniac",
        "time": "9 May, 2021",
        "context": "Hahaha. Why Westerners are such ытснy cowards who fear to be hit by Chinese rocket 🚀🚀🚀",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "earlofoil",
        "time": "9 May, 2021",
        "context": "Thank goodness the Chinese space junk landed in the Indian ocean and not in India---pray for India in their fight against COVID-19",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "m42orion",
        "time": "9 May, 2021",
        "context": "\"Discarded rocket stages typically reenter the atmosphere over a body of water soon after liftoff and don’t go into orbit. It is unclear why China put the rocket part into space.\"\n\nBecause it had to in order to get the right orbit for the space station's core.  That's the rocket science part.  The problem was the uncontrolled re-entry of the booster.  NASA learned that lesson big time when Sky Lab came down uncontrolled as did the Soviets with some of their earlier stuff  with nuclear power units.  Today, responsible launch companies program in and control booster re-entries so they occur over water.  Ditto with \"retired\" satellites.\n\nIs anyone really surprised that China ignores this protocol?",
        "good": "945",
        "bad": "21",
        "replies": []
    },
    {
        "user_name": "bktrider",
        "time": "9 May, 2021",
        "context": "the person writing this article i'm sure tore it up at least 10 times",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "saveUsFromTards",
        "time": "9 May, 2021",
        "context": "guess how well they managed the P4 virus lab in wuhan.....",
        "good": "13",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "papakev",
        "time": "9 May, 2021",
        "context": "I'm sure China will change their ways because of NASA outrage. China does whatever they want. You have to kind of admire them for it.",
        "good": "5",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "ginchie",
        "time": "9 May, 2021",
        "context": "Maybe Chinas space debris has to hit our country before Biden will ask them not to do it again. ",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "xan222",
        "time": "9 May, 2021",
        "context": "Like China cares",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "lessgov123",
        "time": "9 May, 2021",
        "context": "Just like the Paris Accord.....China does little to reduce CO2 emissions compared to the United States. Now China litters space with space garbage that can fall in other countries while the United States responsibly brings back space garbage to a controlled re-entry/destruction. How can China be consider a leader with irresponsible actions such as this?",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "jtmojave",
        "time": "9 May, 2021",
        "context": "I can get some sleep now thank you 🤡",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "DibsonemptyCancun!",
        "time": "9 May, 2021",
        "context": "The Chinese stole the LED technology from a Cali inventor in the 70s.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "bktrider",
        "time": "9 May, 2021",
        "context": "that is kinda like realizing for the first time that ship stinks",
        "good": "0",
        "bad": "3",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "deepwoods",
        "time": "9 May, 2021",
        "context": "At least China didn't hit any land....the USA hit parts of Australia when it's Skylab station fell out of orbit in 1979.",
        "good": "2",
        "bad": "8",
        "replies": []
    },
    {
        "user_name": "LochNessMonster",
        "time": "9 May, 2021",
        "context": "Good thing Xiden is taking such a tough stance against Chynah",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "kevinpmc760",
        "time": "9 May, 2021",
        "context": "They have already shown their disregard towards the rest of the world by spreading their virus. What is a few pieces of space junk compared to that.",
        "good": "24",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bktrider",
        "time": "9 May, 2021",
        "context": "there is only them and them",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "NSWU-10",
        "time": "9 May, 2021",
        "context": "What? China isn't woke and green?????? Say it isn't so....\n\nLiberals are coming for you!!! Just kidding, they only go after easy targets.",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "GWill134",
        "time": "9 May, 2021",
        "context": "Obiden could try giving a pallet of cash to the Chinese like Obummer did with Iran. Maybe that will change China’s behavior. ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "voterfraudjoe2020",
        "time": "9 May, 2021",
        "context": "Darn! I was hoping for it to land DNC headquarters.",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "singleshot",
        "time": "9 May, 2021",
        "context": "NASA should be careful.  It could run afoul of the Biden crime family's deep China ties.",
        "good": "12",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "sjm61",
        "time": "9 May, 2021",
        "context": "I guess NASA doesn't remember when their Skylab fell on Australia in 1979.",
        "good": "2",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "PurpleBox",
        "time": "9 May, 2021",
        "context": "Just goes to show countries like China and Russia on not on board and rogue with the leftists kuybyam mentality.  We must never let our guards down.  Trump was always right",
        "good": "12",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "piperlaurie",
        "time": "9 May, 2021",
        "context": "China will do, what China does.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mtholden",
        "time": "9 May, 2021",
        "context": "The China rocket....ohh, wait....we can't call it that!",
        "good": "16",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "chobbes",
        "time": "9 May, 2021",
        "context": "China act responsibly\nAbout its rockets and missiles?  The nation who let loose a bioweapon that started a global pandemic?  Boycott China!  Free Hong Kong!  Free Tibet!!",
        "good": "13",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "number5of6",
        "time": "9 May, 2021",
        "context": "US: \"China, you have to do better.\"\nChina: \"Okay, we promise we will.\" \n(China rolling on the floor laughing.)",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "TurnTheStoneOver",
        "time": "9 May, 2021",
        "context": "China just murdered millions of people around the world, why on Earth would any fool think they care where a failed rocket lands. China is out to control the world and if you don't speak the language 美国搞砸了   Měiguó gǎo zále. Which means America is screwed.  \"One Tin Soldier Rides Away\"",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dachies",
        "time": "9 May, 2021",
        "context": "I think Greta needs to go talk to them. 😂",
        "good": "8",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Free-Thinker829",
        "time": "9 May, 2021",
        "context": "The typical communist way of treating the world...",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Tommy2112",
        "time": "9 May, 2021",
        "context": "China also throws off more carbon emissions into the atmosphere than the next 5 largest polluting nations...combined!  Do you think the lib/leftists care???",
        "good": "17",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "lanjon4751",
        "time": "9 May, 2021",
        "context": "Bearing responsibility? Like, uh, the WUHAN VIRUS?",
        "good": "13",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "rep01",
        "time": "9 May, 2021",
        "context": "My comment is a little off topic, but are journalists now just \"retweet\" experts? Why should I care what RISHBH or Melissa cutely posted about the Chinese rocket? It is like their editor told them to fill a page and a half so they threw in some colorful and cute posts. . . Maybe I am just grump this morning.  :-)",
        "good": "12",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "gatordscott",
        "time": "9 May, 2021",
        "context": "Chinese government does not care about anything but how they can become the undisputed power. Unfortunately, the Biden administration and the American people buying their goods is here to help them reach their goal.",
        "good": "87",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "apkman01770",
        "time": "9 May, 2021",
        "context": "\"It is clear that China is failing to meet responsible standards regarding _____________.\"\n\nLet's be honest; just about anything could go in that blank and it would still be an accurate statement. ",
        "good": "28",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "droots",
        "time": "9 May, 2021",
        "context": "NASA is fuming?",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "rogerthatt2",
        "time": "9 May, 2021",
        "context": "Is anyone surprised that Communist China failed to meet responsible standards?",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "kikimo519",
        "time": "9 May, 2021",
        "context": "I’ll bet China is real worried about NASA rebuke. With Biden leading the US it’s like a 4 year old hitting an adult ",
        "good": "14",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "🅼🆁.🅱🅾🅾🅼🅱🅰🆂🆃🅸🅲",
        "time": "9 May, 2021",
        "context": "With the pandemic slowing down, here are some Thoughts & Observations\n\n1.  The dumbest thing I bought in 2020 was a planner.\n2.  I was so bored I called Jake from State Farm just to talk to someone. He asked me what I was wearing.\n3.  2019: Stay away from negative people. 2020: Stay away from positive people.\n4.  The world has turned upside down. Old folks are sneaking out of the house and their kids are yelling at them to stay home!\n5.  This morning I saw a neighbor talking to her dog. It was obvious she thought her dog understood her. I came into my house and told my cat. We laughed a lot.\n6.  Every few days try your jeans on just to make sure they fit. Pajamas will have you believe all is well in the kingdom.\n7. Does anyone know if we can take showers yet or should we just keep washing our hands?\n8. This virus has done what no woman has been able to do. Cancel sports, shut down all bars and keep men at home!\n9. I never thought the comment, “I wouldn’t touch him/her with a 6-foot pole” would become a national policy, but here we are!\n10. I need to practice social-distancing from the refrigerator.\n11. I hope the weather is good tomorrow for my trip to the backyard. I’m getting tired of the living room.\n12. Never in a million years could I have imagined I would go up to a bank teller wearing a mask and ask for money.\n13. Not sure if my body absorbed all the hand sanitizer but I have noticed that the toilet seems to clean itself.",
        "good": "72",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "stopthecult",
        "time": "9 May, 2021",
        "context": "Good, thats over...   Now we can go back to talking about pedophiles like Matt Gaetz...",
        "good": "1",
        "bad": "8",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "error": "error"
    },
    {
        "user_name": "pastabob524",
        "time": "9 May, 2021",
        "context": "China has built bases all across the Pacific, why should space be any different?",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "anamerican077",
        "time": "9 May, 2021",
        "context": "China continues its March towards world dominance.  They will do what they want to do... and they have Biden in there back pocket.",
        "good": "22",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "gonetoground",
        "time": "9 May, 2021",
        "context": "Sadly, one day, no one knows when, we will be at war with China.  Likely over Taiwan for its tech. It will devastate the world because, if they see they are not winning, they will nuke.  A Tactical one first.  The question is: will we first strike before they try.  They dont have the defensive systems we have (yet).   They have 1.4 Billion people and I dont think the Commie govt cares if a few hundred million die as ling as the state stays intact.   If they get a hold of Taiwan, they will NEVER let go.    Maybe we should develop a way to destroy Taiwans tech if we need to.",
        "good": "6",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "GoldRadio",
        "time": "9 May, 2021",
        "context": "whether it be foreign, domestic, or international policy it will always be the same \"China No Care\". just ask LeBron.",
        "good": "18",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "cyanvalvespring",
        "time": "9 May, 2021",
        "context": "China isn’t going to pay any heed to Nelson’s empty words.  China is an atheistic society that does not put undue value on human life. Their approach is much like managing livestock. Losses are acceptable for the greater good.  \n\nWhat’s Nelson and his PC kingdom going to do about it anyway?",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Maximusthemerciful",
        "time": "9 May, 2021",
        "context": "China doesn’t care what anyone thinks about anything they do and they know no one is going to do anything about it. Ever! The U.S. does not have the will or the power to stop them and they know it. The United States of 2021 is not the United States of 50 years ago. We are weak, with weak leaders and the world knows it. If we are still a Nation in 100 years, we’ll all be speaking Chinese. The only good thing about this is that I’ll be dead by then and won’t be around to see the fall of this once great Nation. ",
        "good": "53",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "cynicalgrandma041",
        "time": "9 May, 2021",
        "context": "Like China cares what NASA has to say...It's CHINA, the most powerful nation on earth. Who's going to tell them to shape up? Joe Biden? Kamala Harris? Please. And what does Fox think will happen if they splash headlines like this on its front page? This is just another shoulder-shrugging moment when the smartest and most honest thing to say is \"China's going to do what it wants to do, because there is no one to stop them, and they know it.",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "RedApple",
        "time": "9 May, 2021",
        "context": "Perhaps it is time to assure China never launches another rocket again.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jerseyjoed",
        "time": "9 May, 2021",
        "context": "You might need salt, but you don't care about every individual crystal in the container. China has so many people, human life has diminished meaning.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jboh",
        "time": "9 May, 2021",
        "context": "Wait...it's a Chinese rocket because it came from China but the virus that came from China is COVID-19?\n\nGot it!",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "backtheblue-metoo",
        "time": "9 May, 2021",
        "context": "that rocket was probably loaded up with incriminating evidence from the Wuhan lab.",
        "good": "7",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "davet",
        "time": "9 May, 2021",
        "context": "China knows now that Trump is gone they can do pretty much what they want with little or no repercussions. They know Biden is weak and frail and is afraid to stand up to them or any of our adversaries.",
        "good": "10",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "blueanchor",
        "time": "9 May, 2021",
        "context": "When are we going to accept China doesn’t care about how many people they kill?",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "clearnpresentdanger",
        "time": "9 May, 2021",
        "context": "Nothing good comes out of China.  Nothing.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "libby'sawasteofhumanskin",
        "time": "9 May, 2021",
        "context": "To bad it didn't fall on the Whitehouse.",
        "good": "8",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "BigWhiteGuy691",
        "time": "9 May, 2021",
        "context": "Nuke 'em, you have my permission.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "gilligan.bojangles",
        "time": "9 May, 2021",
        "context": "China - the gift that keeps on giving.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "youarewrong600",
        "time": "9 May, 2021",
        "context": "China is going is going to rule the world. Mean while Joe is worried about ......well honestly nothing. ",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "americafinest",
        "time": "9 May, 2021",
        "context": "The Trump tariff war led to farmers BECOMING THE STATE BIGGEST WELFARE RECIPIENTS.\n\nSure!",
        "good": "2",
        "bad": "11",
        "replies": []
    },
    {
        "user_name": "jeffwaller",
        "time": "9 May, 2021",
        "context": "Change the name from Long March to Long Fall.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "12thdistrict",
        "time": "9 May, 2021",
        "context": "We should have ended China's existence last year over their biological attack on us.",
        "good": "9",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "bribing-Bidens",
        "time": "9 May, 2021",
        "context": "Hail, the next one will not hit Indian Ocean, but in India itself, because India is anti-Xi",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Aldematt.357",
        "time": "9 May, 2021",
        "context": "Really hard to imagine any scenarios where the Chinese are compliant and show regard for human safety or life. Same thing with the CHINA VIRUS. Now, we have a president who will condone their actions and placate them....",
        "good": "10",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "exfed57192",
        "time": "9 May, 2021",
        "context": "Let’s focus on more important things like Dr Suess, Mr Potato head and the next stimmmy check🤣",
        "good": "14",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "conservativemac",
        "time": "9 May, 2021",
        "context": "Get used to it people, they care less about their own people let alone the rest of the world. But we will merrily go along  and say nothing because who else is going to make our cheap products to keep corporate profits up!",
        "good": "882",
        "bad": "9",
        "replies": []
    },
    {
        "user_name": "americafinest",
        "time": "9 May, 2021",
        "context": "ARE WE STILL OWING CHINA TRILLION OF DOLLARS?",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "desmadre859",
        "time": "9 May, 2021",
        "context": "China has repeatedly refused to follow international rules.  Why continue to let them?  Raise that bamboo curtain again, asap.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "PottedHousePlantPresidentSaysWhat?",
        "time": "9 May, 2021",
        "context": "China doesn't meet any standards. They are a communist regime with only dominance, submission and control of all they see as their goal. Like the democrat party in the US",
        "good": "12",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "tahoejrd125",
        "time": "9 May, 2021",
        "context": "OP getting paid by China, no question. Post a bunch of cartoons about this??? If NASA had this happen you would have been calling for it to be shut down. Journalism is dead.",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "fburgoz",
        "time": "9 May, 2021",
        "context": "Made in China, go figure.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "CountK",
        "time": "9 May, 2021",
        "context": "The DingleBarry administration (including Joementia) allowed China to build artificial islands all over the South China Sea to militarize the area.  You think those communists give a flip about NASA's comments or anything the current administration says or does?  Nope...",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "bktrider",
        "time": "9 May, 2021",
        "context": "now now................play fair",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jhear",
        "time": "9 May, 2021",
        "context": "What wil biden do about it?  Nothing he thought it was a fireworks show for his 200th birthday",
        "good": "8",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "calife968",
        "time": "9 May, 2021",
        "context": "China is simply testing a new way to attack the United States and Biden is clueless",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "tnkevin",
        "time": "9 May, 2021",
        "context": "“Ruh-Roh! Rocket go reah fah!”",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "americafinest",
        "time": "9 May, 2021",
        "context": "Curious: does Trump still import his maga hat/t-shirt/mug and similars from China and sell them to his followers?",
        "good": "2",
        "bad": "15",
        "replies": []
    },
    {
        "user_name": "MaNuggets",
        "time": "9 May, 2021",
        "context": "thought we couldn't label disasters, pandemics, etc \"Chinese\"... this rocket should be called the Falling Rocket - 19... stop blaming the Chinese for everything...",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "VikkyBoy",
        "time": "9 May, 2021",
        "context": "US can only dictate terms to the poorer countries. You dare command us the Chinese. Your country will be decimated if we 1.5 billion just walk from the east to west. And the sky does not belong to uncle sam or the hypocrite Joe",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "lastconservativestanding",
        "time": "9 May, 2021",
        "context": "Seriously we’re upset about rocket debris when we let China run over Hong Kong, release and coverup a virus to the world?",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "gilligan.bojangles",
        "time": "9 May, 2021",
        "context": "CNN's headline:  \"China successfully guides rocket debris back to earth.\"",
        "good": "10",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "c_w_w",
        "time": "9 May, 2021",
        "context": "So, the Biden Administration is criticizing the Chinese for what China did.   \n\nIsn't that xenophobic?",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "sweet",
        "time": "9 May, 2021",
        "context": "You’re dealing with a nation that builds everything at half the price of other nations.  You expect them to be safe?  They recently released a virus on the world.  Now they had a 10 ton rocket free falling to earth that could have caused great damage.  ",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "buddytx97",
        "time": "9 May, 2021",
        "context": "DEMENTIA JOE thought this  CHINA article was about his mother's dishes.",
        "good": "7",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "NameRequired224",
        "time": "9 May, 2021",
        "context": "China rebuked for not meeting responsible spacefaring standards.😂 What about\nAir quality,\nCurrency manipulation,\nSouth China Sea debacle,\nWuhan Lab Covid disaster,\nSlave labor, etc,?",
        "good": "15",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "stoptheinsanity478",
        "time": "9 May, 2021",
        "context": "That’s a shocker....”China failing to meet standards”! I’m surprised the debris wasn’t tainted with China Virus 2.0 for global dissemination.",
        "good": "12",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "deepwoods",
        "time": "9 May, 2021",
        "context": "The USA hit parts of Australia when it's Skylab station fell out of orbit in 1979.\nThe USA was very irresponsible back then.",
        "good": "1",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "earlofoil",
        "time": "9 May, 2021",
        "context": "when I worked in China and traveled around the country----the Chinese liked Americans---first and foremost---we saved China from Japanese Imperialisms---the everyday Chinese citizen knows that America is the beacon of freedom of thought---I just hope that Biden and the Democrats don't s-k-e-w it up",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "zeitzmeister",
        "time": "9 May, 2021",
        "context": "Someone has to hold this rogue nation to account before it is too late.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "IloveAmerica594",
        "time": "9 May, 2021",
        "context": "The words China and standards in the same sentence, now thats funny. They should use that on SNL",
        "good": "13",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "error": "error"
    },
    {
        "user_name": "Taccilazy",
        "time": "9 May, 2021",
        "context": "ghh",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "buckkingly",
        "time": "9 May, 2021",
        "context": "Its all the Dems fault! And the LIBS!!! Unless, its something else. Till then we must own the LIBS!!!",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "smitty7892",
        "time": "9 May, 2021",
        "context": "I would expect nothing less from a third world Communist nation trying to become the leader of the galaxy which includes Earth. Other than President Trump and maybe Australia, don't expect anyone from the GOP, Dem party, Biden disastrous admin, pro sports, msm, big tech or big business to push back on the Chinese Criminal Party. The world can't even get open access to the Wuhan lab and Chinese officials to investigate the Chinese coronavirus origins.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jackr1",
        "time": "9 May, 2021",
        "context": "10 more China leftovers coming soon.  Where they will crash no one knows. \n\nBiden approved.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "CaptainRon318",
        "time": "9 May, 2021",
        "context": "And China’s response to NASA; Fung U!",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "DisgustedOldMan822",
        "time": "9 May, 2021",
        "context": "Most all rockets are dropped into the ocean or as in Elon's case they land again, yowser, I love watching that stuff.  It's Flash Gordon, funny part is the new SpaceX looks like Flash Gorden's ships.   Chinese Spokesperson who is also Turtles wife stated the World should stay out of China's internal affairs.  Co China Spokesperson Zucerbergs Wife stated China believe you have it, you own it, not our problem.  They asked if anyone knew where Marbles' is, they like to explain some things to Bidn.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "garygary",
        "time": "9 May, 2021",
        "context": "What is going to be done about this? Absolutely nothing!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "brownam775",
        "time": "9 May, 2021",
        "context": "Ignorance is rampant in these posts. People claiming Asians are bad at driving. Well white people, you crash at 3x the rate of Asians in the US. Facts never get in the way of a good narrative huh?",
        "good": "2",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "c_w_w",
        "time": "9 May, 2021",
        "context": "Good thing it didn't land anywhere near Japan.  \n\n'Cause, you know...Godzilla.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "OliveWrench",
        "time": "9 May, 2021",
        "context": "China seems to be the cause of many problems lately . Kinda like the 13per cent ,with the exception that they are more than 13 per cent.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "nolibsrequired",
        "time": "9 May, 2021",
        "context": "Did the squinty eyed buck toofed little astronauts inside survive  ? Or were they space kamikazes ?",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "President_Magoo",
        "time": "9 May, 2021",
        "context": "There is a consistent theme here. When people and/or Nations are not held accountable for their misdeeds, they will continue their errant behavior and even escalate it. China, Russia, the 13% and the radical liberals are all prime examples.",
        "good": "12",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Amputicee",
        "time": "9 May, 2021",
        "context": "It’s almost like Bill Clinton selling China the satellite tech to make this possible WASN’T a great idea.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "Trump-DeSantis-2024",
        "time": "9 May, 2021",
        "context": "At least they kept their garbage on their side of the earth.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "LiberalsRCrazy",
        "time": "9 May, 2021",
        "context": "If China has no remorse or sense of responsibility of what has happened with COVID (given the current despair of their southwestern neighbors in India), what would make anyone think they would have any sense of responsibility with their space debris?",
        "good": "44",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rocksoff",
        "time": "9 May, 2021",
        "context": "Same folks scared of being hit by space debris think Covid is only a little flu and nothing to be concerned about, Trump was right, you're \"very special.\"",
        "good": "4",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "azlawyer39",
        "time": "9 May, 2021",
        "context": "Would have been cosmically hilarious if this had landed on Xi's house.",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "jjb0811",
        "time": "9 May, 2021",
        "context": "Maybe when the clean up that mess, they'll find that missing airline from 3-4 years ago!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "disappointed5525",
        "time": "9 May, 2021",
        "context": "Since China has previously had similar problems in their space program, it’s apparent they aren’t responsible spacefarers.  Like so many other aspects of their culture, China has become a rogue nation which carelessly despoils nature, people, other nations, and even the planet itself in a ruthless quest for more and more power.  China’s leaders cannot be trusted. ",
        "good": "37",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "deepwoods",
        "time": "9 May, 2021",
        "context": "The World slammed the USA, after debris from their Skylab space station fell out of orbit and hit parts of mainland Australia, for failing to meet responsible standards.",
        "good": "1",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "willypayne",
        "time": "9 May, 2021",
        "context": "Yeah. Yeah. Yeah. And then they will do whatever they want.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "48starflag",
        "time": "9 May, 2021",
        "context": "Finally - a faster way to get to the Maldives.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "kelltic953",
        "time": "9 May, 2021",
        "context": "Their rocket debris isn't as frightening as their virus debris.",
        "good": "13",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "yo666",
        "time": "9 May, 2021",
        "context": "China should be permanently barred from any space launches for good. Last year it was the virus this year it’s space debris holding the world hostage. China isn’t responsible enough to be allowed to launch anything.",
        "good": "34",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "lazydog9",
        "time": "9 May, 2021",
        "context": "what would you expect from a country that has produced lethal infant formula ,poisonous pet food , toxic sheet rock and the corona virus.\nThe Chinese government is a pox on humanity and a force of pure evil.\nMembers of the U.S.Congress are personally enriched by them to destroy our country.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "hurtswhenidothis...",
        "time": "9 May, 2021",
        "context": "It's not that they failed to manage their space trash, it's that they don't care.  So save your harrumphing, NASA.  Stick with Muslim outreach. Isnt that your new passion?",
        "good": "6",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "Man1947",
        "time": "9 May, 2021",
        "context": "Chinese are mighty cavalier about endangering the lives of the worlds population. They seem to be a hazard to the rest of the world kind of like Hitler's Germany was.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "retiredlife30",
        "time": "9 May, 2021",
        "context": "Its pretty simple NASA, China doesn't care what you or anyone else thinks. \n\nThey are going to continue sweatshop labor, ignore basic human rights, incarcerate and kill their own people.\n\nOh the UN and Oval Office talk tuff,  but that's it",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "VietnamRecon65",
        "time": "9 May, 2021",
        "context": "Get used to Communist leaving garbage in their paths. Just look at a BLM & Antifa peaceful protest.🔥",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "DogsAreTheBest",
        "time": "9 May, 2021",
        "context": "I found a piece!! It said “Made in Taiwan” on it. ",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "collusionfantasy",
        "time": "9 May, 2021",
        "context": "And nobody got killed...except for the Chinese scientists that miscalculated the rockets weight.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "DanR640",
        "time": "9 May, 2021",
        "context": "Irresponsible nation.\nCommunist alway ignore international laws.\nTake a quick look at China, Venezuela, Cuba  and so on….\nOne major example is COVID, after infected the Planet, they not even apologize, and Puppet nation of UN quite always at the order of China 🇨🇳 ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "joeconservativene",
        "time": "9 May, 2021",
        "context": "Too bad - was kind of hoping the debris would land on LeBron’s house!",
        "good": "7",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "sonomacoast",
        "time": "9 May, 2021",
        "context": "The honeymoon period for the Biden administration lasted exactly 2 months. April was horrible for the administration and it only gets worse from here since it's obvious Biden and his staff have no solution for anything.",
        "good": "14",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "MaNuggets",
        "time": "9 May, 2021",
        "context": "CoronaRocket - 1, not Chinese rocket... come on now people, gotta be pc",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "BobM267",
        "time": "9 May, 2021",
        "context": "Lately, China is becoming a serious annoyance to the world community. We’ve endured their virus, manufactured islands in the S. China Sea, encroaching on the Philippines' fishing waters, constant pressure, and the threat against Taiwan. Now we’re dealing with rockets falling who knows where out of the sky? This nation is like that bad neighbor we wish would just move and soon!",
        "good": "80",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "yes2yes3448",
        "time": "9 May, 2021",
        "context": "Communist Chinese are like  progressive liberals, what ever it takes to gain more power.",
        "good": "9",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "hcsaysarfarfarf",
        "time": "9 May, 2021",
        "context": "China's Xi was approached by news reporters seeking comments Xi mumbled something in Chinese and turned and walked away.....A Chinese to English translator repeated what he said translated to English....Xi said \"I no talk.....I punch you ugly face\"",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "deepwoods",
        "time": "9 May, 2021",
        "context": "Fun Fact....The USA was criticized for failing to meet responsible standards after debris from their Skylab space station fell out of orbit and hit parts of mainland Australia.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "clownyfish",
        "time": "9 May, 2021",
        "context": "Pffffttttt... Why would the Biden Administration (and their boy Hunter) care to upset any China financial arrangements that they enjoy and DARE to make any waves about what they do on a world stage...?\n\nMassa Joe is way too busy trashing white people and pushing his racist transformation of our country to being an 'utopian' American Culture of Crime and Tent Cities in order to appease his 13%, who can no longer be criminally controlled....",
        "good": "9",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "singlecell",
        "time": "9 May, 2021",
        "context": "NASA the tough guy huh?  Like there boss sleepy joe, all talk talk talk, BLM...what a joke...",
        "good": "6",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "backtheblue-metoo",
        "time": "9 May, 2021",
        "context": "Biden was spotted on the WH front lawn last night , looking up at the sky with a catchers mitt on saying \" I got it  ...  I got it ...  I got it \"",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "newsfreak2",
        "time": "9 May, 2021",
        "context": "Well, well well ! A US government agency is upset ! What about ? Not because China unleashed the Covid-19 Virus on the world , NO , because of a piece of space hardware fell into the ocean .  Contrast that with our government's attitude  relating to president Trump  calling the Virus\n what it was / is. \"the Chinese Virus\", the media came unglued !! Which was the greatest threat to, not only the US but the world ! Has any government agency taken China to task for it's actions and inactions since the Virus became known ? No !  Will they ? No ! Not if Biden can prevent it from happening !",
        "good": "31",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "GarlicCologne",
        "time": "9 May, 2021",
        "context": "The CCP is like that nasty dog that knows no boundaries and is always sniffing around and taking dumps in other people's yards.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "earlofoil",
        "time": "9 May, 2021",
        "context": "President Xi said --and so what are you going to do about it",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "gmanliddy1",
        "time": "9 May, 2021",
        "context": "The Chinese are small, yellow people that we could make quick work of if we really wanted to.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "PurpleBottle",
        "time": "9 May, 2021",
        "context": "China is like a cancerous growth on planet earth. Why the countries do not join together and isolate this disease is beyond me. They are liars, thieves and consider humans property of the state. When President Trump had their currency in a tailspin and other nations uniting against them they released a worldwide pandemic.  The longer the world waits to deal with this disease the worse it is going to get.",
        "good": "13",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "WeAreDoomedUnderBiden",
        "time": "9 May, 2021",
        "context": "If China throws the big guy a few benjamins NASA wont be heard from.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "nynotliberal",
        "time": "9 May, 2021",
        "context": "Too bad it didn't land on that lab in Wuhan.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bc8320",
        "time": "9 May, 2021",
        "context": "China has quickly become a menace to the planet.....",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "OnlyCommonSense138",
        "time": "9 May, 2021",
        "context": "How ironic would it have been if some of this space junk hit Lebron’s house?",
        "good": "7",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "GregoryGilreath185",
        "time": "9 May, 2021",
        "context": "EVERYTHING China has done lately is irresponsible.  Biden and China can ALL go to hell.",
        "good": "12",
        "bad": "3",
        "replies": []
    }
]