[
    {
        "user_name": "intheeright",
        "time": "22 hours ago",
        "context": "Apple loves the Liberal New World Order.  Like most large Tec Companies they go all in for China.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "libsdizzy",
        "time": "22 hours ago",
        "context": "stop buying the communist apple devices................ MOST corporations are like JOE BIDEN....... tied to the hip of CCP china.....",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "smctrout",
        "time": "22 hours ago",
        "context": "Shortly after the Huawei spyware matter a few years ago, I tried to find a mobile phone that was not made in Communist China. Very difficult. I doubt that the situation has improved.",
        "good": "2",
        "bad": "0",
        "replies": [
            {
                "user_name": "unaffiliated777",
                "time": "9 hours ago",
                "context": "Samsung phones are ALL manufactured in Vietnam—not China.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "adialog",
        "time": "22 hours ago",
        "context": "Apple doesn't care what or who's at risk. the bottom line is all that matter's",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tinwhistler",
        "time": "22 hours ago",
        "context": "Apple is as necessary as Facebook and Twitter - not necessary at all.  I have been using Apple products for decades, but will drop them like I did social media if they buy product from Biden's CCP.",
        "good": "24",
        "bad": "0",
        "replies": [
            {
                "user_name": "mr1776",
                "time": "41 minutes ago",
                "context": "The exact same thing with me.  I’ll cease to purchase any new Apple products in a minute if they climb in bed with the CCP.  And I have a lot of stuff… ",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "Prgmr",
        "time": "22 hours ago",
        "context": "I don't like apples. I have an android.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "smctrout",
                "time": "22 hours ago",
                "context": "Android phones are made in Communist China, too. It is very difficult to find a phone that isn't.",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "anotherdeploreeble",
        "time": "22 hours ago",
        "context": "Wait a minute, didn't we \"invest\" like $50 billion for the \"CHIPS and Science Act\" to \"modernize\" our chip manufacturing ??! I guess, that bill was so Nancy Pelosi could enrich herself.",
        "good": "15",
        "bad": "0",
        "replies": [
            {
                "user_name": "jmwestward",
                "time": "22 hours ago",
                "context": "It's an absolute joke. But nothing we can do.",
                "good": "1",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "gripoflush",
                "time": "21 hours ago",
                "context": "Yeah, those chip foundries are just slapped up overnight, like a Starbucks or Self Storage outlet.",
                "good": "1",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "spastic338",
                "time": "15 hours ago",
                "context": "2 chip manufacturers  being built  in ohio is a start.",
                "good": "2",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "rd711",
        "time": "22 hours ago",
        "context": "I have used Apple phones, MacBook pros, and iPads for years. They are great products but I always hated having to buy it from an anti-American company. If they pursue continuing to buy chips or anything else from the communist. I will switch back to PCs and never buy another apple product. Stuff that in your woke!",
        "good": "13",
        "bad": "0",
        "replies": [
            {
                "user_name": "gripoflush",
                "time": "21 hours ago",
                "context": "Why are you waiting Mr. Econopatriot?",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "nika01",
                "time": "15 hours ago",
                "context": "Yay",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "lovefreedomhatelibs",
                "time": "14 hours ago",
                "context": "I didn't buy Apple products because they are so expensive but now I have another reason.",
                "good": "2",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "kwolf159",
        "time": "22 hours ago",
        "context": "There is simple solution, impose a large import fee on all products containing China chips. Dependency on critical items like computer chips and drugs is insane, but we need to prioritize the ability to manufacture in the US first. ",
        "good": "16",
        "bad": "0",
        "replies": [
            {
                "user_name": "jmwestward",
                "time": "22 hours ago",
                "context": "It's for iPhones to be sold in China. Won't be imported to the US",
                "good": "0",
                "bad": "2",
                "replies": [
                    {
                        "user_name": "panhandlechris",
                        "time": "9 hours ago",
                        "context": "Even if they buy chips manufactured in China only for Chinese iPhones, they are still giving away their intellectual property - namely the integrated circuit design - to the Chinese.  The IC design will be very similar to any \"American\" variant.  Design companies don't completely re-design a product so they can sell it in another market.  No, they make minor tweaks to the existing design because it is very expensive and risky to develop VSLI circuits.  In addition, they are giving the Chinese chip fab the opportunity and experience for fabricating advanced integrated circuits.  If the Chinese could manufacture advanced VLSI products, they wouldn't be relying heavily on the Taiwanese Semiconductor Company.  That could be said of America as well.  The CHIP subsidiary is a good start, but we have a long ways to go before weening ourselves off of foreign chip manufacturers.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "wu7chamber",
        "time": "22 hours ago",
        "context": "I have never met a lib that didn't own an iphone. They will not care about this in the least. Just like voting Dem, they will never stop supporting Apple",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "johne37179",
        "time": "19 hours ago",
        "context": "Communication devices with chips of Chinese origin should be banned from any network that needs to be secure.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "iac4u",
        "time": "21 hours ago",
        "context": "The Chinese are our sworn enemies, and without question the final and greatest threat that America will ever know, largely due to our assisting them like this. Why would you do this Apple?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "skyking",
        "time": "22 hours ago",
        "context": "When I was still in school, 60 years ago, it was socially attractive to favor globalism and supporting Blacks who were arrested for civil action. So all these years later, we are living with the Frankenstein monster children of those movements. Major businesses are rushing to make ties with China, even while proof is piling up that China is stealing their technology. Those and others are donating massively to various CRT and other \"woke\" movements aiming to erode the core of Americanism. Somehow, they feel that by feeding the wolf, they won't be eaten. That has never been the case!",
        "good": "7",
        "bad": "0",
        "replies": [
            {
                "user_name": "gripoflush",
                "time": "21 hours ago",
                "context": "You definitely make one thing obvious.  \n\nYou got old.",
                "good": "0",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "❤DEFENDTHEINNOCENT!",
                        "time": "21 hours ago",
                        "context": "We all will someday.   Including you.  I'm under 40 , how about you?  Do you love your parents ?  Your grandparents?  Have children?  I do love my entire family and my country's freedom.",
                        "good": "2",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "gripoflush",
                                "time": "21 hours ago",
                                "context": "Loving things has nothing to do with accepting change.  Our ancestors complained about the dangers of printed media, then radio, then television.  Now it's the internet.  And now our elderly are the ones complaining about how the youth of America is sending our country to the nether regions.  I know, I know, THIS time it's different...\n\nThe sooner we accept that we live in a global political economy and start taking measures to succeed in that arena, the better.",
                                "good": "0",
                                "bad": "1",
                                "replies": [
                                    {
                                        "user_name": "❤DEFENDTHEINNOCENT!",
                                        "time": "20 hours ago",
                                        "context": "You're not getting it.    No one in a free country has to obey you or agree with you.  Think about that .   Be free and learn all that goes with that.  I'd give you a hug if I could..... But all we have is the internet 😉 ❤. I can say this ,  it'll be ok one beautiful day.   Just learn about freedom and love .   Strengthen your knowledge of facts and love.   I'm with you always.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "Esteban011",
        "time": "21 hours ago",
        "context": "The U.S. being a FREE country or not, this needs to be made ILLEGAL, ASAP, for the very reason of NATIONAL SECURITY!!!!!!! CONGRESS GET ER DONE!!!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jk000",
        "time": "21 hours ago",
        "context": "Tim Cook, being a homosexual, doesn't think like normal people. His lack of moral character is such that humanity is secondary to his success and that it's him against the world.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "❤DEFENDTHEINNOCENT!",
        "time": "21 hours ago",
        "context": "Buh Bye, Cook and Co.    No more $$$$ for you from me !",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "anotherdeploreeble",
        "time": "21 hours ago",
        "context": "Interesting. Whatever happed to the assertion that we are the \"Technical people\" and only rely on China and the South East for \"cheap\" goods. Chips are not that cheap, eh ? It is something that was pointed to, decades ago. Experts warned that increased manufacturing overseas will lead to increased technical sophistication. Nobody listened. And now, China will beat Intel, AMD and Nvidia companies that were in the chips business for decades .... Intel practically invented the modern microchip ! And oh yes, China surpassed the US in filed and APPROVED patents about 2 years ago. Meanwhile in the US, the focus is .... forgiveness of student loans, of course !",
        "good": "6",
        "bad": "0",
        "replies": [
            {
                "user_name": "❤DEFENDTHEINNOCENT!",
                "time": "21 hours ago",
                "context": "Thank you for the lesson ! 👍",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "oldgeek686",
        "time": "21 hours ago",
        "context": "Even before China partnered with Brazil, Russia, India and South Africa to form the BRICS Mineral and Mining Consortium, they were on a quest to control the raw materials needed for Chip manufacturing and the manufacturing of Solar and Wind products.\nNow, with BRICS backing this quest China owns or has exclusive rights to 90% of these materials.\nWhich means that whether the US bans Chips made in one of China's SEZ's or not, in the long-term China will be the sole source of these elements and rare earths.\nIn fact, since 2014 China has acquired 27ea. 50-year Exclusive Mineral and Mining Rights Contracts on the African Continent.\nBRICS has a standard contract to be used worldwide to gain Mining Rights.\nIn exchange for 50-year Exclusive Rights the Host nation gets 20% of the profits, a completely Modernized Infrastructure, and a World-Class Education System.\nIn other words, a Foreign Aid package that not only pays for itself, but profits both Guest and Host nations.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "naturejock",
        "time": "20 hours ago",
        "context": "Unions.  None in China. Everybody wants cheap electronics.   Unions cannot deliver that.",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "roberteleev",
                "time": "19 hours ago",
                "context": "so do without...worked great for a century",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "omeomi",
        "time": "21 hours ago",
        "context": "Maybe the world doesn't need yet another new iphone?  Maybe it's time to STOP lining up to buy the latest gadget?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cb1882",
        "time": "21 hours ago",
        "context": "\"...Communist China has a penchant for fusing civilian, military and political assets to conduct espionage.\"\nThere exists only one entity under communist rule: The State.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cb1882",
        "time": "21 hours ago",
        "context": "\"..efforts aimed at bolstering American chip competitiveness.\" That's easy. Do what Trump did. Slap a 50 or even 500% import tariff on the Chinese goods in question.\n Apple will then buy them from India, or wherever.",
        "good": "4",
        "bad": "1",
        "replies": [
            {
                "user_name": "MrIGotNews4U",
                "time": "19 hours ago",
                "context": "China will sell them to India or wherever and India or wherever will sell them to Apple...they always find a way around government restrictions.",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "Crotchety_Old_Dude",
        "time": "21 hours ago",
        "context": "Profit margin.  You won't hear or see a single Apple board member balk or raise any concerns in response to this move.  All they care about is how their personal compensation package and  overall portfolio performs.",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jmwestward",
        "time": "22 hours ago",
        "context": "Apple have to compete with others in the China market. They develop \"China-version\" of iPhones to be priced competitively in that market.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "jmxjohnson128",
                "time": "21 hours ago",
                "context": "...there it is...money over nation",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "palangga",
        "time": "20 hours ago",
        "context": "As China continues to shut down for months at a time, Apple continues to double down on unreliable suppliers.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "hector25",
        "time": "22 hours ago",
        "context": "Apple don't care. It's all about profit. They'll sell out their own mother for money. The cult of Apple is very strong. People lining up for anything new they put out with no regard to where and how they are manufactured.",
        "good": "11",
        "bad": "0",
        "replies": [
            {
                "user_name": "rodneydangerfieldtrumpslayer",
                "time": "20 hours ago",
                "context": "Where is your phone manufactured?",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "lovefreedomhatelibs",
                        "time": "14 hours ago",
                        "context": "Unfortunately mine is made in Bidenville aka China.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "Jgalilee",
                        "time": "13 hours ago",
                        "context": "Where most phones are made, I think - in the ccp.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "unaffiliated777",
                        "time": "9 hours ago",
                        "context": "All Samsung phones sold in the US are manufactured in Vietnam—not China. Samsung owns no factories in China. Samsung phones made for the Chinese market are merely licensed to Chinese manufacturers for domestic Chinese sales.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "navvetfarmer",
        "time": "19 hours ago",
        "context": "Apple is loyal to nothing , but the dollar.",
        "good": "3",
        "bad": "0",
        "replies": [
            {
                "user_name": "rpritter253",
                "time": "17 hours ago",
                "context": "Apple is nothing but a marketing trick. Always was and always will be. There is nothing Apple does that is unique or singular. You can do better than Apple.",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "seadaddy",
        "time": "20 hours ago",
        "context": "Traitors are traitors and should be dealt with in the same manner across the board.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jmxjohnson128",
        "time": "21 hours ago",
        "context": "...this is exactly why I do not own a single apple product, and I never will.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rodneydangerfieldtrumpslayer",
        "time": "19 hours ago",
        "context": "I just saw an Apple announcement this week that they were moving manufacturing to India because of concern about China. China has the same chip problem as the rest of the world.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "roberteleev",
                "time": "19 hours ago",
                "context": "so, do without..USA needs apple,china,india,etc., like we need a nuclear blast.....not at all",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "rodneydangerfieldtrumpslayer",
                        "time": "19 hours ago",
                        "context": "The American taxpayer subsidized the mass exodus of manufacturing to overseas, beginning in the 70s and continuing for decades. If you want to know who changed the tax laws to encourage this move, it is easy to look up if you are smart enough to know how to search.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "phneutral",
        "time": "21 hours ago",
        "context": "Is that how money works? You mean we can't trust the Chinese Communist Party to have our best interests at heart? I am shocked and aghast! I thought Joe Biden was a main reason why we have done so much business with them. What's up with that, Joe? Huh, huh?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "betterusa",
        "time": "20 hours ago",
        "context": "This adds to my reasons why I would NEVER buy an Apple product!",
        "good": "9",
        "bad": "0",
        "replies": [
            {
                "user_name": "navvetfarmer",
                "time": "19 hours ago",
                "context": "I can appreciate your sentiment , but I'm pretty sure just about all electronic components are in the same category to some extent.",
                "good": "2",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "Jgalilee",
                "time": "13 hours ago",
                "context": "Ok - when I taught high school science for less than 4 years, about 20 years ago, the schools ran on Apple products. So, I got a Mac. I liked it & got proficient with its software. Then I wanted a particular software that was only available for PCs. So, I got a laptop. Never could get the hang of Word or other PC apps - & I hated all the fees to use everything. Microsoft, imo, is just a big a bloodsucker as Apple. ",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "HonorableJudge-Roy-BeanofTexas",
        "time": "21 hours ago",
        "context": "TRAITOR'S",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "1970barracuda",
        "time": "19 hours ago",
        "context": "YOU HAVE GOT TO STOP BUYING STUFF MADE IN CHINA! Tell Apple you are not going to buy their products until they divest themselves from China. When you buy China products, the profits are supporting a regime that wants to do you harm. WHY WOULD YOU DO THAT! It's insane. There TONS of other products just as good if not better out there, if you look. STOP SUPPORTING A COMMUNIST REGIME THAT WANTS TO DESTROY YOU.",
        "good": "6",
        "bad": "0",
        "replies": [
            {
                "user_name": "Jgalilee",
                "time": "13 hours ago",
                "context": "Great idea  - but, how do you find out which parts of whatever you are buying could be traced back to the ccp or a series of companies with the ccp as the owner? Virtually impossible for the average person to do this.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "1oldngray",
        "time": "20 hours ago",
        "context": "Ban all chips that can report back to China any activities on American Soil.  This would include all equipment relating to the internet or wireless technology that covers any defense contractor or direct governmental agency.  But China Joe owes his soul to the CCP along with his entire family.",
        "good": "6",
        "bad": "0",
        "replies": [
            {
                "user_name": "Jgalilee",
                "time": "13 hours ago",
                "context": "And he is selling all of us out to the ccp, too.",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "TRVL",
        "time": "13 hours ago",
        "context": "Big Apple",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sedonalar355",
        "time": "19 hours ago",
        "context": "I already moved on from Apple phone and won't be going back.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "AGRBMNC",
        "time": "16 hours ago",
        "context": "It seems I may have made my last Apple purchase if Cook et. al. are that unAmerican. ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "slovenianho",
        "time": "15 hours ago",
        "context": "Haha.  Americans have been just fine watching companies outsource labor to China for decades, but NOW it's a problem?",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "AlwaysAProudAmerican",
        "time": "14 hours ago",
        "context": "Apple products are way overpriced, have the same problems as all the other manufacturers of computers, phones that are lower in price.....refuse to support any liberal socialist democrats or their company...",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "2dcorps",
        "time": "12 hours ago",
        "context": "THIS IS WHY THE SENATE SHOULD HAVE VOTED NO ON THE CHIPS BILL! The bill lacked enforcement of banning the buying of chips from China. If a company is in telecom, defense, pharmaceutical or government industry work the buying of Chinese chips should be disallowed. The measure was in the original bill the DROPPED B4 PASSING THE FINAL BILL! ENOUGH OF CHINA TECH IN OUR COUNTRY!!!! ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jmar65",
        "time": "17 hours ago",
        "context": "Don’t do it,Tim. Raise the price if you must, but don’t give China access to our chip-making technology.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "jasonf148",
                "time": "16 hours ago",
                "context": "Toddler Tyrant already gave it to them. Tossed it in as freebie for buying 3 or more of our defense secrets.",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "allahBS",
        "time": "13 hours ago",
        "context": "WAIT A SECOND SO WHERE DO OTHER CELL PHONE COMPANIES GET CHIP ?",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "2dcorps",
                "time": "12 hours ago",
                "context": "Taiwan and China",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "Darrin.O",
        "time": "18 hours ago",
        "context": "This will be my last Apple product ever…and the chips won’t be returned. They’ll be hammered into the ground. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "hoozzurdaddy",
        "time": "18 hours ago",
        "context": "Apple wants to have Chinese made chips....Trump had MAGA ties and hats made there...tomato, tomatoe.....except crickets when Trump did it.",
        "good": "0",
        "bad": "3",
        "replies": [
            {
                "user_name": "tubeguy",
                "time": "18 hours ago",
                "context": "Show us a single official MAGA product made in China, genius.  Just one.  Betcha can't.  That's because they don't exist.",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "rpritter253",
                "time": "17 hours ago",
                "context": "Proof? I thought so ...",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "jimbo7860",
        "time": "14 hours ago",
        "context": "US Govt will drop them like a rock.  No more Apple electronics for US Govt employees.",
        "good": "5",
        "bad": "0",
        "replies": [
            {
                "user_name": "vetteacher326",
                "time": "11 hours ago",
                "context": "With China Joe? He will go sole source to Apple.",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "lovefreedomhatelibs",
        "time": "14 hours ago",
        "context": "I didn't buy Apple products because they are so expensive but now I have another reason.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ATRadar",
        "time": "18 hours ago",
        "context": "Have never bought an APPLE product or ever will, totally over priced! I would force them to make and use USA made chips.",
        "good": "3",
        "bad": "0",
        "replies": [
            {
                "user_name": "advocatus.diaboli",
                "time": "18 hours ago",
                "context": "So you use an American made phone?  Or do you prefer Samsung phones made in communist Vietnam?",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "ricnok#fjb",
        "time": "12 hours ago",
        "context": "Memo to America's Corporate CEO's: Corporate Political choices influence my purchasing decisions. If you express no political bent, I will buy. However, if you offend my sensibilities with your political views, then your brands and products are forever dead to me.",
        "good": "5",
        "bad": "0",
        "replies": [
            {
                "user_name": "RagingConservative",
                "time": "9 hours ago",
                "context": "America’s Corporate CEOs response: 😂🤣🖕🏻",
                "good": "0",
                "bad": "1",
                "replies": []
            },
            {
                "user_name": "mattgaetzsvenmo",
                "time": "8 hours ago",
                "context": "How did the takedown of the NFL, Coke, Nike, Keurig etc go?",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "advocatus.diaboli",
        "time": "18 hours ago",
        "context": "Not really fair to point the finger at Apple.  Pretty much EVERY large corporation manufacturers in China",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "YourHoliness",
                "time": "16 hours ago",
                "context": "And how did that work out for them when the supply chain crisis hit?",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "jasonf148",
                        "time": "16 hours ago",
                        "context": "You RINO!! There was no pandemic, there was no COVID, there was no supply chain crisis!!!  It's all Biden's fault.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "advocatus.diaboli",
                        "time": "15 hours ago",
                        "context": "Same as for other companies.  Nothing unique about Apple",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "bosco33",
        "time": "18 hours ago",
        "context": "Memo to multi-national American companies and the American Oligarchs who run them...Your all mighty buck or your country,   choose....",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "spastic338",
        "time": "15 hours ago",
        "context": "I'm not paying  800 for a phone🤪idiots.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sheriff32",
        "time": "15 hours ago",
        "context": "Apple’s actions are stunning given the geopolitical tensions between Beijing and Washington. They also reveal that corporate America is hopelessly hooked on cheap Chinese goods, doesn’t mind undercutting U.S. competitiveness in a critical industry, and is willing to sacrifice our security all in order to save a buck.\nwhy should apple care about the fighting between countries. They're a global capitalist company",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "jasonf148",
        "time": "14 hours ago",
        "context": "Toddler Tyrant stealing our nation's top secret docs isn't a security concern but Tim Allen is",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "jrdobbs",
                "time": "14 hours ago",
                "context": "I would consider 128-layer NAND flash technology a \"top secret\".",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "rpritter253",
        "time": "17 hours ago",
        "context": "Boycott Apple ... they are a CCP tool.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "jasonf148",
                "time": "16 hours ago",
                "context": "Boycott tRump. He stole our nation's top secret classified docs and sold them to Xi.",
                "good": "1",
                "bad": "2",
                "replies": [
                    {
                        "user_name": "rpritter253",
                        "time": "13 hours ago",
                        "context": "Hey, comrade! I was wondering when they were going to let you start using a keyboard. Good for you! How's the weather in Moscow?",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "roadhouse99",
        "time": "15 hours ago",
        "context": "Another reason I'll never buy Apple.  Android rules!",
        "good": "0",
        "bad": "1",
        "replies": [
            {
                "user_name": "nemoosewalk",
                "time": "11 hours ago",
                "context": "Where do you think all the chips come from? 😎🤡🤡🤡🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "nika01",
        "time": "15 hours ago",
        "context": "Apple is an evil company",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Tony9080",
        "time": "13 hours ago",
        "context": "Apple is anti-American.  We need to have laws prohibiting American companies from using chips (or anything) manufactured or imported from any non- democratic country.  If the government is not duly and fairly elected then we don’t do business with them.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "gdpolitics2",
        "time": "18 hours ago",
        "context": "if apple goes there then stop buying all apple products",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "spastic338",
        "time": "15 hours ago",
        "context": "Amen k I won't buy anything  Apple sells!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "truthisoutthere783",
        "time": "11 hours ago",
        "context": "The Apple is rotten. ",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "zbigfish",
        "time": "6 hours ago",
        "context": "I have never bought an Apple product. And probably never will now. I  Get  bye without it.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "RagingConservative",
        "time": "9 hours ago",
        "context": "OUTRAGE! 😤🤬 A company using capitalist and free trade principles! OUTRAGEOUS! 😤🤬",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "nemoosewalk",
        "time": "11 hours ago",
        "context": "Make the chips here… Not happy with their thinking… China could use them against us… 😎👎🏻👎🏻👎🏻",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "PurSass",
                "time": "8 hours ago",
                "context": "That’s exactly what the plan is and by design by our federal government.",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "joebush",
        "time": "9 hours ago",
        "context": "Apple doesn't care about the United States, they only care about their bottom line.",
        "good": "3",
        "bad": "0",
        "replies": [
            {
                "user_name": "mattgaetzsvenmo",
                "time": "8 hours ago",
                "context": "Like Trump and his made in China ties?",
                "good": "0",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "trevorisland",
        "time": "9 minutes ago",
        "context": "GOSH, do you think Apple courts Communists?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "robb521556",
        "time": "19 minutes ago",
        "context": "Why don’t US make their own chips?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "DarenG.",
        "time": "9 hours ago",
        "context": "Repeal Apples business license in the U.S. and make an example of their Pro C.C.P. anti American and European business practices.",
        "good": "2",
        "bad": "1",
        "replies": [
            {
                "user_name": "mattgaetzsvenmo",
                "time": "8 hours ago",
                "context": "Lol",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "liberty4us:)",
        "time": "32 minutes ago",
        "context": "Enough is enough…. I will not buy anymore Apple products going forward",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "catfandu",
        "time": "3 hours ago",
        "context": "Follow the money.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "vetteacher326",
        "time": "11 hours ago",
        "context": "Boycott Apple. Are they so out of touch? Do they want to lose what American Market they still have?",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "👼‍SuperFlyJesusFreak👼‍",
        "time": "11 hours ago",
        "context": "I guess the author doesn't believe in free trade.",
        "good": "1",
        "bad": "2",
        "replies": []
    }
]