[
    {
        "user_name": "delcatforfacts",
        "time": "6 July, 2022",
        "context": "Their mostly clueless, \"let's try this and see what happens\" then make up a story to explain it. So many totally wrong hypotheses out there that are accepted as gospel. We are truly monkeys playing with things we don't even understand enough about to realize we're lost. In 100 years we might realize how ignorant we really are.",
        "good": "1",
        "bad": "3",
        "replies": [
            {
                "user_name": "thunker54",
                "time": "6 July, 2022",
                "context": "So what do you propose? Just sitting and doing nothing to learn more? Science has ALWAYS evolved as we learn more. Experimenting, theorizing and testing is part of the scientific method. And yes, theories change as we learn. That's what theories are for.\n And, yes, today we realize how ignorant we were 100 years ago too. Any generation can look 100 years into their past and marvel at how little they knew then.",
                "good": "1",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "ittoflex",
                "time": "6 July, 2022",
                "context": "The true monkey here is the one that cannot spell they're!",
                "good": "4",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "ArchenlandKnight",
                "time": "6 July, 2022",
                "context": "All true. But it's how we learn things. You're literally describing the process of discovery. Yes, we're going to get results we don't understand. We're likely to be wrong in our conclusions at first.\n\nBut then more experiments will be done. More observations will be made. New data will be combined with old data and we'll say, \"Hmm. Maybe it makes more sense that ... \".\n\nI think what you're reacting to is the arrogance perceived by the public to exist among research scientists. Well ... I agree. They can be arrogant. And narrow minded. And are often so consumed with Cognitive Dissonance and Confirmation Bias that they can't see the truth when it slaps them in the face. And though I think it is often subconscious, they are often terrified to go against the current thinking and so make conclusions based more on politics or convention than on the actual evidence.\n\nBut none of that is a reason to stop doing the experiments. Quite the opposite really. The only way to overcome the biases is data, data, and more data. The only hope we have of purging the influence of convention and politics from science is to have enough data to prove the truth beyond any human ability to ignore. And that, my friend, will take an awful lot of data.",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "doomslayer739",
        "time": "6 July, 2022",
        "context": "They are messing with powers that arent meant for mortal minds.",
        "good": "4",
        "bad": "7",
        "replies": [
            {
                "user_name": "iamcarl",
                "time": "6 July, 2022",
                "context": "I think Thag said the same to Ook when he discovered fire.",
                "good": "4",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "hermtownhomy252",
                        "time": "6 July, 2022",
                        "context": "Yup.  People said when railroads were making advances in locomotives that people simply couldn't survive velocities over 40 mph.  Human intelligence spans a great amount, from one end of the IQ spectrum all the way to doomslayer.",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "ittoflex",
                        "time": "6 July, 2022",
                        "context": "I think Tran said the same thing to Xi when he discovered gun powder!",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "sylvestermann",
        "time": "6 July, 2022",
        "context": "Let us give credit to whom credit is due.  Rosalind Franklin discovered the double-helix structure of the DNA molecule in 1953 even though Crick and Watson took the credit for it.  It was Christopher Marlowe who wrote all the plays and sonnets attributed to Shakespeare.",
        "good": "6",
        "bad": "5",
        "replies": [
            {
                "user_name": "hartnavy",
                "time": "6 July, 2022",
                "context": "It was Biden who said inflation is transitory.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "sylvestermann",
                        "time": "6 July, 2022",
                        "context": "I believe that Biden should get credit for all his mistakes.",
                        "good": "2",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "sylvestermann",
                        "time": "6 July, 2022",
                        "context": "Were you in the Navy?  I was from 1982-1984.  I was an electronic warfare technician aboard the USS Wabash AOR-5.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "hartnavy",
                                "time": "6 July, 2022",
                                "context": "'96-'16, ATC on CVN-71, 65, 68 and LHA-4",
                                "good": "2",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "sylvestermann",
                                        "time": "6 July, 2022",
                                        "context": "My ship was within 300 yards abeam of the Kitty Hawk CV-63 when she was accidentally collided into by a Soviet submarine in the Sea of Japan in 1984.\nATC?  Air Training Command?  Wikipedia article on that is accurate unlike the Wikipedia article on the USS Stark missile strikes which has been cleansed.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": [
                                            {
                                                "user_name": "hartnavy",
                                                "time": "6 July, 2022",
                                                "context": "Chief Aviation Electronics  Technician",
                                                "good": "0",
                                                "bad": "0",
                                                "replies": [
                                                    {
                                                        "user_name": "sylvestermann",
                                                        "time": "6 July, 2022",
                                                        "context": "Then we studied much of the same electronics.",
                                                        "good": "0",
                                                        "bad": "0",
                                                        "replies": [
                                                            {
                                                                "user_name": "hartnavy",
                                                                "time": "6 July, 2022",
                                                                "context": "Yep, completed the BSEE while active on TA.",
                                                                "good": "1",
                                                                "bad": "0",
                                                                "replies": [
                                                                    {
                                                                        "user_name": "sylvestermann",
                                                                        "time": "6 July, 2022",
                                                                        "context": "Congratulations.  I did not stick out my program of study at Michigan State.  I am not even a college graduate.  I never got beyond Kirchhoff's circuit laws and my sophomore year which is when I decided to join the Navy.",
                                                                        "good": "0",
                                                                        "bad": "0",
                                                                        "replies": []
                                                                    }
                                                                ]
                                                            }
                                                        ]
                                                    },
                                                    {
                                                        "user_name": "sylvestermann",
                                                        "time": "6 July, 2022",
                                                        "context": "I got my start with electronics early.  In 1984 at the age of 14 I earned my Novice Class Amateur Radio License, WN8RAU.  For the theory part of the test we only needed to understand the A, B and C-class amplifiers.  There was not a single question on transistors or op-amps on that test.  Years later I learned digital electronics on my own.",
                                                        "good": "0",
                                                        "bad": "0",
                                                        "replies": []
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "endymio",
                "time": "6 July, 2022",
                "context": "You're a clueless buffoon who drank the liberal kool-aid.  Franklin didn't \"discover\" anything.  She took some x-ray photographs, under precise direction from Crick and Watson.  The tough part of the discovery was the deduction that the interference pattern thus observed could best be explained by a helical structured molecule -- and she had absolutely zero to do with that.",
                "good": "3",
                "bad": "2",
                "replies": [
                    {
                        "user_name": "sylvestermann",
                        "time": "6 July, 2022",
                        "context": "You lost all credibility the moment you insulted me.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "endymio",
                                "time": "6 July, 2022",
                                "context": "Truth hurts, eh Princess?",
                                "good": "1",
                                "bad": "0",
                                "replies": []
                            },
                            {
                                "user_name": "sjmaus",
                                "time": "6 July, 2022",
                                "context": "you lost all credibility the moment you lied.",
                                "good": "2",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "user_name": "cannonfodder827",
                        "time": "6 July, 2022",
                        "context": "Team work made it happen, having the right people at the right time! No need to glorify it in any direction",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "endymio",
                                "time": "6 July, 2022",
                                "context": "The \"team\" was Watson and Crick.  You might as well credit the \"teamwork\" of the janitor who allowed them to focus on their work, rather than tripping over trash on the floor.",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "user_name": "sylvestermann",
                        "time": "7 July, 2022",
                        "context": "The grape-flavored drink laced with cyanide at Jonestown was NOT Kool-Aid.  It was called Flavor Aid.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "salmonking",
                "time": "6 July, 2022",
                "context": "Rosalind Franklin was a black with a masters degree who held on to the x-ray for 3 weeks of the beginning of the double helix but could not figure out its real form. Watson found the combination to the safe and quickly deduced the true form of the double helix and the rest is history. Franklin was not smart enough to figure it out - get your history right!!!",
                "good": "4",
                "bad": "7",
                "replies": [
                    {
                        "user_name": "sylvestermann",
                        "time": "7 July, 2022",
                        "context": "Franklin was a Jew with no African ancestry.  But I suppose you also think Beethooven was a black African.",
                        "good": "3",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "spinynorman262",
                        "time": "8 July, 2022",
                        "context": "You got your history very, very wrong. Are you a product of home-schooling?",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "brylcreamboomer",
                "time": "7 July, 2022",
                "context": "Oh sure...then how do you explain Biden our Mail Order President?",
                "good": "2",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "moralsense7",
                "time": "8 July, 2022",
                "context": "What does your comment have to do with the article?",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "sylvestermann",
                        "time": "24 July, 2022",
                        "context": "Nothing.  Why didn't you just ignore it?  I filter out stuff not pertinent all the time.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "moralsense7",
                                "time": "25 July, 2022",
                                "context": "I note two items in this thread:\nYou really like to talk.\nYou avoided answering my question.",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "sylvestermann",
        "time": "6 July, 2022",
        "context": "In 1982 I was given a personal tour of the Bevatron by an engineer who worked there.  There were no experiments going on at the time and there was not even any liquid hydrogen in the bubble chamber.  I had a Secret - No Foreign security clearance due to being an electronic warfare technician in the Navy so was able to enter the campus of the Lawrence Berkeley National Laboratory.",
        "good": "0",
        "bad": "1",
        "replies": [
            {
                "user_name": "rubiks6",
                "time": "7 July, 2022",
                "context": "So what.",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "deadpossum",
                "time": "8 July, 2022",
                "context": "Sorry guy..why would you even publicize that?",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "hiediplf",
        "time": "6 July, 2022",
        "context": "This is not going to turn out good.",
        "good": "1",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "skeff",
        "time": "6 July, 2022",
        "context": "How much electricity does the thing run on and what's its source? Is it carbon neutral? Were its components environmentally and socially responsibly mined, refined, manufactured and shipped in an eco-friendly way? Were any trees harmed during its construction? What about the bees? 🤨🙄😏",
        "good": "9",
        "bad": "4",
        "replies": [
            {
                "user_name": "sylvestermann",
                "time": "6 July, 2022",
                "context": "Do you have a basic understanding of \"electricity\"?  A Watt of electricity is a measure of power, not energy.  A 60-watt incandescent light bulb is powered by 60 watts of electrical energy but only gives me less than a watt of lumens in light energy I use in that hour.  I am charged by the number light-hours I use, a measure of energy and not power.  I pay about 9 cents per watt-hour of energy I use in my house.  That means I pay 9 x 60 cents, 59 cents, for every hour I have that 60-watt light bulb lit.",
                "good": "2",
                "bad": "6",
                "replies": [
                    {
                        "user_name": "DontbeaKaren977",
                        "time": "6 July, 2022",
                        "context": "You pay 9 cents per kilowatt hour. You can run ten 100 watt light bulbs for one hour and it will cost you 9 cents or you can run one 1000 watt bulb for one hour and it will cost you 9 cents. Your the one that don't seem to have a grasp of basic electricity.",
                        "good": "3",
                        "bad": "1",
                        "replies": []
                    },
                    {
                        "user_name": "skeff",
                        "time": "8 July, 2022",
                        "context": "Do you have a basic understanding of satire? BTW: It uses 600 GWh per year, which could also power 450,000,000 homes. Africa might appreciate that. But, it's for science, so it's okay. Right?",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "lycopine",
                                "time": "11 July, 2022",
                                "context": "oh, well, geeeez. Why not eliminate the military worldwide and see how much that saves too. The world's population would appreciate that, but it's for death and destruction as controlled by thugs, dictators and paranoid leaders while profiting the war industry, so that's ok. Right?",
                                "good": "0",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "skeff",
                                        "time": "11 July, 2022",
                                        "context": "🤣",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "user_name": "moralsense7",
                        "time": "8 July, 2022",
                        "context": "You obviously missed the intended sarcasm/humor of skeff's comment.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "SunnyDay",
                        "time": "8 July, 2022",
                        "context": "Do you have a basic understanding of sarcasm?  It seems the entire purpose and meaning of the original post went over your head.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "skeff",
                                "time": "9 July, 2022",
                                "context": "Easy flight, low altitude... 😏",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "user_name": "swflcp",
                        "time": "9 July, 2022",
                        "context": "Are you commenting on the right post?   He says nothing about watts.     How much electricity is pretty common terminology and I do understand electricity/electronics.    Maybe he should have said how many amp/hours does it use?",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "sylvestermann",
                                "time": "9 July, 2022",
                                "context": "I will simply say that a watt (named after James Watt of steam engine fame) is a unit of power, not energy.  My electric bill has many charges, mostly taxes and distribution costs.  Part of this bill is the actual electric ENERGY I used.  I pay 9 cents per kilowatt-hour.",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "user_name": "skeff",
                        "time": "9 July, 2022",
                        "context": "Would it make you happy if I said \"How much electrical power does it consume?\" 🙄",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "reconsurgeon",
                "time": "8 July, 2022",
                "context": "Left up to the ‘green-dreamers’, hard science research would grind to a halt…",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "esox07",
        "time": "6 July, 2022",
        "context": "Yah, in my 60+ years, I have found that usually when you bang stuff together, bad things happen.",
        "good": "3",
        "bad": "0",
        "replies": [
            {
                "user_name": "samaiel",
                "time": "6 July, 2022",
                "context": "When things banged together you happened.. 60+ years and 10 months ago.",
                "good": "4",
                "bad": "1",
                "replies": []
            },
            {
                "user_name": "quietsmith",
                "time": "6 July, 2022",
                "context": "Learning new things is scary, I know.",
                "good": "0",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "ididndonuffin",
                        "time": "7 July, 2022",
                        "context": "It was a joke.  Maybe you have to be older than 12 to get it.",
                        "good": "0",
                        "bad": "1",
                        "replies": [
                            {
                                "user_name": "quietsmith",
                                "time": "8 July, 2022",
                                "context": "Oh? Well when you get past that age yourself let us know :D The rest of us may be too old to understand it with the sort of child like naivety you have.",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "ArchenlandKnight",
                "time": "6 July, 2022",
                "context": "Depends on your definition of \"bad things\".",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "walterkertz",
        "time": "6 July, 2022",
        "context": "A trillion electronvolts is about the kinetic energy of a flying mosquito.\nSo 13.6 TeV is not really that impressive.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "endymio",
                "time": "6 July, 2022",
                "context": "Yes it is.  If you accelerated an entire mosquito to that velocity, it would have more kinetic energy than every automobile in the entire world.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "sjmaus",
                        "time": "6 July, 2022",
                        "context": "if you accelerated two ants to that speed and they collided, would they be atom ants?",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "sylvestermann",
                "time": "6 July, 2022",
                "context": "I am going to convert 13.6 TeV to BTUs.  You are correct that it is a measure of energy and not voltage or power.",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "sylvestermann",
                "time": "6 July, 2022",
                "context": "Actually it is impressive when one considers that this is the energy being imparted on a single subatomic particle like the electron or the much more massive proton.  13.6 TeV of kinetic energy is over 0.2 BTUs.",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "stuff741",
                "time": "7 July, 2022",
                "context": "It is that impressive when you realize a proton is about 10^24 times lighter than a mosquito. It only takes basic high school physics (p=mv) to show that the proton moves unbelievably faster than a mosquito with the same energy. Sure in reality the calculations get a bit trickier because of relativistic effects from being accelerated so fast, but the proton ends up traveling at 99% of the speed of light and the mosquito travels at 0.000000003 % of the speed of light. (Assuming the mosquito weighs .005g and travels at a velocity of 1 m/s)",
                "good": "2",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "svaap",
                "time": "7 July, 2022",
                "context": "Yes, but is it a laden or un-laden mosquito?",
                "good": "2",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "EDeploribusUnum",
                        "time": "7 July, 2022",
                        "context": "It’s all a matter of weight ratios",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "MakingItHappen919",
                        "time": "8 July, 2022",
                        "context": "Excellent movie! ",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "NormanBlanton",
        "time": "6 July, 2022",
        "context": "This is interesting ...\n\nbut I haven't seen how long these particles last,   Do they play an important roll in anything like the development of the early universe.\nI guess they show how quarks interact, but again how is that important.\na little more info would be nice...",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "brylcreamboomer",
                "time": "7 July, 2022",
                "context": "Well the Male Particles peak pretty fast while the Female Particles get a longer shelf live.",
                "good": "0",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "quietsmith",
        "time": "6 July, 2022",
        "context": "I wonder how long it'll take before the inevitable shift from \"they don't know therefore god\" to \"it's too complicated, therefore god\"",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "unidivi",
        "time": "8 July, 2022",
        "context": "The mysteries of the universe will continue to be unlocked, forever.",
        "good": "2",
        "bad": "0",
        "replies": [
            {
                "user_name": "reconsurgeon",
                "time": "9 July, 2022",
                "context": "Yes - great to look forward to continued challenges and discoveries!",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "JustKeith",
        "time": "8 July, 2022",
        "context": "3rd run since 2008...\nThis thing works less than Libbies, and costs way more.\nOr is there a Hillary presidential run joke in there somewhere?",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "quietsmith",
                "time": "9 July, 2022",
                "context": "Yes, building one of the largest and most complex pieces of technology in the world does come with some issues I guess.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "JustKeith",
                        "time": "9 July, 2022",
                        "context": "Like Obamacare.\nBut that's bureaucracy, not technology.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "quietsmith",
                                "time": "10 July, 2022",
                                "context": "Oh no, nothing like ObamaCare.\n\nThat was designed to fail on purpose.",
                                "good": "1",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "kamun",
                                        "time": "27 July, 2022",
                                        "context": "It's improved the lives of countless thousands and reduced the overall cost of healthcare for our nation.\nAnybody can point out problems.  Solutions are the challenge.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": [
                                            {
                                                "user_name": "quietsmith",
                                                "time": "27 July, 2022",
                                                "context": "\"reduced the overall cost\"\n\nBwahahaha! Tell us more nonsense. The cost of health insurance went up, dramatically. \n\nObamaCare was and remains an abysmal failure and after the left smugly waved around 'government take over of healthcare' as lie of the year, they weren't so keen to wave around 'if you like your plan you can keep it' was lie of the year after that.",
                                                "good": "0",
                                                "bad": "0",
                                                "replies": [
                                                    {
                                                        "user_name": "kamun",
                                                        "time": "27 July, 2022",
                                                        "context": "Prior to having insurance....uninsured were spending or not paying.  Insurance costs are not the whole story.\n\nThe total amount paid, directly or indirectly (lost productivity included) is lower than it had been.\n\nbtw.....did you not notice that health insurance costs were going up dramatically before Obamacare?  Obamacare is our effort to extend health insurance to all and to control costs.  We need to work on drug prices (guess which party opposes that?)",
                                                        "good": "0",
                                                        "bad": "0",
                                                        "replies": []
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "kamun",
                "time": "27 July, 2022",
                "context": "And the crazies who don't believe in science are screaming \"It's opening a portal to demons\".",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "delbert335",
        "time": "3 September, 2022",
        "context": "When they start this up, does it have an effect on the earth's rotation? The crust floats around the core, so does it cause a slight grabbing effect or slipping or nothing at all? What happens if the crust stops moving, even for a few seconds? Total worldwide destruction. Tidal waves miles high, 1000 mph winds, massive earthquakes?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "onfulldisplay",
        "time": "8 July, 2022",
        "context": "Can't wait until the world benefits from this.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "pinkfloydwasright",
        "time": "7 July, 2022",
        "context": "Has the question been settled as to whether the collider could accidentally trigger a black hole?",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "sciencerocks",
                "time": "7 July, 2022",
                "context": "Yes, the answer is no.",
                "good": "3",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "Shellback",
                "time": "8 July, 2022",
                "context": "Not enough mass to produce one. Maybe if they could stuff the Sun into it, they might get a small black hole.",
                "good": "3",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "13R",
                "time": "18 July, 2022",
                "context": "Maybe something like the movie, \"The Mist\" going on?!",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "hammondx",
        "time": "22 July, 2022",
        "context": "okay, so who killed Tupac?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dan5047628",
        "time": "6 July, 2022",
        "context": ".Billions of dollars and 10 years later we are still at \"\"COULD provide clues about the force that binds subatomic particles together\"\"\nIn short, a huge waste of money and still waiting on the micro Black Holes that could destroy the Planet some scientist insisted could be created by this thing.\nAnd we are worried about Global Warming",
        "good": "0",
        "bad": "13",
        "replies": [
            {
                "user_name": "g0disdead",
                "time": "6 July, 2022",
                "context": "Hey dummy, if this thing did create a micro-black hole (extremely unlikely given it doesn't even close to the energies of natural phenomena), it would evaporate in microseconds...",
                "good": "1",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "dan5047628",
                        "time": "7 July, 2022",
                        "context": "and I am supposed to believe a guy that insults me over scientists?",
                        "good": "0",
                        "bad": "2",
                        "replies": [
                            {
                                "user_name": "lycopine",
                                "time": "11 July, 2022",
                                "context": "are you also supposed to believe a book of fiction written centuries ago and translated so many times to the language you were taught?",
                                "good": "0",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "dan5047628",
                                        "time": "11 July, 2022",
                                        "context": "Yes I am. Our God commanded it.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": [
                                            {
                                                "user_name": "lycopine",
                                                "time": "11 July, 2022",
                                                "context": "well, the fact of the matter is MY god created your god and commanded humans to write the bible. So you are worshiping a false idol and god and believe the fiction of the bible as though it was fact. MY god performed those miracles to test humans' ability to separate fact from fiction. You and the rest of the jesus believing cults obviously failed that test...",
                                                "good": "0",
                                                "bad": "0",
                                                "replies": []
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "quietsmith",
                "time": "6 July, 2022",
                "context": "Oh hey the loser that thinks science is nothing but a big evil conspiracy against Jesus is here objectively terrified that we might learn something new about the universe that will, once again, not find any evidence for a god :D",
                "good": "1",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "dan5047628",
                        "time": "7 July, 2022",
                        "context": "Space has nothing to do with a conspiracy. I love space God created it and Jesus was there. I just hate wasting money on it. God gave us a real nice Planet to live and play on. Only a nut job would waste money trying to leave it. \nAlso insults are what we did in second grade. Grow up.\nSo tell me what I might learn about the Universe that will change my life. The only people getting their lives changed are those that  work for NASA and are being paid by our Tax Money???",
                        "good": "0",
                        "bad": "2",
                        "replies": [
                            {
                                "user_name": "fibonacci1.618",
                                "time": "8 July, 2022",
                                "context": "So you throw out an insult, and then immediately complain about insults.\nHow very interesting.",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            },
                            {
                                "user_name": "quietsmith",
                                "time": "8 July, 2022",
                                "context": "If you don't want to be called a loser that thinks science is a big evil conspiracy then don't be a loser that thinks science is a big evil conspiracy :D \n\nLearning new things is always worth while. It's how humanity improves now. As you've been told many times in the past when you were bawling your little eyes out over the fact that you despise science since it keeps showing you why you're wrong...\n\nMany technologies have been developed and released to the public for use because of NASA.",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "rubiks6",
                "time": "7 July, 2022",
                "context": "Not a waste of money. Those physicists and engineers need to eat and send their children to college, too.",
                "good": "1",
                "bad": "2",
                "replies": [
                    {
                        "user_name": "dan5047628",
                        "time": "7 July, 2022",
                        "context": "McDonald's is hiring, lol",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "quietsmith",
                                "time": "8 July, 2022",
                                "context": "Yes, it's where people who do nothing but study religious nonsense can work.",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "user_name": "lycopine",
                        "time": "11 July, 2022",
                        "context": "yeah, the REAL waste of money is allowing all those religions to get tax breaks so the rest of us can subsidize you skydaddy believers...",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "letsgetrel",
                "time": "8 July, 2022",
                "context": "We are worried about global warming as we should be..",
                "good": "1",
                "bad": "3",
                "replies": []
            },
            {
                "user_name": "reconsurgeon",
                "time": "9 July, 2022",
                "context": "Big questions (e.g. how the Universe works and why life exists) are worth it!",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "thunker54",
                "time": "9 July, 2022",
                "context": "NASA gets 0.47% of the total national budget.  That means all the other areas get 99.953%\nI don't understand why you \"wasting our money\" folks feel like 0.47% is too much.",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "lycopine",
                "time": "11 July, 2022",
                "context": "a much bigger waste of money if allowing all those tax deductions for religion that others  have to subsidize the god believing cults...",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "votered2020",
        "time": "8 July, 2022",
        "context": "Really cool machine there!  Have u ever looked close at this amazing device? I mean it is Awesome!",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "that'sawrap",
        "time": "13 July, 2022",
        "context": "Watch the CERN opening ritual ceremony.  (It's on YouTube.)  It is spooky and satanic.  \n\n\"Out of this door might come something, or we might send something through it.\" - Sergio Bertolucci, Director for Research and Scientific Computing at CERN",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "historian326",
        "time": "8 July, 2022",
        "context": "All we want out of it is nice fusion reactors. Thank you.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "reconsurgeon",
                "time": "9 July, 2022",
                "context": "I’ll take anti-grav drives too, when that graviton/antigraviton pair can be generated…",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "historian326",
                        "time": "9 July, 2022",
                        "context": "Good morning! You propose a wonderful concept, but I do not know the science behind anti-grav drive. Fusion reactors are another matter and we are getting closer every year. We have sustained controlled fusion reactions in a magnetic 'bottle' for over 1 minute now. Since hydrogen based fusion reactions give off no radiation, when we perfect them for commercial use that would mean unlimited clean energy for the World. What a game-changer! We are getting closer to energy break-even with them. It takes a LOT of energy to get a fusion reaction going and then it is difficult to maintain the reaction. \nYet, I truly believe that we will get there. Best wishes to you, Recon!",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "kamun",
                                "time": "27 July, 2022",
                                "context": "Controlling gravitational force is a far-future event.\nWhen it is realized, all human experience that occurred before will be looked at as the primitive times.",
                                "good": "0",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "historian326",
                                        "time": "29 July, 2022",
                                        "context": "Hope that we are both right!",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": [
                                            {
                                                "user_name": "kamun",
                                                "time": "29 July, 2022",
                                                "context": "The CERN Accelerator and other modalities that are looking at elemental particles will get us to the point where we understand gravity and attractions.\nThe answer to \"What causes gravity?\" will open the door to the utilization of forces and energy as beyond our comprehension as the answer to the question is now.",
                                                "good": "0",
                                                "bad": "0",
                                                "replies": []
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "IndependentExRepublican",
        "time": "9 July, 2022",
        "context": "Build a bigger one on the moon. It could circle the entire moon. In fact, build two or three so they could plow sub-atomic particles into one another at various of obtuse and oblique angles.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "brandonrules",
        "time": "7 July, 2022",
        "context": "How do we ever get to the smallest particles ?  We keep finding smaller particles with each advance in science !",
        "good": "8",
        "bad": "0",
        "replies": [
            {
                "user_name": "dan5047628",
                "time": "7 July, 2022",
                "context": "Particles are particles",
                "good": "0",
                "bad": "6",
                "replies": []
            },
            {
                "user_name": "sciencerocks",
                "time": "8 July, 2022",
                "context": "It is fun to look at the etymology of words. The 'tom' in atom can be traced back to greek 'tome' that refers to cutting. Hence the word 'anatomy' which means 'to cut apart.'  'Atom' means that it cannot be cut apart (a-tome). Well, we've come a long way from that.\nResearh from the CERN experiments will refine that further, and is very exciting.",
                "good": "8",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "rubiks6",
        "time": "7 July, 2022",
        "context": "Will they build better nuclear weapons? We need better nuclear weapons.",
        "good": "2",
        "bad": "5",
        "replies": [
            {
                "user_name": "fibonacci1.618",
                "time": "8 July, 2022",
                "context": "We need no nuclear weapons.",
                "good": "3",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "rubiks6",
                        "time": "8 July, 2022",
                        "context": "We need no CERN, either.",
                        "good": "0",
                        "bad": "3",
                        "replies": [
                            {
                                "user_name": "fibonacci1.618",
                                "time": "8 July, 2022",
                                "context": "Of what are you afraid?",
                                "good": "2",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "rubiks6",
                                        "time": "8 July, 2022",
                                        "context": "Nuclear bombs are pretty scary.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": []
                                    },
                                    {
                                        "user_name": "quietsmith",
                                        "time": "9 July, 2022",
                                        "context": "He's terrified of knowledge, because he's one of those people that thinks science is one big evil conspiracy against Jesus.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": []
                                    }
                                ]
                            },
                            {
                                "user_name": "lycopine",
                                "time": "11 July, 2022",
                                "context": "and we definitely DON'T need jesus and religion, all fabricated human inventions for the ignorant...",
                                "good": "0",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "rubiks6",
                                        "time": "12 July, 2022",
                                        "context": "Says you. (Snore)",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "williamm23",
                "time": "8 July, 2022",
                "context": "No, better nuclear power. Toxic pinwheels and solar planks are the future superfund expenditures.",
                "good": "1",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "halaires",
        "time": "7 July, 2022",
        "context": "Maybe they will solve something when they get all the \"quarks\" worked out.",
        "good": "6",
        "bad": "0",
        "replies": [
            {
                "user_name": "moralsense7",
                "time": "8 July, 2022",
                "context": "Now that's funny!",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "MakingItHappen919",
                "time": "8 July, 2022",
                "context": "Finally, a joke that had me spinning from top to bottom! ",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "ivanyakinov048",
        "time": "8 July, 2022",
        "context": "Never trust a proton, neutron or an electron. They make up everything!",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "reconsurgeon",
                "time": "9 July, 2022",
                "context": "Quark, quark, quark…",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "brylcreamboomer",
        "time": "7 July, 2022",
        "context": "We all know that these exotic particles are held together by Super-Duper-Duper-Glue.",
        "good": "6",
        "bad": "0",
        "replies": []
    }
]