[
    {
        "user_name": "abbarrett",
        "time": "29 April, 2021",
        "context": "Putting nasty harmful 5G broadband satellites in orbit will kill us all. African American Musk? Whose the idiot. ",
        "good": "0",
        "bad": "27",
        "replies": [
            {
                "user_name": "erikeriksen",
                "time": "29 April, 2021",
                "context": "YOU are...  I have some really SENSATIONAL clues for sale... you need at least a full case of them....",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "liamd34",
                        "time": "29 April, 2021",
                        "context": "He only needs one for now.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "Sleepr",
        "time": "29 April, 2021",
        "context": "amazon says it will harm public interest while they ban books and sensor free speech",
        "good": "45",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "digdub",
        "time": "29 April, 2021",
        "context": "Richmond Valentine?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ibackblue",
        "time": "29 April, 2021",
        "context": "As if we don’t have enough garbage on earth we need more Garbage orbiting the planet Broadband who cares",
        "good": "1",
        "bad": "16",
        "replies": [
            {
                "user_name": "miles",
                "time": "29 April, 2021",
                "context": "Odd perspective ... I am pretty sure you use broadband at home and at work if it's available in your area \n\nEvery restaurant, gas station, and store you use also depends on a broadband connection if it's available \n\nmusk is just adding coverage area and bringing more competition to market place which benefits consumers ... Win win win for everybody",
                "good": "3",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "error": "error"
    },
    {
        "user_name": "dr.jrsmith",
        "time": "29 April, 2021",
        "context": "You know I always thought he was kind of a goof feeding of government green subsidies ... but dig a little deeper and this guy seems to have kind of a touch for innovation, business, awareness of what industries to expand into and just a general good insight into future technologies. He's good for the country.",
        "good": "57",
        "bad": "5",
        "replies": [
            {
                "user_name": "HonestAbraham",
                "time": "29 April, 2021",
                "context": "Actually he's a bit of a cult of personality scammer in my opinion. Making more money off selling carbon credits and environmentally harmful Bitcoin holdings than actually selling green products. Not to mention his Space X rocket pollution and future solar panel and battery waste, plus contributing heavily to the final frontier of space junk. Add in his self serving stock market manipulation via his tweets to the follower Musketeer crowd and you can see the man is far from what he presents himself to be.",
                "good": "4",
                "bad": "29",
                "replies": [
                    {
                        "user_name": "Pathfinder12",
                        "time": "29 April, 2021",
                        "context": "SpaceX doesn’t use solid rocket engines like some of the others. Starship will even be cleaner by using methane. \nBy the way CO2 is not a pollutant.",
                        "good": "5",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "mandyalaska",
        "time": "29 April, 2021",
        "context": "Yes!",
        "good": "7",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "SagittariusA*",
        "time": "29 April, 2021",
        "context": "Kuiper (Amazon) and Viasat are completely jealous. Especially because SpaceX got permission to fly their satellites in a lower orbit. Sorry Amazon and Viasat. You’re already in the back news of the US.",
        "good": "35",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "error": "error"
    },
    {
        "user_name": "iruur1",
        "time": "29 April, 2021",
        "context": "Broadband means 5G. This launch is part of a project to blanket the earth with 5G A.I. upload and download, through a centralized control, monitoring and communications system.",
        "good": "0",
        "bad": "2",
        "replies": [
            {
                "user_name": "slacktoad",
                "time": "29 April, 2021",
                "context": "Starlink is not 5G, that's a short-range mobile phone standard and Starlink is a long-range home Internet system.",
                "good": "1",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "iruur1",
                        "time": "29 April, 2021",
                        "context": "OK. that's interesting. I think it matters. The biggest contract they have that I know about, in terms of satellite launches is the 5G with over 100 launches planned. You sure the 2 don't connect together as one package, short and long range to cover the earth in complete square inch coverage? Thanks for the distinction, between the 2. It was about 3 mo ago I read it.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "OhDems",
        "time": "29 April, 2021",
        "context": "Liberals hate musk because he’s a brain that absorbs a lot and not afraid to take risk. True go getter. Went from a hater to a total admirer. Keep kicking butt musk ",
        "good": "27",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "BlueQuill",
        "time": "30 April, 2021",
        "context": "How about stationing a batch of these Starlink satellites above some Communist countries?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ish407",
        "time": "29 April, 2021",
        "context": "I’m at the point where I see this and say “oh look at that, another launch”. When I first moved to Central FL I’d see them all but after a while it loses its magic. I only wait for the big ones now. Lol! Yes I’m spoiled, I live in Florida where Mickey Mouse reigns supreme and SpaceX is his transportation of choice!",
        "good": "4",
        "bad": "2",
        "replies": [
            {
                "user_name": "cknotts953",
                "time": "29 April, 2021",
                "context": "I live about 6 miles from launch pads. If I'm not traveling I still watch them all. never gets old to me. ",
                "good": "8",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "Yehoodi",
        "time": "29 April, 2021",
        "context": "Musk is the Steely-eyed Missileman of our time, and naturally that attracts haters.  With Starlink, the broadband companies will finally have to face something they have vigorously worked to oppose...competition.",
        "good": "22",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ymu",
        "time": "29 April, 2021",
        "context": "Groovy!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "USAgt",
        "time": "29 April, 2021",
        "context": "Has OBiden taken credit yet?",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "swuanneecowgirl",
        "time": "29 April, 2021",
        "context": "Joe Biden worst president in 75 years. \nImpeach!",
        "good": "51",
        "bad": "9",
        "replies": [
            {
                "user_name": "miles",
                "time": "29 April, 2021",
                "context": "Not a fan of sleepy creepy joe either but what's that have to do with this article?",
                "good": "14",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "swuanneecowgirl",
        "time": "29 April, 2021",
        "context": "saw the  liftoff live.\nOMG.  beautiful in the night sky.",
        "good": "10",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "FrankK119",
        "time": "29 April, 2021",
        "context": "Just a thought. What are all of these rocket launches doing to the environment and why aren’t the green left jumping up and down about it?",
        "good": "13",
        "bad": "9",
        "replies": [
            {
                "user_name": "ObeseIllegitimo676",
                "time": "29 April, 2021",
                "context": "ObeseIllegitimo792\nJust Now\n\nThey give the left greater internet access so they can twit, Er, tweet more. They only complain when it suits them. Situational ethics, a hallmark of the left.",
                "good": "10",
                "bad": "1",
                "replies": []
            },
            {
                "user_name": "planeguy47674",
                "time": "29 April, 2021",
                "context": "Because the heat etc, given off by the rockets is like a lit match in a room. Has no effect on climate.  An example of the forces involved. Take a hurricane. It has been proposed to use nukes to disrupt the formation. Science has stated that hurricanes produce more energy in 1 minute than all the world's combined nukes.",
                "good": "4",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "AZ85044",
        "time": "29 April, 2021",
        "context": "A thousand more launches like this, coupled with China's Artificial Sun reactor, and Earth will become it's very own Dyson Sphere in no time.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "free2air",
        "time": "29 April, 2021",
        "context": "Jeff Bezos legacy is destroying businesses and liberal propaganda. Amazon had its time. I’m sure like Microsoft they will always be around but no one is excited about those companies anymore.",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "yosemitesteve",
        "time": "30 April, 2021",
        "context": "I have never heard what the price is going to be for this internet service or speed just that it is going to be great for rural America.  Right now my wifes job pays for our internet.  Even though streaming movies can be slow and very interrupted at times I will be hard to pay if it is not much faster and more reliable.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "jpp001",
                "time": "30 April, 2021",
                "context": "Right now $100 but that may go lower in time.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "jonathanpi",
        "time": "29 April, 2021",
        "context": "One step closer to making instant, world-wide communication and streaming a reality.  Who'd have ever imagined such a thing happening?  Oh, right.  Sheep herders back two thousand years ago.",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "Grinder72",
        "time": "29 April, 2021",
        "context": "For those of us in remote areas this will be a game changer. Go SpaceX!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    }
]