[
    {
        "user_name": "fifteendowntozero",
        "time": "26 September, 2022",
        "context": "Lots of sharpies to redirect the storm!",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "slowpoke529",
        "time": "26 September, 2022",
        "context": "Too bad the stable genius isn't around to nuke the hurricane.",
        "good": "2",
        "bad": "4",
        "replies": [
            {
                "user_name": "theleftiscrazy",
                "time": "26 September, 2022",
                "context": "Nope, he's in Delaware napping",
                "good": "1",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "wjs70",
                        "time": "26 September, 2022",
                        "context": "Slow Joe sure BET DT Bad!",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "jailfordonnie",
                "time": "26 September, 2022",
                "context": "Or at least changing its path with his magic Sharpie.",
                "good": "1",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "yeahsureyabetchapal",
        "time": "26 September, 2022",
        "context": "Fortunately, there isn't much that can be damaged in Florida.",
        "good": "0",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "LLAP",
        "time": "26 September, 2022",
        "context": "The Weather Channel is focusing on derogatory info about DeSantis and Florida.  They are an entertainment channel.  At least Fox advocates for the people and safety.",
        "good": "2",
        "bad": "0",
        "replies": [
            {
                "user_name": "suzon",
                "time": "26 September, 2022",
                "context": "Derogatory???  I haven’t heard any. ",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "dcstewart8162",
                "time": "26 September, 2022",
                "context": "Is there any non-derogatory info about DeSantis? Trump says you can't even call him a conman when he's only swindling illegals to get on planes to \"woke\" cities. Planes that are owned by his donors and flights that are paid for by Floridians.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "maddoogg",
        "time": "26 September, 2022",
        "context": "This hurricane is a direct result of climate change due to Al Gore's jet spewing millions of tons of carbon into the atmosphere.\nThis hurricane is partly due to all the excess food that farmers have been providing just to feed Stacey Abrams.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "R_U_Still_Winning",
        "time": "26 September, 2022",
        "context": "Utterly useless information.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "suzon",
        "time": "26 September, 2022",
        "context": "It’s no wonder no one listens to Democrats anymore. All they do is lie and make derogatory comments.  ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ConservativesAreRight864",
        "time": "26 September, 2022",
        "context": "Beer.",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "jailfordonnie",
                "time": "26 September, 2022",
                "context": "Is that you, Kavanaugh?",
                "good": "0",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "normalamericanguy",
        "time": "26 September, 2022",
        "context": "The flag is red, white and blue.  That means we tolerate each other, conservative states, liberal states, and those in between. I do remember the three years of fires in a particular blue state, from 2018, 2019 and 2020.I also remember the red president telling me to \"rake my forests\" and delayed sending FEMA relief . .  to let his message sink in.  And it did, as the red states hate my state now more  than ever.  You don't know me, you never will, you don't know what I stand for, where  I go to church or how I was educated. But you hate me.  Because I live in a \"blue state\" as if that somehow makes me less American than you, or that you are somehow  better than me.   You aren't.  My horses that died in flames didn't know I was blue and you red, my small farm, that grew crops to feed  ALL Americans, were not politically weaponized.  So when my blue friend said \"I hope Floridians all drown, and any survivors of the hurricane consumed by alligators\", well ,I could only say one thing:  they are Americans.",
        "good": "3",
        "bad": "1",
        "replies": [
            {
                "user_name": "theshootist",
                "time": "26 September, 2022",
                "context": "can't be fixed, mate. \n\nLive and let live. #nationaldivorce.",
                "good": "1",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "eph6:10-20",
                "time": "26 September, 2022",
                "context": "Dear American, I agree with most of your message of \"tolerance\" regardless of politics.  In my humble opinion, I believe your frustration for \"delayed FEMA relief\" does not tell the whole story.  For example; your state governor has responsibility of doing their job of maintaining your forests as a \"proactive protection of state citizens\" first and not rely on Feds and Fed money to get the job done.\n\nIn relation, what is your philosophy of helping Red State Americans with the Border Crises caused by our Blue President and his Administration?",
                "good": "2",
                "bad": "0",
                "replies": []
            },
            {
                "error": "error"
            },
            {
                "user_name": "suzon",
                "time": "26 September, 2022",
                "context": "Funny you talk about the red white and blue, when it’s YOUR fellow blue friends who are more than happy to burn it.  ",
                "good": "2",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "Outlaw1967",
                "time": "26 September, 2022",
                "context": "It's weird then that I only see the left thinking people burning that exact flag and calling it free \"speech\", only the left taking a knee in protest during the national anthem. Now you want unity and sympathy? For 6 years now it's been the lefts agenda to make us feel ashamed about our history, our sacrifice,  and our love of God and country. Saying Sorry won't erase that. 🇺🇸",
                "good": "3",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "waconservativemom",
                "time": "26 September, 2022",
                "context": "I’m so sorry for your losses.  As a fellow blue stater, some of the nicest people I know are in a red state.  I was taken by surprise to see how biased and hypocritical mainstream media and blue state media are. They probably tell you a red president is delaying relief.  I don’t know the truth, but I also don’t put it past the blue states to let it all burn down so they can push their global warming agenda and make a lot of money off it.  (These politicians that have been in place for decades really don’t care about anyone and that fact can easily be seen for those willing to look.) I’m sorry to say but after the last 3 years I don’t put anything past anyone.  Like the Lord said, just keep loving your neighbors.",
                "good": "2",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "AmeliaPond",
                "time": "27 September, 2022",
                "context": "FYSA, during hurricane Katrina (just one example), federal aid (FEMA etc) was mustered at the LA state border within a few hours of the hurricane, but the state and local government officials were arguing for control and it was their actions that delayed FEMA/federal aid/support entry into the disaster zone.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "dinodonn",
        "time": "26 September, 2022",
        "context": "big tip.... stuff yer tucks where the sun don't shine...",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "hogslayer950",
        "time": "26 September, 2022",
        "context": "tip number one.... stock up on beer.  tip number two.... see tip number one.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "trumpsahero",
        "time": "26 September, 2022",
        "context": "watch out for snakes and gators and fire ants...water moccasins killed many people in hurricane Audrey.1957 Cameron Louisiana.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "wtp2021",
        "time": "26 September, 2022",
        "context": "Basically useless information. how about actual survival gear?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "spastic338",
        "time": "26 September, 2022",
        "context": "Don't move to hurricane  prone  areas.have a rainy day 😴",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dcstewart8162",
        "time": "26 September, 2022",
        "context": "Biden should have made DeSantis beg for disaster funds. At least for a little while.\n\n\"Hurricane and disaster prep: On 'Fox and Friends,' best tips for preparing for weather events\"",
        "good": "0",
        "bad": "4",
        "replies": [
            {
                "user_name": "Rover?",
                "time": "26 September, 2022",
                "context": "Biden cant even stay upright on a bicycle, finish a sentence, or breath without a cue card. just stop its embarrassing.",
                "good": "3",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "bettemoran",
        "time": "26 September, 2022",
        "context": "There are many who will say that a hurricane or tornado is preferable to the earthquakes of the West coast because you have time to prepare, but from what I've seen on the footage after tornados and hurricanes hit it doesn't look to me like anyone was particularly equipped to handle anything.",
        "good": "0",
        "bad": "0",
        "replies": []
    }
]