[
    {
        "user_name": "FatZero853",
        "time": "15 October, 2018",
        "context": "Must be a democrat push for more regulation. Wow, do they run scared all the time?\n\n\"Fox News was able to confirm that some of the best-selling consumer/commercial drones – which are widely available in stores and on the internet - are indeed capable of carrying enough weight to deliver payloads that could do serious damage.\"\n\n2 pounds at best for a store purchased drone.  Is RDX available to a consumer.  Nope.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "HooverBear",
        "time": "15 October, 2018",
        "context": "Scramble their control frequencies, watch them crash.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "fontlow",
        "time": "15 October, 2018",
        "context": "Let's do away with another fun toy/tool... because there are some twisted enough to use them to destroy... Sounds like a solid plan.  But wait, cars can carry bombs too, why aren't we regulating those off the market... or planes???  We have seen what a plane can do...  \nYOU CANNOT REGULATE YOURSELF INTO A SAFE PLACE...  Laws give consequence for acting incorrectly, they simply do not make anyone act the way they should...",
        "good": "8",
        "bad": "0",
        "replies": [
            {
                "user_name": "jaywye",
                "time": "15 October, 2018",
                "context": "dummy,this article isn't talking about regulating drones,it's about how to DEAL WITH them when one is detected. US airports have had several close encounters with small drones.\nthe problem is detecting them approaching,and how to down them or jam them before they get close enough to detonate or drop a pound of anthrax or ricin.",
                "good": "3",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "fontlow",
                        "time": "15 October, 2018",
                        "context": "No, you are highly limiting the scope of the discussion.  If what you are saying is all the article was about there would not be further discussion in it about the usefulness of drones far outweighing the current risks there in.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "jaywye",
        "time": "15 October, 2018",
        "context": "time to get the NAVAIR Spike missile into production. it's a \"fire and forget\" optically guided mini-missile,with a low cost compared to most guided missiles. it's perfectly suited for these drones.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tntl",
        "time": "15 October, 2018",
        "context": "Come-on, this is intelligence?\nOK, let me make it simple for you guys, these drones work on a set range of frequency for control, overwhelm the frequency with a powerful signal, total loss of control will occur.\nIf only our intelligence agencies has some intelligence it would make it a lot easier.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "jaywye",
                "time": "15 October, 2018",
                "context": "many small \"hobby\" drones are controlled by cellphone comm frequencies,so to jam them would be shutting down everybody's phones,and other devices too. it's also harder to jam spread-spectrum frequencies. \nthen there are the RC model frequencies,etc,etc. \nBTW,RC hobby planes are a type of drone,and they can carry fairly heavy payloads. Many of the military's drones derived from RC controlled hobby planes. some of the drones ISIS built could carry  grenades or larger explosive packages. Some were quite large.",
                "good": "3",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "justincase66",
                        "time": "15 October, 2018",
                        "context": "True, over the counter drones use set frequencies....which are easily modified.  What self respecting terrorist would use the out of the box channels?",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "tntl",
                "time": "15 October, 2018",
                "context": "Not true regardless of the frequency it is just as easy to jam, and very easy to control the area being jammed. That is exactly why the frequency that military drone function on is such a guarded secret.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "jaywye",
                        "time": "15 October, 2018",
                        "context": "UH,spread-spectrum is a form of frequency HOPPING. it's a wide-band signal,harder to jam. it's not a single frequency.",
                        "good": "2",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "tntl",
                                "time": "15 October, 2018",
                                "context": "That  is not a problem, it can be done even with rotating frequency, wide-band frequency is not a problem at all, it really boils down to signal strength.",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "error": "error"
            },
            {
                "user_name": "tntl",
                "time": "15 October, 2018",
                "context": "Give me an example of what you think these \"other ways\" are.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "IWinIWin",
        "time": "15 October, 2018",
        "context": "Drones are scary business.  They should be illegal for non-commercial and non- military consumers.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "jaywye",
                "time": "15 October, 2018",
                "context": "that genie is already out of the bottle. you can buy parts to make your own drones,and the programs or controlling them are online in many places.",
                "good": "1",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "IWinIWin",
                        "time": "15 October, 2018",
                        "context": "I know, and we're all going to regret it.  I saw a drone looking into our house through our skylight.  Not good.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "gsaogb",
                "time": "15 October, 2018",
                "context": "drones are scary except when the military uses them....for killing.....",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "IWinIWin",
                        "time": "15 October, 2018",
                        "context": "Drones are scary, regardless of who is using them.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "fontlow",
                "time": "15 October, 2018",
                "context": "If you feel that way, you should also be asking for the confiscation and destruction of all camera ready phones, lol.  Camera's are everywhere.\nI don't have a drone nor have a desire for one, but can see their appeal.",
                "good": "1",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "IWinIWin",
                        "time": "15 October, 2018",
                        "context": "Unless you're a peeping tom at the window, your phone camera isn't going to invade my privacy.  But I've already seen drones hovering high above my bathroom skylight.  I'm not cool with that.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "fontlow",
                "time": "15 October, 2018",
                "context": "People misuse all kinds of technology.  Nanny cams removed and put in bathroom stalls, skimmers to get your CC info... Not saying what you are experiencing is justified or right, because it isn't... but you don't outlaw computers because a very small number (compared to the general populace) twisted individuals do illegal and despicable thing on them.",
                "good": "2",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "IWinIWin",
                        "time": "16 October, 2018",
                        "context": "Yes, every piece of technology has the potential to be abused.  The problem with drones is they can be armed and dangerous to civilians, and surreptitiously so.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "fontlow",
                                "time": "16 October, 2018",
                                "context": "And cellphones can be attached to incendiary devices and bombs.  Nails can be used in bombs as well for shrapnel.  a car remote starter can be used as a remote detonator.  All just as dangerous... potentially.  Go after the people that misuse the tech, not the tech that can and usually is beneficial tot he public.",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "gsaogb",
        "time": "15 October, 2018",
        "context": "annual defense budget should be increased to $1.5 Trillion per year.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "FatZero853",
        "time": "15 October, 2018",
        "context": "Must be a democrat push\n\nPerceived threat and nothing more.  So far the odds are about 1 in 7 billion.  Not sure we need regulations for something that hasn't proven to be a threat.  \n\nThe threat isn't single drones.  It's the 15,000 pretargeted drones a Chinese sub could launch.\n\nIt takes at least $20K to produce a drone capable of carrying enough explosive to be a concern.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bullyragger720",
        "time": "15 October, 2018",
        "context": "...just wait until the bad guys start weaponizing squirrels, pigeons, dogs, and cats...then we'll have REAL problems!",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mkk41",
        "time": "15 October, 2018",
        "context": "Solution? 12ga shotgun , 3in magnum loads , #2 shot , full choke.",
        "good": "6",
        "bad": "0",
        "replies": [
            {
                "error": "error"
            }
        ]
    },
    {
        "user_name": "francis1572",
        "time": "3 January, 2019",
        "context": "Australia just passed a law that forces drone manufactures to hard code a unique ID on the circuitry and on the parts of a drone.  The drone when purchased must be licensed with the Austrailian government along with the Unique ID of the drone.  People who fly drones must be licensed to fly drones.  The licensee must provide the Unique ID of all drones they fly.\n\nAll drones must respond with their Unique ID when scanned by the civil Avation Authority.\n\nAll drones that do not meet this criteria will be considered hostile and destroyed.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "20yeara10guy",
        "time": "16 October, 2018",
        "context": "It's going to happen eventually.  It's no great feat to rig an improvised directional mine similar to a claymore to the underside of one of these & set it off above a crowd. There's plenty of expertise in Syria & Iraq right now that could do it & it will make its way here.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "karmijones",
        "time": "16 October, 2018",
        "context": "I suggest they train some people with 10 gauge Goose guns. A few good shooters can take out a \"flock of drones\" given enough practice.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "veryoldcop202",
        "time": "15 October, 2018",
        "context": "Just put a bounty on them ...it's good practice for dove season .",
        "good": "6",
        "bad": "0",
        "replies": [
            {
                "user_name": "User90210",
                "time": "16 October, 2018",
                "context": "That is actually an EXCELLENT idea!  Make the bounty 1/2 the retail price of the drone model and legalize shooting if it's semi-over your or your neighbors' private property, or outside of approved \"drone zones\".  BRAVO!!",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "Margincool",
        "time": "16 October, 2018",
        "context": "Shotguns for everybody!\nProblem not solved but greatly diminished.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "shavedkitty69",
        "time": "15 October, 2018",
        "context": "<<<agrees that airborne threats like mosquitoes are threatening defenses",
        "good": "1",
        "bad": "0",
        "replies": []
    }
]