[
    {
        "user_name": "Hondoxp589",
        "time": "4 June, 2021",
        "context": "I think the presence of Man on Earth is apart of the 3.5 billion year process of evolution. We only live in a snap shot of that time. To say the effects of Man's activities is either good or bad is irrelevant. As we know the Earth, and the universe is in constant change. There is no perfect balance, or way things are supposed to be.\nAnd just so you understand, if Nature gave the Whales a choice they would through us under the bus in a second.",
        "good": "2",
        "bad": "1",
        "replies": [
            {
                "user_name": "lemorted'republic",
                "time": "4 June, 2021",
                "context": "Where are the cicadas?! Covid is killing them. \nThis could be a break in the food chain!",
                "good": "2",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "Hondoxp589",
                        "time": "5 June, 2021",
                        "context": "lol",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "dan5047628",
                "time": "7 June, 2021",
                "context": "God: I give you ALL of these animals for food.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "Hondoxp589",
                        "time": "8 June, 2021",
                        "context": "Sorry, I find it very difficult to take religious people seriously.",
                        "good": "0",
                        "bad": "1",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "rayj785",
        "time": "3 June, 2021",
        "context": "\"There are only about 356 North Atlantic right whales left\"\n\nSo they can count every single right whale in the stinkin' ocean but they can't get a clear picture of a UFO?",
        "good": "9",
        "bad": "1",
        "replies": [
            {
                "user_name": "rubiks6",
                "time": "3 June, 2021",
                "context": "Whales are real. UFOs are fantasies. It’s hard to get a clear picture of a fantasy.",
                "good": "1",
                "bad": "3",
                "replies": [
                    {
                        "user_name": "rayj785",
                        "time": "3 June, 2021",
                        "context": "So if an object is flying and it's unidentified it's a fantasy?",
                        "good": "2",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "rubiks6",
                                "time": "4 June, 2021",
                                "context": "It’s certainly not beings from beyond Earth. \n\nThere is a reason why unidentified objects are unidentified. It’s because we couldn’t get a good image of them. Duh.",
                                "good": "1",
                                "bad": "1",
                                "replies": [
                                    {
                                        "user_name": "rayj785",
                                        "time": "4 June, 2021",
                                        "context": "Who (besides you) said anything about \"beings from beyond Earth\"? Duh.",
                                        "good": "1",
                                        "bad": "0",
                                        "replies": [
                                            {
                                                "user_name": "rubiks6",
                                                "time": "4 June, 2021",
                                                "context": "That’s generally what’s going through people’s minds when they talk about UFOs but nice dodge.",
                                                "good": "0",
                                                "bad": "0",
                                                "replies": [
                                                    {
                                                        "user_name": "rayj785",
                                                        "time": "4 June, 2021",
                                                        "context": "Mmm...no. Again, you're the one that brought up \"beings from beyond Earth\".\nSo, let me clue you in on what you're having trouble with.\nUFO stands for Unidentified Flying Object. It doesn't stand for \"beings from beyond Earth\" Flying Object. Sorry if this confuses you but I really can't assist you with what's going through your mind.",
                                                        "good": "1",
                                                        "bad": "0",
                                                        "replies": [
                                                            {
                                                                "user_name": "rgervais",
                                                                "time": "8 June, 2021",
                                                                "context": "I had exactly the same observation",
                                                                "good": "1",
                                                                "bad": "0",
                                                                "replies": []
                                                            }
                                                        ]
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "agrigento58",
                "time": "4 June, 2021",
                "context": "Or Big Foot",
                "good": "4",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "rubiks6",
        "time": "3 June, 2021",
        "context": "Oh, those terrible humans. Raspberries to them.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "john2002",
        "time": "3 June, 2021",
        "context": "Who cares about Rossie Odonnell ? It's all optical illusion, she ain't getting any' tinier",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "USSocialistRepublicofAmerica",
        "time": "4 June, 2021",
        "context": "\"Some day the Earth will throw us off like a case of bad fleas. What will be left in 10,000 years? Plastic!\" - George Carlin",
        "good": "0",
        "bad": "1",
        "replies": [
            {
                "user_name": "dan5047628",
                "time": "7 June, 2021",
                "context": "God: has a different scenario",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "CyanTag",
        "time": "4 June, 2021",
        "context": "“The fanatical atheists are like slaves who are still feeling the weight of their chains which they have thrown off after hard struggle. They are creatures who – in their grudge against traditional religion as the ‘opium of the masses’ – cannot hear the music of the spheres.”\n—Albert Einstein",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rubiks6",
        "time": "4 June, 2021",
        "context": "Whales are given credit for being very smart creatures but they cannot save themselves. Neither can men save them. When it’s time for them to go, it’s time for them to go. \n\nMan was given dominion over the Earth and all of its creatures. When Man rejected God in the garden, everything was thrown into chaos. Loss of various species is one of many results of Man’s sin. Only God can fix things. Only God can recreate creatures. There will be a new Earth.",
        "good": "7",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "agrigento58",
        "time": "4 June, 2021",
        "context": "If humans went extinct..the Earth would thrive",
        "good": "3",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "R.Williams160",
        "time": "4 June, 2021",
        "context": "they just seem smaller because the ocean is getting bigger",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "thunker54",
        "time": "4 June, 2021",
        "context": "I thought Greta was going to save us from all that.  Funny how just just disappeared when Covid started.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rgervais",
        "time": "8 June, 2021",
        "context": "this sounds a lot like natural selection to me........... one of the problems with  liberals is not realizing man is a part of that process",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dan5047628",
        "time": "7 June, 2021",
        "context": "120 photos out of thousands of whales and they know all?\nRight.  And once again its our fault? So, Are humans supposed to destroy ourselves to save animals or should we just continue using them for food like God told us to?",
        "good": "0",
        "bad": "0",
        "replies": []
    }
]