[
    {
        "user_name": "cb1882",
        "time": "28 December, 2019",
        "context": "I certainly hope we do the same thing to critical weapons we sell to foreign governments... Software backdoors.. remote, self destruct mechanisms... at least ways to cripple them if they are used against us.",
        "good": "23",
        "bad": "1",
        "replies": [
            {
                "user_name": "JVanCleef",
                "time": "28 December, 2019",
                "context": "The US tech industry has already been hurt by US government interference in spying.\n\nBe careful in demanding that we become like China and other despotic regimes.",
                "good": "4",
                "bad": "2",
                "replies": []
            }
        ]
    },
    {
        "user_name": "justiceneedsserved",
        "time": "28 December, 2019",
        "context": "The negative press that US manufacturing gets at times is maddening.  We are the world's leader in manufacturing technology.  Japan and Europe are really good, but we are great.  Manufacturing has been taking some hits over the past 3 decades, but we are rebounding right now.  Buying a toaster or even a Chinese car is one thing, but letting them make components or final assemblies for anything defense related is just plain stupid.  Our government and manufacturing companies need to put the US first",
        "good": "38",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "thaghroth999",
        "time": "28 December, 2019",
        "context": "China has already spread its influence worldwide and grown into a most wealthy and modern country whose infrastructure is probably second to none essentially thanks to a free trade with the US.Fortunately America that has always overstretched itself has suddenly awakened to the realization that the ongoing decoupling from China is irreversible and above all salutary.",
        "good": "3",
        "bad": "0",
        "replies": [
            {
                "user_name": "thewanderer",
                "time": "28 December, 2019",
                "context": "There’s never been ANYTHING free about trade with Chinese communists.",
                "good": "11",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "alsodeplorable",
        "time": "28 December, 2019",
        "context": "China is stealing our technology and using it to spy on and collect data from us. The DJI drones are but one example.....",
        "good": "23",
        "bad": "1",
        "replies": [
            {
                "user_name": "BobGold2",
                "time": "28 December, 2019",
                "context": "Knowing what the Chinese are doing and have always done can be used to our advantage. They steal everything. Let's keep our enemies close and let them find out what we want them to find out and not much more. Time to be smart about this and stop the whining we've been doing for the past 50 years.",
                "good": "3",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "c06u",
        "time": "28 December, 2019",
        "context": "Rebuilding????? come on the US was the last country to get involved, Germany is the birth place,  (Mikrokopter)  well over 10 years ago, the Chinese in their normal fashion stole the code, those of us who started out with Mikrokopter back before the Chinese hit the market were consistently road blocked by the Government, as far as Multi-rotors the US industry has basically been selling Chinese equipment",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "pnwindependent548",
        "time": "28 December, 2019",
        "context": "The Chinese steal every technology available. Next up, Tesla.  Bad move borrowing money and building in China.  Any manufacturing plant in China is 51% owned by government.  Previous admin did nothing!",
        "good": "13",
        "bad": "1",
        "replies": [
            {
                "user_name": "wpny",
                "time": "28 December, 2019",
                "context": "Really 2 wars and a failing housing and car industry.  You forgot",
                "good": "1",
                "bad": "3",
                "replies": []
            }
        ]
    },
    {
        "user_name": "hipp56",
        "time": "28 December, 2019",
        "context": "Well the liberals idea of eliminating all manufacturing in the US for GREEN considerations plays right into the Chinese plans for complete domination because if we cannot make anything for ourselves then we become completely dependent on those that can.",
        "good": "41",
        "bad": "1",
        "replies": [
            {
                "user_name": "Rahwayrunner",
                "time": "28 December, 2019",
                "context": "China’s 2025 plan outlines their goals. And while the Administration worries about coal mining jobs we fail to improve our STEM programs in education ... DeVos is clueless...",
                "good": "7",
                "bad": "6",
                "replies": [
                    {
                        "user_name": "Teflonslinky1",
                        "time": "28 December, 2019",
                        "context": "We stopped educating long ago, when liberals took over our schools, turning them into test-score factories and indoctrination centers for progressive, anti-God, anti-American globalists.",
                        "good": "9",
                        "bad": "1",
                        "replies": [
                            {
                                "user_name": "Rahwayrunner",
                                "time": "28 December, 2019",
                                "context": "And Secretary DeVos is doing nothing to address these issues...",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "user_name": "summitsailor",
                        "time": "28 December, 2019",
                        "context": "How can we improve our STEM when the H1B visas take the jobs.  This is the biggest fraud going on today which only enrich the Tech billionaires with low wages.",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "JVanCleef",
        "time": "28 December, 2019",
        "context": "\"DJI’s conquest of the U.S. drone market represents just the latest example of China’s economic aggression.\"\n\nLet's be honest.  It represents China's ability to both innovate and embrace capitalism by providing a better product at a cheaper price, but bravo on Navarro for recognizing that we cannot let China take the lead.\n\nIf only the Trump regime could see the same wisdom when it came to things like wind power and solar panels.  Those are the future, not coal.",
        "good": "3",
        "bad": "14",
        "replies": [
            {
                "user_name": "RN3decades",
                "time": "28 December, 2019",
                "context": "Agree, but we will also have to use energy more efficiently. I would love to see the wind and solar production be centered in coal country--miners need to work. Coal miners work hard, 60 hours per week in terrible conditions, but make 60-70 K per year. We also need a smart person to figure out how to burn plastic in a clean way; it is made out of hydrocarbon but releases nasty chemicals when burned.",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "1984goodyear",
                "time": "28 December, 2019",
                "context": "No, they're just plain stealing technology.",
                "good": "11",
                "bad": "1",
                "replies": []
            },
            {
                "user_name": "missgrits",
                "time": "28 December, 2019",
                "context": "Solar power also controlled by China.  We will end up right back where we were.  Dependant on despots.  The answer lies in scrubbing, storing and recycling carbon.  American ingenuity could accomplish that if we weren't so obsessed wind and solar.",
                "good": "3",
                "bad": "1",
                "replies": []
            },
            {
                "user_name": "brewingbiker201",
                "time": "28 December, 2019",
                "context": "better product? Odd words about chinese manufacture. But cheaper, yes, because it is heavily government-subsidized. You willing to have our government do the same?",
                "good": "2",
                "bad": "1",
                "replies": []
            },
            {
                "user_name": "MichiganMan0505",
                "time": "28 December, 2019",
                "context": "China innovates? Please. They steal. And we've let them. Trump is stopping it.",
                "good": "11",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "iamtheoracle",
                "time": "28 December, 2019",
                "context": "Are you kidding? China is a communist country whose means of production is controlled by the state using slave labor. They steal technology and require any company that works with them to give their proprietary info to them. And we let them. \n\nAs to solar and wind, they cannot power any country by themselves, not even close. NO matter how many turbines or solar panels you erect they never will.",
                "good": "16",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "thewanderer",
                "time": "28 December, 2019",
                "context": "Have you been certified, or are you a free range idiot?",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "CarolinaPatriot",
        "time": "28 December, 2019",
        "context": "I've said this for years, and as an active environmentalist (very different from an environmental activist) it's the ONLY reason I support increased economic and industrial expansion:  economic security IS national security!",
        "good": "35",
        "bad": "0",
        "replies": [
            {
                "user_name": "OrangePumpkin",
                "time": "28 December, 2019",
                "context": "Kudos! Well said.",
                "good": "6",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "Sheeple101",
        "time": "28 December, 2019",
        "context": "Sucks that dji got 3dr’s site scan technology.  I still have my 3dr solo, converted to open source open solo.  Very good drone.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "fonebone77",
        "time": "28 December, 2019",
        "context": "Oh boy.  I can't wait till they ban Chinese drones and a basic American consumer drone costs as much as a car!",
        "good": "1",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "harmony",
        "time": "28 December, 2019",
        "context": "wouldn't it be nice if a drone could spot intellectual property right violations as they happen?",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tyredcynic",
        "time": "28 December, 2019",
        "context": "You'd think that not selling us out to China would be a priority for the government...\nYou'd think...",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "jsc7",
        "time": "28 December, 2019",
        "context": "Very interesting!  This could use more public exposure in the media!\nI have to admit, I've had the same perspective vis-a-vis other electronic devices produced in China like cell phones, tablets, and laptop computers.  I personally feel that the US Government and our Military Services should NOT be procuring any electronic devices from China... ever!  There is just too much risk of exposure to hidden malware and/or coding embedded within hardware components that could support extraction of information to China.",
        "good": "10",
        "bad": "0",
        "replies": [
            {
                "user_name": "KOBALT♤♤",
                "time": "28 December, 2019",
                "context": "Get rid of your iPhones then cause the majority are made in china",
                "good": "1",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "jsc7",
                        "time": "28 December, 2019",
                        "context": "I'd prefer they move their production to America!  And, based on the profit/phone... keep the current prices while Apple absorbs the decrease in profit.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "quicksilver5050",
        "time": "28 December, 2019",
        "context": "Now the Chinese are going to get us. Sorry, our own Politicians from both parties sold us to China to help pay the contractors supplying our troops all over the world.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "HiddenPatriot2049",
        "time": "28 December, 2019",
        "context": "And china will steal the data as always, because that's what they do.  They're not smart or innovative enough to produce a new technology on thier own.  They're thieves at DNA level.",
        "good": "13",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "theloon809",
        "time": "28 December, 2019",
        "context": "The sooner the U.S. distance itself from China the better. It seems to me that Chinese philosophy is to deceive and cheat on everyone. I believe in the long run that will lead to their downfall.",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "2ndnlong",
        "time": "28 December, 2019",
        "context": "Congress has some of the longest lasting drones in the world.",
        "good": "19",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Manoy77",
        "time": "28 December, 2019",
        "context": "China will never stop stealing US proprietary technologies no matter what trade agreements signed by both countries. There should be stiff penalties every time China is caught cheating. Tariffs should be enforced indefinitely!!!!",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "justiceneedsserved",
        "time": "28 December, 2019",
        "context": "Nixon opened the door, all the other presidents walked in and out of the door, and Trump is closing it so he can at least look thru the peephole.  China=Cheap.....USA=Great",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "broken_sky",
        "time": "28 December, 2019",
        "context": "US technology is developing faster than any other country. Chinese technology is decidedly inferior. When the US dominates the high-end drone market - and it will - the Chinese will not be able to keep pace.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "20diditagain!20",
        "time": "28 December, 2019",
        "context": "solve the problem of turning off electronics in rogue drones. drones to fight other drones. also, in ultimate case of defense: two words:  metal storm",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sabsab",
        "time": "28 December, 2019",
        "context": "In a significant way you can thank the Clintons , Obama and definitely Biden\n\nat lease we have the common sense at this point to try and mitigate the risk\n\nperfectly rational thing to do",
        "good": "14",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "broken_sky",
        "time": "28 December, 2019",
        "context": "China has gotten so dependent on cheating and stealing that they no longer know how to compete legitimately. Once again, President Trump saves the day.",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "broken_sky",
        "time": "28 December, 2019",
        "context": "China, India and Africa are locked inside a Malthusian Trap that, they do not know how to extricate themselves from.",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "jsc7",
                "time": "28 December, 2019",
                "context": "Interesting!  You don't hear many people referencing Malthusian theory...\nI'm not disagreeing with you...   over-population in limited locations may well bring about a lot of problems.",
                "good": "4",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "broken_sky",
                        "time": "28 December, 2019",
                        "context": "The Malthusian Trap closes slowly, but inexorably. China has to feed 1.4 billion  people every day. That is not sustainable.",
                        "good": "2",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "jsc7",
                                "time": "28 December, 2019",
                                "context": "And many don't realize that China may look vast..., but much of it is pure desert!  You can't feed that 1.4 billion sand!",
                                "good": "2",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "broken_sky",
                                        "time": "28 December, 2019",
                                        "context": "Add to that the issue of demographics and health. Most of Asia is aging precipitously. And in China, a large percentage of the population have cardio-pulmonary problems.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": [
                                            {
                                                "user_name": "jsc7",
                                                "time": "28 December, 2019",
                                                "context": "no coincidence that for many people on many days the populace in the large cities wear those masks to help filter the air they breath so badly laced with pollutants.",
                                                "good": "1",
                                                "bad": "0",
                                                "replies": []
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "user_name": "n6uqqq",
                        "time": "28 December, 2019",
                        "context": "I must say this is quite refreshing to see an intelligent conversation on a message board!",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "CyanTooth",
        "time": "28 December, 2019",
        "context": "On a related note:\n\nImport tariffs introduced by President Donald Trump aimed at protecting American manufacturers have actually caused job losses and higher prices for consumers, according to a study published by the U.S. Federal Reserve.\n\nIn March 2018, the Trump administration introduced steel and aluminum tariffs to counter what the president described as \"aggressive foreign trade practices.\"\n\nThe president also took aim at Chinese goods as he started a trade war with Beijing that may be soon eased with a preliminary trade deal.\n\nHowever, Federal Reserve economists Aaron Flaaen and Justin Pierce concluded that any gains made by the tariffs in reducing competition for some U.S. domestic industries were cancelled out by rising input costs and retaliatory tariffs.\n\n\nNO ONE, including Trump, has dealt well with China since Nixon.",
        "good": "2",
        "bad": "7",
        "replies": [
            {
                "user_name": "muzicman",
                "time": "28 December, 2019",
                "context": "Wrong.  I am in sales and have been selling Asian products in the US for 30+ years.  The tariffs are causing US manufacturers to move their contract manufacturing and component sourcing to other countries and in many cases to the US.  Tariffs are working and if we have to pay more for products typically coming from China, so what.  The Chinese government is not our friend, and it is the first time in 30+ years our government has sent Beijing a wake up call.",
                "good": "11",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "NovaFederalist",
                        "time": "28 December, 2019",
                        "context": "See, you are thinking logically and realistically, unlike the misnamed individual you are responding to.  Tariffs cause short term pain to the citizens of the countries where the tariffs originate - but long-term gain for the same citizens, while causing pain - short term AND long term to the businesses and nations being targetted by those same tariffs.  Right now, Americans pay a bit more for Chinese-originated products.  But as companies realize the cost of doing business in China, they move out to more 'tariff-friendly' locations/nations and then the cost goes back down for Americans, and they also have some better security.  But for the Chinese, a) they sell less products to America, b) companies leave their shores for better places and thereby cost the Chinese jobs, c) which raise the costs to care for their own now-unemployed citizens.  And considering that China, in spite of all they've done, are sitting on some static or stagnant economic numbers, this is hitting China much harder than it is America.  And if these companies move from China to America, then more Americans get employed, taking away the jobs from Chinese employees, and also costing the Chinese officials their percentage of the grift they charge foreign companies to exist in China.  Win, win, win, for America; lose, lose, lose for China.",
                        "good": "4",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "IvanYakinov",
                "time": "28 December, 2019",
                "context": "Hard to see how manufacturing something in America causes US job losses versus manufacturing the same thing in China.",
                "good": "6",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "redstone616",
        "time": "28 December, 2019",
        "context": "I certainly hope the US Military is on top of Drone Warfare. One manned aircraft costs more than say 100 drones. Instead of 1 manned aircraft, send 100 drones to a target. Some will get thru. I'm sure china is already using this idea. We should not be buying anything militarily related from china. To think they can't jam the drones they sell us is being naive.",
        "good": "7",
        "bad": "0",
        "replies": [
            {
                "user_name": "broken_sky",
                "time": "28 December, 2019",
                "context": "You can't jam a drone that is encased in a Faraday Cage. Artificial Intelligence allows drones to fly entire missions without any human intervention.",
                "good": "2",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "error": "error"
    },
    {
        "user_name": "ydraiggoch",
        "time": "28 December, 2019",
        "context": "So, we are adding new drones. Big deal. That is old technology.\n\nWhat about the new Russian hypersonic missile that just went operational this week?  Nothing here on FOX about that development.\n\nI guess they don't want to portray Mitt Romney as being right.",
        "good": "0",
        "bad": "3",
        "replies": [
            {
                "user_name": "karmijones",
                "time": "28 December, 2019",
                "context": "Russian hyper sonic missiles huh? Tell me, what has changed because they have these missiles?  Can they survive an attack on the US? What Russia is doing, reporting the development of wonder weapons is a classic strategy of trying to appear more powerful than you really are.",
                "good": "3",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "ConservativelyYours",
                "time": "28 December, 2019",
                "context": "Keep in mind that one of these wonder weapons just blew up a few months ago.  The Russians are projecting, just like they always have.",
                "good": "2",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "colflag",
        "time": "28 December, 2019",
        "context": "Why would we let this happen in the first place?",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "webchow",
        "time": "28 December, 2019",
        "context": "The Chinese know our drone technology, they helped built it. I know, your politicians in action letting a communist country help build our defense weaponry...WOW! The Chinese have already sold the counter defense technology to Iran, that's how they shot our drone down (it wasn't a lucky shot). All our drones are useless, who knows how much money wasted. Again, from the actions of \"smart\" people...Wow...",
        "good": "5",
        "bad": "0",
        "replies": [
            {
                "user_name": "cordopolitin070",
                "time": "28 December, 2019",
                "context": "UM, Ya got that backwards... THE USA built the Chinese Drone technology TOTALLY.. \nMIT and US universities and investments....\nThe designs  USA\nThe investment USA over 50%\nThe Sales and marketing US ....\n\nTrump is making the world aware of issues that have been overlooked for years...",
                "good": "12",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "webchow",
                        "time": "10 January, 2020",
                        "context": "Not to be facetious but where do the parts and assembly come from? I don't know, I thought China. When I was in the military, everything came from China, but I didn't deal with high tech weapons, truely curious.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "cordopolitin070",
                                "time": "11 January, 2020",
                                "context": "Before Nixon opened up China the Chinese would  illegally migrate to North Korea for a better standard of living.\n\n1.Then Nixon  convinced business to give Chinese labor something to do.... \n2.Then US Universities opened research and development departments  to Chinese \n3.Chinese officers/professors who were in Universities as \"students\"....\n4.Chinese leadership created the \"new regulations\" that allowed for some capitalism as long as the ownership was 51% Chinese government .\n5.Offical policy said that NO capital was to be \"won\" from China... That is to say that selling a product in China will not provide a profit over the value of investment in China.\n6.Billons invested in China\n7.Manipulaton of currency that keeps exports cheep and imports expensive in China\n8.All information and tech gathered by the \"students\" used to impliment copy factories and even copy servers.  if a shoe was being made in China there was a copy factory making a similar version for the Chinese in many many cases... \n9.China says sooner or later China will rule the world and China will use the weapons tech that China bought legally to do it.\n10.Companies continue to move factories to China and almost never see a real profit other than product sold in the USA.\n\n\nI can keep going down the list but the reality is all TECH was stolen in one form or another and western governments allowed it and Universities  STILL allow it.",
                                "good": "1",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "Flyovercitizen16",
        "time": "28 December, 2019",
        "context": "if Chinese made drones are considered national security threats whether used by civilians or government agencies, they should be made it illegal, with significant legal penalties for their procurement or use by anyone. Drones are not a necessity for most people. They are merely a Play thing.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "MyDayInParadise",
        "time": "28 December, 2019",
        "context": "China and Democrats are the existential threat to US security and success of our nation",
        "good": "13",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "northerncush",
        "time": "28 December, 2019",
        "context": "we need American drones fuelled with American coal! MAGA",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "haroldwolf",
        "time": "28 December, 2019",
        "context": "About damn time",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dan397",
        "time": "28 December, 2019",
        "context": "Now the question is, will the US support a healthy competitive drone industry, or is some politician’s brother being outfit with a big grant and contract to supply all the drones?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "GOPRepublic",
        "time": "28 December, 2019",
        "context": "Democrats would just capitulate and give them what they want.  Remember, they have been siding with China over this trade deal.  Democrats will always side with foreigners.  Joe will try to get mire money from them and sell our country.",
        "good": "13",
        "bad": "1",
        "replies": [
            {
                "user_name": "usurper1",
                "time": "28 December, 2019",
                "context": "Except Russia OFC. Lmao.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "error": "error"
                    }
                ]
            }
        ]
    },
    {
        "user_name": "antihotair054",
        "time": "28 December, 2019",
        "context": "Not to worry - U.S. defence spy electronics are developing mini-micro spy devices small enough to be implanted in soybeans and corn kernels. Soon soybeans and corn exported by the U.S. to China will be able to reveal everything about China and their human and animal feed consumption habits, including even such vital information as the makeup of their internal digestive systems.",
        "good": "0",
        "bad": "1",
        "replies": [
            {
                "user_name": "justmorecrap",
                "time": "28 December, 2019",
                "context": "Burrrrrpppppp.... really, that sounds very interesting....",
                "good": "2",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "HumphreyPloughjogger",
        "time": "28 December, 2019",
        "context": "Google supports Chinese hegemony for the almighty bucks.",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Mr.E685",
        "time": "28 December, 2019",
        "context": "China is EXACTLY what happens when greed for money by corporations fuses with government need to survive and control.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "moam",
        "time": "28 December, 2019",
        "context": "The Chinese can never think an original thought they are masters at copying our technologies and duplicating for the good of their government.   We should not be scared of them they will implode under Trumps new trade agreement coming up.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "mrsteve",
        "time": "28 December, 2019",
        "context": "What Democrats have allowed to happen to American industry and technology will be change in the next 5 years, especially in relation to China and Russia and the EU!   MAGA   2020",
        "good": "16",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "Yes2Yes3",
        "time": "28 December, 2019",
        "context": "See liberals, this is what real leadership and MAGA is.",
        "good": "12",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "TrumpsArmy",
        "time": "28 December, 2019",
        "context": "Obama was really a trojan horse sent here to destroy America from within.",
        "good": "17",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "gotwoodonmtn",
        "time": "28 December, 2019",
        "context": "Quit buying garbage and the maker of the garbage goes out of business. Same principles apply to elected officials... Quit buying their garbage, and make them go away.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ConservativelyYours",
        "time": "28 December, 2019",
        "context": "\"According to DJI’s own terms and conditions, the company has permission to collect and use your data and users are warned that data may be transferred to servers located in China.\"\n\nThe Chinese just never learn.  They build a successful product and then sabotage their own work because they can't resist the urge to cheat.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mrsteve",
        "time": "28 December, 2019",
        "context": "Democrats have been showing their true Colors conserning many issues one of the biggest is China! Democrats have purposely been selling out to China! Trump is turning that around! This proves Democrats are aligned with Chines Communism as they are really American Communists! Our Oligarchs are really American Billionaires who whish political power! Vote Republican 2020",
        "good": "19",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "jsc7",
        "time": "28 December, 2019",
        "context": "How about this.... \nHow about Apple repatriating jobs to the Americas by building a couple of iPhone/iPad plants in Central America countries.  While it may not be 'as cheap' of labor as that found in China, it would still be reasonable as compared to current product markups that they profit on from the iPhones.\nThe added bonus to the US would be to improve employment opportunities and economies in Central America and undercut the reason that so many attempt to illegally migrate to the US.\n\nWhat say you, Apple?",
        "good": "7",
        "bad": "0",
        "replies": [
            {
                "user_name": "tonypizza",
                "time": "28 December, 2019",
                "context": "Ask the Apple shareholders how they feel about a decline in their share price and dividend and you'll have your answer",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "haroldwolf",
                        "time": "28 December, 2019",
                        "context": "Share price was right at an all time high Friday. Don't know about any dividend.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "tonypizza",
                                "time": "28 December, 2019",
                                "context": "Sorry, I meant IF they made that proposed manufacturing move. Certainly riding high now, hence my point.",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "user_name": "hypertest",
                        "time": "28 December, 2019",
                        "context": "Apple shareholders, their easy  money gains and what they've done with those profits,  driving up the cost of housing and good services in this country, are the very least of the majority's  concerns. To L with Apple.",
                        "good": "1",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "tonypizza",
                                "time": "28 December, 2019",
                                "context": "I could not agree more. I was simply responding to the reality of OP's proposal. The shareholders rule - capitalism.\nWe could force Apple to adhere to OP's (excellent!) idea - socialism.",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "user_name": "jsc7",
                        "time": "28 December, 2019",
                        "context": "But... isn't Apple always saying that we should be community conscious and supportive of meeting the needs of all peoples over the needs for profit?",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "independent2010791",
        "time": "28 December, 2019",
        "context": "Finally some common sense.  It is incredible that we ever let US tax dollars purchase A N Y thing Chinese for US gov use.",
        "good": "25",
        "bad": "0",
        "replies": [
            {
                "user_name": "ConservativelyYours",
                "time": "28 December, 2019",
                "context": "Got that right!!",
                "good": "5",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "CyanRocket",
        "time": "28 December, 2019",
        "context": "Why is the US Fed Gov buying ANYTHING  from the Chinese?",
        "good": "23",
        "bad": "0",
        "replies": [
            {
                "user_name": "NOTEOFREASON",
                "time": "28 December, 2019",
                "context": "The Obama admin was being paid off. And since Obama hates the USA, it was easy. Just look at the  Uranium One  and sale of our nuclear production capabilities. Obama not opposing the Russia/German pipeline. Obama's refusal to sell the missiles to Turkey who then bought them from Russia. All action of treason and a desire to Europeanize the US and sell out for big bucks to China. Just the tip of the iceberg of the Obama, Clinton, Kerry, Biden SELLOUT.",
                "good": "23",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "OliveFish",
        "time": "28 December, 2019",
        "context": "They do the same with all those little Apple products.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ambiguous",
        "time": "28 December, 2019",
        "context": "Time to expand ITAR.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Witlessdims",
        "time": "28 December, 2019",
        "context": "My Co. will not do business in China for this very reason. I must say I am surprised this was actually happening. I've worked contracts with the Fed and States and they always specified everything be 'made' in the US including computer chips and assemblies.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "obdurateone",
        "time": "28 December, 2019",
        "context": "China just got the UN to obey and implement the Chinese internet rules on the world. UN is now the Military Surveillance Arm of Communist China, and Google is now enslaved to the Communist way of life. It is time to disband the UN",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "SpanishPrincess",
        "time": "28 December, 2019",
        "context": "Ah.  Star Wars....Attack of the drones.",
        "good": "1",
        "bad": "1",
        "replies": [
            {
                "user_name": "usurper1",
                "time": "28 December, 2019",
                "context": "Well, weve been clutching really big smartphones for years and years. None of this info should come as utterly shocking : Internet and all matters digital come from space - we knew that in the 90's. Next time you tap directions on your phone, maybe youll think about this.",
                "good": "2",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "GreenBee",
        "time": "28 December, 2019",
        "context": "USA must cut down on Chinese imports and sell goods made in USA.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "davegreen50",
        "time": "28 December, 2019",
        "context": "I thought drones were bad. They're good again? Err, okay, build away.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jls2415",
        "time": "28 December, 2019",
        "context": "It's past time to deploy electronic sweeps on any goods coming in from China prior to them be available to he public.  China plan flood the market gather all the intel they can until the slow moving Congress and Administration catch on and make change to policies.  \nPast time to become PROACTIVE vs reactive.",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Cerebus",
        "time": "30 December, 2019",
        "context": "China is great at copying the appearance of quality products.  Quality and performance not even close.  That goes for every product China produces.  Every single one.",
        "good": "8",
        "bad": "1",
        "replies": [
            {
                "user_name": "57states57",
                "time": "30 December, 2019",
                "context": "not for their military technology  they are smoking us in computers hacking and codes and building super computers.",
                "good": "3",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "hughcaires",
        "time": "28 December, 2019",
        "context": "Good luck with that.  They'll be 3x the price.",
        "good": "0",
        "bad": "1",
        "replies": [
            {
                "user_name": "usurper1",
                "time": "28 December, 2019",
                "context": "And?? An iph is 3x the price as an android.",
                "good": "3",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "areyouoffended",
                "time": "29 December, 2019",
                "context": "That is right!! - and 3x the number of American manufacturing workers who are currently doing nothing much right now ( except maybe working in the Service Industry ( serving coffee) )",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "watashiwa",
        "time": "30 December, 2019",
        "context": "Point a power wash nozzle at the thing and knock it down with a high pressure blast.  Later claim you thought it was a large mosquito. This would work better in the summer.  It could be a fun game!",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "watchdoggie378",
        "time": "29 December, 2019",
        "context": "I look around and see 80 year old crumbling infrastructure in states like California and the fact we can't even secure our own borders, and frankly question our ability to start from scratch and build a fleet of drones. Looking at states like California I seriously doubt we will ever get back to \"Made in the USA\" ever again, as much as I would love for the United States to do that. Democrats have an agenda and a whole list of priorities for tax payers dollars that revolve around spending and investing trillions of dollars taking care of illegal immigrants, doubt there will be any money left over for drones.",
        "good": "29",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "musashi1953",
        "time": "29 December, 2019",
        "context": "Too many Presidents and members of Congress have helped China buy or steal American tech.\nWe have been betrayed. Time to stop.  NO investment by China in any US tech or software, no collaboration on space related missions.  The people need to be vigilent, we have beensold down the river.",
        "good": "37",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Milauff",
        "time": "1 January, 2020",
        "context": "CCP is a real dictatorship party and evil party and wants to eliminate all capitalist countries and western countries having democracy freedom，to eliminate all private ownership, to eliminate all private companies and people’s freedom (free thinking and speaking). This is CCP's purpose and CCP initial heart---- make communism in the world!  \nIf people, the CEO, the investor, the politician in the United States and Western countries still do not wake up, still don’t realize how evils of CCP, finally you will not only lose your money, your investment, your company, your freedom, your honor and respect but also you will become the slaves and Zombies under the threaten and control of CCP once CCP gets more power or you more rely on CCP!",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "JebnickJones",
        "time": "30 December, 2019",
        "context": "The science of product assembly (i.e. manufacturing) has advanced to minimize human input.  Products are designed so they can only be assembled in a single (correct) way, integrated statistical process control schemes flag abnormal conditions, vision systems use bar codes to ensure the correct components are being used, etc.\n\nThe simple fact is that these multi-million dollar investments, made to improve first time quality (FTQ), are BENEFICIAL to society.  \n\nOur challenge is disguised as manufacturing, but the real problem is elevating the skill level of our least skilled people.",
        "good": "6",
        "bad": "0",
        "replies": [
            {
                "user_name": "57states57",
                "time": "30 December, 2019",
                "context": "Well said",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "Planetfox",
        "time": "29 December, 2019",
        "context": "We need to get this going. Having the drones made in another country is just not a good idea.",
        "good": "31",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "57states57",
        "time": "30 December, 2019",
        "context": "yep Obama and his husband Michael always hated this country  he wanted china to have this technology just like he wanted iran to have our 100 million dollar drone",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "usurper1",
        "time": "28 December, 2019",
        "context": "Trump 2020.",
        "good": "14",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "ssa773",
        "time": "31 December, 2019",
        "context": "Hate to say it but even if the government does not use dji they still have plenty of info from everyday users of restricted areas.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Archangeljack",
        "time": "29 December, 2019",
        "context": "Obama/Biden drones.",
        "good": "11",
        "bad": "0",
        "replies": [
            {
                "user_name": "Rufust.Firefly2018",
                "time": "29 December, 2019",
                "context": "Biden was promoting China goods in an effort to help Hunter.  And now we are paying the price.",
                "good": "25",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "PaulBryce12",
        "time": "30 December, 2019",
        "context": "America can only hope that Trump is reelected so he can continue his China policies. Otherwise America is going to have a civil war and will find itself fighting Chinese troops on California soil. Possibly European troops on NY soil. Cartel troops in Texas. Wake up people as the UN is stealing your country.",
        "good": "7",
        "bad": "1",
        "replies": [
            {
                "user_name": "PaulBryce12",
                "time": "30 December, 2019",
                "context": "And they will have been invited in to NY and California by Marxist governors.",
                "good": "5",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "AllPoliticalPartiesSuck",
                "time": "30 December, 2019",
                "context": "Ah, fear is big in this one.  Well, drama for sure.",
                "good": "1",
                "bad": "4",
                "replies": []
            }
        ]
    },
    {
        "user_name": "jd2020",
        "time": "28 December, 2019",
        "context": "Now address all the tech companies using foreign technicians. We have more foreigners running our tech in big corporations than US citizens. Where do their loyalties lie?",
        "good": "37",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bradbeall",
        "time": "30 December, 2019",
        "context": "How many Chinese-made “drones” have been sold in the U.S.? Maybe several hundred thousand, used by people like me and others who enjoy radio-controlled models of cars, airplanes, etc. Most of us have more than one, so that reduces the actual number being used at any given time.\n\n The much, much larger number of Chinese-made devices that can (and do) collect data is truly scary if you think about it...\n\n Just about everything that is considered a “smart” device, from our cell phones, laptops, PC’s, and things like Amazon’s “Alexa” and Google’s “Echo” and even “Ring” type doorbell cameras is made in China. You can bet everything you use them for is being recorded by something and/or somebody over in China. Think about it - they have 400 bazillion people over there with not much to do. Of course they’re watching us! They know when we go to work and come home, they know what we buy from the grocery store, and yes, they know when we’re playing “hide the salami” in our bedrooms, and they’re probably laughing at us as they watch.\n\n It’s just a matter of time before they attack. They’re just waiting for the perfect time.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "kcperson",
        "time": "31 December, 2019",
        "context": "I hardly think DJI practices predatory pricing: I paid close to $1000 for the unit I purchased three years ago. It works very well, easy to operate, and takes great video. If the Chinese want GPS coordinates for critical infrastructure, they can use Google Maps or take anything with a GPS receiver, drive around, and record coordinates on paper. A drone is overkill.\n\nThe real problem is that we outsourced all our manufacturing to China. You can fill up a device with Intel, Micron, Cisco, you-name-it parts and devices and it's still sourced from China. Not only does China possess manufacturing capability, it also possesses the intellectual property used to make the parts. They also have a lot of smart people able to reverse-engineer the designs and modify them as they wish and we pretty much gave the store away filling up our universities with full-fare paying Chinese students. I'd hate to know what they say about us when we're not listening (Mandarin for \"suckers\"?).\n\nWhile kids in other countries are expected to learn math, science, and appreciation of their culture (warts and all), we spend billions teaching them junk science, feelings, and that they should despise their heritage.\n\nDrones are the least of our worries - it's picking at nits.",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "bssheriff",
        "time": "31 December, 2019",
        "context": "Too little too late. The US military, law enforcement, Border patrol, etc have a much bigger problem than drones.  These agencies have been buying and using Chinese networking elements for years.  The devices are embedded in the most sensitive locations throughout our government.  Now, all of a sudden, there is a sense of urgency about drone.  Nonsense, look at all of your routers and switches with the govnerments networks that have Chinese sniffing components embedded in them.  You got bigger problems than drones.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bryansw506",
        "time": "29 December, 2019",
        "context": "Building our own drones is not difficult. You can still use parts from china. The problem is related to firmware. The programming code that instructs the microprocessors in the drones what to do with the data it collects. That is all it is. Drones can be built pretty easily that can rival DJI drones with better secured firmware.",
        "good": "10",
        "bad": "4",
        "replies": [
            {
                "user_name": "Jefferbator",
                "time": "29 December, 2019",
                "context": "you can use your chinese \"parts\" we will use American parts.",
                "good": "12",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "spanzo",
                        "time": "30 December, 2019",
                        "context": "you are obviously NOT in the electronics industry!  There simply are no longer US manufacturers for common electronic components.  They might have a US name on the company, but they are not made here anymore...made in china, or some other pacific rim location.  Even simple things like resistors....\n\nI agree, it is the firmware built into some of the digital parts, and possibly hidden tiny devices that record data clandestinely, that are the problem here.",
                        "good": "2",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "57states57",
                        "time": "30 December, 2019",
                        "context": "im sure they already stole all our technology by now. Obama let china take what they wanted  they steal steal copy steal",
                        "good": "2",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "Zenji",
                "time": "31 December, 2019",
                "context": "Any electronic part made in China can an undisclosed a backdoor. Just look at Huawai espionage scandal ! No, it has to be 100% US made",
                "good": "1",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "error": "error"
    },
    {
        "user_name": "AllPoliticalPartiesSuck",
        "time": "30 December, 2019",
        "context": "The past 50 years of policy has been at the expense of American workers as dollars are concentrated in fewer and fewer hands.  Lazy Americans have been drawn to cheap products that corporations have put in front of them thanks to a global supply chain.  Executives have absolutely done great during this time and wealth concentration is clear evidence.  Leveling a playing field after 50 years of alteration will take at least 20 years - are Americans willing to focus on the long run or will a shiny distraction shift their attention to the next fad?  Good luck - patience, education, and critical thinking need to be encouraged.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Zenji",
        "time": "31 December, 2019",
        "context": "That is a smart move after the Huawai espionage scandal ! But it comes very late in the game, all military equipment need to be done in the US with 100% US parts, end of discussion !",
        "good": "5",
        "bad": "1",
        "replies": [
            {
                "user_name": "mrcoffee73471",
                "time": "31 December, 2019",
                "context": "Lockheed Martin has their Indago Series available for commercial, military, industrial, and law enforcement use.  I would like to see them increase production and lower production costs, to make them available to recreational hobbyists and Part 107 license holders.  Perhaps one way of helping this defense contractor move into the civilian markets, would be to offer a significant subsidy for each drone produced, so that they can be affordable to the average consumer.",
                "good": "4",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "Zenji",
                        "time": "31 December, 2019",
                        "context": "Indago is way too expensive for the everyday amateur. Try some French drones, they are more affordable",
                        "good": "1",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "mrcoffee73471",
                                "time": "31 December, 2019",
                                "context": "Yes, the Indago is definitely a high-cost item.  The Parrot Anafe is a good product, designed in France.  Yet it is manufactured in China, as are the rest of the consumer drones except for the Skydio 2, which still has some foreign components.  I think we have a ways to go, but I wouldn't say it's impossible to once again, become competitive in the electronics field.",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "TheyAreLunatics",
        "time": "29 December, 2019",
        "context": "We've allowed ourselves to be conned for the last 30 years - 50 years, if you go back to the Nixon starting point - by ignoring China's true nature. The dark fact is that China is not just an economic competitor, they are an outright enemy, based on their die-hard communism. They have infiltrated this country far too deeply, and every single thing we buy from China is another missile, ship, submarine and bullet in their arsenal. Time to close the party down.",
        "good": "40",
        "bad": "0",
        "replies": [
            {
                "user_name": "davegreen50",
                "time": "29 December, 2019",
                "context": "While I absolutely agree the way they run their country internally is pretty horrifying, there is also the reality that we're basically talking about a country of worker slaves being ran by an oligarchy of capitalists. On the international stage they are rouge capitalists. There is no real governing authority so who's going to stop them?  Even the WTO lacks teeth unless someone gives them some.",
                "good": "7",
                "bad": "2",
                "replies": [
                    {
                        "user_name": "Jefferbator",
                        "time": "29 December, 2019",
                        "context": "you know who is stopping them",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "davegreen50",
                                "time": "29 December, 2019",
                                "context": "He's at least taking on the challenge. The results remain to be seen.",
                                "good": "1",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "watchdoggie378",
        "time": "29 December, 2019",
        "context": "Mexico and South America have already invaded and taken over, why worry about China?",
        "good": "4",
        "bad": "4",
        "replies": [
            {
                "user_name": "Jefferbator",
                "time": "29 December, 2019",
                "context": "wank-thinking",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "watchdoggie378",
        "time": "29 December, 2019",
        "context": "Seems like the day late and dollar short story. So we start from scratch and build a whole new fleet of drones to compete with other countries who already have the best most modern top of the line technology. How long will that take, and can we even get parts that aren't made in China? Frankly I'm guessing that China could really do a lot harm just by using something as simple as the cellphone's we all have in our pockets, if China really wanted or intended to do harm. > No where in my comment did I say we're better off buying products from China or any other country. What I said was \"can we even get parts that aren't made in China\"....",
        "good": "2",
        "bad": "2",
        "replies": [
            {
                "user_name": "areyouoffended",
                "time": "29 December, 2019",
                "context": "Your right - it is much better to buy cheap stuff from China and make nothing at all in the USA. Become a nation of coffee servers (working in the so-called \"service industry\")",
                "good": "8",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "usafben",
                "time": "29 December, 2019",
                "context": "General Atomics here in San Diego make the best UAVs.",
                "good": "5",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "rarinmn",
        "time": "6 January, 2020",
        "context": "3D Robotics made a good quality drone. I have one of them. However, their price was a huge factor, especially for hobbyists who could not write off the cost of them on their tax returns. $1,000 is probably the limit for most people. Now with the advancements developed by DJI such as obstacle avoidance and a compact size there's little chance that the US can be a serious player again in this field without a ton of investment money and a huge breakthrough in areas such as flight duration.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "thebestpolicy",
        "time": "1 January, 2020",
        "context": "They're still going to have to use parts made in Asia unless they want use up taxpayers money faster than they can print it!",
        "good": "1",
        "bad": "2",
        "replies": [
            {
                "user_name": "grampy1",
                "time": "2 January, 2020",
                "context": "Thanks wingnut",
                "good": "4",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "joethegorilla",
        "time": "6 January, 2020",
        "context": "Everything on Chinese drones are safely usable except the radio and control unit. Should NOT be that hard to make those components here.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "justsaying852",
        "time": "19 April, 2020",
        "context": "Any drone that uses your phone/tablet for video or control is potentially a security threat. Existing drones that use their own controller with built in display (like Yuneec Typhoon H and Q500) and are never connected to the world outside via cell or external wifi are much less of a security risk.\n\nHowever, with the FAA's proposed new rules, all new drones will be required to be continually connected to the outside world via cell or wifi. The problem will get worse.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "grampy1",
        "time": "2 January, 2020",
        "context": "Keep America Strong.  Vote MEGA 2020 or deal with our politicians selling out. Nobama, Clinton, Kerry.  When you make America 1st.  History deletes the worst. Trump is proof that God loves America",
        "good": "3",
        "bad": "1",
        "replies": []
    }
]