[
    {
        "user_name": "umerbut...752",
        "time": "14 January, 2021",
        "context": "As a retired Electronics Engineer and Software Engineer this article spun my head directly into counter-counter-measures for this effort on the part of the US military. \"Ridiculously simple\" comes to mind. Technology I worked on in the 1970s could render their efforts at jamming ineffective. Most of the ECCM efforts problems would be making the sensors, antennas, and power drain small enough. Single chip radios are possible. So that's a major portion of the issue. Even optical \"radios\" are small enough now. Physical disruption is about the only effective approach I can see.\n\n{^_^}",
        "good": "11",
        "bad": "0",
        "replies": [
            {
                "user_name": "quasarpower",
                "time": "23 September, 2021",
                "context": "We need to develop a ray gun.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "error": "error"
    },
    {
        "user_name": "PeterMike",
        "time": "13 January, 2021",
        "context": "There have been a drone in the white house last 4 years",
        "good": "2",
        "bad": "27",
        "replies": [
            {
                "user_name": "quasarpower",
                "time": "23 September, 2021",
                "context": "You mean since Jan. of this year.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "mrmacktitties",
        "time": "1 September, 2021",
        "context": "air balloons with powerfull uhf jammers with netting hanging off them remember ww 2 they had barrage balloons to keep you from being straffed balloons with netting to cause wrecks and uhf jamming some with kinetic projectile weapons just hoping youll fly into it like a cloths line",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "deepthought",
        "time": "13 January, 2021",
        "context": "All the small quad-copters are being purchased by Amazon to deliver your shipments...",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "claudiusthefool",
        "time": "14 January, 2021",
        "context": "Well as I have pointed out over the years, technology is a dual- edged weapon !  ",
        "good": "1",
        "bad": "0",
        "replies": []
    }
]