[
    {
        "user_name": "Stujameson",
        "time": "27 July, 2020",
        "context": "tora tora tora",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Some.People.Did.Some.Thangs",
        "time": "27 July, 2020",
        "context": "Wait until all the fans are seated then spray them all down with bleach...then you will have a lot of dumb blondes.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Some.People.Did.Some.Thangs",
        "time": "27 July, 2020",
        "context": "They could use that same drone to refill my beer cup during the game",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rayofsunshine4all",
        "time": "27 July, 2020",
        "context": "Wow, even the Republicans are finally catching on to the seriousness of this pandemic.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "josephus",
        "time": "27 July, 2020",
        "context": "You know, it doesn't just kill COVID-19 and it doesn't kill 100% of the germs out there. So what are we doing? Making superbugs that we can't treat. All for sports that actually have nothing to do with the students' education.",
        "good": "4",
        "bad": "0",
        "replies": [
            {
                "user_name": "KateGray",
                "time": "27 July, 2020",
                "context": "This is hypochlorous acid (part of bleach), not antibiotics.  It's not something that can just be evolved around like antibiotics.  It's one of the reasons hospitals have been moving to more bleach-based disinfection.",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "Vader26",
        "time": "27 July, 2020",
        "context": "photo op.  \n\nfar more efficient to send a few folks around with the 40 lbs you can carry on your back connected to a wand sprayer.  \n\nCome on.  Ask obvious questions, \"journalists.\"  Like, how would this device carry many pounds of disinfectant?",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "KateGray",
                "time": "27 July, 2020",
                "context": "\"far more efficient to send a few folks around with the 40 lbs you can carry on your back connected to a wand sprayer.  \"\n\nNo, it's not.  We've done a lot of testing on that front.  We have the backpack sprayers to go with the drone, because the drone can't get near a wall.\n\nThe drone is an ag drone.  It can carry around 10 liters of fluid, and runs at around 12 miles per hour.  It goes over seats like nobody's business.  Humans don't move that fast, or we'd be using humans to do it instead.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "Vader26",
                        "time": "27 July, 2020",
                        "context": "10 liters of water is 10 kg or 22 lbs.   A human can carry at least twice the load on his/her back.\n\nSo how long does it take you to return your drone to its loading base, manually re-fuel it (and is that via human intervention? and if so how much labor is calculated in for that?), and then return to its route?  \n\nwhat you've provided is hardly sufficient to counter my point.  please provide more data.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "KateGray",
                                "time": "28 July, 2020",
                                "context": "\"A human can carry at least twice the load on his/her back.\"\n\nYes, we can.  The problem gets to be the speed of moving up and down stadium rows, and in and out of seats.  We also can't run for long periods of time at 12 MPH.\n\n\"So how long does it take you to return your drone to its loading base, manually re-fuel it (and is that via human intervention?\"\n\nThat's part of our process - timing the refills of fluid and battery swaps so as to maximize efficiency.  There's a fair amount of math that goes into getting that right, and ideally the battery gets low near one of our staging points (in between sections).  Runners keep batteries and fluid going, and battery swaps take seconds.  Fluid refills take as long as you would expect to pour out 10 litres.\n\nThe labor is most certainly calculated into it.\n\n\"please provide more data.\"\n\nThat is a long, technical discussion, and not one that is particularly appropriate for short comments on a news article.  That drone is designed to fly in a pack of four in an outdoor environment, and to perform at about 3.5 hours to do 160 acres.  Stadiums are a bit slower, but not as much as you might think.  Beyond that, we'll just have to let our results speak for themselves.",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "user_name": "Vader26",
                        "time": "27 July, 2020",
                        "context": "also is the drone able to simultaneously move large trash to the aisles for disposal?\n\nIs the ballpark merely doing this to demonstrate that they are committed to covid disinfecting?",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "KateGray",
                                "time": "28 July, 2020",
                                "context": "\"also is the drone able to simultaneously move large trash to the aisles for disposal?\"\n\nThe spraying is done after the staff have gone through cleaning up trash, and very soiled surfaces.",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "kick@sstexan",
        "time": "27 July, 2020",
        "context": "In 1964, went with my dad to watch the Cowboys in the Cotton Bowl....fantastic!  Had gone there to the Texas/OU game with him the year before.  We thought we were living in high cotton at the Cotton Bowl. (FYI the only time you would have seen the 1964 Cowboys kneeling is if the Pope came to see them play.) Now we are using drones for everything.  Hope I live to see the next miracle occur, which would include the Dimbos all moving to Hudson Bay.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Named727",
        "time": "27 July, 2020",
        "context": "Wouldn’t want nefarious characters to get hold of this, change the spray, and fly around a filled stadium",
        "good": "6",
        "bad": "0",
        "replies": [
            {
                "user_name": "KateGray",
                "time": "27 July, 2020",
                "context": "One of the reason that large drones/common drones/ag drones have built-in no-fly-zone capabilities.\n\nThey place flight restrictions in the vicinity of stadiums during events.",
                "good": "1",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "Named727",
                        "time": "27 July, 2020",
                        "context": "Flight restrictions won’t stop a determined enemy, but some type of electronic protection that would ground drones would, I guess",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "KateGray",
                                "time": "27 July, 2020",
                                "context": "There are a number of commercially available systems to do just that, ranging from jamming solutions to nets to interception drones to lasers that burn things out of the skies.\n\nThe payload is relatively limited, and if terrorists do start drones seriously one day, we'll see these systems start to be used more.",
                                "good": "1",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "Named727",
                                        "time": "27 July, 2020",
                                        "context": "Counter measures will be needed certainly. Panic in a stadium would take a heavy toll.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": []
                                    }
                                ]
                            },
                            {
                                "user_name": "KateGray",
                                "time": "27 July, 2020",
                                "context": "The drone used in the video, by the way, has a built-in altitude limit that's much more aggressive than the limits imposed by the FAA. It wouldn't climb the steep wall on the outside of many stadiums.\n\nTo get it to climb to upper levels, you have to go up from the inside, as it won't get that high above ground on the outside.",
                                "good": "1",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "etalim670",
        "time": "27 July, 2020",
        "context": "Texas Stadium polluting the air may be more dangerous than the virus.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "buster_bluth",
        "time": "27 July, 2020",
        "context": "Now why can't they use these on BLM and ANTIFA?",
        "good": "8",
        "bad": "0",
        "replies": [
            {
                "user_name": "Some.People.Did.Some.Thangs",
                "time": "27 July, 2020",
                "context": "A fine mist of gasoline will break them of their fireworks",
                "good": "6",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "annie63782",
        "time": "28 July, 2020",
        "context": "All this disinfectant is only going to create super-bugs. Stay tuned for the unintended consequences.",
        "good": "0",
        "bad": "1",
        "replies": [
            {
                "user_name": "KateGray",
                "time": "28 July, 2020",
                "context": "The disinfectant in question is chlorine, which (unlike antibiotics) doesn't create superbugs.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "annie63782",
                        "time": "28 July, 2020",
                        "context": "Oh I feel so much better. Chlorine only causes eye, nose and throat irritation.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "YetAnotherKate",
                                "time": "29 July, 2020",
                                "context": "It's not sprayed while people are in the stadium, nor is it sprayed at a high level to begin with.\n\nPersonally, I wouldn't drink the stuff, but the levels are undetectable in short order.",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "ja88888888",
        "time": "27 July, 2020",
        "context": "Spraying with what, RoundUp ?!",
        "good": "3",
        "bad": "1",
        "replies": [
            {
                "user_name": "KateGray",
                "time": "27 July, 2020",
                "context": "Hypochlorous Acid.  Low concentration chlorine.  It evaporates quickly.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "mrdrew",
        "time": "27 July, 2020",
        "context": "be amusing if someone confused pesticide, muriatic acid,  or any other common chemical for the disinfectant. curious if that would be considered a terrorist act if they somehow started spraying too soon while people are in the stadium.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": ".za",
        "time": "27 July, 2020",
        "context": "This is so cool. Like spraying for bugs in the fields with high-performance aircraft.\n \nToo bad it is useless. Coronavirus does NOT live on surfaces once dry. Especially outside. Especially exposed to UV light spectrum.\n \nBut okay if they are spraying alcohol -- just make sure it is ethanol and not methanol or they will be pickling their sports fans.",
        "good": "3",
        "bad": "0",
        "replies": [
            {
                "user_name": "KateGray",
                "time": "27 July, 2020",
                "context": "The cleaning is not limited to stadium seats.  That's just the part done by drones.  There are also indoor surfaces to clean, like concession stands, box seats, bathrooms, etc., where COVID-19 can persist significantly longer.",
                "good": "1",
                "bad": "0",
                "replies": [
                    {
                        "error": "error"
                    }
                ]
            },
            {
                "user_name": "foles",
                "time": "27 July, 2020",
                "context": "I agree. Cleaning is not worth the time. The issue is people too close together.",
                "good": "5",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "do-it-with-a-reptile",
                        "time": "27 July, 2020",
                        "context": "The issue is actually fear and ignorance of the people.. people to close together is an agenda to drive people apart, not trust in one another..",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "shaun3",
                                "time": "27 July, 2020",
                                "context": "Well, I won't argue about the ignorance part.\n\nThe virus is expelled from the lungs, and gets into the surrounding air, so the closer you are to someone, the more likely you will be exposed to the virus if they have it.\n\nThis is known. It's not uncommon for numerous viruses to spread to people who are in close proximity, if they are airborne. Every country in the world recommends people avoid gathering in groups. Every country in the world has recommended this for other diseases during other pandemics.\n\nBecause it is so obvious that this helps that human beings have done this for various illnesses for literally thousands of years, even without knowing exactly what germs and viruses ARE. \n\nIf you actually think that this situation is so unique that it must be some kind of conspiratorial agenda to drive people apart...please take a look at history. Or just sit down and think about this as what it is: something that exists regardless of any country's politics.\n\n\n\n.",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "foxfounder1496",
        "time": "27 July, 2020",
        "context": "This is what crowd control will be like in the not so distant future. Just think of what could be sprayed from these...thin down the masses when water and food become scarce ....blame it other things....keep voting Democrat and it will be here sooner then you think.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "DavidBrowne58",
        "time": "27 July, 2020",
        "context": "If they can disinfect an entire stadium in just a few hours, imagine how little time it would take to disperse a Seattle or Portland riot with the proper \"disinfectant\"",
        "good": "5",
        "bad": "0",
        "replies": [
            {
                "user_name": "KateGray",
                "time": "27 July, 2020",
                "context": "The police always have the tools to stop riots - they could open fire in a hail of bullets.\n\nWhat constrains the police is not the ability, but the law, the politics, and morality.  Drones being able to spray chemicals doesn't change that equation.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "Some.People.Did.Some.Thangs",
        "time": "27 July, 2020",
        "context": "100,000 drunken Cotton Bowl fans yelling for their team will spray more alcohol in five minutes than that drone could spray in a week.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rick426",
        "time": "28 July, 2020",
        "context": "Maybe the can use these to disinfect Portland",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Glenriven",
        "time": "1 October, 2020",
        "context": "Looking forward to contracts to refurbish stadiums after they spray something all over them that eventually eats up the concrete.  You would be surprised what mustard will do to concrete over a 5 year span.  It is almost unavoidable that something in this spray has long term detrimental effects on building materials, that is why it is not shipped in metal containers.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "azorin535",
        "time": "27 July, 2020",
        "context": "And five years from now the sharks will be advertising their services on TV for people who may have caught __________ (fill in the blank) because of the disinfectant.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "do-it-with-a-reptile",
        "time": "27 July, 2020",
        "context": "Does everybody get tested +.. so far 100%.. good luck.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mok214",
        "time": "28 July, 2020",
        "context": "Yeah, sure. Your disinfectant is \n weak nerve agent. And there is no medical proof that nerve gas helped anyone.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "YetAnotherKate",
                "time": "29 July, 2020",
                "context": "Water will kill you if it gets in the wrong place.  So will salt.  Not having enough of either will kill you too.\n\nWe don't use hypochlorous acid at high concentrations, nor is it a nerve agent.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "StandWithUkraine166",
        "time": "28 July, 2020",
        "context": "This is a waste of time and resources.  You need masks, social distancing, contact tracing, and decent personal hygiene. Indoor events with people in close proximity are the problem, and if they are doing anything that's expelling virus (singing, sneezing, coughing, breathing too close to each other) that's the problem.  \n\nDisinfectant drones are to make you feel safe, but won't make you safe.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "do-it-with-a-reptile",
        "time": "27 July, 2020",
        "context": "lets see.. we don't know what they are spraying just like in the skys and spraying for something we cannot test for.. seems legit.",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "KateGray",
                "time": "27 July, 2020",
                "context": "We're spraying hypochlorous acid, low concentration.  It's part of the \"Free Chlorine\" you test for when you have chlorine in your swimming pool.\n\nIf you'd like to test for COVID on surfaces, there are qPCR tests for that, too.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "Bigrodreel310",
        "time": "28 July, 2020",
        "context": "You can make your own R-Water substitute simply with pure salt, water, and electricity. It will not disinfect cities, if you wonder.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "NewID50",
        "time": "28 July, 2020",
        "context": "You know... If you filled them full of jet fuel and flew them over Portapottyland and Freeattle you could really disinfect things.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "CommonSense500",
        "time": "28 September, 2020",
        "context": "Dis infect all you want. Bring in the infected people, Lost cause. Wasted time and money.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Yocktom",
        "time": "27 July, 2020",
        "context": "Cool!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "redburn13",
        "time": "28 July, 2020",
        "context": "It's a nice idea, saw coverage a few months back in India and China where they were doing this out in the streets.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Harrykeepthechange",
        "time": "27 July, 2020",
        "context": "Ok. Still not going. The first knee I see or BLM banner I see, I turn the channel too. Just did that Saturday for a soccer game.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "SEMPER_FI_H+MS",
        "time": "27 July, 2020",
        "context": "Now just put something stinky in those drones and fly them around the rioters.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "CletusPlumbBob",
        "time": "28 July, 2020",
        "context": "Need to disinfect the rioters as a trial performance.  If they scatter and don't return, then GREAT!!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tired-of-fake-news-and-drama-politics",
        "time": "28 July, 2020",
        "context": "It needs to be pepper spraying drones for all of the rioters.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "trysayinpleez",
        "time": "28 July, 2020",
        "context": "spray with methanol laced hand sanitizer",
        "good": "0",
        "bad": "0",
        "replies": []
    }
]