[
    {
        "user_name": "reallyoldguy",
        "time": "1 August, 2021",
        "context": "There will be some dead Iranians pretty damn quick.  Sooner or later Israel is going to turn Iran into a glass parking lot.  I have been to Israel on business dozens of times.  Interesting country, nice people, great food.  There are several political parties in Israel with big differences on how the country should be run.  There isn't much difference on whether or not they are going to allow another holocaust.   Regardless of what the US does, Israel will not allow Iran to get a deliverable nuke.",
        "good": "45",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "AmericanPride2020",
        "time": "1 August, 2021",
        "context": "I blame Biden for ruining our energy independence. We now rely on foreign energy and that has become a target for enemies (or democratic terrorist allies of democrats and the squad depending on what side you are on.)",
        "good": "139",
        "bad": "11",
        "replies": []
    },
    {
        "user_name": "howardgrant",
        "time": "1 August, 2021",
        "context": "A sure way to stop Muslim terrorist. Put the bodies of the Muslim terrorist on display covered with pig grease and pig parts for the world to see.  On buses and planes put glass containers of pig grease so if the terrorist plants a bomb the pig grease will get on them. They believe if pig grease gets on them they are not going to heaven with all those virgins.",
        "good": "23",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "constitutionalways",
        "time": "1 August, 2021",
        "context": "President ExtraKrispy said we will make sure the Iranians hands are slapped.",
        "good": "15",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "kilobravo556",
        "time": "1 August, 2021",
        "context": "I hope Israel makes a really big 'statement' to Iran.",
        "good": "111",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "GodBlessMyGreatStateOfTexas",
        "time": "1 August, 2021",
        "context": "Big Rig Biden Won't Do Anything Except Send Iran More Money And Put Another Depend On His Head!",
        "good": "28",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "howardgrant",
        "time": "1 August, 2021",
        "context": "Quote from Biden October 24, 2020. \"We have put together, I think the most voter fraud organization in the history of American Politics.\"  Ref. Christian Action Network Martin Mawyer, Biden stole the election. Biden needs to turn from his evil wicked ways and repent and resign from office.",
        "good": "18",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "Trumplicious",
        "time": "1 August, 2021",
        "context": "Israel will retaliate. They always do. That is how they have to be. They show any weakness they can be run over. The US and UK should hold back and see what happens for now. We need to pick a spot and hit Iran. Make it real hard. We cannot have what Iran is doing going on. You cannot attack a tanker in a foreign port of call. That is an act of war.",
        "good": "214",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "PapaJoe949",
        "time": "1 August, 2021",
        "context": "As Israel retaliates, I don’t think anyone would be surprised if Biden announces he’s valiantly trying to work with Iran to restructure the same Obama Wheel barrels full of cash deal that Trump stopped…",
        "good": "69",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "Chicago323",
        "time": "1 August, 2021",
        "context": "Did Ben and Jerry send the attackers ice cream?",
        "good": "16",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Watcher2022",
        "time": "1 August, 2021",
        "context": "Not much of a drone if it didn't sink the ship.",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "djohnson",
        "time": "1 August, 2021",
        "context": "If you keep feeding a rabid dog , sooner or later , it will bite you , better to put it down before it really hurts someone . If you get my drift.",
        "good": "13",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "lyingdemlibssos",
        "time": "1 August, 2021",
        "context": "Iran knows nobody will retaliate",
        "good": "11",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "ProudDeplorables",
        "time": "1 August, 2021",
        "context": "Israel will be the only ones to do something about this.\nThe US and Uk are nothing but talk.",
        "good": "98",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "arsportingrifle",
        "time": "1 August, 2021",
        "context": "Let’s see what kind of leader Bennett is.  This is obviously a test of Israeli fortitude post Netanyahu.",
        "good": "15",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "StompOutMarxism",
        "time": "1 August, 2021",
        "context": "When will someone other than Israel stand up to this radical-anti western mulla regime and give they a good stomping.",
        "good": "18",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "macdad1",
        "time": "1 August, 2021",
        "context": "We have weak leadership, he wont do anything that will hurt his negotiations with Iran on a nuclear deal. Iran can do anything they want and Joe will throw them big Kisses.",
        "good": "26",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ты_пиздец",
        "time": "1 August, 2021",
        "context": "It all boils down to the cowardice of Joe Biden.  Not a hard road to follow back to who is responsible.  We know it and you know it. Good on Israel if they strike the terrorists.   Iran offers nothing to the world but problems.",
        "good": "17",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "antihotair054",
        "time": "1 August, 2021",
        "context": "The U.S. again as usual getting involved in a blame game against favorite target Iran, while even the article notes that there is no evidence to support the allegation while Israel claims that they do have evidence but without presenting any. Time for the U.S. and the U.K. which historically have interfered directly in Iran, to step back and permit Israel and Iran to pursue their conflicting agendas on their own.",
        "good": "2",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "nythreefer",
        "time": "1 August, 2021",
        "context": "You've done it now Iran. Get yourself ready for an angry Biden letter that makes empty threats then sort of trails off into ice cream flavors and men on the moon and record players. You'll rue the day you....that you.....well he can't remember what you did but someone will remind him and then you're in for it.",
        "good": "186",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "bidens1braincell",
        "time": "1 August, 2021",
        "context": "I was always partial to the glass parking lot idea for Iran😉",
        "good": "14",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "deplorablyproud699",
        "time": "1 August, 2021",
        "context": "President Biden clarified the mixup, “The mullahs mistakenly thought this boat was carrying pallets of cash… we redirected the mullahs to the appropriate global appeasement vessel… where’s my pudding?…”",
        "good": "46",
        "bad": "2",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "jpkj410",
        "time": "1 August, 2021",
        "context": "They lie.",
        "good": "0",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "MostCriticalThinking",
        "time": "1 August, 2021",
        "context": "So what is Biden doing about it?  Send more money on pallets?",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cannedcorn",
        "time": "1 August, 2021",
        "context": "I look forward to Israel's response.  It will be a major blow and zero evidence to collect as to who perpetrated it.  Israel is professional in their attacks, unlike the barbaric Iranian regime.  If Israel stopped holding back so respectfully,  Iran would no longer exist.",
        "good": "109",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "VoiceOfReason21025",
        "time": "1 August, 2021",
        "context": "Trump tore up the Iran deal wish he had got a new deal done, also a deal in North Korea but wasn’t able to ",
        "good": "1",
        "bad": "9",
        "replies": []
    },
    {
        "user_name": "mollymae",
        "time": "1 August, 2021",
        "context": "JOE WAKE UP JOE NAP IS OVER ",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "stryker99",
        "time": "1 August, 2021",
        "context": "A decapitation strike against the senior Iranian leadership would send a powerful message.",
        "good": "93",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "weekend_legend",
        "time": "1 August, 2021",
        "context": "Pelosi, Shuman, squad, and other democrats anti-Israel.  But most importantly - Susan Rice.",
        "good": "14",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "HateCA",
        "time": "1 August, 2021",
        "context": "Couple dozen cruise missiles would be a good response I would think.",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "glsfbg",
        "time": "1 August, 2021",
        "context": "What's the big guy going to do about? an obama style red line?",
        "good": "20",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "Truth10",
        "time": "1 August, 2021",
        "context": "Xiden contacted Iran said they have to do better in their next attack, wanted to know if he could help them do more damage next time.",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "VernDaman605",
        "time": "1 August, 2021",
        "context": "Biden is currently formulating a new foreign policy to deal with Iran. He's calling it the \"ice cream plan\". He'll invite all the ayatollahs to have ice cream with him every day, or a couple of times a day and then he'll give them everything they want, just like he did with Putin and Xi.",
        "good": "15",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "Pierredumaine",
        "time": "1 August, 2021",
        "context": "As Korea, Vietnam, Iraq, and Afghanistan have proven, you cannot fight a war in a half-hearted manner. It must be fought to the end so that your enemy is not, and never will be, a threat again.",
        "good": "28",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "johnwayne54",
        "time": "1 August, 2021",
        "context": "Biden will sit on his hands after this attack…if he can find them.",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "usthunder",
        "time": "1 August, 2021",
        "context": "We need a device that would signal the drone to return to its operator and detonate.",
        "good": "4",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "bidens1braincell",
        "time": "1 August, 2021",
        "context": "to biden doesn't have a (what would Reagan do?) bracelet😉",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "glasseye114",
        "time": "1 August, 2021",
        "context": "Isn't it time to punish Iran and hit them hard.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "error": "error"
    },
    {
        "user_name": "what1806",
        "time": "1 August, 2021",
        "context": "Iran attacked and murdered innocent sailors on a ship that an Israeli man managed and was not there. This is typical of how Iran operate. Go after the defenseless and innocent. Claim responsibility which they did in their press and then deny it when peple respond with hostility. Iran is having a lot of civil unrest right now. The people are rebelling against the operations in Syria, Lebanon and Gaza. They need some of the money wasted spent on water and infrastucture. The American news media is ignoring this. This was an attempt to divert from internal problems.",
        "good": "64",
        "bad": "3",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "error": "error"
    },
    {
        "user_name": "ThereItGoes143",
        "time": "1 August, 2021",
        "context": "\"... and IRAN, IRAN so far away-a-a...\" ",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "albert12",
        "time": "1 August, 2021",
        "context": "Iran is safe from US retaliation with the current administration.",
        "good": "13",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "mjd57",
        "time": "1 August, 2021",
        "context": "If I was a Iran guard in Syria,  I would keep my eyes to the sky! A flash could be the last thing you see!",
        "good": "13",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "tstucker0958",
        "time": "1 August, 2021",
        "context": "Obama gave them $150 billion in US cash to finish their nuclear weapons program.  Biden probably gave them the drone and rocket and authorized their use. Iran will nuke Israel, Israel will retaliate and turn all of Iran into a glass parking lot, China and Russia will retaliate by destroying Israel and Obama and Biden will meet for beers.",
        "good": "10",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "Swampdrainer589",
        "time": "1 August, 2021",
        "context": "Ok now do something about it!",
        "good": "3",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "what1806",
        "time": "1 August, 2021",
        "context": "This is from AP who put there take out after Iran claimed responsibility.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "woofgang",
        "time": "1 August, 2021",
        "context": "Iran announced in June the US is going to drop all sanctions. The Biden administration isn't denying it, so it will probably happen. It's looking more and more like that big showdown of Ezekiel 38 is coming. Unimaginable horrors are coming to this world.",
        "good": "84",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "th0mas",
        "time": "1 August, 2021",
        "context": "Iran should be a Mideast parking lot.....",
        "good": "9",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "az2mwest",
        "time": "1 August, 2021",
        "context": "Well, don't just point the finger, take action against Iran.  Do something tangible.  Talk is cheap.",
        "good": "13",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "LTNate",
        "time": "1 August, 2021",
        "context": "Time to sink an Iranian ship.",
        "good": "3",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "bobbuilder",
        "time": "1 August, 2021",
        "context": "\"after Iran’s outgoing president acknowledged that his government at times \"did not tell part of the truth\" to the public\"\n\nUh, um.  This is why he was elected.  This was his platform.  That he was the one who deceived the west in early 2000s to create Iran's nuclear program and he was the only one who could do it again.  He said he was the one who could deceive with the power of Allah, the greatest deceiver.  He called Allah that, not me. He did this publicly, won election, the signed the Obama deal.  This is why Trump was bad for Iran.  He didn't fall for the greatest deceivers lies.",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "OrangeLeaf",
        "time": "1 August, 2021",
        "context": "The sad thing is, you can't count on the veracity of any of these players...",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "hotrodfordanda$2bill",
        "time": "1 August, 2021",
        "context": "Just send a squadron of A-10's and wipe out Iran's bathtub navy. Stop fooling around.",
        "good": "8",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "yo666",
        "time": "1 August, 2021",
        "context": "The only way this will stop is after Israel Thumps Iran. Do it do it now.",
        "good": "14",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "cagop922",
        "time": "1 August, 2021",
        "context": "The DNC is investigating to see whether Trump was involved.",
        "good": "20",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "tothkevin",
        "time": "1 August, 2021",
        "context": "And we will do nothing! ",
        "good": "7",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "cagop922",
        "time": "1 August, 2021",
        "context": "Iran is not afraid of Biden. The only people afraid of Biden are young girls.",
        "good": "22",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "rdtrip",
        "time": "1 August, 2021",
        "context": "Time for a strategic attack on a Iran military target by Israel with the full backing of the USA.",
        "good": "11",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "cagop922",
        "time": "1 August, 2021",
        "context": "I'll comment after Lebron tells me what to think.",
        "good": "11",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "Erniedawg99",
        "time": "1 August, 2021",
        "context": "Surely we know where the drone was launched from.  A couple cruise missiles will do the trick.  When they shoot off the next one repeat the cruise missiles.  ",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "cagop922",
        "time": "1 August, 2021",
        "context": "The White House is monitoring the situation.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cagop922",
        "time": "1 August, 2021",
        "context": "I stand with Israel. Do you?",
        "good": "40",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "cagop922",
        "time": "1 August, 2021",
        "context": "Kamala: Where is Oman? Is it near Russia?",
        "good": "4",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "lieberalshateamerica",
        "time": "1 August, 2021",
        "context": "Why does Biden allow this to happen? Why won't he act? Because hisVagina hurts.",
        "good": "4",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "blasto",
        "time": "1 August, 2021",
        "context": "The Iranians are testing Biden, Bennett and western powers. So far all three have failed miserably. Expect conflict, dead bodies and oil & gas shortages.",
        "good": "13",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "thomasmedicine",
        "time": "1 August, 2021",
        "context": "Come on libs, let’s see justify senseless murder because of your anti Semitism.",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "Truth10",
        "time": "1 August, 2021",
        "context": "Xiden contacted Iran and told them they needed to do more damage to Israel than that if they expected his continued support.",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "hooduhthunkit",
        "time": "1 August, 2021",
        "context": "The Mercer Street\nLiberian-flagged \nOwned by Japan's Taihei Kaiun Co.\nManaged by London-based Zodiac Maritime, which is part of Israeli billionaire Eyal Ofer’s Zodiac Group.\n\nLots of hands in the cookie jar. Lol",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "DustyBottoms1776",
        "time": "1 August, 2021",
        "context": "Now let's buy some oil from them....as we don't have anymore of our own....\nMy Lord......",
        "good": "1",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "Vetforfreedom",
        "time": "1 August, 2021",
        "context": "All we can do is pray for war against Iran, Russia and China. ",
        "good": "0",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "slowjoeman",
        "time": "1 August, 2021",
        "context": "They have to move Joes cartons of depends out of the situation room now.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "SansTrump",
        "time": "1 August, 2021",
        "context": "Iran is about to learn about Drone jammers .",
        "good": "0",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "Clavell-RiveraP.R.(USA)",
        "time": "1 August, 2021",
        "context": "This Biden's Democrats COMPROMISED Administration Foreign Policy INEPTITUDE is a THREAT to our National Security Crisis!! Biden stopped the XL Keystone Gas Pipelines and now plans to buy oil from Iran...if this is true ?? He should be Impeached!! Iran has been abusing in the middle east and has find Kerry and Biden's Democrats Administration a closed ally!! Americans are Watching!!",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "cagop922",
        "time": "1 August, 2021",
        "context": "At a time like this you need Trump as President",
        "good": "20",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "RoRo400",
        "time": "1 August, 2021",
        "context": "Just start the war and lets get it done and over with... blah blah blah disturbs the ears",
        "good": "0",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "cagop922",
        "time": "1 August, 2021",
        "context": "Biden just put on his brown pants just in case.",
        "good": "5",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "laowai",
        "time": "1 August, 2021",
        "context": "Iran has absolutely nothing to fear as long as Biden is in office. They could even double down if they would start purchasing some of Hunter's masterpieces.",
        "good": "22",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "shelbon",
        "time": "1 August, 2021",
        "context": "let Israel take care of it. they have public on their side unlike our sissy people",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "laowai",
        "time": "1 August, 2021",
        "context": "I guess the Mossad needs time to \"Spool-up;\" Bibi Netanyahu would have had the matter addressed by now.",
        "good": "5",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "ctreader502",
        "time": "1 August, 2021",
        "context": "And what are they going to do about it?",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "boba671",
        "time": "1 August, 2021",
        "context": "Iran look out.. If you get attacked.. Israel can deny it also! Idiots.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "brontosaurus",
        "time": "1 August, 2021",
        "context": "Israel should take out the iranian POWER GRID.\nSummer is a good time to do it !\nUse 100 \"one-way\" drones to do it !",
        "good": "14",
        "bad": "2",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "error": "error"
    },
    {
        "user_name": "jujy233",
        "time": "1 August, 2021",
        "context": "US and UK would rather Israel hit a naval target in Iran than do something themselves that jeopardies the Hussein Obama nuclear deal.",
        "good": "7",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "bourgeoiz",
        "time": "1 August, 2021",
        "context": "Blame Iran?  Try blaming Bidis for his soft on Iran policies.",
        "good": "11",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "OrangeMan2024002",
        "time": "1 August, 2021",
        "context": "In this backwards administration I see them not doing anything to Iran in response and giving concessions in future nuclear talks.",
        "good": "12",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "PepperRidge",
        "time": "1 August, 2021",
        "context": "Make no mistake, Israel is getting ready to face the battle foretold in the book of Ezekiel. This battle takes place just after the return of Jesus and His people have been removed from the events described as the \"Tribulation.\" This is how God will let the Israeli's know, He is with them - HE destroys the attacking forces from modern day Russia, Iran, Turkey, Libya, Ethiopia and Sudan. \nUnderstand, Jesus' return is imminent. See Matthew 24, 2 Timothy 3:!-5, Daniel and Revelation for descriptions of the mindset of man, physical signs, political positions of the one world government forming, religion and economic system. It's called globalism, Chrislam and the Great Reset. Israel will be the centerpiece of the seven year Tribulation - why? Because for the AntiChrist to win, he needs Israel's to believe he is the promised Messiah. When they realize he's not 3 1/2 years in, then hell is unleashed. When this man demands worship as \"God\" and defiles their Temple, inhabitants in Jerusalem had better run and not stop till they get to Petra.\nThe Bible has outlined this time period very clearly. We ARE in the last minutes of the Age of Grace. Once Jesus collects His people... The one who will sign am existing peace deal with Israel and others, after this battle is the AntiChrist.  God has warned man - are you listening? Wake up! Repent, be saved, seek the Lord and forgiveness - it's all happening now. Time is almost up, Wake up!  Evil does not win, God does. Be saved or be lost...",
        "good": "21",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "RedCarrot",
        "time": "1 August, 2021",
        "context": "Biden sent more Cash to Iran.",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "Non-brainwashed-american",
        "time": "1 August, 2021",
        "context": "If there is undeniable evidence then why does iran still have airports ,ships and a power grid up and running? Those  3 things should have been a memory this morning.",
        "good": "19",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "111638",
        "time": "1 August, 2021",
        "context": "Israel needs to stop using restraint. Do whatever it takes to protect your citizens and country.",
        "good": "32",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "republicans#1",
        "time": "1 August, 2021",
        "context": "Blame Iran for this blame china for  covid Russia hacked this .They sit on there hands waiting for what take them out .",
        "good": "1",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "dereg80s",
        "time": "1 August, 2021",
        "context": "Reminder US UK Israel started these types of attacks and also cyber attacks. it is foolish to start this type of activities on someone's  insistence and also keep quite about it",
        "good": "3",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "rickh791",
        "time": "1 August, 2021",
        "context": "Israel can and should retaliate.\nThe US and UK will continue to wring their hands and run their mouth, but DO nothing.",
        "good": "18",
        "bad": "2",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "jerryclc",
        "time": "1 August, 2021",
        "context": "Let Israel take care of it.",
        "good": "17",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "cagop922",
        "time": "1 August, 2021",
        "context": "It's time to light up an oil refinery or two. Do you agree?",
        "good": "21",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "conservativevoter224",
        "time": "1 August, 2021",
        "context": "Ok, you three big countries.  What are you going to do about it?   Hello?  Is anyone there?  Hello?",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "survivingpnw",
        "time": "1 August, 2021",
        "context": "Joe just needs to send them another plane loaded with pallets of cash...",
        "good": "11",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "paulrodgers",
        "time": "1 August, 2021",
        "context": "Take out Irans coastal defenses....Radar sites, missile launchers, and their naval assets in one simultaneous attack via missiles and air strikes.  Sooner or later we will have to deal with Iran, which has been at war with America since 1979.  Better now than later..",
        "good": "49",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "rocksoff",
        "time": "1 August, 2021",
        "context": "The port at Bandar-Abbas needs to be leveled, that should take some steam out of them.",
        "good": "9",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "grnstar",
        "time": "1 August, 2021",
        "context": "Why not simply turn the waterfront in Iran into one long continuous beach about 2 miles wide.",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "swatguy",
        "time": "1 August, 2021",
        "context": "Maybe Joe will appoint Kammie to head a task force to study the attack since she's apparently solved the border crisis.",
        "good": "18",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "justpassenthru",
        "time": "1 August, 2021",
        "context": "Fox News says no one claimed responsibility. Microsoft news quoted an Iranian official who said if was a retaliatory strike. Seems to more data we have flowing in these days the less likely you are to know the truth of the matter",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "justpassenthru",
        "time": "1 August, 2021",
        "context": "Rumor has it Joey plans to lay down a tan line in the sand.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "leftuptous",
        "time": "1 August, 2021",
        "context": "It's time to hold one of those peaceful protest on Iran.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mrobbins810",
        "time": "1 August, 2021",
        "context": "Israel and the other nations need to bomb Irans oil facilities and start taking this communist nation out..",
        "good": "5",
        "bad": "2",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "notalibsheep",
        "time": "1 August, 2021",
        "context": "Biden has had it. He sent an angry letter to the mullas with just three words. No ice cream",
        "good": "14",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Say.it.aint.so.joe642",
        "time": "1 August, 2021",
        "context": "Has anyone else noticed that this STUFF didn't happen under Trump?  The world knows Biden and his administration is weak.\nRight now, Biden is loading C-17's up with USD to fly to Iran as a apology, just like his string puller, Obama did.",
        "good": "27",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "NearlyGenius",
        "time": "1 August, 2021",
        "context": "This is going to cost Iran another full sized \"Naval vessel\" in the near future.\n\nProbably from a rogue torpedo.",
        "good": "17",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "ACE888920",
        "time": "1 August, 2021",
        "context": "We know, time for a invasion! ",
        "good": "3",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "Maddogbites",
        "time": "1 August, 2021",
        "context": "It’s not in the best interest to give details about any type of surveillance ability! I would add Iran like Hezbollah don’t need justification to attack anything Jewish . If not for fallout, they should just nuke the whole area for the betterment of mankind ",
        "good": "3",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "noncommunist",
        "time": "1 August, 2021",
        "context": "Plan A: Flatten Iran's primary oil refinery.\nPlan B. Flatten Iran's primary oil refinery,",
        "good": "13",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "WattaJerko",
        "time": "1 August, 2021",
        "context": "Hey, Israel, will you please get off your duffs and nuke Iran. Oh wait, I forgot, elections have consequences. Nevermind. Learn to like getting sand kicked in your faces by the beach bully.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "rrr383",
        "time": "1 August, 2021",
        "context": "Is it coincidence that the Biden administration lifts sanctions against Iran, increases US dependence on foreign oil and them, all of a sudden, Iran finds the resources to attack adversaries.  This cycle has repeated itself countless times.",
        "good": "80",
        "bad": "6",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "guitarcrusher",
        "time": "1 August, 2021",
        "context": "So.  These countries blaming Iran will only lead to a \"harrumph-like\" scene from Blazing Saddles.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "averageguy074",
        "time": "1 August, 2021",
        "context": "I’m sure Russia China and South Korea will sell us ammo if we need it and it goes to war. Since we outsourced all our raw component munitions capability to them. Thanks Joe for emboldening Iran to start attacking the world.",
        "good": "8",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "tomdahl",
        "time": "1 August, 2021",
        "context": "I don’t really think Iran knows what a whirlwind is but I believe Israel can show them.",
        "good": "7",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "windman205",
        "time": "1 August, 2021",
        "context": "All three are pure evil.",
        "good": "1",
        "bad": "7",
        "replies": []
    },
    {
        "user_name": "jackieo",
        "time": "1 August, 2021",
        "context": "The big three war criminals states blame Iran for their Own ISIS/Al Qaida thugs attacking an Israeli ship with a DJI hobby drone snd 5 pounds of explosives. Iran had nothing to do with this. The murderous scum leading the US, UK, Israel have an unquenchable lust for  war snd bloodshed. War criminals need trials and public hanging, not pensions.",
        "good": "3",
        "bad": "12",
        "replies": []
    },
    {
        "user_name": "freethinker888",
        "time": "1 August, 2021",
        "context": "It wasn't the Swedes! Who else in this region would do it? Don't mess with Israel!",
        "good": "10",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "The_Fourth_Horseman",
        "time": "1 August, 2021",
        "context": "Smoke 'Em!",
        "good": "6",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "lmfellerman",
        "time": "1 August, 2021",
        "context": "How about a proportionate response?",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "wow?",
        "time": "1 August, 2021",
        "context": "nothing will happen no response by the US or UK, isreal i think would but the US will tell them not to",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "LetRride",
        "time": "1 August, 2021",
        "context": "I can't wait to see the payback.",
        "good": "17",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "41tony",
        "time": "1 August, 2021",
        "context": "It would be nice if one or maybe all three do something about this. But a usual the Weinies will do nothing.",
        "good": "8",
        "bad": "2",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "OrangePalmtree",
        "time": "1 August, 2021",
        "context": "Empty ship, israeli managed.... look for insurance fraud.",
        "good": "2",
        "bad": "11",
        "replies": []
    },
    {
        "user_name": "RandyRhoadsPilot",
        "time": "1 August, 2021",
        "context": "Beijing Biden’s Soy Boys are triggered",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bigtuna11",
        "time": "1 August, 2021",
        "context": "Why does the world need Jews?\n\nREALLY  PRACTICAL INVENTIONS: Jeans, Lipstick, the Ballpoint Pen, Contraceptives, Instant Coffee, Television Remote Control, Traffic Lights, Scotchguard, the Flexistraw.\n\nREALLY BIG INVENTIONS: The Atomic Bomb, the Thermonuclear Bomb, God, Genetic Engineering, the Nuclear Chain Reactor, Virtual Reality.\n\nCULTURAL CONTRIBUTIONS: Hollywood, the Sit-Com, the Long Playing Record, Woodstock, Sound Movies, Videotape, Color Television, Instant Photography, Holography\n\nGAME CHANGERS: Monotheism, Psychoanalysis, the Theory of Relativity, the Weekend (Shabbat)\n\nINVENTIONS BEGINNING WITH THE LETTER “C’: Capitalism, Communism, Circumcision, Cheesecake, Cafeterias\n\nNEVER BUY RETAIL: Discount Stores, Pawn Shops, the Shopping Cart and the Ready-to-Wear Clothing Industry\n\nI FEEL BETTER ALREADY: Prozac, Valium, The Polio Vaccine, Radiation, Chemotherapy, the Artificial Kidney Dialysis machine, the Defibrillator, the Cardiac Pacemaker, Vaccination against the deadly “Hepatitis B” virus, the Vaccinating Needle, Laser Technology\n\nCHAI TECH: Google, the Wire Transmission Facsimilie (FAX) , the Microphone, the Gramophone, the Microprocessing Chip, Optical Fiber Cable,  Laser, Cellular Technology, the Videotape Recorder\n\nHOW DID WE LIVE WITHOUT THESE?: Drip Irrigation, Scale Model Electric Trains, the Pager,  the Walkie-talkie,  Refrigerated Railroad Car, High-vacuum Electron Tubes, the Incandescent Lamp, Kodachrome Film, the Blimp, the Adding Machine,  Stainless Steel, Tapered Roller Bearings.\n\n \n\nA NOBLE PEOPLE: At least 178 Jews have been awarded the Nobel Prize, accounting for 23% of all individual recipients worldwide between 1901 and 2008, and constituting 37% of all US recipients during the same period.  In the scientific research fields of Chemistry, Economics, Medicine and Physics, the corresponding world and US percentages are 27% and 40%, respectively.  (Jews currently make up approximately 0.25% of the world’s population and 2% of the US population).",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "wonderhorse",
        "time": "1 August, 2021",
        "context": "If they offer no proof, why should we beleive them? They hate Iran and as has been repeatedly shown, they will stop at nothing to justify attacking them.",
        "good": "1",
        "bad": "8",
        "replies": []
    },
    {
        "user_name": "anchorpost",
        "time": "1 August, 2021",
        "context": "Where in the world did Iran get the technology for them there drones? Iran gets blamed for everything. If I could I would load up a military aircraft and deliver 50 trillion dollars to the head folks in Iran. Peace in our time. Peace in our time. Seems that someone may have said that before.",
        "good": "4",
        "bad": "7",
        "replies": []
    },
    {
        "user_name": "ynot517",
        "time": "1 August, 2021",
        "context": "For every ship Iran attacks, sink two of theirs, they will get the hint eventually.",
        "good": "14",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "jackr1",
        "time": "1 August, 2021",
        "context": "Of course it was Iran.    Just like the Wuhan lab is responsible for the China virus.",
        "good": "15",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bobalan5",
        "time": "1 August, 2021",
        "context": "it's time to react......\nend this murderous regime. ",
        "good": "17",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tom3746917",
        "time": "1 August, 2021",
        "context": "Biden is too weak and senile to do anything about this.",
        "good": "17",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "ptatim",
        "time": "1 August, 2021",
        "context": "Like the U.S., anti-white foreigners like the Jewish British Foreign Secretary Dominic Raab have also (and long ago) taken over England and used her blood and treasure to fight endless wars for Jewish interests around the world.  What the hell do the English people care what Iran does in the Middle East?  Probably all lies anyway.  English, Scottish, Welch and Irish people DID NOT want war with Germany.  It was the foreigners, who brought off corrupt white men like Winston Churchill who dragged England (and France, Russia and the U.S.) into that blood bath. It never ends with these people. ENOUGH!",
        "good": "3",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "mtranger",
        "time": "1 August, 2021",
        "context": "I'm sure that the evidence that Israel has against Iran is rock solid, but they would be foolish to release it, because doing do would reveal methods and sources.  Iran should suffer the consequences of their actions.",
        "good": "24",
        "bad": "2",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "trkfitzsimons",
        "time": "1 August, 2021",
        "context": "The Iranian government needs to be careful in dealing with the Biden administration, lest they upset tough guy Middle-Class Joe so that he only gives the Iranians hundreds of millions of dollars instead of billions, like his mentor Obama did.",
        "good": "64",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "stormbringer226",
        "time": "1 August, 2021",
        "context": "No worries, Barry and ChinaJoe will give them more money!",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bede1319",
        "time": "1 August, 2021",
        "context": "Iran says, \"He added: \"Whoever sows the wind shall reap the whirlwind.\"\nPerhaps they should heed their own warning.",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "stekev0",
        "time": "1 August, 2021",
        "context": "We have messed up so many ME country's except the real enemy. We just give them cash money because our checks bounce.",
        "good": "2",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "justpassenthru",
        "time": "1 August, 2021",
        "context": "\"Iran lashed out at Israel and denied being involved\"\n\nwhat did you expect them to say? \"Gotcha!\"?",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "southtexascitizen",
        "time": "1 August, 2021",
        "context": "My vote is to turn the Iranian military ships the Sahand and the Makran on their trip back from Russia into fish reefs.  Jam their communications, send them to the bottom in deep water for fish habitat.",
        "good": "19",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "buffalo8031",
        "time": "1 August, 2021",
        "context": "Biden has threatened to send corn pop over there to get things straightened out! ",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dukeroadwalker",
        "time": "1 August, 2021",
        "context": "Biden is not saying anything now. What he going to do if Bennett really hammers Iran, if he acts like he talks.",
        "good": "10",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Mangie835",
        "time": "1 August, 2021",
        "context": "Ok wake up Biden so he can read his response",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "gkurtb",
        "time": "1 August, 2021",
        "context": "Iran!  I have a feeling that Israel will send you a personal message, just \"WAIT\" for it.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "thatParrotsDead",
        "time": "1 August, 2021",
        "context": "um, 'Suicide' drone...so they are alive now?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "thundervalleys",
        "time": "1 August, 2021",
        "context": "They have been in an undeclared war for 40 + years, good luck with that !",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "missouriboy",
        "time": "1 August, 2021",
        "context": "If Trump were President, this would have never happened!",
        "good": "25",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "skepticism@last",
        "time": "1 August, 2021",
        "context": "Joe say's \" That does it! \nThe next pallets of cash, are going to be all small bills. \nIran will need a bunch more warehouses just to store so many pallets. So the joke is on them.... \"",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "thereckoning(Rev.16:11)",
        "time": "1 August, 2021",
        "context": "The world's most dangerous tyranny. Apart from China.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ExLAPD",
        "time": "1 August, 2021",
        "context": "Apparently Iran has forgotten who they are dealing with when it comes to Israel.  There's no other country in the world that could have infiltrated and stole Iran's nuclear secrets.  Keep provoking Israel and suffer, yet again, the consequences.  Only this time could be your last.",
        "good": "8",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "dpwilliams",
        "time": "1 August, 2021",
        "context": "I don’t know why the US and the rest of the world keep messing with Iran. We need to track the leaders locations and take every one of them out. I would say to take out Tehran but I don’t want innocent people killed.",
        "good": "7",
        "bad": "2",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "Covid-Lie",
        "time": "1 August, 2021",
        "context": "Illegitimate Joe will turn his back on Israel, and we will witness a regional war. Time to stock up on food and water. Its going to be psychotic the next 12 months.",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "WarsЯus",
        "time": "1 August, 2021",
        "context": "US, UK and Israel--big Satan, little Satan, and one retired Satan who wants in on the action.",
        "good": "2",
        "bad": "18",
        "replies": []
    },
    {
        "user_name": "Prgmr",
        "time": "1 August, 2021",
        "context": "Just return the favor to Iran.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "KerrysPrivateJet",
        "time": "1 August, 2021",
        "context": "Was mulluh xiden made aware that the US laid blame with Iran? Ayatollah Obama wont like that",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "doasIsaynotasIdo",
        "time": "1 August, 2021",
        "context": "Ya Think!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Sgt.Mike873",
        "time": "1 August, 2021",
        "context": "Thank you, John and Joe!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "learnthetruth188",
        "time": "1 August, 2021",
        "context": "... drunk, doped up members of IRG armed with sophisticated weapons. What possible could happen, right?",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "azbitesback",
        "time": "1 August, 2021",
        "context": "I think Iran, China and Russia are pushing for a Shoot Em up with China Joe being weak and scared of his CCP Masters.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Obtusionist",
        "time": "1 August, 2021",
        "context": "With Biden as president America's enemies feel emboldened. The world is a dangerous place right now.",
        "good": "11",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "charlie1946",
        "time": "1 August, 2021",
        "context": "So are these allies going to-do anything about it. Seems like an invitation to take out their nuclear production. If all 3 take part in a selective strike, there will be a lot of hand wringing and blockading by Russia and China, a lot of crying at the U.N. But little else unless they want to start another World War. Kick them in their nuclear butt.",
        "good": "8",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "error": "error"
    },
    {
        "user_name": "johnnz",
        "time": "1 August, 2021",
        "context": "Unless it was a bored Elf from the North Pole then of course it was Iran.",
        "good": "9",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "45$",
        "time": "1 August, 2021",
        "context": "Pretty soon they'll have nukes on those drones.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "maineman972",
        "time": "1 August, 2021",
        "context": "Big deal.. So what do you plan to do about it... OH Joe just forgot it happened.. So Sorry",
        "good": "4",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "mtnbikguy",
        "time": "1 August, 2021",
        "context": "I have my suspicions that Israel will get back at them - hopefully before Joe apologizes and sends another billion in cash as a sorry present",
        "good": "15",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "tbowen041",
        "time": "1 August, 2021",
        "context": "Iran vs. Isreal? Probably not even a three day war.... the mujaheddin (sp) fallout? Who knows....",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "tolerancegone039",
        "time": "1 August, 2021",
        "context": "Bennett may not be Netanyahu but I expect a response . I may never hear about it but it will happen .\nIran needs a good dose of freedom .",
        "good": "16",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "justpassenthru",
        "time": "1 August, 2021",
        "context": "hey folks, remember ... when you see Vinny just use the mute function and whoooosh he's gone for good from your viewing anymore of his posts ... just saying",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Think4urselves",
        "time": "1 August, 2021",
        "context": "Iran denies involvment. Isn't that what they said about the airliner shot down heading to Ukraine from tehran. That being said I don't trust the us/uk intelligence either. Remember the weapons of mass destruction that Saddam had.  On a softer note. Who could verify that all of Iraq's weapons were dismantled or moved out of country before the us invasion?   Bush.  He and McCain just destroyed the Mideast countries. And throw in Hillary for destroying Libya taking there billions of gold and silver. Obama making a deal with the Saudis giving the green light to take yemen. Selling billions in weapons to s\\a. And mcstain wanting to arm the so called freedom fighters in Syria to take out damascus. Why do the Arabs call it daesh and not isil. Because the us created the mess.   America isn't innocent.",
        "good": "1",
        "bad": "8",
        "replies": []
    },
    {
        "user_name": "mh507",
        "time": "1 August, 2021",
        "context": "At least Israel is part of this. The US and Brit response will be just bluster.",
        "good": "9",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "texboy",
        "time": "1 August, 2021",
        "context": "This is the nation Biden want to make business with!\nGod help us",
        "good": "8",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "bribing-Bidens",
        "time": "1 August, 2021",
        "context": "Heck, blame the mother freaking Squad and the Dem media mobs",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "scar55",
        "time": "1 August, 2021",
        "context": "I am sure within the next 7 days we will be hearing about death and destruction somewhere in Iran. Go Israel. ",
        "good": "10",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "phoenix2020",
        "time": "1 August, 2021",
        "context": "Whatever the Israelis do, you can bet it’s going to take a lot of man hours to fix.  The tanker aside, it’s starting to look like the Iranian leadership is digging themselves a deep hole. They’re forgetting that the Iranian people got mad enough to dump the Shah.",
        "good": "5",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "DanS.",
        "time": "1 August, 2021",
        "context": "I think that a bomb in a cellphone or two would be an appropriate Israeli response. It's my favorite. Answer the phone and lose your mind.",
        "good": "4",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "bobfred99",
        "time": "1 August, 2021",
        "context": "It's called \"tit for tat\". Israel doe something, Iran responds and visa versa.\nLet them duke it out. Nothing of concern for the US.\nAmerica first.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "BidenSniffed#MeToo",
        "time": "1 August, 2021",
        "context": "The idiots that run Iran have proven over the past 30+ years that they are completely incapable of doing any good. Level the place and be done with it.",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "gsaogb",
        "time": "1 August, 2021",
        "context": "false flag to start a war.",
        "good": "3",
        "bad": "10",
        "replies": []
    },
    {
        "user_name": "ncjoe781",
        "time": "1 August, 2021",
        "context": "hit them back, hard..",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "yongkim777",
        "time": "1 August, 2021",
        "context": "Biden won't do squat! He doesn't want to upset his handlers!",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "johninmd437",
        "time": "2 August, 2021",
        "context": "Time to take out Iran's center of government.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "PurpleFan",
        "time": "2 August, 2021",
        "context": "No more hesitation, let's send Iran to their God.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "*1*",
        "time": "2 August, 2021",
        "context": "Iranian Mullahs better sleep with one eye open. . .",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "theloneharanger",
        "time": "2 August, 2021",
        "context": "The way to get their attention is to inform the UN that they should withdraw their ambassadors and any of their citizens from Iran.  Give them 30 days to do so.  No other explanation.  You will see just who the supporters of Iran are.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "mrwrightbro",
        "time": "2 August, 2021",
        "context": "If this was 2018 this story would have been published after the one where the US destroyed Iranian military capabilities. ",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "johndoe381",
        "time": "1 August, 2021",
        "context": "We blame Iran for 30 years, but Obama released money for Iran, money for terrorists, Biden lifted UN sanctions on Iran.\nWell.. let's blame Iran, it's so intimidating. Lol.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "SimplyMarvelous",
        "time": "1 August, 2021",
        "context": "HOW FECKLESS ARE WE???\n\nAn unprovoked attack in international waters on an unarmed commercial vehicle....\n\nAND NOTHING IS DONE???",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "susanrey",
        "time": "1 August, 2021",
        "context": "Yeah, that's so out of character for the iranians, hey blinkin.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cantstplghing",
        "time": "1 August, 2021",
        "context": "Time for some payback......oh, wait, I forgot president Magoo doesn't remember how to get from his bedroom to the White house garage where he left his 18 wheeler",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Peter_Safety",
        "time": "2 August, 2021",
        "context": "Every time U.S. Secretary of State Antony Blinken speaks in public … I hear his knees knock.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Aprice",
        "time": "2 August, 2021",
        "context": "And nothing will be done about it",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "don’tmatter",
        "time": "2 August, 2021",
        "context": "Iran: “we didn’t do nuffin…”",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "2950",
        "time": "2 August, 2021",
        "context": "Israel should bomb Iran back into the stone age, and  if it takes nuc weapons, so be it!",
        "good": "4",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "rolland",
        "time": "1 August, 2021",
        "context": "Iran is not worried about Biden. Nothing will happen from the US and Iran will grow more bold.",
        "good": "16",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "blahblahtruth76",
        "time": "2 August, 2021",
        "context": "Isreal is not like the U.S they will  and can make Iran a parking lot",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "hamsandwich231",
        "time": "1 August, 2021",
        "context": "bad days be on a ship with drones you can launch a strike from a garbage skall or your backyard. one day we will have vertical launch drone carriers like the jetter",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "darlinfamily688",
        "time": "2 August, 2021",
        "context": "we'll probably respond \" in the strongest terms\"",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "darrellparks49",
        "time": "1 August, 2021",
        "context": "An Iran le3ader says his little boy was flying his drone when an evil Israeli ship deliberately crashed into. The UN is demanding an immediate investigation into the terrorist actions of Israel.",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "doced69",
        "time": "1 August, 2021",
        "context": "Israel, with its new leaders, will likely retaliate, but we can't yet be sure of just how politically correct this current government will be.  The UK has stepped up, rhetorically, but actions speak louder than words.  As for the incompetent, inept, and woke Biden circus troupe, I expect nothing more than empty \"almost\" threats against the Iranian radical theocracy, particularly given the \"welcome back\" attitude and actions of our feckless \"leadership.\"",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "good13",
        "time": "1 August, 2021",
        "context": "We will be at war right before the 2022 elections ramp up",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "MT.Man",
        "time": "2 August, 2021",
        "context": "When WW3 breaks out it will start with a relatively small, insignificant, event ! ",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "logandavis",
        "time": "2 August, 2021",
        "context": "USA just bought a billion dollars worth of german trains, korea's exports are booming, this ship is owned by japan, yet it's good old uncle stupid who has tens of billions of dollars worth of taxpayer funded navy ships in the area, including sending personnel onto the attacked ship and escorting.  why are we, the world's biggest debtor, responsible for defending the world?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "apacanadden",
        "time": "1 August, 2021",
        "context": "Wincon, Blincon, and Nod are in charge for sleepy.  Let's see them deflect any blame on Iran.  Thank goodness Israel stands strong!",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "commentsrus",
        "time": "2 August, 2021",
        "context": "I am a simple man, ii do not like complexity and even more, I do not like being taken advantage of. Let's drop a MOAB on Iran and just spare everybody a lot of time, money, energy and hardship. They bring no value to the world and offer no reason to exist. Give the good people of the country 180 days noitce so that they can leave safely. Then blow them off the face of the earth. Problem solved.",
        "good": "7",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "rockyrc",
        "time": "2 August, 2021",
        "context": "Biden is terrified of Iran, Russia, and N. Korea  to name just a few.  They will all take their terms stealing his lunch and he will do nothing but send them more money as others get in line to slap him silly.  He won't even confront domestic terrorists burning Cities to the ground.  Do you really think he will have a response to someone who will fight back?\"",
        "good": "12",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "RomanGalatti",
        "time": "2 August, 2021",
        "context": "The only reason Iran is so bold is because they have the backing of Russia, China and NK.",
        "good": "8",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "golfer1a",
        "time": "2 August, 2021",
        "context": "I wish our government leaders had the focus and direction of the Israelis.",
        "good": "9",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "C1C",
        "time": "2 August, 2021",
        "context": "New Iran leader testing the waters",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Joke-a-DayJoe",
        "time": "2 August, 2021",
        "context": "Not to worry. Sleepy Joe will kiss and make up with Iran by removing sanctions and delivering palettes of cash.",
        "good": "9",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "noodlesblackman",
        "time": "2 August, 2021",
        "context": "Trump would not put up with this crap black American for Mr Trump ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "audacity69",
        "time": "2 August, 2021",
        "context": "biden?...nevermind...",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "joshb",
        "time": "2 August, 2021",
        "context": "tit for tat",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sacramentomike",
        "time": "2 August, 2021",
        "context": "Israel bombing everyone, Iran, Syria, Palestine then they cry about being bombed. Pathetic losers.",
        "good": "3",
        "bad": "9",
        "replies": []
    },
    {
        "user_name": "11evilace11191",
        "time": "2 August, 2021",
        "context": "So why is this attack being made to sound heinous when ALL the confirmed Israeli attacks on Iran in Iran are not considered heinous , but in fact considered just.",
        "good": "3",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "dtail1863",
        "time": "2 August, 2021",
        "context": "I am wondering if after U.S. Secretary of State Antony Blinken made the statement if it ended with the signature of they/them/their.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "yepbookertdied775",
        "time": "2 August, 2021",
        "context": "Israel will deal with it..\nUnlike our “punked out” country under its current status.. \nNotice I didn’t say leadership.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "noneyabeezwax423",
        "time": "2 August, 2021",
        "context": "Surely Tehran can use another parking lot where the Revolutionary Guard HQ stands...\n\nA Star of David shaped crater in the center would make a nice finishing touch.  🇮🇱🇺🇸",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "maxinestaxadermist",
        "time": "2 August, 2021",
        "context": "Time for Biden to give Iran some more cash?",
        "good": "1",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "train88",
        "time": "2 August, 2021",
        "context": "Israel need to bring back the old prime minister. Iran is laughing at this US president! ",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "brontosaurus",
        "time": "2 August, 2021",
        "context": "BLAME MEANS NOTHING !\nWhat are they going to DO about it ???",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "JimJones909",
        "time": "2 August, 2021",
        "context": "OK Joe, what are you going to do now?",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "solutionsnotproblems",
        "time": "2 August, 2021",
        "context": "We'll see your drone, and raise you one cruise missile. ",
        "good": "10",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "lewisxxxusa066",
        "time": "2 August, 2021",
        "context": "Iran has gotten off Scott Free so far",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mgoblue",
        "time": "2 August, 2021",
        "context": "Biden cheered at this and the squad will be throwing a party",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "RomanGalatti",
        "time": "2 August, 2021",
        "context": "\"Iran denied being involved.\" LOL....when was the last time Iran admitted to ANY wrongdoing?!?!",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "sacramentomike",
        "time": "2 August, 2021",
        "context": "Has Israel PAID the $1.1 BILLION dollar Swiss Court Judgment to Iran yet? Israeli crooks trying to evade payment.",
        "good": "3",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "peregrine464",
        "time": "2 August, 2021",
        "context": "A point needs to be made by destroying some of Iran's infrastructure. Actions have consequences.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "ConfederateFaceCaver",
        "time": "2 August, 2021",
        "context": "Just like when \"Iran\" strafed the USS Liberty",
        "good": "4",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "mea1222",
        "time": "2 August, 2021",
        "context": "Another lie, another war? Remember the USS Liberty, my fellow Americans.",
        "good": "3",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "Justcommonsense,,,OneVet",
        "time": "2 August, 2021",
        "context": "I have read 3500 books in my life. I am 78 years old.  Meany of the books were about the middle ages.  Never in 3000 years as a group of people been more persecuted then the Jews. I think the future  historians will look upon American as one of it's finest time by protecting Israel.\nI am voting for Trump!",
        "good": "6",
        "bad": "3",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "error": "error"
    },
    {
        "user_name": "oncefree",
        "time": "2 August, 2021",
        "context": "UK and Israel blame Iran.  Biden/Obama team blames Trump.  Biden and Obama are cheering.",
        "good": "6",
        "bad": "2",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "tgegan",
        "time": "2 August, 2021",
        "context": "Time to turn Iran into a parking lot.",
        "good": "1",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "speechless55",
        "time": "2 August, 2021",
        "context": "Biden has got to send a letter to the Iranians with a list of the ships they cannot attack! ",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "Usafirst",
        "time": "2 August, 2021",
        "context": "They are not afraid of the USA under biden",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "canadianlovesusa",
        "time": "2 August, 2021",
        "context": "As the dems get soft, Iran becomes more brazen. ",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "mea1222",
        "time": "2 August, 2021",
        "context": "Remember the USS Liberty.",
        "good": "7",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "katali",
        "time": "2 August, 2021",
        "context": "Irans protector is in the white house so they don't need to worry.",
        "good": "7",
        "bad": "2",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "navvetfarmer",
        "time": "2 August, 2021",
        "context": "Israel's got this.",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "nagant810",
        "time": "2 August, 2021",
        "context": "Biden (or, rather, his handlers) believe that Iran will behave civilly as soon as he cancels the sanctions imposed by President Trump.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "jwwill1957",
        "time": "2 August, 2021",
        "context": "Israeli spy ship hit with drone attack, Israel likes doing drone attacks, how does it like them back? Boycott Israel and free America too.",
        "good": "2",
        "bad": "9",
        "replies": []
    },
    {
        "user_name": "HPIL",
        "time": "2 August, 2021",
        "context": "Israel WIILL Deliver a Resounding Blow",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "theharold",
        "time": "2 August, 2021",
        "context": "This has nothing to do with the US.  Let's see... a Japanese owned tanker that is a Liberian vessel being managed through a UK front company on behalf of an Israeli billionaire.   Why is the US in the business of subsidizing billionaires, and helping them to evade taxes and to evade labor laws and exporting jobs to third world countries?\n\nThis is a Liberian flagged tanker.  That Israeli billionaire deliberately made his ship a Liberian ship to avoid taxes in countries like Israel, Japan, the UK, and the US.   The Liberians are also very accommodating to help him get rid of expenses caused by First World regulations on things like insurance and labor laws.  So fine.  Now that the guy jumped ship on all those First World expenses, why is the US spending millions and millions to provide private security for free to the guy?  \n\nSeriously, if anybody writing in this forum dodged their taxes in the US, would the US send an aircraft carrier task force to take care of business for you for free?   Heck, no!  \n\nIf Israel wants to put out their public money to support an Israeli billionaire who deliberately structured his business outside Israel, fine, let them do that on their nickel.  Same with the UK and Japan.  They have plenty of billions.  Why is the US taking on their responsibilities?  \n\nTo add insult to injury, the US isn't even bothering to tell American taxpayers, the sheeple who are paying for all this, what the evidence is that irrefutably proves this is Iran.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "shadowbannedagain335",
        "time": "2 August, 2021",
        "context": "Iran has a right to defend itself.",
        "good": "4",
        "bad": "12",
        "replies": []
    },
    {
        "user_name": "Toro68",
        "time": "2 August, 2021",
        "context": "The tanker is a fight between mortal enemies Iran and Israel only. The USA should stay out and focus on our own Country. We don't need tankers. We have plenty of our own oil and shale gas. We are advancing fast in developing renewable solar and wind power,  for our home grown clean energy. The USA taxpayers are not the funders of a global police force.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "tupperhouse",
        "time": "6 August, 2021",
        "context": "I would suggest they call the United Nations together and have General Powell tell the world why the three countries that gave the chemical weapons trucks in Iraq think it is Iran's doing. They should take the word intelligence out of their agencies name.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Moab_Lodestar",
        "time": "4 August, 2021",
        "context": "As soon as Israeli lips begin to move lies pour forth............",
        "good": "3",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "historian326",
        "time": "2 August, 2021",
        "context": "Iran, the Rectal Polyp of the Middle East, needs to be cauterized.",
        "good": "4",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "discussion587",
        "time": "2 August, 2021",
        "context": "Not sure where AP is coming from Iran has claimed responsibility. There is no doubt.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mea1222",
        "time": "3 August, 2021",
        "context": "False flag again. Remember the USS Liberty and the 34 dead and 180 wounded US sailors.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sacramentomike",
        "time": "6 hours ago",
        "context": "Cowardly Israelis expect us to fight their wars?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "shavedkitty69",
        "time": "2 August, 2021",
        "context": "hey 'tollah, look up!",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "mtdreams",
        "time": "4 August, 2021",
        "context": "Meanwhile, back in the US, Sleepy Joe has no idea that this even happened.  His handlers only allow him to watch Sesame Street and Romper Room while eating his mashed carrots.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "austifreedom66",
        "time": "6 August, 2021",
        "context": "so why dose Joe Biden still want to give Iran our money? and make a fake deal with the devil. ",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "natg",
        "time": "2 August, 2021",
        "context": "Sorry not a U.S. problem. Find a new policeman of the world. Them desert dwellers are sitting on a fortune of world money from their oil revenue. They want something done don't look to us. Use your own young people for cannon fodder not ours.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "mgronich",
        "time": "3 August, 2021",
        "context": "In the comment section of this story in the UK paper Guardian (on Utube) about 90% of the commenters say this was a false flag operation.  Either by the Israel or the UK.  The fact that no one has showed any evidence the Drones were from Iran helps deflate this piece of propaganda.   But the story is not getting a lot of traction.  So this is not going to start a war, time to talk about human rights abuses in Iran again.  Or maybe forcing people to wear masks is like the Nazi concentration camps.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "aslapforfools",
        "time": "4 August, 2021",
        "context": "Sounds like Israel trying to fool us to attack Iran again.",
        "good": "2",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "clemster",
        "time": "2 August, 2021",
        "context": "So allegedly the Iranian's attacked a Japanese ship, that's managed by a Jewish billionaire's company and a British and Romanian sailors were killed and the U.S. is suppose to do what?",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "john333",
        "time": "4 August, 2021",
        "context": "Israel, US, UK. Axis of Evil. No worries. They're on a serious decline.",
        "good": "1",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "#1liberalintheworld",
        "time": "4 August, 2021",
        "context": "ISRAEL, and Israel ALONE, must take care of ISRAEL'S problems!!!!!!!!!!!!!!!",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "chiefsbrat",
        "time": "3 August, 2021",
        "context": "The Iranians use a drone and it brings out all the bots and trolls to comment.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "what1806",
        "time": "4 August, 2021",
        "context": "Iran did it again. Played pirate and terrorist with another ship. It looks like Iran is trying to provoke a war to divert the people attention from its failing to provide even the basic services and deal with Covid. The Iranian people deserve better.",
        "good": "1",
        "bad": "1",
        "replies": []
    }
]