[
    {
        "user_name": "Kahless_the_unforgettable",
        "time": "2 hours ago",
        "context": "Something smells here. Was there no one else in the building? I know it was live-streamed but usually there are other people in the congregation even while it is being streamed. These robbers only went for the pastor and his wife? I think there's more to this story we're not hearing.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "harleymom1",
        "time": "2 hours ago",
        "context": "Isn't that the pastor who inflated the value of his jewelry, I'm glad they were caught but stop being so flashy, God don't like flashy.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "taterchip53",
        "time": "2 hours ago",
        "context": "Upon reading the headline my first thought was who robs a Pastor during services? But, after reading more, who has a million dollars worth of jewelry? Must have a very generous congregation.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Savage_Centurion1263",
        "time": "2 hours ago",
        "context": "The \"Pastor\" should be behind bars as well. Organized Religion = Organized Crime.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "razzledazzle869",
        "time": "1 hour ago",
        "context": "Sounds like a BET sitcom",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "melelina780",
        "time": "2 hours ago",
        "context": "Straight out of the movie “Honk for Jesus.”  Why would parishioners attend this church or support this man and his wife?  They’re as far from Christ’s teaching as possible.  Goes into the category of false leaders and prophets.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Mrkyte",
        "time": "2 hours ago",
        "context": "That is what religion is all about-money.  Glad to not be hooked on that scam.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dogbreath761",
        "time": "2 hours ago",
        "context": "Did the thieves get his 30 pieces of silver?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "DirkBenedict",
        "time": "2 hours ago",
        "context": "Miller-Whitehead, known for a flashy persona that includes expensive jewelry and travel in his Rolls Royce, is a friend of New York City Mayor Eric Adams. This is why the suspects are not eligible for no-bail release.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "proudamerican803",
        "time": "2 hours ago",
        "context": "Christians are known by their \"fruits\".  It looks like this pastor loves worldly goods more than most christians do.  Expensive jewelry, drives a Rolls Royce?  Sounds to me like he's spending contributions on himself instead of helping those in need.  Beware of these false teachers, who don't practice what they preach.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "polly541",
        "time": "1 hour ago",
        "context": "God works in mysterious ways.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Linusstick",
        "time": "1 hour ago",
        "context": "A million dollars of jewelry on him? Pastors of the 13% are usually more corrupt than politicians. The names of the guys who robbed him made me laugh out loud. Figures",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "navvetfarmer",
        "time": "24 minutes ago",
        "context": "I read this story some time back. Odd that a true man of God would be so vane and hold jewelry in such high esteem and posses so little charity. I hope he gets none of it back.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "TowerCDP",
        "time": "18 minutes ago",
        "context": "Thieves robbing thieves. Maybe they will work it out during their next BLM meeting.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bubbalouie546",
        "time": "1 hour ago",
        "context": "Released on $50,000 bail. Which means he will only have to pay $5,000.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "deplorableinfidel218",
        "time": "1 hour ago",
        "context": "I wonder why this never happens where I worship.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "jaffy",
                "time": "50 minutes ago",
                "context": "I suppose you aren’t tithing enough for your pastor to have a million in jewelry",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "deplorableinfidel218",
                        "time": "11 minutes ago",
                        "context": "I don't tithe.  I give according to my prosperity (1 Corinthians 16:2).  My preacher makes his money on rental property.  But there's another reason that people don't try to rob us.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "navvetfarmer",
                "time": "22 minutes ago",
                "context": "Hopefully it's because your Pastor is a true man of God not caught up in worldly possessions and has a sense of charity.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "deplorableinfidel218",
                        "time": "8 minutes ago",
                        "context": "We don't have a pastor we have a preacher.  He IS a man of God and has a very modest living.   There is another reason that people don't commit armed robbery at my Church, though, and it has nothing to do with our worldly possessions.  Well, except for one thing that most of us own and carry to Church with us.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "wileyjames535",
        "time": "1 hour ago",
        "context": "Say-Quan, Juwan gets some spare change from the Rev.?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "hichnrale",
        "time": "1 hour ago",
        "context": "Wonder what it costs for membership in that congregation ?",
        "good": "0",
        "bad": "0",
        "replies": []
    }
]