[
    {
        "user_name": "mikemichalak",
        "time": "5 September, 2022",
        "context": "BAGA - Biden Against Great Americans",
        "good": "24",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bufordt",
        "time": "5 September, 2022",
        "context": "God knows what they planted! ",
        "good": "23",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "paulallen585",
        "time": "5 September, 2022",
        "context": "Any Judge worth the objectiveness bearing any resemblance to a nations rule of law, has to view this as a partisan effort by Democrats to create evidence where none exists.",
        "good": "53",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "ccstraycat",
        "time": "5 September, 2022",
        "context": "An increasingly desperate doj and fbi will do anything to keep a special master from conducting an independent review.  They need to keep their machinations secret so they can change things as political events dictate.   No doubt they'll file appeal after appeal.",
        "good": "71",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "bighank709",
        "time": "5 September, 2022",
        "context": "This guy doesn't know about the filter team I guess.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Nancy_Pelosi's_Knockers_",
        "time": "5 September, 2022",
        "context": "When I grow up I wanna be just like Andy McCarthy but with More Hair and better teeth.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "NoUnityWithLibs",
        "time": "5 September, 2022",
        "context": "DOJ:  “Oh no!  We can’t have transparency here!”",
        "good": "23",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bufordt",
        "time": "5 September, 2022",
        "context": "Wait? The DOJ HAS NO BUSINESS REVIEWING ONE WORD IF ANY ATTORNEY CLIENT PRIVILEGE!  Oh I forgot it’s Trump the constitution doesn’t apply to him!  ",
        "good": "44",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "filiusjm734",
        "time": "5 September, 2022",
        "context": "that's not what she said......she did not say he has executive privileges.....you do realize if you give this to trump, you are giving to all ex presidents......",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "Power_Is_Work_Over_Time",
        "time": "5 September, 2022",
        "context": "Former Presidents should have Executive privlidge. They still have their clearance to view and posses classified documents. They are still responsible for things that went on during their presidency and may be asked to clarify or give expert advice on matters of National Security involving past events that occurred during their Presidency.",
        "good": "48",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "freepeople660",
        "time": "5 September, 2022",
        "context": "Cannon's ruling won't reverse the Dem DOJ/FBI Gestapo's constitutional abuses, but maybe it will slow them down.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dyldrix165",
        "time": "5 September, 2022",
        "context": "A special master is hardly a huge win for Trump. It buys him time…that’s it",
        "good": "2",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "Factoid6",
        "time": "5 September, 2022",
        "context": "Donny is going down, True Believers.  Your God is dead.",
        "good": "2",
        "bad": "8",
        "replies": []
    },
    {
        "user_name": "dd666",
        "time": "5 September, 2022",
        "context": "I would be the first to admit that I don't grasp the nuances here, but I am having trouble seeing why DOJ would particularly care about a special master being appointed.  At worst it just causes a slight delay.  In fact, if I were the DOJ I would be pleased to have the SM appointment, because it seems to me that would make an indictment or ultimate conviction all the more trustworthy.  Not allowing the SM just seems like politics.",
        "good": "31",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "barbiecalifornia",
        "time": "5 September, 2022",
        "context": "I think it is a great judge that gave the rule of law.  Innocent until proven guilty.  People looking at these files had no idea if they had  been cleared by The President. a box that has writing on it or a folder marked means nothing ",
        "good": "18",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "SteveMcQueen852",
        "time": "5 September, 2022",
        "context": "Andy McCarthy--about a million times--- \"I support the Mueller investigation.\"",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "hstlives416",
        "time": "5 September, 2022",
        "context": "Makes no difference.  It will slow down the investigation (hopefully not the national security investigation), but I highly doubt Garland would have announced anything before midterms at this point.  Trump will still announce after midterms and declare the investigation and/or indictment to be a political witch hunt.  MAGA cultists will find a host of reasons why the special master is unfair.  This will unfold predictably until everyone can see at least a characterization of the documents Trump withheld.  That may change a few minds, but it won't happen until after midterms.",
        "good": "3",
        "bad": "12",
        "replies": []
    },
    {
        "user_name": "angryfrightenedred",
        "time": "5 September, 2022",
        "context": "Lol it’s meaningless but the trump team wants you to see the effort as discrediting the DOJ and you’ll eat another loaf of his lies",
        "good": "1",
        "bad": "7",
        "replies": []
    },
    {
        "user_name": "grtamerhero22",
        "time": "5 September, 2022",
        "context": "And when the Special Master finds what the FBI/DOJ planted…its game over Libs! ",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "GradyWhite_Canyon_456",
        "time": "5 September, 2022",
        "context": "I’ll do it",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "grtamerhero22",
        "time": "5 September, 2022",
        "context": "DOJ: lied 7 different times about why they raided Mar a Lago. \nDOJ: lied 3 more times about how many boxes they took.\nDOJ: lied about taking Trump’s passports.\nDOJ: Rushed through the boxes the day after Trump said the court should appoint an independent official to oversee the search of the boxes.\nDOJ redacted 38/39 pages of court document it used to get the warrant approved.\nDOJ: Opposed a special master appointed by the court to oversee their actions and report them to the public.\nWhat are they hiding?",
        "good": "55",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "emailslop",
        "time": "5 September, 2022",
        "context": "None of this matters......the Dems and this \"Administration\" are going to indict Mr. Trump and most likely arrest the man. \nThey have no limit and there is NOTHING they will NOT do to maintain/ obtain power.",
        "good": "2",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "quidmevexari",
        "time": "5 September, 2022",
        "context": "It will be interesting to see how documents O'Biden burns on his way out the door now that he has eliminated his own \"Executive Privilege\" protection after office.  President goose meet citizen gander",
        "good": "6",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "billygsp",
        "time": "5 September, 2022",
        "context": "A judge appointed by Trump should have NEVER been assigned this case. She was simply thanking him for her job. Her ruling will not stand due to her \"conflict of interest.\"",
        "good": "2",
        "bad": "10",
        "replies": []
    },
    {
        "user_name": "TheRepublicMatters🎬",
        "time": "5 September, 2022",
        "context": "This is huge. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cchatel",
        "time": "5 September, 2022",
        "context": "I trust the FBI and the justice system. I don't believe a word out of Trump's mouth.",
        "good": "1",
        "bad": "9",
        "replies": []
    },
    {
        "user_name": "notademocrap",
        "time": "5 September, 2022",
        "context": "If the DOJ appeals it’s painfully and abundantly obvious they have something to hide. Specifically planted evidence and fabrications….all over again. Dems are corrupt filth.",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cchatel",
        "time": "5 September, 2022",
        "context": "Trump is at it again. After destroying the confidence Americans had in their democratic system, he is now undermining the confidence in the justice system. All without proof, all just to serve his selfish ambitions. The damages he's done to american society will take generations to heal.",
        "good": "6",
        "bad": "23",
        "replies": []
    },
    {
        "user_name": "papalouie",
        "time": "5 September, 2022",
        "context": "An opinion piece to get Trump’s Pom Pom Squad all tingly ",
        "good": "5",
        "bad": "8",
        "replies": []
    },
    {
        "user_name": "jpb89",
        "time": "5 September, 2022",
        "context": "Has anybody ever wondered what Obama has at his home?",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jcschulle",
        "time": "5 September, 2022",
        "context": "And who said federal judges weren't partisans. You can't expect less from a Trump nominated judge. ",
        "good": "0",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "cchatel",
        "time": "5 September, 2022",
        "context": "If Donald is being investigated, it's because he thinks he's above the law. Russia did interfere with the 2016 election, Donald did ask the head of state of Ukraine to find dirt on his political opponent, he did ask an election official to \"find\" him the votes he needed, he did send a mob to the Capitol and he did bring boxes of classified documents to his home, illegally. He deserves the attention the justice system is giving him.",
        "good": "4",
        "bad": "9",
        "replies": []
    },
    {
        "user_name": "cchatel",
        "time": "5 September, 2022",
        "context": "Trump said in August 2016. “In my administration, I’m going to enforce all laws concerning the protection of classified information. No one will be above the law.”\n“One of the first things we must do is to enforce all classification rules and to enforce all laws relating to the handling of classified information,” he said in September 2016.\nSpeaking in July of that year, Trump said Clinton’s mishandling “disqualifies” her from public service.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Rand668877",
        "time": "5 September, 2022",
        "context": "How long did Trump have these documents? Good grief. The only thing this ruling does is slow down the investigation\n The special master will go through these documents and basically do what the DOJ has already done. The only thing they will be looking for are documents that actually are Donald's. Anything that is a government document will be given to the DOJ in the end. I don't see how this is some win for Trump.\nTrump has been screaming for transparency and now he is worried about the DOJ looking at these documents! Whatever happens to Trumo, I thank God the got the documents back.",
        "good": "1",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "aguinn",
        "time": "5 September, 2022",
        "context": "EX President Trump. 1\nDept  of Justice.          0",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "maitretex",
        "time": "6 September, 2022",
        "context": "As soon as Obama gives up the papers from Fast & Furious, Reagan the Sandistas, the country Kennedy assassination files, and whichever had Area 51 ..... they can have Trump's fake Cover of Time, and his executive privileged papers.....",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Presidentpoopypants442",
        "time": "6 September, 2022",
        "context": "Why would the DOJ appeal. \nAre they hiding something. ",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "2022midterms",
        "time": "5 September, 2022",
        "context": "Let me guess, the special master will be Peter Strzok.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "winnersnotwhiners",
        "time": "6 September, 2022",
        "context": "Wasn't this the same clown that was touting the DOJ's ironclad case a week ago?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "liberalredneck",
        "time": "6 September, 2022",
        "context": "Hard to see how any president could claim executive privilege over a top secret document that he stole from the government, but let the wheels grind through it.  It could be trump\nWiggles free on some technicality but the American people should know what he did with these secret documents that belong to us; clearly he’s not a grownup enough to take care of them\nAnd a huge number are missing. Who has them ? On another note it’s funny how fox always is required to include: blast, slam, mocked, and anger words in its headlines. Every single day. Because if you lot aren’t angry, why then you might not tune in to feel victimized and put down ",
        "good": "1",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "liberalredneck",
        "time": "6 September, 2022",
        "context": "Certain acts like mishandling top secret documents are felonies even\nIf trump does them. Felonies ",
        "good": "0",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "DeclassifiedThinking",
        "time": "6 September, 2022",
        "context": "Third party review of Trump’s theft and lies will reinforce Trump as a national security risk.",
        "good": "1",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "somethinkingmightbeuseful",
        "time": "5 September, 2022",
        "context": "I know exactly what you Trumpsters will say when the non-partisan special master rules against Trump...",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ozarkbeauty18",
        "time": "6 September, 2022",
        "context": "Gee, why so sad, Andy? 🤔",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mikechicago",
        "time": "5 September, 2022",
        "context": "Presidential Records Act says it is a current president, not a former one, who can assert executive privilege.\nWhen a President leaves office, ALL of his government documents belong to the U.S., not to the individual former president. If any require confidentiality it is for the current President to so assert.",
        "good": "3",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "ColoradoWall.",
        "time": "5 September, 2022",
        "context": "Voters prefer politicians that don’t foment insurrection, take the 5th more than 450 times and are target of criminal investigations.  Just saying.",
        "good": "5",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "ragtimer",
        "time": "6 September, 2022",
        "context": "I remember when we had the privilege of our vote being counted and dead people's votes not counted.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dannynyc",
        "time": "6 September, 2022",
        "context": "🤣🤣🤣. Not going to change the fact that that orange mess stole top secret material.   God knows who he gave or sold them to!   My bet is the Saudis (so Jared could get that 2B loan, and putin, to keep his mouth shut)",
        "good": "0",
        "bad": "11",
        "replies": []
    },
    {
        "user_name": "MJAC167",
        "time": "6 September, 2022",
        "context": "Why is the DOJ fighting the appointment of a Special Master so hard?….Hmmm.",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "GreenTag",
        "time": "6 September, 2022",
        "context": "We are watching an extremely corrupt DOJ and democrat president and congress and corrupt democrat senate destroy the very fabric of American laws, politics, and trust.",
        "good": "3",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "MJAC167",
        "time": "5 September, 2022",
        "context": "…and Biden approve this whole mess, just like he approved the raid on Michael Okeefe’s house. Joe likes raiding people’s houses, I wonder if yours is next and he has 87,000 new, armed IRS Agents coming…Oh joy.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "stevehershberger",
        "time": "6 September, 2022",
        "context": "As an attorney, I like McCarthy’s analysis on legal issues…I think he is wrong on whether Trump had and has executive privilege on documents generated during his presidency…I think a president does have that privilege… I could write you a brief on it",
        "good": "0",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "tjpar54",
        "time": "5 September, 2022",
        "context": "Does Obama still have Executive privilege?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "zgsopinion",
        "time": "5 September, 2022",
        "context": "Too funny, just yesterday Barr and others claimed the special master is just a stall tactic, and is unnecessary. \nRegardless of whether this ruling holds or not this is just one more example of a lifer Bureaucrat asserting claims that are at best unsettled.\nThe warrant is supposedly “specific” or unconstitutional.\nWithout knowing the procedural process for this it would seem the judge may want to ask how the F Trump’s old magazine clippings, gift registry, his passport or Melania’s underpants fall under the supposedly non general warrant.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "thetruth09431",
        "time": "6 September, 2022",
        "context": " This is merely a moral victory.   I predict the special master will still come very close to the same conclusion as the FBI filter team.  He still stole documents with security clearance markings on them.  He obstructed justice.  He violated the presidential records act.  Those have nothing to do with executive privilege.  And that doesn't include the January 6 investigation.  He's in serious legal trouble.  He better take it seriously.",
        "good": "0",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "liberalitarian",
        "time": "5 September, 2022",
        "context": "EVERYTHING IS \"POTENTIALLY EXPLOSIVE\" AT FOX.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "maitretex",
        "time": "6 September, 2022",
        "context": "If, because this is in FL circuit and not DC this goes to the 11th as opposed to Court of Appeals, I think this may get a little messy for #BrandonandGarland.. hardly going to get the vacancy filled in time for the appeal..... Ha Ha Ha!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ThisMessageViolatesCommunityStandards",
        "time": "6 September, 2022",
        "context": "I, for one, certainly look forward to a series of committees, where republicans pick one or two democrats from vulnerable districts to call it 'Pelosi bipartisan', who will force Biden secretaries explain to the American people why they fought in court to\n1) keep personal records of a past president that were clearly not on the warrant\n2) restrict the supply of energy\n3) open the border\n4) release violent criminals into the public\n5)  can't even keep planes flying, let alone on time\n6) crashed the economy\n7) ruined more than a year of education for our kids",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "alannathann",
        "time": "6 September, 2022",
        "context": "As President, you have Executive Privilege confidentiality for the time of your term - which cannot be extended beyond that term in future dealings, NOR can it be retroactively removed when it comes to analysis of that term's business after the fact.\nOtherwise, there exists no meaningful functional confidentiality protections because whatever was first guaranteed as confidential would lose its shield upon the start of a subsequent administration.  \nWho can ever feel comfortable with the belief that one's counsel to a President would remain private if a succeeding Administration is free to remove a previous one's Privilege?\nThis is pretty basic stuff.",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "tommietacoma",
        "time": "6 September, 2022",
        "context": "If Trump loses this, its bad news for Obama and Clinton. Look at what we can find out about them and what files they can go to Jail for. Be careful what you ask for as you may get it.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "grtamerhero22",
        "time": "6 September, 2022",
        "context": "Merrick Garland and the Biden thugs are putting the “OJ” in DOJ. ",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "billtell391",
        "time": "6 September, 2022",
        "context": "Of course President Trump has executive privilege.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "OldTexan(UltraMAGA)🍊",
        "time": "6 September, 2022",
        "context": "If Trump has some cash in the safe would the FBI have taken it all or just 10% for the Big Guy?",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sanity199",
        "time": "6 September, 2022",
        "context": "What's the harm of an unbiased third party?  Oh yeah...they don't like the \"unbiased\" part.....",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "brandonrules",
        "time": "6 September, 2022",
        "context": "I never  knew the Government had so many teams .....The \"Taint \" team,  The \"privilege \" team ,  The \"special \" documents team ,  The \"planted \" evidence team ,  The \"Melania 's \" underwear team , The \"fishing expedition \" team, not to mention , Joey's personal \" depends \" team.  All of this for a President who has been out of office for a year and 1/2 .  \nAny American will be able to see all these documents in the Trump Library soon enough . \nImpatient Americans can get the information from Wiki leaks or Edward Snowden for 25 cents and self addressed envelope ! The Dims are out of control ! ",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "grtamerhero22",
        "time": "6 September, 2022",
        "context": "I totally agree.\nThe DOJ doesn’t want an outside observer because they stole more than Melania’s lingerie and President Trump’s passports. The attorney client privilege documents they stole probably deal with the AG in NY and GA fake prosecutions, and I bet $10 they found documents at Mar a Lago about Trump’s 2024 plans.\nThis is Biden’s Watergate. ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "roxy105",
        "time": "6 September, 2022",
        "context": "BIG loss for Trump - his go to move is stall deflect deny &will work against him as he drags this out past November. Look what he did at OZ rally - it was all about Trump’s grievances - a gift for the Dems. More republicans are admitting Trump is bad for November just not on Fox because they want your vote.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "allenparker1955",
        "time": "6 September, 2022",
        "context": "The DOJ does not care about a \"tainted\" investigation.  This was an information grab that will be passed along to the DNC for opposition research, if Trump is again nominated as the GOP presidential candidate for 2024, and to be leaked over the course of the next weeks and months to the media- all aimed at preventing Trump from being elected again. You know this is true because the leaks have already started.  ",
        "good": "25",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "buhbyedon714",
        "time": "6 September, 2022",
        "context": "Here are some of the classified documents that Trump brought with him that he CANNOT take from secure federal facilities. Documents marked: \"HCS, FISA, ORCON, NOFORN, and SI,\" \"HCS\" indicates that the material is about human sources, or spies, that often work with the CIA. \"FISA\" relates to court-ordered surveillance collecting foreign intelligence, including wiretaps. \"ORCON\" means the document is so sensitive that its originator must approve any request to share it. \"NOFORN\" means the material can't be shared with any foreign entities, even allies, without permission. \"SI,\" short for Special Intelligence, relates to signals intercepts, which are typically handled by the National Security Agency.\nHe had some of these in his desk drawer.  Trump is going to prison for a long time.",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "idiotlitmustest",
        "time": "6 September, 2022",
        "context": "Trump is not president    Therefore, no executive privilege.",
        "good": "1",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "chilldoctor",
        "time": "6 September, 2022",
        "context": "Who trusts the FBI with top secret \"Need to Know\" documents? They are going to leak Trumps medical records also.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "deplorableindependent",
        "time": "6 September, 2022",
        "context": "Trump is so much smarter that all the Dems, doj, and FBI combined",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "grtamerhero22",
        "time": "6 September, 2022",
        "context": "Hey Dems, if you’re going to carry out Nicaraguan-style paramilitary raids, to get rid of your political opponents—don’t let Joe Biden stumble out on stage and declare war on half the American population and refer to his opponents as enemies of the state.\nKinda gives the plot away. \nAll Biden had to do in front of that blood red background was set the American flag on fire and it would have been AOC approved!l!",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "myveryownselfie",
        "time": "6 September, 2022",
        "context": "Does Trump get to hand pick the Special Master?\nNo No No!\nTrump might had just shot himself in the foot.\nAGAIN ....🥵🥵🥵",
        "good": "0",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "foxisgreatamericannews",
        "time": "6 September, 2022",
        "context": "11th circuit predominantly conservatives expect special master to hold expect heads to roll at the DOJ after November when the democrats cry fest comes they could of course appeal to SCOTUS but my expectations are lots of democrats at the DOJ will be dusting off resumes including the rat AG they won’t have much time to remain in their jobs a red waves coming ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "endymio",
        "time": "6 September, 2022",
        "context": "It's all moot anyway, as the DOJ will just keep up the sham investigation until November elections have passed, then quietly retire it -- just as the last 70 anti-Trump investigations died on the vine.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "grtamerhero22",
        "time": "6 September, 2022",
        "context": "You wanna know who mishandled top secret documents? The Antifa/Biden thugs in FBI vests who threw Trump’s records all over the room at Mar a Lago for a phony PR stunt. ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "grtamerhero22",
        "time": "6 September, 2022",
        "context": "Libs never think, so let’s do it for them.\nWhat the media isn’t saying because they know nothing about the law and also because confusion = ratings is this:\nPresident Trump had FULL, Constitutionally protected executive power and privilege as the highest ranking government official with the highest security clearance to declassify any govt record created during his presidency. THAT is why the DOJ has changed its story AGAIN this week saying “classified or declassified” doesn’t matter—after weeks of claiming it did.\nQuestion: What President or White House lawyer is going to allow a President to do or say anything in office if the next President can just swoop in, strip the previous President of all his powers and take back any records they can send the FBI to take? Answer: Nobody.\nEach President has a right and a privilege over their records that the next President is supposed to respect and honor. Joe Biden has no honor. So Biden TRIED to strip President Trump of authority and power Trump had before Biden took office. It’s not going to work.\nThis is why the DOJ is working overtime to hide what’s on 38/39 pages they blacked out and are trying to stop the Special Master from seeing what they’ve cooked up this time to get Trump. ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "8mmmagnum",
        "time": "6 September, 2022",
        "context": "Choke on that lib fed terrorists.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bking1340",
        "time": "6 September, 2022",
        "context": "Story is worthless. Executive Privilege exists solely with the sitting POTUS, not ex-POTUS' and Mighty Joe already told trump to get bent.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "theoldfart",
        "time": "6 September, 2022",
        "context": "Everything the government collected could be thrown out, because it was seized illegally. That is the bottom line here.  It pays to do your homework first.  The government should have known this was a potential problem. Kinda like not reading someone their Miranda rights.  ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Rectifier150w",
        "time": "6 September, 2022",
        "context": "Department of Injustice",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "OldTexan(UltraMAGA)🍊",
        "time": "6 September, 2022",
        "context": "I'm sure the DOJ would approve of Eric Hikder as Special Master in a heart beat ",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "buhbyedon714",
        "time": "6 September, 2022",
        "context": " At least now we know why Jared got $2 Billion from the Saudis.  That's a lot of top secret information to sell.                                  ",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "FreeSpeechMan",
        "time": "6 September, 2022",
        "context": "It's a shame cnn doesn't allow free speech on Their dem platform and Y'all dems have to troll here lol..",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "iguana125",
        "time": "6 September, 2022",
        "context": "Based on previous decisions made by the Biden administration and executive branch no one is going to pay any more attention to an independent review of a special master than they do to any other previously proper legal process.   Appeals are just appeasement to the country as they seem to have no intent to follow any decisions that get in their way.  Welcome to \"everyone is above the law\" days.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "cb1882",
        "time": "6 September, 2022",
        "context": "If you, as President, are aware that any of your private conversations or confidentialities could be made public when you leave office, then nothing is secret. Official privilege has no value.  \nNobody will confide in you. \nSo yes, some executive privilege must extend beyond the time in office. They should not have shared any of Trump's stuff with prosecutors.",
        "good": "13",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bobbob21",
        "time": "6 September, 2022",
        "context": "No one trusts the DOJ or FBI.  They have been out to get Trump since he announced he was running for President.  Everyone keeps saying it's only the leadership that is corrupt.  I don't know that.  The whole organization looks corrupt to me.  It's up to them to prove different as far as I'm concerned.    ",
        "good": "16",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "badoggoodog",
        "time": "6 September, 2022",
        "context": "Unless executive privilege is extended to presidential documents after leaving office all presidents are subject to this sort of harassment and persecution by any opposition president taking office. Imagine what Trump could have done to Obama and what he will be able to do to Traitor Joe.",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "rhut_rho511",
        "time": "6 September, 2022",
        "context": "in the wake of the decision; how long before there are pernicious leaks to the Wash Post and CNN ?",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "nomermac",
        "time": "6 September, 2022",
        "context": "Can you smell another Mueller Report?\nAgain, the fine hand of Dem misdirection at work.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "pac8",
        "time": "6 September, 2022",
        "context": "Now every time a siting President gets advice from an Aid …. The President will need to go thru a string of his lawyers to privately converse with him because it could be used by Political opposition to Prosecute Every Former President !!!\nIncluding Biden & Obama \nWho both have made $$$$$$ Millions off their Politics !!!!!!\n.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ugly.republican",
        "time": "6 September, 2022",
        "context": "Donald Trump: I'm different, I play by my own set of rules. \nDonald Trump: why are they treating me differently, it's always different rules for me, wah. I'm a spoiled rich brat who has always gotten my way and like a toddler who loses at monopoly I call everyone else cheaters when I lose.",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "buhbyedon714",
        "time": "6 September, 2022",
        "context": "One of the documents seized in the Aug 8th raid that was identified in the FBI evidence photo was a document with a red label called a SCI document.  It is the most sensitive level of intel and must always be stored in a secure federal facility.  This particular one also had the markings “HUMANINT- MASTER”  which means it was a summary file of considerable national security importance. \nIt was in Trump’s desk drawer.  ",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "pqjnow",
        "time": "6 September, 2022",
        "context": "I wonder if they let Biden look at classified stuff.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "fallfasterfool",
        "time": "6 September, 2022",
        "context": "liberals think a bureaucratic  doj pension holders are smarter than Trump and his lawyers.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "buhbyedon714",
        "time": "6 September, 2022",
        "context": "Former President Donald Trump praised Russian President Vladimir Putin and Chinese President Xi Jinping during a Saturday rally in Wilkes-Barre, Pennsylvania.\nSpeaking at a rally in Pennsylvania, Donald Trump praised Vladimir Putin and Xi Jinping.\nHe called both leaders \"fierce,\" adding that Xi is \"smart\" to rule China with an \"iron fist.\nTrump's Fascist Agenda in full view.",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "protectliberty",
        "time": "6 September, 2022",
        "context": "Remember when Hillary was prosecuted for storing classified emails on her basement server?\nOh wait, that never happened. The FBI just said \"move along, nothing to see here...\"",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "protectliberty",
        "time": "6 September, 2022",
        "context": "Remember the raid on Clinton's residence when the FBI seized her basement server containing classified emails? Oh wait, that never happened. How dare anyone suggest the FBI is a partisan organization!?",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "devonroe127",
        "time": "6 September, 2022",
        "context": "Corrupt doj.. Biden FSB ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "badoggoodog",
        "time": "6 September, 2022",
        "context": "Sorry but the president of the United States ordering a raid on a former president’s home to seize privileged documents then having partisan FBI “agents” go through them and report what they found to ranking Democrats is bad enough. Then going out and declaring that half of all Americans are a threat to democracy is not a good thing for the nation. ",
        "good": "8",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "handyman12",
        "time": "6 September, 2022",
        "context": "The highest priority for the Democrats is the mid-term elections, and it is now clear their strategy is to try to make the elections about Trump.  The raid on Trump's house was no coincidence, but appears to be part of the strategy along with the Jan 6th committee.  The special master review will alter the Democrats planned time table concerning leaks and a possible indictment of Trump before the elections whether the DOJ has a prosecutable case or not.  Any DOJ appeals will also effect the Democrats time table and further reduce the window for a Trump indictment before the elections.  So, don't be surprised if the DOJ doesn't appeal.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "pac8",
        "time": "6 September, 2022",
        "context": "All any Judge would have to do \nIs look how Dems & RINOS kept trying to pin Fabricated Russia Hoax on Trump \nAnd see this is only another Political Attack \nAnd Should immediately demean Biden’s DOJ & mis using FBI \n.",
        "good": "7",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "oafkeepr",
        "time": "6 September, 2022",
        "context": "Unqualified Trumpy trash judge, ruling won’t last a week.",
        "good": "1",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "TheHat",
        "time": "6 September, 2022",
        "context": "The DOJ is now considered a criminal organization. Merrick Garland being the Ringleader.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "andyk5",
        "time": "6 September, 2022",
        "context": "HEADLINE: maganite judge beholden to the orange maniac and afraid of DeSatan sells her soul",
        "good": "0",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "mrbee63",
        "time": "6 September, 2022",
        "context": "Easier to ask for forgiveness than permission.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "IBeTenBeers",
        "time": "6 September, 2022",
        "context": "The special master says Trump has executive privilege, Garland and Wray are foiled again. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "fallfasterfool",
        "time": "6 September, 2022",
        "context": "the doj will file an appeal and eventually go to the supreme court. This will help placate the soft mushiness in the liberals head and offer solice for the future sadness.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "pac8",
        "time": "6 September, 2022",
        "context": "So Any time a Political Aid Wants To Stab a Former President in the Back for $$$$$$$$$\nLike William Bar who wrote a whole book Bashing Trump in less than a year after leaving office \nWilliam Bar Politics = $$$$$ corrupt \n.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "tied",
        "time": "6 September, 2022",
        "context": "in a nut shell......this raid is akin (based on facts) to you not returning a library book.  these docs were at a location (which is also his office of a former President - same as all presidents get) that is secure enough to house a former VP by secret service at all; times, under video and yet we are to believe they was a urgent need to retrieve docs that had not and were not going anywhere...yes they should have (like Obama) come to an agreement  as to where they were to be stored but if it was not trump....were these Potentially embarrassing docs to the FBI and DOJ as that explains the panic",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "johnnycj2a370",
        "time": "6 September, 2022",
        "context": "Overplaying their hand is an understatement. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ccstraycat",
        "time": "6 September, 2022",
        "context": "I'm still waiting for an explanation from the fbi and doj for why they confiscated Trump's tax records, medical records and passports, as well as receipts for utility bills, etc.  There is no way on earth the affidavit included these items in the list of documents to be searched for.  Yes, they returned the passports, but without explanation.",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "mjd57",
        "time": "6 September, 2022",
        "context": "So why would the doj appeal! What are they so concern about! That they screwed up! Vast majority of the American people think they did!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "pencilnecksft#2",
        "time": "6 September, 2022",
        "context": "Of course he has executive privilege. No matter how many times the democrat's and their corrupted FBI DOJ and even their msm dncmedia say that President Trump was withholding top secret document's, President Trump already declared all of them DECLASSIFIED. He has the ultimate authority to do this and had done it. The big lie is all about tarnishing President Trump's endorsed candidates and hurting Republicans in the midterms. President Trump is by far the most investigated citizen in history. 7 straight years of trying to stop him and supporter's like you & I, and they haven't proven even a unpaid parking ticket. This is why we must elect only America first candidates who will devote their every waking second on investigating all the democrat's, loyalist's and social/ msm media until every single one of them has been raided and charged with treason against America. Democrats aren't playing around, so Republicans shouldn't either and must follow the Dems roadmap for treason and attempting coups and bring all of those involved to justice. The other option really won't be that pretty!!!",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Madabouttheusa",
        "time": "6 September, 2022",
        "context": "It must hold.  The legal citizens need recourse against a corrupt government.  There should be no question about it in this case. They've been proving their corruption since 2008 and aren't the Clintons, Comey, McCabe, Rosenstein, Obama, Lynch ....the entire coup cluster and those they hired and friends they used still walking free unaccountable and unmolested?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tommy334455",
        "time": "6 September, 2022",
        "context": "I will care about this when Hillary goes to jail for classified info on her home computer. This is another Trump witch hunt. I guess they saw 18,000 in Wilkes-Barre cheering on Trump when Biden had 400. ",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Mark-Two",
        "time": "6 September, 2022",
        "context": "Coming soon to a theater near you: \"Meteor\" strikes and shatters all their TDS skulls, in IMAX.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "grtamerhero22",
        "time": "6 September, 2022",
        "context": "When President Trump returns to the White House, he should pardon all the Jan 6th political prisoners and put Joe Biden, Adam Schiff and even members of the news media (CNN/MSNBC) on trial for treason. ",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Liberal_Rot",
        "time": "6 September, 2022",
        "context": "Just one more shining example of the left using the power of the government to harm their political opposition....simply look at the voter turnout for Biden in DC and Silicon Valley...20:1 the hubs of power rallied behind the reliably corrupt Democrat monopoly. To think the openly hateful anti-Trumpers wouldn't use their positions of power to attack him and those who support him is completely foolish. Then again most leftist elites I know could care less about free speech, accountability, pursuit of truth.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "123MARTY123",
        "time": "6 September, 2022",
        "context": "More fun and games.\nMAGA, KAG!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mickeyflynn",
        "time": "6 September, 2022",
        "context": "Skip the appeal. Get the Special Master. Don’t give Trump more delay. The ruling was shameful in that it gave differential treatment to being entitled to a former holder of high office. True swamp like behavior. We are all equal under the law. ",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "medic46201",
        "time": "6 September, 2022",
        "context": "I am willing to bet that Wray and Garland passed their pants with this ruling- maybe depends BRANDON  needed a few changes himself......lol\nLooks like their days are numbered. ",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "joser14",
        "time": "6 September, 2022",
        "context": "Legal experts say that this will delay the process at best and Trump's judge doesn't have a clue about the law. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Ithinktherefore",
        "time": "6 September, 2022",
        "context": "Yeah, a Trump appointed judge with almost no experience in these matters seems a bit questionable.\nWhen so many legal pundits and lawyers basically laughed at Trump's lawyer's submissions I wouldn't be surprised if they appeal.. I know I'd be tempted. \nNo matter how you slice this Trump is guilty as sin here, the only question remaining is is he guilty of felonies or misdemeanor. I think the former is the most likely given how he obstructed from the get go and then LIED to the FBI and DOJ forcing them to get a warrant. \nYou don't do that without criminal intent in my books... ",
        "good": "2",
        "bad": "8",
        "replies": []
    },
    {
        "user_name": "ervie",
        "time": "6 September, 2022",
        "context": "Go Donald!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "why...not...",
        "time": "6 September, 2022",
        "context": "I see a lot of comments saying the real concern is what the DOJ and/or FBI did.\nThe REAL concern is that the documents were stored where and how they were. Period. Clearly at least one person very very close to Trump had enough of a concern that they informed as to where the documents were, which says an awful lot.\nAnd I don't care one little bit if Trump is charged or not.",
        "good": "1",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "HoodoooVoodooBlood",
        "time": "6 September, 2022",
        "context": "A Trump appointee, Judge Aileen Cannon owed it to herself and all Americans to recuse herself from making a decision about a  'Special Master'. \nTrump said at the time, 'Aileen, Aileen, I am happy to do you this favor, to appoint you to the Federal Judgeship closest to my home at Mar-A-Lago.\" \n\"Someday — and that day may never come — I'll call upon you to do a service for me. But until that day, accept this federal judgeship as a gift on my daughter's Ivanka’s birthday.\"",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "grtamerhero22",
        "time": "6 September, 2022",
        "context": "Who in their right mind would believe anything the DOJ is accusing Trump of doing?  And who would trust them to self-investigate? \nNobody. ",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "msmith176",
        "time": "6 September, 2022",
        "context": "I heard McCarthy’s take on executive privilege but think there is one thing wrong. The privilege has to extend forever even once the president leaves office. To hold otherwise would put a serious stifling of the conversation between the president and his aides. The founders understood this and in my opinion intended for the privilege to extend forever. ",
        "good": "2",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "bobtrump414",
        "time": "6 September, 2022",
        "context": "Can I get an Otay from Buckwheats sister",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Liberal_Rot",
        "time": "6 September, 2022",
        "context": "Hiding in the shadows is what liars, cheats, crooks and con-artists do best...the Democrat monopolized on power and media has kept them well protected from accountability and fairness!!!",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "princessroxana",
        "time": "6 September, 2022",
        "context": "The real concern is  a third party seeing the haul. Demmies have been lying steadily about what they've got.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jeaux",
        "time": "6 September, 2022",
        "context": "We're not interested in what the FBLie seized st Mar a Lago.\nWe want to see Epstein's client list and Obama's college records.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "protectliberty",
        "time": "6 September, 2022",
        "context": "Liberals will not be happy until we all live in an authoritarian state with one-party rule.\nTheir party, of course.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "swbatti",
        "time": "7 September, 2022",
        "context": "Even executive privilege won’t override the obstruction charges.",
        "good": "1",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "ahcmon",
        "time": "7 September, 2022",
        "context": "Listened to Barr tell Martha how strong the govt case was against Trump.  How would he know that?  I mean, the affidavit wasn't readable.....might it be that he is working with them?",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "FreeandEasy",
        "time": "7 September, 2022",
        "context": "I have my doubts about the guy who wrote this article and his seemingly common disdain for Trump via his past commentary on Fox News and the fact he’s a former US prosecuting attorney.  You know what they say about “birds of a feather!”  ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Shwifty67",
        "time": "7 September, 2022",
        "context": "Why would they object unless something they did was illegal.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tony—c",
        "time": "6 September, 2022",
        "context": "The FBI is such a disgrace.  They could have simply driven up to the door, without lights and sirens blaring, presented the warrant, and conducted the search.  Quietly, and peacefully.  But no.  They wanted the full Monte with sirens, guns, lights, 40 agents.  And they wonder why the American people don’t approve.",
        "good": "7",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "oooca",
        "time": "7 September, 2022",
        "context": "First time ever. Create a big intrigue right at election time. The FBI gets \"F\" for originality!",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "peopleschamp",
        "time": "7 September, 2022",
        "context": "\"Andy McCarthy: Trump special master victory a potential 'explosive ruling' if it holds\"\nNo, it's not. Just delaying the inevitable.\nTICK TOCK....",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "rickm593",
        "time": "7 September, 2022",
        "context": "7",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "lemmingshotline",
        "time": "7 September, 2022",
        "context": "Nice illumination ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "theusjudge",
        "time": "7 September, 2022",
        "context": "Trumps AG Barr himself has admitted its flawed decision by Judge ❌️✖️🚫",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "HopefulPatriot892",
        "time": "7 September, 2022",
        "context": "Trump supporters fail to realize that this once again provides trumpy with privileges none of them would qualify for because he is above the law. Shameful!\nI wonder if I will be able to muster any compassion for these poor souls if ever they realize how trump has conned and duped them so biggggggglllllly!",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "bufordt600",
        "time": "8 September, 2022",
        "context": "The first thing Republicans must do when they take back the House is to bring impeachment charges against Biden. If they don't take the Senate it will fail but then the House should just impeach him again. And again. ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bohannon394",
        "time": "7 September, 2022",
        "context": "McCarthy hates Trump.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Between2",
        "time": "7 September, 2022",
        "context": "Garland is a crooked old democrat who is doing what Biden and his cronies are telling him to do as he’s not smart enough to think for himself! They are all puppets of the Marxist socialists governing this country now",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "theseer",
        "time": "7 September, 2022",
        "context": "Oh the humanity. Why did Trump's team even go through the courts when all they had to do was ask the great legal scholars like \"toilet brush head Mystal\" , or Mika, or Joe, or Joy Reid. They could have asked Joey himself. After all, didn't he graduate at the top of his law class?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "farmhand205",
        "time": "6 September, 2022",
        "context": "Would the Special Master have the authority to conduct an early morning raid on the FBI to prevent them from destroying some of the documents?",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Ithinktherefore",
        "time": "7 September, 2022",
        "context": "The only thing “explosive” is the diarrhea of her ruling…",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "realist12345678",
        "time": "8 September, 2022",
        "context": "So he might get off on a technicality?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Dr_Sarcasm",
        "time": "6 September, 2022",
        "context": "They have already made multiple copies of anything they thought they could use against Trump.\nIt was a fishing expedition for anything that was juicy, or they could twist into something to use against Trump...............",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "grtamerhero22",
        "time": "6 September, 2022",
        "context": "It doesn’t take 3 weeks to tell the American people the truth about raiding Mar a Lago.\nYet EVERYBODY involved in the Biden WH, DOJ and FBI are hiding from the public, choosing to leak lies, staged photos and imaginary crimes to the corrupt liberal media instead. \nAll Joe Biden or Merrick Garland have to do is stand before the public and clear up the following:\nWhy has the DOJ changed the “crimes” Trump supposedly committed SEVEN times since Aug 8th?  \nWho at the DOJ authorized the fake staged photos of documents thrown on the floor and scattered everywhere?\nWhy did they black out 38/39 pages of the legal argument the DOJ made to the court?\nWhy didn’t they take the boxes when President Trump offered them all to the FBI in February?\nWhy spend weeks accusing President Trump in the press of “stealing” classified documents when you knew they were declassified all along? ",
        "good": "3",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "clivee",
        "time": "7 September, 2022",
        "context": "I think Donnie is done for - they found Documents in Donnie Closet outlining Foreign Countries Nuclear Capabilities.\nYou have to assume that he is a spy!",
        "good": "1",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "nordicice",
        "time": "6 September, 2022",
        "context": "500 pages of possibly privileged information!  All his tax records!  All his medical records!  All his phone logs for four years!  Even some items of clothing!  No, this wasn't a fishing expedition!  Of course not!\nThe Swamp will do anything and everything to keep Trump from running in 2024!  They are desperately afraid of him!",
        "good": "7",
        "bad": "1",
        "replies": []
    }
]