[
    {
        "user_name": "LQ07",
        "time": "29 May, 2021",
        "context": "A correlation, not necessarily a causation.",
        "good": "67",
        "bad": "6",
        "replies": [
            {
                "user_name": "drjon2",
                "time": "29 May, 2021",
                "context": "And an uncertain correlation, at best.",
                "good": "6",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "reaganghost277",
        "time": "29 May, 2021",
        "context": "Fake news!  If fauci doesn't give this his stamp of approval, it's all fake.  Fauci and the cdc...and the WHO.  Three experts!",
        "good": "16",
        "bad": "7",
        "replies": [
            {
                "user_name": "scooby33",
                "time": "29 May, 2021",
                "context": "Larry, Curly and Moe. ",
                "good": "18",
                "bad": "1",
                "replies": []
            },
            {
                "user_name": "PleaseThink.",
                "time": "29 May, 2021",
                "context": "I was wondering how long before some muppet would try to score political points off this…",
                "good": "3",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "WeForgetForYouRetail🧠",
        "time": "29 May, 2021",
        "context": "The new Thalidomide?  For every action there is an opposite and equal reaction.  Taking the bad with the good, I guess.",
        "good": "4",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "ecclesiastes102",
        "time": "29 May, 2021",
        "context": "But it's all right to get that COVID shot while pregnant. NOT!",
        "good": "51",
        "bad": "13",
        "replies": [
            {
                "user_name": "rubiks6",
                "time": "29 May, 2021",
                "context": "Non-sequitur.",
                "good": "15",
                "bad": "7",
                "replies": [
                    {
                        "user_name": "lycopine",
                        "time": "29 May, 2021",
                        "context": "as if you know anything except the bible?",
                        "good": "0",
                        "bad": "2",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "texaspeace",
        "time": "29 May, 2021",
        "context": "Oh my that is terrifying! Thank goodness I don’t use that pain reliever. It never worked for me.",
        "good": "1",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "kstron",
        "time": "29 May, 2021",
        "context": "The entire medical field pushes this drug for pain all the time. Image the billion dollar lawsuit resulting from this if its true. Asbestos funds will look like chump change. \n\nIt's called practicing medicine for a reason.",
        "good": "29",
        "bad": "4",
        "replies": [
            {
                "user_name": "baileyolive890",
                "time": "29 May, 2021",
                "context": "I remember the Tylenol tampering scare, in the 80’s if I recall correctly.   The company took a major hit and redesigned their packaging.  It took a few years for the company to bounce back.",
                "good": "2",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "dos622",
                        "time": "29 May, 2021",
                        "context": "Thats why you need tin snips to get one out.",
                        "good": "2",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "oldasdirt023",
        "time": "29 May, 2021",
        "context": "A 19% error rate in a study of 73,000 people is not uncommon. How did the statisticians account for environmental factors like diet, exposure to pollutants and genetics? They did not.",
        "good": "11",
        "bad": "9",
        "replies": [
            {
                "user_name": "majorsmudges",
                "time": "29 May, 2021",
                "context": "“The researchers noted the study’s findings should be \"interpreted with caution\" and not taken as definitive proof of a link.”",
                "good": "3",
                "bad": "1",
                "replies": []
            },
            {
                "user_name": "skepticalreader",
                "time": "29 May, 2021",
                "context": "A 19% error rate is not uncommon?   In a professional research environment it certainly is!",
                "good": "4",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "error": "error"
    },
    {
        "user_name": "rocd509",
        "time": "29 May, 2021",
        "context": "I guess I’d rather have Reye’s syndrome??",
        "good": "5",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "rubiks6",
        "time": "29 May, 2021",
        "context": "\"Should not be supressed\"? I'd say it should be stopped.",
        "good": "7",
        "bad": "5",
        "replies": [
            {
                "user_name": "frontman",
                "time": "29 May, 2021",
                "context": "How many such studies over the past 50 years have later been proven false? Every generation sees headlines about the results of health studies, many change their lifestyles to protect themselves, then we find out the study was wrong, and the changes were pointless, or even harmful. \n\nHave you ever read the study which said salt causes heart disease? It is one of the most absurd things ever written, yet to this day, doctors recommend a low-salt diet. \n\nThe study looked at heart disease fatalities by salt intake. Central Africans ate the least salt, and almost none of them died of heart disease. Southern Europeans at the most salt, and had the most heart disease fatalities. The problem is that the median life expectancy in Central Africa was only 34 years when the study was conducted, no one there lived long enough to get heart disease. The country with the highest salt intake, which is Japan, also has the longest median life expectancy.\n\nThe study induced heart disease in rats with high levels of salt. The amount needed was the same you would get from eating 100 McDonald’s hamburgers per day, every day, for months. Any less, and there was no risk increase. Indeed, we now find low salt diets increase heart disease fatality rates.",
                "good": "1",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "rubiks6",
                        "time": "29 May, 2021",
                        "context": "I'm not going to gamble with the life of my child listening to the likes of you.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "frontman",
                                "time": "30 May, 2021",
                                "context": "Yet you will happily gamble the life of your child listening to the likes of others? As Edgar Allen Poe said “Believe nothing you read, and only half of what you see.” This is as much true in science as it is in politics. Currently, 5 out of 6 scientific papers do not provide replicable results (cannot be proven). This means their results are generally engineered to support the theories or beliefs of their publishers, or those who fund these papers.",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "user_name": "drjon2",
                        "time": "29 May, 2021",
                        "context": "Actually, low salt diets in otherwise healthy (non-hypertensive) persons result in significantly higher all-cause mortality. That is about all.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "hilairebelloc",
        "time": "29 May, 2021",
        "context": "Nothing cures autism like some good old fashioned bullying.",
        "good": "2",
        "bad": "9",
        "replies": [
            {
                "user_name": "georgeinsandiego",
                "time": "29 May, 2021",
                "context": "Is that your tongue in your cheek or are you just glad to see us?",
                "good": "0",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "nape944",
        "time": "29 May, 2021",
        "context": "What percentage are on birth control?",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "MrVF",
        "time": "29 May, 2021",
        "context": "Do they test anything anymore, or just public trials?\nVaccine comes to mind",
        "good": "6",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "razecs",
        "time": "29 May, 2021",
        "context": "I thought we were to believe that medications were safe?\n\nJust kidding, just add this to the list of other side effects. Here is a watered down list. Most of them say you are dying but try not to sound as severe.\n\nrash,\nitching/swelling (especially of the face/tongue/throat),\nsevere dizziness,\nor trouble breathing.",
        "good": "7",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "nowhereman",
        "time": "29 May, 2021",
        "context": "Another step in the right direction. I suspect there are multiple causes for the explosion of autism cases in recent decades.",
        "good": "11",
        "bad": "5",
        "replies": [
            {
                "user_name": "drjon2",
                "time": "29 May, 2021",
                "context": "The main one is the dramatic narrowing of what is considered normal, the second is the huge amounts of money to be made diagnosing and medicating healthy children.",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "rocksoff",
        "time": "29 May, 2021",
        "context": "If it ends up being a flawed study Tylenol will get a bad rap and the same folks that believe vaccines cause autism(flawed study) will hold it as fact. It's like all the folks that think they get MSG syndrome even though it was a fabricated lie. My mil and sil both claim to have it, don't even realize I season with it, not one reaction despite eating my food for over 25 years.",
        "good": "8",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "muses16",
        "time": "29 May, 2021",
        "context": "Don't believe anything anymore :(",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "urdelusional",
        "time": "29 May, 2021",
        "context": "Hospitals were always big on acetaminophen. That made me suspicious.\nI did the research and avoided it like Nike.",
        "good": "20",
        "bad": "6",
        "replies": [
            {
                "user_name": "displayname194",
                "time": "29 May, 2021",
                "context": "A fatty like you avoids all athletic gear. Not needed going from your couch to the refrigerator and back.",
                "good": "0",
                "bad": "33",
                "replies": []
            },
            {
                "user_name": "majorsmudges",
                "time": "29 May, 2021",
                "context": "Yep. They’re also big on bandages, oxygen and fresh linen.  Are you scared of them too?",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "human2020",
        "time": "29 May, 2021",
        "context": "Regardless of what caused my child to have autism one fact remains, he has it. There are too many things everyone is exposed to in this world and to many different ways in which individual bodies react to those stimuli. My wife shed many tears over our situation over the years thinking how she could have prevented his condition. But the fact remains that he is loved, special, and healthy. We are blessed and have moved on from questioning what cannot be changed.",
        "good": "262",
        "bad": "10",
        "replies": [
            {
                "user_name": "onewayhome960",
                "time": "29 May, 2021",
                "context": "Stay strong brother...",
                "good": "12",
                "bad": "2",
                "replies": []
            },
            {
                "user_name": "YoungMac",
                "time": "29 May, 2021",
                "context": "Couldn't have said it better myself.  My son is 31-years-old, still lives with me at home, and is very special.  I wish he was not autistic, but the fact is, he is, and you make the best of the cards you are dealt in this life.  Sounds like you did exactly that.  We are blessed!",
                "good": "87",
                "bad": "2",
                "replies": [
                    {
                        "user_name": "onewayhome960",
                        "time": "29 May, 2021",
                        "context": "Praying for your strength and patience...",
                        "good": "16",
                        "bad": "2",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "individualthought",
                "time": "29 May, 2021",
                "context": "Good on you.  Hope the best for your family.  Americans are generally not good at taking a punch and rolling through.  Thanks for the awesome example!",
                "good": "40",
                "bad": "11",
                "replies": [
                    {
                        "user_name": "awittyfellow",
                        "time": "29 May, 2021",
                        "context": "Yeah - we became the most powerful country on planet earth because we just roll over and can’t take punches. What an ignorant statement.",
                        "good": "11",
                        "bad": "9",
                        "replies": [
                            {
                                "user_name": "individualthought",
                                "time": "29 May, 2021",
                                "context": "Fortunately that is our history.  Sadly not our present or future with the last couple generations of snowflakes.",
                                "good": "1",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "user_name": "justaname71",
                        "time": "29 May, 2021",
                        "context": "Speak for yourself.",
                        "good": "4",
                        "bad": "3",
                        "replies": [
                            {
                                "user_name": "Ice32",
                                "time": "29 May, 2021",
                                "context": "He just did.",
                                "good": "0",
                                "bad": "1",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "user_name": "baileyolive890",
                        "time": "29 May, 2021",
                        "context": "Americans are probably the best at “taking a punch and rolling through”.  In fact,  we help out the other countries who can’t.",
                        "good": "3",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "🐟Deliciousbass🐟",
                "time": "29 May, 2021",
                "context": "Amen. Our second born did not speak until he was 3.  He was diagnosed as autistic and we put him in a specialized pre-school. We planned for the worse but he turned out close enough to ‘mainstream’. He is studying engineering at Colorado School of Mines with straight A’s. He’s a bit quirky but everyone enjoys him. We were fortunate/blessed that it wasn’t more challenging.",
                "good": "62",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "VoteOnlyRepublican2022",
                        "time": "29 May, 2021",
                        "context": "If he gets straight A's in Engineering, he would be quirky even without the autism diagnosis.  Similar path for me, but no diagnosis and I am quirky.  Really that is normal.",
                        "good": "3",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "ryanthomas52",
                "time": "29 May, 2021",
                "context": "Not to sound insensitive, but it makes me wonder if autism is something that can be passed to offspring. If so, it can be more complicated than giving them a loving home. It can mean a significant shift in human nature as it spreads.",
                "good": "6",
                "bad": "14",
                "replies": [
                    {
                        "user_name": "drjon2",
                        "time": "29 May, 2021",
                        "context": "Of course. It is just the way some people are. We mostly learn to live with it, and for most people it is a pretty good way to be. There are some people who are a bit more extreme, and it interferes with their ability to function in society. But they are just people. Just like there is no known cause for people having \"normal\" intelligence, which many people on the spectrum view as debilitating, and a horrible condition for a person to have to endure, there is no cause for autism.",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "alexxx888",
                        "time": "29 May, 2021",
                        "context": "Because most autistic people are happily married with many offspring?",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "motherwit",
                        "time": "29 May, 2021",
                        "context": "\"As it spreads\". What's wrong with you? If you are referring to someone having genetic markers for autism, then use those words.",
                        "good": "0",
                        "bad": "2",
                        "replies": []
                    },
                    {
                        "user_name": "ryanthomas52",
                        "time": "1 June, 2021",
                        "context": "You dopes can't see past the end of your nose.  I'm saying if it is indeed true that Tylenol causes autism, it begs the bigger question, \"Can Tylenol cause permanent genetic changes in a person at birth? Something they can pass onto future generations.\"  If it's even remotely possible, we need to start checking our medication a LOT more thoroughly.",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "piceno763",
                "time": "2 June, 2021",
                "context": "I saw a show on CBC in Canada (a few years ago) where an autistic child was given a specific type of antibiotic, and completely recovered from the autism for a period of 3 months. Then, when it was decided to stop the antibiotic treatments, the child went back to being autistic.  I watched this show in disbelief, and the mother of the child was devastated when her child reverted back to being autistic. You should look into this for your child.",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "hilairebelloc",
        "time": "29 May, 2021",
        "context": "Autism is inherited.  Silicon Valley is rife with it.  Smart people mixing with smart people gets you people with lots of logic and little social skills.  No different than breeding for large ears of corn.",
        "good": "5",
        "bad": "9",
        "replies": [
            {
                "user_name": "bowtech74438",
                "time": "29 May, 2021",
                "context": "Luckily you're clearly in no danger.",
                "good": "1",
                "bad": "4",
                "replies": [
                    {
                        "user_name": "hilairebelloc",
                        "time": "29 May, 2021",
                        "context": "The Geek Syndrome\nAutism—and its milder cousin Asperger's syndrome—is surging among the children of Silicon Valley. Are math-and-tech genes to blame?",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "bowtech74438",
                                "time": "29 May, 2021",
                                "context": "I'm smart enough to know that I don't know..but I was just teasing ya.",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "djohnson",
        "time": "29 May, 2021",
        "context": "I guess this is true, my wife says I'm brain dead all the time.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "😷😷😷ㅤ=ㅤ🐑🐑🐑",
        "time": "29 May, 2021",
        "context": "Acetaminophen has been used clinically since 1886. We are still learning of its adverse effects. Yet healthy people are lining up for the COVID \"vaccine\" that was developed in less than a year, and has no medical benefit for a majority of the population.",
        "good": "96",
        "bad": "51",
        "replies": [
            {
                "user_name": "majorsmudges",
                "time": "29 May, 2021",
                "context": "“Yet healthy people are lining up for the COVID \"vaccine\" that was developed in less than a year, and has no medical benefit for a majority of the population.“\n\nWell done. That’s probably one of the dumbest sentences ever written in the English language.",
                "good": "24",
                "bad": "63",
                "replies": [
                    {
                        "user_name": "kramerica",
                        "time": "29 May, 2021",
                        "context": "Why is that, Skippy?",
                        "good": "6",
                        "bad": "6",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "Ice32",
                "time": "29 May, 2021",
                "context": "We don't know the long term affects of COVID either, so if you're in a high risk demographic (65 plus) then it makes sense. If you're a child, thus in a low risk group, it probably doesn't.",
                "good": "14",
                "bad": "4",
                "replies": []
            },
            {
                "user_name": "drjon2",
                "time": "29 May, 2021",
                "context": "Balance of risk and reward.\nIf I get covid, my chance of dying is about 1.5% if I take the vaccine, my chance of dying from the vaccine is less than .0001%, and my chance of dying from covid is less than that.\nIf I don't take the vaccine, my chances of getting covid eventually is about 100%.\nSo I got the vaccine.\nSimple math.\nThere might be some side effect from the vaccine, but the prevalence of latent side effects from vaccines is zero,up until this point, and there is no clear reason to expect this vaccine to be different.\nLiving is dangerous, everything has risk. No medical treatment, or choice to abstain from medical treatment, is without risk.",
                "good": "26",
                "bad": "8",
                "replies": []
            }
        ]
    },
    {
        "user_name": "captnkirk1",
        "time": "29 May, 2021",
        "context": "Aspirin aspirin aspirin",
        "good": "6",
        "bad": "4",
        "replies": [
            {
                "user_name": "majorsmudges",
                "time": "29 May, 2021",
                "context": "Aspirin can cause internal bleeding - that’s a fact. \nWhat isn’t yet a fact is a link between paracetamol and autism.",
                "good": "2",
                "bad": "2",
                "replies": []
            },
            {
                "user_name": "Alotta.Anger",
                "time": "29 May, 2021",
                "context": "Willow bark and whiskey.  \nI cannot trust the pharmaceutical companies.",
                "good": "2",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "lycopine",
                        "time": "29 May, 2021",
                        "context": "so you'll scrape the bark and process it and then trust the distilleries and alcohol?",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "wolfcreek243",
        "time": "29 May, 2021",
        "context": "Here come the law suits!",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "patriotkdh",
        "time": "29 May, 2021",
        "context": "Decades of use and now we have a possible problem, after 8 months from development to testing and finally being administered we are being guaranteed that the china cough vaccine is safe",
        "good": "7",
        "bad": "6",
        "replies": [
            {
                "user_name": "akko",
                "time": "29 May, 2021",
                "context": "Tylenol is safe too. Thus study doesn’t disprove that AT ALL.",
                "good": "6",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "patriotkdh",
                        "time": "29 May, 2021",
                        "context": "Oh I didn't realize that you were an expert, the article said there might be a correlation which is why I said a \"possible\" problem. Read thoroughly before comments.",
                        "good": "1",
                        "bad": "1",
                        "replies": [
                            {
                                "user_name": "akko",
                                "time": "29 May, 2021",
                                "context": "I know what you wrote. Every med has a ‘possible’ problem. Doesn’t mean it’s not safe. \nYour bias against a life saving vaccine is showing. You are overflowing your fears of the side effects. Bet you hate masks too.",
                                "good": "0",
                                "bad": "1",
                                "replies": []
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "YoungMac",
        "time": "29 May, 2021",
        "context": "I have a son with severe autism.  I rarely take Tylenol.  My step-daughter has a son on the spectrum.  She rarely takes Tylenol.  Their father, unknowingly, was on the spectrum.  He has one son and three grandsons either with autism or Asbergers.  One of our sons does not have any issues but every other male descendent and one daughter are all autistic.  In the case of our family, it is genetics, not Tylenol, and also possibly exposure to pollutants, as they were all conceived, birthed and at least partially raised in NW Indiana surrounded by steel mills.  I rank this new finding right up there with the immunization theory.",
        "good": "54",
        "bad": "18",
        "replies": [
            {
                "user_name": "akko",
                "time": "29 May, 2021",
                "context": "How do you parse out the genetic side from the pollutant side, in the case of this family?",
                "good": "9",
                "bad": "2",
                "replies": []
            },
            {
                "user_name": "trumpsupporter727",
                "time": "29 May, 2021",
                "context": "Was it evident immediately or something that happened? My 2 yr old niece was perfectly normal until her 2 year old MMR vaccine, suffered brain swelling, seizures and high fever. 2 months later diagnosed as Autistic. My point is: vaccines do cause Autism in some kids. This should not be a one shot fits all scenario. There are many cases like this and the \"experts\" should be able to determine if certain genealogy is susceptible.",
                "good": "20",
                "bad": "27",
                "replies": []
            }
        ]
    },
    {
        "error": "error"
    },
    {
        "user_name": "LQ07",
        "time": "29 May, 2021",
        "context": "Wikipedia….  “Autism has a strong genetic basis, although the genetics of autism are complex and it is unclear whether autism spectrum disorder (ASD) is explained more by multigene interactions or by rare mutations with major effects.“\n Most of autism is genetic,  passed on in families.",
        "good": "24",
        "bad": "13",
        "replies": [
            {
                "user_name": "lmullins01",
                "time": "29 May, 2021",
                "context": "Remember that anyone can upload to Wikipedia whatever they want.  It should not be considered a reliable, primary source, although I agree you have some valuable points.",
                "good": "22",
                "bad": "4",
                "replies": [
                    {
                        "user_name": "jerryjamjerry",
                        "time": "29 May, 2021",
                        "context": "You should go ahead then and try to \"upload to Wikipedia\" and see what happens.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "retired5.0",
        "time": "29 May, 2021",
        "context": "Sure.....Uh huh......we all know what causes Autism and it is the MMR vac. It has been studied and studied. Results show definite Autism in kids who got the MMR vac. No cases before vac introduced. You can deny all you want. People lie, evidence doesn't",
        "good": "8",
        "bad": "20",
        "replies": [
            {
                "user_name": "majorsmudges",
                "time": "29 May, 2021",
                "context": "Absolute nonsense.",
                "good": "8",
                "bad": "2",
                "replies": [
                    {
                        "user_name": "retired5.0",
                        "time": "29 May, 2021",
                        "context": "Hah, read the evidence and weep",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "vaconservative890",
                "time": "29 May, 2021",
                "context": "wrong",
                "good": "7",
                "bad": "3",
                "replies": [
                    {
                        "user_name": "retired5.0",
                        "time": "29 May, 2021",
                        "context": "Evidence does not lie, people do",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "drjon2",
                "time": "29 May, 2021",
                "context": "What study?\nActually, the exact opposite is true.",
                "good": "3",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "retired5.0",
                        "time": "30 May, 2021",
                        "context": "Research them yourself, they are easy to find. It is lazy people like you that have only hate for the truth and a disdain for research",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "quietsmith",
                "time": "30 May, 2021",
                "context": "No, you don't know that because you're wrong, and there have been loads of studies that show you're wrong. Whomever has told you this has lied to you.",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "josephdirt",
        "time": "29 May, 2021",
        "context": "Always remember, correlation is not causation. Why did the women take tylenol? Were they hung over? Did they exercise to the point lactic acid built up in the blood? \n\nThese are questions which without answers make this study meaningless. \n\nAnd 19%-21% doesn't mean tylenol causes autism, just that it is a more likely outcome for some reason in those cases. This is the sort of headline grabbing garbage the left pays \"researchers\" to announce. \n\nYou have to ask yourself this question though. If researchers found that pregnant mothers taking tylenol lead to children who would later decide to be homosexual or transgender, would you want tylenol taken off the shelves or mandated like the covid vaccine?",
        "good": "3",
        "bad": "3",
        "replies": [
            {
                "user_name": "lycopine",
                "time": "29 May, 2021",
                "context": "As opposed to the \"right\" that ignores science completely, uses the bible as a science textbook, calls ACC a decades long world wide hoax and believes the Earth is 6000 years old?",
                "good": "2",
                "bad": "12",
                "replies": [
                    {
                        "user_name": "drjon2",
                        "time": "29 May, 2021",
                        "context": "Actually, most of the serious scientists I know (but not all) are very right wing social conservative types. Probably because they are a good deal smarter than the average person.",
                        "good": "3",
                        "bad": "1",
                        "replies": [
                            {
                                "user_name": "lycopine",
                                "time": "29 May, 2021",
                                "context": "So a small segment of the right does NOT negate the fact that religious social conservatives believe in fairy tales...",
                                "good": "0",
                                "bad": "1",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "drjon2",
                "time": "29 May, 2021",
                "context": "Actually, it is pretty clear that endocrine disruptors, common in our environment, do exactly that.\nEffects of studies on animals show a clear increase in \"that sort of thing\".\nNo one seems very concerned, but the number of effeminate young men is much more than it was 50 years ago.",
                "good": "3",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "josephdirt",
                        "time": "29 May, 2021",
                        "context": "And it is also pretty clear that women using drugs both legal and illegal before they have children increases the likelihood of birth defects including developmental defects like autism and ADHD because women are born with every egg they will ever produce already in their bodies where they are subject to damage from anything that enters the bloodstream.",
                        "good": "0",
                        "bad": "1",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "payasyoug0",
        "time": "29 May, 2021",
        "context": "Let the Tort lotto begin...",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Fran-1",
        "time": "29 May, 2021",
        "context": "So this explains what is wrong with Republicans!",
        "good": "0",
        "bad": "19",
        "replies": [
            {
                "user_name": "hilairebelloc",
                "time": "29 May, 2021",
                "context": "Republicans have better mental health than Democrats.  Google the studies.  You’re welcome.",
                "good": "6",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "lycopine",
                        "time": "29 May, 2021",
                        "context": "You mean mental health that allows Republicans to use the bible as a science texbook and think the Earth is 6000 years old? That kind of mental health?\nYour welcome...",
                        "good": "1",
                        "bad": "3",
                        "replies": [
                            {
                                "user_name": "hilairebelloc",
                                "time": "29 May, 2021",
                                "context": "I guess\n\nReligion gives people something to believe in, provides a sense of structure and typically offers a group of people to connect with over similar beliefs. These facets can have a large positive impact on mental health—research suggests that religiosity reduces suicide rates, alcoholism and drug use.Dec 21, 2016",
                                "good": "1",
                                "bad": "1",
                                "replies": [
                                    {
                                        "user_name": "lycopine",
                                        "time": "29 May, 2021",
                                        "context": "I don't guess. Religion is a human invention along with  the 10,000+ gods that go with it. Believing in fairy tales and super beings gives a \"feel good\" to the brainwashed believers since they were coerced from birth with fearful stories of burning and devils and only the stories told by parents and religious leaders would \"save\" them. Meanmwhile religion perpetuates itself with the continued brainwashing, causes conflicts, wars, genocide, etc.\nIt's a mixed bag of behaviors.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "bowtech74438",
                "time": "29 May, 2021",
                "context": "Clearly your mom took lots of Tylenol while carrying you. Atleast you have an excuse now.",
                "good": "2",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "phoenix-rising",
        "time": "29 May, 2021",
        "context": "acetaminophen is already linked to lowering empathy. look it up.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Joe’sDogHatesHim",
        "time": "29 May, 2021",
        "context": "autism is a huge scam industry.",
        "good": "3",
        "bad": "13",
        "replies": []
    },
    {
        "user_name": "PleaseThink.",
        "time": "29 May, 2021",
        "context": "Wait for the fools trying to link this study to the Covid vaccine! (Even though they are completely different mechanisms)",
        "good": "1",
        "bad": "4",
        "replies": [
            {
                "user_name": "jenmak",
                "time": "29 May, 2021",
                "context": "I guess you're a virologist or an immunologist? You probably also were on the band wagon of it not coming from Wuhan. I see, you believe MSM. Follower.",
                "good": "1",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "drjon2",
                        "time": "29 May, 2021",
                        "context": "His comment (though unneccessary),  was accurate in what it asserted. Oral acetaminophen is entirely unlike an mRNA vaccine injection.\nWhile it seems unlikely someone will make the connection he suggests, and his suggestion appears to be only an attempt to annoy the anti covid vaccine people, it isn't worth biting on.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "Stillmoon",
        "time": "29 May, 2021",
        "context": "Oh imagine that!!  but the AMA say's its safer than Motrin!!!  Gotta love Science!!",
        "good": "2",
        "bad": "0",
        "replies": [
            {
                "user_name": "drjon2",
                "time": "29 May, 2021",
                "context": "True. Ibuprophen carries a significant though small risk of gastric bleeding, and its use correlates with a significantly higher rate of cardiac problems. The correlation may be specious, but it does exist.\nAcetaminophen carries a risk of liver damage if taken with alcohol, or in too high a dosage.\nNeither one is perfect.\nLiving is dangerous.",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "PascoArt049",
        "time": "29 May, 2021",
        "context": "Big pharma will blame autism on anything but childhood vaccines.",
        "good": "3",
        "bad": "6",
        "replies": [
            {
                "user_name": "drjon2",
                "time": "29 May, 2021",
                "context": "True enough. Because there is zero evidence that autism is caused by childhood vaccines.\nNone.\nSo blaming it on childhood vaccines would be dishonest on their part.\nIn fact, most autism is just the normal variation in people, as far as I can tell. Not a condition or disorder at all.\nWhen I was a child, I would have easily been diagnosed with ASD, if there had been any money in it, which there wasn't at the time. Fortunately, I wasn't, and as a result I have a good and successful life. Now I have a son who is much as I was as a lad. He has not been diagnosed, except for ad-hoc by busybodies. I expect he, like I, will learn to accommodate the peculiarities of \"normal\" people, and have a successful and happy life.\nIt takes time.",
                "good": "7",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "rhugh",
                        "time": "29 May, 2021",
                        "context": "i have seen tge trauma after vaccination",
                        "good": "0",
                        "bad": "2",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "quietsmith",
                "time": "30 May, 2021",
                "context": "Probably because vaccines don't cause autism.",
                "good": "1",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "PascoArt049",
                        "time": "30 May, 2021",
                        "context": "You know that to be a fact how? A big pharma paid for study told you so?",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "quietsmith",
                                "time": "30 May, 2021",
                                "context": "Well at last count, and it has been a few years, there were 17 studies that I was aware of that said vaccines don't cause autism. There was only ever one that did and even it's author has said it was wrong.",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "SubsonicWarthog",
        "time": "29 May, 2021",
        "context": "If true, I'm in for Big troubles. Severe arthritis and I take it every day and night. ",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "selkie614",
                "time": "29 May, 2021",
                "context": "Are you planning on getting pregnant?",
                "good": "3",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "goonies",
        "time": "29 May, 2021",
        "context": "Biden must of ate these like candy . \nThat explains a lot .",
        "good": "4",
        "bad": "5",
        "replies": [
            {
                "user_name": "displayname194",
                "time": "29 May, 2021",
                "context": "Well unless Biden gave birth to himself your \"zinger\" doesn't work. Maybe have your ten year old read and explain the story to you, genius.",
                "good": "3",
                "bad": "2",
                "replies": [
                    {
                        "user_name": "goonies",
                        "time": "29 May, 2021",
                        "context": "Thank you for giving me the satisfaction to know \nI hurt your feelings .",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "LibsStoleWhiteHouse",
        "time": "29 May, 2021",
        "context": "Acetaminophen, or 'Tylenol' is by far one of the most dangerous medications ever created.  A couple thousands milligrams, or as few as 6 or 8 pills, can be enough to completely destroy someone's liver.  Every year, emergency rooms are filled with people who have unwittingly overdosed on this seemingly innocuous drug.  Why this continues to be over-the-counter, and freely available to ANYONE, including unsuspecting minors is an ongoing mystery.  \n\nI'm guessing it has something to do with Big Pharma?",
        "good": "18",
        "bad": "8",
        "replies": [
            {
                "user_name": "majorsmudges",
                "time": "29 May, 2021",
                "context": "The figure of 8 tablets you quote would be applicable to a small child taking them all at once and not an adult. Let’s leave the fear mongering out of it.\nTaking the recommended dose as indicated on the packaging is not going to do you harm. You can overdose on almost any drug if you are too lazy to read the instructions on the packet.",
                "good": "3",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "LibsStoleWhiteHouse",
                        "time": "29 May, 2021",
                        "context": "The recommended max daily dose for an adult, over 24 hrs, is 4000mg - or 8 x 500mg pills (i.e.: over the counter, 'Extra Strength Tylenol').  \nTake 'em all at once and you could be in trouble.\nJust stating the mathematical facts, Cletus.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "majorsmudges",
                                "time": "30 May, 2021",
                                "context": "No, you aren’t. An adult would almost definitely not cause themselves any harm from taking 4 grams (8 pills) at once. You said 6 or 8 pills can be enough to completely destroy someone’s liver - that just MIGHT be true in a small child - not an adult. \n\nFrom patient.info.com...\n\nRisk of severe liver damage...Based on the dose of paracetamol ingested (mg/kg body weight):\nLess than 150 mg/kg - unlikely.\nMore than 250 mg/kg - likely.\nMore than 12 g total - potentially fatal.\n\nSo, based on the above figures even a very small adult weighing 50kg (110 lb) would need to down at least 15 tablets all at once before they passed the “unlikely” threshold for severe liver damage, and at least 25 tablets to pass into the “likely” band for severe liver damage. \nA 25kg 8 year old kid who downed 8 tablets in one go - yeah, they might just have an issue - an adult, no. \nSometimes Google is your friend. \n\nAnd I’m not sure what you were trying to prove in your other post - the doctor’s quote you gave is related to overdoses - I never said it’s impossible to overdose - I said it’s impossible to overdose if you follow the dosage instructions on the packet. Yes, some overdoses are unintentional - largely because people don’t realise that paracetamol is an ingredient in several different types of cold and flu medications and they unknowingly take too much  at once from various different sources but if they had read the warnings on the packets properly it would not have happened. Seems simple",
                                "good": "1",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "LibsStoleWhiteHouse",
                                        "time": "30 May, 2021",
                                        "context": "Did you miss the least line - \"450 deaths occur each year from acetaminophen-associated overdoses; 100 of these are unintentional\"\nThere are still quite a few morons who accidentally OD on this, because they are unaware of how dangerous it can be.  I mean it's a common over-the-counter medication, and also combined with hundreds of other OTC meds!  \nWhich is the salient point of my original post.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": [
                                            {
                                                "user_name": "majorsmudges",
                                                "time": "30 May, 2021",
                                                "context": "You can’t sanitise life of all risk just because the world has some morons who refuse to do things like read a label on a package of paracetamol or any related products. Literally any OTC painkiller will be lethal if you take enough of it. The world is full of potentially lethal everyday objects that if used correctly are perfectly safe. We don’t ban morons from driving, or buying chainsaws, knives or even guns.",
                                                "good": "1",
                                                "bad": "0",
                                                "replies": [
                                                    {
                                                        "user_name": "LibsStoleWhiteHouse",
                                                        "time": "30 May, 2021",
                                                        "context": "I don't understand what your problem is.  What I've quoted are facts & widely known issues with this easily accessible drug.  \nDo you own shares in Big Pharma?\nShame we don't ban you morons from posting on this site.",
                                                        "good": "0",
                                                        "bad": "1",
                                                        "replies": [
                                                            {
                                                                "user_name": "majorsmudges",
                                                                "time": "30 May, 2021",
                                                                "context": "No, my problem is with your disinformation. You quoted incorrect figures saying that a single dose of 6 or 8 tablets of paracetamol can destroy your liver - your very statement itself is  inherently inaccurate and shows you have no idea what you are talking about and just made up your ‘facts’ - for instance,  is it 6 or actually 8 tablets that you consider could destroy your liver? I then posted actual figures that indicate that the figures you gave are simply not true. So you were wrong. \nYou now seem to be suggesting that we should ban paracetamol just because some people won’t read the dosage instructions and warnings on products containing it  and might take too much leading to them harming themselves - which is simply a ludicrous position to take as it could apply to almost every medicine in existence. It also flies in the face of the personal  “freedom” I am sure you like to endlessly bang on about when given half a chance - if you got your way then morons should be free to buy guns and not wear masks but they won’t be allowed to buy paracetamol products when they have a cold because they can’t be trusted to read the labels properly.  Lol.",
                                                                "good": "1",
                                                                "bad": "0",
                                                                "replies": []
                                                            }
                                                        ]
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "user_name": "LibsStoleWhiteHouse",
                        "time": "29 May, 2021",
                        "context": "Dr. Aric Hausknecht MD, a New York neurologist and pain management \nspecialist, said this in 2017:\n\"Tylenol Is By Far The Most Dangerous Drug Ever Made\"\n\"Each year a substantial number of Americans experience intentional and \nunintentional Tylenol (acetaminophen) associated overdoses that can result in serious morbidity and mortality. Analysis of national databases show that acetaminophen-associated overdoses account for about 50,000 emergency room visits and 25,000 hospitalizations yearly.  Acetaminophen is the nation's leading cause of acute liver failure, according to data from an ongoing study funded by the National \nInstitutes for Health. Analysis of national mortality files shows about \n450 deaths occur each year from acetaminophen-associated overdoses; 100 of these are unintentional.\"\n\nGoogle is sometimes your friend - maybe try it.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "valborga",
        "time": "29 May, 2021",
        "context": "Oh next they'll say \"soda\" or \"baking powder\" is a problem🙄.   autism is not to be blamed on the mother of what she took or didn't take when pregnant.....because the truth is the only thing they know is they don't know what causes autism.",
        "good": "12",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "GyozaGirl",
        "time": "29 May, 2021",
        "context": "I thought autism was more common in males. Are women who are expecting boys more likely to take acetaminophen than women who are pregnant with girls?",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "skewtour",
        "time": "29 May, 2021",
        "context": "Don't even have it in my house.  I never buy cold remedies that contain it.  It is useless for pain relief and destroys your liver.  This has been known for years.  Long live naproxen sodium! (aleve)",
        "good": "6",
        "bad": "0",
        "replies": [
            {
                "user_name": "majorsmudges",
                "time": "29 May, 2021",
                "context": "Naproxen sodium - Common adverse effects include dizziness, drowsiness, headache, rash, bruising, and gastrointestinal upset.[8][1] Heavy use is associated with increased risk of end-stage renal disease and kidney failure.[8][16]Naproxen may cause muscle cramps in the legs in 3% of people.[17]\nIn October 2020, the U.S. Food and Drug Administration (FDA) required the drug labelto be updated for all nonsteroidal anti-inflammatory medications to describe the risk of kidney problems in unborn babies that result in low amniotic fluid.[18][19] They recommend avoiding NSAIDs in pregnant women at 20 weeks or later in pregnancy.[18][19]",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "skewtour",
                        "time": "30 May, 2021",
                        "context": "At least I won't be in pain if I die.  Tylenol is useless against pain.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "OliveFlask",
        "time": "29 May, 2021",
        "context": "Always funny all the people who have their brilliant theories about medicine and how doctors are wrong about everything, yet when they actually get diagnosed with a life-threatening illness suddenly they'll do every single thing the doctor tells them...",
        "good": "15",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "merlin927",
        "time": "29 May, 2021",
        "context": "All along most thought it was the vaccinations",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jimr1961",
        "time": "29 May, 2021",
        "context": "More nonsense pseudo science.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "waveslin",
        "time": "29 May, 2021",
        "context": "Autism and attention-deficit/hyperactivity disorder is directly a result of our processed food.\nThe chemicals that we put into it is much more potent than cigarettes and/or alcohol. \nBut, we can't have the public know that.",
        "good": "5",
        "bad": "4",
        "replies": [
            {
                "user_name": "honest2god",
                "time": "29 May, 2021",
                "context": "I have three sons, only one who is ADHD.  I basically ate the same healthy diet during each pregnancy, so I don't believe your statement to be true.",
                "good": "2",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "alexxx888",
        "time": "29 May, 2021",
        "context": "How many women remember actually taking acetaminophen while pregnant?",
        "good": "2",
        "bad": "0",
        "replies": [
            {
                "user_name": "PurpleChefHat",
                "time": "29 May, 2021",
                "context": "Many. You shouldn’t  take ibuprofen while pregnant so for any pain or fever that you want to treat with an otc med you take Tylenol.",
                "good": "2",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "alexxx888",
                        "time": "29 May, 2021",
                        "context": "Since all the women were interviewed months or even years after being pregnant, how many of them can tell us how much they took each week, for example? Or if they took it more in the 1st, 2nd, or 3rd semester? Those who have children with autism may be more inclined to \"remember\" taking more than those who don't have an autistic child. Women in future studies should be asked to keep a log of what meds they take and how much. Then, the scientists should try to predict who'll have an autistic child (blindly, without actually knowing which woman did and which one didn't).",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "PurpleChefHat",
                                "time": "29 May, 2021",
                                "context": "Oh, I’m sure there’s a bias when people are looking for answers. I’ve had more children than post people these days and I can honestly remember a lot about each pregnancy... if I needed medicine and and about how far along I was when I did. Now that probably has something to do with the fact that I rarely take anything so when I do there’s a good reason... “ I took Tylenol - couple times per day during my 3rd pregnancy during my 3rd trimester because I threw my back out putting my second child in her car seat” kind of thing. \n\nBut women remember a lot about their pregnancies. Pregnancy is a big deal.",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "outflankm",
        "time": "29 May, 2021",
        "context": "I think from now on people in this country should educate themselves on how to practice basic medical procedures to prevent having to go to doctor for every conceivable minor illness, avoid taking any type of drugs except aspirin and a few other proven remedies. \nNotice the percentage of ads on TV that are promoting a magic pill that will be the next cash cow for the pharmaceutical industry.\nFollow a diet and life style that builds the immune systems.\nIt is amazing how humans survived for 50K years without all the pharmaceuticals. Wild animals do not require pharmaceuticals, even though the wild life officials will probably be pushing them to get vaccinated soon.\nThe strong and smart survive and reproduce while others parish unlike the stupid humans who constantly trying to downgrade the species .",
        "good": "12",
        "bad": "1",
        "replies": [
            {
                "user_name": "majorsmudges",
                "time": "29 May, 2021",
                "context": "You’re right. The next time you break a bone just leave it alone and don’t go to the doctor - because wild animals don’t go to the doctor either, right?",
                "good": "0",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "californiamojo",
        "time": "29 May, 2021",
        "context": "I stuck with Aspirin if at all possible",
        "good": "3",
        "bad": "1",
        "replies": [
            {
                "user_name": "geebster",
                "time": "29 May, 2021",
                "context": "Aspirin (when taken at analgesic doses) is contraindicated in all trimesters due to the risk of teratogenicity. Definitely not a drug of choice for a pregnant woman.",
                "good": "2",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "californiamojo",
                        "time": "29 May, 2021",
                        "context": "Noted!\n\nI will stick to cocaine and whisky \n\nThanks Doc",
                        "good": "1",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "geebster",
                                "time": "29 May, 2021",
                                "context": "I mean if you arent pregnant, dont have an aspirin allergy, dont have any history of bleeding issues, peptic ulcers or renal/hepatic problems then its a great drug. Unlike Tylenol (acetaminophen) we actually know how aspirin works so it has a consistent side effect and interaction profile. No one really knows how acetaminophen works.",
                                "good": "0",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "honest2god",
                                        "time": "29 May, 2021",
                                        "context": "I have read that acetaminophen blocks pain at the nerves, and ibuprofen reduces swelling, therefore reducing pain.  I was given very large doses of ibuprofen after my back surgeries, but no acetaminophen.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "error": "error"
    },
    {
        "user_name": "pachy",
        "time": "29 May, 2021",
        "context": "\"we agree with previous recommendations indicating that while acetaminophen should not be suppressed in pregnant women or children, it should be used only when necessary,\" the researchers added.\" Brilliant. Absolutely brilliant.",
        "good": "12",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "fubar101364",
        "time": "29 May, 2021",
        "context": "Can someone shed some light on vaccines causing autisim?",
        "good": "1",
        "bad": "1",
        "replies": [
            {
                "user_name": "rhugh",
                "time": "29 May, 2021",
                "context": "you are not allowed to talk about it and doctors who even nod to it lose their license. My child was 18 months and talking well and got 5 vaccinations in one and did not talk for 4 years after that. Linked possibly to measles shot but it is clear children go into trauma shock.  Maybe too many shots at once. 1out of 150 males. epidemic and we are not allowed to question vaccinations.",
                "good": "3",
                "bad": "4",
                "replies": [
                    {
                        "user_name": "jimr1961",
                        "time": "29 May, 2021",
                        "context": "I have similar experiences with my son, but different reactions from dx and different results. I chelated my son for heavy metals and he responded with tremendous results. With my son, I blame thimerosol, but ASD is a spectrum of  symptoms, not a disease, so there may be varying factors involved depending on the circumstance.",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "quietsmith",
                        "time": "30 May, 2021",
                        "context": "There is no link between vaccines and autism. There have been studies upon studies to prove this.",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "geebster",
                "time": "29 May, 2021",
                "context": "There is no link between the two, other than the fact that autism is reliably diagnosable at age 2 and often around 18 months, which is 6-9 months after the first MMR dose is given.  No causal relationship has ever been established and the mountains of evidence we have demonstrates that. Andrew Wakefield (who published the only paper demonstrating a link) only had 12 total children in the study and was retracted because he handpicked children who would show the result he wanted and unethically did invasive tests on them that he was not approved to do. He lost his medical license for that. Since that paper, since its a hot topic, there have been literally thousands of papers on the subject some with massive sample sizes and none have found a meaningful link between the two. It's always sad for a parent to find out their child might be on the spectrum, and they obviously want answers, they want to know \"why?\". It is no surprise that people hear from a charlatan like Wakefield that there is a link and they believe it because they were looking for a reason. Doesnt change the facts nor the evidence though.",
                "good": "7",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "quietsmith",
                "time": "30 May, 2021",
                "context": "There is no link between vaccines and autisim.",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "Indoctrination107",
        "time": "29 May, 2021",
        "context": "The phantom vaccine is worse",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "joecrowe77",
        "time": "29 May, 2021",
        "context": "Keep looking.\n\n\"Is Autism Genetic? Study Finds 80% Risk From Inherited Genes\nSeptember 6, 2019\nWhat causes autism?\nA new study looking at autism in 5 countries found that 80 percent of autism risk can be traced to inherited genes rather than environmental factors and random mutations. The study, published July 18 in JAMA Psychiatry, analyzed data of nearly 2 million people across Denmark, Finland, Sweden, Israel, and Western Australia. It is the largest family-based genetic autism study to date, including children with autism, their siblings and cousins, as well as parents and their siblings.\"autismspeaks.org",
        "good": "7",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "douglascairns",
        "time": "29 May, 2021",
        "context": "What was their reason for taking the medication?  Maybe THAT’S  what is associated with “autism”. Science never answers questions or makes conclusions (unless it’s physics). It only provides risk-reward statements. Every scientific article published in a peer review journal ends with qualifiers and cautions about interpreting the results.  ",
        "good": "10",
        "bad": "2",
        "replies": [
            {
                "user_name": "hillary522",
                "time": "29 May, 2021",
                "context": "You realize acetaminophen is tylenol right?",
                "good": "3",
                "bad": "1",
                "replies": []
            },
            {
                "user_name": "drjon2",
                "time": "29 May, 2021",
                "context": "This sort of study is nearly useless. It proves nothing.\nSince it relies on self reporting, it could actually show a correlation between maternal memory and autism. Better memory=more autism.\nNoting they only reported the main effect, and not the confidence intervals, it may not even be statistically significant.\nIt may indicate an actual cause and effect exists, and it is an area worthy of additional study.\nLike all medications, acetaminophen should be used only when necessary.",
                "good": "11",
                "bad": "1",
                "replies": []
            },
            {
                "user_name": "sciencerocks",
                "time": "29 May, 2021",
                "context": "For some strange reason, medical research is the weakest of all research. Maybe it is because physicians are not trained as scientists.",
                "good": "4",
                "bad": "3",
                "replies": []
            }
        ]
    },
    {
        "user_name": "baileyolive890",
        "time": "29 May, 2021",
        "context": "I find ibuprofen to be very effective for me.  Read mixed information as to any concerns with it.",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "geebster",
                "time": "29 May, 2021",
                "context": "Ibuprofen is contraindicated in the third trimester because it is associated with a whole host of dangerous syndromes (oligohydramnios with nephrotoxicity, periventricular hemorrhage, premature ductus arteriosus closure). It is relatively save until the 3rd trimester though, unlike Aspirin which is dangerous throughout.",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "Biracial😈Archangel😈",
                "time": "29 May, 2021",
                "context": "Terrible for your kidneys though.",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "charliesaidso633",
        "time": "29 May, 2021",
        "context": "I have a co worker who i was told has autism   and he is Brilliant  holds down 2 very competitive Jobs So he collects no SSi..Nothing of the sort  just recently bought a nice new car lives on his own bills are all paid  and is now trying to buy a house\nHe does very well  nothing makes him made he laughs at everything and himself when he messes up .... I refuse to believe he is Autistic  but his mother who worked with us some time ago  confirmed it..She also said:\"watch out when he phases out\"  but he covers it well cleaning his glasses too long and comes out telling jokes....And i learned a lot from him too\nAutism and Asbergers   is a norm   some handle it many dont...Im astonished",
        "good": "9",
        "bad": "1",
        "replies": [
            {
                "error": "error"
            }
        ]
    },
    {
        "user_name": "TheTruthAsItIs",
        "time": "29 May, 2021",
        "context": "Children are pushed harder and harder to learn more. Some children can handle this, and others can't. Those who can't are diagnosed with disorders. This disorders probably have always been around is just that with more expectations, the harder it is for those children to sit still and pay attention.",
        "good": "4",
        "bad": "4",
        "replies": [
            {
                "user_name": "displayname194",
                "time": "29 May, 2021",
                "context": "\"Children are pushed harder and harder to learn more\"\n\nIn this country? You must not have school aged children.",
                "good": "8",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "drjon2",
                        "time": "29 May, 2021",
                        "context": "The issue is that the range of normal has gotten narrower, and parents, as they have fewer children, are more concerned about the success of the ones they have. At the same time, the loss of stable families (kids in daycare while their parents work is not a stable family), the proliferation of mind sucking electronic gadgets, and the loss of the ability to discipline miscreants in school settings and the failure to do so at home has amplified natural tendencies all children have to misbehave. \nAt the same time, the government schools get more staff and money if they have a child with a diagnosis, pharma makes money drugging them, and parents of onlies have no confidence to say leave the kid alone, since they have no parenting experience.\nWhen you add the fact that it is much easier to teach a class of drug addled zombies than a class of normal boys, it isn't surprising so many children are being medicated.",
                        "good": "2",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "displayname194",
                                "time": "29 May, 2021",
                                "context": "While reading your post/rant the whole time all I could picture was you on your porch screaming at kids to stay off your lawn.",
                                "good": "1",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "user_name": "TheTruthAsItIs",
                        "time": "30 May, 2021",
                        "context": "I have a school aged child with Autism.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "JECampbell",
        "time": "29 May, 2021",
        "context": "I just stick with good old fashion aspirin and even then I rarely take any medication at all for anything, including aspirin. I'm permanently disabled. The pain in my spine is 24/7. Decades of wear and tear have caused my disk between the vertebrae to vanish. It's now bone against bone and degenerative. Multiple fractures. There is no fix and no cure. Taking any kind of pain medication only has me doing things I shouldn't and accelerating the degenerative affect. I prefer to at least be able to continue to walk as long as I can even if it means bearing the pain.",
        "good": "17",
        "bad": "0",
        "replies": [
            {
                "user_name": "valborga",
                "time": "29 May, 2021",
                "context": "thats good if you can take aspirin.  I can't without getting an allergic reaction.",
                "good": "4",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "cheeto22555",
        "time": "29 May, 2021",
        "context": "So they based their results on 73k mothers and child’s out of the millions/billions? since we started using acetaminophen?\n\nAnd there data only suggests there may be a link...\n\nWell hell, without even spending millions of dollars on a study, I can say that if u eat more calories than u burn u will gain weight. \n\nEverything we ingest nowadays affects us and any unborn children. I know that...it’s a fact...it’s just that the odds are super super slim and we accept them and don’t think twice about them....except with covid we got stupid. ",
        "good": "2",
        "bad": "2",
        "replies": [
            {
                "user_name": "quietsmith",
                "time": "30 May, 2021",
                "context": "This is how scientific papers are written. They will always use terms like \"suggests\", learn something.",
                "good": "1",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "mrk",
                "time": "31 May, 2021",
                "context": "It is suggested by data, by correlation is not causation, and this why the term \"suggests\" is used. A mechanism by which this occurs needs to be identified for it to be definitive. This is how science is done.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "daniellangford",
        "time": "29 May, 2021",
        "context": "NSAID also increase your chances of developing blood clots.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "OliveGoggles",
        "time": "7 June, 2021",
        "context": "Immediately they are skeptical of the results... Well was the booster shot or now Tylenol that gave my son autism...he's the one stuck in limbo from one of those two factors for life. Hopefully one day they can cure him and let him live a normal life.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Shemanese1",
        "time": "31 May, 2021",
        "context": "One must examine the correlations between technical/mathematical vocational  female mothers with \"male oriented brain\" characteristics married to highly technical brain oriented biological fathers and then determine if, in fact, these mothers tend to be to be ingesting above average (how much) acetaminophen during pregnancy. Reference the research conducted by the UK residing physician cousin of the star of the movie \"BORAT\")     (Baron-Cohen, MD)  for further investigation. You will fine this research very interesting.  My research indicates acetaminophen may be one of several contributors when taken in above recommended levels to address headaches and pain during pregnancy.",
        "good": "0",
        "bad": "0",
        "replies": []
    }
]