[
    {
        "user_name": "brylcreamboomer",
        "time": "22 July, 2022",
        "context": "These galaxies potentially push our cosmic frontier to only ~300 million years after the Big Bang!!!\" The brighter the red, the older and further away it is....like 13 Billion years ago away.....\n\nNo...er....wait a second.... Sorry that's Siracha sauce from my hot dog at lunch that must have spattered onto my computer screen......",
        "good": "1",
        "bad": "6",
        "replies": [
            {
                "user_name": "beadgBass",
                "time": "23 July, 2022",
                "context": "Just sit back and enjoy the science and engineering as it unfolds before your eyes.\nThese are magnificent times, like the first moon landing, to put us all in awe!",
                "good": "4",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "yeah.no,i’mright.",
        "time": "22 July, 2022",
        "context": "Joe!",
        "good": "0",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "siriusdogstar079",
        "time": "22 July, 2022",
        "context": "These are the same so-called experts who said that vaccines work and that the Earth is round I suppose.",
        "good": "0",
        "bad": "6",
        "replies": [
            {
                "user_name": "letsgetrel",
                "time": "22 July, 2022",
                "context": "I don't think that astronomers spend much time studying vaccines, and even the earliest scientists wrote about a spherical Earth.",
                "good": "7",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "lycopine",
                        "time": "27 July, 2022",
                        "context": "Greek mathematician Aristarchus postulated a heliocentric solar system 500 years before jesus adherents mandated otherwise. It only took the head jesus leader till 1992 to pardon Galileo for his blasphemy proving what was already known.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "EleanorM",
                "time": "22 July, 2022",
                "context": "You come off as being literally proud of your ignorance.    Pretty sad.",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "imfortrump2020",
        "time": "22 July, 2022",
        "context": "a.k.a. The God Particle!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "teazle1",
        "time": "22 July, 2022",
        "context": "Adama is on his way.",
        "good": "0",
        "bad": "4",
        "replies": [
            {
                "user_name": "dan5047628",
                "time": "22 July, 2022",
                "context": "I loved that series",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "teazle1",
                        "time": "22 July, 2022",
                        "context": "Me too. Definitely one of the best.",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "iaintnobodydork",
        "time": "22 July, 2022",
        "context": "i read the first article after they started recieving pictures and data and the article said some of the images couldnt be released because they were top secret. i havent really cared since because you and i will never get the full picture (if you will) of what they see.",
        "good": "0",
        "bad": "3",
        "replies": [
            {
                "user_name": "letsgetrel",
                "time": "22 July, 2022",
                "context": "You have to read a lot of detailed research articles to see what they see.",
                "good": "4",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "brylcreamboomer",
                "time": "22 July, 2022",
                "context": "I'm curious why something like these would be top secret.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "kwitchyerbeliakin",
                        "time": "22 July, 2022",
                        "context": "It's not. But the scientists involved have proprietary rights over the data before it is released.",
                        "good": "3",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "Higgenbottom",
        "time": "22 July, 2022",
        "context": "And when you get to the bottom line....then what?  This research is costing billions and going nowhere.  It's exactly like a dog that chases cars - when it catches one, then what?\nSo what if you come to the exact moment of creation...then what?  NADA! that's what!",
        "good": "1",
        "bad": "10",
        "replies": [
            {
                "user_name": "kwitchyerbeliakin",
                "time": "22 July, 2022",
                "context": "No need to take your frustrations with a meaningless life out on scientists who are discovering more than most of us ever imagined we would see in our lifetimes.",
                "good": "7",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "frankrazor",
                "time": "22 July, 2022",
                "context": "A hamster brain speaking. Sad.",
                "good": "4",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "lycopine",
                        "time": "27 July, 2022",
                        "context": "not that intelligent...",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "quietsmith",
                "time": "23 July, 2022",
                "context": "We get it.\n\nYou don't understand it so nobody does :D",
                "good": "4",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "darknightdad",
                "time": "23 July, 2022",
                "context": "What did you know when you where 5 years old? Could you have navigated our world's societies and cultures to the same point you are in life now, only using the knowledge you had at 5? Of course not. You had to learn more advanced ideas and assimilate new facts so that you could use that new wisdom to continue to thrive and sustain yourself. Just as we now gain knowledge of the universe around us to determine what does and could happen. So that, if needed, we can look to our new knowldge to determine an effective way to thrive and sustain ourselves as a species. If Earth were to become inhospitable to the life on its surface, would it not be a valuable asset to possess the interstellar knowledge of how and where other celstial objects have formed in \"Earthlike\" conditions?  Would you have any valid objections if the financial aspect was deleted from the equation?  To answer you directly...If we were to objectively and confidently identify the moment of the beginning of our known universe down to the presicion of plank time scales; we would then have the correct starting point for which to accurately assign age to components of our universe. This would allow more precise measurements of spacetime and the calculated duration of the creation of universal systems and forces. it could also pinpoint the exact moment your idiocy and flaccid intelect exposed itself in glorious fashion to all readers of your comment and nonsensical questions. ....oh! almost forgot....Dogs bite cars",
                "good": "4",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "lycopine",
                "time": "27 July, 2022",
                "context": "geez, that's what many people told the early explorers who navigated the oceans not knowing what was out there.\nOh, and landing on the moon cost how much? Guess what all the research for that program yielded? Used velcro lately? Water purifiers, CAT scanners, LEDS, memory foam to name a few more.",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "frankrazor",
        "time": "22 July, 2022",
        "context": "Christians are saying why spend $ billions on this, just read Genesis in the Bible. ",
        "good": "0",
        "bad": "3",
        "replies": [
            {
                "user_name": "spinynorman262",
                "time": "23 July, 2022",
                "context": "True Christians are marveling at it all.",
                "good": "9",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "frankrazor",
                        "time": "23 July, 2022",
                        "context": "Yeah, but most don't believe science.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "rubiks6",
                                "time": "23 July, 2022",
                                "context": "Your confused, Frank. The word you should use is not “science“ but scientists.”\n\nI’ll bet you don’t know the difference. \n\nY’know, you‘ve walked the Earth for just a few days, you don’t even remember when or how you got here, and yet you actually think you know something. Pshaw.",
                                "good": "0",
                                "bad": "5",
                                "replies": [
                                    {
                                        "user_name": "fibonacci1.618",
                                        "time": "25 July, 2022",
                                        "context": "No, Frank was right. You don't believe science.",
                                        "good": "5",
                                        "bad": "0",
                                        "replies": [
                                            {
                                                "user_name": "rubiks6",
                                                "time": "26 July, 2022",
                                                "context": "No, Frank is wrong.\n\nScience simply seeks knowledge. Apparently, you don’t know that. Perhaps you are a person that doesn’t believe in science. \n\nScientists are human beings that make mistakes, sometimes lie, often disagree with one another and sometimes have motivations other than seeking knowledge. You can’t believe everything you hear just because someone claiming to be a scientist says so. Didn’t you know that?",
                                                "good": "0",
                                                "bad": "3",
                                                "replies": [
                                                    {
                                                        "user_name": "fibonacci1.618",
                                                        "time": "26 July, 2022",
                                                        "context": "Instead of you arrogantly telling me what I know and what I don't know, let me give a glimpse of fact.\nScience is a process of studying the natural world. It involves testing hypotheses with empirical data, and retesting the hypotheses until they are either rejected or become theory. That is the process that scientists use. Yes, scientists are human and can make mistakes, which is why it is a self-correcting process. \n\nThose who criticize scientific findings, including well-established theories such as gravity and biological evolution, are also human but are rarely self-correcting. They tend to go by beliefs, while science is not a belief system.\n\nYou have demonstrated that your belief system overrides the objectivity of the scientific process, which is why Frank was correct. For example, I've seen you write about \"evidence\" for a global flood. There is no such evidence. None, at least not in historic times. What you have done is taken an ancient parable, which is clearly written as a parable, and treated it as history. You then take your belief and shoehorn into the guise of science. That doesn't work.",
                                                        "good": "5",
                                                        "bad": "0",
                                                        "replies": [
                                                            {
                                                                "user_name": "rubiks6",
                                                                "time": "27 July, 2022",
                                                                "context": "The Grand Canyon was created when waters from the global flood drained off the continent very quickly when a dam holding back the inland sea eroded. There’s your evidence. The Grand Canyon is there. You can’t say it isn’t there. You and I have exactly the same evidence. If you choose to interpret that evidence differently, that’s your business, not mine. \n\n(You should look up the word “sedimentary” in a dictionary.) (Wow. The more you talk the more I recognize how poor your English vocabulary is. You just don’t know what many words mean. Are you a high school graduate?)",
                                                                "good": "0",
                                                                "bad": "4",
                                                                "replies": [
                                                                    {
                                                                        "user_name": "lycopine",
                                                                        "time": "27 July, 2022",
                                                                        "context": "LOLOL \nYour knowledge of geology doesn't surpass a 2nd grade rock collector. \nLOLOL",
                                                                        "good": "4",
                                                                        "bad": "0",
                                                                        "replies": []
                                                                    },
                                                                    {
                                                                        "user_name": "fibonacci1.618",
                                                                        "time": "27 July, 2022",
                                                                        "context": "How curious. I never used the word 'sedimentary' in the above post and I'm pretty sure I've never used it in any post I've ever made here. So, for you benefit, I'll use it in its proper context below.\nLet's pretend, and it is just make-believe, that your story of the Grand Canyon formation is true. That leads to some interesting questions. 1) Why is the canyon so meandering? Certainly a torrent of that magnitude would go straight through the rocks below. 2) Although there are many impressive canyons in the world, shouldn't there be more around the globe to drain such a massive flood? 3) There are thousands upon thousands of sedimentary layers making up the walls of the canyon, including shale layers, limestones, sandstones, topped by more limestone and sandstone layers. How did all those layers get there in the mere 1636 years before the Noachian flood? \nPlease use the scientific method to postulate your hypotheses to answer these questions.",
                                                                        "good": "3",
                                                                        "bad": "0",
                                                                        "replies": [
                                                                            {
                                                                                "user_name": "rubiks6",
                                                                                "time": "27 July, 2022",
                                                                                "context": "The sedimentary layers through which the Grand Canyon was cut were laid down in a  single event … the global flood. It was a big flood.",
                                                                                "good": "0",
                                                                                "bad": "4",
                                                                                "replies": [
                                                                                    {
                                                                                        "user_name": "fibonacci1.618",
                                                                                        "time": "27 July, 2022",
                                                                                        "context": "It says nothing about that in my Bible. All those neatly stratified layers in just 40 days of mayhem. That has got to be the goofiest claim I've heard about this parable, and the scientific method could easily disprove it.",
                                                                                        "good": "4",
                                                                                        "bad": "0",
                                                                                        "replies": []
                                                                                    },
                                                                                    {
                                                                                        "user_name": "quietsmith",
                                                                                        "time": "27 July, 2022",
                                                                                        "context": "No liar, that is incorrect. No geologist working anywhere in any university on the planet would tell you that was possible, and anyone who has said that's possible is lying to you safe in the knowledge that you're not educated enough to know better.",
                                                                                        "good": "5",
                                                                                        "bad": "0",
                                                                                        "replies": []
                                                                                    },
                                                                                    {
                                                                                        "user_name": "lycopine",
                                                                                        "time": "28 July, 2022",
                                                                                        "context": "wrong rubbish6.\nMy god commanded your jesus and bible writers do dupe you believers. It is a test to see if you can discern you worship a false idol.\nObviously you can't since you keep spouting the same QANON-sense post after post.",
                                                                                        "good": "0",
                                                                                        "bad": "0",
                                                                                        "replies": []
                                                                                    },
                                                                                    {
                                                                                        "user_name": "lycopine",
                                                                                        "time": "28 July, 2022",
                                                                                        "context": "LOLOLOLOL\nSuch a scientific response.\nAbsolutely hilarious!!!",
                                                                                        "good": "1",
                                                                                        "bad": "0",
                                                                                        "replies": []
                                                                                    }
                                                                                ]
                                                                            }
                                                                        ]
                                                                    }
                                                                ]
                                                            }
                                                        ]
                                                    },
                                                    {
                                                        "user_name": "quietsmith",
                                                        "time": "26 July, 2022",
                                                        "context": "Science is indeed a process that seeks knowledge, and it is because of that that you despise science with every fiber of your being since you think creationism is \"real\" science and since real science is in conflict with creationism, you have to pretend everyone is lying.\n\nThe creationists are the ones who are lying and they know they are lying. There's a reason the Discovery Institute had to be forced to turn over old version of their own literature where it became completely obvious that all they had done was rename creationism into something else then lie about it. \n\nCreationists have to lie, which is why they do.\n\nScientists don't have to lie, and if they did, the peer review process would destroy them.",
                                                        "good": "3",
                                                        "bad": "0",
                                                        "replies": []
                                                    }
                                                ]
                                            }
                                        ]
                                    },
                                    {
                                        "user_name": "lycopine",
                                        "time": "27 July, 2022",
                                        "context": "Y'know, you believe in an invented imaginary super being existence. Yet you think it's the one and only. Pshaw.",
                                        "good": "0",
                                        "bad": "1",
                                        "replies": [
                                            {
                                                "user_name": "rubiks6",
                                                "time": "27 July, 2022",
                                                "context": "Ohhhh! LOL\n\nYou looked up “pshaw” in the dictionary! Now you too can use it. It’s fun to learn new words, isn’t it, liposuction?",
                                                "good": "0",
                                                "bad": "4",
                                                "replies": [
                                                    {
                                                        "user_name": "beadgBass",
                                                        "time": "28 July, 2022",
                                                        "context": "You don't sound very Christian. You sound spiteful and haughty.",
                                                        "good": "0",
                                                        "bad": "0",
                                                        "replies": [
                                                            {
                                                                "user_name": "rubiks6",
                                                                "time": "28 July, 2022",
                                                                "context": "\"You don't sound very Christian.\"\n\nSo, what stereotype were you expecting me to fit into?",
                                                                "good": "0",
                                                                "bad": "0",
                                                                "replies": []
                                                            }
                                                        ]
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            },
                            {
                                "user_name": "the_engineer",
                                "time": "1 August, 2022",
                                "context": "Wrong. Try meeting more Christians. Most do believe in science.",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "user_name": "quietsmith",
                        "time": "23 July, 2022",
                        "context": "We have at least three Christians who post here regularly who think science is one big evil conspiracy.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "the_engineer",
                                "time": "1 August, 2022",
                                "context": "As long as science does not purport to prove or disprove God, there is no conflict between science (the study of what God created) and religion (the study of how God expects us to behave).",
                                "good": "0",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "quietsmith",
                                        "time": "1 August, 2022",
                                        "context": "Science a process, and it has nothing to do with any gods, because there's nothing to test or measure, science cannot tell you one way or the other anything about them.\n\nAnd religion is not the study of anything, religion is just a set of beliefs, and there are many religions.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "user_name": "lycopine",
                        "time": "27 July, 2022",
                        "context": "what's a \"true\" christian?",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "spinynorman262",
                                "time": "27 July, 2022",
                                "context": "One who follows the teachings of Jesus Christ. That does not necessarily include adherence to Biblical inerrancy.",
                                "good": "4",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "mintaslanxor5",
                                        "time": "22 August, 2022",
                                        "context": "That has since changed to Jesus GOP and Donald Christ.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "the_engineer",
                "time": "1 August, 2022",
                "context": "Christians know that the Bible is not a science textbook. It is not attempt to explain the details of creation, it just lets you know that God is the one responsible for creation. Science can work out, as it goes along, the details of the rules God set out to create and run the universe.",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "thomjefferson",
        "time": "22 July, 2022",
        "context": "They are traveling back in time to Pelosi's birth.",
        "good": "9",
        "bad": "7",
        "replies": [
            {
                "user_name": "dan5047628",
                "time": "22 July, 2022",
                "context": "That was a more accurate statement then anything in the article",
                "good": "1",
                "bad": "7",
                "replies": [
                    {
                        "user_name": "letsgetrel",
                        "time": "22 July, 2022",
                        "context": "I doubt you are qualified to judge the accuracy of the article.\nJulia Musto does a great job of summing things up.",
                        "good": "6",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "quietsmith",
                                "time": "23 July, 2022",
                                "context": "Dan there thinks basically all science is a big evil conspiracy against Jesus.",
                                "good": "1",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "dan5047628",
                                        "time": "26 July, 2022",
                                        "context": "No, actually I love science. I just hate scientist that Lie for a living",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": [
                                            {
                                                "user_name": "quietsmith",
                                                "time": "26 July, 2022",
                                                "context": "Well, you're in luck.\n\nBecause creationists are not scientists so you don't have to be concerned that they lie for a living I guess.",
                                                "good": "1",
                                                "bad": "0",
                                                "replies": []
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "user_name": "quietsmith",
                        "time": "23 July, 2022",
                        "context": "Here to jump in and cry about science being a big evil conspiracy against Jesus huh?",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "ccstraycat",
        "time": "22 July, 2022",
        "context": "There are no doubt galaxies far too distant to be detectable.  And when/if the technology arrives where they can be detected, they'll have to once again revise the age of the universe, which I suspect is much older than current estimates.",
        "good": "2",
        "bad": "0",
        "replies": [
            {
                "user_name": "fibonacci1.618",
                "time": "22 July, 2022",
                "context": "That is the grand beauty of science, as we push the limits of knowledge ever further.",
                "good": "5",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "Higgenbottom",
                        "time": "22 July, 2022",
                        "context": "Waste time and money for what?  Absolutely NOTHING!",
                        "good": "0",
                        "bad": "6",
                        "replies": [
                            {
                                "user_name": "fibonacci1.618",
                                "time": "22 July, 2022",
                                "context": "Knowledge and understanding is never \"NOTHING!\"\nGoing to  cricket match is nothing, but some people enjoy it.",
                                "good": "7",
                                "bad": "0",
                                "replies": []
                            },
                            {
                                "user_name": "lycopine",
                                "time": "27 July, 2022",
                                "context": "geez, that's what many people told the early explorers who navigated the oceans not knowing what was out there.\nOh, and landing on the moon cost how much? Guess what all the research \nfor that program yielded? Used velcro lately? Water purifiers, CAT \nscanners, LEDS, memory foam to name a few more.",
                                "good": "2",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "lycopine",
                "time": "27 July, 2022",
                "context": "It was not that long ago human observations didn't get beyond the Milky Way.",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "posttenebraslux",
                "time": "10 August, 2022",
                "context": "It's not a technology issue.   There are galaxies that are too distant to be detectible because they are too far away so that light from them has yet to arrive at the Earth",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "thomaswinslow009",
        "time": "24 July, 2022",
        "context": "The US is about to experience a Redshift this November.",
        "good": "7",
        "bad": "5",
        "replies": [
            {
                "user_name": "dan5047628",
                "time": "26 July, 2022",
                "context": "God loves colors",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "lycopine",
                        "time": "27 July, 2022",
                        "context": "remind us which of the 10,000+ documented gods you are referring to again?",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "mintaslanxor5",
                        "time": "22 August, 2022",
                        "context": "Except black and brown - according to the likes of you.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "mintaslanxor5",
                "time": "22 August, 2022",
                "context": "That redshift is contrary to the laws of physics because those involved in it are moving back in time - to about the Middle Ages.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "mike3976",
        "time": "27 July, 2022",
        "context": "Should concentrate more on bringing fusion into a viable source of electricity.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "lycopine",
                "time": "27 July, 2022",
                "context": "it is being done.  A reaction was sustained for about 20 seconds at the Japanese tokamak in the last 12 months.",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "posttenebraslux",
                "time": "10 August, 2022",
                "context": "Completely different field of science.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "quietsmith",
        "time": "23 July, 2022",
        "context": "To boldly go... even if we can only look.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "keepitsimple082",
        "time": "24 July, 2022",
        "context": "In the begining .... oh you know that right?",
        "good": "1",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "truckrunnr",
        "time": "28 July, 2022",
        "context": "They could just ask nancy ppelosi. She was around then.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "foxynewser450",
        "time": "23 July, 2022",
        "context": "Those are some stellar images!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "siriusdogstar079",
        "time": "23 July, 2022",
        "context": "Why hasn't it taken pictures of the pillars supporting the Earth that God told us were there in the Bible?",
        "good": "0",
        "bad": "2",
        "replies": [
            {
                "user_name": "keepitsimple082",
                "time": "24 July, 2022",
                "context": "the pillars are figurative. 💡😁🤔 ",
                "good": "0",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "abide842",
                        "time": "26 July, 2022",
                        "context": "The whole Bible is figurative.",
                        "good": "2",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "DarwinIsStillRight",
                        "time": "26 July, 2022",
                        "context": "So is the whole \"God\" bit . .",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "Literally1",
                "time": "25 July, 2022",
                "context": "Because the earth is flat and everybody knows the pillars are really elephants, and they are standing on the back of a giant turtle...",
                "good": "2",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "dan5047628",
        "time": "26 July, 2022",
        "context": "Are these pictures worth 10 Billion dollars?\n10 Billion dollars10 Billion dollars10 Billion dollars10 Billion dollars10 Billion dollars10 Billion dollars10 Billion dollars10 Billion dollars10 Billion dollars10 Billion dollars10 Billion dollars",
        "good": "0",
        "bad": "3",
        "replies": [
            {
                "user_name": "DarwinIsStillRight",
                "time": "26 July, 2022",
                "context": "Science is priceless ..",
                "good": "2",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "quietsmith",
                        "time": "27 July, 2022",
                        "context": "But you don't understand, science keeps getting in the way of creationist nonsense.",
                        "good": "2",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "beadgBass",
                "time": "26 July, 2022",
                "context": "What we learn from these pictures is immeasurable.",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "quietsmith",
                "time": "27 July, 2022",
                "context": "Oh the person who hates science and thinks its all one big evil conspiracy against Jesus is here.",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "posttenebraslux",
                "time": "10 August, 2022",
                "context": "Person decries science using a computer that is the product of science!",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "mintaslanxor5",
                "time": "22 August, 2022",
                "context": "Dan the Man: I'm pretty sure you and your co-religionists are at a point where not even 10 billion dollars of research could fix your scrubbed-brain condition.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    }
]