[
    {
        "user_name": "CMAN1980",
        "time": "15 June, 2022",
        "context": "Eventually it's gonna have to be released.  It's only a matter of time before we make contact.",
        "good": "6",
        "bad": "0",
        "replies": [
            {
                "user_name": "eventually",
                "time": "21 June, 2022",
                "context": "Have you read the daily headlines?   Why would an advanced race want to have contact with humans?   We are a violent species with no regard for life or the planet earth.   So the answer to the question \"Is there any intelligent life on Earth?\"  is simply \"No\".",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "Dangerfield508",
                        "time": "24 June, 2022",
                        "context": "The only conclusion I have to that is that it's always been aliens hiding controlling everything... they are not sneaking around to gain intelligence on invading lol.... they are maintaining.",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "concerned_conservative668",
        "time": "15 June, 2022",
        "context": "That dish is straight out of a James Bond film...and it's creators just as nefarious as any super-villain...",
        "good": "7",
        "bad": "0",
        "replies": [
            {
                "user_name": "Anindependentthought",
                "time": "15 June, 2022",
                "context": "I though it was in South America?",
                "good": "1",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "yeahokbuddy",
                        "time": "16 June, 2022",
                        "context": "I think that dish actually fell apart.",
                        "good": "1",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "constructionist1776",
                                "time": "17 June, 2022",
                                "context": "You’re both thinking of the Arecibo dish in Puerto Rico.  It didn’t fall apart but was damaged when two cables broke and after being in service since 1963 was decommissioned in 2020.",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "nancypelosisdamagedbrain3",
                "time": "15 June, 2022",
                "context": "Dr. Evil......",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "constructionist1776",
                "time": "17 June, 2022",
                "context": "Actually looks an awful lot like Arecibo in Puerto Rico which was built in 1963 and recently decommissioned in 2020.  The Chinese built this one to be slightly larger than Arecibo so they could have the largest radio telescope in service.  If they had waited a few years they could have saved some money.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "Anindependentthought",
        "time": "15 June, 2022",
        "context": "If you don’t believe there is life on other planets then I feel sorry for you",
        "good": "5",
        "bad": "2",
        "replies": [
            {
                "user_name": "randy4usa",
                "time": "17 June, 2022",
                "context": "I don't need your sympathy, actually pretty comfy with my beliefs.",
                "good": "0",
                "bad": "1",
                "replies": []
            },
            {
                "user_name": "tommysolo046",
                "time": "23 June, 2022",
                "context": "If you actually believe that there is intelligent life on other planets without a shred of proof/evidence then I feel sorry for YOU!!",
                "good": "0",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "rayj785",
        "time": "15 June, 2022",
        "context": "Can you imagine aliens landing in the US and saying \"Take me to your leader\"? How embarrassing!",
        "good": "36",
        "bad": "3",
        "replies": [
            {
                "user_name": "Dangerfield508",
                "time": "15 June, 2022",
                "context": "Lol",
                "good": "5",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "Anindependentthought",
                "time": "15 June, 2022",
                "context": "They’d say “never mind”",
                "good": "9",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "robert338",
                "time": "15 June, 2022",
                "context": "I would tell them to come back in a few years, we don't have one right now.",
                "good": "18",
                "bad": "1",
                "replies": []
            },
            {
                "user_name": "minuteman78",
                "time": "16 June, 2022",
                "context": "I can see them saying \"Joe get back in the car, you've done enough... sorry folks he gets away once in a while\"....",
                "good": "3",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "hometheaterguy",
        "time": "15 June, 2022",
        "context": "The cover up continues.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Dangerfield508",
        "time": "15 June, 2022",
        "context": "I'm 42 and something inside tells me the 👽s will make themselves known and the world will witness the truth during this lifetime. When I was 9 they showed me twice what they can do in their ships. First time I thought they were just three stars I was staring at but then they abruptly started zooming around each other like fireflies. A few days later, something that looked like a shiny, silver, metallic, hourglass on its side just hovered over my front lawn for 15 mins. I ran to show my father but once I got his attention of course it was gone. I don't recall ever seeing anything quite like that again. My grandfather and uncle were on the Mulberry river in Arkansas and they witnessed what they called a fireball, as big as a house, come down out of the sky and skimmed across the water. I think they come from within the earth mostly, or under the oceans.",
        "good": "9",
        "bad": "2",
        "replies": [
            {
                "user_name": "robert338",
                "time": "15 June, 2022",
                "context": "Never used to really believe, however my son was going to college to be an Astrophysicist and when he started, we watched the space station fly overhead when we could. Then I was watching the sky every time I could at night just so I could talk to him about things he was learning. A couple of times I see a light in the sky traveling at a speed like the space station would do but it was going the opposite direction, then it stopped and darted off at incredible speed the complete opposite direction it was traveling at first. I have no idea what it was either time, but it wasn't a plane. When you look at all the planets we can see, it would be impossible to think we are alone in the universe.",
                "good": "9",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "Dangerfield508",
                        "time": "16 June, 2022",
                        "context": "That is exactly how they move. I have seen that a couple times myself since I was a child but those first two were mind melting compared to the recent stuff.",
                        "good": "1",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "Dangerfield508",
                                "time": "16 June, 2022",
                                "context": "After those initial sightings, I got this idea from nowhere one day walking towards our pond. It was an inner voice, 9 years old mind you, that said word for word: \"all the religions have been corrupted and it is up to you to find the truth.\"",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "eternal1984",
                "time": "16 June, 2022",
                "context": "I don't these unexplained events are all the same kind of phenomena. The kinds of technology they display indicate disparate origins. Earth may have attracted the attention of more than one kind of non-human intelligence which are as far above us as we are to some lower life form than us- crows or cats perhaps. \nWe may need our AIs that are now in development just to communicate with them and bargain with them on our behalf. Unfortunately, I don't think we have anything to offer other than our water covered planet itself and Earth's biological diversity which is what they are probably most interested in.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "Dangerfield508",
                        "time": "16 June, 2022",
                        "context": "I have studied this subject my whole life it seems. I can only come to the conclusion they already rule the planet and only a handful of Earth's leaders are aware of it. This was always the case in ancient times. What we call aliens use us as slaves but we civilians are not privy to this info.",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "YerOneinAmillion",
                "time": "20 June, 2022",
                "context": "That was me.  Take me to your leader. Wait...your LAST leader.  Him, I like.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "donmartin'sbigtoe",
        "time": "15 June, 2022",
        "context": "I remember when we dreamed big and built big.",
        "good": "2",
        "bad": "0",
        "replies": [
            {
                "user_name": "fibonacci1.618",
                "time": "16 June, 2022",
                "context": "We still do.",
                "good": "3",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "donmartin'sbigtoe",
                        "time": "16 June, 2022",
                        "context": "Such as? What spectacle have we built since the Gateway Arch? Are we replacing Aricebo? What was the last thing we did that no one else can do?",
                        "good": "0",
                        "bad": "2",
                        "replies": [
                            {
                                "user_name": "fibonacci1.618",
                                "time": "16 June, 2022",
                                "context": "Landing and deploying rovers on Mars, the James Webb Space Telescope to name a few.",
                                "good": "3",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "donmartin'sbigtoe",
                                        "time": "16 June, 2022",
                                        "context": "Robots, not men. Looking, not going. Those are both cool enough, but they are small things concerning a few people in dim rooms. And neither make a real difference.",
                                        "good": "0",
                                        "bad": "3",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "kirkland007",
        "time": "15 June, 2022",
        "context": "The big elephant in the room has to be seen sooner or later can’t hide forever….",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "donmartin'sbigtoe",
        "time": "15 June, 2022",
        "context": "The Chinese could be conversing with aliens right now, and for years before we find out. We need to stop bickering and start building the future.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bosley1",
        "time": "15 June, 2022",
        "context": "they did not want to offend biden and aoc by calling them aliens",
        "good": "4",
        "bad": "2",
        "replies": [
            {
                "user_name": "robert338",
                "time": "15 June, 2022",
                "context": "You would be insulting Aliens if you called then that.",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "jeffh987",
        "time": "15 June, 2022",
        "context": "This just in: The professor who originally posted about this is nowhere to be found.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "del20",
        "time": "15 June, 2022",
        "context": "Humongous wok. Fried rice for everybody tonight.",
        "good": "14",
        "bad": "2",
        "replies": [
            {
                "user_name": "henriclaude",
                "time": "16 June, 2022",
                "context": "brilliant work, grasshopper..",
                "good": "2",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "Brylcream_Boomer",
                "time": "16 June, 2022",
                "context": "Imagine the amount of coal needed to get the oil hot enough to cook!",
                "good": "1",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "unclefess923",
        "time": "15 June, 2022",
        "context": "I would be highly surprised if we were alone in the universe. There is no explanation for life here that would not open the same likelihood elsewhere. Evolutionists definitely believe in the possibility and I would ask creationists if they thought all those stars were put there by God for us to look at at night? The Bible is chock-full of extraterrestrials.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "Thalvor",
                "time": "15 June, 2022",
                "context": "We are aliens to the aliens, and they most likely have to deal with the same constraints as we do, so chances are, they are not able to travel faster than the speed of light and have the same politics and economics plague them as well. If we found aliens, I have a feeling we'd both get excited, hoping the other had answers to all the questions, just to find out otherwise.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "DefecatingInTheLeftsMouth",
        "time": "15 June, 2022",
        "context": "We can't call them aliens..................",
        "good": "3",
        "bad": "1",
        "replies": [
            {
                "user_name": "speedyone",
                "time": "15 June, 2022",
                "context": "Undocumented galaxy crossers?",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "Mr8ch855",
                        "time": "16 June, 2022",
                        "context": "Undocumented Extra-Terrestrial Asylum-Seekers",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "DefecatingInTheLeftsMouth",
                "time": "16 June, 2022",
                "context": "I don't think you can use the term \"undocumented\" anymore.  New earthlings?",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "Thalvor",
        "time": "15 June, 2022",
        "context": "It has something like a 90+% of being something not beyond Earth, and less than 1% chance it's not done by a natural source. That's why it was taken down, it didn't even go past 3 deviations, which would be required for it to even be considered for further investigation.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "rww0810",
                "time": "17 June, 2022",
                "context": "Thanks Xi Jinping \nHappy to know you are on top of it for the rest of us.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "sjmaus",
        "time": "15 June, 2022",
        "context": "we're just a reality show on the galactic network.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sgttrump",
        "time": "15 June, 2022",
        "context": "The astronomers said they accidentally pointed the dish at the white house.  So it's actually a true story.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "waclaw501848",
        "time": "15 June, 2022",
        "context": "It could be nothing or a \"look here\" distraction while China is beefing up its nuclear arsenal. They may be advising Biden to use a similar method and use January 6 to turn away attention from his continuing failures. LOL.",
        "good": "2",
        "bad": "1",
        "replies": [
            {
                "user_name": "fibonacci1.618",
                "time": "16 June, 2022",
                "context": "Most of us can walk and chew gum at the same time. This 'distraction' excuse is nonsense.",
                "good": "4",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "steve1633",
        "time": "15 June, 2022",
        "context": "To say that statistically, it is impossible that Earth alone has intelligent life is not PROOF.  Like when Republicans say statistically it is impossible Biden beat Trump, Democrats quickly counter that does not constitute PROOF that Trump won.   Oh, sorry, that does not fit the lefty agenda.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "DefecatingInTheLeftsMouth",
        "time": "15 June, 2022",
        "context": "That's because they were picking up \"Mexican Radio\"",
        "good": "4",
        "bad": "0",
        "replies": [
            {
                "user_name": "Thalvor",
                "time": "15 June, 2022",
                "context": "I haven't thought about that song, in 20+ years",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "SpamCaller",
                "time": "16 June, 2022",
                "context": "Love that song and video.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "DefecatingInTheLeftsMouth",
                        "time": "16 June, 2022",
                        "context": "That's the first thing I though of!  That was in the mid 80's!",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "ArneSaknussem",
                "time": "17 June, 2022",
                "context": "I looked up that song, and upon hearing it was like \"I remember that!\"\nThen I thought, \"Man, I'm getting old.\"",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "nancysuckschuck",
        "time": "15 June, 2022",
        "context": "Floating a trial balloon?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "23golf.",
        "time": "15 June, 2022",
        "context": "if they eat the Chinese first they'll be hungry again in an hour.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "honest2god",
        "time": "15 June, 2022",
        "context": "Hunter's overseas again collecting the cash for himself and the 'big guy.'",
        "good": "3",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "2fishfolk",
        "time": "15 June, 2022",
        "context": "to quote the famous line, \"the truth is out there\". but as long as we have democrats we will never hear it.",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "thatParrotsDead",
        "time": "15 June, 2022",
        "context": "what does Beijing Abnormal University say?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "yo666",
        "time": "15 June, 2022",
        "context": "The Chinese always good for a laugh.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "teedee111",
        "time": "15 June, 2022",
        "context": "They will revisit that story once they negotiate a deal to buy out the aliens.......",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "robert338",
        "time": "15 June, 2022",
        "context": "China is not saying it heard Aliens, but it heard aliens.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "realistinmotion",
                "time": "15 June, 2022",
                "context": "so Heard is trying news things to make a buck after her failed attempt to rob Depp didn't work out?",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "kjm339",
        "time": "15 June, 2022",
        "context": "They were looking for intelligent life, but then they saw Trump as president and moved on......",
        "good": "0",
        "bad": "3",
        "replies": [
            {
                "user_name": "russianconspiracies",
                "time": "15 June, 2022",
                "context": "Wow. Talk about TDS. Trump isn't president.",
                "good": "3",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "gsxs1000",
                "time": "16 June, 2022",
                "context": "Don't worry he will be back. Next time I hope all you libs off yourselves in desperation. The country will be a much nicer place to live.",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "jplunkett",
        "time": "15 June, 2022",
        "context": "A year and a half ago - two years ago I saw something in the early morning hours well before the sun came up that I couldn't explain. I then researched and found out it was Elon Musk's Starlink.",
        "good": "0",
        "bad": "5",
        "replies": [
            {
                "user_name": "onfulldisplay",
                "time": "15 June, 2022",
                "context": "Bet that was shocking and interesting to witness!",
                "good": "1",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "MiBear",
                "time": "16 June, 2022",
                "context": "I did the same thing…When he first started launching the Star-Link satellites, I was camping in a cabin on the beach of Lake Huron in Mackinaw City, Michigan. I took my telescope out on the beach around midnight and all of a sudden, I saw a long string of crafts going though the sky! I didn’t have any idea what the star link satellites were at the time. I thought for sure I was looking at UFO’s. It was pretty exciting, until I found out what it was☹️",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "bellamarie",
                "time": "17 June, 2022",
                "context": "YOU SOUND OLD LIKE 60'S I put in caps so u can read",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "jsr0008",
        "time": "15 June, 2022",
        "context": "Whoa...they get a signal from Cher?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "thunker54",
        "time": "15 June, 2022",
        "context": "Of course there is alien life! We have it flooding our southern border daily. And 99% of those aliens are ILLEGAL.",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "tarzonqwerty",
        "time": "15 June, 2022",
        "context": "The aliens are here already. Google's latest A.I. confirmed it.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "nancypelosisdamagedbrain3",
        "time": "15 June, 2022",
        "context": "Whether there is life visiting us from other planets, or they live under the ocean or underground, or if they are even US from the future, who figured out Einstein's time travel mystery.  There is something there, and eventually, we will figure it out, and hopefully if it is Aliens from another planet, they will take Biden, Kamala, AOC, Nancy, Chuck etc. with them, when they leave!!!!",
        "good": "2",
        "bad": "1",
        "replies": [
            {
                "user_name": "kjm339",
                "time": "15 June, 2022",
                "context": "They are hiding behind the moon, everyone knows that!",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "error": "error"
    },
    {
        "user_name": "dan5047628",
        "time": "16 June, 2022",
        "context": "Maxine Waters is an Alien, ask her",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mydog'shumandaddy",
        "time": "17 June, 2022",
        "context": "The Chinese would probably harvest and eat them if they could.....",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Brylcream_Boomer",
        "time": "16 June, 2022",
        "context": "Lets face it. \n\nEarth is nothing more than an Intergalactic Roadside Greasy Spoon Diner that Aliens use when they need a break from the road.   They apparently consume Human Life Force Energy and  explains why 150,000 people die each day on this planet. The Wuhan Pandemic was nothing more than a large carry out order.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "specter*619",
        "time": "17 June, 2022",
        "context": "They're here!!!! they're already here!!!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "minuteman78",
        "time": "16 June, 2022",
        "context": "I think we knew this already.... Biden and his team cannot possibly be from earth.",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "cancunjon",
        "time": "16 June, 2022",
        "context": "Would anyone really WANT someone from another planet to come visit us with all of the insanity going on? Not only would it be humiliating to be part of this planet, but the aliens would be dragged into a political hot mess. If there is intelligent life outside this planet they're smart enough to stay away until we grow up. I find it more likely that China is playing the same distraction games that the US does to keep people's mind's off of the lockdowns and corruption. Congress just tried to get our attention with another \"UFO\" report.. but it wasn't enough to make people forget about the mess we're in.",
        "good": "0",
        "bad": "1",
        "replies": [
            {
                "user_name": "penguinsfan87",
                "time": "16 June, 2022",
                "context": "No they would just wipe us out.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "spaceman204",
        "time": "16 June, 2022",
        "context": "so is this the next big distraction , Aliens ?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "colonel_angus595",
        "time": "16 June, 2022",
        "context": "These are the same people in charge of the Wuhan lab. I think I'll wait for a more credible source.",
        "good": "0",
        "bad": "5",
        "replies": [
            {
                "user_name": "sciencerocks",
                "time": "16 June, 2022",
                "context": "Not the same people, and the Wuhan Lab does important and valuable work.",
                "good": "3",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "primal_battle",
                        "time": "16 June, 2022",
                        "context": "Not important enough for my tax dollars to finance their plandemic!",
                        "good": "1",
                        "bad": "1",
                        "replies": [
                            {
                                "user_name": "sciencerocks",
                                "time": "16 June, 2022",
                                "context": "Then you don't have to worry.",
                                "good": "0",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "primal_battle",
                                        "time": "16 June, 2022",
                                        "context": "That would require being as naive as you.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "usnavywarhead552",
        "time": "16 June, 2022",
        "context": "Seems China really wants to end human life on this earth.",
        "good": "2",
        "bad": "1",
        "replies": [
            {
                "user_name": "gmonroe887",
                "time": "17 June, 2022",
                "context": "Given their population of 1.4 billion, you're not making your point well.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "usnavywarhead552",
                        "time": "21 June, 2022",
                        "context": "Considering they're propensity to unleash viruses across the global from their virus infested country....",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "fixento104",
        "time": "16 June, 2022",
        "context": "If they receive any signals, they were transmitted thousand of years ago.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jamesh.humperdinck,xix",
        "time": "17 June, 2022",
        "context": "The aliens sent the message, please stay at home, we don't want you!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Feelingmyage",
        "time": "16 June, 2022",
        "context": "If aliens land and ask \"Take me to your leader\", I'm not sure we have a response............",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "mydog'shumandaddy",
                "time": "17 June, 2022",
                "context": "Kim Kardashian",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "Feb14,1859",
        "time": "16 June, 2022",
        "context": "Image 3 of 3\nThe House Intelligence committee will hold a public hearing on UFOs Tuesday, May 17, 2022. (Fox News)\nYou are a month late FOX.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bidimwit",
        "time": "16 June, 2022",
        "context": "NO! We can't find aliens! Joe will start sending them our tax dollars!",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "smalltown509",
        "time": "16 June, 2022",
        "context": "If aliens did come, where would they be looking for signs of intelligent life?",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "GunsnBible",
                "time": "16 June, 2022",
                "context": "Certainly not the White House or the DNC.",
                "good": "4",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "lostlink_returns",
        "time": "16 June, 2022",
        "context": "Aliens? Yeah, unrestricted crossing the US southern border.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "smithres",
        "time": "16 June, 2022",
        "context": "China finds alien life \"WITH GIANT WOK\". The aliens seemed partial to the \"Sum dum chic\" dish. Woke is fuming....Biden blames it on Trump.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "YtuMamaTambien",
        "time": "17 June, 2022",
        "context": "It doesn't matter.  We are alone.",
        "good": "3",
        "bad": "3",
        "replies": [
            {
                "user_name": "fullspeedahead",
                "time": "17 June, 2022",
                "context": "Science does not support your assumption",
                "good": "0",
                "bad": "3",
                "replies": [
                    {
                        "user_name": "gmonroe887",
                        "time": "17 June, 2022",
                        "context": "Science does not support any conclusions on this question.  It's a complete unknown, which is why it's of so much interest to find independently started life on Mars, Enceladus, Europa, etc.",
                        "good": "2",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "YtuMamaTambien",
                        "time": "17 June, 2022",
                        "context": "Have you ever seen an alien?  Do you have a pen pal from Alpha Centauri?",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "EEngr=mc^2",
                        "time": "17 June, 2022",
                        "context": "Science is NOT feelings.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "stmarsaille",
                        "time": "18 June, 2022",
                        "context": "Did science prove there is life elsewhere?  I must have missed that.  The fact is, science doesn't know either way.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "EEngr=mc^2",
                "time": "17 June, 2022",
                "context": "That's right.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "quietsmith",
        "time": "17 June, 2022",
        "context": "Any civilization advanced enough to visit earth from another planet would be advanced enough to go undetected while doing so.\n\nIf they don't want to be seen you'd never see them.\n\nIf they do, they'd land and introduce themselves. \n\nI just do not understand why people think a super advanced civilization would be sneaking around trying not to get caught and keep screwing it up.",
        "good": "2",
        "bad": "2",
        "replies": [
            {
                "user_name": "DeplorableUltraMAGASemiFascist",
                "time": "17 June, 2022",
                "context": "Introduce themselves LOL \"Hi I am Golabutastic and this is the co-captain Nefarnefi and we are from the planet Ulmaististsington.  It's been a long drive, could we get a beer?  And I gotta wiz like a Russian race horse.\"",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "gmonroe887",
                "time": "17 June, 2022",
                "context": "Indeed, all those grainy photos of spaceships decades ago when few had cameras that could instantly snap a good picture, it's been asked why we haven't seen more of them now that everybody has a cell phone with a high-resolution camera.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "quietsmith",
                        "time": "18 June, 2022",
                        "context": "Aliens, bigfoot, lochness monster, anything to do with gods...\n\nThere's always an inverse relationship between the ability to properly record things and sightings.\n\nOr as somebody said about bigfoot.\n\nShow us a body or show us one in a cage, anything other than one of those two things is nonsense.",
                        "good": "1",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "gmonroe887",
                                "time": "18 June, 2022",
                                "context": "Well said!",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "overtorqued",
                "time": "18 June, 2022",
                "context": "They're probably worried China, with the help of Fauci, have already created an alien virus.",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "randy4usa",
        "time": "17 June, 2022",
        "context": "They should fill that dish up with chicken and rice, world's biggest wok.",
        "good": "6",
        "bad": "0",
        "replies": [
            {
                "user_name": "jamesh.humperdinck,xix",
                "time": "17 June, 2022",
                "context": "A question for a math major would be: how much Kung Pao chicken could that large wok make? If the space thing doesn't work out, they could become the world's largest Chinese restaurant!",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "fibonacci1.618",
        "time": "16 June, 2022",
        "context": "The probability of there being life out there is exceptionally high. Whether or not there is intelligent life out there is another question, as we barely have intelligent life here on Earth, and it evolved quite recently. Extraterrestrial civilizations that can travel this far? There the chances shrink to just a small fraction above zero.",
        "good": "14",
        "bad": "3",
        "replies": [
            {
                "user_name": "mydog'shumandaddy",
                "time": "17 June, 2022",
                "context": "Maybe....maybe not.....since we relate everything to our own realities and can't possibly even imagine all the variations that might exist out there.....",
                "good": "0",
                "bad": "3",
                "replies": [
                    {
                        "user_name": "sciencerocks",
                        "time": "23 June, 2022",
                        "context": "We can try.",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "gmonroe887",
                "time": "17 June, 2022",
                "context": "The probability of life elsewhere is a complete unknown at this point.  Saying otherwise is mere speculation.",
                "good": "2",
                "bad": "4",
                "replies": [
                    {
                        "user_name": "fibonacci1.618",
                        "time": "17 June, 2022",
                        "context": "There are many principles of physics and chemistry that make it likely.",
                        "good": "4",
                        "bad": "1",
                        "replies": [
                            {
                                "user_name": "gmonroe887",
                                "time": "17 June, 2022",
                                "context": "Likely?  Not really.  We know it happened, but we are the result of it, so we cannot determine how rare it is.  Sure, we know that RNA was a likely early stage, but we have no idea how many times you need to roll the dice to make it work.  That is the part we do not know how rare it is.  Nobody knows the steps needed for abiogenesis.  It could happen easily, or it could require and extraordinarily rare set of molecular events, requiring trillions of planets like earth before it happened.  We do not know.  And assigning \"likely\" or \"unlikely\" is mere speculation.\n\nIf we find life had independently started on Mars, or a signal from an intelligent civilization, for example, it would change that calculation drastically.  But that has not happened yet.",
                                "good": "0",
                                "bad": "4",
                                "replies": [
                                    {
                                        "user_name": "ArneSaknussem",
                                        "time": "17 June, 2022",
                                        "context": "There is a vast amount of scientific literature on why life elsewhere is likely, coming from astronomers, exobiologists, biochemists studying the origin of life on Earth, mathematicians studying complexity theory, and even my fellow geneticists.\nIt is speculation in that ALL scientific hypotheses are speculations based on what we know. This one is just extraordinarily difficult to test. But absence of evidence is not evidence of absence. For example, in 1871 Charles Darwin \"speculated\" that human ancestors evolved in Africa, based upon our morphological similarities to the African hominoidea. That was basically an hypothesis, first confirmed by fossil evidence, and then further confirmed by genetic evidence.\nYou hit upon a good point, though, when you wrote that we \"can't possibly even imagine all the variations that might exist out there.....\" True, but we know the possibilities are endless. Life outside Earth need not have a basis in anything similar to our genetic system other than self reproducibility.\nAs 'Bones' put it, \"It's life Jim, but not as we know it.",
                                        "good": "2",
                                        "bad": "1",
                                        "replies": [
                                            {
                                                "user_name": "gmonroe887",
                                                "time": "17 June, 2022",
                                                "context": "None of what you say leads credence to either \"likely\" vs \"unlikely\".  Sure, we know that early chemistry on earth, with the moon in lower orbit causing huge tides causing mixing over active volcanoes, created a rich soup of possibilities.  The problem is, nobody has figured out any reasonable path by which we get to the simplest organisms we have today where ribosomes allow for the matching of particular amino acids according to a three 4-base code.  For all we know, it could have required a super extraordinary coincidence to set up that basic mechanism which itself is the basis for evolution.\n\nWe have not found evidence that life started more than once on earth, which might have been evident from, say, different encoding methods.  All life on earth uses essentially the same codon table to manufacture proteins.\n\nSaying that trillions of earth-like planets in billions of galaxies likely have amino acids floating around doesn't overcome this difficulty.  It leaves us with NO reasonable statement about if life is likely very abundant in the universe, or if life would rarely even appear at all in a universe like ours, as it's not clear that our big bang universe is the only time it evern happened.  Could be trillions of universes had no life at all, even if all of its laws of physics were like ours.\n\nThere was a big effort by distinguished interdisciplinary scientists to come up with best guesses for each factor in the famous \"Drake equation\", but that was all speculation.",
                                                "good": "0",
                                                "bad": "1",
                                                "replies": [
                                                    {
                                                        "user_name": "ArneSaknussem",
                                                        "time": "17 June, 2022",
                                                        "context": "All I ask is that you read more of the literature if you are going to be so dismissive. And, by the way, pretty much the only way abiogenesis works is that life started more than once.",
                                                        "good": "1",
                                                        "bad": "1",
                                                        "replies": [
                                                            {
                                                                "user_name": "gmonroe887",
                                                                "time": "17 June, 2022",
                                                                "context": "Actually, I've read quite a bit of the literature.\n\nNobody has suggested that abiogenesis needs life to have started more than once.  You made that up.  In fact, what is called the Central Dogma of Life uses the same coding mapping for ALL life, suggesting it originated from one genesis.  Efforts have been made to find life based on a different mapping, to no avail yet.",
                                                                "good": "1",
                                                                "bad": "2",
                                                                "replies": [
                                                                    {
                                                                        "user_name": "ArneSaknussem",
                                                                        "time": "23 June, 2022",
                                                                        "context": "Life beginning more than once? I did not make that up. Stuart Kauffman explained it very well, as have others. Mathematically it would have taken more than one chance.",
                                                                        "good": "1",
                                                                        "bad": "0",
                                                                        "replies": []
                                                                    }
                                                                ]
                                                            }
                                                        ]
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "nullkommentar",
                "time": "18 June, 2022",
                "context": "So the barely intelligent life has decided that it's hard for advanced civilizations to travel this far?\nMaybe we're just a few meters away by interdimensional shortcuts.",
                "good": "4",
                "bad": "1",
                "replies": []
            },
            {
                "user_name": "tommysolo046",
                "time": "23 June, 2022",
                "context": "No it's not probable at all.",
                "good": "0",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "fibonacci1.618",
                        "time": "23 June, 2022",
                        "context": "The probability of life elsewhere in the universe is exceptionally high based on what we know about physics, chemistry, astronomy, mathematics, and biology. There is plenty of literature in each of those disciplines on this topic.\n\nOn what do you base your conclusion?",
                        "good": "3",
                        "bad": "1",
                        "replies": [
                            {
                                "user_name": "tommysolo046",
                                "time": "23 June, 2022",
                                "context": "Science requires actual proof/evidence for extraordinary claims. There's no proof or evidence. End of story.",
                                "good": "0",
                                "bad": "3",
                                "replies": [
                                    {
                                        "user_name": "sciencerocks",
                                        "time": "23 June, 2022",
                                        "context": "In science we have saying, especially in paleontology, that \"absence of evidence is not evidence of absence.\" For example, in 1871 Charles Darwin wrote that it was more \"probable\" that humans evolved in Africa. There was no fossil evidence at the time, but he based his hypothesis on known principles of biology and geology. That was not the \"End of story,\" as in 1924 a pre-human skull was discovered in South Africa, and literally thousands of related fossils have been found across Africa since.\nSo the idea of the probability of life elsewhere has the same standing as did Darwin's prescient insight of 1871.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": [
                                            {
                                                "error": "error"
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "primal_battle",
        "time": "16 June, 2022",
        "context": "This is kind of ridiculous because if they wanted us to hear them, they could easily send us a message. On the other hand, if they don't want us to hear them, they could easily use a technology like \"Spread Spectrum\". Which would be completely invisible to this radio telescope and we've had that technology for 20 years!",
        "good": "2",
        "bad": "0",
        "replies": [
            {
                "user_name": "mydog'shumandaddy",
                "time": "17 June, 2022",
                "context": "No.....spread spectrum wouldn't be 'invisible' to 'this' radio telescope.....but it would be hard to decrypt.....although the direction of the transmissions would be easy to figure out.....the reality is far more obvious.....we wouldn't be able to decode anything because they most likely communicate with each other in a 'language' or sets of symbols that we wouldn't understand anyway........so why would they bother with encoding the message in a further attempt to prevent us from understanding it? Another 'intelligence' out there in the universe wouldn't be able to understand english without 'pictures' to go along with the worlds.....which might also be meaningless to them as their world is different.....",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "primal_battle",
                        "time": "17 June, 2022",
                        "context": "That's the beauty of spread Spectrum. Unless you know the signal is present and have the decoding key, it just looks like a small bump in the noise floor. Usually mistaken as simple interference. Plus, any wavelength capable of reaching us, would be high enough in frequency that it would also be highly directional. Meaning, if they weren't trying to reach somebody in our direction, we would never know it.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "SomeGuy357",
                "time": "17 June, 2022",
                "context": "Who says they're trying to do anything? If their equipment is sensitive enough, 70 light years away aliens could be watching \"I Love Lucy\".",
                "good": "4",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "dan42day",
        "time": "16 June, 2022",
        "context": "So now there's even a chance that Biden could get us into an interplanetary war!",
        "good": "3",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "EEngr=mc^2",
        "time": "17 June, 2022",
        "context": "If there were aliens, they would have checked out our Voyager probes by now. Launched in 1977.",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "harkths",
                "time": "18 June, 2022",
                "context": "Nanu Nanu",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "SagittariusA*",
        "time": "17 June, 2022",
        "context": "Well, being as how it’s China, we can be certain the alien signals didn’t come from Mexico. ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "stmarsaille",
        "time": "18 June, 2022",
        "context": "Yawn.  The usual outcome -- possible radio interference.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "spikeit2times",
        "time": "22 June, 2022",
        "context": "They were picking up CNN",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "the_facts_of_life_are_conservative",
        "time": "18 June, 2022",
        "context": "They picked up a signal of the movie Mars Attacks.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "awall1231",
        "time": "18 June, 2022",
        "context": "So the aliens come here, abduct humans, probe them analy, erase their memory, and all they have found out is 2 in 10 dont really mind.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "fldiverguy",
        "time": "18 June, 2022",
        "context": "Who can trust ANYTHING the Chinease say, what with the deliberate Wuhan Flu attack and all? They're just as bad as this current Administration... they are, afterall, \"in bed\" together in causing all of this mess.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jus14daroad",
        "time": "18 June, 2022",
        "context": "Aliens? That is the only explanation for the strange creatures occupying Washington, DC.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "tommysolo046",
        "time": "23 June, 2022",
        "context": "Really?!! You don't say??!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "LibsH8UrHappiness",
        "time": "21 June, 2022",
        "context": "Aren’t those aliens supposed to remain in Mexico?",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "GreenScooter",
        "time": "18 June, 2022",
        "context": "Why look so far away, just look right here on Earth.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "nicebuds",
        "time": "18 June, 2022",
        "context": "If that is true it was sent a long time ago. Those critters might not exist anymore.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rubiks6",
        "time": "22 June, 2022",
        "context": "What a colossal waste of effort and resources — looking for life anywhere besides Earth. \n\nThis planet is designed and created for corporeal life and it is the only planet in the entire universe that has corporeal life. \n\nLife only comes from life. No evidence to indicate otherwise exists.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "NormanBlanton",
        "time": "18 June, 2022",
        "context": "the aliens must have said something about the superiority of free markets, and the necessity of human rights.\n\nof course they may just be streaming Winnie the Pooh.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jrettinger",
        "time": "29 June, 2022",
        "context": "Paranoid Schizophrenics hallucinate any kind of psychotic episode.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "glasstheplanet",
        "time": "20 June, 2022",
        "context": "All your base, are belong to us",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "freeme768",
        "time": "19 June, 2022",
        "context": "The other theory is that this is not a radio antenna, but an attempt at some world record wok! LOL",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jrup1986",
        "time": "19 June, 2022",
        "context": "Aliens ? Ha , and go visit earth ? Don't they know of the firmament and outer space is fake,  nasal is used to funnel money",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "trumpedagain728",
        "time": "18 June, 2022",
        "context": "Beam me up Scotty .. .There is no intelligent life down here",
        "good": "3",
        "bad": "0",
        "replies": []
    }
]