[
    {
        "user_name": "realist12345678",
        "time": "12 February, 2022",
        "context": "Astounding achievement!\nThis is a triumph of human ingenuity and engineering. \nTo the people who say it's a waste to spend 20+ years and 10 billion dollars on a telescope that will reveal the wonders of the universe, I would say yes, that's a lot of money and resources. \nBut it only translates to about 4.5 days of US military spending. \nThere always seems to be unlimited money to destroy things but spend money on exploring the universe and people arc up.",
        "good": "11",
        "bad": "0",
        "replies": [
            {
                "user_name": "spinynorman262",
                "time": "13 February, 2022",
                "context": "It is very exciting, especially after such a long wait.",
                "good": "6",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "dismissed",
                "time": "21 February, 2022",
                "context": "Sorry, but there are two things on which you need calibration (literally).\n1) To only use the dollar amounts of the telescope project and the annual military budget (and I assume that is what you did) is a bit simplistic.\n2) \"...unlimited money to destroy things...' paints the picture that it's your opinion that all the military is good for is destruction. I think that is horribly wrong-headed. Does someone really need to explain that? I hope not.\n\n(BTW, I am NOT one of those who say it's a waste to spend on space exploration. But your post belies your disdain for those who protect US interests around the globe (a statement to which you will likely take exception - I hope not, however).",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "nepawoods",
        "time": "12 February, 2022",
        "context": "\"Elemets of thisd iamge furnished by NASA\" ... Whatever that means.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "carnotaurus",
                "time": "12 February, 2022",
                "context": "Writer started having a stroke lol",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "nonotrush",
        "time": "11 February, 2022",
        "context": "Well, if this new telescope can see the beginnings of this universe, got to wonder what that will look like! I do not believe in a \"big bang\", but I do believe in a Creator! I will be waiting to see whatever it shows!",
        "good": "3",
        "bad": "0",
        "replies": [
            {
                "user_name": "wewillfixit",
                "time": "11 February, 2022",
                "context": "I can not go with the creator faith, that is just man's need to explain what he does not understand. Man will never know the big picture. Even if we could see beyond the event horizon, would the universe be endless, could there be more universes, could our universe just be a molecule on a table of your creator? We can never know in a short human existence, but we can marvel at what we have to see and learn. Hope your creator does not tire of his table and throw it in the back yard fire pit..ha",
                "good": "0",
                "bad": "2",
                "replies": [
                    {
                        "user_name": "CriticalRaceTheoryisRACIST",
                        "time": "11 February, 2022",
                        "context": "God created the HEAVENS and the Earth.....what makes you think you aren't seeing his creation in the images?  Faith is certainly lacking in your life...better find some before it's too late and you find yourself in that fiery place.",
                        "good": "1",
                        "bad": "1",
                        "replies": [
                            {
                                "user_name": "wewillfixit",
                                "time": "11 February, 2022",
                                "context": "I am glad \"faith\" comforts you.\nFaith to me is a theory that you can not prove, it is also the biggest form of brainwashing to mankind and the cause of most war and hatred of others with different faith. But man will continue to evolve where they no longer use faith to explain what they do not understand.",
                                "good": "1",
                                "bad": "1",
                                "replies": [
                                    {
                                        "user_name": "CriticalRaceTheoryisRACIST",
                                        "time": "11 February, 2022",
                                        "context": "So you DO have faith after all...Faith that man will have things they don't understand explained!  BTW, It's called Salvation and Everlasting Life, all you have to do is give your life to God.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": [
                                            {
                                                "user_name": "lycopine",
                                                "time": "13 February, 2022",
                                                "context": "which of the 10,000 documented gods are you referring to?",
                                                "good": "0",
                                                "bad": "0",
                                                "replies": []
                                            }
                                        ]
                                    },
                                    {
                                        "user_name": "d'artagnan0962",
                                        "time": "11 February, 2022",
                                        "context": "The more we learn about the complexity of the laws of physics and how they interact to form the universe as we know the harder it is for me to believe that it all came into being by accident.",
                                        "good": "1",
                                        "bad": "0",
                                        "replies": [
                                            {
                                                "user_name": "nepawoods",
                                                "time": "11 February, 2022",
                                                "context": "Either \"it all came into being by accident\" or there was a creator ... classic false dichotomy.",
                                                "good": "0",
                                                "bad": "1",
                                                "replies": []
                                            },
                                            {
                                                "user_name": "lycopine",
                                                "time": "13 February, 2022",
                                                "context": "our feeble and tiny human brains don't have the sensory capacity to understand. The answer here is \"I don't know\", instead of inventing some super beings for an explanation.",
                                                "good": "0",
                                                "bad": "0",
                                                "replies": []
                                            }
                                        ]
                                    },
                                    {
                                        "user_name": "analytical_reasoning",
                                        "time": "12 February, 2022",
                                        "context": "Jesus PROVED it by his death on the Cross and his physical resurrection.  FYI, no one denied it at the time it happened.  There was some who tried to make excuses for it.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": []
                                    }
                                ]
                            },
                            {
                                "user_name": "nepawoods",
                                "time": "11 February, 2022",
                                "context": "If you believe that heaven and hell nonsense, then you're beyond being reasoned with.",
                                "good": "0",
                                "bad": "2",
                                "replies": [
                                    {
                                        "user_name": "analytical_reasoning",
                                        "time": "12 February, 2022",
                                        "context": "Jesus taught that heaven and hell are real.   He also proved himself.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": []
                                    }
                                ]
                            },
                            {
                                "user_name": "g0disdead",
                                "time": "12 February, 2022",
                                "context": "Religious Faith, aka belief without evidence, aka wishful thinking, is for gullible idiots.  Christianity is just a widespread Nigerian Prince Scam.",
                                "good": "0",
                                "bad": "1",
                                "replies": []
                            },
                            {
                                "user_name": "lycopine",
                                "time": "13 February, 2022",
                                "context": "Ah, religious coercion again. As if your arrogant and self righteous truth claims have merit.",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            },
                            {
                                "user_name": "penguinsfan87",
                                "time": "18 February, 2022",
                                "context": "Nope.",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "user_name": "nonotrush",
                        "time": "11 February, 2022",
                        "context": "Everything works by faith. Without faith, why would you even flip the light switch on? Well, the answer is, you have discovered by flipping that switch, you can see things better, and avoid tripping and falling on you kids (or your) toys left on the floor. Your faith in that light switch is now a certainty, is it not? Of course it is. If you could go to a place on earth where there has never been electricity, lights, or anything other then stone age utensils, what do you suppose the natives would think of you, if you took out your flashlight, flipped the switch, and pointed at their eyes? I am pretty sure after they come back from running away as fast as they could, their curiosity would force them back and before long, you would be thought of as a god most likely. Well, I have seen the light personally, and I fully believe in and know my Creator. How can I? Well 50+ years of walking with anyone, you get to know them to some degree, same with knowing the Lord. Take care and please understand none of us know it all, but there is one who does.",
                        "good": "0",
                        "bad": "1",
                        "replies": [
                            {
                                "user_name": "lycopine",
                                "time": "13 February, 2022",
                                "context": "indeed, YOURS does not apply to anyone else though...",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "user_name": "analytical_reasoning",
                        "time": "12 February, 2022",
                        "context": "Jesus came back from the dead, proving that he and his words are trustworthy and true.    You're free to choose to believe the truth or not.",
                        "good": "1",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "g0disdead",
                                "time": "12 February, 2022",
                                "context": "How do you know Jesus came back from the dead?  There are no extra biblical sources that confirm that and no eye witnesses testimony. \n\nIt's just a story, nothing more.",
                                "good": "0",
                                "bad": "1",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "user_name": "scribefaithtoday",
                        "time": "13 February, 2022",
                        "context": "“But the day of the Lord will come as a thief in the night; in the which the heavens shall pass away with a great noise, and the elements shall melt with fervent heat, the earth also and the works that are therein shall be burned up.” 2 Peter 3:10",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "lycopine",
                                "time": "13 February, 2022",
                                "context": "bible babble=fiction\n\nlogic 101",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "randy4usa",
                "time": "12 February, 2022",
                "context": "I would like them to use it in concert with Hubble to triangulate distant galaxies from a wider base to check up on the accuracy of \"red shift\" ranging.",
                "good": "1",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "spinynorman262",
                "time": "13 February, 2022",
                "context": "Science is not a belief system. I'm a person of faith in God, but that is not science.\n\nWhat problems do you have with the physics of the \"big bang.\" Incredulity is not an argument.",
                "good": "3",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "nonotrush",
                        "time": "13 February, 2022",
                        "context": "I cannot agree with your statement above. My belief is that God is the Creator of all things created. If this is true, as I believe it is, that would have to mean all the laws of science, known and unknow had to be made by God as well. It would not fit any logic to believe in God as \"this\" Creator, without Him first Creating all those laws of science first. Here's why. If these laws already were in place, either before God came around,  or before their was a God (not scriptural to believe this), would not the Universe have already been formed without the help of God? I suppose if you wish to believe in a lesser God, you idea could fit, as He would not have had anything to do with Creating this universe, only Creating earth, or perhaps only Creating life. Since I believe God is everlasting, without a beginning and never any ending, He would predate the Universe and would out last it as well. Seems a bit foolish not to believe He is all in all as it fits the paradigm of a Creator, creating all that was created -- Too me anyway. BTW everyone gets to choose what to believe and not believe... God made that as well when He gave us a free will didn't He. Take care.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "spinynorman262",
                                "time": "14 February, 2022",
                                "context": "So you nothing about the Big Bang, but dismiss it with no rationality.",
                                "good": "2",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "nonotrush",
                                        "time": "14 February, 2022",
                                        "context": "I would have thought you would have grasped that my believe disallows a \"big bang\" because I believe in a Creator. God either is a Creator of all that is created, or He is not. Believing in things for me means there is always a purpose and reason for all things. Nothing is by chance and all things have something that ties them together. Cause and effect, with a Creator behind all of it. If there was an event anything like a \"big bang\", it would have been an ordered event, not something that just happened when the conditions were right. In that, it would mean their is an intelligence at work, in and through all of it. I know this may be hard to grasp if you do not believe in a power that is over all things, that brings order to what would otherwise be chaos or nothing at all. I hope this somehow fits into something understandable for you. If not, there really isn't much more I can tell you that would change your understanding.",
                                        "good": "0",
                                        "bad": "1",
                                        "replies": [
                                            {
                                                "user_name": "nepawoods",
                                                "time": "16 February, 2022",
                                                "context": "That's funny.  It was a Catholic priest who first came up with the big bang theory, and Einstein rejected it at first because he thought it sounded too much like Bible creationism dogma.  Where do you get the idea that belief in a creator disallows a big bang?",
                                                "good": "0",
                                                "bad": "0",
                                                "replies": []
                                            }
                                        ]
                                    }
                                ]
                            },
                            {
                                "user_name": "penguinsfan87",
                                "time": "18 February, 2022",
                                "context": "There is no agreement or disagreement. You are wrong. End of story. Now go away.",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "user_name": "dismissed",
                        "time": "21 February, 2022",
                        "context": "Science is not a belief system? It certainly as something to do with belief of some sort.\n\nI guess, maybe not 'system of belief'? I'm not sure.\n\nHow is science not a belief system or something or other to do with believing something(s)?",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "spinynorman262",
                                "time": "24 February, 2022",
                                "context": "In faith I have beliefs about God and Christ that are unwavering.\nIn science, which is a dynamic process, accepted truths waver all the time. The more we probe our world and our universe, the more we learn and adjust what we thought we knew.\nPeople ask me if I 'believe' in biological evolution, and I say \"no.\" I am quite certain that biological evolution is true, but if new evidence came along to disprove it, then I'd have to accept that I shouldn't have been so certain.",
                                "good": "0",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "dismissed",
                                        "time": "24 February, 2022",
                                        "context": "But people 'believe in' Science itself, in the idea, or belief, that humanity can and eventually will know the as-yet unknown/unknowable. For the adherents, there is no unknowable, given enough time (modern tower of Babel?) In other words, Science is something in which people can put their faith, and this is really just faith in human intellect, or humanity (or, faith in the products of human intellect and endeavor).\n\nThis describes something of a belief system.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": [
                                            {
                                                "user_name": "spinynorman262",
                                                "time": "24 February, 2022",
                                                "context": "Nope. The scientific process is very clear about the unknowables. Among them is God, because science deals with the natural universe and does not have the tools to deal with the supernatural.\n\nThe way you twist things, language could be a 'belief' system in that we believe we can communicate with it. That's just silly.",
                                                "good": "0",
                                                "bad": "0",
                                                "replies": []
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "penguinsfan87",
                "time": "18 February, 2022",
                "context": "Creator is not capitalized and your belief doesn't make it true. You should not speak here.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "shadowbannedagain335",
        "time": "11 February, 2022",
        "context": "Standing ovation to everyone who worked to make this successful",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "FREEMASON",
        "time": "11 February, 2022",
        "context": "Hubble looked back 13 million light years,  It opened our eyes in many categories of the universe.  James Webb will look back 26 million light years almost to the big bang its self,  It should find thing that will open the eyes of science and explain MAYBE how the universe was created.",
        "good": "5",
        "bad": "1",
        "replies": [
            {
                "user_name": "lycopine",
                "time": "13 February, 2022",
                "context": "your distances are quite inaccurate...",
                "good": "2",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "Rathgic",
        "time": "11 February, 2022",
        "context": "Just because something is possible if you spend huge  sums of money over many years,  so what?\n\nI haven't seen  distance   any distant  astronomic socalled  \"image\"   that   actually showed anything but a fuzzy   maybe bright light.     Which thses \"experts\"   then explain it supports there fantasy ideas of any number of things.   The classic the assertion that there are things like black holes   that alter gravity forces.     Excuse me.        The mass of a body   creates and radiates the gravity force.   And when it leaves it is on its own.    \n\n       If you are going to accept that then why did you build a telescope.     What you call Light might have been modified over very long distance more than once.    So what you are seeing means nothing then ...    Long distances don't make what is foolish into something different.  \n        And the most obvious ridiculousness of it is the existence of  our own galaxy, of a zillion  parts  ALL OF WHICH EXIST BECAUSE GRAVITY DOES IT INEXORABLE THING .\n\nI have monitored, occasionally,   black hole writings.    And one  knew what would happen.   You simply repeat  a bizarre idea enough times,    and then   ASSUMING IT WAS TRUE,  YOU HAVE PILED FANTASY CONCEPT ON FANTESY CONCEPT all so perfectly logical   if if if your initial  bizarreness existed.   \n\nThat obviously is a travesty on the \"scientific method\" of science. Certainly not a fuzzy white light  That may just be an entire galaxy of stars collectively seen a great distance!",
        "good": "0",
        "bad": "8",
        "replies": [
            {
                "user_name": "nepawoods",
                "time": "11 February, 2022",
                "context": "What are you trying to say?",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "realist12345678",
                "time": "12 February, 2022",
                "context": "Dude, put down the bud..",
                "good": "1",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "carnotaurus",
                "time": "12 February, 2022",
                "context": "tl;dr",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "falcon549",
                "time": "12 February, 2022",
                "context": "Not buying it Comrade.  You can not POSSIBLY be THAT stupid.",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "themythbuster909",
                "time": "13 February, 2022",
                "context": "If you paid so much as one penny for your education (I'm using that term loosely), you should immediately demand a refund because you got ripped off. That may be the most incomprehensible comment I've seen in a long time.",
                "good": "2",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "pt1093",
        "time": "11 February, 2022",
        "context": "Who knew there was a planetary nebula just the other side of the moon!",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "nepawoods",
                "time": "11 February, 2022",
                "context": "Huh?  Just the other side of the moon?  The moon is not stationary.  What's on the \"other side\" of the moon depends on where the moon happens to be at the time.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "pt1093",
                        "time": "11 February, 2022",
                        "context": "Nothing is stationary, and you can only see the past.",
                        "good": "0",
                        "bad": "1",
                        "replies": [
                            {
                                "user_name": "nepawoods",
                                "time": "11 February, 2022",
                                "context": "Some things are stationary relative to others.  When I look out my living room window, I can't see what's on the other side (behind) the house across the street.\n\nBut \"a planetary nebula just the other side of the moon\" makes no sense.",
                                "good": "0",
                                "bad": "1",
                                "replies": [
                                    {
                                        "user_name": "pt1093",
                                        "time": "12 February, 2022",
                                        "context": "I was making fun of the artist's rendering, since no matter what direction or when, you will not see that in the background of the telescope positioned at the Lagrange point.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": [
                                            {
                                                "user_name": "lycopine",
                                                "time": "13 February, 2022",
                                                "context": "apparently you don't know about gravitational lensing...",
                                                "good": "0",
                                                "bad": "0",
                                                "replies": []
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "总统biden",
        "time": "11 February, 2022",
        "context": "So dark that far out in space, and in the shadow of Earth.  Very excited to see the images it takes and transmits back!",
        "good": "5",
        "bad": "0",
        "replies": [
            {
                "user_name": "nepawoods",
                "time": "16 February, 2022",
                "context": "It's not in the Earth's shadow.  It's not at the L2 Lagrange point, but orbiting around L2, in a plane that's perpendicular to a line passing through the Sun and the Earth.  It needs to receive sunlight to power solar panels.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "总统biden",
                        "time": "16 February, 2022",
                        "context": "Ah, thank you for the clarification.   I was not aware of that particularity.  Now it makes sense to me for the need of a solar shield around the mirrors and telescope section.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "wewillfixit",
        "time": "11 February, 2022",
        "context": "Can not wait to see some real images, says we have to wait till the end of June.\nI do wonder if Musk was in charge, that we would not have had to wait an extra decade and 10 times the cost. Good example of how government works however. May as well start on the next generation replacement if it takes this long. \nAnother thought is now that we know how to make this one, why not do another copy with upgrades of course, if the copy would be a tenth the cost? Then scientists need not wait a year to get their turn to do science. Maybe add extra fuel to increase the service life....",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "yo666",
        "time": "11 February, 2022",
        "context": "So where is the picture of the star. \nNot interested in the selfie",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "nepawoods",
                "time": "11 February, 2022",
                "context": "It looks like a star.  A point of light.  18 of them actually, until they get all 18 mirrors aligned.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "dajowi474",
        "time": "17 February, 2022",
        "context": "That’s one hell of a box brownie.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "penguinsfan87",
        "time": "18 February, 2022",
        "context": "Fox should close down the science section. Most of its readers can't understand how these things work.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "nepawoods",
                "time": "18 February, 2022",
                "context": "But it's entertaining to watch them try.",
                "good": "2",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "jay.....054",
        "time": "12 February, 2022",
        "context": "Why does Fox News have a science section? Very few of their readers believe in it...",
        "good": "2",
        "bad": "4",
        "replies": [
            {
                "user_name": "carnotaurus",
                "time": "12 February, 2022",
                "context": "I get what you're saying, but the whole \"believe in science\" line is so incorrect. It's often used by those who have no science degrees or at the least have never read a peer reviewed paper. Simply \"believing\" does away with the crucial step of experimentation.",
                "good": "1",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "analytical_reasoning",
                        "time": "12 February, 2022",
                        "context": "Many who scream that science is supreme, don't understand the limits of and how scientific experiments are done.",
                        "good": "0",
                        "bad": "1",
                        "replies": [
                            {
                                "user_name": "g0disdead",
                                "time": "12 February, 2022",
                                "context": "Most believers in sky fairies pretend they know the limits of science and how experiments are done.  But, really most of them are gullible idiots who can only present the stupid strawman arguments they learned from their minister.",
                                "good": "1",
                                "bad": "3",
                                "replies": []
                            },
                            {
                                "user_name": "nepawoods",
                                "time": "12 February, 2022",
                                "context": "Few scream science is supreme (screaming is so gauche), but those who understand science and the limits of science know there's no better way to understand reality.",
                                "good": "1",
                                "bad": "1",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "user_name": "jay.....054",
                        "time": "12 February, 2022",
                        "context": "That may have been your experience but it hasn't been mine. Most Fox people believe some invisible space Jedi created the world in 6 days. Most Fox people have rusted on political views and are not very intelligent.",
                        "good": "1",
                        "bad": "3",
                        "replies": []
                    },
                    {
                        "user_name": "nepawoods",
                        "time": "12 February, 2022",
                        "context": "Believing in science means believing in well thought out methods of analyzing objectively verifiable evidence and drawing reasonable conclusions via sound logic.  That includes experimentation to obtain objectively verifiable evidence.\n\nVery few Fox News readers believe in any of that.  They believe in talking snakes, etc.",
                        "good": "1",
                        "bad": "1",
                        "replies": [
                            {
                                "user_name": "carnotaurus",
                                "time": "12 February, 2022",
                                "context": "Kind of a strawman, but there's a little truth to it. \n\nAgain I know what the OP is saying, but the phrase \"believe in science\" needs to be dropped entirely.",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "falcon549",
                "time": "12 February, 2022",
                "context": "Wow Comrade,  You must REALLY HATE those nasty conservatives!",
                "good": "0",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "nepawoods",
                        "time": "12 February, 2022",
                        "context": "I see no hate.  Do you read the comments here on science articles often?  It's not a comment about conservatives, but about Fox News readers, and it seems justified.  Just scroll and read.",
                        "good": "0",
                        "bad": "1",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "dan5047628",
                "time": "14 February, 2022",
                "context": "We Love science. We just have a problem with scientist that Lie",
                "good": "2",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "quietsmith",
                        "time": "16 February, 2022",
                        "context": "Oh don't worry.\n\nCreationists are not scientists and do not operate like scientists would.\n\nWhich is why they lie.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "penguinsfan87",
                "time": "18 February, 2022",
                "context": "Completion purposes.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "gulfguy48",
        "time": "13 February, 2022",
        "context": "Interesting that there is a photo of the Glenn Research Center in the article and not a word about it. It's like the author just randomly pulled up something to fill up space.......kind of a demonstration of how much Fox really cares about science.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dan5047628",
        "time": "14 February, 2022",
        "context": "For a few Billion dollars we get more pretty pictures of space that we can see standing in our back yard.",
        "good": "0",
        "bad": "1",
        "replies": [
            {
                "user_name": "nepawoods",
                "time": "14 February, 2022",
                "context": "Here to proclaim your ignorance again?",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "lycopine",
                        "time": "14 February, 2022",
                        "context": "fan-dan is an expert in religion, nothing else. He tries very feebly to equate it with science...",
                        "good": "1",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "dan5047628",
                                "time": "15 February, 2022",
                                "context": "Finance is actually my expertise. NASA has no concept of what money is, they just spend it. However I wish I was a Biblical scholar.  Still working on that. Try it I swear you won't burst into flames.",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "user_name": "dan5047628",
                        "time": "15 February, 2022",
                        "context": "No just crying over wasted money. It could have been given to the poor. They don't get to see all the pretty pictures. They just look up from their back yard if they have one.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "nepawoods",
                                "time": "15 February, 2022",
                                "context": "You're suggesting you can see, with the unaided eye, what space telescopes like Hubble or JWST can see.  So yes, you're proclaiming your ignorance.",
                                "good": "0",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "dan5047628",
                                        "time": "16 February, 2022",
                                        "context": "Of course not just suggesting seeing farther than the eye is capable is a waist of Money",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": [
                                            {
                                                "user_name": "nepawoods",
                                                "time": "16 February, 2022",
                                                "context": "\"we get more pretty pictures of space that we can see standing in our back yard\"\n\nYou wrote that.",
                                                "good": "0",
                                                "bad": "0",
                                                "replies": [
                                                    {
                                                        "user_name": "dan5047628",
                                                        "time": "16 February, 2022",
                                                        "context": "No, I said: \nFor a few Billion dollars we get more pretty pictures of space that we can see standing in our back yard.\n\nWaste of money",
                                                        "good": "0",
                                                        "bad": "0",
                                                        "replies": [
                                                            {
                                                                "user_name": "nepawoods",
                                                                "time": "16 February, 2022",
                                                                "context": "You're not getting pictures of space that anyone can see standing anywhere on Earth.",
                                                                "good": "0",
                                                                "bad": "0",
                                                                "replies": []
                                                            }
                                                        ]
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            },
                            {
                                "user_name": "quietsmith",
                                "time": "16 February, 2022",
                                "context": "\"wasted money that could have been given to the poor\"\n\nParking lots full of shiny new cars and people wearing fine suits every Sunday morning.\n\nHow about THAT money?",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "voterepublicanthumpthedemos",
                "time": "16 February, 2022",
                "context": "The only thing that surpasses your ignorance is your stupidity",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "error": "error"
            },
            {
                "user_name": "quietsmith",
                "time": "16 February, 2022",
                "context": "If you think you can see what the James Web telescope can see from your backyard you should probably stop dropping acid.",
                "good": "3",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "thunker54",
                "time": "22 February, 2022",
                "context": "dan5047628 <----- clueless \n Space exploration takes 0.48% of the US budget and you think it's too much?",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "prak519",
        "time": "19 February, 2022",
        "context": "Idiot",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jimdandy68",
        "time": "17 February, 2022",
        "context": "I am very excited to see what we will see.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "fakeitgoodnasa",
        "time": "12 February, 2022",
        "context": "Clearly a fake for obvious reasons, just like the non-scientific (and comical) ‘big bong’ theory.\n\nIndeed, fake it good.. NASA..",
        "good": "1",
        "bad": "1",
        "replies": [
            {
                "user_name": "carnotaurus",
                "time": "12 February, 2022",
                "context": "Can you explain to us in your own words what the big bang theory is?",
                "good": "1",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "nepawoods",
                "time": "12 February, 2022",
                "context": "Can you explain to us the \"obvious reasons\" it's a fake?\n\nWere the moon landings fake?\n\nIs the Earth really flat?",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "fakeitgoodnasa",
                        "time": "13 February, 2022",
                        "context": "You cannot escape sunlight in space, now can you ? I'll let you put the rest of the fake 'selfie' together.\n\nYes, the lunar 'landings' were filmed on a butte near Groom Lake, and Jack Schmitt obtained his 'lunar samples' from a volcanic dike in the high SW desert. \n\nEarth is round.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "lycopine",
                                "time": "13 February, 2022",
                                "context": "hilarious. You should work in a comedy club!!!",
                                "good": "0",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "fakeitgoodnasa",
                                        "time": "14 February, 2022",
                                        "context": "Indeed, I have a gig at the Cape Carnival Comedy Club, and 100% of my material is provided by the comedians at NASA..",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": [
                                            {
                                                "user_name": "lycopine",
                                                "time": "14 February, 2022",
                                                "context": "And here I thought you used the material from the christian church and the bible... or did you get a special delivery from Marge Greene?",
                                                "good": "0",
                                                "bad": "0",
                                                "replies": [
                                                    {
                                                        "user_name": "fakeitgoodnasa",
                                                        "time": "14 February, 2022",
                                                        "context": "My material came directly from Jack Schmitt et al.",
                                                        "good": "0",
                                                        "bad": "0",
                                                        "replies": [
                                                            {
                                                                "user_name": "nepawoods",
                                                                "time": "14 February, 2022",
                                                                "context": "You spoke to him personally?  Or did he write you a letter?",
                                                                "good": "0",
                                                                "bad": "0",
                                                                "replies": [
                                                                    {
                                                                        "user_name": "lycopine",
                                                                        "time": "14 February, 2022",
                                                                        "context": "nah, he relied on space laser delivery from Marge...",
                                                                        "good": "0",
                                                                        "bad": "0",
                                                                        "replies": []
                                                                    }
                                                                ]
                                                            }
                                                        ]
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            },
                            {
                                "user_name": "themythbuster909",
                                "time": "13 February, 2022",
                                "context": "That comment made no sense. \"You cannot escape sunlight in space, now can you?\" \"Earth is round\"",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            },
                            {
                                "user_name": "nepawoods",
                                "time": "13 February, 2022",
                                "context": "\"You cannot escape sunlight in space, now can you ?\"\n\nEscape sunlight?  What are you trying to say?",
                                "good": "0",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "fakeitgoodnasa",
                                        "time": "14 February, 2022",
                                        "context": "The JTW telescope will always be in sunlight. Despite this fact, nasa must uphold their “blackness of space” lie (as we all know, astronauts cannot see stars in space, not even one). \n\nThis blurred ‘selfie’ adheres to NASA’s fake propaganda.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": [
                                            {
                                                "user_name": "nepawoods",
                                                "time": "14 February, 2022",
                                                "context": "As we all know, the JWST is thoroughly shielded from sunlight (including light reflected from the Earth and Moon), but that's only to keep its temperature down.\n\nAstronauts often can't see stars, because human eyes naturally adjust to see the brightly lit objects around them.  The telescope, unlike a human eye, is narrowly focused in a particular direction, and would not be seeing any nearby brightly lit objects if they were there.",
                                                "good": "0",
                                                "bad": "0",
                                                "replies": [
                                                    {
                                                        "user_name": "fakeitgoodnasa",
                                                        "time": "14 February, 2022",
                                                        "context": "Let me remind you that while Mike Collins was 'piloting' the command module whilst 'orbiting' the moon several times, he was required to navigate by the stars. Yet during the most extraordinary journey man has ever made into space, he clearly stated in the post-landing press conference that \"I don't remember seeing any\".\n\nIf one were in space facing in the opposite direction of the sun, or within the shadow side of the earth or dark side of the moon, the stars would be brilliant.",
                                                        "good": "0",
                                                        "bad": "0",
                                                        "replies": [
                                                            {
                                                                "user_name": "nepawoods",
                                                                "time": "14 February, 2022",
                                                                "context": "Armstrong said \"I don’t recall, during the period of time that we were photographing the solar corona, what stars we could see.\"  Collins then added: \"I don’t remember seeing any.\"\n\nHe was talking about a particular moment in time, while they were taking pictures of the solar corona (which was before reaching lunar orbit on the way to the moon).",
                                                                "good": "0",
                                                                "bad": "0",
                                                                "replies": []
                                                            }
                                                        ]
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            },
                            {
                                "user_name": "lycopine",
                                "time": "13 February, 2022",
                                "context": "The Earth is spherical, epic fail",
                                "good": "0",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "fakeitgoodnasa",
                                        "time": "14 February, 2022",
                                        "context": "Clearly you’re upset that I’m not a ‘flat earther’.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": [
                                            {
                                                "user_name": "lycopine",
                                                "time": "14 February, 2022",
                                                "context": "Clearly you're upset that you disguise your flat Earth membership...\nAnd got caught!",
                                                "good": "0",
                                                "bad": "0",
                                                "replies": [
                                                    {
                                                        "user_name": "fakeitgoodnasa",
                                                        "time": "14 February, 2022",
                                                        "context": "Negative, flat earthers do not have a workable model, and their maps are jacked-up.",
                                                        "good": "0",
                                                        "bad": "0",
                                                        "replies": [
                                                            {
                                                                "user_name": "lycopine",
                                                                "time": "14 February, 2022",
                                                                "context": "Oh. And you determined the moon landings by the USA were fake because your imagination is over active too.",
                                                                "good": "0",
                                                                "bad": "0",
                                                                "replies": []
                                                            }
                                                        ]
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "voterepublicanthumpthedemos",
                "time": "16 February, 2022",
                "context": "What's it like to speak without any knowledge of astrophysics or proof of claims...you must work for CNN",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "quietsmith",
                "time": "16 February, 2022",
                "context": "It continues to be absolutely hysterical that you think millions of people are involved in a conspiracy for reasons you can't even explain properly and using technology more advanced than we have to \"fake it\" than it takes to actually do it!",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    }
]