[
    {
        "user_name": "HarryMybalzich",
        "time": "15 May, 2021",
        "context": "Maybe the enemy can launch and recover drones from a submarine? Seems a lot more plausible than thinking it could be space aliens",
        "good": "24",
        "bad": "10",
        "replies": [
            {
                "user_name": "GreenCherries",
                "time": "15 May, 2021",
                "context": "I didn't know that we had drones capable of reversing directions instantly, and flying without wings.",
                "good": "10",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "BobMarotte",
                        "time": "15 May, 2021",
                        "context": "There's tons of them out there, DJI makes some of the best of them. They're quad rotors, no wings, can change direction in a split second, and can hover.",
                        "good": "4",
                        "bad": "1",
                        "replies": []
                    },
                    {
                        "user_name": "HarryMybalzich",
                        "time": "15 May, 2021",
                        "context": "Before stealth aircraft came around you probably weren't aware of that either..",
                        "good": "1",
                        "bad": "1",
                        "replies": []
                    },
                    {
                        "user_name": "metalmann",
                        "time": "15 May, 2021",
                        "context": "Good observation, I couldn't see it's wings flapping either.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "GreenCherries",
                                "time": "15 May, 2021",
                                "context": "Why do you choose to narrow the definition of wings? Or do you have a limited understanding of the English language?",
                                "good": "0",
                                "bad": "1",
                                "replies": []
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "AntonChigurh",
        "time": "15 May, 2021",
        "context": "It was a chinese can of covid spray...",
        "good": "36",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "greemachine1",
        "time": "15 May, 2021",
        "context": "It’s called a drone. The only reason the military called it a UFO is because they don’t have the joystick to control it.",
        "good": "10",
        "bad": "9",
        "replies": []
    },
    {
        "user_name": "besthusbandeva",
        "time": "15 May, 2021",
        "context": "This! Is the best picture our navy   The US navy can provide?  A cell phone would have a better image.",
        "good": "5",
        "bad": "5",
        "replies": [
            {
                "user_name": "gunvald",
                "time": "15 May, 2021",
                "context": "They said a cell phone did it.",
                "good": "7",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "reaganghost277",
                "time": "15 May, 2021",
                "context": "\"The clip was taken with a cell phone inside the ship’s Combat Information Center, \"\nFrom the article, apparently you didn't read.",
                "good": "11",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "wa5tef",
        "time": "15 May, 2021",
        "context": "So, if these things threaten our ships why not ramp it up a notch and fire at one.  If they are tools of a foriegn power then they need to be dealt with.",
        "good": "25",
        "bad": "7",
        "replies": [
            {
                "user_name": "hope7677",
                "time": "15 May, 2021",
                "context": "in previous encounters during war, when we shoot at these things our ammo is shot back at us. They have been instructed NOT to shoot",
                "good": "12",
                "bad": "1",
                "replies": []
            },
            {
                "user_name": "peace-maker59",
                "time": "15 May, 2021",
                "context": "Apparently, they're not the enemy, so why risk starting a galactic war? An article in Forbes Magazine published Dec. 2020, provided Intel from the former head of Israel's space program claiming the U.S. and aliens from the Galactic Federation have a contractual agreement that allows them to come here to do research and conduct experiments. All former past and present presidents from Roosevelt to Trump knew about this, and were sworn to secrecy under the premise that Americans aren't yet ready for the truth.",
                "good": "19",
                "bad": "4",
                "replies": [
                    {
                        "user_name": "zigross",
                        "time": "21 May, 2021",
                        "context": "They have not told Biden. He could not keep it a secret with his dementia.",
                        "good": "3",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "sangomez",
                        "time": "21 May, 2021",
                        "context": "I saw that movie. It’s fiction.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "aveashsteve",
                "time": "15 May, 2021",
                "context": "World Ending Event.. comes to mind ",
                "good": "8",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "cj134",
        "time": "15 May, 2021",
        "context": "The cork flying off a bottle of rum?",
        "good": "11",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "SilverBullet",
        "time": "15 May, 2021",
        "context": "You just have to look at the stars on a clear night. Anyone who thinks its just us out there are in denial. The so called politicians are slowly but surely setting us up for the truth. As they obviously way more intelligent than us lets hope its peaceful not extermination - which is probably what’s needed. ",
        "good": "46",
        "bad": "3",
        "replies": [
            {
                "user_name": "dchapman11",
                "time": "15 May, 2021",
                "context": "If there's any advance life out there. They're not going to see us as extermination just like someone stepping on an aunt or destroying an ant colony is not extermination. Any intelligent life is going to be so much more advanced than we are that wiping us out wouldn't even be a secondary third fourth fifth thought in their mind..",
                "good": "16",
                "bad": "3",
                "replies": [
                    {
                        "user_name": "faa-q",
                        "time": "21 May, 2021",
                        "context": "Probably not, but you know what our response would be.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "dchapman11",
                                "time": "21 May, 2021",
                                "context": "Our response would be nothing to them it wouldn't cause them to blink our response would be like an ant biting our ankle and their response would be like us taking a can of raid to the ant colony total extermination. Most likely an advanced alien technology wouldn't use something so abusive. If they wanted to take over an invadas they would just have in the rain something that would evolve or change our DNA to become them over time. over multiple generations we change and then become like them. we would never ever know the water we were drinking was altering our DNA or the food we were eating was altering our dna.",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "sangomez",
                "time": "21 May, 2021",
                "context": "People have been saying that for thousands of years, but where is the verifiable evidence? Wishing it (or fearing it) doesn’t make it real.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "cj134",
        "time": "15 May, 2021",
        "context": "Shadows the destroyer all that time and the best picture they can get is that?",
        "good": "116",
        "bad": "3",
        "replies": [
            {
                "user_name": "HarryMybalzich",
                "time": "15 May, 2021",
                "context": "As usual with ufo sightings",
                "good": "21",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "constructionist1776",
                "time": "15 May, 2021",
                "context": "You have never been on a vessel at sea doing 15 to 20 knots have you. It isn’t like standing on the sidewalk in front of your house.",
                "good": "15",
                "bad": "7",
                "replies": [
                    {
                        "user_name": "cj134",
                        "time": "15 May, 2021",
                        "context": "I've been a lot faster than that, what were you on a sailing schooner?",
                        "good": "2",
                        "bad": "4",
                        "replies": [
                            {
                                "user_name": "MakeAmericansGullibleAgainAgainAndAgainAgain",
                                "time": "15 May, 2021",
                                "context": "When he sailed ships were obviously still running on steam and cameras had no image stabilizers.",
                                "good": "2",
                                "bad": "0",
                                "replies": []
                            },
                            {
                                "user_name": "constructionist1776",
                                "time": "15 May, 2021",
                                "context": "Actually a guided missile cruiser and the normal cruising speed is around 20 it’s even though they can go faster.  What were you on a drug smuggling boat?",
                                "good": "4",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "user_name": "JeffreyLiberty928",
                        "time": "15 May, 2021",
                        "context": "From the water motion you can tell they are hardly moving. This is a prank. One of thousands since 1948.",
                        "good": "4",
                        "bad": "13",
                        "replies": [
                            {
                                "user_name": "scion777",
                                "time": "15 May, 2021",
                                "context": "I think it is probably not a 'prank,' just some sort of optical aberration - and when it 'splashes' into the ocean, it really just disappears from the camera image - no breaking of the surface ...",
                                "good": "4",
                                "bad": "4",
                                "replies": [
                                    {
                                        "user_name": "🙄give-us-a-break",
                                        "time": "15 May, 2021",
                                        "context": "They were recorded doing 200 knots...UNDERWATER!!!",
                                        "good": "2",
                                        "bad": "1",
                                        "replies": []
                                    }
                                ]
                            },
                            {
                                "user_name": "constructionist1776",
                                "time": "15 May, 2021",
                                "context": "And how much Sea Time do you have?",
                                "good": "2",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "RightasRain238",
                "time": "15 May, 2021",
                "context": "That was my first thought. ",
                "good": "2",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "beentheredonethatguy",
                "time": "15 May, 2021",
                "context": "Perhaps not. By their own admission they have clear footage where the craft being videoed is within 50 foot of the camera. It's more probable that this is the footage you are allowed to see, the footage that fosters doubt. I was skeptical for my entire life, until I saw one in a hover for several minutes and then go overhead. It was huge, it was clear, It was silent, and it was unmistakably non-terrestrial. That was four years ago and I think about it every day. Your belief is not required, I know what I saw.",
                "good": "99",
                "bad": "7",
                "replies": [
                    {
                        "user_name": "Harrykeepthechange",
                        "time": "15 May, 2021",
                        "context": "Me, Elvis and his pet Sasquatch just laugh at these conspiracy theories.",
                        "good": "7",
                        "bad": "19",
                        "replies": []
                    },
                    {
                        "user_name": "ascot7",
                        "time": "15 May, 2021",
                        "context": "The Americans, can mimic and set up there own Ufo.",
                        "good": "0",
                        "bad": "8",
                        "replies": []
                    },
                    {
                        "user_name": "therifleman44-40",
                        "time": "21 May, 2021",
                        "context": "Did you get a sense of what its intentions were?",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "thomaswinslow",
                        "time": "21 May, 2021",
                        "context": "and you determined it was non-terrestrial how??",
                        "good": "1",
                        "bad": "3",
                        "replies": []
                    },
                    {
                        "user_name": "sangomez",
                        "time": "21 May, 2021",
                        "context": "But you also have no photo. Strange.",
                        "good": "0",
                        "bad": "1",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "yellowwoods",
                "time": "15 May, 2021",
                "context": "\"Quick! Get me our worse camera right away!\"",
                "good": "34",
                "bad": "1",
                "replies": []
            },
            {
                "user_name": "scott1901",
                "time": "21 May, 2021",
                "context": "It was rumored that it may be a spoofing exercise directed against China.\nI.E., it may be an attempt to deceive radar into detecting mass where there is none.\n \nLots of UFO sightings reported over water and naval vessels.\nThat way we have plausible deniability when something happens to one of their ships after they report some UFO phenomena by giving US aircraft the capability to hide within fake UFO radar blips we have generated.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "MakeAmericansGullibleAgainAgainAndAgainAgain",
        "time": "15 May, 2021",
        "context": "Tucker who's lawyers say not to take serious: \"Clearly we're looking at something that's intelligently controlled...\"\n\nSomething so intelligent that there is only black and white footage and something that is so incredibly intelligent it flickers, changes shape, and partially covers the rectangular cursor.",
        "good": "15",
        "bad": "6",
        "replies": [
            {
                "user_name": "constructionist1776",
                "time": "15 May, 2021",
                "context": "I guess reading isn’t your strong suit.  The video was taken by an unauthorized cellphone of camera footage originally obtained from a remote targeting system for a shipboard weapon system.  Probably a small cannon, large caliber automated machine gun, or Laser system.  They don’t use color cameras, they are fixed and move constantly with the movement of the ship as it rides through constantly moving seas at 15-20kts.\n\nWhen you get close to an intelligent observation feel free to post it.",
                "good": "48",
                "bad": "2",
                "replies": [
                    {
                        "user_name": "JeffreyLiberty928",
                        "time": "15 May, 2021",
                        "context": "rhey are all color cameras. This is not 1997. Cell phone cameras are great these days.",
                        "good": "1",
                        "bad": "9",
                        "replies": [
                            {
                                "user_name": "MakeAmericansGullibleAgainAgainAndAgainAgain",
                                "time": "15 May, 2021",
                                "context": "Did they even have cell phones back in 1776 when he was constructionist?",
                                "good": "0",
                                "bad": "5",
                                "replies": []
                            },
                            {
                                "user_name": "backtalker659",
                                "time": "15 May, 2021",
                                "context": "FLIR... it appears to be infrared. Phone may have color camera, but they are recording a display showing a FLIR camera. They are tracking it with a targeting system.",
                                "good": "11",
                                "bad": "0",
                                "replies": []
                            },
                            {
                                "user_name": "hope7677",
                                "time": "15 May, 2021",
                                "context": "Apparently you don't understand. If a camera that can record color, is recording a device that shows in black and white, guess what genius it is going to record the color of black and white. The device the phone camera recorded is in black & white, it is a tracking & locking device! ",
                                "good": "6",
                                "bad": "1",
                                "replies": [
                                    {
                                        "user_name": "sangomez",
                                        "time": "21 May, 2021",
                                        "context": "So where is the normal, clear video? Oh, that’s right, it doesn’t exist. smh.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "user_name": "will2000161",
                        "time": "15 May, 2021",
                        "context": "Reading these comments, you might as well forget explaining anything.",
                        "good": "3",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "irishfreedom888",
        "time": "15 May, 2021",
        "context": "So, beings conquered the time/space, can travel millions of  billions of miles to do what float around a few seconds and sink into the ocean? No hello? ",
        "good": "12",
        "bad": "7",
        "replies": [
            {
                "user_name": "therealdeal697",
                "time": "15 May, 2021",
                "context": "Exactly! I believe it’s new tech warfare from our enemies.",
                "good": "7",
                "bad": "11",
                "replies": []
            },
            {
                "user_name": "hope7677",
                "time": "15 May, 2021",
                "context": "our oceans are the most unexplored part of the earth. From ancient times to now, there are bases said to be under the water for these beings",
                "good": "9",
                "bad": "3",
                "replies": []
            },
            {
                "user_name": "DirtyPants1212",
                "time": "15 May, 2021",
                "context": "We have machines flying , driving and digging on Mars, oh My. How advanced will those\nMachines be in 50 200 500 or 1000 years from Now? ",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "Onevoice033",
        "time": "15 May, 2021",
        "context": "Biden has been seen with tin foil hats..liberals are hoarding aluminum ",
        "good": "10",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "qok424",
        "time": "15 May, 2021",
        "context": "They steal our military tech .  Now we call it UFO",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "jcir",
        "time": "15 May, 2021",
        "context": "With all the modern tech we still get grainy black and white video of a black spot.  Everyone has an HD recording device in there pockets today and in 2019.",
        "good": "3",
        "bad": "3",
        "replies": [
            {
                "error": "error"
            }
        ]
    },
    {
        "user_name": "mortalanemones",
        "time": "15 May, 2021",
        "context": "That’s the best video the Navy can take? We’re doomed, DOOMED I say!",
        "good": "5",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "JoeyT4P",
        "time": "15 May, 2021",
        "context": "Balloon boy’s parents are at it again. ",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "squib31640",
        "time": "15 May, 2021",
        "context": "It's so fuzzy it has to be Bigfoot.",
        "good": "7",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "bombshield154",
        "time": "15 May, 2021",
        "context": "its biden sending money to iran",
        "good": "6",
        "bad": "2",
        "replies": [
            {
                "error": "error"
            }
        ]
    },
    {
        "user_name": "socialismthedeathknelloffreedom",
        "time": "15 May, 2021",
        "context": "Alien brain parasite blamed for bidens border crisis, film at 11.",
        "good": "4",
        "bad": "4",
        "replies": [
            {
                "error": "error"
            }
        ]
    },
    {
        "user_name": "jjjjjones",
        "time": "15 May, 2021",
        "context": "The clip was taken with a cell phone. Was that cell phone from the pre-color1930's?",
        "good": "1",
        "bad": "7",
        "replies": [
            {
                "error": "error"
            },
            {
                "user_name": "satmgr",
                "time": "20 June, 2021",
                "context": "no; the monitor recorded was black and white, its for better contrast for the human eye. as in a spotter camera on a gun mount.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "Reasonable_Honest_And_Moderate",
        "time": "15 May, 2021",
        "context": "Every true MAGA person believes in aliens apparently. For the rest of us UFO simply means unidentified. There are plenty of more reasonable explanations that don't involve magic or aliens or a military and government coverup conspiracy. Things like a defective pixel in the video sensor.",
        "good": "1",
        "bad": "10",
        "replies": [
            {
                "user_name": "dchapman11",
                "time": "15 May, 2021",
                "context": "Whatever it is they have technology far far far more advanced than we have with the capabilities of these ships..",
                "good": "2",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "Reasonable_Honest_And_Moderate",
                        "time": "15 May, 2021",
                        "context": "You also believe Trump is a hardworking, honest, American patriot trying to help Americans, don't you?",
                        "good": "1",
                        "bad": "1",
                        "replies": [
                            {
                                "user_name": "newman",
                                "time": "15 May, 2021",
                                "context": "Generally speaking, conservatives don't believe in things they cannot see or otherwise experience. Hence the term conservative.\nAnother blind stab at politicizing something that, at best, still has only a fringe following.",
                                "good": "0",
                                "bad": "1",
                                "replies": [
                                    {
                                        "user_name": "dchapman11",
                                        "time": "15 May, 2021",
                                        "context": "And that's why conservatives are hopelessly wrong so many times. lots of things that you can't see but can be proven. Like for example we've never seen a complete orbit around the sun with the dwarf planet Pluto but we know it exists and we know how and what the path is for the orbit by math. There's a thing called the scientific method....",
                                        "good": "0",
                                        "bad": "1",
                                        "replies": [
                                            {
                                                "user_name": "newman",
                                                "time": "15 May, 2021",
                                                "context": "And that is, by definition, experiential    so your doubling down on the politicization of the extraterrestrial debate remains devoid of any credibility.",
                                                "good": "1",
                                                "bad": "0",
                                                "replies": []
                                            }
                                        ]
                                    }
                                ]
                            },
                            {
                                "user_name": "dchapman11",
                                "time": "15 May, 2021",
                                "context": "Trump has other people do the hard work yes Trump is American I don't know about Patriot because he loves his properties in China and Russia and he paid a lot more taxes in China and Russia than he did in america. So now I wouldn't call him a patriot. I think the only American Trump is helping is himself.. there I helped you out...",
                                "good": "0",
                                "bad": "1",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "edthec720",
                "time": "15 May, 2021",
                "context": "We believe an awful lot of aliens are crossing into our country by invitation from Dear Leader Joe.",
                "good": "8",
                "bad": "3",
                "replies": []
            },
            {
                "user_name": "theofunesto",
                "time": "15 May, 2021",
                "context": "Here's what this MAGA person thinks:  People believe that travelers from outer space would travel light years to get here, zip around in the sky playing hide-and-go-seek and then just disappear?  Really?  Think people!  So much for your theory.",
                "good": "0",
                "bad": "8",
                "replies": []
            }
        ]
    },
    {
        "user_name": "🇺🇸141Starlifter👨‍✈️",
        "time": "15 May, 2021",
        "context": "It was a speck of dirt or something else on the lens.",
        "good": "1",
        "bad": "5",
        "replies": [
            {
                "error": "error"
            }
        ]
    },
    {
        "user_name": "zekezz",
        "time": "15 May, 2021",
        "context": "Honestly believe a lot of the UFO sightings are experimental aircraft from some government. They plausibly deny having any aircraft in the area and use the UFO stories to cover up their activity. Can you imagine seeing a B2 bomber fly by 30-35 years ago? Surely it would have seemed like something unidentified at that time.\n\nCertainly not denying the fact that ETs and UFOs exist, but suspecting not all UFOs are alien.",
        "good": "48",
        "bad": "6",
        "replies": [
            {
                "user_name": "TheTinMan058",
                "time": "15 May, 2021",
                "context": "Biggest problem is however that if the President of the United States can't even get serviced by an intern in the most secure office on the planet without the entire world finding out about it, and there were only 2 persons present and involved there, how on Earth could such a technological secret be kept for so long from so many with so many people who had to be involved?  And in the first case, no one had vast intelligence services constantly monitoring and trying to uncover that secret.",
                "good": "20",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "sangomez",
                        "time": "21 May, 2021",
                        "context": "I think if these UFOs were real, there would have been better videos and photos by now. These sightings have occurred over many decades but without any clear, unequivocal evidence.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "itswhatplantscrave",
                "time": "18 May, 2021",
                "context": "My take is that this is a pretty clever U.S. military intelligence operation. Leak a few videos, train a few pilots to go on 60 minutes and sound convincing. Have the issue brought to congress where you have someone explain in a closed hearing that \"it is technology that we are developing, it is very advanced, and we will do are best to not to have any more mishaps.\"\n\nAll the congressmen and senators that are invited to the hearing with have to remain tight lipped, and it will appear to the rest of the world that we have developed some new game-changing technology.",
                "good": "1",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "thomaswinslow",
                        "time": "21 May, 2021",
                        "context": "what my friend if it is not our technology but that of China's or Russia's....odd that we keep seeing them around our aircraft and sea vessels but don't hear China and Russia talking about UFO's or I have just not read about it.....you need to think the opposite of what you are presently thinking meaning they are not ours....",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "coasty50",
        "time": "15 May, 2021",
        "context": "If Aliens are looking for Intelligent life on this Planet. The Police have a very good response, \" Move along nothing to see here\".",
        "good": "74",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "madmadmax789",
        "time": "15 May, 2021",
        "context": "1940s quality photos. Hundreds of high quality cameras in in the hands of most of the worlds population,yet no clear photos of these \"crafts\".  Makes you wonder...",
        "good": "63",
        "bad": "5",
        "replies": [
            {
                "user_name": "hope7677",
                "time": "15 May, 2021",
                "context": "Maybe they are to fast for clear pictures",
                "good": "14",
                "bad": "6",
                "replies": []
            },
            {
                "user_name": "thebeast1992",
                "time": "17 May, 2021",
                "context": "You have never  seen a photo of me ,  nor I of you....",
                "good": "2",
                "bad": "2",
                "replies": [
                    {
                        "user_name": "sangomez",
                        "time": "21 May, 2021",
                        "context": "That’s irrelevant. Folks all over the world have been trying to gain legitimate evidence of UFOs for decades. Unsuccessfully.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "Hillarys_Thong",
        "time": "15 May, 2021",
        "context": "DARPA loves UFO stories.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rexrobert",
        "time": "15 May, 2021",
        "context": "You would think with the technology today someone somewhere would manage to get a clear crisp video of these things. I do not believe any of this.",
        "good": "5",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "patgreene662",
        "time": "15 May, 2021",
        "context": "They cân take crystal clear high definition photos of objects on Mars, yet every photo or video of a UFO ever shown is always a grainy image that looks as though it was taken 100 years ago. Total deliberate government disinformation.",
        "good": "10",
        "bad": "2",
        "replies": [
            {
                "user_name": "dchapman11",
                "time": "15 May, 2021",
                "context": "The person who runs or ran a particular department for UFOs during the Obama administration said that they have videos or the military has videos of the ships that literally 50 ft away from military ships. They're not releasing those videos because they're still studying them. But apparently there are videos where the ships are really really close to our military ships..",
                "good": "3",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "sangomez",
                "time": "21 May, 2021",
                "context": "Could also be lack of real UFOs, right?",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "qok424",
        "time": "15 May, 2021",
        "context": "China stole our tech . Now we call it ufo",
        "good": "2",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "gunvald",
        "time": "15 May, 2021",
        "context": "Cheap cell phone.  Mine takes pictures and video in color.  Distraction from the nonsense going on in Biden's WH?  And note that it isn't Republicans doing it like Dems did to Trump from the start.  These Dems can manage their destruction of the nation all on their own.  Odd that there is no one with a telescope telling us they saw it come.",
        "good": "5",
        "bad": "1",
        "replies": [
            {
                "user_name": "hope7677",
                "time": "15 May, 2021",
                "context": "you realize that those radar are in black and white so thats what the phone recorded as ...",
                "good": "4",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "gunvald",
                        "time": "15 May, 2021",
                        "context": "I saw something like what you're saying in a different post.  I'm a girl, and radar always shows up green on tv.",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "cj134",
        "time": "15 May, 2021",
        "context": "For thousands of years sailors have come ashore with strange tales of incredible beasts but nothing about strange disks following their ships.",
        "good": "2",
        "bad": "5",
        "replies": [
            {
                "user_name": "hope7677",
                "time": "15 May, 2021",
                "context": "yes they have, even in Columbus written accounts",
                "good": "13",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "cj134",
                        "time": "15 May, 2021",
                        "context": "You're going to take the word of a half starved crew of superstitious sailors next you'll tell me.",
                        "good": "0",
                        "bad": "4",
                        "replies": []
                    },
                    {
                        "user_name": "satmgr",
                        "time": "20 June, 2021",
                        "context": "in which Columbus was brought before the inquisition to answer why he reported that it looked like a Jewish menorah.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "WhoDoesWhat",
        "time": "15 May, 2021",
        "context": "There used to be a time when these sightings were suppressed and now it would seem to be more sightings of these illegal alien's from another world are seen more than the sightings of  those slipping through our Southern border with Mexico, which are now suppressed  . . .",
        "good": "14",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "okie2021",
        "time": "15 May, 2021",
        "context": "It's the Borg coming to assimilate us!",
        "good": "7",
        "bad": "0",
        "replies": [
            {
                "user_name": "teufulhunden6531",
                "time": "15 May, 2021",
                "context": "Resistance is futile!!!",
                "good": "6",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "missouririchard",
        "time": "15 May, 2021",
        "context": "And not a person on earth, can tell us what an Angel really looks like or for that matter what a demon looks like, but both exist, until Christ returns to send the Demons to hell",
        "good": "4",
        "bad": "2",
        "replies": [
            {
                "user_name": "dchapman11",
                "time": "15 May, 2021",
                "context": "Angels and demons don't exist since he actually can prove those things. UFOs do exist we don't know if aliens exist but there's a greater chance of aliens existing then demons or angels. The supernatural cannot be studied or examined. Until we can study the supernatural there's no way to know that of its existence",
                "good": "1",
                "bad": "4",
                "replies": []
            },
            {
                "user_name": "satmgr",
                "time": "20 June, 2021",
                "context": "bible has a description of both, just like you and me.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "IH8TPPL",
        "time": "15 May, 2021",
        "context": "Lol.  Really?  Why are the pictures of mysterious flying objects always so grainy and blurry?  Even the old time silent movies had better clarity than most of the UFO pictures the government shows us.  With todays technology I'm not buying it.  And don't use the excuse that it is traveling  at a high rate of speed.  If it was they wouldn't be able to follow it or film it.  Not even a clear picture when they hover?  Thermal camera?  Well then they need to go ahead an take a picture with a camera that shows what it looks like in real life.",
        "good": "5",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "gundagai",
        "time": "15 May, 2021",
        "context": "Who created the aliens?",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "missouririchard",
                "time": "15 May, 2021",
                "context": "What is an alien?",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "harper'sdaily",
                        "time": "15 May, 2021",
                        "context": "Mexican",
                        "good": "3",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "satmgr",
                        "time": "20 June, 2021",
                        "context": "non terrestrial entity  .....e.b.e. extraterrestrial biological entity. as with an angel?",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "theofunesto",
                "time": "15 May, 2021",
                "context": "China",
                "good": "1",
                "bad": "1",
                "replies": []
            },
            {
                "user_name": "satmgr",
                "time": "20 June, 2021",
                "context": "the almighty. same one who made us. Our lord has many houses, in many places: bible",
                "good": "1",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "gundagai",
                        "time": "20 June, 2021",
                        "context": "Why did he make aliens so much smarter than earthly humans?",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "clovexoxoxo",
        "time": "15 May, 2021",
        "context": "Turns out it was Suckerberg on his surfboard.",
        "good": "15",
        "bad": "0",
        "replies": [
            {
                "user_name": "saggydrawers",
                "time": "15 May, 2021",
                "context": "That is an electric Surfboard.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "BlueFlask",
        "time": "15 May, 2021",
        "context": "If we have ET's I'd say their best place to hide would be under the ocean. I heard the pilots of these things love tequila and get drunk and mess with people.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "76moonshiner812",
        "time": "15 May, 2021",
        "context": "Look at a picture of the Hubble Deep Field exposure, Google/Bing it.  Look at it.  Think about what it is.  Galaxies and galaxies, not individual stars.  No way in God's green Earth are we alone.",
        "good": "90",
        "bad": "4",
        "replies": [
            {
                "user_name": "itzik2",
                "time": "15 May, 2021",
                "context": "We are alone in the sense if there were other intelligent life in other galaxies, the distance is so great, there would never be any communication.  As far as intelligent life within our own galaxy, we should have already picked up communication signals (Electromagnetic waves).  As far as intelligent life on Earth, it is certainly missing in the White House.",
                "good": "69",
                "bad": "13",
                "replies": [
                    {
                        "user_name": "mentor397",
                        "time": "15 May, 2021",
                        "context": "You can see how large the universe is, acknowledge that there may be others out there, and yet you still assume that we know everything there is to know about space travel and communication.   Yeah, you're right - using the technology we know, there's no way we could communicate with civilizations from other galaxies.  Using the technology we know.",
                        "good": "6",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "itzik2",
                                "time": "15 May, 2021",
                                "context": "I am definitely open to the fact that life could exist elsewhere as the universe seems limitless.  As far as getting to other galaxies, it seems beyond our current knowledge of physics, but since science is never settled further understandings might come up with a way.  I don’t know how they would get by the fact of greatly increasing mass as an object approaches light speed, but then again who really knows what the future holds.",
                                "good": "1",
                                "bad": "1",
                                "replies": [
                                    {
                                        "user_name": "pyrointampa496",
                                        "time": "21 May, 2021",
                                        "context": "A very sensible attitude. I think you answered your own question when you wrote, \"it seems beyond our current knowledge of physics.\" The limitation right now is our lack of understanding of many things. Look up the theory of entanglement in quantum physics. It proves that; at the quantum level at least; faster than light travel is possible. It's not a theory. It's been proven! So what we know about the laws of \"regular\" physics must be wrong. If you REALLY want to melt your brain, read about the EPR paradox!",
                                        "good": "1",
                                        "bad": "0",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "user_name": "thebeast1992",
                        "time": "17 May, 2021",
                        "context": "Ok, so a civilization a billion years ahead of us couldn't figure out space travel over great distances? Look how quickly we jumped from the first plane to sending a rover to Mars. And just because we use \"electromagnetic waves\" to communicate doesn't mean a super advanced technology utilizing dark matter, or something on the quantum level isn't out there. I'm not saying we are being visited, but your argument is absurd & naive.",
                        "good": "5",
                        "bad": "1",
                        "replies": [
                            {
                                "user_name": "76moonshiner812",
                                "time": "20 May, 2021",
                                "context": "Yep, there is so much that we don't know that we don't know.  Lots and lots.",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            },
                            {
                                "user_name": "pyrointampa496",
                                "time": "21 May, 2021",
                                "context": "There's no doubt we are being visited, and probably have been for centuries. The problem is our own ego's won't allow us to admit that there's something out there more sophisticated than us that we don't understand. As you point out, we have gone from sailing ships to rovers on Mars in a few hundred years. Imagine what a civilization can do with a 100K year head start on us?!",
                                "good": "2",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "user_name": "thomaswinslow",
                        "time": "21 May, 2021",
                        "context": "they might be so far advanced that there is no signal to pick  up like we can do with our other enemies across the globe...what a thought",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "pyrointampa496",
                "time": "21 May, 2021",
                "context": "Statistically speaking, the current thinking suggests there are at least 36 other intelligent civilizations right here in our own galaxy. If you were to assume that every other galaxy in the universe is the same size as ours (and they're not!), multiply 36 times the estimated 2 trillion galaxies in the universe.... Yeah.... No way in God's green Earth are we alone.",
                "good": "6",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "steven1960",
                        "time": "21 May, 2021",
                        "context": "\"Statistically speaking.\" I see this all the time. Based on what variables? The sheer number of stars/planets/etc. in the observable universe? Look up fine tuning theory and see how unlikely life actually is. I'm not saying there isn't, only that statistics is no means of measuring whether there is. Maybe there is, maybe there isn't - simple as that.",
                        "good": "2",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "njordr",
                "time": "21 May, 2021",
                "context": "Now look at it and think. \"Wow! We have such clear images of objects billions of light years away, and that's the best images they can get of something right here on Earth?\"",
                "good": "16",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "sangomez",
                        "time": "21 May, 2021",
                        "context": "Exactly. Dubious.",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "76moonshiner812",
                        "time": "22 May, 2021",
                        "context": "Good point.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "democrat=punchingbag",
                "time": "21 May, 2021",
                "context": "But those distances are enormous. I would say pretty much impossible for any civilization to have INTERGALACTIC travel since the Andromeda Galaxy is around 4 BILLION light years away. But it is reasonable to suggest that advanced intelligences within 100 light years could travel to our Planet Earth and could very easily send drones that distance.",
                "good": "2",
                "bad": "7",
                "replies": []
            },
            {
                "user_name": "sangomez",
                "time": "21 May, 2021",
                "context": "Yes, there are more stars than grains of sand on Earth. But the fact is that so far there’s zero evidence of life of any kind, much less intelligent life. Except for grainy and dubious videos like this one, there’s no photographic, chemical, electronic or geological evidence of even single-cell life, past or present, other than what’s here on Earth. Consider that.",
                "good": "6",
                "bad": "2",
                "replies": []
            },
            {
                "user_name": "boxcar84our052",
                "time": "22 May, 2021",
                "context": "Worst video ever.",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "foxisgreatamericannews",
                "time": "22 May, 2021",
                "context": "I doubt anyone ever thought we were alone in the universe more like the distances involved was the hold up on being visited.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "dan234",
        "time": "15 May, 2021",
        "context": "To anyone else in the universe, we are aliens, so now you know how aliens look like",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tdsmerchant",
        "time": "15 May, 2021",
        "context": "Get better cameras -  no more mysteries....",
        "good": "7",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "ban_everything",
        "time": "15 May, 2021",
        "context": "That’s not a UFO. That’s COVID.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "AngelMartinz7",
        "time": "15 May, 2021",
        "context": "I want to believe - yet somehow our government has proven time after time that you can't believe anything they say.",
        "good": "42",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dreamcatcher",
        "time": "15 May, 2021",
        "context": "I agree with other comments here.  Why are the videos always a very poor quality and look like they were taken in the 1930’s?   Also, why do they rapidly jerk around for no apparent reason?  Looks like the alien driver could be cited for drunk driving.  You would think that if these aliens could get here from so far far away that they could drive better.",
        "good": "6",
        "bad": "2",
        "replies": [
            {
                "user_name": "faa-q",
                "time": "21 May, 2021",
                "context": "The video was shot with a thermal target imaging camera from miles away.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "breakingthewind",
        "time": "15 May, 2021",
        "context": "Coincidentally a reptile has apparently been spotted surfing.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "theofunesto",
        "time": "15 May, 2021",
        "context": "People believe that travelers from outer space would travel light years to get here, zip around in the sky playing hide-and-go-seek and then just disappear?  Really?  Think people!",
        "good": "7",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "joleemlt",
        "time": "15 May, 2021",
        "context": "it's more than likely our military crafts we've had the technology for years and have been funding they  black projects. Wouldn't be surprised if our gov or the NWO staged a glo bal attack and blamed it on aliens. Hopefully if they're out there they'll save us.",
        "good": "2",
        "bad": "2",
        "replies": [
            {
                "user_name": "satmgr",
                "time": "20 June, 2021",
                "context": "It's called a false flag event. Its an acknowledged real event (false flag) not alien thing yet! . To make the public follow a certain agenda.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "loozerbiden",
        "time": "15 May, 2021",
        "context": "The governments around the world are also releasing data on these things along with the US to get us use to the idea of aliens,but that's not what they are.These things are manifestations of evil. They are demonic in nature. The Rapture of the church will be blamed on aliens,not God.",
        "good": "1",
        "bad": "2",
        "replies": [
            {
                "user_name": "gundagai",
                "time": "15 May, 2021",
                "context": "That's what the aliens are saying about humans.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "9.86960440109",
        "time": "15 May, 2021",
        "context": "I'm not sure, but it looks like it might be one of those throws made by Joe Montana back in '88.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "breakingthewind",
        "time": "15 May, 2021",
        "context": "Don’t get too excited. We are not being visited by  any intelligent life from another planet.",
        "good": "3",
        "bad": "4",
        "replies": [
            {
                "user_name": "theofunesto",
                "time": "15 May, 2021",
                "context": "We've been marked -- for extinction.",
                "good": "1",
                "bad": "1",
                "replies": []
            },
            {
                "user_name": "satmgr",
                "time": "20 June, 2021",
                "context": "I have no proof one way or the other, so I wouldn't say yes or no on the visitation thing. Unless it allows you to sleep at night.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "ascot7",
        "time": "15 May, 2021",
        "context": "P 2,\nHi,\nThe Earth moves in a mode pattern, according to the Serbian Astronomer.  which causes ice ages through thousands of years.  when the earth tilts, to much from a stable 23.5 degree,to say 24.5 to 25 degree angle then we are in big trouble.   scientists tell us that a billion year ago approximately  The Earth took a tumble, and the North pole was South, and vice versa.  and Australia was in the Atlantic area, perhaps it was Atlantis. Then slowly over millions of years, the pendulum swung back to normal.  If you are interested about your soul, and you want to see Jesus, then go to the Prophets web page.......williambranham.org/visions.....\nAlso,..../life story, that is if you are looking for truth, the whole truth and nothing but the yruth, God bless from Ascot7.",
        "good": "0",
        "bad": "7",
        "replies": []
    },
    {
        "user_name": "richardtaster",
        "time": "15 May, 2021",
        "context": "Fox News.You’re number one news source for UFO’s.😩",
        "good": "2",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "ascot7",
        "time": "15 May, 2021",
        "context": "No,\nit is not it is not true,maybe America is setting people up for a reason.  I am a Christian, my doctrine is purely the bible.  The black spot can be controlled by devices from american navy.  If it was genuine, a more explicit photo would of suffice.  So there is no proof of its existence.  Why would an intelligent civilisation from aeons away bother with an unruly planet that despises the Creator, tell me.  While we are at war with each other, no dice.  That is if there is more life out there, if there is, then the Creator would know of it.  and he would tell them to stay away from a planet in turmoil.  even with there vast intellect. No match for  the Creator.  We do not know of God's vast creative power.  But out there, it is endless space.  And if it were the case, and life did visit, ideologies, would vie for prominence, this cannot happen.  Please, concentrate on our environment, There is to  much carbon in the atmosphere, but we all need a percentage in the atmosphere, for our converted oxygen need's.  As the tree's convert the carbon for our breathing requirements.  The wild bush fires in AU, and amazon, caused the carbon sink to release its  carbon.  making the atmosphere hotter.  we will always require carbon.  not  to much.  scientists tell' s us that if we have levels of carbon fall significantly, we would be facing another ice age.  Valuable carbon, keeps us warm.  Please go to U-tube, and discover the Serbian astronomer's info on the subject.  Also,",
        "good": "0",
        "bad": "3",
        "replies": [
            {
                "user_name": "harper'sdaily",
                "time": "15 May, 2021",
                "context": "ZZZZzzzzzzzzzzzzzzzzzzzzzzzz...........................",
                "good": "1",
                "bad": "1",
                "replies": []
            },
            {
                "user_name": "saggydrawers",
                "time": "15 May, 2021",
                "context": "Because they are not from Aeons away, it is Satan and his angels.",
                "good": "1",
                "bad": "2",
                "replies": [
                    {
                        "user_name": "ascot7",
                        "time": "15 May, 2021",
                        "context": "no,\nSatan was with God, heaven is all around us.  He was the star of the morning, Chief musician.  If there is a vast intelligence, out there, possible, they have to be more clever then us, and a peaceful civilisation. still God will not allow them to enter our space until all is resolved with Satan, and him thrown into the lake of fire. Then the Bride of Christ, nothing to do with Catholicism, moves through the rapture gate.  Actually, before he is taken.  then the war, ww 3, The planet is on its knees, radiation, the Bride, who are the Saints' walk over the ashes of the wicked, there fault for following Satan.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "error": "error"
            },
            {
                "user_name": "bhn941",
                "time": "15 May, 2021",
                "context": "Look in the book of Ezekiel. He speaks about the \"wheel within wheel.\" Pay specific attention to Ezekiel 1:16. Biblical scholars have long struggled with the meaning of that verse.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "eyeswideshutoo",
        "time": "15 May, 2021",
        "context": "they are here for their stimulus check from dimwit joe..c'mon man..",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "jasper125",
        "time": "15 May, 2021",
        "context": "They marked the location of the splash . I would have thought they would have searched for it",
        "good": "0",
        "bad": "1",
        "replies": [
            {
                "user_name": "dchapman11",
                "time": "15 May, 2021",
                "context": "I doubt there's anything to search for. That type of technology when it went underwater it was gone.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "tdsliberalhypocrisy101",
        "time": "15 May, 2021",
        "context": "These things are hovering around our nuclear weapons like gnats!!!\n\nAnyone stop to consider the strong possibility that these things are also playing with our climate??\n\nAll these morons blaming cars and cows for climate change.....WHAT SAY YOU??!  What effect are these crafts having on our climate? Why are they here? \n\nHow can you legislate/dictate humanity when unquantifiable variables are part of the climate equation??  You power hungry feinds.  I hope the global warming crowd gets probed first",
        "good": "1",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "M_Lamplighter",
        "time": "15 May, 2021",
        "context": "Biden ordered the sailors to wear masks so they don't spread covid to outer space.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "hardtruth",
        "time": "15 May, 2021",
        "context": "I want believe that it is an alien BUT a lot of the sightings seem to happen in the USA. ",
        "good": "0",
        "bad": "3",
        "replies": [
            {
                "user_name": "dchapman11",
                "time": "15 May, 2021",
                "context": "There are a lot of sightings overseas. There's many sightings and places like Brazil Venezuela Central American countries. There are sightings over in europe. There is a big UFO siding a British military base in the uk.",
                "good": "3",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "M_Lamplighter",
        "time": "15 May, 2021",
        "context": "un huh, always fuzzy and blob looking like a smudge, none of our space vehicles are flying saucers yet we always assume others are",
        "good": "1",
        "bad": "1",
        "replies": [
            {
                "user_name": "satmgr",
                "time": "20 June, 2021",
                "context": "as always, you will be non believers until you see similar things.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "BadDemocratPoliciesFor100Alex",
        "time": "15 May, 2021",
        "context": "To serve man....ITS A COOKBOOK!",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "blairv",
        "time": "15 May, 2021",
        "context": "They've always been here...they are just a super fast race of people, when you think you saw something out of the corner of your eye and turn to look and it's gone, that was them. They are all related to Dr. J, the man could float longer in the air than any human alive...the original GOAT!",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "micos",
        "time": "15 May, 2021",
        "context": "The closest solar system to Earth is 4.37 Light years away and the very closest galaxy is 25,000 light years away.  So in reality, even if the closest galaxy had extraterrestrial life it would still take 25,000 years to get here if they could somehow travel at the speed of light.  Also, why is it we can take a crystal clear video at night on the planet Mars, yet there is no clear footage available on Earth of UFO's - none.  The footage is ALWAYS grainy.",
        "good": "46",
        "bad": "6",
        "replies": [
            {
                "user_name": "GreenRocket",
                "time": "15 May, 2021",
                "context": "if E = MC(squared) is correct, we will never have an extraterrestrial experience. But IF it's not correct... who knows",
                "good": "2",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "BlueBulb",
                "time": "17 May, 2021",
                "context": "Exactly.",
                "good": "2",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "unclefess923",
                "time": "21 May, 2021",
                "context": "I'm not so sure light speed is the speed limit. Nor am I sure that time is uniform. Many of our best minds, I guess, seem to think other dimensions exist besides the three we navigate in. Another galaxy might be right around a corner. Ufo's seem not confined to our rules of motion like momentum and centrifugal force. It is hard to guess what all their capabilities may be.",
                "good": "7",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "thomaswinslow",
                "time": "21 May, 2021",
                "context": "for us....but maybe not for an alien race that is 100 times more developed than we are...how many times have you heard about things done centuries ago and some say that aliens helped humans make things back then as the technology was not available to us..etc etc....get my drift.....25,000 years for them might be a day at the speed that the UFO;s can travel....",
                "good": "2",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "sangomez",
                        "time": "21 May, 2021",
                        "context": "“maybe, might be, could be...” Yes, it’s possible, but then again it’s pure speculation. There’s no verifiable evidence, even after decades of research.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "democrat=punchingbag",
                "time": "21 May, 2021",
                "context": "The Next closest galaxy is Andromeda, Almost 4 BILLION LIGHT YEARS AWAY. Our galaxy the Milky way is over 150,000 light years across.",
                "good": "1",
                "bad": "1",
                "replies": []
            },
            {
                "user_name": "heywoodjoe",
                "time": "21 May, 2021",
                "context": "Warp drive.",
                "good": "1",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "scott1901",
                        "time": "21 May, 2021",
                        "context": "Yep.\nNothing can travel through space faster than light.\nBut space itself is not constrained.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "M_Lamplighter",
        "time": "15 May, 2021",
        "context": "Crop circles and fuzzy pictures.  They never go away.",
        "good": "7",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "AmericaIsGreat540",
        "time": "15 May, 2021",
        "context": "We can send a rover to Mars for billions of $ to view another planet in color and high resolution yet nearly every image of the \"UFO's\" trickled out to folks is always black-white-grainy.",
        "good": "9",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "web3",
        "time": "15 May, 2021",
        "context": "With all of the footage of police now a days being in HD, perfect focus, you would think that we could at least get one good frame of one of these UFO's.",
        "good": "19",
        "bad": "1",
        "replies": [
            {
                "user_name": "conservativewy",
                "time": "15 May, 2021",
                "context": "I was thinking the same thing.",
                "good": "7",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "M_Lamplighter",
        "time": "15 May, 2021",
        "context": "In WWI, it would be a blimp.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "M_Lamplighter",
        "time": "15 May, 2021",
        "context": "Tell ya what, why don't we send drones to investigate?  Design a \"is it a UFO\" drone.  Or, can't we be bothered?  If someone visited us (from space,) why would they not just present themselves?  Why do we assume there is some natural tension, or fear, or unknown sensitivity?  Would we sneak onto Mars and hide from Martians? Someone traveled here and didn't want to say hi?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "M_Lamplighter",
        "time": "15 May, 2021",
        "context": "If Hollywood had designed more space ships looking like the Borg, all these pictures would be showing fuzzy boxes?   Probably not, they would be called simple mirages or optical irregularities.",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "1fordtech1",
        "time": "15 May, 2021",
        "context": "All the high definition photography available in the world, and this is all we ever get. Blurry blobs",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "BadDemocratPoliciesFor100Alex",
        "time": "15 May, 2021",
        "context": "This could very well be a fake by the US military?  Maybe to fool/distract China?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "AmericaIsGreat540",
        "time": "15 May, 2021",
        "context": "LOL some hoaxes used thin wires with a UFO round shaped disc going back and forth on the cable with a remote control, like the Brady Bunch and Charlie's Angels in the 1970's...",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "blairv",
        "time": "15 May, 2021",
        "context": "All you non-believers make me sick...next thing you'll be saying is\"Mr. Ed\" and \"My favorite Martian\" weren't based on actual occurrences. Wait until the mother ship arrives, you'll be sorry then.",
        "good": "11",
        "bad": "0",
        "replies": [
            {
                "user_name": "bamaforjesus",
                "time": "15 May, 2021",
                "context": "Thank you for that, made my day needed a good laugh.",
                "good": "4",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "alvinsr.",
        "time": "15 May, 2021",
        "context": "Relax people. That was just Nancy testing out her new broom.",
        "good": "18",
        "bad": "0",
        "replies": [
            {
                "user_name": "bamaforjesus",
                "time": "15 May, 2021",
                "context": "Hahahahaha, good one.",
                "good": "5",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "theleftisneverright",
        "time": "15 May, 2021",
        "context": "A malfunctioning pixel.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "JoseMAGA",
        "time": "15 May, 2021",
        "context": "It is ALWAYS fuzzy photos and videos - never clear ones! ... as Elon Musk has pointed out, in these times everyone has super-pixels jammed cell phones you'd think at least one of these shots will be clear.  (And, particularly, with the military having super-zoom equipment!)\n... don't bother us until you get at least one clear shot!",
        "good": "20",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "dreamcatcher",
        "time": "15 May, 2021",
        "context": "I do believe that it is highly likely that in this vast universe there is life in other places.  I just have a great deal of skepticism that anyone from out there has visited us.  They would have to have technology that no one here could possibly understand.  Sure, it is possible but I need better proof than a bunch of grainy videos of crafts moving around like cars leaving a bar parking lot at 2 A.M..",
        "good": "24",
        "bad": "3",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "breakingthewind",
        "time": "15 May, 2021",
        "context": "Does anyone know where I can get hold of a good Box Brownie? I think I am going to take a few UFO photos.",
        "good": "7",
        "bad": "0",
        "replies": [
            {
                "user_name": "sangomez",
                "time": "21 May, 2021",
                "context": "Cut a peephole in a cardboard box and you can duplicate these kinds of photos.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "asis",
        "time": "15 May, 2021",
        "context": "didn't I read somewhere that there is going to be a broadcast in June of this year where they are to tell us show us more of what they have of these?",
        "good": "1",
        "bad": "1",
        "replies": [
            {
                "user_name": "blairv",
                "time": "15 May, 2021",
                "context": "they have a huge landing area in that empty space between Bidens ears..",
                "good": "3",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "asis",
                        "time": "15 May, 2021",
                        "context": "yep its an empty blimp hangar for sure hahahahah...",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "slacktoad",
                "time": "15 May, 2021",
                "context": "It's not a broadcast, it's a report to Congress. Don't expect too much from it, and it may end up being delayed for a few months.",
                "good": "2",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "asis",
                        "time": "16 May, 2021",
                        "context": "I guess what I was saying was who ever they reported it to would be broadcast via some form of communication ...but I had to confirm what I originally posted and it is set for June, and you are probably right will be delayed...they will blame covid maybe?",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "olsquinty",
        "time": "15 May, 2021",
        "context": "was that bigfoot out there?",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "goldspecie208",
        "time": "15 May, 2021",
        "context": "This is what happens when you divide by zero.",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "M_Lamplighter",
                "time": "15 May, 2021",
                "context": "one would think dividing by nothing is the same as dividing by one",
                "good": "0",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "realist12345678",
        "time": "15 May, 2021",
        "context": "Getting pretty sick of these military videos being shot using a potato.\nCan't someone send them an iPhone?",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "BluePin",
        "time": "15 May, 2021",
        "context": "wow its always something that looks like a small ball.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "slacktoad",
        "time": "15 May, 2021",
        "context": "It's just a balloon that drifted down to the water and popped.  Incredible how people can take something so simple and turn it into something so exotic,",
        "good": "3",
        "bad": "3",
        "replies": [
            {
                "user_name": "tornasunder",
                "time": "15 May, 2021",
                "context": "Could be!",
                "good": "1",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "AliceBowie",
        "time": "15 May, 2021",
        "context": "The Aliens are looking for dolphins.\nThey all left the planet before the Vogons got here.\n\"So long, and thanks for all the fish!\", they said.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "maditalian987",
        "time": "15 May, 2021",
        "context": "In this day and age with fantastic cameras, why do all UFO pictures look like they were taken in the 1800's?",
        "good": "3",
        "bad": "0",
        "replies": [
            {
                "user_name": "wbh2",
                "time": "15 May, 2021",
                "context": "They don't want anyone to see what it actually looks like, they have cameras now that can read the watch on someone's wrist from a long ways off. So you know they have very good pictures of these objects.",
                "good": "2",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "kenndog",
        "time": "15 May, 2021",
        "context": "Maybe Edgar Rice Burroughs was right, Pellucidar really does exist...\n(Look it up cupcakes).",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "bhn941",
                "time": "15 May, 2021",
                "context": "Well, Orwell's and Bradbury's \"fiction\" certainly have come true.",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "RevolutionNow",
        "time": "15 May, 2021",
        "context": "We're in Trouble Man !",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "itzik2",
        "time": "15 May, 2021",
        "context": "We are alone in the sense if there were other intelligent life in other galaxies, the distance is so great, there would never be any communication.  As far as intelligent life within our own galaxy, we should have already picked up communication signals (Electromagnetic waves).  As far as intelligent life on Earth, it is certainly missing in the White House.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "PurpleApple",
        "time": "15 May, 2021",
        "context": "Snoop Dog plan and simple.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "thedon348",
        "time": "15 May, 2021",
        "context": "These UFO's are tourists vehicles where aliens pay to go to the Zoo, meaning our planet.",
        "good": "14",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tornasunder",
        "time": "15 May, 2021",
        "context": "If you can find a way to negate the Higgs boson, you can bypass limits of speed and inertia. While we expend billions of dollars (a measurement of attention and resources) on human behavior problems, an alien race that is saddled with none of that could leap far ahead of us in the same time frame of our own existence. The technology gap widens exponentially if that species predates our own. We are own worst enemy. Aliens might not have that problem, and that would make all the difference.",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "datscap",
        "time": "15 May, 2021",
        "context": "Aliens desperately trying to find signs of intelligent life on our planets. Obviously going into the oceans as they have given up on land.",
        "good": "16",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "pt1093",
        "time": "15 May, 2021",
        "context": "I wonder if the transmedium properties also apply to ground.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "therealkilgoretrout",
        "time": "15 May, 2021",
        "context": "If this isn't our military and no other country's military then it must be private.  Some corporation like SpaceX is developing this stuff.  Lockheed, Northrup Grummand, or some upstart billionaire waiting to burst on the tech scene with something new.  It ain't aliens....that I know.",
        "good": "2",
        "bad": "7",
        "replies": []
    },
    {
        "user_name": "elprofe",
        "time": "15 May, 2021",
        "context": "All that defense money and our military can't afford a decent 1080P COLOR camera?\nWhat does the Navy do, spend the money like drunken sailors?",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "error": "error"
    },
    {
        "error": "error"
    },
    {
        "user_name": "villageidiot2",
        "time": "15 May, 2021",
        "context": "Lol...gotta love it. With cell phone cameras in every hand, all the crystal clear videos of people being beaten, shot, robbed, carjacked, abused etc., we still can't get a clear non grainy picture of Big Foot or a UFO.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "fredfakelips238",
        "time": "15 May, 2021",
        "context": "An Amazon delivery by drone went bad.......",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "AmericanPride53",
        "time": "15 May, 2021",
        "context": "Just don't shoot at it!!!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "itzik2",
        "time": "15 May, 2021",
        "context": "Please, someone clean the dirt off of the lens!  All we see is some black dot in grainy photos. With all of the high tech megapixel cameras, can someone actually produce a clear picture of one of these UFOs.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Lcwos",
        "time": "15 May, 2021",
        "context": "Why is it our military spy satellites have the capability to clearly photograph the smallest things from space, but all the UFO films look like it’s taken with a Kodak Brownie....circa 1960",
        "good": "13",
        "bad": "1",
        "replies": [
            {
                "user_name": "tttt695",
                "time": "15 May, 2021",
                "context": "There is classified video.  This is only for public consumption.",
                "good": "10",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "Lcwos",
                        "time": "15 May, 2021",
                        "context": "I assumed as much... the powers that be don’t want to panic the general public ....then there is the religious , scientific and Political groups who could offer up no answers, other than to Blame it on Russia...",
                        "good": "1",
                        "bad": "1",
                        "replies": [
                            {
                                "user_name": "tttt695",
                                "time": "15 May, 2021",
                                "context": "Military doesn't want our enemies to know what our capabilites are for the most part. The majority of intelligence gathering capabilities are classified Secret and above. Won't hit the media ever.   I think you're right as well.  It will rock the world's psyche.",
                                "good": "2",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "user_name": "sangomez",
                        "time": "21 May, 2021",
                        "context": "Yeah, sort of like the teaser for a porn video. (sarc)\n\nThere’s NEVER been verifiable video. This one is certainly not either.",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "bamaforjesus",
        "time": "15 May, 2021",
        "context": "The sooner they can get everyone to believe in space aliens the sooner they can get you to disbelieve in God.",
        "good": "2",
        "bad": "3",
        "replies": [
            {
                "user_name": "1Shadow1",
                "time": "15 May, 2021",
                "context": "That's not what's going on. This has nothing to do with God. Completely different topic.",
                "good": "5",
                "bad": "1",
                "replies": []
            },
            {
                "user_name": "tornasunder",
                "time": "15 May, 2021",
                "context": "Why does one preclude the other?",
                "good": "4",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "Liberty-over-fear",
        "time": "15 May, 2021",
        "context": "This is a video of a flaring Infrared (IR) contact that \"disappears\" when the center of the flare passes below the horizon.\n\nNope, nothing like a plane flying away from the camera could ever produce such an image.",
        "good": "4",
        "bad": "0",
        "replies": [
            {
                "user_name": "slacktoad",
                "time": "15 May, 2021",
                "context": "That's a pretty good observation, assuming black means \"hot\" in the video, which is not entirely clear.",
                "good": "1",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "Liberty-over-fear",
                        "time": "15 May, 2021",
                        "context": "Black is hot in the video. The sky and ocean (Black and White) would be reversed if it was white-hot based on the wave action. The top of the waves cool off to white at the (white caps), which is what would be expected for Black-Hot IR.",
                        "good": "1",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "slacktoad",
                                "time": "15 May, 2021",
                                "context": "Yes, I think you nailed it.  Unfortunately UFO fanatics don't believe in IR bloom so to them it will always be a trans-medium spacecraft.",
                                "good": "2",
                                "bad": "1",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "BadDemocratPoliciesFor100Alex",
                "time": "16 May, 2021",
                "context": "Thanks for the explanation. The 'blinking' at sea level didn't look right.",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "patpaulson5937",
        "time": "17 May, 2021",
        "context": "More garbage.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "gmailbob",
        "time": "21 May, 2021",
        "context": "I bet Raytheon is laughing it up big time..",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "gmailbob",
        "time": "21 May, 2021",
        "context": "St. Elmo's fire is what the ancients called it. stop smoking the weed.",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "abrndow",
                "time": "21 May, 2021",
                "context": "St. Elmo's Fire doesn't occur in free space.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "pyrointampa496",
        "time": "21 May, 2021",
        "context": "\"As many as six of the objects swarmed around the USS Kidd, USS Rafael Peralta and USS John Finn over several days in July 2019, at times performing \"brazen\" maneuvers, the report said.\"\n\nAnd yet we don't have a single picture or video from ANY of these three ships??? The best we can do is one fuzzy cellphone video of a video in a classified interior part of one ship in San Diego?? C'mon.....",
        "good": "2",
        "bad": "0",
        "replies": [
            {
                "error": "error"
            }
        ]
    },
    {
        "user_name": "OlivePlane",
        "time": "21 May, 2021",
        "context": "This story is so old and been repeated so much on Fox, it should be taken to the dump and buried. It stinks.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jfllive1",
        "time": "16 May, 2021",
        "context": "Looks like the game pong... on a planetary scale.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "nordicice",
        "time": "17 May, 2021",
        "context": "I'll believe it when they park in central field and come out to shake hands.  Or tentacles, or whatever.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "fractiousinfidel",
        "time": "18 May, 2021",
        "context": "It's all fun and games until we run out of cow rectums.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "*Jessie*",
        "time": "15 May, 2021",
        "context": "They are studying the effects of a free country turning socialist. They want to avoid our mistakes.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bobby1776",
        "time": "19 May, 2021",
        "context": "Those were magnetic powered atmospheric gravity assisted vehicles. Capable of gravity adjustment that allows extreme speed and maneuverability.  Not so far fetched as it does happen in nature.",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "error": "error"
            }
        ]
    },
    {
        "user_name": "CyanBattery",
        "time": "21 May, 2021",
        "context": "Yawn.  Nothingburger.  We've almost certainly never been visited by extraterrestrials.",
        "good": "0",
        "bad": "2",
        "replies": [
            {
                "user_name": "satmgr",
                "time": "20 June, 2021",
                "context": "never believe; until/if it happens to you!",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "CyanBattery",
                        "time": "21 June, 2021",
                        "context": "Lol!",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "chobbes",
        "time": "19 May, 2021",
        "context": "Probably just a weather balloon.  Say, isn't that boat on the horizon the same one Richard Dreyfuss is on?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "BadDemocratPoliciesFor100Alex",
        "time": "16 May, 2021",
        "context": "Whoever this is uses the ocean for a base of operation.  what are they doing down there? \nis it a military op? science? an outpost?  a hunting trip?\nMy two cents is there seems to be a connection to nukes and stopping the madness, and not necessarily to save us from ourselves, if it is 'them' and not a private or gov advanced tech.",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "ryarios373",
        "time": "17 May, 2021",
        "context": "I can see where this would be concerning.  Usually when the Navy sees something like this and it's not theirs, it's a missile coming straight at you and you only see it for a split second...",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "kitzvonhennegan641",
        "time": "20 May, 2021",
        "context": "looks like a weather balloon caught in a funnel of air like a tornado.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "1951stu",
        "time": "17 May, 2021",
        "context": "Why is it that most videos taken of man made objects are so much clearer than those of unknown origins? If that object in the video was a man made drone we would probably be able to read the make and model. Do aliens have a distortion device?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "imfortrump2020",
        "time": "17 May, 2021",
        "context": "Awww, that's just Stacy coming in to take her yearly salt bath",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "TheTinMan058",
        "time": "20 May, 2021",
        "context": "If what is observed is indeed advanced technology, it is not of this world or from this time. The kinds of technological advances described require vast amounts of resources, countless numbers of people, and many small incremental steps and advances over a long period of time to get there.  We see no pathway to these kinds of advances, and such requirements could not go undetected even by those who weren't even looking for them. There have been no such comparable secret advances ever made in history.  Our most secret technological advance over the last century was probably nuclear weapons, and there were at least 3-4 nations working on that at the same time and each nation knew the other nations had those programs.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "nomorelaws468",
        "time": "21 May, 2021",
        "context": "I would think that in 2019 our tech. ability Would have allowed foe a much more defined photo/video",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "DysfunctionalVeteran",
        "time": "16 May, 2021",
        "context": "IT'S HILLARY'S MISSING EMAILS! SHOOT IT DOWN!",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "beenherebefore348",
        "time": "17 May, 2021",
        "context": "Everybody uses Black and White film these days.",
        "good": "3",
        "bad": "1",
        "replies": [
            {
                "user_name": "wonmug",
                "time": "21 May, 2021",
                "context": "Sorry, you can only use white film so there's no discrepancy.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "GreenCorn",
        "time": "21 May, 2021",
        "context": "I believed it at first, but now I'm a little skeptical.  They claim six of these objects swarmed around the USS Kidd for several days, performing brazen maneuvers.  And in all those several days, they weren't able to get any clearer photos or videos than this?  Something doesn't add up.",
        "good": "7",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "TheTinMan058",
        "time": "20 May, 2021",
        "context": "A perfect example to illustrate the naivety of thinking this could be secret governmental technology that had been successfully hidden from the public is seen in the fact that it was the government's own director of the Pentagon program to investigate UFOs who went rogue and publicly disclosed the most recent evidence.  They couldn't even keep him quiet, let alone many of the others involved.  Stuff will always leak out.  There are no big secrets.  Just ask the Chinese, who thought they could hide the Wuhan lab virus leak, or Bill Clinton.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "urnoturkhakis781",
        "time": "20 May, 2021",
        "context": "Aliens.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "friendlyfire511",
        "time": "16 May, 2021",
        "context": "If people turned on their television & were able to see “Clear or crisp video or photo of  unidentifiable anything, that it would be taken lightly? That’s a obvious answer. In fact this is why I believe what we hear and see is the filtered truth. There is a clear crisp photo of something spectacular somewhere. Of course there is. We just remain in the endless debate of believers/non believers getting nowhere cause that’s exactly where they want us..",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "maranathasoon",
                "time": "16 May, 2021",
                "context": "Releasing a clear photo would lead to a million questions that they don't want to answer at the moment.",
                "good": "3",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "tepree",
        "time": "21 May, 2021",
        "context": "OMG !! We have been invaded by grainy black dots.  Quick !-Sound the grainy black dots alarm !!!!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mackmarine234",
        "time": "21 May, 2021",
        "context": "Here's what the public does know; nothing.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dumpalldemocrats",
        "time": "21 May, 2021",
        "context": "I know that we have much clearer photo's & film, of these \"Objects\" as we have optic's that can picture a license plate from space!!",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "garyc.",
        "time": "22 May, 2021",
        "context": "The obsession with UFO’s is rather humorous really. Not concerned here with man-mad phenomenon, lets focus on intergalactic UFO’s theory. Here’s the scenario, extraterrestrials travel across galactic space in search of what, other comprehensible life? That’s a really good probability. So, they set out on that quest to find what is the equivalent of finding that one grain of sand in the Sahara Desert that has life on it; planet earth. But this is your lucky day, you miraculously encounter planet earth. Now upon arrival you’ve obviously gotten the attention of earths inhabitants by doing what, darting in and out of visibility, changing colors, preforming “physics impossible” maneuvers, in other words in a sense playing games? Really people? There’s no attempt what so ever to communicate but rather a several trillion-mile prank. Extraterrestrials encountering earth is the most preposterous possibility conspiracy theorist (novelist) have come up with yet.",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "shaun1982457",
        "time": "21 May, 2021",
        "context": "I see 4 options for what we are seeing\n\n1) The US has had access to gravity defying technology since before the 50s, perhaps inventions from Tesla's secret files seized after his death.  This would have to be controlled completely separate from the civilian leadership and run by life long career officials sword to secrecy.  This would also mean amazon scientific advances were hidden from humanity for decades.\n\n2.) This is a huge disinformation campaign directed at the people of the world, maybe to lead them to believe the US has access to amazing physics defying technology and dissuade hostile nations from engaging in hostilities.  This could be also be aimed at the American people to create a sense of fear that may allow the changing of certain cultural norms or prepare us for some \"event\" created by the government.  Laws against propaganda used against the American people were lifted by the Obama administration, this was about the time these UFO leaks began.  \n\n3.) Some nation other the the US has developed in secret the technology to defy the laws of physics and has been employing this tech for decades while denying the advanced to the people of the world. \n\n4.) Aliens or an advanced and secret Earth civilization exists and makes regular trips seen by people worldwide who refuse to accept what they see.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "tepree",
                "time": "21 May, 2021",
                "context": "5) it is any number of optical effects, or computer glitches......",
                "good": "1",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "loveyoutoo",
                "time": "21 May, 2021",
                "context": "5.) It's the Israelis spying on us - again.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "wonmug",
        "time": "21 May, 2021",
        "context": "It's a bug on the lens!  Before you start making up all kinds of stories, consider the obvious.\n\nIt disappeared because the bug 'moved\" into a bubble on the lens, and got visually diffused.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "scott1901",
        "time": "21 May, 2021",
        "context": "Joe Biden is proof of extraterrestrial life.\nNo human in bipedal history has ever squinted so hard.\nYou can see him fighting with all three of his alien hearts not to blink sideways across his soulless, beady, black eyes with a second set of eyelids.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "tepree",
        "time": "21 May, 2021",
        "context": "We can offer the real aliens at the southern border citizenship if they go out and capture at least 3 sex offenders.  Call the program Aliens vs. Predators.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "nounitybiden",
        "time": "21 May, 2021",
        "context": "They are here for me and I am ready to go! I hope they are conservatives! LOL",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Preserve_theRepublic",
        "time": "21 May, 2021",
        "context": "Could literally be almost anything, from a shadow, to a small disc shot out of something etc.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "tepree",
                "time": "21 May, 2021",
                "context": "Looks like a clay pigeon just before the 12 ga. hits it !",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "loveyoutoo",
        "time": "21 May, 2021",
        "context": "It's the Israelis spying on us again....",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "hochi084",
        "time": "21 May, 2021",
        "context": "If you want to see aliens, go to our southern border area.",
        "good": "2",
        "bad": "0",
        "replies": [
            {
                "user_name": "Preserve_theRepublic",
                "time": "21 May, 2021",
                "context": "Unfortunately they don’t stay there long",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "sangomez",
        "time": "21 May, 2021",
        "context": "”As many as six of the objects swarmed around the USS Kidd, USS Rafael Peralta and USS John Finn over several days in July 2019” - from the article.\n\nBut none of the hundreds of sailors aboard these Navy vessels were able to capture clear, verifiable videos or photos over these “several days”?! Hmm, sounds fishy to me (no pun intended).",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "CyanFlower",
                "time": "21 May, 2021",
                "context": "well personal cameras or iPhones wont catch a good picture especially over distance BUT..you would think the Navy would have responded immediately after 10 minutes of harassment and had some on board drone with built in weapons that could go out there and take a few pics and shoot it down. Which kind of ships have helicopters? Just aircraft carriers? Or do some smaller ships have at least one copter for rescue ops? Im not a cowardly sailor who gives a ride out to real men like marines to fight wars.",
                "good": "0",
                "bad": "1",
                "replies": []
            },
            {
                "user_name": "satmgr",
                "time": "20 June, 2021",
                "context": "As a previous sailor, I can tell you that during \"some\" cruises all personal cell phones, satellite phones, camera's are held by the Master at arms until a day or two, from returning to port. The person in CIC that took the photo of the \"Monitor\" must have had an illegal sequestered personal camera or cell phone. Had the navy found out, they might have lost their security clearance, and/ or spent time in jail, and/or possibly a bad conduct discharge, forfeiting their retirement pension. This; I think was not a prank as the possible repercussions would be much too severe to even consider accepting.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "CyanWrench",
        "time": "22 May, 2021",
        "context": "I love the way the drone drops beneath the surface, pops back up momentarily and then drops back beneath the surface again.  Those Chiney guys are clever, clever.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ssforever",
        "time": "21 May, 2021",
        "context": "I am going to ask 2 questions....\n1) Why are there never any \"clear\" pictures of these so called UFOs or Bigfoot and etc.\n2) We have never discovered life on any other planet or anywhere else in the universe. I'm not saying we are alone but the galaxies and planetary systems are so spread out that maybe, just maybe, by design we are not suppose to contact anyone nor is anyone suppose to contact us. Even if an advanced civilization has figured out how to warp time and space and out of all the galaxies/planets in the universe, why in the hell would they want to come here?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "billyboy7",
        "time": "21 May, 2021",
        "context": "We are not alone! 😳",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "Preserve_theRepublic",
                "time": "22 May, 2021",
                "context": "We never were alone",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "republicandoingfine",
        "time": "22 May, 2021",
        "context": "They are real.  I’ll leave it at that.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "CyanWrench",
                "time": "22 May, 2021",
                "context": "A reasonable Republican.  You are in rare company.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "steven1960",
        "time": "21 May, 2021",
        "context": "A theory. Yes, that is a craft/machine that belongs to the U.S. Very few know about it. We release \"accidental\" videos taken by people who have no idea on occasion to mess with the Chinese, etc. Good as any I think.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Truth.and.Facts",
        "time": "22 May, 2021",
        "context": "The video image is a successful counter measures from China to spoof  our military radar display.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "satmgr",
                "time": "20 June, 2021",
                "context": "I suppose it's easier to make fun of something one can't explain, because if we really believed in the reality of what we saw, it would scare us all down to our core, and change us to a non pleasant mumbling mental patient forever in fear of the unknown.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "takingnotes",
        "time": "21 May, 2021",
        "context": "Only two pics you will never clearly see are bigfoot and ufo's but you can see your house from space!! smh",
        "good": "3",
        "bad": "0",
        "replies": [
            {
                "user_name": "jmichaelj",
                "time": "21 May, 2021",
                "context": "There's more than two. You're forgetting things like the Yeti, ghost/spirits, Nessy, etc.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "CyanFlower",
        "time": "21 May, 2021",
        "context": "so... the military has their own drones going back before regular people had toy drones. So they didn't launch any to get a better look of the ones harassing them and destroy them?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "thebestpolicy",
        "time": "21 May, 2021",
        "context": "Here we are in 2021 with $50 action cams that have great resolution and they're still posting this grainy low resolution garbage. What are they trying to hide?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "logical-one",
        "time": "21 May, 2021",
        "context": "How come every video of a UFO is always blurry? Seriously?",
        "good": "2",
        "bad": "0",
        "replies": [
            {
                "user_name": "jmichaelj",
                "time": "21 May, 2021",
                "context": "For the same reason that all pics and videos of ghost, bigfoot, etc are.",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "bohica98",
        "time": "21 May, 2021",
        "context": "I just have to wonder why, when anyone with a decent smart phone can produce high resolution color videos in their back yard, nobody, even the military, can't do better than a grainy black & white video of UFO's.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "mytruthhurtsyou",
        "time": "22 May, 2021",
        "context": "they came, took one look at the man-things chaz bono and caitlyn jenner and sped off, shaking their heads while laughing..",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "boxcar84our052",
        "time": "22 May, 2021",
        "context": "\"There's a sucker born every minute\" is a phrase closely associated with P. T. Barnum........Hello Obama!",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "satmgr",
                "time": "20 June, 2021",
                "context": "safety and boredom to all non-believers. because if it ever happens to you; you will never again be safe...or possibly sane again.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "OliveLocomotive",
        "time": "22 May, 2021",
        "context": "High tech Cameras and we cant get a clear picture",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "OliveLocomotive",
        "time": "22 May, 2021",
        "context": "I don't think that is any kind of ship",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "IT$ALL$MAKE$$EN$E",
        "time": "22 May, 2021",
        "context": "When will people finally put 2 + 2 together: Squatch and UFO’s connect. Why else has nobody captured one? We’re busy looking down instead of up. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "joeandho945",
        "time": "22 May, 2021",
        "context": "what u see is just ghost that is all.",
        "good": "0",
        "bad": "0",
        "replies": []
    }
]