[
    {
        "user_name": "beadgBass",
        "time": "8 July, 2022",
        "context": "A \"healthy\" spacecraft I can understand, in a metaphorical way. A \"happy\" one, not so much.\nBut I am glad that things are working out. We are entering a new era of space technology, and that is good. Maybe we can learn to fix things at home on Earth as well, as all of this moves foreward.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dan5047628",
        "time": "7 July, 2022",
        "context": "Let China do all the work then we can steal the info from them like they do from us,",
        "good": "2",
        "bad": "4",
        "replies": [
            {
                "user_name": "quietsmith",
                "time": "8 July, 2022",
                "context": "The ignorant science denier who thinks it's all a conspiracy against Jesus speaks :D",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "Usacitizen199",
                "time": "8 July, 2022",
                "context": "They are much better at stealing.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "dan5047628",
        "time": "6 July, 2022",
        "context": "The Gateway Lunar Space Station if fully funded will be another Great waste of money.\nI think the scientist that are running NASA these days forgot why we stopped going to the Moon.",
        "good": "0",
        "bad": "4",
        "replies": [
            {
                "user_name": "dande-man",
                "time": "6 July, 2022",
                "context": "Wow, 0.48% of the national budget goes to NASA. That small amount not only helps us understand the solar system and planets (Including EARTH which has many NASA earth observation satellites to monitor and record its health) and the universe. Not to mention the fact that it inspires young people to take STEM majors rather than some of the waste of time and money majors. You need to rethink what money is spent where and what we get in return.",
                "good": "7",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "dan5047628",
                        "time": "7 July, 2022",
                        "context": "The Earths health?? It supports 7.5 billion people. Its the healthiest thing there is. \nThat NASA Money is better spent putting criminals in jail that constantly Harass the TAX PAYERS. Space is a waste",
                        "good": "0",
                        "bad": "2",
                        "replies": [
                            {
                                "user_name": "dande-man",
                                "time": "8 July, 2022",
                                "context": "Let me refine my statement for you a little. The Earth Observation Satellites, Terra, Aqua, Aura, for example are measuring and baseline the state of the earth. They have been doing this for decades. This data can be used in the future to compare any changes we see. These measurements are much more than pictures. Earths chemistry, radiation budget etc are all being measured. We can see earth today, healthy, and use these to compare to the future should there be any change, Healthier or not.",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "user_name": "quietsmith",
                        "time": "8 July, 2022",
                        "context": "Oh don't worry, Dan just hates science because it's all a conspiracy against Jesus.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "dande-man",
                                "time": "8 July, 2022",
                                "context": "How un-woke are you. What about Buddha, Ra, Isis, Allah, and the Aztec sun god Huitzilopochtli, sheese...",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "dionysus979",
                "time": "9 July, 2022",
                "context": "I completely forget why we stopped going to the moon?  Was it because we were creating so much useful technology as a byproduct of this incredible achievement we got tired of being so successful?",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "fakeitgoodnasa",
        "time": "7 July, 2022",
        "context": "NASA needs to fake us back to the moon sooner than later. If China fakes it before NASA’s re-fake, then we will lose duping control of the masses.",
        "good": "0",
        "bad": "4",
        "replies": [
            {
                "user_name": "sbignewski",
                "time": "7 July, 2022",
                "context": "Not to mention all the paranoid nutballs who'd have to take their goofy delusions elsewhere.",
                "good": "2",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "quietsmith",
                "time": "8 July, 2022",
                "context": "There are objects on the moon, including mirrors that we reflect things off of, how did they get there? :D",
                "good": "3",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "dan5047628",
                        "time": "8 July, 2022",
                        "context": "your imagination put them there",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "Usacitizen199",
                        "time": "8 July, 2022",
                        "context": "Those are LR3.  Lunar ranging retro reflectors. Google it.  No matter which direction they get hit with light, it reflects it right back.  Timing lasers from earth gives exact distance of moon at that point!",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "quietsmith",
                                "time": "9 July, 2022",
                                "context": "I'm aware of what they are, I'm just pointing out to the nutter that there are objects on the moon :D",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "carter505",
        "time": "6 July, 2022",
        "context": "The Moon, what’s that? Oh, the Moon. Yeah, Xi Jinping, we remember the Moon. No really, knock yourselves out, we’re done with it, she’s all yours. In the 60’s and 70’s we used to use Moon craters as ramps for our dune buggies. Lol, those cats were crazy up there, playing a round of golf…who’d a thought? No, you guys have a good time. Oh, before I forget, we’re going to have life sized drone choppers helicoptering around planet Mars soon. See ya, wouldn’t want to be ya!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "waitingfortheshout",
        "time": "8 July, 2022",
        "context": "The C stands for cis lunar? Are they already doing that s--- in space?",
        "good": "0",
        "bad": "0",
        "replies": []
    }
]