[
    {
        "user_name": "❤DEFENDTHEINNOCENT!",
        "time": "8 May, 2021",
        "context": "They're soooooo cute! ❤ I kept  turtles in an aquarium when I was little . I will always love them!",
        "good": "126",
        "bad": "7",
        "replies": [
            {
                "error": "error"
            },
            {
                "user_name": "Marooda",
                "time": "8 May, 2021",
                "context": "You mean you held them hostage.",
                "good": "13",
                "bad": "71",
                "replies": [
                    {
                        "user_name": "❤DEFENDTHEINNOCENT!",
                        "time": "8 May, 2021",
                        "context": "I was age six to eight and they were set free at the appropriate time , according to what my parents knew at the time .\nI live on the east coast of Florida, we do lots of work in this state to protect sea turtles.  I love turtles !  And that's ok! \nSo.... liberals have nothing better to do than to attack moi over cute turtles this morning.  Wow. Yay. Lol! Incredible.  And I'll bet you drink water out of disposable plastic bottles 😉😆\nWell, try to have a more productive day .    Go make a wealthy democrat politician or activists give up its/their jet/jets.",
                        "good": "31",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "regicidalbestfriend",
                        "time": "8 May, 2021",
                        "context": "Your comment belies your \"bleeding heart\" tree hugging nature, but it did make me laugh.",
                        "good": "16",
                        "bad": "2",
                        "replies": []
                    },
                    {
                        "user_name": "prophet5",
                        "time": "8 May, 2021",
                        "context": "What a woke fool, please go to Starbucks in your Prius with your pita and BLM sticker on the back and order an venti iced caramel triple shot espresso coffee while listening to NPR radio going through the drive thru.",
                        "good": "20",
                        "bad": "3",
                        "replies": [
                            {
                                "user_name": "Dreyes73",
                                "time": "8 May, 2021",
                                "context": "You sure know a lot about the coffee he orders, guess you have some experience?",
                                "good": "2",
                                "bad": "13",
                                "replies": [
                                    {
                                        "user_name": "prophet5",
                                        "time": "8 May, 2021",
                                        "context": "witless",
                                        "good": "1",
                                        "bad": "0",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "user_name": "ajs76400",
                        "time": "8 May, 2021",
                        "context": "speak much out of your real end?  I used to keep turtles, well feed that I found in the creek, and at end of the summer or two I released them (depending on size).  There is probably a gigantic Snapping turtle that I caught as a hatchling in the creek now, that was 6-8 inches in diameter when released",
                        "good": "12",
                        "bad": "2",
                        "replies": []
                    },
                    {
                        "user_name": "brownwatervet",
                        "time": "8 May, 2021",
                        "context": "Talk about woke, you need help quickly.",
                        "good": "8",
                        "bad": "1",
                        "replies": []
                    },
                    {
                        "user_name": "❤DEFENDTHEINNOCENT!",
                        "time": "8 May, 2021",
                        "context": "No, not at all .  it was thirty years ago and I was little girl and my parents gave 3 turtles to me for my birthday on the agreement I'd allow them to be set free after a few years. \n\nWhy are you so hostile?  What do you accomplish with that kind of reply? \nOr, were you kidding?",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "allhypedup",
                "time": "8 May, 2021",
                "context": "After hiding in a storm drain for so long ... it may take some time for them to come out of their shells !!!",
                "good": "23",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "ltecs",
                "time": "8 May, 2021",
                "context": "Georgians have a hippo they keep running for elected office.",
                "good": "23",
                "bad": "3",
                "replies": [
                    {
                        "error": "error"
                    }
                ]
            },
            {
                "user_name": "stevefromspace315",
                "time": "8 May, 2021",
                "context": "Do you know how many HOMELESS could feed with that much turtle soup?",
                "good": "17",
                "bad": "45",
                "replies": [
                    {
                        "user_name": "❤DEFENDTHEINNOCENT!",
                        "time": "8 May, 2021",
                        "context": "Lol! No! Don't want to know! 😆",
                        "good": "2",
                        "bad": "1",
                        "replies": []
                    },
                    {
                        "user_name": "🐶🐶CUTE_PUPPIES",
                        "time": "8 May, 2021",
                        "context": "Eat some carrots  please not the turtles.",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "truthvsfiction",
                        "time": "8 May, 2021",
                        "context": "Food is usually not a critical issue for homeless people. It's mental health, drugs and alcohol. Nothing cool on this planet would have ever been built if we had to worry about how many homeless people we could feed instead. If we really cared as a society for the homeless, we would stop throwing away millions of tons of perfectly good food.",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "lcharlie",
                "time": "8 May, 2021",
                "context": "They're cute when they are that young but baby turtles are also loaded with salmonella, which is why so many states ban the sale of them when they're at such a young age.  Of course, you can go into the Chinatown section of any major city in the USA during the early spring months and the babies are being illegally sold by the hundreds right out on the sidewalks after having arrived here from China.\n\nTurtles also grow up & become an awful lot of work because they're pretty messy little creatures, which is why so many of them end up in storm drains.  I went through a turtle phase when I was younger, what a mess that was, found myself spending way too much time cleaning smelly turtle tanks but they are cute, I'll give you that much.",
                "good": "18",
                "bad": "2",
                "replies": [
                    {
                        "user_name": "❤DEFENDTHEINNOCENT!",
                        "time": "8 May, 2021",
                        "context": "Lol !  My mom I'm sure did the regular cleaning cause I don't remember cleaning the tank at all , but it never smelled or looked bad.",
                        "good": "2",
                        "bad": "1",
                        "replies": [
                            {
                                "user_name": "lcharlie",
                                "time": "8 May, 2021",
                                "context": "You got a good mom.  My mom would've told me it ran away with all the other turtles in America or had to go to turtle heaven after having gotten rid of it as soon as I left for school, long before she would ever clean a turtle tank.  lol  Hates reptiles, which is probably part of the reason I was always bringing them home.\n\nMy 15 year old dog passed away last month so now I'm stuck all alone with this giant 5' long iguana that I bought about ten years back during a lizard phase.  I've taken good care of her this whole time but she still hates my guts & I'm not particularly fond of her either so we just try to respect one another's privacy.  Like having a darn dinosaur in the house, big enough to break out of her cage whenever she wants to so I had to bail her out of jail this winter after she busted through my sliding screen, jumped from the second story & snarled up traffic in the center of town during a snowstorm.  \n\nWalking into the police station next door to bail her out, was rather embarrassing.  lol",
                                "good": "6",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "❤DEFENDTHEINNOCENT!",
                                        "time": "8 May, 2021",
                                        "context": "I'm sorry about your pup ❤ .... My little brother is still in his reptile stage... He has a snake 🤔😄 😲 but  bailing out a lizard, wow!!! , there's a first for everything !",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": [
                                            {
                                                "user_name": "lcharlie",
                                                "time": "13 May, 2021",
                                                "context": "I'm in a blue state so she was let out on her own recognizance. I just had to give her a ride home until the next time she gets busted & set free again.",
                                                "good": "1",
                                                "bad": "0",
                                                "replies": [
                                                    {
                                                        "user_name": "❤DEFENDTHEINNOCENT!",
                                                        "time": "13 May, 2021",
                                                        "context": "Good for you HERO!!!",
                                                        "good": "1",
                                                        "bad": "0",
                                                        "replies": [
                                                            {
                                                                "user_name": "lcharlie",
                                                                "time": "13 May, 2021",
                                                                "context": "lol",
                                                                "good": "1",
                                                                "bad": "0",
                                                                "replies": []
                                                            }
                                                        ]
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "user_name": "dankasull",
                        "time": "8 May, 2021",
                        "context": "The Chinese are so different than other races they might as well be from Mars.",
                        "good": "3",
                        "bad": "4",
                        "replies": []
                    },
                    {
                        "user_name": "nitemoon",
                        "time": "8 May, 2021",
                        "context": "well so what? actually I think pet turtles are forbidden to be sold now arent they?  still cute, and I imagine most every child had one at some time......",
                        "good": "3",
                        "bad": "2",
                        "replies": [
                            {
                                "user_name": "lcharlie",
                                "time": "8 May, 2021",
                                "context": "No they are not, they sell them at every petco in the nation.\n\nThe fact that most kids end up having one, is the reason why pet turtles hardly ever make it to adulthood.  \n\nJust keep your fingers out of your mouth after handling the babies unless you like salmonella, or don't.  We've seen over the last year just how many Americans are incapable of keeping their hands away from their mouths so we had to shutdown the entire country instead.",
                                "good": "6",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "user_name": "#1deplorable",
                        "time": "8 May, 2021",
                        "context": ". . . turtle \"diapers\"? Disposable?",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "1pingyes2pingsno",
        "time": "8 May, 2021",
        "context": "Mitch's relatives.",
        "good": "6",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "chi2virginia",
        "time": "8 May, 2021",
        "context": "Rescuing them was a snap.",
        "good": "38",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "chris.p.bacon224",
        "time": "8 May, 2021",
        "context": "I like turtles.🐢",
        "good": "56",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "karlith",
        "time": "8 May, 2021",
        "context": "Aw. Good show.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "thinkforyoujesus",
        "time": "8 May, 2021",
        "context": "Hahah rescued is not the word for this. Rescue is you save some one or something for the sake of saving them. The only reason they bothered getting those turtles is because it would of blocked a pipe.",
        "good": "1",
        "bad": "13",
        "replies": [
            {
                "user_name": "ajs76400",
                "time": "8 May, 2021",
                "context": "How about you use your brain for a moment.  That those drains might not lead back to there actual habitat and instead could lead to waste water treatment facilities where they end up dead.",
                "good": "1",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "truthvsfiction",
                        "time": "8 May, 2021",
                        "context": "He even has a nonsensical alias. What's that supposed to mean? \"Think for you, Jesus?\" Sounds a bit presumptuous.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "thinkforyoujesus",
                                "time": "9 May, 2021",
                                "context": "Only fox news dumpster trash warriors could get confused by think for you Jesus. I know you guys have the intelligence of a troop of baboons, but this is a new level of stupidity for you.",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "user_name": "thinkforyoujesus",
                        "time": "9 May, 2021",
                        "context": "You honestly think they went to get those worthless turtles for the sake of the turtles? Don't worry I'm sure the corporation poisoning your drinking water does it for the sake of saving the environment.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "truthvsfiction",
                "time": "8 May, 2021",
                "context": "You would probably just make them really sick with salmonella. Maybe just let Jesus think for himself.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "jgrazzi",
        "time": "8 May, 2021",
        "context": "But the school bus sized Alligator remains evasive.",
        "good": "54",
        "bad": "3",
        "replies": [
            {
                "error": "error"
            }
        ]
    },
    {
        "user_name": "WVa741",
        "time": "8 May, 2021",
        "context": "Typically, about 99% of these cuties will be eaten by predators and it is totally normal.  There is a reason why turtles lay so many eggs.  We would be knee deep in turtles if they all survived every year.",
        "good": "31",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "MeOneGoodEye🏴‍☠️",
        "time": "8 May, 2021",
        "context": "My uncle died from a turtle stampede\nIt was a slow death..",
        "good": "244",
        "bad": "8",
        "replies": [
            {
                "error": "error"
            },
            {
                "error": "error"
            },
            {
                "user_name": "hobbithead",
                "time": "8 May, 2021",
                "context": "I traveled construction for years and when I started, my brother and I convinced two co-workers I raised \"Show Turtles\" and carried them to big shows across the USA.  I kept them in a corral and now and then they would stamped and break out.  I saw them nearly get into a fight with others defending me that I raised turtles.  My brother and I still laugh about those times.",
                "good": "18",
                "bad": "3",
                "replies": []
            },
            {
                "user_name": "williamcannon",
                "time": "8 May, 2021",
                "context": "My grandfather was pecked to death by a duck.",
                "good": "20",
                "bad": "4",
                "replies": [
                    {
                        "user_name": "MeOneGoodEye🏴‍☠️",
                        "time": "8 May, 2021",
                        "context": "I bought a mask for my duck, nothing sexy but it fits the bill..",
                        "good": "27",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "williamcannon",
                                "time": "8 May, 2021",
                                "context": "But are your ducks in a row?",
                                "good": "3",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "Nada689",
                "time": "8 May, 2021",
                "context": "Good one! Glad to see something funny.",
                "good": "20",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "chi2virginia",
        "time": "8 May, 2021",
        "context": "Soup’s on !!",
        "good": "4",
        "bad": "2",
        "replies": [
            {
                "user_name": "BlackLivesMadderthemoFreeChittheygets",
                "time": "8 May, 2021",
                "context": "Mmmmmmmm sewer soup. ",
                "good": "4",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "chi2virginia",
        "time": "8 May, 2021",
        "context": "They’ve already voted in the 2024 election.",
        "good": "194",
        "bad": "5",
        "replies": [
            {
                "user_name": "studlymeganuts2",
                "time": "8 May, 2021",
                "context": "I remember some years back when renting a beachfront home in North Carolina and there were strict rules while staying there of the do’s and don’ts to protect the sea turtles hatching along the beaches. Once the turtles (hundreds of thousands of them) headed out to sea, which brought many sharks close to shore to feed on the turtles for food, which also increased shark attacks. It was funny that environmentalists believed the increase in shark attacks during that time was due to climate change…LOL!!!",
                "good": "81",
                "bad": "5",
                "replies": [
                    {
                        "user_name": "juvat99",
                        "time": "8 May, 2021",
                        "context": "You haven't noticed lately that every phenomena is directly related to either climate change or racism? For example, uneven heating of the earth's surface and the earth's rotation for hundreds of years were considered the main causes of hurricanes, but now the woke tell us they're caused by climate change and racism. Earthquakes, wild fires, brown-outs. They're all caused by climate change and racism.",
                        "good": "9",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "❤DEFENDTHEINNOCENT!",
                                "time": "8 May, 2021",
                                "context": "And sometimes gender reveal parties 😉 ya left that out lol!",
                                "good": "3",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "user_name": "nitemoon",
                        "time": "8 May, 2021",
                        "context": "yes, it is a celebration when the females come ashore to lay their eggs, then abandon them, but they are PROTECTED by law, and watched constantly until they hatch and return to the sea.....quite a beautiful spectacle to see!!!!!",
                        "good": "2",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "bb4osu",
                                "time": "8 May, 2021",
                                "context": "Only to be eaten by other sea creatures. What a site to see Mother Nature at work.",
                                "good": "3",
                                "bad": "1",
                                "replies": [
                                    {
                                        "user_name": "❤DEFENDTHEINNOCENT!",
                                        "time": "8 May, 2021",
                                        "context": "Humans eat plants and animals and have for perhaps millions of years..... Even bacteria etc, consume stuff to survive... \n\nLife happens .",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "user_name": "❤DEFENDTHEINNOCENT!",
                        "time": "8 May, 2021",
                        "context": "And isn't it extremely hypocritical and weird that wealthy democrats who live on our coasts live  in extremely expensive residences which frequently use enormous amounts of power , and frequently have private air strips  and are always claiming the oceans will rise and cover the coasts?  Oh, and we have to wear masks and close our economies while they travel extensively not wearing masks ( lots and lots of pics on the internet 🤔 )  , etc. ?\n\nKinda weird , huh?",
                        "good": "7",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "GoldButterfly",
        "time": "8 May, 2021",
        "context": "Kamala Harris smells like she's been hiding in a storm drain.",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mvan71",
        "time": "8 May, 2021",
        "context": "Turtles need rehabilitation?  Pretty sure you could just let them go and they'll be okay",
        "good": "14",
        "bad": "1",
        "replies": [
            {
                "user_name": "SheldonOtter",
                "time": "8 May, 2021",
                "context": "turtles need a hotel room with a sauna in the tub with bowls of bug minnows, and flies to eat",
                "good": "5",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "❤DEFENDTHEINNOCENT!",
                        "time": "8 May, 2021",
                        "context": "😆😆😆😆 !",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "RedFlower",
        "time": "8 May, 2021",
        "context": "I believe they were the 'Teenage Mutant Ninja' turtles working on survival techniques",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "kaiju66",
        "time": "8 May, 2021",
        "context": "Any named for Renaissance painters?",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "RW2",
        "time": "8 May, 2021",
        "context": "I love turtles. The ones with pecans and milk chocolate are the best!",
        "good": "185",
        "bad": "11",
        "replies": [
            {
                "user_name": "retrorock",
                "time": "8 May, 2021",
                "context": "Hate it when I bite into a shell though...",
                "good": "13",
                "bad": "4",
                "replies": [
                    {
                        "user_name": "deelirious",
                        "time": "8 May, 2021",
                        "context": "I hate it more when than shell BITES BACK ! Hey Cletus, cook'em more next time",
                        "good": "0",
                        "bad": "1",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "mrwrightbro",
        "time": "8 May, 2021",
        "context": "So that explains why my local diner is pushing the turtle soup.",
        "good": "18",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "funkhowser",
        "time": "8 May, 2021",
        "context": "Would have been 801 but 1 of them swallowed a plastic straw.",
        "good": "6",
        "bad": "0",
        "replies": [
            {
                "user_name": "socialistmao",
                "time": "8 May, 2021",
                "context": "Yup, each of the others will find a plastic cup that was less important than the straws.",
                "good": "0",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "chi2virginia",
        "time": "8 May, 2021",
        "context": "When do they get their stimulus checks ?",
        "good": "148",
        "bad": "8",
        "replies": [
            {
                "user_name": "Lucky5",
                "time": "8 May, 2021",
                "context": "After they sign up for unemployment and food stamps.",
                "good": "49",
                "bad": "5",
                "replies": [
                    {
                        "user_name": "steverino7",
                        "time": "8 May, 2021",
                        "context": "And register as Democrats.",
                        "good": "2",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "Candycane",
        "time": "8 May, 2021",
        "context": "I gave my tortoise to the Atlantic City Aquarium about 10 years ago because he got to big for me. I hope these weren't his kids.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "papakev",
        "time": "8 May, 2021",
        "context": "\"Healthy turtles can be released at dusk into a tidal creek or bay area\". Then that is what you should be doing instead of holding them for a year. Humans playing God with nature, will we never learn?",
        "good": "121",
        "bad": "16",
        "replies": [
            {
                "error": "error"
            },
            {
                "user_name": "enerlogue12",
                "time": "8 May, 2021",
                "context": "They have to get all three covid shots before they can be sent to Chinatown for soup.",
                "good": "13",
                "bad": "1",
                "replies": []
            },
            {
                "user_name": "steverino7",
                "time": "8 May, 2021",
                "context": "Don't try this at home, they are \"professionals\".",
                "good": "10",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "❤DEFENDTHEINNOCENT!",
        "time": "8 May, 2021",
        "context": "Oh my gosh , this has spiraled out of control!!!! 😆  all I said was that the turtles are soooooo cute! Lol!😆",
        "good": "2",
        "bad": "0",
        "replies": [
            {
                "user_name": "gunvald",
                "time": "8 May, 2021",
                "context": "They are cute.  Only pet we were allowed when we were little.  Read through your posts and you keep up the good work.",
                "good": "4",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "❤DEFENDTHEINNOCENT!",
                        "time": "8 May, 2021",
                        "context": "Thanks ! I will always love them  !",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "socialistmao",
        "time": "8 May, 2021",
        "context": "Biden doesn't make news he crosses of Presidents name on his successes and simply writes Biden over it.",
        "good": "3",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "chi2virginia",
        "time": "8 May, 2021",
        "context": "After the rescue,  the turtles looked around New Jersey and demanded to be put back in the sewer.",
        "good": "199",
        "bad": "6",
        "replies": [
            {
                "user_name": "gunvald",
                "time": "8 May, 2021",
                "context": "No real need for that, you know.",
                "good": "4",
                "bad": "3",
                "replies": [
                    {
                        "user_name": "MiserableOl'Bastard",
                        "time": "8 May, 2021",
                        "context": "That was funny and you know it",
                        "good": "14",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "gunvald",
                                "time": "8 May, 2021",
                                "context": "What I meant is that there is no difference whether they are in the sewer or not!  I live in Jersey.",
                                "good": "10",
                                "bad": "1",
                                "replies": [
                                    {
                                        "user_name": "MiserableOl'Bastard",
                                        "time": "8 May, 2021",
                                        "context": "No problem. Rereading your post made it clear. I thought it was a rebuke",
                                        "good": "4",
                                        "bad": "0",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "MiserableOl'Bastard",
                "time": "8 May, 2021",
                "context": "My girlfriend said \"kiss me where it smells!\"\nSo I drove her to New Jersey\n- Gilbert Gottfried",
                "good": "19",
                "bad": "1",
                "replies": []
            },
            {
                "user_name": "adainv",
                "time": "8 May, 2021",
                "context": "New Jersey and sewer are redundant are they not?",
                "good": "27",
                "bad": "3",
                "replies": []
            },
            {
                "user_name": "flashtx1",
                "time": "8 May, 2021",
                "context": "The original post and most of the replies are FUNNY!",
                "good": "11",
                "bad": "2",
                "replies": []
            },
            {
                "user_name": "Mini24",
                "time": "8 May, 2021",
                "context": "Lol",
                "good": "4",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "helloagainamericanpride",
        "time": "8 May, 2021",
        "context": "Who cares.",
        "good": "1",
        "bad": "3",
        "replies": [
            {
                "user_name": "ajs76400",
                "time": "8 May, 2021",
                "context": "Many actually care, you must care since you took time to post.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "helloagainamericanpride",
                        "time": "8 May, 2021",
                        "context": "There are millions of those things 600 doesn't matter. You should care about our country going down the sewer instead.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "RedFlower",
        "time": "8 May, 2021",
        "context": "\"More than 800 turtles rescued from New Jersey storm drains\"\n\nThe Turtles will featured in various restaurants throughout the State.........Enjoy",
        "good": "4",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "pete0107",
        "time": "8 May, 2021",
        "context": "And this is news?\n\nCmon FOX.... even on a weekend this isn't news..... and yet here I am..... Grrrrr...",
        "good": "1",
        "bad": "4",
        "replies": [
            {
                "user_name": "abc#xyz",
                "time": "8 May, 2021",
                "context": "... a break from the normal insanity can be healthy.",
                "good": "6",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "john.howard",
        "time": "8 May, 2021",
        "context": "Better than a colony of giant ants, I suppose.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Bumsrush1947",
        "time": "8 May, 2021",
        "context": "They are just like the Governor, they live in the sewer, they call New Jersey!",
        "good": "3",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "Fatticous10",
        "time": "8 May, 2021",
        "context": "So!",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "marine0341",
        "time": "8 May, 2021",
        "context": "Just leave the hatchlings alone...before you kill them!!  They probably have been surviving in those storm drains way before there was woke!!!  You do more harm than good!!!!!!",
        "good": "1",
        "bad": "2",
        "replies": [
            {
                "user_name": "ajs76400",
                "time": "8 May, 2021",
                "context": "Nope, its been shown that they have a great chance when rescued, rehabbed  and then released than if left on there own.  Those drains may not lead back to there habitat and could actually lead to the deaths of all of them.",
                "good": "3",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "koredic",
        "time": "8 May, 2021",
        "context": "mmmmm turtle soup",
        "good": "4",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "gman112",
        "time": "8 May, 2021",
        "context": "Heading to Mitch McConnell rally.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "chi2virginia",
        "time": "8 May, 2021",
        "context": "Now if they can find their way out of New Jersey ...",
        "good": "18",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "CyanHelmet",
        "time": "8 May, 2021",
        "context": "Rescued from a New Jersey sewer? Were they turtles or turdles?",
        "good": "16",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Reptrumpmaga33",
        "time": "8 May, 2021",
        "context": "And yet thousands of babies were aborted yesterday... wish America was concerned with preserving human life as they are with animals!",
        "good": "27",
        "bad": "2",
        "replies": [
            {
                "user_name": "Lucky5",
                "time": "8 May, 2021",
                "context": "Good point.",
                "good": "2",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "Moose512",
        "time": "8 May, 2021",
        "context": "Need to make turtle soup or open up a Shell station.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "einshoemaker",
        "time": "8 May, 2021",
        "context": "Snapping turtles...good for turtle sauce picante...\nBad for your fingers and toes.",
        "good": "4",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "kamalasdildo",
        "time": "8 May, 2021",
        "context": "I'm sorry I missed the part about how this contributes to the human race? Besides making mental midgets feel warm and fuzzy, how about we make a super huge pot of Turtle soup to feed the homeless?  ",
        "good": "1",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "MAGA11",
        "time": "8 May, 2021",
        "context": "And they will vote Democrat in the next series of elections.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "VaccineWaters",
        "time": "8 May, 2021",
        "context": "Down the shore...",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Tafo1",
        "time": "8 May, 2021",
        "context": "Stockton...the woke total waste of taxpayer money......FIX OUR ROADS!!!",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Thevigilantconservative",
        "time": "8 May, 2021",
        "context": "Good thing, otherwise these little guys would have taken a shell-lacking!",
        "good": "12",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tdsbullfighter",
        "time": "8 May, 2021",
        "context": "Divine Providence gave us America, freedom, capitalism, the industrial era, and a modern sewer system. Turtles are alive because America WAS great!",
        "good": "8",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "markabbott",
        "time": "8 May, 2021",
        "context": "How many Veterans has the State rescued?",
        "good": "162",
        "bad": "6",
        "replies": [
            {
                "user_name": "vulpes722",
                "time": "8 May, 2021",
                "context": "Just read an article about the thousands of homeless in California, over half in the Los Angeles area. Elected officials are stymied as to how to “care” for them. Perhaps, we should turn the problem over to the “turtle rescuers.” They seem to have a year long program to rehabilitate these turtles. Maybe that would work for the humans?",
                "good": "24",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "steverino7",
                        "time": "8 May, 2021",
                        "context": "Keep them in a cardboard box for a year? And what does releasing them back into the wild look like?",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "rexthedog",
                        "time": "8 May, 2021",
                        "context": "Yeah, I recommend that we place the homeless in a cardboards box for s year.",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "airsea54",
                        "time": "8 May, 2021",
                        "context": "Germany in the late 1930s never had that homeless problem but I don’t know why not? China seems to have avoided it as well. ",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "5klumens",
                "time": "8 May, 2021",
                "context": "How many veterans gather together in storm drains?",
                "good": "3",
                "bad": "4",
                "replies": []
            }
        ]
    },
    {
        "user_name": "MiserableOl'Bastard",
        "time": "8 May, 2021",
        "context": "Renaming the sewer Terrapin Station",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ccamp_fx",
        "time": "8 May, 2021",
        "context": "Rehabilitating for a year?! Talk about job security on the taxpayers dime. ",
        "good": "8",
        "bad": "1",
        "replies": [
            {
                "user_name": "doc126",
                "time": "8 May, 2021",
                "context": "Notice that at the end of the article, they mention that if anyone \"ELSE\" finds one, they can release them as soon as the cold weather is over but for some reason they must hold onto theirs for a year. As you mentioned, \"Job Security.\"\n\n.",
                "good": "3",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "realjms13",
                "time": "8 May, 2021",
                "context": "AKA ninja training",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "#lockdiaperdonup!!...bigly.",
        "time": "8 May, 2021",
        "context": "\"Those little Turtle Heads, Don Jr. and Eric were kicked out of the Special Olympics for using performance enhancing drugs, LOL!!!\"- Bill Cosby",
        "good": "0",
        "bad": "7",
        "replies": [
            {
                "user_name": "abprendergast",
                "time": "8 May, 2021",
                "context": "tot in prison, huxtable!",
                "good": "3",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "john.howard",
        "time": "8 May, 2021",
        "context": "It's the McConnell family on vacation.",
        "good": "3",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "skyguy8591",
        "time": "8 May, 2021",
        "context": "It's New Jersey so you know there's a turtle tax somewhere. Who's going to pay it?",
        "good": "9",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "depswa",
        "time": "8 May, 2021",
        "context": "Lots of turtle soup for some lucky persons",
        "good": "3",
        "bad": "3",
        "replies": [
            {
                "user_name": "abprendergast",
                "time": "8 May, 2021",
                "context": "douche soup for you",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "semfidaugh",
        "time": "8 May, 2021",
        "context": "Nice story",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mizman276",
        "time": "8 May, 2021",
        "context": "ThAnk you volunteers! Kind people regardless of political affiliation.",
        "good": "86",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "jeffwwaa",
        "time": "8 May, 2021",
        "context": "Soups on !!!",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "theloon809",
        "time": "8 May, 2021",
        "context": "Now That's what I call great news, it puts a smile on a person's face!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "super_decathlon",
        "time": "8 May, 2021",
        "context": "and THAT my friends are a lot of prospective teenage mutant ninja turtles!",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bradford85",
        "time": "8 May, 2021",
        "context": "New Jersey ...No wonder they were hiding in the sewers",
        "good": "15",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "mugsy22",
        "time": "8 May, 2021",
        "context": "TLM?",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Valinor99",
        "time": "8 May, 2021",
        "context": "Kudos for saving them...",
        "good": "8",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "leddeadhead",
        "time": "8 May, 2021",
        "context": "Cute little turtles 🐢! Nice job to all the volunteers!",
        "good": "15",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "FloridaManis(R)ight",
        "time": "8 May, 2021",
        "context": "Turn them lose in a big swamp......Like D-C",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "\"Joe'sAbilityToF--kThingsUp\"",
        "time": "8 May, 2021",
        "context": "Where’s Greta??",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "publiustoday",
        "time": "8 May, 2021",
        "context": "Soups on!",
        "good": "3",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "lookthruthesmoke",
        "time": "8 May, 2021",
        "context": "I am begging all of you conservative posters PLEASE do not say that these new found Democrat voters \"ALL LOOK ALIKE\"",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rubiks6",
        "time": "8 May, 2021",
        "context": "I have a pet turtle. His name is Atlas. He holds up the world. (It’s turtles all the way down, y’know.)",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "liberals_are_why_we_can't_have_nice_things",
        "time": "8 May, 2021",
        "context": "Upon hearing the news, Nancy Pelosi started a third impeachment against Trump, claiming Turtle-gate is an \"obstruction of Congress.\"  CNN and 60 Minutes will be running in-depth stories on Turtle-gate and will use it as reasoning why people don't have to vote in person anymore and why black people are so oppressed.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "CharlieWaffles550",
        "time": "8 May, 2021",
        "context": "That alot of teenage mutant ninja turtles.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "no2prosports",
        "time": "8 May, 2021",
        "context": "Darn-it—826 more liberal voters.",
        "good": "7",
        "bad": "0",
        "replies": [
            {
                "user_name": "doc126",
                "time": "8 May, 2021",
                "context": "You will need to visit the local cemetery & give them a name before you can register them to vote.\n\n.",
                "good": "2",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "lookthruthesmoke",
        "time": "8 May, 2021",
        "context": "These turtles die by the billions every spring trying to get to the ocean. It is a natural cycle.",
        "good": "0",
        "bad": "3",
        "replies": [
            {
                "user_name": "CyanBasketball",
                "time": "8 May, 2021",
                "context": "If just one of all these turtles survives, the world will be better for it.",
                "good": "5",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "lookthruthesmoke",
                        "time": "8 May, 2021",
                        "context": "I know they will ALL be \"mail in voting\" Democrat multiple times in the 2022\nmidterms",
                        "good": "0",
                        "bad": "2",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "curtis1220",
        "time": "8 May, 2021",
        "context": "Poor turtles have to live in dem infested cess pools.",
        "good": "13",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "prayingmantis962",
        "time": "8 May, 2021",
        "context": "Keep them safe! AOC wants to make 🐢 🍲. Because it would be a great green deal.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "doc126",
        "time": "8 May, 2021",
        "context": "Notice that at the end of the article, they mention that if anyone \"ELSE\" finds one, they can release them as soon as the cold weather is over but for some reason they must hold onto theirs for a year. Can you say, \"Job Security?\"\n\n.",
        "good": "10",
        "bad": "1",
        "replies": [
            {
                "user_name": "❤DEFENDTHEINNOCENT!",
                "time": "8 May, 2021",
                "context": "Taxpayer funded?  I don't know.....",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "error": "error"
    },
    {
        "user_name": "liberals_are_why_we_can't_have_nice_things",
        "time": "8 May, 2021",
        "context": "Jersey Shore turtles...some had gold chains, fake fingernails and spray-on tans.",
        "good": "16",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cowboycoward",
        "time": "8 May, 2021",
        "context": "It's Trumps Fault!",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rhugh",
        "time": "8 May, 2021",
        "context": "what?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rjapp",
        "time": "8 May, 2021",
        "context": "\"the turtles were hiding from the cold temperatures over the winter\"  I am a little surprised in the cold they were not found wearing turtle necks for warmth. I do give them credit for finding some shell-ter",
        "good": "17",
        "bad": "1",
        "replies": [
            {
                "user_name": "biosci40",
                "time": "8 May, 2021",
                "context": "Best comment.",
                "good": "2",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "❤DEFENDTHEINNOCENT!",
                        "time": "8 May, 2021",
                        "context": "Perfect in fact!",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "mazchaz",
        "time": "8 May, 2021",
        "context": "Kamala says there are more empty cages at the border if you need more space.   We'll swap the border kids for the turtles.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ront659",
        "time": "8 May, 2021",
        "context": "They came out for Biden’s free stuff!",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Lucretzia",
        "time": "8 May, 2021",
        "context": "Why did the Liberal animal rights activist refuse to wear a sweater?....\n\n....Because it was a turtleneck.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "e9c6",
        "time": "8 May, 2021",
        "context": "They're near capacity at the facility they're kept in.Just keep packing them in like they do at the border.It works for VP Harris.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "azbitesback",
        "time": "8 May, 2021",
        "context": "Stockton University said \"Turtle Soup in about a year.\"",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "clb45para813",
        "time": "8 May, 2021",
        "context": "But wait!  With Global Warming, why are they hiding in the sewers?",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mikeb.434",
        "time": "8 May, 2021",
        "context": "And not one of them was wearing a mask",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mountaindog1",
        "time": "8 May, 2021",
        "context": "Now go rescue some homeless Homo sapiens.  t",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "olsquinty",
        "time": "8 May, 2021",
        "context": "wow now that's news!",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "runamok1458",
        "time": "8 May, 2021",
        "context": "Need to get them on government assistance and registered to vote.",
        "good": "13",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "BlueToast",
        "time": "8 May, 2021",
        "context": "Liberals think they are helping again....if there is 800 turtles there they want to be there, genius.",
        "good": "1",
        "bad": "1",
        "replies": [
            {
                "user_name": "einshoemaker",
                "time": "8 May, 2021",
                "context": "Sewers have everything the turtles need to thrive so it would only be natural the libs to do what they think is better for them.",
                "good": "3",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "CyanBasketball",
                "time": "8 May, 2021",
                "context": "Kinda like 81M Americans helped Trump..........Trump was put in Mar-A-Lago because the vast Majority of Americans want him to be there genius.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "BlueToast",
                        "time": "8 May, 2021",
                        "context": "Coming off eating tide pods makes you angry and delusional. I'm almost 40 and haven't heard of a human a would vote for. Go spread your know it all vomit on someone else.",
                        "good": "0",
                        "bad": "1",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "path0gen",
        "time": "8 May, 2021",
        "context": "Nice to read a story like this for a change instead of just another in the never-ending series of Biden disasters and lies.",
        "good": "13",
        "bad": "1",
        "replies": [
            {
                "user_name": "Buzz4444",
                "time": "8 May, 2021",
                "context": "This IS Biden’s turtle crisis!  Don’t worry. It’ll be blamed on trump. ",
                "good": "6",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "hexfly",
        "time": "8 May, 2021",
        "context": "Not sure if \"rescued\" is the right word.  They were there for their own survival and in the spring will come out and go back where they want to be in the warmer weather.  I can't see why there had to be such an intervention.",
        "good": "73",
        "bad": "12",
        "replies": [
            {
                "user_name": "ginasus",
                "time": "8 May, 2021",
                "context": "Maybe.... they would NOT have been able to get out!",
                "good": "20",
                "bad": "3",
                "replies": []
            }
        ]
    },
    {
        "user_name": "ratherbefishing",
        "time": "8 May, 2021",
        "context": "The only thing more ridiculous than the story itself is the fact that it is being reported as news.",
        "good": "5",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "juvat99",
        "time": "8 May, 2021",
        "context": "Way to go, Stockton & volunteers!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "danemama",
        "time": "8 May, 2021",
        "context": "There are innocent kids on the border that are in need of rescuing...Crickets",
        "good": "2",
        "bad": "13",
        "replies": [
            {
                "user_name": "PurpleGrapes",
                "time": "8 May, 2021",
                "context": "Those savages can go back where they came from",
                "good": "8",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "bse2112",
        "time": "8 May, 2021",
        "context": "Ever heard of the circle of life? Make soup and move on! Let mother nature handle her business.",
        "good": "1",
        "bad": "7",
        "replies": [
            {
                "user_name": "wilko",
                "time": "8 May, 2021",
                "context": "Mother Nature didn't put in storm drains.  In unaltered habitat I would agree with you.",
                "good": "1",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "lisanightengale",
        "time": "8 May, 2021",
        "context": "I wouldn't have thought that they hatch that far north, I thought they were more indigenous to the SE U.S.",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "funfolks",
                "time": "8 May, 2021",
                "context": "Saying indigenous is being Racist!! Please retract your horrible statement.",
                "good": "3",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "dbickle",
                        "time": "8 May, 2021",
                        "context": "BLM   will be on this serious problem  and stage riots, burnings and lootings.   Please send location of nearest  Nike   store to their leaders.",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "lisanightengale",
                        "time": "8 May, 2021",
                        "context": "LOL.....It is ? OMG on me :)",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "trollingbothsides",
        "time": "8 May, 2021",
        "context": "Soup!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Buzz4444",
        "time": "8 May, 2021",
        "context": "I just spit out my morning coffee when I read this!  That was great!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Laserbuzz",
        "time": "8 May, 2021",
        "context": "There is 3.5 million for this pet project in Biden’s spending bill",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "sincitypatriot",
        "time": "8 May, 2021",
        "context": "Heading down turtle creek",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dredzo",
        "time": "8 May, 2021",
        "context": "Terrapin Lives Matter!!!",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "pablo1953",
        "time": "8 May, 2021",
        "context": "That's a lot of turtle soup. Sherry please.",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "frizztop",
        "time": "8 May, 2021",
        "context": "Now let me understand.\nTurtles return to the site of their hatching to lay eggs. \nSo are the females in this batch going to return to the sewage system to lay eggs?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dankasull",
        "time": "8 May, 2021",
        "context": "So glad you saved the turtles.  I have my own own program off getting them off the highway as they slowly move across it with cars doing 80 miles an hour.   Thanks for your effort.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "nomos",
        "time": "8 May, 2021",
        "context": "I'll take 5 please",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "congosquare",
        "time": "8 May, 2021",
        "context": "And, man, it is hard to give CPR to a turtle.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dredzo",
        "time": "8 May, 2021",
        "context": "Darned global warming!",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "1jaelsa",
        "time": "8 May, 2021",
        "context": "Why even intervene? Did they need to be rescued? Or were they just doing fine where they were?",
        "good": "2",
        "bad": "3",
        "replies": [
            {
                "user_name": "Buzz4444",
                "time": "8 May, 2021",
                "context": "If there’s more than 800 of them, my guess is they’re doing just fine. What we’ll find out in 5 years is that they were a critical part of the sewer ecosystem that kept the cockroach and other disease carrying insects at bay. By removing them NJ ends up with a dramatic uptick in sickness and disease caused neurological disorders resulting in more people that think like AOC!  ",
                "good": "2",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "rfloyd399",
        "time": "8 May, 2021",
        "context": "This story is turtley awesome!",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "PurpleTrumpet",
        "time": "8 May, 2021",
        "context": "Waiting for someone on the Left to declare this an act of racism or White Supremacy as everything is with them",
        "good": "15",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "defundliberals",
        "time": "8 May, 2021",
        "context": "What exit are those turtles from?",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "drouse70",
        "time": "8 May, 2021",
        "context": "turtles stew",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "deckster01",
        "time": "8 May, 2021",
        "context": "Daughter had a red side slider.  I found it when out duck hunting.  frozen in the ice of a small pond.  I put it in my hunting vest pocket and it revived in the pocket when hung in the garage.  We kept it for several years before releasing it in a small neighborhood pond.  It got so fat it couldn't pull its feet or legs inside its shell.  Painted the back of the shell before releasing it and could still recognize it several years later.  It along with the ducks would come to shore for bread handouts.",
        "good": "4",
        "bad": "0",
        "replies": [
            {
                "error": "error"
            }
        ]
    },
    {
        "user_name": "nitemoon",
        "time": "8 May, 2021",
        "context": "thanks for the rescues and rehabs!!! good luck to those babies!",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "funfolks",
        "time": "8 May, 2021",
        "context": "In an unrelated story “Turtle Soup” will be the featured dish and most Chinese eating establishments after a new found source of the tasty creatures has been located.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cola976890",
        "time": "8 May, 2021",
        "context": "They had s shell of a time.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "GreenFan",
        "time": "8 May, 2021",
        "context": "To Democrats: How many genders do those turtles have? Two right?\nSo why the f. do you degenerates claim there are 64 among humans instead of 2?",
        "good": "13",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "mikeb.434",
        "time": "8 May, 2021",
        "context": "How many of you remember going into the local 5 & 10 store to get a turtle?",
        "good": "94",
        "bad": "1",
        "replies": [
            {
                "user_name": "puckbrandon",
                "time": "8 May, 2021",
                "context": "you get that plastic aquarium with green snap on tree. put the big white turtle thing in with some water and after a few days, it begins to smell. they were cheap ,often ended up dead going down the toilet but as a kid they were cute. Then the salmonella warnings and good bye turtles.",
                "good": "13",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "UncleJoe'sDystopia",
                        "time": "8 May, 2021",
                        "context": "I got one with the painted shells, with the plastic palm tree bowl deal. It lived for about three weeks.",
                        "good": "2",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "skewtour",
                "time": "8 May, 2021",
                "context": "My first pet.",
                "good": "16",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "wadamader4u",
                "time": "8 May, 2021",
                "context": "They cost only 25 cents back then.",
                "good": "16",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "insight3152",
        "time": "8 May, 2021",
        "context": "TLM",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "kick@sstexan",
        "time": "8 May, 2021",
        "context": "Funded by Mr. McConnell...",
        "good": "2",
        "bad": "1",
        "replies": [
            {
                "user_name": "dreamharder744",
                "time": "8 May, 2021",
                "context": "That's mean.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "frizztop",
        "time": "8 May, 2021",
        "context": "OK, more questions than answers in this article.\nHow did these hatchlings get into the drainage system on the first place?\nThe female turtles lay up to 20 eggs per clutch on beaches and the hatchlings head for the ocean right away.\nThis means that this cardboard boxfull is the offspring of dozens of turtles, not just one poor shlemozel that was inadvertently washed into the drain system.\nAnyone who really knows please educate us so that we can sleep at night.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "Proud2BVirginian",
                "time": "8 May, 2021",
                "context": "Diamondbacks are hatched in brackish, marshy areas near the shore and migrate to fresher waters. Mother terps lay eggs usually in 9 - 12 egg clutches. The hatchlings most likely migrated to the sewer system which was producing warmer air temps than was the surrounding area. The box full of hatchlings recovered was undoubtedly from several clutches that hatched in the same area at the same time.",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "cja772",
        "time": "8 May, 2021",
        "context": "They were hiding from the blm painted turtles.\n\nWhich are black\n\nAnd yellow.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "thecomingapocalypse",
        "time": "8 May, 2021",
        "context": "These turtles are receiving better care than we give to our homeless veterans.",
        "good": "6",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "point2note",
        "time": "8 May, 2021",
        "context": "Hiding from the cold when we’re supposed to be in global warming ? ",
        "good": "9",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "PresidentJ.Marionette",
        "time": "8 May, 2021",
        "context": "These little guys have a lot to teach illegal immigrants, lifetime welfare abusers, and beggars about the importance of self-reliance, perseverance, and hard work. I would happily pull 1000 of anything back from the brink as long as they haven't already spent their life relying on others.",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "wackybiker",
        "time": "8 May, 2021",
        "context": "Is that a Joisey Thing?",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "cja772",
        "time": "8 May, 2021",
        "context": "Democrat sanctuary state .\nSAVE THE TURTLES !!!\nabort the babies .\n\nI'm glad the turtles are ok tho .",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "WeForgetForYouRetail🧠",
        "time": "8 May, 2021",
        "context": "They're making their way to Terrapin Station.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "frizztop",
        "time": "8 May, 2021",
        "context": "Another point for the turtle huggers to ponder.\nOut of 100 eggs that hatch, about 1 turtle will survive to adulthood. \nNurturing 800+ hatchlings to age 1 year old probably brings that way up to 50 per 100 surviving.\nIn 10 years time when the females show up to lay eggs, there may not be enough room on the beach, and we may very well be up to our, ahem, \"armpits\" in disgruntled turtles looking to lay eggs anywhere, like in sandpits at kindergartens, in the pitchers mound at the local baseball field and in sand traps at numerous golf courses.",
        "good": "0",
        "bad": "1",
        "replies": [
            {
                "error": "error"
            }
        ]
    },
    {
        "user_name": "bionicmonkey",
        "time": "8 May, 2021",
        "context": "Why?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "allenparker1955",
        "time": "8 May, 2021",
        "context": "More than 800 turtles have been rescued while dozens of black children have been left to die by drive-by shootings in Chicago. Way to go Democrats. You have your priorities straight, don’t you?",
        "good": "4",
        "bad": "1",
        "replies": [
            {
                "user_name": "onatkm",
                "time": "8 May, 2021",
                "context": "Turtles don’t resist!",
                "good": "3",
                "bad": "1",
                "replies": []
            },
            {
                "user_name": "cola976890",
                "time": "8 May, 2021",
                "context": "Turtles are nicer.",
                "good": "2",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "mr.d",
        "time": "8 May, 2021",
        "context": "Another turtle made it to the water...",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "herbertfranklin",
        "time": "8 May, 2021",
        "context": "If Mitch McConnell had a son ...",
        "good": "1",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "demitritg",
        "time": "8 May, 2021",
        "context": "I live \"out in the country\" and for years whenever a Box Turtle (Terrapene Carolina Triunguis) passes through on its way somewhere I like to dust off its shell and paint NASCAR Racing Numbers on both sides then put it back on its path to wherever.  Every once in a while a neighbor will tell me that they had seen a turtle with numbers on it.",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "2112mike",
        "time": "8 May, 2021",
        "context": "Joe an d Ho will register them to vote.",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "shazaamster",
        "time": "8 May, 2021",
        "context": "Always with Fox the same thing, 1/4 of the story, mixed with large amounts of suspect opinion, and 1/2 truth's.  \"Subterranean storm drains\" Now then, did someone hear the turtles call for help?  How were they discovered exactly?  Was someone looking for democrats when they confused sewer with storm drain, resulting in finding turtles instead?  And what kind of volunteer service has access to subterranean storm drains?   Over 800 turtles seems like a good number, so how long was the rescue effort?  How many subterranean storm drains did they search?  Were any of them on or near the Capital on Jan. 6?",
        "good": "3",
        "bad": "8",
        "replies": [
            {
                "user_name": "2112mike",
                "time": "8 May, 2021",
                "context": "Go somewhere else and comment!",
                "good": "3",
                "bad": "3",
                "replies": [
                    {
                        "user_name": "jerseygirl66",
                        "time": "8 May, 2021",
                        "context": "No you go someplace else to get your second grade education, Mr Free Speech.",
                        "good": "0",
                        "bad": "4",
                        "replies": [
                            {
                                "user_name": "2112mike",
                                "time": "8 May, 2021",
                                "context": "You come here to post because CNN & MSNBC don't have / allow a comment section. Their followers are expected to read, listen, do as they are told and not question. They are being used for only a vote... just like you! You are nothing more than sheeple.",
                                "good": "2",
                                "bad": "1",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "jerseygirl66",
                "time": "8 May, 2021",
                "context": "Almost all Fox news story are fraught with errors.",
                "good": "2",
                "bad": "5",
                "replies": [
                    {
                        "user_name": "2112mike",
                        "time": "8 May, 2021",
                        "context": "ALL of the libs stories are fake news!",
                        "good": "1",
                        "bad": "1",
                        "replies": [
                            {
                                "user_name": "jerseygirl66",
                                "time": "8 May, 2021",
                                "context": "I guess you're confused about the use of the word \"fraught\".",
                                "good": "0",
                                "bad": "4",
                                "replies": [
                                    {
                                        "user_name": "joecars",
                                        "time": "8 May, 2021",
                                        "context": "......sounds like you are just confused  !!!",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "user_name": "DDTM2",
                        "time": "8 May, 2021",
                        "context": "ANY news story has errors.",
                        "good": "1",
                        "bad": "1",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "dtsnsd",
                "time": "8 May, 2021",
                "context": "umm... this was written by the Associated Press not Fox News.  ",
                "good": "6",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "2112mike",
                        "time": "8 May, 2021",
                        "context": "BURN!",
                        "good": "1",
                        "bad": "1",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "maxinestaxadermist",
        "time": "8 May, 2021",
        "context": "Can't blame the turtles. Fuel prices are soaring.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "hillbillyranger",
        "time": "8 May, 2021",
        "context": "They do realize that once born in the sewers the turtles will travel huge distances to get back to where they were born right? so if they take them away and let them go in the wild they WILL be back. Oh yeah and where is Momma? The one that laid the eggs, is she still there? Nice attempt on their part though.",
        "good": "1",
        "bad": "2",
        "replies": [
            {
                "user_name": "leveraction30-30",
                "time": "8 May, 2021",
                "context": "The Baby Momma is nearby. The Baby Daddy is long gone. Biden has already cut a check to the Baby Momma.",
                "good": "0",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "Millennial_Capitalist",
        "time": "8 May, 2021",
        "context": "The turtles are still waiting for their tax return ",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "everyday",
        "time": "8 May, 2021",
        "context": "Day 2 of Kamala ignoring the turtle crisis in New Jersey",
        "good": "14",
        "bad": "1",
        "replies": [
            {
                "user_name": "NationalJester",
                "time": "8 May, 2021",
                "context": "Ignor-Aunt Kamala.",
                "good": "3",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "saywhatpunk1955",
        "time": "8 May, 2021",
        "context": "awesome.....nice move people......",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "nightowl13",
        "time": "8 May, 2021",
        "context": "Well done! 👍",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "muchogusto",
        "time": "8 May, 2021",
        "context": "If you look quick at turtle picture looks like a border crisis picture",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "silkydaddyo7",
        "time": "8 May, 2021",
        "context": "I seriously can't more about turtles than I do communist",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "paldookie",
        "time": "8 May, 2021",
        "context": "Extras from Ninja Turtles TV show awhile back.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Commom_Cents",
        "time": "8 May, 2021",
        "context": "Democrats in NJ registered them for next election cycle, and will harvest the votes as needed...",
        "good": "9",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "cqql72",
        "time": "8 May, 2021",
        "context": "The turtle homeless camp looks overcrowded.  If they got into the drain, why couldn’t they get out.  ",
        "good": "3",
        "bad": "0",
        "replies": [
            {
                "user_name": "stephanieyork",
                "time": "8 May, 2021",
                "context": "Mama laid their eggs there. Now they are out in the world!",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "carrot3015657",
        "time": "8 May, 2021",
        "context": "cowabunga!!!",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "NationalJester",
        "time": "8 May, 2021",
        "context": "So THAT'S what turtles do during the winter!",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "offgridx",
        "time": "8 May, 2021",
        "context": "Don't tell the Chinese where those turtles are they will be dinner",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rightside101",
        "time": "8 May, 2021",
        "context": "A kid in my town died from salmonella he picked up from his turtle. It was one in the string of deaths that led to the bans.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "NationalJester",
        "time": "8 May, 2021",
        "context": "Soup, anyone?",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Bring_It_On",
        "time": "8 May, 2021",
        "context": "I'm sure they will get ballots from the Dem's.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jerry96150577",
        "time": "8 May, 2021",
        "context": "It should be noted that the Biden Administration blames Trump for the turtles being in the storm drain.",
        "good": "18",
        "bad": "1",
        "replies": [
            {
                "user_name": "gsaogb",
                "time": "8 May, 2021",
                "context": "you are approaching stage 4 BDS",
                "good": "0",
                "bad": "5",
                "replies": [
                    {
                        "user_name": "jerry96150577",
                        "time": "8 May, 2021",
                        "context": "Dude you have over 31,000 comments and not 1 more than 1 line long.  Do you get paid per comment or just don't have a life.  There is nothing in any of your quotes to reveal weather you have and knowledge or intelligence.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "gsaogb",
                                "time": "8 May, 2021",
                                "context": "$5/post from Soros.",
                                "good": "0",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "jerry96150577",
                                        "time": "9 May, 2021",
                                        "context": "I believe it.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": [
                                            {
                                                "user_name": "gsaogb",
                                                "time": "9 May, 2021",
                                                "context": "easy money",
                                                "good": "0",
                                                "bad": "0",
                                                "replies": []
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "americanatbirth",
        "time": "8 May, 2021",
        "context": "Yaaa great work saving these turtles.",
        "good": "4",
        "bad": "0",
        "replies": [
            {
                "user_name": "joecars",
                "time": "8 May, 2021",
                "context": ".... and we are paying for it  !!!",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "patriot1amer",
        "time": "8 May, 2021",
        "context": "Those are not turtles. They are Democrat mail in voters.",
        "good": "7",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "poopsicle",
        "time": "8 May, 2021",
        "context": "Hmmm...rescued? They were the only things holding back major crimes in the city. Has no one never heard of nor seen Teenage Mutant Ninja Turtles? Or are they thinking more Dana Carvey & The Master of Disguise?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "NationalJester",
        "time": "8 May, 2021",
        "context": "We have at least 50 turtles behind our house, and they scurry back into the water if you get within 50 yards of them. New Jersey turtles must be a little slow.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "coolhandluke66",
        "time": "8 May, 2021",
        "context": "Why didn't they rescue any of the turdles?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "brianr4k",
        "time": "8 May, 2021",
        "context": "So heartwarming to see that New Jersey will spend a ton of money helping homeless turtles, but won't spend a dime helping homeless veterans.",
        "good": "7",
        "bad": "5",
        "replies": [
            {
                "user_name": "CyanBasketball",
                "time": "8 May, 2021",
                "context": "Aren't veterans former employees of the Federal Gov't?",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "BIGJOE409",
        "time": "8 May, 2021",
        "context": "Biden will tax it somehow. Call it a Turtle Tax!",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "OlivePlane",
        "time": "8 May, 2021",
        "context": "Hmmmmm.... I am surprised the alligators didn’t eat them!",
        "good": "0",
        "bad": "3",
        "replies": [
            {
                "user_name": "legaldreamer",
                "time": "8 May, 2021",
                "context": "Alligators in New Jersey? Unless someone had one as a pet they escaped and bred with others, but I highly doubt it.",
                "good": "2",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "OlivePlane",
                        "time": "8 May, 2021",
                        "context": "Seem my post to YogurtBerry.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "legaldreamer",
                                "time": "8 May, 2021",
                                "context": "Sometimes it's hard to tell if someone is being serious or not unless you insert <sarc> or type an emoji, or \"jk\".",
                                "good": "1",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "OlivePlane",
                                        "time": "8 May, 2021",
                                        "context": "Thanks.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "YogurtBerry",
                "time": "8 May, 2021",
                "context": "You sound like a Trumpet.\nNo alligators in New Jersey, dummy.",
                "good": "0",
                "bad": "3",
                "replies": [
                    {
                        "user_name": "OlivePlane",
                        "time": "8 May, 2021",
                        "context": "Go to Walmart and buy yourself a new sense of humor. There has been urban myths for years about aligators living in New York’s and Newark’s storm drain systems.",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "Dr.KrentistDDS",
        "time": "8 May, 2021",
        "context": "U of M Go Terps!",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "OLLIE.OOP",
        "time": "8 May, 2021",
        "context": "Myrtle hon, git me my soup pan.",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "mtrelles",
        "time": "8 May, 2021",
        "context": "So when all get big enough after a year to survive in the wild, ten years after that, when they return to breed, the drains will be clogged with a million little turtles.  The democrats will then need another billion bucks to clean out the Jersey pipes.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "soonergary",
        "time": "8 May, 2021",
        "context": "I hope they vaccinated the turtles!!!",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "dilliedillie",
        "time": "8 May, 2021",
        "context": "The turtles have somehow already registered as Democrats and had successfully mailed in their ballets.",
        "good": "14",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "holdon",
        "time": "8 May, 2021",
        "context": "I brought back baby  alligator turtles from florida not long ago, when they grew to about 8 inches one of them kept trying to bite me, so I let then loose in a nyc pond",
        "good": "3",
        "bad": "7",
        "replies": []
    },
    {
        "user_name": "stivbators",
        "time": "8 May, 2021",
        "context": "bring on the thumbs down for my next comment....\n\"Soup Anyone?\"😁",
        "good": "4",
        "bad": "3",
        "replies": [
            {
                "user_name": "talcomx",
                "time": "8 May, 2021",
                "context": "Tastes like beef.",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "5shotz",
        "time": "8 May, 2021",
        "context": "my great grandma had a turtle, it's been passed down generation to generation, doggone things live forever.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sirlogic",
        "time": "8 May, 2021",
        "context": "Finally a positive story. Turtles are so sweet.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bombplane342",
        "time": "8 May, 2021",
        "context": "I like Turtles!",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "freebirdhankster",
        "time": "8 May, 2021",
        "context": "So happy together.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "gunsnguitars",
        "time": "8 May, 2021",
        "context": "Now, if they could only rescue democrat run New Jersey.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "gallowspoll",
        "time": "8 May, 2021",
        "context": "They'll be back.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "drschnitzel",
        "time": "8 May, 2021",
        "context": "i have an old cajun turtle soup recipe if that helps.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "5shotz",
        "time": "8 May, 2021",
        "context": "my great grandma had a turtle, passed down gen. to gen., doggone things live forever.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cinnamongrl",
        "time": "8 May, 2021",
        "context": "The turtality of it!",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "joecars",
        "time": "8 May, 2021",
        "context": "..... Nature thins the herd by famine, disaster and stupidity !!! ... leave them alone  !!!",
        "good": "6",
        "bad": "1",
        "replies": [
            {
                "user_name": "citizenusaone",
                "time": "8 May, 2021",
                "context": "Covid-19 is also thinning the herd. More to come.",
                "good": "2",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "joecars",
                        "time": "8 May, 2021",
                        "context": ".. it was planned that way  !!!",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "kansas68",
                "time": "8 May, 2021",
                "context": "I sense you possess a  deep understanding of evolution.",
                "good": "0",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "joecars",
                        "time": "8 May, 2021",
                        "context": "... yes, I have a good sense that you weren't born an AH .... but worked hard to achieve that status  !!!",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "CyanBasketball",
                "time": "8 May, 2021",
                "context": "Yet somehow you're still here.",
                "good": "0",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "alwaysskeptikal",
        "time": "8 May, 2021",
        "context": "in order to get their shells clean and shiny, they used ____________________________turtle wax",
        "good": "7",
        "bad": "0",
        "replies": [
            {
                "user_name": "saywhatpunk1955",
                "time": "8 May, 2021",
                "context": "now that right there is funny.......hummmmmmm",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "speedyone",
                "time": "8 May, 2021",
                "context": "They wash their armpits with ....Turtle Dove",
                "good": "3",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "talcomx",
                        "time": "8 May, 2021",
                        "context": "They wear turtle necks and tortoiseshell glasses.",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "SagittariusA*",
        "time": "8 May, 2021",
        "context": "Now I just need TGRI to release a couple containers of green ooze and I’ll have an army of ninja turtles! Whuhaha!",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "lmephd851",
        "time": "8 May, 2021",
        "context": "Awe, how cute.  I wonder did Dr. Fauci insist that they needed to be quarantined for 2 weeks and then masked up and socially distanced?  Could they actually be released into their own community and visit one another without being labeled as \"super spreaders\"?  Just goes to show you turtles are smarter than some of our \"experts\".",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "gotstuff",
        "time": "9 May, 2021",
        "context": "Hey Jersey Shore Jerks, quit flushing your g o d d a m n pet store turtles down the Toilets!!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "NOTfish'n",
        "time": "8 May, 2021",
        "context": "Why is this on FOX,  is this a left coast conspiracy..... Not ... I come here to comment on the Lefts destruction of our institutions etc.... U guys going soft ?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "illudiumq36explosivespacemodulator",
        "time": "8 May, 2021",
        "context": "800 Turtles just happens to be the name of my band!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "stephanieyork",
        "time": "8 May, 2021",
        "context": "I LOVE TURTLES!  They are curious, mild-mannered and so so cute. Thank you to everyone who helps or rescues turtles!!!",
        "good": "2",
        "bad": "0",
        "replies": [
            {
                "user_name": "katarzyna111",
                "time": "8 May, 2021",
                "context": "Except Snapping turtles ;)",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "NOTfish'n",
        "time": "8 May, 2021",
        "context": "I like turtles too but their like catfish ... Full of pesticides, herbicides, fungicides etc.. Very bad for you...",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "publiustoday",
        "time": "8 May, 2021",
        "context": "Soups on!",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "OliveGoggles",
        "time": "10 May, 2021",
        "context": "If you are in the sewers you gunsta talk about the turtles, Terry 😂",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "OliveBullhorn",
        "time": "8 May, 2021",
        "context": "Turtle Soup, Its what's for Dinner ...",
        "good": "0",
        "bad": "2",
        "replies": []
    }
]