[
    {
        "user_name": "383stroker",
        "time": "16 September, 2022",
        "context": "The things that make you go......Hmmmm!!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "abraham12",
        "time": "16 September, 2022",
        "context": "FBI is spending even more money on PUBLIC RELATIONS, while running around to school board meetings and making \"tag lists\" of conservatives who speak up in case they are \"domestic terrorists.\"  wow\n    Christopher Wray has NOT cleaned up the POLITICS in the FBI.",
        "good": "75",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "stonetalons",
        "time": "16 September, 2022",
        "context": "“[Trump’s] not ever going to become president, right? Right?!” the lawyer, wrote to Strzok. \n“No. No he won’t. We’ll stop it,” Strzok responded.\n\n--- Democrat Strzok, Deputy Assistant Director, FBI.",
        "good": "105",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "son12",
        "time": "16 September, 2022",
        "context": "ZZZZZZZZZZZZZZZZZZZZZZZZZZZ ! Written by a biased employee of the FBI !! Meanwhile Americans still remembering James Comeys ( former Director)  inaction and top agents Strock and Page actions and shenanigans' etc !! Not to mention the most recent inaction of FBI to investigate Hunter Biden and his laptop etc !! Then the raid on the Trumpster residence !",
        "good": "39",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Simpleman85",
        "time": "16 September, 2022",
        "context": "This isn’t just about the Trump fiasco.  This goes back all the way before 9/11.  If this agency wasn’t mired in the bureaucratic swamp, so many things that happened, things highlighting their ineptitude.  Saying that, this agency has many people trying to execute their jobs without bias, truly trying …. But, over time, the internal infighting inside the FBI and other policing and intelligence agencies is atrocious.  The credibility with other policing organizations, speaking about local and state, is they are always stuck cleaning up after the FBI comes in…..",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "stonetalons",
        "time": "16 September, 2022",
        "context": "The bias and corruption of the FBI has been on display for years. You can believe this article or your eyes.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "redpilledconservative",
        "time": "16 September, 2022",
        "context": "The FBI has become the enforcement arm of the democrat party - Facebook sends them messages about people posting \"wrong think\", so the new Gestapo will show up at their door to intimidate them...",
        "good": "12",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "discipilesofiron235",
        "time": "16 September, 2022",
        "context": "Don't believe it for one minute. Since the Clintons, the Obamas, the Bidens have never been charged. Complete BS. And we have open borders with drugs, criminals, gang members, guns, flowing across the border every minute. If the FBI was concerned about our well being the border would be secure with the wall completed as they would be fighting for it. And I do not hear one peep about that. Nor the fact that they allowed corruption in government to get out of control.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "loydc030",
        "time": "16 September, 2022",
        "context": "Most of the FBI's rank and file \"might\" be as unbiases as the author states, but it's leadership has severely damaged the trust Americans have traditionally held for the agency.  Too many examples of incompetency and bias in the very recent past.  Anyone want to take the position that the Nassar and Epstein investigations were well executed?  Or how about lying on an affidavit and the use of a political hit piece (Steel dossier) for FISA warrants.  Or the constant leaking?  Or dragging their feet on the Hunter laptop investigation to influence an election.\n\nThe trust is gone.  It is unclear that it can ever be restored.",
        "good": "178",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "Panamamcc",
        "time": "16 September, 2022",
        "context": "I hope thats true… and I really wish I could believe it. ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "stonetalons",
        "time": "16 September, 2022",
        "context": "The Intercept founding editor [Glenn Greenwald] claims journalists working with 'FBI, CIA and the NSA ... to manipulate the American people'\n--- Fox News  10/20/20",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ironworker043",
        "time": "16 September, 2022",
        "context": "TAXPAYERS Own Schools Not teachers union- YOU Run for School Board Fix Them --------------------------------------------------------Its For U S Kids",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "optimusnegative",
        "time": "16 September, 2022",
        "context": "In my observation, the past 49 years the FBI has caused more bungles and failed to do their job. There might be a few departments, but the overall reputation of the FBI is/was and has been tainted by their OWN actions. In a whole, the FBI needs to disarm and disbanded due to internal incompetence at every level.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "discipilesofiron235",
        "time": "16 September, 2022",
        "context": "I am not sure how much I trust the FBI when the purposely know they are doing is wrong but do so because their boss told them to or they may lose their jobs. I wonder what percentile of the force this is?",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "stonetalons",
        "time": "16 September, 2022",
        "context": "\"Bizarre arrest of FBI agent spotlights accusations of bureau corruption\"\n--- New York Post   7/21",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "stonetalons",
        "time": "16 September, 2022",
        "context": "\"Barack Obama Has Missing Records. When Will the FBI Ransack His House?\"\n--- Townhall",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "ironworker043",
        "time": "16 September, 2022",
        "context": "Vote GOP Governors They Jan Remove a Bad city = D.A. - Jail Drug gangs- Looters- Burners Cities",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dbush1809",
        "time": "16 September, 2022",
        "context": "While some of what Mr. O'Hare says is perhaps true, we have seen plenty of examples of where the FBI has become political.  Failing to investigate Hunter Biden's connections with foreign nations, warning mass media about 'fake news' but only the stuff that would hurt President Trump and/or Republicans, supporting the raid of a Presidents home and agents that were blatantly politically biased but did not suffer any repercussions at all.  No, Mr. O'Hare, the FBI is tarnished and until it cleans house, it will stay that way.",
        "good": "262",
        "bad": "9",
        "replies": []
    },
    {
        "user_name": "ironworker043",
        "time": "16 September, 2022",
        "context": "Vote GOP== Jail J- Biden -----H- Biden ----------Jan 16",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "discipilesofiron235",
        "time": "16 September, 2022",
        "context": "It is just like all government agencies and departments now. They are becoming too big, too woke, too political to be effective. All they care about is their benefits and golden parachutes as government jobs were always easy and high paying jobs. Where else will they pay you your salary for life? And that is the problem since entitlements are over 50% of the Federal budget. So it isn't Defense or Social Security that is bankrupting the US, it is Federal benefits, salaries, and pensions. Pension that should have be removed decades ago.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "stonetalons",
        "time": "16 September, 2022",
        "context": "“WOW! DOJ Officials Reading Through Over 10,000 Texts Between Anti-Trump Investigator Strzok and His FBI Mistress”  \n --- Gateway Pundit\n \nThe FBI’s budget needs to be greatly cut. If their agents have this much spare time on their hands they are way overstaffed.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sierrasnowfall7777",
        "time": "16 September, 2022",
        "context": "I am sure the good ones are. It is Garland and Fray and other like them that are not. Time for them to go!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "HoodoooVoodooBlood",
        "time": "16 September, 2022",
        "context": "More importantly:\nDonald is defeating himself. He always has and he always will.He's an odd combination of a huge compensatory ego construct and a self-destructive ego construct.\nHe's currently fomenting another insurrection. Having failed on January 6th and his ego not being one to acknowledge failure, he now is embracing QAnon and is today, preparing his emotionally charged minions for the streets should he be indicted. \nHis backs against the wall. He's painted himself into another corner, a noose of his own making tightens around his neck.\n'Common Sense' Americans know this. \nThe fringe simians among us who worship him as their celebrity-media-star turned politician idol, are the real victims and their very existence screams for much better education and family support in our country.\nBiden is strongly advised to have the Pentagon and the National Guard prepared. In the end it will be indictment, or, exile for Donald and he'll choose exile once he realizes his planned insurrection is well anticipated and will fail.",
        "good": "0",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "theregulator",
        "time": "16 September, 2022",
        "context": "They have made it political by their failed investigations of Trump and wasting taxpayer money by doing so. If they put half of that effort into real crimes I might have a little respect for them",
        "good": "89",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "maddog49",
        "time": "16 September, 2022",
        "context": "Brian O'Hare, YOU ARE A LIAR!  It is far too late to credibly claim that the FBI and DOJ have no political bias.  \n\nMerrick Garland released a list of Jan 6th arrests in Winter 2021.  Many arrested Trump supporters had an UNINDICTED CO-CONSPIRATOR arrested with them.  Yahoo News and Orange County Register (California) each profiled one pair of Trump supporter/Co-Conspirator.  In both cases, the Trump guy was at least 65 years old, while the Co-Conspirator was an undercover FBI agent.\n\nThis means the FBI was running a sting against President Trump while Trump was its boss!  And Atty Gen William Barr knew nothing about it.\n\nLast year, the FBI began investigating parents who fought the teaching of Critical Race Theory and gender reassignment in their children's schools.  President Biden brazenly called the parents \"terrorists,\" thus his FBI was all over them despite the fact they had done nothing wrong.\n\nTrump associates are being rounded up by Biden's FBI, this year.  Dictators make POLITICAL PRISONERS of their opposition.  President Trump NEVER rounded up Obama associates, not even one!\n\nThe FBI had NO INTEREST in the widespread rioting of 2020, despite many police departments BEGGING for help.\n\nThe next Republican President has to clean out both the FBI and the DOJ.  Anybody protected by the union must be stripped of duties and left with nothing to do.  Higher level managers can be fired.  This takes a YOUNG President working 80 hrs/wk!",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "ironworker043",
        "time": "16 September, 2022",
        "context": "? fbi did Nothing- College groups tell Young vote at college Then MAI Votes Home JAIL Them",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Greytmom4",
        "time": "16 September, 2022",
        "context": "The FBI has been a corrupt organization since before J. Edgar Hoover. Hoover was a piece of work, first coming on board to “clean up” the FBI then finding out what fun it was to get dirt on as many politicians and high level governmental employees he could. He turned into a power hungry, sadistic, mentally deranged individual for over 48 years. When he died the mantel was passed on along with “secret” papers on various politicians, even though many documents were destroyed there were hundreds and hundreds of docs that were not. And there we have the FBI today an organization that continues to raid, pillage and destroy people in it’s path who are either a threat to the FBI or those they represent. \nWe need a Congress and Senate majority that will clean up not only the FBI but the DOJ, CDC and NIH. The calvary is coming in November, you people out there know what needs to be done in all aspects of this administration.\nGet out and vote conservative, if you don’t you are not going to like what Biden and his cohorts have planned for us going forward. Do you like the high price of gas? Higher prices at the grocery store? Open borders? Crime out of control? How does your 401K, your 403B accounts look? How are your IRA accounts doing? You do know that if you plan on retiring in the next 5 years, you will not be able to make up what you’ve lost in your retirement accounts? That’s a sad commentary for all of the years and hard work you’ve put in.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "stonetalons",
        "time": "16 September, 2022",
        "context": "“The heads of Obama’s FBI and CIA both voted for Communists during the Cold War, yet were somehow able to move up the ranks within the same US intelligence community that had spent decades fighting that very ideology.”\n--- Citizen Free Press May 2019\n\nThese communist sympathizers appointed by Obama helped the Democrats with their coup attempt against President Trump and our nation.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "theenigma846",
        "time": "16 September, 2022",
        "context": "I firmly believe that most of the FBI are good people who want to do what’s right, but are severely hampered by bureaucratic leadership who are all about their own agenda.",
        "good": "34",
        "bad": "10",
        "replies": []
    },
    {
        "user_name": "RuiRita",
        "time": "16 September, 2022",
        "context": "Walks like a duck, quacks like a duck... It certainly isn't anything else. The FBI's actions have tainted their reputation and we all see the effect. Partisan hacks and attacks. They are not alone. the DHS, CIA and all the 3 letters are absolutely septic with rot...",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Greytmom4",
        "time": "16 September, 2022",
        "context": "I will not paint all FBI agents with a broad brush there are a lot if them that are hard working individuals just doing their jobs. The ones at the top have to go though.",
        "good": "64",
        "bad": "7",
        "replies": []
    },
    {
        "user_name": "TheGreenWeenie",
        "time": "16 September, 2022",
        "context": "The FBI agents on the front lines may be, but the administration is in the political pockets of the left.",
        "good": "51",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tracer670",
        "time": "16 September, 2022",
        "context": "No one trust the FBI now a pawn of the left",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ironworker043",
        "time": "16 September, 2022",
        "context": "Congress Job- Put Cameras in All-------------School ROOMS--------All",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "thruthful",
        "time": "16 September, 2022",
        "context": "The criminals are working the street and the American taxpayers are being harassed by the FBI, provoking the law-abiding citizens to make arrests.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "GunsAGoGo056",
        "time": "16 September, 2022",
        "context": "And, I have a bridge, if you are interested.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "accountability091",
        "time": "16 September, 2022",
        "context": "Yes, most of the FBI does do their job patriotically.  Its the leadership that should be in prison and unfortunately they have tainted the entire FBI.  A student cheats and the teacher makes the entire class retake the test, no different here.  I appreciate their hard work but the organization is not longer of use to the U.S. We need to start a new department and make sure there is no political bias but that will be pretty much impossible.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "stonetalons",
        "time": "16 September, 2022",
        "context": "“[Trump’s] not ever going to become president, right? Right?!” the lawyer, wrote to Strzok.\n “No. No he won’t. We’ll stop it,” Strzok responded.\n\n--- Democrat Strzok, Deputy Assistant Director, FBI.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "metoo!",
        "time": "16 September, 2022",
        "context": "DISBAN THE FBI!",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "protrump,prousa",
        "time": "16 September, 2022",
        "context": "Rabid dogs - Here are the facts -- actual, confirmed facts -- that shape their perspective: 1) The FBI/etc. spied on the 2016 Trump campaign using evidence manufactured by the Clinton campaign. We now know that all involved knew it was fake from Day 1 (see: Brennan's July 2016 memo, etc.).",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "protrump,prousa",
        "time": "16 September, 2022",
        "context": "We don’t need the fbi - they are much worse than useless",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "adrock2864",
        "time": "16 September, 2022",
        "context": "FBI leadership is 100% political.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "protrump,prousa",
        "time": "16 September, 2022",
        "context": "The fbi is complicit in the voter fraud",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "protrump,prousa",
        "time": "16 September, 2022",
        "context": "Voter fraud",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "stonetalons",
        "time": "16 September, 2022",
        "context": "“Mr. Strzok wrote, “I want to believe the path you threw out for consideration in Andy’s office—that there’s no way he gets elected—but I’m afraid we can’t take that risk. It’s like an insurance policy in the unlikely event you die before you’re 40…” \n---The Wall Street Journal\n\nDemocrat Strzok, Deputy Assistant Director, FBI.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "discipilesofiron235",
        "time": "16 September, 2022",
        "context": "How many people of the summer rioters in Portland and across all Democrat cities were arrested for destroying Federal, government, and private property? Case closed.",
        "good": "96",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "protrump,prousa",
        "time": "16 September, 2022",
        "context": "Rabid dogs - Mike Lindell Speaks Out After FBI Seizes Phone",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "stonetalons",
        "time": "16 September, 2022",
        "context": "It is not JUST the top levels of the FBI that is corrupt. \n\n“An internal FBI report kept under wraps for three years details dozens of cases of agents fired for egregious misconduct and crimes, including drug trafficking, attempted murder, theft, misuse of informants and consorting with prostitutes.\n\nThe report, released Wednesday by Sen. Charles Grassley, R-Iowa, found that about one in 1,000 agents was dismissed for serious misconduct or criminal offenses by the FBI during the period examined, from 1986 to 1999. The average was between eight and nine per year.”   \n\n--- CBS News   2004      \n\nAnd this was in 2004. As we all have seen, the FBI is far more corrupt today.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "doclr11",
        "time": "16 September, 2022",
        "context": "Who knew that FOX news could publish such a hilarious satirical piece?",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "stonetalons",
        "time": "16 September, 2022",
        "context": "Want to see how the FBI has not changed since the days of the corrupt J. Edgar Hoover? Watch “The Secret File on J. Edgar Hoover” by the BBC. It is about 50 minutes and can be seen on YouTube. The FBI is carrying on the corrupt traditions of the Hoover era to this very day.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "klavk",
        "time": "16 September, 2022",
        "context": "is paying attention to both, facts AND politics, off the table (?)\n\naka sounds like a 'don't look over here, look over there' or a 'see something else' proposition",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "qixsmith",
        "time": "16 September, 2022",
        "context": "Oh Goody Goody! FOX has a comedy section now!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "protrump,prousa",
        "time": "16 September, 2022",
        "context": "Never heard of this during meullers investigation of Trump - Bulger died a violent death after being transferred from a maximum-security prison where he lived in total safety in isolation, to a WV prison where he was dumped into general population and immediately beaten to death on arrival. Why he was transferred and why he was dumped into general population has not been disclosed by the DOJ.  What is known is that Bulger had a long relationship with Bob Mueller (he was Mueller's organized crime snitch) and due to this relationship, and due to Mueller's protection of Bulger, four men went to prison for a murder they did not commit.  The evidence that would have proven they were innocent was withheld from the trial by the FBI (Mueller). Ultimately, $100 million dollars was paid (your taxes) as a penalty for the wrongful imprisonment of these four men, two of which died while in prison. The person in charge of the FBI when the four men were wrongfully sentenced was none other than Bob Mueller.  Mueller's defense lawyer was Lisa H Barsoomian.  Now where has that name come up before?  Well, she had Hillary Clinton as a client and even more interesting, was married to Rod Rosenstein.  Yep, the same Rod Resenstein that appointed Mueller to the job of special prosecutor.  Mueller was also the  one who trained James Comey.  Odd how pieces will fit if you only look.  FiveEyes make the pieces fit.  I wonder why the FBI and DOJ cannot make the pieces fit given their resources and budget",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "american12186",
        "time": "16 September, 2022",
        "context": "The FBI/KGB hides information and has turned partisan, so they have lost our confidence in the information we do get!!!",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "azulthedefiler",
        "time": "16 September, 2022",
        "context": "FBI has ZERO credibility.  It disregarded treasonous security violations by HRC, and pursued completely baseless Witch Hunts against Trump - 12 TIMES!!!!",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "stonetalons",
        "time": "16 September, 2022",
        "context": "This is very sad and disillusioning to have to write, but I write this after much thought:\n\nI, a citizen of the United States of America, do not fear any terrorist or foreign government or even street crime. The only thing I fear is my government. That is the plain truth.\n\nAnd, I say this as a veteran and a man with no criminal record.\n\n“When the people fear the government, there is tyranny. When the government fears the people, there is liberty.”",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "stonetalons",
        "time": "16 September, 2022",
        "context": "“Grassley to DOJ: Why Is There a Redaction on a Strzok Text Message Referring to the Obama White House 'Running an Investigation'”\n  --- Townhall\n\nDemocrat Strzok, Deputy Assistant Director, FBI",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "protrump,prousa",
        "time": "16 September, 2022",
        "context": "53 percent of voters (Florida) agreeing with a statement that the Federal Bureau of Investigation (FBI) is “Joe Biden’s Gestapo,”",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "onfulldisplay",
        "time": "16 September, 2022",
        "context": "So there are certain things the FBI leadership wants us to be safe from, not everything.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "pointle",
        "time": "16 September, 2022",
        "context": "You can't have it both ways. No matter how much good they do, the FBI does not have the right to be political pawns and commit felonies at will for the democrats.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "smarterthandems",
        "time": "16 September, 2022",
        "context": "Yeah, try to distract us from the political hit mob they have become. It was more honorable when the head guy wore a dress.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "protrump,prousa",
        "time": "16 September, 2022",
        "context": "Defund the fbi",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "protrump,prousa",
        "time": "16 September, 2022",
        "context": "You can be sure the fbi is reading these  comments now, and then spying on you",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Signal25",
        "time": "16 September, 2022",
        "context": "Hey, somebody tell protrump,prousa that Vlad prefers it when you write something original, instead of just cutting and pasting from the list of example phrases they gave you in training.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "dadirt2",
        "time": "16 September, 2022",
        "context": "Maybe the agents but not the administration.  They have been corrupt for years.   Most should be in jail for lies, and continue to lie.   Dems can do no wrong, Republicans are attacked for no just cause.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "realamerican103",
        "time": "16 September, 2022",
        "context": "THE FBI IS THE AMERICAN GESTAPO",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "88Cherry",
        "time": "16 September, 2022",
        "context": "The FBI, over the past 70 Years, since before the days of J Edgar Hoover, has been the most prolific criminal organization in the world. They have continued to usurp the constitutionally guaranteed civil rights of US citizens at every turn. Cristopher Wray and Merritt Garland are the most dangerous domestic terrorist in modern history.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "protrump,prousa",
        "time": "16 September, 2022",
        "context": "Dr. Shiva discovered that Twitter built a special portal offered to certain governmental entities so that government officials can flag and delete content they dislike for any reason, as part of what they call their “Twitter Partner Status. - what’s next? - I think the FBI is now censoring comments on FOX",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "2ndnlong",
        "time": "16 September, 2022",
        "context": "Nod \"yes\" or get raided.  Checking on parents at a school board meeting, forsooth.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jeremym",
        "time": "16 September, 2022",
        "context": "The FBI is working every day to keep Democrats safe, pay attention to facts, not politics. \n\nFixed the typo for you Fox.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "protrump,prousa",
        "time": "16 September, 2022",
        "context": "Search AG Barr’s father and Epstein",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "laughingtothebank",
        "time": "16 September, 2022",
        "context": "It would be wonderful to not pay attention to politics. It would be even better if the FBI would ignore politics. They are our Stasi.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "protrump,prousa",
        "time": "16 September, 2022",
        "context": "Love that Trump quote “ they are not coming after me, they are coming after you, I’m just in their way”",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "SteveEXDEM",
        "time": "16 September, 2022",
        "context": "Hey Brian, you pay attention to facts. The Dems have completely politicised the FBI thats a fact as you put it",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "chicagophil",
        "time": "16 September, 2022",
        "context": "We understand it's the Political Arm of the FBI who are ordering the Rank and File to treat Democratic Party Opposition as a Threat to the Nation. Though the way Agents are handling possible White Collar type Crime investigations as if they are Dealing with armed Terrorists is appalling.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bill40",
        "time": "16 September, 2022",
        "context": "FBI HQ's is so corrupted they would have to fire everyone to include the cleaning crew.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "CountK",
        "time": "16 September, 2022",
        "context": "Wonder if this FBI insider actually wrote this piece with a straight face?  I know I couldn't read it with a straight face.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "2022midterms",
        "time": "16 September, 2022",
        "context": "Sure, the FBI did such a great job on 9-11. Also doing a great job on stopping Fentanyl... we have roughly 300 deaths a day... bravo FBI.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "JamestownDescendent",
        "time": "16 September, 2022",
        "context": "I don't believe the headline to be true.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Budman4656",
        "time": "16 September, 2022",
        "context": "Yes, the FBI is great, unless you’re a conservative.  I guess it’s made their job easier, though. They only have to investigate half of the country.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "smokeg",
        "time": "16 September, 2022",
        "context": "Propaganda.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "texas1846",
        "time": "16 September, 2022",
        "context": "The FBI is headed by a host of incompetent political thugs. Investigations are usually \nBlown by poor investigations and the DOJ can’t seem to get convictions because of prosecutors \nThat are incompetent and the evidence is flawed and many times violated the defendants \nConstitutional rights. I’m always surprised when they get something right. The FBI has evolved into \nThe Russian SVR.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "smarterthaneveryoneelse798",
        "time": "16 September, 2022",
        "context": "Dude! The first step is admitting there is a problem. Since 2015, the LEADERSHIP of the FBI, DOJ, CIA and the DNC have been acting in concert to frame Trump. It's time to own it. Far more important, it's time to fix it!!!! P.S. Thanks to all the real agents catching real crooks.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "techsavvy",
        "time": "16 September, 2022",
        "context": "It's hard to ignore the politics.  It seems the FBI have chosen sides, and are falling in line with the traitors in the Biden administration.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "golfermanjohn",
        "time": "16 September, 2022",
        "context": "No one has ever said that all FBI agents are corrupt and biased. Pure attempt by Brian O'hare to deflect away from the reality that the 7th Floor of the FBI in DC is corrupt to the core and needs to be cleaned out, sooner rather than later. Notice how O'Hare avoids writing about Hunter's computer, Roger Stone 6:00am raid, Navarro's perp walk at the airport and on and on.... FBI has been weaponized by the DNC!!!!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "stonetalons",
        "time": "16 September, 2022",
        "context": "“Jackson's [Democrat Judge] ruling — along with the Justice Department's arguments that preceded it — made some other sweeping declarations that have more direct relevance to the FBI's decision to seize handwritten notes and files Trump took with him to Mar-a-Lago. The most relevant is that a president's discretion on what are personal vs. official records is far-reaching and solely his, as is his ability to declassify or destroy records at will.”\n\nOld case over audio tapes in Bill Clinton's sock drawer could impact Mar-a-Lago search dispute\n--- Just the News   8/17/22\n\nI know this is getting old but --- President Trump was right AGAIN. \n\nFor you desperate Democrats who think this judicial ruling will have no impact on this issue, I listed the news source so that you can write and tell them they are wrong.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "stonetalons",
        "time": "16 September, 2022",
        "context": "The ruling [by a Democrat Federal judge] made other sweeping declarations, including that a \"president's discretion on what are personal vs. official records is far-reaching and solely his, as is his ability to declassify or destroy records at will….\"\n\nRuling about tapes in Bill Clinton’s sock drawer could impact Trump Mar-a-Lago raid debate\n--- Post Millennial   8/18/22\n\nNote the \"at will\" part; it does not get stronger than that.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mjd57",
        "time": "16 September, 2022",
        "context": "What he described was a fbi agency 40 years ago! Now they are one of the most distrusted law enforcement agency!",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "az-moe",
        "time": "16 September, 2022",
        "context": "Just curious what the author's political affiliation is? Sounds like he leans to the left ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Worried1234567",
        "time": "16 September, 2022",
        "context": "HARD TO BELIEVE",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "1789defender",
        "time": "16 September, 2022",
        "context": "I see conservatives are BASHING law enforcement again.   It's what they do.\n\nJan 6, 2021.  Rest my case.",
        "good": "1",
        "bad": "7",
        "replies": []
    },
    {
        "user_name": "Gen3",
        "time": "16 September, 2022",
        "context": "FBI cares for itself first and the rest of us last, anything else is a lie.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ambiguous",
        "time": "16 September, 2022",
        "context": "I direct your attention to the Congressional hearing where Sen Cruz confronted Wray on FBI training material identifying the Gadsden, Gonzolas, and Betsy Ross emblems and flags as “indicative of militia violent extremism.”. As long as the FBI treats what I consider to be honorable and patriotic symbols as worthy of special investigation, then I will consider the FBI to be suspect as well. In addition, the 17 'significant errors' in the FISA and tapping warrants have never been addressed. That along with unsavory practices like perjury traps do not engender trust. Glad hand all you want, its what you do that counts, FBI, so no, I do not trust you. You have not earned that trust.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "stonetalons",
        "time": "16 September, 2022",
        "context": "Ruling by a Democrat federal judge:\n\nThe federal judge in that 2012 case ultimately ruled that it is solely in the discretion of the president about which records are “presidential” or “personal,” and the National Archives have no legal authority to demand or seize control of records deemed “personal.”\n--- USSA News\n\nThose 'Classified’ Docs FBI Sought in Trump Raid Were Already Declassified, Says Former Pentagon Official\n--- PJ Media    8/9/22",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "BarringtonBob",
        "time": "16 September, 2022",
        "context": "The FBI should never be trusted again unless there is a thorough house-cleaning. I recommend Trey Gowdy for the job. He should transfer all those corrupt agents to the Anchorage office if he cannot outright fire them. The agency stinks of corruption.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sagebear",
        "time": "16 September, 2022",
        "context": "If you don't think politics doesn't exist in the FBI, just go back to Ruby Ridge and see what didn't happen to the FBI sniper who shot (dead) a woman holding a baby.  Everything thereafter, with the FBI sniper is pure FBI politics!",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sniffynchief",
        "time": "16 September, 2022",
        "context": "DBI not the FBI you mean ... Democrat Bureau of Investigation...",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tomprime",
        "time": "16 September, 2022",
        "context": "The FBI is politics.  But hopefully the whistleblowers fix this.  The FBI is a mess right now and needs to be overhauled.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dave380557",
        "time": "16 September, 2022",
        "context": "Anybody want to take a guess to which party he's registered?",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Babyboomer1959",
        "time": "16 September, 2022",
        "context": "The FBI is nothing but a political tool for whoever resides in the White House. Always has been, always will be.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "smokeg",
        "time": "16 September, 2022",
        "context": "It would appear to me that the FBI has more trouble differentiating facts from politics than the average Joe (not to be confused with the dull normal we have as president).",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "joeschmo054",
        "time": "16 September, 2022",
        "context": "\"FBI is working every day to keep our country safe, pay attention to facts, not politics\nWith law-enforcement partners around the globe, FBI protects Americans from criminals\"\nBy Brian O’Hare | Fox News\"\nNOTE:  Brian O’Hare has been an FBI special agent for 23 years and serves as president of the FBI Agents Association (FBIAA), a professional organization that represents more than 14,000 active and retired FBI special agents.\n\n\nThe FBI has been politicalized starting with its founder J Edgar Hoover, and has seen a very large increase since Obama became President as shown under the Trump Presidency and especially now under the Biden Lunacy Administration.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "ih8liberals779",
        "time": "16 September, 2022",
        "context": "They work hard for the Democrats.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "1789defender",
        "time": "16 September, 2022",
        "context": "The FBI should arrest Trump for making terrorist threats. Go read his tweet on that RAG he calls \"truth social.\"",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "realdealer",
        "time": "16 September, 2022",
        "context": "Nobody  believes you one bit peddle your misinformation to CNN.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mr.pops;)",
        "time": "16 September, 2022",
        "context": "From the mouth of babes.  Politics and Truth should be hand in hand.  At the very least, the general public should know the difference.  The problem is, we have only just barely evolved as a society to the point where, you are either 1, the meat, or 2, the butcher.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "fiddlesticks462",
        "time": "16 September, 2022",
        "context": "Big difference between those in the field doing the 'work', and the 'upper echelon' whose sole purpose seems to be manipulation.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "kaufs",
        "time": "16 September, 2022",
        "context": "If O'Hare really believes what he says he hasn't been paying attention.  The FBI under Biden and his crooked, biased attorny general is too busy acting as the police arm of  the democrats to pay attnetion to what they are supposed to be doing.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "BadAndy948",
        "time": "16 September, 2022",
        "context": "The FBI does have good men and women.  That doesn't mean that the institution hasn't been corrupted! ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "whopdeedoo623",
        "time": "16 September, 2022",
        "context": "Any seeds of mistrust that exist were not sown by the general public but by the FBI agent's bosses under Obama.",
        "good": "16",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "45twice",
        "time": "16 September, 2022",
        "context": "Criticism of the FBI is their management, not the rank and file.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Antidivisionist",
        "time": "16 September, 2022",
        "context": "By harassing former presidents and instructing Zuck to bury the laptop story, I think not.",
        "good": "18",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "nj2fla",
        "time": "16 September, 2022",
        "context": "More proof that fox news is a left leaning, propaganda spewing low-grade  network just like the rest...",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "joeschmo054",
        "time": "16 September, 2022",
        "context": "I wonder who will be the most dangerous organization within the federal government . . . \n The FBI with 36,149 agents\n The IRS with 2,100 armed agents, soon to increase to 89,100\n The CIA, estimated at 8,100 armed agents (figures are classified)\n The USDA with 1,100 armed agents (since 1981)\n The HHS with 1,600 armed agents (since 2001)\n The NSA with over 1,560 armed agents\nThe list is endless with the arming of \"agents\" is numerous positions of authorities.  Others include agencies like Border and Protection, Department of Homeland Security, Offices of the Inspector General (with another 24 federal agencies under them that are armed), US Secret Service, DEA, ATF, etc, etc, etc!\n\nAlso, the Department of Justice (DOJ) employed 33.1% of all officers, followed by other executive branch agencies (12.3%), the judicial branch (4.0%), the independent agencies (3.6%), and the legislative branch (1.5%).",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "visic",
        "time": "16 September, 2022",
        "context": "Lying shill",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Edward208",
        "time": "16 September, 2022",
        "context": "…Absolutely hilarious…Nobody believes the FBI…Isn’t political…it’s under the DOJ..",
        "good": "11",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "stemcellfajita",
        "time": "16 September, 2022",
        "context": "I want to thank the FBI for locking up over 800 MAGA terrorists from January 6th. 300+ convictions and counting! USA!",
        "good": "0",
        "bad": "9",
        "replies": []
    },
    {
        "user_name": "noelj",
        "time": "16 September, 2022",
        "context": "Defund the FBI, they've become the criminals.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "SteelheadLivesMatterInTheSmoker052",
        "time": "16 September, 2022",
        "context": "Funny the FBI would say that, while they pay attention to politics.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "barrypeglia280",
        "time": "16 September, 2022",
        "context": "The author of this story must have his head up his ......",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jcz920",
        "time": "16 September, 2022",
        "context": "Sorry, You’ve lost all credibility.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "maddawgvet238",
        "time": "16 September, 2022",
        "context": "PUFF PIECE written by someone that is clearly biased towards the agency..  Yeah, not believing a word of the propaganda.. Nice try though.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "stonetalons",
        "time": "16 September, 2022",
        "context": "“Under the statutory scheme established by the PRA, the decision to segregate personal materials from Presidential records is made by the President, during the President’s term, and in his sole discretion,” Judge Jackson wrote in the 27-page ruling.\n\nShe added, “Since the President is completely entrusted with the management and even the disposal of Presidential records during his time in office, it would be difficult for this Court to conclude that Congress intended that he would have less authority to do what he pleases with what he considers to be his personal records.”\n--- USSA News\n\nOld Case Over What Bill Clinton Hid in His Sock Drawer Could Unravel FBI's Mar-a-Lago Raid\n--- The Western Journal   9/14/22\n\nTrump and his lawyers have stated he declassified the records before he left office.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "gary1963",
        "time": "16 September, 2022",
        "context": "When you ignore crimes committed by democrats and make up crimes committed by republicans of course people are going to think you're being partisan",
        "good": "12",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "froglightning",
        "time": "16 September, 2022",
        "context": "The FBI is compromised, corrupt, dirty.",
        "good": "7",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "fcalifny",
        "time": "16 September, 2022",
        "context": "F the FBI praying more Timothy McVeighs park box trucks in front of their buildings like OKC ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "kpfromdc503",
        "time": "16 September, 2022",
        "context": "Christopher Wray and Merrick Garland should be arrested for Treason ",
        "good": "6",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "olderndrt",
        "time": "16 September, 2022",
        "context": "Was this memo from Peter Strzok or Lisa Page?",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bill5244",
        "time": "16 September, 2022",
        "context": "And now for an opposing view…",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "That'smyopinion",
        "time": "16 September, 2022",
        "context": "Oh, I feel safer.\nI won't say anything bad about the current \"administration.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "PoliticalTerry",
        "time": "16 September, 2022",
        "context": "This article sponsored by your local FBI office.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Conservativethinktank",
        "time": "16 September, 2022",
        "context": "Fact, 85% of the FBI is working every day to protect America.\nFact, the top 15% of FBI is working to criminalize MAGA Patriots which are 75 million strong.",
        "good": "6",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "bobd2416",
        "time": "16 September, 2022",
        "context": "Any bias built into this, what a joke.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "andythelawyer",
        "time": "16 September, 2022",
        "context": "We do need the FBI to protect the country from Criminal Trump.",
        "good": "0",
        "bad": "10",
        "replies": []
    },
    {
        "user_name": "t2r0u2m4p",
        "time": "16 September, 2022",
        "context": "The FBI is one of those threats we face.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bergler65",
        "time": "16 September, 2022",
        "context": "Thank you for publishing this Fox News. We all need to come back to our senses in regards to justice and law in America.",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "DefundthePoliticians194",
        "time": "16 September, 2022",
        "context": "Says the president of the FBI-den Agent’s Association.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "JarHead1985",
        "time": "16 September, 2022",
        "context": "Durham Report Readout - If Putin spent half the time the FBI does interfering in elections we would be speaking Russian. Hey I think I just saw the Pillow Guy in the drive thru at Wendy's. Hurry better surround him with a FBI tactical team.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Edward208",
        "time": "16 September, 2022",
        "context": "..The Trump raid..Was Political…Absolutely hilarious",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "medgirl1962",
        "time": "16 September, 2022",
        "context": "Sorry, we don't believe you. While some of the FBI are just normal working people who are just trying to do their jobs, the leadership are corrupt. The FBI needs to be defunded. Its so corrupt that it can't be cleaned. The DOJ is corrupt and needs to be purged of all of the top brass and moved out of DC and into the heartland.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "wt67",
        "time": "16 September, 2022",
        "context": "That may be true, and the FBI agents I've worked with fall into that category. However, these live and work all outside of DC. DC itself is a different animal than your average field office, and FBI agents will admit that in confidence.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "barrypeglia280",
        "time": "16 September, 2022",
        "context": "Did the FBI pay Fox to run this story?",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "China-Dementia-Joe",
        "time": "16 September, 2022",
        "context": "The only work they do is trying to keep the bad Orange man out of office",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "yomama1776",
        "time": "16 September, 2022",
        "context": "Author is a traitor.. there are consequences ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bhunkk",
        "time": "16 September, 2022",
        "context": "C'mon man, you are supposed to dilute that kool-aid with water, not snort it straight from the paackage",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "edbr",
        "time": "16 September, 2022",
        "context": "Most of the FBI, CIA, NSA, and all the other alphabet soup agencies are indeed working for \"The People\" as chartered. However, it is apparent that inside some of those there are groups who are paid by the taxpayer but are directed by political interests.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mrdmd123",
        "time": "16 September, 2022",
        "context": "Trust the FBI, WHY? all they do is Lie..",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "VicVeracity",
        "time": "16 September, 2022",
        "context": "Few things are absolute and the writer is misguided if the believes, as stated, that the FBI is not driven by politics. Does it mean all FBI agents are political weaponized pawns, of course not, just the people moving the pawns on the chessboard. ",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bidenlied13died",
        "time": "16 September, 2022",
        "context": "enjoy those last few paychecks, come  November...... YOUR FIRED!!",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "frustratedguy65357",
        "time": "16 September, 2022",
        "context": "Just like the old joke... \"I'm from the IRS and I'm here to help you.\"",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "clove995",
        "time": "16 September, 2022",
        "context": "Hunters laptop. Nuff said",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "cowboyjoe",
        "time": "16 September, 2022",
        "context": "BLM and Antifa loot, riot and murder..FBI does squat…The pillow guy gets surrounded  by the FBI ordering French fries at Hardy’s Drive thru….Mr O’ Hare..quit lying..we’ll know your game….",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "obiden569",
        "time": "16 September, 2022",
        "context": "The FBI is currupt, we see it time and time again. Whistleblowers are coming forward, the laptop, parents, Russia probe, fisa court. Garland needs to be impeached,just on the border alone, Wray needs to resign, it needs a total overhaul at the top",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "josefius617",
        "time": "16 September, 2022",
        "context": "HAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAHAHAHAHAHAHAHAHA",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Snarkypilot",
        "time": "16 September, 2022",
        "context": "Saying that most FBI agents are unbiased has been the common thread of conservative commentators. I would like to believe that, but if that were true, congressional representatives would be knee-deep in whistle-blower complaints.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Edward208",
        "time": "16 September, 2022",
        "context": "…With Garland heading up this group…Of course it’s Political…This  Administration lies regularly…They can’t distinguish their own lies…From reality",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "simracing512",
        "time": "16 September, 2022",
        "context": "The FBI is doing what it does best.  LYING!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Whiff-ta-Poof",
        "time": "16 September, 2022",
        "context": "\"The allegations – that the FBI is somehow driven by political bias – are simply untrue.\"\n\nThat's a lie ... definitely driven by political bias.  It's right there in front of your face, O'Hare!",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "AEDPHX",
        "time": "16 September, 2022",
        "context": "With the same type of misconduct, DOJ has investigated local police and with the full force of the government placed them under consent decrees to take control of their operations. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "elmerjfudd640",
        "time": "16 September, 2022",
        "context": "Antifa =  FBI  just better dressed",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tcsayso",
        "time": "16 September, 2022",
        "context": "Safe for whom?",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Americathebeautiful801",
        "time": "16 September, 2022",
        "context": "DRAIN THE FBI",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "kw61",
        "time": "16 September, 2022",
        "context": "The FBI has been a political tool since the time J. Edgar Hoover put on his first dress.",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "elmerjfudd640",
        "time": "16 September, 2022",
        "context": "12 months from now the liberals will be back to hating the FBI when Hunter biden is perp walked",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "logika",
        "time": "16 September, 2022",
        "context": "If so Hillary and Hunter would have been locked up by now.",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "HuntersArtGallery954",
        "time": "16 September, 2022",
        "context": "LIES!!!!!!!",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "crcnwadavid",
        "time": "16 September, 2022",
        "context": "Kinda like they did when they got multiple calls about the Parkland shooter and did nothing about him because they were too busy making up Russian collusion?",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "mike99960",
        "time": "16 September, 2022",
        "context": "\"The allegations – that the FBI is somehow driven by political bias – are simply untrue.\"  Sorry.  Untrue.  Empirical evidence screams otherwise that the FBI IS now a weapon of the Democratic establishment.  This piece should have been a paid advertisement from DNC.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "florida*man",
        "time": "16 September, 2022",
        "context": "The author is either a liar or brilliantly ignorant.\n\nThe FBI is the federal mafia.\n\nThey always were.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Marine-82-35",
        "time": "16 September, 2022",
        "context": "The FBI needs to be completely dismantled; their top levels fired and many rank and file agents reassigned or fired. A new agency needs to be created. The FBI is a disgraced agency. ",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "AmericanCapitalist",
        "time": "16 September, 2022",
        "context": "Magas hate the FBI because all criminals hate law enforcement.",
        "good": "0",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "liberty&freedom",
        "time": "16 September, 2022",
        "context": "Till they raid Hunter Biden home they are corrupt ",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "valetutto",
        "time": "16 September, 2022",
        "context": "Brian O’Hare is a joke and woke journalist.  Why don’t you talk about Hunter Biden laptop and how the FBI concealed the information. Or how the FBI influenced the election of 2020.  Paid Russian informant by the FBI to go after Trump. Yes he is a joke. Look at where he puts his importance. Everybody knows the foot soldiers for the FBI or not the problem they were just following orders that is a no-brainer. But some journalist like Brian seem to think that we shouldn’t go after the FBI for what they’re doing. FBI is going to need more than chemotherapy to fix the problem that they have.  ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "matto62223492",
        "time": "16 September, 2022",
        "context": "Yes they seem to be working very hard on donald trump and the my pillow guy seem to be taking up a bit more of their time than one would think. ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mikebran",
        "time": "16 September, 2022",
        "context": "\"The FBI doing everything it can to keep our country safe\"...for them, not you.  \n\nWas the FBI and ATF keeping the country safe when it raided the compound of David Koresh at Waco, TX in 1993 where dozens of people died, including many children?",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "GetSmart096",
        "time": "16 September, 2022",
        "context": "Nah, I don't think so.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Trevorwmcc",
        "time": "16 September, 2022",
        "context": "LOL FBI IS NOT POLITICAL ?!,\nNow they are liars too apparently.\nI don’t know what planet this agent is living on, but they have never been more political..\nComey lied to a FISA court after buying what he knew to be a false document to frame a candidate and then president.\nThe FBI told Zuckerberg what to cover up prior to the next election and now they’re going after the My Pillow guy because he’s on the wrong political side \n\nGimme a break.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "petergoesinya653",
        "time": "16 September, 2022",
        "context": "Defund the FBI. NOW",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "China-Dementia-Joe",
        "time": "16 September, 2022",
        "context": "The FB I= Friendly Biden Investigators.",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jdnich",
        "time": "16 September, 2022",
        "context": "Drop in all charges against blm and antifa didn't help. No hate charge for the Christmas parade killer.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "TimeStandsStill",
        "time": "16 September, 2022",
        "context": "The FBI agents who are working on the missing\\exploited children aren't the ones we don't like.  It's their leaders who are setting the bad examples and doing sham show work that never pans out.",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "thetruthhurts758",
        "time": "16 September, 2022",
        "context": "Yeah right. And the IRS is making us money.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cornpoplives",
        "time": "16 September, 2022",
        "context": "If the IRS can be corrupted (singling out conservative groups) so can the FBI (free passes for certain government officials).",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "drippintx",
        "time": "16 September, 2022",
        "context": "The KGB, I mean FBI can’t be trusted.  They are run by criminals and low life’s.   They all need to go to prison.   ",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "frustratedguy65357",
        "time": "16 September, 2022",
        "context": "When hunter and the big guy are behind bars, then and ONLY then will I begin to trust the twits at the fbi.",
        "good": "10",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "AmericanCapitalist",
        "time": "16 September, 2022",
        "context": "Most FBI agents are conservatives. The current director was appointed by Trump, but they're honest conservatives, not magas.",
        "good": "1",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "davidp008",
        "time": "16 September, 2022",
        "context": "Unbalanced opinion piece.  Yes, SOME of that the FBI does protects the country, but SOME of what the FBI does damages the country by being a political tool for the left and unjust activities.  THAT is why they are not trusted.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Concernedforthiscountry",
        "time": "16 September, 2022",
        "context": "Wow. The agency is full on political. The bias inside the fbi is astounding. The corrupt employees letting their politics guide their investigations. Framing parents as domestic terrorist, and Fox allows this article to be written. Fox News. Someone from your organization needs to explain how you’ve allowed this fake news or you’re about to lose millions of viewers. There are some things the fbi may do that are good. Yet they are extremely corrupt from top down. There is no investigation they do that can’t be done by state and local authorities working together across state lines.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "larryyoder134",
        "time": "16 September, 2022",
        "context": "the  \" facts\" speak for themselves ,you've refused to investigate hunter biden and prosecute Hillary Clinton all while the Trump haters continue their tirade against  the American people and but don't  look at the \"political  side of things ?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "plebeian357",
        "time": "16 September, 2022",
        "context": "Every major company has people working on special \"charity projects\".\nDoesn't matter.\n\nWhat matters is what the organization is doing on a grand scale.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ca-conservative069",
        "time": "16 September, 2022",
        "context": "The FBI went to the left under Obama and never came back. Good try though, but no Conservative, Republican, or Independent American citizen believes you. Their work now is solely for Democrats. Look no farther than Hunter Biden's laptops. ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tattler",
        "time": "16 September, 2022",
        "context": "The FBI higherarchy is not, the average FBI agent is.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "mattgaetzsvenmo",
        "time": "16 September, 2022",
        "context": "Oh this opinion piece isn’t going to go down well with the MAGAts. Not well at all.",
        "good": "2",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "shleprock11214",
        "time": "16 September, 2022",
        "context": "There is a program at the FBI dedicated to investigating violent crimes against children...if they have a division that focuses on creepy old men sniffy little girls  hair.. have we got a suspect for you.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "NotReally147",
        "time": "16 September, 2022",
        "context": "It is true that the FBI works hard every day to keep us safe, but the Dem political hacks at the top work hard every day to turn it into a KGB for the Dems.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "stemcellfajita",
        "time": "16 September, 2022",
        "context": "Make MAGA terrorist pay for their hate!",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "3rdamendment",
        "time": "16 September, 2022",
        "context": "If the FBI's reputation has been tarnished, it's because of actions the FBI has taken.",
        "good": "13",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "johnn707",
        "time": "16 September, 2022",
        "context": "With 2022 coming to an end.\nIt has made 3 things abundantly clear, you should plant a garden, own a gun & never trust a Democrat. ",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Stan🐘",
        "time": "16 September, 2022",
        "context": "The FBI is the Democrats personal gang of thugs.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "davidp008",
        "time": "16 September, 2022",
        "context": "Unbalanced\n opinion piece.  Yes, SOME of that the FBI does protects the country, \nbut SOME of what the FBI does damages the country by being a political \ntool for the left and unjust activities.  THAT is why they are not \ntrusted.",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "diencaidau",
        "time": "16 September, 2022",
        "context": "This is mostly left serving lies.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Sweet448",
        "time": "16 September, 2022",
        "context": "Just because somebody puts on a Maga hat and gets aggressive doesn’t mean they support Trump. That is what the Democrats want America to believe. All anyone has to do is watch the video to realize that the aggressive crowd was full of plants. That we’ve gone a year and a half without this obvious truth being generally recognized indicates fill-in-the-blank.",
        "good": "3",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "Hawk59064",
        "time": "16 September, 2022",
        "context": "The FBI is the strong arm of the democrats! They need a good cleaning from the top down.",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "screwdablu",
        "time": "16 September, 2022",
        "context": "Bwahahahahaha!  You don’t say.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "outtatime1776",
        "time": "16 September, 2022",
        "context": "False",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "CalWarren0258",
        "time": "16 September, 2022",
        "context": "I can't comment on what I feel about the FBI due to an ongoing investigation. ",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Oscar246Ret",
        "time": "16 September, 2022",
        "context": "No...",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "darryl9430139",
        "time": "16 September, 2022",
        "context": "I don’t think the FBI can spell “Hunter”",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "concernedcitizen1500",
        "time": "16 September, 2022",
        "context": "It's not the typical agent - it is the liberal leadership that we can't stand or trust.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rayb739",
        "time": "16 September, 2022",
        "context": "I suppose the author figured someone would believe this tripe.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "johnn707",
        "time": "16 September, 2022",
        "context": "Mail-in technology has been available for hundreds of years. It has been explicitly disallowed in almost all elections up until a few years ago.  The reason is that it’s notorious for promotion election fraud.",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "jfortune",
        "time": "16 September, 2022",
        "context": "The job of the FBI is to pay attention to facts, not politics. Given Strozk's comments about an \"insurance policy\" to keep Trump out of office, Kevin Clinesmith's altering documents to obtain warrants against Trump, Timothy Thibault's stifling of investigation into Hunter's laptop, etc., it would appear that it's not us that need to pay attent to facts, not politics.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "youtool",
        "time": "16 September, 2022",
        "context": "Foreign \nBought\nInspectors",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "PresidentElectstonecoldcrazyyaknow",
        "time": "16 September, 2022",
        "context": "I didn't even read it, checked the author first. Now I won't bother because it's biased propaganda!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "apublicperson",
        "time": "16 September, 2022",
        "context": "Ya know Brian, it is possible both can be true - some agents work hard for citizens and some coordinate insurrections and otherwise violate citizens rights.  The issue is not are they perfectly clean, but are they above the law.",
        "good": "7",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "gerryward,usaret",
        "time": "16 September, 2022",
        "context": "the rank and file of the FBI are examples of those whose fidelity to the law is unquestioned.   it is the leadership that is corrupt.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "aj1463",
        "time": "16 September, 2022",
        "context": "I wouldn't trust the FBI to find a lost dog.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "davidp008",
        "time": "16 September, 2022",
        "context": "Hey, person who wrote this article, NO ONE is buying your argument!",
        "good": "8",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "keeperofpeace64",
        "time": "16 September, 2022",
        "context": "The FBI once was one of the most respected and admired federal agencies in the world. \nOnce Obama was elected it turned into a bias political clown show thanks to democrats. \nIt's can now be called the Federal Bureau of Inbeciles..\nBiden's puppet show.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "MerIin",
        "time": "16 September, 2022",
        "context": "While the rank and file may be doing their jobs, they aren't the ones making headlines for turning the FBI into the Abwehr of the 4th Reich.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "plw6725",
        "time": "16 September, 2022",
        "context": "I sure wish I could believe that... but what I have seen does not align with this opinion.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Slaphappy250",
        "time": "16 September, 2022",
        "context": "The intelligence agencies top people probably can’t be depended on or trusted if you are an American citizen anymore.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "thegreatmagaking351",
        "time": "16 September, 2022",
        "context": "yes keeping an eye on disgruntled parents and locking up your political opponents is really keeping everyone safe",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "johnn707",
        "time": "16 September, 2022",
        "context": "Absentee ballots should only be allowed for US service members that are stationed outside of their districts. No elections results will be deemed valid until this is done and voter ID is required for every in person vote.",
        "good": "91",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "don_gingrich",
        "time": "16 September, 2022",
        "context": "Fat Donnie said FBI is bad. \n\nI believe Fat Donnie. My degree from Trump University got me a 200K a year job!",
        "good": "3",
        "bad": "8",
        "replies": []
    },
    {
        "user_name": "johnn707",
        "time": "16 September, 2022",
        "context": "Unfortunately for Democrats - inflation is a constant reminder of their failures.  Every day we are reminded.  No amount of divisive rhetoric will make us forget.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sickandtiredfoallthefighting222",
        "time": "16 September, 2022",
        "context": "Then fire the upper echelons and arrest them, then promote the ones who are actually doing their jobs. Till then the FBI is a strong arm of the Democrats.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bill990",
        "time": "16 September, 2022",
        "context": "OMG-YES, there are some FBI agents that truly care and are a-political but we HAVE SEEN AND IT HAS BEEN PROVEN, Hi Levels of management with the power to direct action ARE POLITICALLY BIASED and they are using their job and power to effect outcomes-What a bunch of pooh-",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Sentryone",
        "time": "16 September, 2022",
        "context": "I agree with this op-ed piece EXCEPT the FBI leadership.  We all know that law enforcement on the street does not give the orders/direction to its employees.  A few select ones in the administration can create an image by the direction of a few to be what is happening with investigations like Trump, Hunter Biden, and Joe Biden.  My local FBI agent had no say.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "mikebran",
        "time": "16 September, 2022",
        "context": "What might we find if the American people raided the FBI building in Washington DC?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "willman6000",
        "time": "16 September, 2022",
        "context": "Perhaps you can explain why the FBI has an office inside the law firm , Perkins and Cole who executed the fake Russia hoax.......",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "californiamojo",
        "time": "16 September, 2022",
        "context": "The FBI deals in two things\n\nSecrets and lies\n\nThis article isn’t a secret",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "mmmmmbeer",
        "time": "16 September, 2022",
        "context": "Not from what I’ve seen over the last 6-7 years Brian. \n\nWill Trump win?  No, no, we won’t let that happen.  \n\nRemember that Brian?  Lisa page asking Peter Strzok and Peter responding. \n\nTo me, it would be difficult to get any more political, but  being a former FBI agent, I’m sure you can see the reality which begs another question;  why are you lying?",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "agrenadeforeveryliberal",
        "time": "16 September, 2022",
        "context": "nice advertisement.\n\nDefund the FIB.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "mr.nyczguy",
        "time": "16 September, 2022",
        "context": "With all due respect to the honorable FBI agents still toiling away within the agency, there has been so much visible politicization by the top brass that most people paying attention no longer trust the Bureau to enforce the law fairly.\n\nWithout massive housecleaning and some concrete examples showing a Democrat will actually get punished with jail time for being convicted of an offense, why would ANYONE believe these folks are anything but Democrat / Progressive bullies with badges?\n\nAt this point, that trust is gone, and it'll take years to build it back with much of the country.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "griffin",
        "time": "16 September, 2022",
        "context": "At the same time rifling through Melania’s underwear drawer.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "fenderstratocaster792",
        "time": "16 September, 2022",
        "context": "Nice try",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "sickmad",
        "time": "16 September, 2022",
        "context": "SAFE from WHO ? ME, a TRUMP SUPPORTER.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "johnn707",
        "time": "16 September, 2022",
        "context": "Sick and tired of my tax dollar being wasted digging up dirt on Trump while the evidence is blatantly clear against Hillary Obama and Biden",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "okie50",
        "time": "16 September, 2022",
        "context": "The problem isn't the agents it's the leadership.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "cfarmer49",
        "time": "16 September, 2022",
        "context": "I think anyone who actually believes the FBI is not now a political arm of the democrat party is 1) deluded 2) has their head up a body cavity and 3) is actually just plain lying.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "HuntersArtGallery954",
        "time": "16 September, 2022",
        "context": "Anyone trying to make the case that Republicans are anti law enforcement should just remember what the non binary Antifa clowns where spray painting all over the country for the last 2 years. ACAB. That’s how the left feels about law enforcement. ",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "kidcadillac",
        "time": "16 September, 2022",
        "context": "where are all the antifa rioters and criminals? They don't qualify?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Ken1959817",
        "time": "16 September, 2022",
        "context": "FBI has done more to help criminal’s in the past 10 years then law bien citizens!",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "foxnewsmandatesvaccinations",
        "time": "16 September, 2022",
        "context": "FoxNews can't put that toothpaste back in the tube.  Australian and Saudi owned FoxNews owns this mess",
        "good": "0",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "HeHey",
        "time": "16 September, 2022",
        "context": "KGB",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "altomfla123",
        "time": "16 September, 2022",
        "context": "i bet the fbi buried  the hunter biden so deep a bulldozer wont find it their busy trying to get something on trump good luck",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "thomjohn3",
        "time": "16 September, 2022",
        "context": "BS!  The FBI is 100% a political apparatus, solely devoted to protecting leftists.  The issue this agent has is now that fact has become common knowledge, and we can see how far the FBI is willing to go to protect itself and eliminate any perceived threat.  Multiple fake FISA warrants; FBI informants being paid BY THE FBI for fake intel; agents at the highest levels of the FBI lying under oath, lying to Congress, lying to the people; FBI agents plotting the removal of elected political opponents; FBI agents engaging in entrapment.  Meanwhile, horrible events occur with catastrophic loss of life, and then a few months later we find out that the FBI knew of the incident and the perpetrator, but decided to do nothing because of race/religion/social status (Pulse nightclub shooting; Major Hassan killing soldiers at Ft. Hood), because the FBI is too busy chasing down parents who complain at school board meetings or someone who criticized Biden online.  No, the FBI is now a trash organization with no more credibility than the KGB.   Be sure to thank Comey, McCabe, Stryck, Page, Orr, and Wray for their work, Mr. Agent-Man.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tmart52",
        "time": "16 September, 2022",
        "context": "The rank and file’s silence makes them either equally corrupt or cowards. ",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "24proudyears",
        "time": "16 September, 2022",
        "context": "A prerequisite to become a FBI agent it to be collage  indoctrinated by the academia liberals. Brainwashed before the first class at Quantico",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "kgo54",
        "time": "16 September, 2022",
        "context": "Interfering with the 2020 election by FBI management is all I need to know, this story is bunk.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "deano65",
        "time": "16 September, 2022",
        "context": "But won't release Epstein's list so we can be sure our children avoid them.  Ya, they are on our side....NOT!!!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "redwhiteandtru",
        "time": "16 September, 2022",
        "context": "Stop it. They are corrupt partisan not sees.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "retairforce",
        "time": "16 September, 2022",
        "context": "MAGA is just trailer park BLM with their hatred of law enforcement.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "northwest1952",
        "time": "16 September, 2022",
        "context": "They are protecting the Dems, I ask why did they take the owner of MY PILLOW phone while he was having lunch?   Is creating pillows and sheets a threat to our democracy?",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "geefostabc",
        "time": "16 September, 2022",
        "context": "Author Brian O’Hare,, You might mean well being a 23 year veteran of the FBI, but they are not the same as when you were an active agent.\nThe  actions of the FBI as of late, have convinced the majority of Americans they have\ndevolved into an extension of the Democratic Party.",
        "good": "6",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "OrangeBeer",
        "time": "16 September, 2022",
        "context": "Boooooooooooo",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "genx🐘🐘",
        "time": "16 September, 2022",
        "context": "They’re the American Gestapo",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "number5of6",
        "time": "16 September, 2022",
        "context": "Most people have no problem with the agents, themselves. In fact we have a lot of respect for them. But the problem is with management -- the higher-ups who call the shots. The agents just do as they're told. As long as the leadership is blatantly partisan, the distrust will continue. Don't blame the public for being upset with what they actually SEE happening. Make the necessary changes to win back the trust.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "historyguy99",
        "time": "16 September, 2022",
        "context": "I love all these comments by people who claim to be American and support our law enforcement. You should be ashamed.",
        "good": "0",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "thejanitor99929",
        "time": "16 September, 2022",
        "context": "How they did nothing about Nikolas Cruz and they were warned twice.  ⚠️",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Pmar259",
        "time": "16 September, 2022",
        "context": "I’m tired of people claiming that the “rank and file” FBI employees are to be considered separate from their leaders when it comes to politics affecting decisions they make . Somebody (not Comey, not Strock, not Wray, not Mueller) is in the field, interviewing people and gathering “evidence” for these investigations. Only a few are going to Congress with information about what’s going on within the DOJ. As far as I know, no rank and file personnel have resigned in disgust over what going on at FBI.",
        "good": "13",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "TheHammer1",
        "time": "16 September, 2022",
        "context": "I don't trust any government agency in this day and age. They are all part of the fascist leadership of the democrat party.",
        "good": "4",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "mrando",
        "time": "16 September, 2022",
        "context": "And the facts show that the FBI pushed the Russian Colusion thing. They show that they have been weaponized. They show they continue to ignore the Bidens and the Clintons. We are paying attention to facts !!",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mrod0545",
        "time": "16 September, 2022",
        "context": "Yeah...",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "brightbark",
        "time": "16 September, 2022",
        "context": "the fbi should be abolished, along with the tsa, dhs, atf, doj, cdc and cia.\nand might as well include the fda since it is doing nothing about fentanyl.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "stemcellfajita",
        "time": "16 September, 2022",
        "context": "MAGA lives adjacent to reality, but not in it. There’s no coming back for these people…they’re lost.",
        "good": "0",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "navvet05856",
        "time": "16 September, 2022",
        "context": "I would agree with the author if it was 25 years ago, but I really do think the entire DOJ is corrupt to its core and all need to be replaced.",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "true-patriot873",
        "time": "16 September, 2022",
        "context": "OUTRAGEOUS! The FBI is basically an arm of the Democrat Party like Trump said and should not be trusted- I follow three things in my life-The Good Lord Jesus Christ- The Constitution- and my President Donald J Trump- only he can save us!",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "ontherightside2",
        "time": "16 September, 2022",
        "context": "ah FBI followed the facts with Hillary give me a brake",
        "good": "5",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "jadeona447",
        "time": "16 September, 2022",
        "context": "Politics are exactly what the fbi is all about .. comey struck page McCabe all the fbi all corrupt",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Geordie935",
        "time": "16 September, 2022",
        "context": "As most politicians and general public realize, it’s NOT the rank and file that are the problem with the FBI it’s the leader and senior members that have politicized the Bureau. Those leaders need replaced. Hopefully in November",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "ooooooooooooooooooooooooooooooooooooo",
        "time": "16 September, 2022",
        "context": "O'Hare supports the FBI spying on GOP voters and attempting to overthrow the legally elected President... when he states\" The allegations – that the FBI is somehow driven by political bias – are simply untrue.\"",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "gidfather869",
        "time": "16 September, 2022",
        "context": "Fact = FBI paid informant who made up dossier ",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Pokedbear",
        "time": "16 September, 2022",
        "context": "Well that’s good and all but maybe they should’ve thought about all that BEFORE they became the private law enforcement division for the left. Actions have consequences there skippy. ",
        "good": "14",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Meadowlark",
        "time": "16 September, 2022",
        "context": "The rank and file maybe, but the leadership is totally corrupt and political.  I’m sure they have something better to do than surround Mike Lindell in a Hardee’s drive-thru to confiscate his phone.  Ridiculous and beneath them to engage in the politically driven targeting of conservatives!",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "patrickhenry0076",
        "time": "16 September, 2022",
        "context": "As soon as you became a political pawn of the Democrat Communist Dark Sider party you lost all credibility and will never get it back. You will be remembered as a KGB style rogue thug wing of the Democrat Communist Dark Sider party.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "agrenadeforeveryliberal",
        "time": "16 September, 2022",
        "context": "\"Brian O’Hare has been an FBI special agent for 23 years and serves as president of the FBI Agents Association (FBIAA), a professional organization that represents more than 14,000 active and retired FBI special agents.\"\n\nAt least he isn't biased.  An FBI union guy....twice as useless.",
        "good": "7",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "cob62",
        "time": "16 September, 2022",
        "context": "was this article really written by hunter biden?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mrsyd",
        "time": "16 September, 2022",
        "context": "That may be, except for the elite Deep State actors!!\n1)They've interfered with our elections and have been on a \"Get Trump\" vendetta since 2015.\n2)They've destroyed the reputation of the FBI, DOJ, CIA, IRS and NSA.\n3)They've destroyed the concept if Equal Justice Under the Law. ",
        "good": "12",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sharkbaitoohhaha165",
        "time": "16 September, 2022",
        "context": "The FBI is 99% corrupt.",
        "good": "7",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "true-patriot873",
        "time": "16 September, 2022",
        "context": "T",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "hotrod1953",
        "time": "16 September, 2022",
        "context": "Moving the Headquarters OUT OF DC would be a move in the right direction, as a matter of fact ALL alphabet agency's should relocate OUT OF DC, their nonpartisan right?  if not....DEFUND!",
        "good": "3",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "1A2A",
        "time": "16 September, 2022",
        "context": "The facts are the FBI has been compromised by political operatives. They chose to participate in partisan politics, eyes wide open. Suffer the shame, well deserved.",
        "good": "9",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "jeb_stewart",
        "time": "16 September, 2022",
        "context": "The question is, \"safe for whom?\"",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "thomaspainewasright",
        "time": "16 September, 2022",
        "context": "I'll interpret for those of you who don't understand demospeak.....\"we're going after all the conservatives and Trump so only dems win elections.\"",
        "good": "4",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "alane68",
        "time": "16 September, 2022",
        "context": "While Mr. O'Hare might believe the words he wrote, ACTIONS speak louder than words. The alphabet agencies ACTIONS have shown them to be less than trustworthy. They appear to be an arm of the DNC, and this is not a good look for them. Wish I could say I respect and trust them, but I can't!",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "cpark",
        "time": "16 September, 2022",
        "context": "Nice try. The FBI runs cover for Democrats. The FBI is political.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "khan403",
        "time": "16 September, 2022",
        "context": "Please be Truthful ... 'SOME' FBI agents do their jobs....",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "graywolfhowling",
        "time": "16 September, 2022",
        "context": "The FBI are the child traffickers.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "disgustedwithpolitics498",
        "time": "16 September, 2022",
        "context": "The FBI is now a joke.  Not a funny one either.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "onlyeng",
        "time": "16 September, 2022",
        "context": "That may very well be for some at the working level, but it sure looks like the whole upper level policy makers have sold out to the left.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "befiscallysmart",
        "time": "16 September, 2022",
        "context": "Okay, then why is the FBI ONLY investigating and raiding the homes of Trump and his political allies? At some point, the FBI cannot say \"we're just following orders\". At some point, somebody has to answer why it is so one-sided when it comes to prosecutions, raids, indictments, etc. \n\nThis is very serious. The FBI is being used to intimidate parents at school board meetings. The DOJ went after PARENTS who voiced opposition to school board policies and labeled them domestic terrorists. \n\nThere are good and bad people in EVERY organization. When there are too many bad actors the organization needs to be cleaned up.",
        "good": "14",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "paychecktoday",
        "time": "16 September, 2022",
        "context": "Not when it comes to Trump.  There was no reason to make this criminal.  It could have been solved with a civil suit.  It could have been solved a year ago.  It could have been solved next year.  There's only one reason to make it criminal and do it right now--midterms.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "hanvin",
        "time": "16 September, 2022",
        "context": "I believe what I see, not what I'm told. The fBi is a political tool used by the swamp to silence or punish critics.",
        "good": "19",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "conservativethinker1961",
        "time": "16 September, 2022",
        "context": "The FBI is the militant arm of the DNC.  Needs to be defunded and it's leaders put in prison.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "duke1966528",
        "time": "16 September, 2022",
        "context": "O'Hare needs to understand the 7th floor of the FBI has become Biden's Geheime Staatspolizei and a recent poll shows 53% of those polled do not trust the agency.\nThat number is people that support Dems and Reps.\nTheir credibility is dropping and imagine trust being so bad that jurors do not believe their testimony in court.\nThe time to clean house is NOW!\nAt least the rank and file are now stepping forward with whistleblower complaints exposing the politically aligned people.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "publicutilities",
        "time": "16 September, 2022",
        "context": "I would post something witty, but I dont want the FBI knocking down my door",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mycountry",
        "time": "16 September, 2022",
        "context": "The headline is mistaken it should read the DFBI is working hard everyday to protect the Dem leadership.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "patrickhenry0076",
        "time": "16 September, 2022",
        "context": "WHY NO AMERICAN SHOULD EVER VOTE FOR A DEMOCRAT\n1. Obamacare total failure PASSED 100% by Democrats\n2. Benghazi 4 people killed on the 9/11 anniversary Hillary created this and Democrats own it.\n3. NSA Spying on Americans done by Democrats\n4. War on the Police created by Democrats.\n5. Terrorist attack after Terrorist attack on American soil created by Democrats\n6. The Attack on the American Christian Culture created by Democrats\n7. IRS being used as a political tool by the Democrats\n8. FBI and DOJ being used as a political tool by the Democrats\n9. Attack on American Culture and Heritage by the Democrats.\n10. a.k.a. Obama only had one American Parent not Natural Born\n11. Democrats selling Uranium to the Russians\n12. Democrats using fraudulent evidence to get a FISA warrant on their opponents\n13. Democrats keep getting caught with Russians trying to overthrow the President.\n14. Democrats bringing in Refugees without vetting them. Why can't they set up Refugee camps in their home countries????\n15. Democrats creating a Russian Collusion and Ukraine hoax so they could cover up their crimes\n16. Democrats pass a Partisan Impeachment to Remove President Trump.\n17. Democrats shopping Federal Judges to undermine the Constitution.\n18. Democrats paid and worked with Foreign Governments to create the Dossier.\n19. 100% of Democrats vote against American Tax reform\n20. Democrats are anti-Christian and Hate Jesus and God\n21. Democrats support for our Enemies like Iran.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ExtremeModeration",
        "time": "16 September, 2022",
        "context": "I want the fbi to be non political too. it's almost like we need them to take some sort of oath to pursue justice and not let their personal bias affect their job. Or heavens for bid use your position of power to affect political change. I think we should have a crime for that. in lack of a better word let's use treason.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "stormbringer226",
        "time": "16 September, 2022",
        "context": "Now that is the definition of a \"Big Lie\".",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "thomjefferson",
        "time": "16 September, 2022",
        "context": "Of course the FBI investigates federal crimes.\nIt's also is a tool of the Biden regime used to persecute political opponents.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "stemcellfajita",
        "time": "16 September, 2022",
        "context": "When’s the next MAGA terror attack going to be? Asking for a federal law enforcement agency.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "goaliemedic37",
        "time": "16 September, 2022",
        "context": "So O'Hare works for the FBI.  That's like a used car salesman telling you the POS car you're looking at is \"great!\"  There may be some great field agents, but if the upper echelon of agents and managers are all corrupt, your whole organization is.  Sorry, but no one aside from Democrats believe in the FBI anymore, and that's a very dangerous place to be.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "yerrzokraise",
        "time": "16 September, 2022",
        "context": "When the optics are that elements within the FBI corruptly tried to or did influence an election, I don't care if 99% of it's organization does good.  It has the capability to do evil things and requires extreme oversight and/or restructure.  The fact that they also routinely use unconstitutional FISA courts/warrants means that it is corrupt to the core.  And, does not care about the rule of law.",
        "good": "6",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "TheHat",
        "time": "16 September, 2022",
        "context": "The FBI is infiltrated with criminals. The FBI is the most corrupt agency in our government.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "bj53",
        "time": "16 September, 2022",
        "context": "That's a lie. The FBI is the military wing of the democrat party.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Adown347",
        "time": "16 September, 2022",
        "context": "Corrupt as can be! I don't trust any of these organizations! DOJ, DHS, FBI, IRS all sheep for the Dems. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "1ruth1689",
        "time": "16 September, 2022",
        "context": "Yet Mr. O'Hare ignores the obvious facts about the institution's indefensible behavior and instead goes political.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "magatssuck",
        "time": "16 September, 2022",
        "context": "MAGAts  hate the FBI.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "sonarred27",
        "time": "16 September, 2022",
        "context": "The facts are. The FBI muddled themselves. So don't go crying when they do wrong and get called out on it. They made there bed. Now lie in it.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Nickvvvv",
        "time": "16 September, 2022",
        "context": "There may still be some ethical persons employees by the FBI, but their history and recent admissions by their own leadership show agency bias and work against the interests of democracy. FBI, DOJ, IRS are all agents of the deep state. The evidence is in plan site.",
        "good": "16",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Inmyopinion428",
        "time": "16 September, 2022",
        "context": "What happen to fair and honest reporting?  Fox seems to be trying to replace CNN as the biggest media supporter of the  democratic agenda.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Tamtam830",
        "time": "16 September, 2022",
        "context": "I DO NOT TRUST the FBI OR DOJ.  I am afraid they are taking away our rights if free speech and freedom of assembly.  I’ve seen their corruption first hand. ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "blackjack71",
        "time": "16 September, 2022",
        "context": "oh poor donnie, even FOX is going full turnaround on his dumpsterfire!!🤣🤣🤣🤣",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "bb2c2",
        "time": "16 September, 2022",
        "context": "Oh, sure they are, whether it’s mass unconstitutional spying, interfering in American elections, lying to courts, planting bombs or entrapping and sometimes framing innocent Americans, the debate over whether we should have an FBI is drawing to a close. They need to go.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mccracker",
        "time": "16 September, 2022",
        "context": "Made me spew my drink..",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "just_asking",
        "time": "16 September, 2022",
        "context": "\"It is the responsibility of every citizen to question authority.\"\n- Benjamin Franklin",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "darkcontinent",
        "time": "16 September, 2022",
        "context": "NOT NOW!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "paulrevere793",
        "time": "16 September, 2022",
        "context": "Leadership at the FBI has reduced a once-proud and patriotic organization to a corrupt police force for the Dems. Very sad and very dangerous for freedom in America.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mycountry",
        "time": "16 September, 2022",
        "context": "The bad guys should be easier to locate since all the phone numbers are probably on Hunters laptop that the Feds kept a secret.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ryebread025",
        "time": "16 September, 2022",
        "context": "Written by am FBI agent. Go figure",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "boa688",
        "time": "16 September, 2022",
        "context": "Of course they’re protecting our country. Democrats wouldn’t have one to use for their corrupt purposes if not.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "pickle65",
        "time": "16 September, 2022",
        "context": "\"pay attention to the facts\" you mean the Russia hoax they perpetrated on the American public, false imprisonment of political rivals. FBI has become a joke",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "AmericanCapitalist",
        "time": "16 September, 2022",
        "context": "I support all law enforcement. They risk their lives in order to keep America great.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "j364",
        "time": "16 September, 2022",
        "context": "When the director of the FBI (Comey) plays investigator, prosecutor and judge in regards to HRC, the FBI lies to a judge about the Steele dossier and then goes after former President Trump for the allegedly Top Secret documents at Mar A Lago that would upset Americas freedom (never happened), there is no way to look at this agency and say they're neutral and not left leaning.  They side with Democrats and that's about it.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "club-champ",
        "time": "16 September, 2022",
        "context": "The title alone 🤣😂🤣😂🤣😂🤣😂🤣😂🤣😂🤣😂🤣😂🤣😂🤣😂🤣😂🤣😂🤣😂🤣😂🥲😂🤣😂🤣😂🤣😂🤣😂🤣😂🤣😂🤣😂🤣😂🤣😂",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "onequestionplease",
        "time": "16 September, 2022",
        "context": "They can find Lisa Gallagher but not Ray Epps.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "WhatHappened788",
        "time": "16 September, 2022",
        "context": "Defending the FBI while they throw the police under the bus.  Unbelievable",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "KapmBob",
        "time": "16 September, 2022",
        "context": "The Agents in the lower echelons, yes.  Middle, and upper management, no.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Ryno6190",
        "time": "16 September, 2022",
        "context": "the only thing the FBI is working on and that is arresting people who have done absolutely nothing but another States news today more people are being killed and pushed on to the subway and Oregon is about to be blown up because there's too much gas and all those homeless people.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "qcsteve",
        "time": "16 September, 2022",
        "context": "Time to clean the FBI from top to bottom.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "conservativesrock45",
        "time": "16 September, 2022",
        "context": "\"With these words in mind, our nation’s opinion leaders and policymakers should not be sowing seeds of mistrust. Smearing the FBI and special agents with inflammatory allegations can only erode the foundations of our partnerships that are so important to our work. \"\n\nSorry NOT Sorry, The FBI and the DOJ have brought this on themselves openly for the last 7 years. Whomever speaks out on it is just pointing out the obvious.. Right now the FBI and the DOJ could tell me that water runs downhill and I wouldn't believe them. I think it's safe to assume Millions of other Americans feel the same way",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "seaden",
        "time": "16 September, 2022",
        "context": "There actually some good, talented agents in the FBI (Famous But Incompetent), but their leadership or lack of is what has caused the multiple disasters we've seen in recent years. In order to save this agency, it should be moved out of Washington far from the swamp politics. The next step would be take all top management and assign them to the most obscure locations where their talent could be best utilized. Lastly, the position of director should never be filled by someone with a degree in law. Mueller, Comey and Wray have demonstrated why.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "lmao749",
        "time": "16 September, 2022",
        "context": "Mr. O'Hare since 2016 the FBI has been playing politics that's why they are under the spot lite!\nexamples Clinton, Hunter ! Yes the FBI is the best in the World, but they cant play politics!!!!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "libsarepedos22",
        "time": "16 September, 2022",
        "context": "Ok Fox, why are you trying so hard to be like CNN?",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "urdaddy",
        "time": "16 September, 2022",
        "context": "The facts?  The facts PROVE the FBI is corrupt...!",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "GreatCaesarsGhost850",
        "time": "16 September, 2022",
        "context": "This was put out as an opinion piece and not a news article.\nWhy? Because it is not true.  See, opinions don't have to be truthful.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "1776TimeAgain724",
        "time": "16 September, 2022",
        "context": "To the author, congrats on your article being lamer than the lamest CNN article this week",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "fcalifny",
        "time": "16 September, 2022",
        "context": "My prayers didn't get answered last night, I was praying for all FBI agents to be slaughtered ",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "dcak78",
        "time": "16 September, 2022",
        "context": "Nobody takes issue with the agent in the field. These men and women undertaking extremely dangerous and sometimes life-altering investigations with a real sense of service to the nation should be celebrated and honored.\n\nThe leadership, on the other hand...",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bidenwasteland",
        "time": "16 September, 2022",
        "context": "A cluster of spiders.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "waes",
        "time": "16 September, 2022",
        "context": "Yes if you are a democrat ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "conservativethinker1961",
        "time": "16 September, 2022",
        "context": "Brian O’Hare is just another democrat criminal.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "beautifulman457",
        "time": "16 September, 2022",
        "context": "Er, uh, what?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "eradicateliberalism",
        "time": "16 September, 2022",
        "context": "F THE FBI. Un-American communist department now. They became the mobsters they took down.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dpc2021",
        "time": "16 September, 2022",
        "context": "gestapo now.  all political.  wray must go along with all the elitists at the top. so horrifically sad.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "O'BidentheClown",
        "time": "16 September, 2022",
        "context": "\"Safe\" as long as you do WHAT YOU ARE TOLD!!!\n\nUnbelievable... Same time at least Fox allows differing opinions, that is allowed after all.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "chargerfan#1",
        "time": "16 September, 2022",
        "context": "It took 10 FBI Agents to arrest a rope at a Nascar Garage.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rufuscompton",
        "time": "16 September, 2022",
        "context": "The DOJ and FBI need to order the immediate arrest of the Trump Judge Cannon who is purposely obstructing the investigation into Trump because she poses a national security threat to America...the FBI clearly told her that the documents are classified documents and she said she doesn't know that so she's stopping the investigations...she's giving our enemies time and putting our American operatives and allies at risk because Trump is a Russian asset...",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "UltraMAGADeplorable759",
        "time": "16 September, 2022",
        "context": "The FBI has until 2025 and then a Republican POTUS is going to shred it.  Congress may even dissolve the FBI for interference in national politics.  The FBI is as corrupt as Joseph Stalin's Soviet Secret Police in the former USSR.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "roget324",
        "time": "16 September, 2022",
        "context": "I’m sure that’s true. But what is also true is that there is a cabal in the FBI that undertakes highly partisan Political hit jobs for the liberal powers that be   Neither is mutually exclusive. ",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "thomjefferson",
        "time": "16 September, 2022",
        "context": "I wonder if he could say that with a straight face.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "fjb22313",
        "time": "16 September, 2022",
        "context": "Lol",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "thedudeinflorida827",
        "time": "16 September, 2022",
        "context": "I believe this to be true or at least want to. But political stances are in the fbi and there is lots of bias towards certain issues and people. There is no way the only bad calls they have made have been since Trump. Democrats have some fbi in their pocket and that is fact from things of late. Lots of the times the same people are involved especially pertaining to Trump",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "nomobrandon",
        "time": "16 September, 2022",
        "context": "and if you put your tooth under your pillow.....",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "huntfishsleeprepeat",
        "time": "16 September, 2022",
        "context": "Good joke",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Willyrobt",
        "time": "16 September, 2022",
        "context": "The FBI is corrupt. There is no excuse for what they have been doing. Democrats have caused this and they will attempt to change any and all voting results.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "glacierwolf091",
        "time": "16 September, 2022",
        "context": "There was a time when the FBI was in the news at least once, if not several times a week with reports of very important criminals being captured, arrests made, organized crime and foreign government agents being caught.  Today - crickets.  There was a time when the top brass toe'd the line and leadership led by example - anything with a hint of politics was quickly kicked back into the politicians faces. FBI had integrity.   What are they doing now - besides investigating domestic terrorists that turn out to be parents attending local school boards or answering letters from Democrats like Newcomb to investigate Republicans?  FBI is a small service. In any small service, the priorities of the top personnel quickly trickle down to those in the small local offices.  That Newcomb actually expects his letter against Abbot and DeSantis to be taken seriously - is proof of how political the FBI is.  If were the Director, his reply would be the ashes of that letter.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "OldSchoolGuyToo",
        "time": "16 September, 2022",
        "context": "FBI needs a leader with the strength of J Edgar with the moral fortitude of Eliot Ness and the intelligence of Sherlock Holmes.  I am allowed to dream, aren’t I?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "insipidreactions",
        "time": "16 September, 2022",
        "context": "Yeah, just look how well the same apparatus worked in Ukraine and then Germany before that.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "blackjack71",
        "time": "16 September, 2022",
        "context": "so many maga tears!!!",
        "good": "0",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "dontbesogulliblemcfly",
        "time": "16 September, 2022",
        "context": "You can say that the honest, dedicated rank and file FBI folks should become whistleblowers and speak out; but to what end? The only avenues they'd have to be heard are in congress and the media - both of whom are biased against any threat to this corrupt DOJ.\nOf course, things might change come November!",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dementia-joe771",
        "time": "16 September, 2022",
        "context": "FBI corrupt  to the core",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "beaub",
        "time": "16 September, 2022",
        "context": "No, your fluff piece doesn’t ring true. Sure, there are good SA’s, SSA’s and ASAC’s, but there sure is a problem these days in upper management. From a retired person, I’m embarrassed and no longer wear my academy ring. ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "DissidentAmeriCan-notAmeriKantz",
        "time": "16 September, 2022",
        "context": "Please for the children. A great many unoccupied beds this time of year at the MV. If we save one life, by giving them on open Mansion, to help them get on with their lives. Just two weeks and we can make a difference in so many, many lives. Won't you please open the Mansion doors don't be an Amerikantz...Sweet Mohammered please help flatten the curve at the southern border.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jackson32",
        "time": "16 September, 2022",
        "context": "There is no difference between the FBI and the KGB",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "johnson,joe",
        "time": "16 September, 2022",
        "context": "I believe there are good people that work at the FBI… There’s good people in every organization. But there’s also toxic people that are dragging down the organization. And the people that are honest and good need to out these people and EXPOSE  them. They appearing to the public rotten to the core. The American people are potential Jurors cases that they investigate. If they keep being dishonest they will lose all credibility and they will never be able to get a conviction in cases they are apart of. The politics some are playing is ruining the department. The entire world sees this. It’s played on every foreign media. Everyone sees with a laughing stock the FBI has become. If the people wanna change it and they need to be exposed and people need to come out.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "grandma101",
        "time": "16 September, 2022",
        "context": "Then tell the fbi to stop practicing politics ",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "hateseveryone",
        "time": "16 September, 2022",
        "context": "O'Hare the babbling leftist clown strikes again.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "it'sclassified51",
        "time": "16 September, 2022",
        "context": "Prior to Obama exiting office the DOJ and FBI were involved with the Democrats in political acts. All has been documented and is there if one really wants to do the homework. Therefore it’s a little too late to assume the FBI has had a change of heart and is truly dedicated to protecting America without being political.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Marine-82-35",
        "time": "16 September, 2022",
        "context": "If the average agent was uncompromised, there would be thousands of FBI whistleblowers. ",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Anarchy-From-Texas",
        "time": "16 September, 2022",
        "context": "The Trump Zombies and Sheep don't want to hear the FBI are the \"good\" in this process.  They don't understand \"good\" until it's only Trump telling them that!",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "gregoryculver",
        "time": "16 September, 2022",
        "context": "Yes, they do some police work.  But I remember when the FBI was a law enforcement agency, not a woke liberal political enforcement wing of the Democratic party.",
        "good": "15",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "ohnutstoyou",
        "time": "16 September, 2022",
        "context": "\"The allegations – that the FBI is somehow driven by political bias – are simply untrue.\"  And we should not believe our own eyes and ears, eh Brian ??!!   Quote the Raven, NEVERMORE !!!!!",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bigislandhawaiian580",
        "time": "16 September, 2022",
        "context": "Too bad the FBI has been playing politics for years.\n\nThey lied to get the FISA based on a fake Russian dossier \nHad agents fired and disciplined for bias while investigating Trump \nLied to protect Joe Biden during the election by saying the Hunter Biden lap top story was Russian disinformation \nLied to social media companies about said fake Russian disinformation so they would ban anyone who even mentioned it (Which they did).\n\nAnd \n\nTimothy Thibault, an FBI assistant special agent in charge, was forced out for mishandling info related to the Hunter Biden Lap top story.\n\nSounds pretty political, doesn't it?",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Okie82",
        "time": "16 September, 2022",
        "context": "Funny the author is a 23 year FBI agent, and he still is an agent. So he tells us are eyes lie to us. We have seen the political motivations FBI, especially in the last 7 years. He not going to be honest, he would get into major trouble with his bosses. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "historical-maga-2024",
        "time": "16 September, 2022",
        "context": "Going after parents at school  board meetings and going after Biden’s political opponents are not contributing to keeping Americans safe.  \n\nRetire all democrats every voting opportunities you get!!",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "RedScissors",
        "time": "16 September, 2022",
        "context": "If policiticians had integrity, the job of the FBI would be much easier.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cancunjon",
        "time": "16 September, 2022",
        "context": "Sorry, I don't buy it. I'm sure there are a lot of agents that want to do the right thing, but that doesn't mean much when the boss won't let them and instead enlists them into the American Stasi. The whole \"it's for the children\" argument is just a smoke screen to distract from the ugly truth.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "oilman1620",
        "time": "16 September, 2022",
        "context": "The FBI works for the Socialist Biden administration. You know that Socialist Regime in Washington? They used to work for the American people, but that was a long time ago.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mitch1297461",
        "time": "16 September, 2022",
        "context": "There are many FBI supervising agents and special agents who are honest and hard working people, but there are also multiple hundreds of FBI executives, supervising agents, special agents, and legal specialists who are tainted and corrupt. These corrupt individuals must be rooted out and prosecuted for their crimes before I am satisfied that the FBI can once again be an effective federal law enforcement agency. That means prison time--not retirement with their full pensions. They must be incarcerated and given no pension or other retirement benefits, or other tax supported income for the rest of their corrupt lives. Let them work for a living instead of living off graft and other corrupt payoffs.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "joebidensdementia499",
        "time": "16 September, 2022",
        "context": "Defund the FBI.  Shut it down and start over.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "goolie",
        "time": "16 September, 2022",
        "context": "biden-- zelensky--kolomoisky--PRIVATBANK--Burisma",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sickandtired45",
        "time": "16 September, 2022",
        "context": "Really? Then why are pro-life pregnancy centers and churches still getting vandalized months after the SCOTUS leak?  You know who it is... Jane's Revenge.  But hey, make sure you investigate moms getting angry at school boards.   Why is Hunter Biden not being investigated?  Why aren't the Clinton's being investigated? Why are there protests at justices' houses? Why aren't those folks arrested?",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "onlyeng",
        "time": "16 September, 2022",
        "context": "Certainly the FBI has many important tasks to accomplish.  But many are wondering how they can make the time and effort to do those when it seems a large portion of the FBI is focused on politically directed efforts.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "FGN337",
        "time": "16 September, 2022",
        "context": "He can sing at the top of his lungs how virtuous the FBI is, but facts matter.  ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "PhxRising",
        "time": "16 September, 2022",
        "context": "The FBI is irredeemably corrupt and needs to be defunded.  The only people at the FBI that i would trust with anything are the whistleblowers.  Everyone else is complicit",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "repairmanjack58",
        "time": "16 September, 2022",
        "context": "Sounds like a good propagandist.  Wonder what he would say about J. Edgar Hoover?  I am sure that there are some good FBI agents, but all the stories that keep coming out (sit on Hunter Biden laptop investigation until after the election) portray the FBI as hopelessly political.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "America-Has-Fallen",
        "time": "16 September, 2022",
        "context": "FBI does what????  Is that a Babylon Bee article?",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "pda79",
        "time": "16 September, 2022",
        "context": "The FBI & DOJ has lost all trust as far as I'm concerned. They need a complete overhaul where they stop being politicized & start working for Americans! It'll be a long time before their ever trusted again, having lost ALL credibility!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "AmericanCapitalist",
        "time": "16 September, 2022",
        "context": "Confidence in America's federal law enforcement is being undercut by Trump and his magas because they want to break federal laws and get away with it. It's not working.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Fedup1788",
        "time": "16 September, 2022",
        "context": "Ethics and Integrity in this country is DEAD!!! When people aren't held accountable for their actions this is what you get in EVERY AREA of society!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Mbrunesr",
        "time": "16 September, 2022",
        "context": "Every election the seated president orders the fbi to investigate his opponent and dig up all the dirt possible. Your only as good as the person who signs your pay check. ",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "kingdombuilder1",
        "time": "16 September, 2022",
        "context": "This article is pure cow fodder.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "corruptliars2022",
        "time": "16 September, 2022",
        "context": "CORRUPTION isn’t safe",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "oldmarinetoo",
        "time": "16 September, 2022",
        "context": "Yea,and we have no inflation,millions of illegals aren't streaming across the border and we aren't in Joey's recession. But of course even with their pathetic track record the FBI is our glorious saviours.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dib1960",
        "time": "16 September, 2022",
        "context": "I have total respect for the FBI agents.  I even know a few personally.   Those guys and gals are just doing the jobs that they are assigned to do, to the best of their ability.\nWhere my respect lacks is in the FBI leadership that is totally partisan and constantly doing questionable things.   You say look at the fact, but they refuse to show us the facts, since they redact everything.\nThere was a quick article the other day on FBI whistleblowers on their own leaders.  The partisan and questionable leaders response was that they will investigate their own.  Any other police unit or government unit would say, \"We will bring in a third party to investigate the issue.\"   Where are the facts on that one?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tsphillips92",
        "time": "16 September, 2022",
        "context": "I just have two words:  Crossfire Hurricane.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "That'smyopinion",
        "time": "16 September, 2022",
        "context": "Let's see if this is true... Assign them to monitor the ballot boxes.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "scorpiontailed",
        "time": "16 September, 2022",
        "context": "I suggest the author read the recent WSJ article on how Robert Mueller, as head of the FBI, has destroyed the credibility of the FBI by first centralizing the agency in Washington (where previously it was run out of its field offices, depending on where a case originated) and removing the requirement that all leadership be cultivated from field agents, leading to political operatives running the agency.  The rot in the FBI is in its leadership, not its agents.  Mueller's changes to the organization should be rescinded, then Americans could start trusting the FBI again.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "fightorgolf",
        "time": "16 September, 2022",
        "context": "Wait wait wait\n\nI thought the fbi was the  Gestapo, toxic, out to get trump etc. \n\nCan we get our live and hate consistent please fox",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "f.a.",
        "time": "16 September, 2022",
        "context": "It's not the FBI agents that are working in the trenches but the upper echelon that is acting like another arm of the democrat party and our current administration.  When was Hunter Biden's or Hillary's home raided by the FBI?",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "sageryde",
        "time": "16 September, 2022",
        "context": "The most corrupt organization in the USA tells the USA that they are not corrupt. This isn't news. This story is a PR piece.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "torpedoman",
        "time": "16 September, 2022",
        "context": "FBI is protecting America from senior citizens who support Trump and parents who voice opinions at school board meetings. These people are domestic terrorists and armor clad FBI agents with machine guns and battery rams should arrest these dangerous people and put them in handcuffs and leg irons and it takes really tough men to do this.",
        "good": "3",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "mookietmotorhead",
        "time": "16 September, 2022",
        "context": "Until they clean up their staff, some very ugly recent history and operations, they will never be trusted. How many front doors have they broken down looking for some one \"rumored\" to be in DC on Jan 6th who were never there? Political foot soldiers, not an independent agency .",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "lllllllllvvvvvvvvv",
        "time": "16 September, 2022",
        "context": "oh yeah i have full confidence in the democratic fbi",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "ajlough",
        "time": "16 September, 2022",
        "context": "The fact that the author can not even acknowledge the reason for the mistrust, their own actions generated, reinforces the lack of any credibility they now enjoy. The statement that some part of the FBI did something good in the past or that agents lost their lives, while laudable, in no way excuses what is being done today or the corrupt FBI officials in office now. The FBI is a failed state. I did want it and wish it wasn’t true, but reality can only be ignored for a short time.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "fleendarthemagnificent",
        "time": "16 September, 2022",
        "context": "If the FBI is protecting us from criminals, they've failed miserably. The Democratic party still exists and these criminals are still free and destroying America.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "razort",
        "time": "16 September, 2022",
        "context": "There is no doubt that there are good people in the FBI, the problem is with the  individuals at the top.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Bingo2016",
        "time": "16 September, 2022",
        "context": "It's time to defund the FBI.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "IBLAMEJILL",
        "time": "16 September, 2022",
        "context": "Well there's up to 20 whistleblower FBI agents who might differ with this opinion...",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bb2c2",
        "time": "16 September, 2022",
        "context": "We are talking about the same FBI that was lying to the FISA court, to spy on the Trump campaign, lied to the FISA court to run with the Russian hoax. The same FBI that held a bogus investigation, all the while knowing it was bogus.\nWhen something is created for specific purpose and can't or won't get the job done and can't be trusted, it needs to be discarded.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "rs101273",
        "time": "16 September, 2022",
        "context": "Much of what is stated here is true, but the politization of the FBI needs to be stopped. Partisan FBI leaders and partisan FBI agents need to be removed immediately",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "PrinceCaspian",
        "time": "16 September, 2022",
        "context": "Fake news from a FAKE reporter.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tjamo",
        "time": "16 September, 2022",
        "context": "Nah!  The FBI is populated by a bunch a government bureaucrats, none of whom would last a day as a street cop.  They just have over a $9 billion of taxpayer money to waste.  You'd think we'd get more for our money.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "PascoArt049",
        "time": "16 September, 2022",
        "context": "FBI... \"pay attention to facts, not politics.\" That's good advice FBI. You should follow it!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "grizzly4962",
        "time": "16 September, 2022",
        "context": "As far as rank and file agents I tends to agree but leadership is corrupt.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "neverdemsagain810",
        "time": "16 September, 2022",
        "context": "Tell the current FBI agents that O'Hare!...👌",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "imsmarterthanyou873",
        "time": "16 September, 2022",
        "context": "We still dont need them",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jonar",
        "time": "16 September, 2022",
        "context": "I'm sure \"most\" agents do an excellent job.  The problem has been some agents from Washington DC seem to be more political.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "thegreatone063",
        "time": "16 September, 2022",
        "context": "Nonsense. The leaders of the FBI are crooked and operatives of the DNC. Proof: laptop of Jr. Biden the druggie. Many examples. They should not be trusted and citizens should not cooperate with them. Time to disband and revoke senior officials pensions. Shame on them for losing American's respect. They did it to themselves with a push from Soros.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "newssucks973",
        "time": "16 September, 2022",
        "context": "The fbi working to keep you safe.  Article says OPINION.  \nThat's great.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Clean95",
        "time": "16 September, 2022",
        "context": "Funniest headline I've seen in years. The Federal Bureau of Incompetence is late of the problem, if they want real criminals start at 1600 Pennsylvania ave and his son, until then they are worthless and corrupt. ",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "goolie",
        "time": "16 September, 2022",
        "context": "hoover--in a lifetime because he could intimidate sitting presidents.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Bingo2016",
        "time": "16 September, 2022",
        "context": "How many months did they investigate Trump for the collusion hoax???  Make that years?",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bonespurs938",
        "time": "16 September, 2022",
        "context": "remember \nGreen called for “Defund FBI”.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "matthew5",
        "time": "16 September, 2022",
        "context": "Hunter Biden. Case closed.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "JamesGurney",
        "time": "16 September, 2022",
        "context": "Lies.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "USA1",
        "time": "16 September, 2022",
        "context": "So funny a FED saying the FBI is focused on facts, not politics. It reminds me of all the occasions when the democrats investigate themselves and find they did nothing wrong.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jubobby",
        "time": "16 September, 2022",
        "context": "defund the fbi",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "this_might_hurt",
        "time": "16 September, 2022",
        "context": "Trump in 2016:  “The DOJ is investigating Hillary. This means she’s corrupt.”\n\nTrump in 2022: “The DOJ is investigating me. This means the DOJ is corrupt.”\n😳",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "turkeytrot",
        "time": "16 September, 2022",
        "context": "FBI seems to have one thing on their mind ‘get Trump’ ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "PFUKKSOROS",
        "time": "16 September, 2022",
        "context": "Foxnews trying to get there sheep in line. FBI is a political tool and has been since it’s creation",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "linabe",
        "time": "16 September, 2022",
        "context": "Most FBI agents have law degrees, they're like lawyers.  Theres nothing good about lawyers!",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Rollingblackout",
        "time": "16 September, 2022",
        "context": "Defund the fbi and irs that will lower taxes. Let states hire more state police. That is security. ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Christobol141",
        "time": "16 September, 2022",
        "context": "Yep. Keeping us safe from all conservatives and anyone who opposes the Obiden regime.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "marpcato",
        "time": "16 September, 2022",
        "context": "FBI has been corrupt since its founding,  I guess this guy never read a Bio on J. Edgar Hoover",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "verified",
        "time": "16 September, 2022",
        "context": "THE UPPER ECHELON OF THE ENTIRE JUSTICE DEPT IS CORRUPT\nSAD VERY SAD",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "OrangeScissors",
        "time": "16 September, 2022",
        "context": "Riiiiiiight.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "oldog71",
        "time": "16 September, 2022",
        "context": "Fully compromised democrat gastapo ",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "repairmanjack58",
        "time": "16 September, 2022",
        "context": "The Parkland shooter was reported to the FBI before his school shooting rampage.  They did such a good job preventing that.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "yelnatsekud",
        "time": "16 September, 2022",
        "context": "DEFUND THE fbi!",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "c1t",
        "time": "16 September, 2022",
        "context": "\"FBI is working every day to keep our country safe...\" Yeah, right. I'll sleep so much better tonight. LOL!!!",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "I_Mute_Liberals989",
        "time": "16 September, 2022",
        "context": "I suspect a fair number of agents are good, but certainly ALL leadership (agents and gov civilian workers need to go) as they are corrupt to the core.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "travestar869",
        "time": "16 September, 2022",
        "context": "The FBI has demonstrated a pattern of politicization and prosecutorial misconduct for 6-years or more. The People don't trust it, for good reason.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jim2020027",
        "time": "16 September, 2022",
        "context": "Under the Biden regime the DOJ and FBI the bad outweighs the good. When our justice department's are influenced by the communist regime then they are no longer looking at evidence of crimes but only being influenced on who the government wants labeled as criminals (those who are opposed to the regime)",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "darthnugget",
        "time": "16 September, 2022",
        "context": "This article glows",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "FLAP576",
        "time": "16 September, 2022",
        "context": "Not buying this B.S. opinion piece for a second.  Sorry, but actions and facts speak a whole lot more than opinion pieces attempting to cover up the truth.  Did this opinion piece mention anything about the dozens of F.B.I. whistle blowers coming forth in recent months?  Nice try.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "AmericanCapitalist",
        "time": "16 September, 2022",
        "context": "Trump and a lot of his maga associates have broken a lot of laws. They're only hope of avoiding jail is to convince enough Americans not to trust the American justice system. That or leave the country.",
        "good": "0",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "rick7008",
        "time": "16 September, 2022",
        "context": "The FBI can be great, if their leaders could keep their noses out of politics.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sean992",
        "time": "16 September, 2022",
        "context": "The fox in the hen house says, don't mind us, we're just keeping the eggs safe....",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mravon132",
        "time": "16 September, 2022",
        "context": "it's the leadership that is corrupted and bias",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "blue457",
        "time": "16 September, 2022",
        "context": "Stop being an FBI apologist.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "sittinonthedock546",
        "time": "16 September, 2022",
        "context": "Between the FBI & Homeland Security🙄, watch your back.  Meanwhile, our leadership is soft on criminals, wants to take your guns, & of course, punish you for not thinking woke.  ",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "semperfi47",
        "time": "16 September, 2022",
        "context": "This is a joke, right?  I must be missing some of the text because I didn’t get the “Punch Line”?  I trust the FBI and DOKJ just about as far as I trust Pelosi, Biden and the rest of the liberal communists regime!",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Runaway",
        "time": "16 September, 2022",
        "context": "Haha Every shooter who killed innocent people were on the FBI watch list.  Great job FBI",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "ajnson",
        "time": "16 September, 2022",
        "context": "And after a hard period of work they get sent to Florida, ... for vacation.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "flyguymike",
        "time": "16 September, 2022",
        "context": "The FBI is the only domestic terror organization operating within our borders. That's not politics or rhetoric it's already been proven multiple times over.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "aries57",
        "time": "16 September, 2022",
        "context": "I wonder how much the CCP is paying this guy.  FBI not playing politics, right, they go after the ruling party's political enemies while ignoring actual crimes being committed or have committed from the ruling party and their family.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "karenjost",
        "time": "16 September, 2022",
        "context": "I just hope that they will protect conservatives when the liberal Democrats decide that conservatives need to be jailed for their beliefs.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "krazykid",
        "time": "16 September, 2022",
        "context": "No, they are targeting people who refuse to conform to leftist policies",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "TrumpMAGA2024570",
        "time": "16 September, 2022",
        "context": "Mr Ohare, are you serious?  Hiring a Russian agent for three years to go after Donald Trump while Comey and others in FBI knew of the Dossier. Raiding Donald Trumps personal residence?  Not investigating Hunter Biden?  Not investigating Clinton’s, etc, etc. The FBI is as corrupt as it can be politically aligned with DemocRATS",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "lukemeter711",
        "time": "16 September, 2022",
        "context": "The FBI has become nothing more than a group of militant thug enforcers for the democrat party. They’re more concerned with covering for the many crimes democrat elites commit, causing trouble for the lefts political enemies, and going after parents who are sick and tired of the woke agenda in the classroom than protecting anyone from harm. We’ve seen this corruption play out time and time again and to keep assuming the FBI is a force for good is simply oblivious at best.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "DemsRCommies820",
        "time": "16 September, 2022",
        "context": "yea, because parents worried about their kids education are totally criminals....",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "daka0603",
        "time": "16 September, 2022",
        "context": "So wrote the employee of the FBI",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "lovegop",
        "time": "16 September, 2022",
        "context": "I used to believe this but facts are facts. Field agents maybe deserve respect and are doing their jobs. However, the politicized upper management has demeaned the whole bunch. It will take years to regain trust and respect IF EVER",
        "good": "68",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "DarthCadsRevenge",
        "time": "16 September, 2022",
        "context": "Q the ignorant party of Law and Order. LOL",
        "good": "0",
        "bad": "7",
        "replies": []
    },
    {
        "user_name": "Alotta.Anger",
        "time": "16 September, 2022",
        "context": "And then they go and confiscate the business phone of Mike Lindel.  At least mike says they are looking for promo codes.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "trump'smyguy528",
        "time": "16 September, 2022",
        "context": "FBI is rotten to the core like any one of our political institutions.",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "thercattrainer",
        "time": "16 September, 2022",
        "context": "No matter what good intentions that many of these FBI agents might have, the Leadership of the Bureau is untrustworthy and rotten to the core. Where is the FBI when MS-13 members, drug cartel members, human traffickers, and child traffickers come across our Southern Border? They are nowhere to be found! ",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Marle784",
        "time": "16 September, 2022",
        "context": "If the FBI were politically neutral there would never have been a clandestine raid on Mar A Lago or aphony FISA warrant on Carter Page or Comey announcing Hillary emails weren’t prosecutable.\nNo the FBI is tainted and its leadership needs to be vetted.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "verified",
        "time": "16 September, 2022",
        "context": "When the justice dept goes corrupt so goes the country",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "🇺🇸💯💯💯😎💯💯💯🇺🇸",
        "time": "16 September, 2022",
        "context": "They’re not “smears” when they’re true. Strzok and his girlfriend Page. Yeah. Straight shooters. Not!",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "someonewithanopinion",
        "time": "16 September, 2022",
        "context": "If only their reputations spoke for themselves. ",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "razort",
        "time": "16 September, 2022",
        "context": "Mabe the media should pay more attention and not play politics.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "alilbirdietoldme222",
        "time": "16 September, 2022",
        "context": "Who wrote this Fox?  ",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "BeKindtoEveryone239",
        "time": "16 September, 2022",
        "context": "This story is full of exaggerations, trust me, I know. The local police and other feds do the brunt of securing communities. The FBI is very consumed with investigating so called domestic terrorists, few of which are legitimate.  They are side tracked, politically distracted, and exploit many other law enforcement agencies to justify more money for themselves. They need an overhaul.",
        "good": "8",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "mr1962us496",
        "time": "16 September, 2022",
        "context": "This guy most likely is an FBI op or works within the DOJ and you can tell by his stance on how uncorrupt our nation's government is!!\nI think in 2016 the FBI proved where it stood and cemented that in the 6years that have followed.\nThey no more protect this country and 9/11 is proof of that truth. If they did protect this country those Terrorist would not have been able to train here in this country in the first place and would have caught them way before they could bring down the towers!!\nJust fact...",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "mb985",
        "time": "16 September, 2022",
        "context": "Absolutely. I'm tired of this ra-rah for law enforcement for campaign slogans and photo ops and then conspiracy theories when someone they like is investigated.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "junglejim275",
        "time": "16 September, 2022",
        "context": "If they closed down the Washington and New York bureaus they would be much better off.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "cablaf",
        "time": "16 September, 2022",
        "context": "FBI is corrupted at the top and needs to be cleaned up and struck down.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "hadenough!055",
        "time": "16 September, 2022",
        "context": "FBI is most corrupt agency in the US. ",
        "good": "4",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "Docrocket551",
        "time": "16 September, 2022",
        "context": "But they had the time to send three agents to a women's house who had a Trump sign in front of her house, because they received an anonymous tip that she may have been in DC on January 6th. Wow.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "scove",
        "time": "16 September, 2022",
        "context": "Nice PR piece but actions speak louder than words. How much did the FBI pay for that PR puff piece?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cboy430",
        "time": "16 September, 2022",
        "context": "Never trust a G-Man",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Colts",
        "time": "16 September, 2022",
        "context": "Only if your a democrat ",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Poppop744",
        "time": "16 September, 2022",
        "context": "No one is safe with Joes KGB on the loose. Going after the My Pillow Guy Mike? Now that’s a terrorist if I ever saw one. What did he threaten, a pillow fight? ",
        "good": "8",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "bb2c2",
        "time": "16 September, 2022",
        "context": "The FBI is the biggest criminal organization on the planet. An organization without integrity, honor or discipline, reduced to a mob. Nothing more than a community of criminals, without a hint of any ethics...",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Goldtoof",
        "time": "16 September, 2022",
        "context": "The FBI used to be a class organization. Obama got rid of all the patriots and now they are mostly liberal pajama boys and girls. Same thing for the military.",
        "good": "4",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "kelo4u23",
        "time": "16 September, 2022",
        "context": "If Trump had lost the election we would have never found out just how corrupt all governments are. ",
        "good": "4",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "1Rebel007",
        "time": "16 September, 2022",
        "context": "Every day the FBI is working to further the Dem's communist goals in America. The FBI is now the \"SS\" arm of the Dem party.",
        "good": "7",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "xenoglossazb",
        "time": "16 September, 2022",
        "context": "The fact that Hunter Biden is not in cuffs is testament to the fact that the FBI is purely political. The fact that Strzok and Page are not in cuffs is testament to the fact that the FBI is purely political. The fact that the FBI lied repeatedly to FISA court judges is testament to the fact that the FBI is purely political. The fact that the FBI colludes with Facebook to monitor the private messages of users, and identifies those who question elections as terrorists is testament to the fact that the FBI is purely political. The fact that the FBI harrasses and intimidates only Trump supporting Republicans is testament to the fact that the FBI is purely political. Why would ANYBODY deny facts and even consider that this partisan is remotely telling the truth?",
        "good": "24",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "lostlink_returns",
        "time": "16 September, 2022",
        "context": "\"African American arrest rates for violent crime – 45% of arrests nationally \" leaving 55% law abiding or uncaught.  Shall we apply the same statistics to lawlessness in the FBI?  Probably not, most rank and file FBI agents are probably upstanding individuals, dedicated to keeping Americans safe.  But, there is a small percentage at the top, manipulating the reins of power, that are not interested in rule of law.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "biglycovfefe666",
        "time": "16 September, 2022",
        "context": "There is no fatter domestic terrorist than trump",
        "good": "2",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "northgeorgia190",
        "time": "16 September, 2022",
        "context": "You are corrupt to the core! The American people do not trust you anymore!!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bobreteod",
        "time": "16 September, 2022",
        "context": "no credibility",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Draw*and*Quarter*at*Dawn",
        "time": "16 September, 2022",
        "context": "How can we the people believe and trust that the FBI is doing all they can to ensure actual crimes are investigated - properly - and perpetrators see justice?\n\nEpstein's client list?\nHunter's laptop?\n\nOh, I know!  Steele Dossier!",
        "good": "6",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "plowboy248",
        "time": "16 September, 2022",
        "context": "Oh yes, the pillow guy is a real bad guy.",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "brandonfog",
        "time": "16 September, 2022",
        "context": "Bottom line - if they are working for the Biden administration, they ARE NOT working to keep us safe. They are being used to control the public for a small group of tyrants.",
        "good": "6",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "raydelv",
        "time": "16 September, 2022",
        "context": "The Field Agents are dedicated individuals but the problem is with upper management. The perception looks like the FBI is a Democrat Political Muscle Men. . They went after a Presidential Candidate, lied to get FISA warrants, ignored the Hunter Biden Lap Top. ",
        "good": "15",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "billyc.",
        "time": "16 September, 2022",
        "context": "The upper echelons, the FBI headquarters, are politicized and corrupt to the core.",
        "good": "4",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "stinky395",
        "time": "16 September, 2022",
        "context": "If you believe that the Brooklyn bridge is up for sale.  LOL",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "johnnyontheslot",
        "time": "16 September, 2022",
        "context": "So you're saying that there is no white supremist quota that agents are graded/rewarded by? Not what I heard yesterday.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "bobfred99",
        "time": "16 September, 2022",
        "context": "Nothing like the radical right MAGAs trying to defund our police so they don't have to be held accountable.",
        "good": "2",
        "bad": "5",
        "replies": []
    }
]