[
    {
        "user_name": "quietsmith",
        "time": "16 March, 2022",
        "context": "I wish I could be there.",
        "good": "9",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "eebb2021",
        "time": "17 March, 2022",
        "context": "Really looking forward to the photos from this project, it will be amazing and fascinating.   It's nice to know that at least NASA is still doing wonderful work.",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Brylcream_Boomer",
        "time": "17 March, 2022",
        "context": "God I hope Russia doesn't shoot missiles at JW.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "quietsmith",
                "time": "17 March, 2022",
                "context": "Its too far away for that",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "gdheib",
                        "time": "18 March, 2022",
                        "context": "They have sent probes to Mars before so definitely not too far, but no strategic need to do so.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "quietsmith",
                                "time": "18 March, 2022",
                                "context": "The James Webb telescope is a million miles out and while it's probably not completely impossible to hit it, its so far away and such a tiny target that hitting it would require a perfect shot that would take a month to get there.",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "fakeitgoodnasa",
        "time": "18 March, 2022",
        "context": "Which version of photo shop will Naza use for their comical cartoon ‘images’ of these galaxies allegedly formed from the non-scientific (and fake) “Big Bong” theory ?",
        "good": "2",
        "bad": "5",
        "replies": [
            {
                "user_name": "nepawoods",
                "time": "19 March, 2022",
                "context": "You don't believe other galaxies exist?",
                "good": "0",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "fakeitgoodnasa",
                        "time": "21 March, 2022",
                        "context": "The real question is do you believe in NASA’s comical collage of ‘galaxies’. Because if you buy into their fake imagery, then you have been beguiled into the fraudulent religion of astro-evolution.",
                        "good": "1",
                        "bad": "1",
                        "replies": [
                            {
                                "user_name": "nepawoods",
                                "time": "21 March, 2022",
                                "context": "You think galaxies are fake, don't you.",
                                "good": "2",
                                "bad": "2",
                                "replies": [
                                    {
                                        "user_name": "dan5047628",
                                        "time": "22 March, 2022",
                                        "context": "wouldn't surprise me. \nI've seen photos of those spiral things that scientist claim are galaxy's. Is God capable of creating what scientist claim, Yes. \nDo I trust Atheist scientist, No. Do I trust any men I meet, No. Not until they prove themselves trust worthy.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "user_name": "in4mdvoter",
                        "time": "24 March, 2022",
                        "context": "You forget, this is the website for the flat earthers and conspiracy nuts.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "dan5047628",
                                "time": "25 March, 2022",
                                "context": "And those religious zealots that worship scientist and believe they never lie.",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "sciencerocks",
        "time": "17 March, 2022",
        "context": "Better than expected is always good. It shows realistic expectations, and a promising future for this fascinating project.",
        "good": "13",
        "bad": "0",
        "replies": [
            {
                "user_name": "ammobay",
                "time": "18 March, 2022",
                "context": "The teething pains for the Hubble, especially the out of focus issue, were horrible. Fortunately it was in earth orbit and crews could reach and repair it. Glad that the James Webb is working well. It's out of reach for present systems.",
                "good": "3",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "#FightBack#ThePersistence",
        "time": "17 March, 2022",
        "context": "As an aspiring Aerospace Engineer (I'm halfway through college for it), this is extremely exciting for me. I can't wait to see what the JWST has in store for us in a few months.",
        "good": "10",
        "bad": "0",
        "replies": [
            {
                "user_name": "beadgBass",
                "time": "17 March, 2022",
                "context": "Best wishes for your studies!",
                "good": "10",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "NormanBlanton",
        "time": "17 March, 2022",
        "context": "I curious on how they will add color, as the Web is an infrared telescope.\n\ncan the distinguish wavelengths and then shift them...",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "dan5047628",
                "time": "21 March, 2022",
                "context": "Photoshop22",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "alvawolf",
        "time": "17 March, 2022",
        "context": "👍",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "motie",
        "time": "17 March, 2022",
        "context": "$10 billion sounds like a lot however, you must take into account that the telescope has been in development since 1996.  Also, take into account the 125 million citizens who actually pay Federal income tax, the cost per taxpayer has been $3.00 per year.",
        "good": "7",
        "bad": "0",
        "replies": [
            {
                "user_name": "onyoursixinca",
                "time": "17 March, 2022",
                "context": "Yeh, but how much of that $10 billion did we borrow and how much of it went back to Politicians for their support in spending that much for it?",
                "good": "4",
                "bad": "3",
                "replies": [
                    {
                        "user_name": "PurpleChefHat",
                        "time": "21 March, 2022",
                        "context": "10% went to the \"Big Guy\" per always.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "realist12345678",
                "time": "17 March, 2022",
                "context": "4.5 days of military expenditure.\nPuts it in perspective.",
                "good": "2",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "navyvet'94",
                        "time": "17 March, 2022",
                        "context": "The best offense is a great defense.",
                        "good": "3",
                        "bad": "1",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "polo1",
                "time": "23 March, 2022",
                "context": "What are we gaining from this 10 billion dollar expenditure? We get pretty pictures of things that will make no difference in anyone's life. We will never reach another galaxy. We won't even reach another star. This is a colossal waste of resources.",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "bidimwit",
        "time": "17 March, 2022",
        "context": "Great picture in the article! Wait, no I just expected a picture in an article about a picture...",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "idiocracyisuponus",
        "time": "23 March, 2022",
        "context": "Really cool.  I hope they don't see \"too far back in time.\"  They may take a snap shot of God flipping them the bird.  (No offense, God).",
        "good": "2",
        "bad": "0",
        "replies": [
            {
                "user_name": "dan5047628",
                "time": "23 March, 2022",
                "context": "Funny, but there are many that will wish that all God did to punish them was flipping them the bird.",
                "good": "4",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "idiocracyisuponus",
                        "time": "23 March, 2022",
                        "context": "True dat.",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "jeffryd",
                "time": "23 March, 2022",
                "context": "That's actually the flaw with the Big Bang Theory.....which supposedly came from nothing....a belief in magic!",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "nepawoods",
                        "time": "24 March, 2022",
                        "context": "\"the Big Bang Theory.....which supposedly came from nothing\"\n\nThat's false.  The big bang theory doesn't claim that anything came from nothing.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "dan5047628",
                                "time": "24 March, 2022",
                                "context": "That is True, there had to be enough matter to fill the Universe with trillions of Planets and other celestial bodies. \nI wonder where all that matter came from?? Maybe it was left there by \"Accident\" before the fuse was lit.\nLOL",
                                "good": "0",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "vinny1021",
                                        "time": "6 April, 2022",
                                        "context": "Remember mass is like a battery for energy.  When the energy was in its pure form it could be compressed to be very very small.   It may have come from another place all together.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "SagittariusA*",
        "time": "20 March, 2022",
        "context": "Thank you for not being Julia Musto and allowing comments on a science article. I wish Fox would fire Musto. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "wingoodday",
        "time": "19 March, 2022",
        "context": "Very cool !  Go Packers! ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "egagrickneprac",
        "time": "21 March, 2022",
        "context": "What's out there in space leaves me speechless.",
        "good": "3",
        "bad": "0",
        "replies": [
            {
                "user_name": "dan5047628",
                "time": "21 March, 2022",
                "context": "No doubt about that. Its amazing what God can do.",
                "good": "4",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "egagrickneprac",
                        "time": "21 March, 2022",
                        "context": "Yes, for sure!",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "dan5047628",
        "time": "21 March, 2022",
        "context": "So finally we get to comment on an article. \nThis one is about a photo of thousands of Galaxy's. \nSo where is the picture?? \n\nI see why they stopped letting us comment on most science articles. its to easy for the common man to poke holes in their science.",
        "good": "2",
        "bad": "1",
        "replies": [
            {
                "user_name": "dan5047628",
                "time": "21 March, 2022",
                "context": "Thumbs down??? Did I miss the photo???",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "error": "error"
                    }
                ]
            }
        ]
    },
    {
        "user_name": "dan5047628",
        "time": "24 March, 2022",
        "context": "Looks like they are planning to waste more money on the other Dead Rock, the Moon. \nBuilding a space station that orbits the moon to make it easier for moon landings. I was reading the other day that they are trying to figure out how to keep the current space station in orbit with all thats going on with the Russians. Its my position we need every penny right now for the military. That 24 billion dollar NASA budget will come in handy before long. We have no choice but to stop the Russian invasion of Europe at some point. If we wait 2 years like we did in WW2 in will cost a lot more America lives to stop them.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "nepawoods",
                "time": "24 March, 2022",
                "context": "If Putin doesn't resort to the use of nuclear weapons, we can easily put a stop to his aggression without straining our military budget.\nIf Putin does resort to using nuclear weapons, no amount of military spending is going to help.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "dan5047628",
                        "time": "24 March, 2022",
                        "context": "I agree on the nuclear comment but only a ground war will stop him. He knew the sanctions were coming and obviously isn't afraid of them. However we can never have a big enough Military. Regan's huge military is what Broke the USSR trying to keep up",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "vinny1021",
                                "time": "6 April, 2022",
                                "context": "It looks like it is still broken.",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "firstnlast",
        "time": "18 March, 2022",
        "context": "it must be frustrating to design something that takes decades to actually build and deploy.. many of the technologies available at the time of design are obsolete by the time the product is completed..",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "TheDemocratsAreDumAndThereDistroyingAreCountry!",
        "time": "23 March, 2022",
        "context": "there is no image from JWST in this article. a hubble image, a picture of hubble, a rendering of JW, and a pic of an old guy looking at a computer....\nthx fox",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dan5047628",
        "time": "22 March, 2022",
        "context": "\"The first \"science\" images won’t come until late June or early July.\"\nI missed this comment on the first read. \nSo I was right below it will take them many months to Photoshop a picture they want us to believe is real.",
        "good": "1",
        "bad": "1",
        "replies": [
            {
                "user_name": "nepawoods",
                "time": "23 March, 2022",
                "context": "All the scientists around the world who are in on this ... How do they keep them sworn to secrecy about this incredible conspiracy?",
                "good": "1",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "dan5047628",
                        "time": "23 March, 2022",
                        "context": "Same group that supports evolution. There is no secret, We watch the documentaries of the opposition that exposes these Lies. You should too.\nJust happens that most scientists are Atheists. Atheist have no problem with Lying as you well know.\nIf you have No God there is No reason for Morals. And yes I know you have your OWN morals. But Lying isn't included in that obviously. \nSomething we all learn by watching shows like CNN the History channel, etc. \nYou tell the same Lie long enough like Russian Collusion, Evolution and Climate Change and most people will start to believe it.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "nepawoods",
                                "time": "24 March, 2022",
                                "context": "You're the only one lying here.  Where is your evidence that they will \"Photoshop a picture they want us to believe is real\"?\n\n\"If you have No God there is No reason for Morals\" ... So you believe the only reason to do what's right is to be rewarded and to avoid punishment?",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            }
        ]
    }
]