[
    {
        "user_name": "StupidPeople101",
        "time": "14 May, 2019",
        "context": "Didn't we already see this movie?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Watchman",
        "time": "14 May, 2019",
        "context": "The Saudis fund Wahhabi Islam which is so dangerous.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "B9dKitty",
        "time": "14 May, 2019",
        "context": "Just so you people get know THIS is what all that OBAMA money was used to buy. A C130 full of cash, direct to Iran, to buy big ticket items like drones you see here, for otherwise destitute militants.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "youwillobey",
        "time": "14 May, 2019",
        "context": "Yemen is just an anagram for Enemy.  It can't be that simple can it?",
        "good": "13",
        "bad": "0",
        "replies": [
            {
                "user_name": "bigfishlittlepond",
                "time": "14 May, 2019",
                "context": "'fraid so",
                "good": "4",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "OliveGlasses",
                "time": "14 May, 2019",
                "context": "Hmmm, very true.",
                "good": "3",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "mitzyarr",
                "time": "14 May, 2019",
                "context": "Can i maybe just do your laundry or something sometime? Strong work sir",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "error": "error"
    },
    {
        "user_name": "chevyman1200",
        "time": "14 May, 2019",
        "context": "This is why development of our own sources of oil is so important. We are now energy independent and don't need any from the Middle East. I grew up in the 70's and remember well sitting in the car in line to buy what little gas was available because OPEC decided to shut off the tap to the US. Democrat Jimmy Carter was President and his policies allowed us to be held hostage by the Middle East oil producing nations because he refused to allow oil production here. In 1979 Iran's government was taken over by radical Islamist's and here we are 40 years later. Gas prices up temporarily 1.4%, so what, it could be and has been much worse. Thanks to President Trump we are in a good position to weather this type of problem.",
        "good": "25",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "olelonghair",
        "time": "14 May, 2019",
        "context": "the war of words ---- articles like this should be held accountable for spreading lies fake stories an exaggerations-----sue the press",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "RedRadio",
        "time": "14 May, 2019",
        "context": "Going out today to fill up the gas tank.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "72069",
        "time": "14 May, 2019",
        "context": "Got to be careful of trusting the Saudi's.  They could easily see an opportunity to rid themselves of Iran at our expense.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Watchman",
        "time": "14 May, 2019",
        "context": "America is the leader in oil production I thought.\nWhy do we still buy oil from Saudi Arabia or anywhere?",
        "good": "7",
        "bad": "0",
        "replies": [
            {
                "user_name": "trollhunterdee",
                "time": "15 May, 2019",
                "context": "Oil is a commodity. The price of commodities are based on global supply on hand vs demand. I hope that helps.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "skyeassociation",
        "time": "14 May, 2019",
        "context": "Be nice to see our European friends be a little more proactive to protect the oil they depend on. Maybe add Egypt who has a large ground army that would be helpful with the Yemen problem.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dakawan",
        "time": "14 May, 2019",
        "context": "Didn't Iran say it wouldn't negotiate, I swear they said that last week. Really they just want to hold the world hostage and get piles of cash.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "observer48",
        "time": "14 May, 2019",
        "context": "I would not make a good politician, because every now and then I really want to unleash the full, unrestrained power of the U.S. military. I can't of a better candidate for that than Iran.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Planetfox",
        "time": "14 May, 2019",
        "context": "This will continue until somebody lays the hammer down on Iran.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "GoldSubmarine",
        "time": "15 May, 2019",
        "context": "Not a single report on Fox about the Saudi government’s ongoing atrocities in Yemen, but they report on this attack as if it came out of nowhere, unprovoked. Why is Fox shilling for the Saudi dictatorship?",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "turbochargeddad649",
                "time": "15 May, 2019",
                "context": "What \"activities\" might those be?",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "GoldSubmarine",
                        "time": "15 May, 2019",
                        "context": "I said atrocities, not activities.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "turbochargeddad649",
                                "time": "18 May, 2019",
                                "context": "OK, so please do share.  What are these \"atrocities\" you're speaking to?",
                                "good": "0",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "GoldSubmarine",
                                        "time": "18 May, 2019",
                                        "context": "I'm sorry, do you not know how to use Google? I'll sum them up for you. Let's leave aside the literal butchering of a dissident journalist on the crown prince's order. In Yemen, the Saudis have deliberately bombed for supplies; their strategy is to starve the enemy (here, the whole Yemeni people, down to the last baby) into submission. There is now a famine in Yemen that is killing thousands, and it was a direct and intended result of these bombings. It is unspeakably cruel and barbaric.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "trollhunterdee",
                "time": "15 May, 2019",
                "context": "I guess you are not capable of retaining information. The war between Iran's proxy and Saudi Arabia is old news and it has been reported on many occasions.  Life must suck with the attention span of a goldfish.",
                "good": "1",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "GoldSubmarine",
                        "time": "15 May, 2019",
                        "context": "Starving Yemeni kids are Iran's proxy? The Saudi operation in Yemen isn't punishing the Houthis. It's brutalizing the Yemeni people. The worst humanitarian crisis in the world right now.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "willwemakeit",
        "time": "15 May, 2019",
        "context": "Where do you think Yemen Houthi rebels got a drone?  Yemen isn't necessarily known for it's great hi tech drone design and manufactiring indusrty.  And flying military drones require extensive training and ground support operations.\nIran, folks.  It's Iran behind all of this.  \nIran keeps \"hiring\" mercenary terrorist groups to do it's bidding.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "turbochargeddad649",
        "time": "15 May, 2019",
        "context": "Dear @Donald Trump :  This is clearly an attempt by outside forces to cause problems for U.S. economics.  Probably others too.  Please... Ummm.. Squash them?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "LeroyBojangle",
        "time": "15 May, 2019",
        "context": "If we don't give Iran everything they want, they'll continue to do what they never stopped doing in the first place; enriching uranium.  Gotta say, Kerry and Obama would have found that to be a compelling argument.",
        "good": "2",
        "bad": "0",
        "replies": []
    }
]