[
    {
        "user_name": "PacksonAtlantic",
        "time": "20 September, 2019",
        "context": "The OLD , and venerable US Phalanx CIWS System could have easily destroyed ALL incoming Iranian Drones & Missiles.\n\n(had the Saudis deployed it in the first place.!)\n...",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "zambifreaker",
        "time": "20 September, 2019",
        "context": "So these multiple Patriot anti missle systems that Saudis paid $1B for each system couldn’t stop 18 drones? You can’t be serious",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "666Joey",
        "time": "20 September, 2019",
        "context": "This was against the saudies .... not us .... their problem ... they got lots of bucks ... let iran destroy their oil ... no oil - no money - one less problem .....",
        "good": "7",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "jossefperl",
        "time": "20 September, 2019",
        "context": "Nothing short of a limited military strike that will humiliate the Iranian regime in the eyes of its people and its allies in the Middle East, will get Iran to stop escalating its violence.  Iran is threatening an all-out war if the US takes a military action, in order to preempt such action. Iran WILL NOT respond to a limited military action with an all-out war with the US, just like it has not responded with an all-out war against the continuing Israeli airstrikes against Iranian forces and facilities in Syria and Iraq.",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ByeDon20",
        "time": "20 September, 2019",
        "context": "So remind me again, What is Trump trying to negotiate from Iran? Or is this just a nonstop train to war?",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "Rgib2",
        "time": "20 September, 2019",
        "context": "Perhaps some sort of covert action should be take by the Saudis.",
        "good": "8",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "JP20004U",
        "time": "20 September, 2019",
        "context": "Step away....SA we haven’t forgotten 9/11",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "MyBich",
        "time": "20 September, 2019",
        "context": "Looks like Saudi A needs to buy our Patriot missle defense system, or some other appropriate system. \nWe are capable of and should have been watching that entire area. Now we know why they shot down one of our watcher drones..",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "Messiahfan",
        "time": "20 September, 2019",
        "context": "Yet, Dems want us to believe Houthi rebels were capable of that attack. Even if they came from Houthi territory, which they didn’t, best believe they were Iranian bought,paid for,developed and were operated by Iranians standing there next to their sanctioned rebels. BTW, waiting for Trump to confirm that Pakistan was harboring Bin Laden Jr! It will be in the name of sanctions or cancellation of aid.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "morlock1000",
        "time": "20 September, 2019",
        "context": "The expert is incorrect in saying the attack could not have been stopped. If you eliminate a potential aggressor’s ability to attack then the attack would never have occurred in the first place. Take away Iran’s toys and they can’t launch attacks across the straights of Hormuz.",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mrclinthanrahan",
        "time": "20 September, 2019",
        "context": "I have  far more confidence in President Trump to handle this situation than any of the pandering Democrats running for his office.",
        "good": "66",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "alsodeplorable",
        "time": "20 September, 2019",
        "context": "Trinitite.....",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "voodkokk476",
        "time": "20 September, 2019",
        "context": "Sounds like a dem written article - we can't whay whay whay stop them",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "OliveFish",
        "time": "20 September, 2019",
        "context": "Go for their throats",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "WildCatConservative",
        "time": "20 September, 2019",
        "context": "Israel defends itself pretty well against these attacks!",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jax23",
        "time": "20 September, 2019",
        "context": "Preventing such an attack these days would depend on letting your enemy know that certain retaliation would be very costly to them.",
        "good": "35",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "NickMulgrave",
        "time": "20 September, 2019",
        "context": "If the Saudi's spent less time building the worlds tallest towers and buying diamond encrusted Lamborghini's they would be in a better position to defend themselves.\nTheir disastrous invasion of Yemen and the humanitarian disaster they created is now coming back to bite them.\nIf they can't even defeat Yemen, what hope do they have against Iran?\nThe Saudi's are reaping what they have sown.\nTrump should now show the good sense to not risk American lives to protect a medieval monarchy that sponsored the 9/11 hijackers or to risk any American lives to secure the oil supplies for Saudi Arabia's largest trading partner China.\nTime we invest in alternate energy technologies, secure our borders and let the Middle East burn itself to the ground.",
        "good": "16",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "angryinny",
        "time": "20 September, 2019",
        "context": "This story is just baiting Iran to do more.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "usamaga724",
        "time": "20 September, 2019",
        "context": "I wouldn't be poking the sleeping giant in the eye. Just saying!!",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "phase",
        "time": "20 September, 2019",
        "context": "I just hope that when the destruction of Iran starts it will be total and fast.",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "LyenTed",
        "time": "20 September, 2019",
        "context": "Apparently $500 billion in US weapons don’t do squat. Now the tax payers will be footing the bill to fight Iran for the Saudis",
        "good": "3",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "thegivens",
        "time": "20 September, 2019",
        "context": "Well that just changes everything.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "angryinny",
        "time": "20 September, 2019",
        "context": "B-52s & carpet bombing.  That'll clear the sand.",
        "good": "12",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "HarryMybalzich",
        "time": "20 September, 2019",
        "context": "That's why it's important to send a strong message after, not just sit on your hands and wait for the next one.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "OrangeFlask",
        "time": "20 September, 2019",
        "context": "Looks like Saudi needs to fight fire with fire.",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "🇺🇸🍻Noway78🍻🇺🇸",
        "time": "20 September, 2019",
        "context": "Pearl Harbor with no casualties....lol",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "cphh16b",
        "time": "20 September, 2019",
        "context": "if this is true than the only possible solution for this situation ongoing is to slap the perportrators so hard that they would be left without the will or resources to do such a thing again and at the same time it would put anyone else who was even thinking about it on notice. we could rename iran to icrawled.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "lumenpraetorius",
        "time": "20 September, 2019",
        "context": "Very interesting.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tristanbal885",
        "time": "20 September, 2019",
        "context": "\"All out war\" would be over in 15 minutes with Iran reduced to a 19th century camel culture.  However, there are many good people in Iran, as well as an active opposition that will overthrow the current regime within 5-10 years.  Maybe we don't want to send them back 200 years immediately.  Much as I like Bolton's suggestions, ,perhaps there's a more effective answer.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "howdydam1t",
        "time": "20 September, 2019",
        "context": "What I found strange about the attack is that a lot of those model airplanes shown to the public survived better than the ones I used to fly for fun. A little glue and a new propeller  and they could fly again. Not what you would expect if they crashed into a steel container  with explosives attached or even without. Most of mine that took a year or so to build  were completely destroyed when they hit the ground by accident.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "NicKnack",
        "time": "20 September, 2019",
        "context": "US government is clearly wasting its money on defense.\nSpending masses on old-style weapons and 'boots on the ground'.",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "markscottduchar494",
        "time": "20 September, 2019",
        "context": "An expert on the NY times.  I hear our stealth bombers are a bit hard to stop too.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "JusticeRules5",
        "time": "20 September, 2019",
        "context": "Saudi Arabia IS NOT a good ally and they need to be defending their own country. \n\nSaudi Arabia would not lift a finger for us if we were the ones attacked, you can count on that.",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "podtrek202",
        "time": "20 September, 2019",
        "context": "Liberals must be confused. They love Islamists but hate oil.",
        "good": "12",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "nevski",
        "time": "20 September, 2019",
        "context": "\"Saudis defended themselves....\"  How???\n\nThe Saudi royal family could not even defend the Grand Mosque in Mecca when the religious shrine was seized by Jihadi terrorists in 1979.  They had to beg France to send in special forces to liberate the shrine - their own troops ran away. During seizure the Saudi royal family was deceiving the world with stories that the Mosque really had not been seized. Just like they are deceiving the world now with stories that the attack on their petroleum facilities.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "¯\\_(ツ)_/¯`",
        "time": "20 September, 2019",
        "context": "Stood up to the attack? What? Every drone hit its target.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Fire999",
        "time": "20 September, 2019",
        "context": "Just a note to Iran and the Quad. We don't as a rule start wars but we do end them. Keep it up and you will poke the Eagle one too many times.",
        "good": "14",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "TrumpsMarvelousBrain",
        "time": "20 September, 2019",
        "context": "Soon our beloved POTUS will be awake,  going bonkers on Twitter, and dazzling the world with his stable genius. Hold on to your MAGA hats!!",
        "good": "6",
        "bad": "7",
        "replies": []
    },
    {
        "user_name": "kurtisgaskin048",
        "time": "20 September, 2019",
        "context": "new fear\nthe unstoppable drone attacks\nthey are silent deadly and comeouta nowhere\nlike bird flu, sars, anthrax, terrorism, etc.\nscared yet?\noh and the economy, Trump will get us into war instantly...etc",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "robertkearney45",
        "time": "20 September, 2019",
        "context": "It is a problem that needs a solution fast!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "beauwulf",
        "time": "20 September, 2019",
        "context": "Guess they never heard of the Aegis system... It can be done!",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "podtrek202",
        "time": "20 September, 2019",
        "context": "Liberals and Iranians would like us to think that Yemeni rebels are capable of building and launching a drone.",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "assiduity",
        "time": "20 September, 2019",
        "context": "Iran attacking Saudi Arabia already expanded the war in the Middle East.\n\nIf, U.S. goes against Iran.  The same thing will happen to Iran as it did in Iraq.  Then there will be another nation in the Middle East free of a tyrannical government.\n\nIf, U.S. goes.  Don't invite them in like G.W. Bush and B.H. Obama did.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "SherlockBulldog",
        "time": "20 September, 2019",
        "context": "Blame Obama sending that pallet of cash.",
        "good": "14",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "johnhull",
        "time": "20 September, 2019",
        "context": "The drones are off Ebay.  The cruise missile exploded like a firecracker.  Thing is, high explosives don't leave neat pieces and halves.   And it only takes a little for a refinery to go up.  The whole thing is no smoking.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "atheist_conservative",
        "time": "20 September, 2019",
        "context": "Thanks Obama.",
        "good": "54",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "PurpleBone",
        "time": "20 September, 2019",
        "context": "odd those terrorist hate Americans but love our technology, drones, cell phones, air conditioning, motor vehicles, firearms, explosives, TV, medicine.....",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "YWORE",
        "time": "20 September, 2019",
        "context": "In 1939 most people in this country did not want to get involved in World War 2, because of the cost in the lives of those who died and survived the horrors of World War 1.  We were dragged into the War maybe not kicking and screaming but out of the realization that we were next.  Only time will tell what will happen, but in 1936, Europe handed Hitler Europe for peace in our time.  Only to find out he wanted it in pieces so he could have it for the Nationalist SOCIALIST Workers Party Of Germany to plunder at will.",
        "good": "13",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "MeOneGoodEye🏴‍☠️",
        "time": "20 September, 2019",
        "context": "We could send our \"most secret advanced weapon\" to infiltrate their government and take them down from inside.\nIf you were thinking what is our \"most secret advanced weapon\"? And you thought \"The Squad\" then you are correct.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rrogerthat",
        "time": "20 September, 2019",
        "context": "Let the Saudis and the Iranians fight it out amongst themselves. They can go hand in hand to “72 virgin land”.",
        "good": "13",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "shovl",
        "time": "20 September, 2019",
        "context": "True, no country can defend every type of target within its borders. There are just too many installations that can be attacked at any time. That said, many countries, and especially the USA, can retaliate in such a way, that if you anger them enough, can literally wipe the aggressor off the face of the planet.",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "OliveBottle",
        "time": "20 September, 2019",
        "context": "If this is described as a Pearl Harbor type of attack then there should be a Pearl Harbor type of response. That will end this nonsense fairly quickly.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ErnestJones",
        "time": "20 September, 2019",
        "context": "You didn't build that, Obama built that",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Textuff",
        "time": "20 September, 2019",
        "context": "For now the only defense against these type attacks using drones, is to have in place a system that can immediately identify and eliminate the location/s from where the attack/s were launched.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "NicKnack",
        "time": "20 September, 2019",
        "context": "After the Iraq war, the Iran war.\n\nIran = Iraq x 10\n\nHow many invalids is that?",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "NicKnack",
        "time": "20 September, 2019",
        "context": "With North Korea being already our best friend after Russia, maybe we should become best friend of Iran too?\nIn the meantime, we're losing the support of Germany and France. But freedom and democracy are old fashioned and useless. Autocracry and dictatorship, that's where the future is.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "nevski",
        "time": "20 September, 2019",
        "context": "The Saudis should have bought the Russian defensive systems as the Iranians (S-300) and Turks (S-400) did.\n\nThe spin is now on to save the reputation of our military contractors who peddle the worthless Patriot systems all over the world.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "fraudbandcash",
        "time": "20 September, 2019",
        "context": "Israel better start deploying RF tech along their borders, you can bet they will be the next target",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ringo123456789284",
        "time": "20 September, 2019",
        "context": "And who paid for the sophisticated missiles? Who gave Iran all that money? I think we all know.",
        "good": "15",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "johnhull",
        "time": "20 September, 2019",
        "context": "Those missiles are spot welded together with flanges.  This is not high quality construction.  And high explosives don't leave neat halves.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "BlueLamp",
        "time": "20 September, 2019",
        "context": "Eighteen drones and seven cruise missiles bombarded the facilities? 25 aerial weapon devices were sent from someplace. Pompeo very quickly said it was Iran. When 25 missiles and drones are fired the US Military satellite system should have immediately detected them. I wonder why no warning was given to the Saudis?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jgg1974",
        "time": "20 September, 2019",
        "context": "Trump is da man! That attack did nothing to us at all...let them all destroy each other ...who cares !",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "PurpleBone",
        "time": "20 September, 2019",
        "context": "if not for American ingenuity and dollars those terrorist would still be riding camels and living in tents!",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Billbrasky174",
        "time": "20 September, 2019",
        "context": "Stop defending, time to offend",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "TPin2020",
        "time": "20 September, 2019",
        "context": "Thanks Obama and Biden for giving Iran all that cash. You both should be ashamed of yourselves.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "PapaSmoke",
        "time": "20 September, 2019",
        "context": "Build That Net!!!",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "MD2021",
        "time": "20 September, 2019",
        "context": "So Fox is going to pretend Giuliani wasn’t UNHINGED on CNN last night and that he didn’t confirm the whistle blower.  That he didn’t ask the Ukrainian Government to give him information on Joe Biden and that the Trump Administration sent an unexpected \n250 million to Ukraine this week...Giuliani confirmed all of this last night!!",
        "good": "1",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "DavidVan",
        "time": "20 September, 2019",
        "context": "Time for Boeing to start working late nights.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Great🇺🇸Since’76",
        "time": "20 September, 2019",
        "context": "Get some of that new fangled sub-millimeter radio detection and ranging gear... Neat stuff!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "whynotlove",
        "time": "20 September, 2019",
        "context": "We need to protect our electrical grid.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Nothingnewunderthesun777m",
        "time": "20 September, 2019",
        "context": "It's easy to get in a war but difficult to get out of one.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "johnhull",
        "time": "20 September, 2019",
        "context": "This makes two false flag operations in a few months.  How many more before something happens?  It will be odd to see Trump golfing on his bone spurs while texting he's triggering the draft.",
        "good": "0",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "LibLieDetector",
        "time": "20 September, 2019",
        "context": "\"Iran has a fleet.\"\nI guess that's where some of Bammy's planeloads of money went.",
        "good": "7",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "FlatEarthMember",
        "time": "20 September, 2019",
        "context": "The Saudis have their own military... let them deal with it. \nIf Iran attacks America directly with drones... then we'll have to turn Iran into a parking lot.\nI am sure Trump will find a way... other than war...to deal with this.",
        "good": "8",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "jacklaw1221",
        "time": "20 September, 2019",
        "context": "Now you know what they did with the 1.5 billion Obama sent them. Shameful.",
        "good": "14",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "cobra129984",
        "time": "20 September, 2019",
        "context": "Democrats, thanks to Jimmy Carter, are heavily invested in support for Iran.  Even Tulsi Gabbard, a now defunct Democrat Presidential candidate, is having a love fest with Syrian Dictator Assad and the Mullah's in Iran.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "fixgovnow",
        "time": "20 September, 2019",
        "context": "Everybody waits on the US taxpayer to come to their rescue, the lazy wait for hand outs, the poor in third world countries want the freebies, and even rich countries like Saudi Arabia want us to fo fight the bully that pushes them around.  Trump needs to tell Saudi either fight your own fights.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Fazaloo",
        "time": "20 September, 2019",
        "context": "We should nuke all of these   country's that pose a threat to the US or it's interests",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tristanbal885",
        "time": "20 September, 2019",
        "context": "On second thought, maybe we should do as we did in Iraq - send in our stealth bombers and our cruise missiles some night, destroy their air force, destroy their nuclear program and take out about half of their military strength.  We don't need an invasion and this incision will have the leadership working on clean up and we won't hear from them for a decade.  By then, opposition forces will have taken over the government.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "web3",
        "time": "20 September, 2019",
        "context": "Sounds like it's time for the Saudi's to install a Phalanx CIWS system to protect their oil fields. It works well in defending our carriers.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "johnhull",
        "time": "20 September, 2019",
        "context": "And those drones are toys probably made in China.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "magicvote",
        "time": "20 September, 2019",
        "context": "Iran has to learn those \"cash for peace\" days were over since 2017.",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "BW1021",
        "time": "20 September, 2019",
        "context": "Obama gave them the money to build these drones.",
        "good": "7",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "NicKnack",
        "time": "20 September, 2019",
        "context": "Putin ultimately provides the technology.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "NicKnack",
        "time": "20 September, 2019",
        "context": "The US is getting *so* outplayed by Russia and China.\n\nSyria, baltic states (where Russia is penetrating like in Ukraine), Iran by Russia. Even Israel counts Russia among its close friends.\n\nAnd China is taking over the East, Africa, and Latin America. The Pacific is turning from Taiwan-US allies to China allies.\n\nAnd in the meantime, Trump is wasting his time on North Korea ...",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "Fishforever",
        "time": "20 September, 2019",
        "context": "Let the Saudis handle it!!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "howdydam1t",
        "time": "20 September, 2019",
        "context": "Back before the drone days. I wanted to start a model airplane club where people could fly their models over long distances from one airfield to another without user control and only use the radio at the take off and your team on the other end taking control  fifty to a hundred miles later for landing. Needless to say the FAA didn't approve. Now we have this!",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "Kwisatz_Haderach",
        "time": "20 September, 2019",
        "context": "Now lets hear from our comments section tactical analysis team.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "OrangeSubmarine",
        "time": "20 September, 2019",
        "context": "We should all be concerned this technology exists. It was inevitable unfortunately but we now live in a time where any government anywhere can threaten their people with nothing more than a joystick.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "josephus",
        "time": "20 September, 2019",
        "context": "Their analysis ignores the recent success of the Navy in defeating a drone through jamming. While that is the easiest and most public way of doing it, it is doubtful that it is the only way. It seems they are at least 10 years behind current technology in their assessment and maybe more if you factor in what the military capability that has not been revealed yet.\n\nGood scare-mongering, though.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ringo123456789284",
        "time": "20 September, 2019",
        "context": "Saudis need to declare the \"red line\" was crossed?  Will they?",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jgg1974",
        "time": "20 September, 2019",
        "context": "Government and there politics .... all trying to be the toughest guy on the block ...so childish",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "CapnBoneSpurs418",
        "time": "20 September, 2019",
        "context": "Trump was locked and loaded to hit the golf course this week.",
        "good": "3",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "johnhull",
        "time": "20 September, 2019",
        "context": "When the guys on your side are calling for nuking everyone.....  some people would pause.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "jacklaw1221",
        "time": "20 September, 2019",
        "context": "Let the Saudi's defend themselves or parish.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "MeanwhileOnATexasFarm",
        "time": "20 September, 2019",
        "context": "Let Israel do it, they can do it in 5 mins....it takes us DECADES.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "lawyer2",
        "time": "20 September, 2019",
        "context": "Saudi Arabia has the money and resources to defend itself.  Let Saudi Arabia spend its money to defend itself and its assets.  The U. S. no long needs to police other countries' problems.  If the Saudis need weapons and personnel, let them PAY for U. S. weapons and volunteer personnel...and pay any volunteer personnel WELL.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jacklaw1221",
        "time": "20 September, 2019",
        "context": "Never lose sight of the fact that most of the 911 attackers were Saudi's.",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "WarIsDeception",
        "time": "20 September, 2019",
        "context": "Every kind of asymmetric attack is nearly impossible to defend against unless there is a security force onsite and ready for it... Something as basic as a van targeting pedestrians is impossible to stop without measures in place. \n\nMost air defense systems are turned off until the threat is either detected or known about in advance. It keeps the defense system hidden/protected from being targeted",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cobra129984",
        "time": "20 September, 2019",
        "context": "This should be a major EU concern since they're so dependent on Mideast oil.  Germany and France are a joke and are now beholding to Islamic states like Iran & Syria.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "lift8686",
        "time": "20 September, 2019",
        "context": "Trump is now going to build a death star.",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "OliveBattery",
        "time": "20 September, 2019",
        "context": "Laser net mapping",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "en0ughn0w",
        "time": "20 September, 2019",
        "context": "----Hard to build rockets, when manufacturing plants, government buildings, and crops are obliterated.",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "danieljm",
        "time": "20 September, 2019",
        "context": "There was once a giant who could not be stopped by any armed soldier or weapon of war. But a young man with a sling shot took him out.",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "treadwhereiwant",
        "time": "20 September, 2019",
        "context": "Iran knows it has a free hand with a weak and submissive Trump.  Probably got the missiles from Kim Jong after Trump kissed him.",
        "good": "0",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "OliveBottle",
        "time": "20 September, 2019",
        "context": "A Pearl Harbor attack needs a Pearl Harbor response.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "NicKnack",
        "time": "20 September, 2019",
        "context": "We're getting booted out of Afghanistan, Syria, and Africa.\nPutin and Xi are chuckling.\n\nWhat a waste of money, the military.",
        "good": "0",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "cobra129984",
        "time": "20 September, 2019",
        "context": "Its feels great to be energy independent....thank you President Trump",
        "good": "13",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "NicKnack",
        "time": "20 September, 2019",
        "context": "US army is totally useless for the wars of tomorrow. Tanks and boots. Useful to give parades or occupy Washington DC and Houston, but useful to fight the real enemy.",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "jgg1974",
        "time": "20 September, 2019",
        "context": "Why do we even have countries ? We’re all earthlings...it’s such a concept to control the masses",
        "good": "1",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "PurpleScissors",
        "time": "20 September, 2019",
        "context": "With regard to handsomely arming Iran for the next decade I want to give a big shout out to former President Obama.",
        "good": "14",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "johnhull",
        "time": "20 September, 2019",
        "context": "It's on youtube.  It's not some great secret.  Drone tech is getting big.  Human flight even.  The RC stunt helicopters are scary in that they maneuver like a hummingbird.  It really does change speed and direction like a bouncing ball.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ClarkGriswoldII",
        "time": "20 September, 2019",
        "context": "Looks like we are entering the Terminator era.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "johnhull",
        "time": "20 September, 2019",
        "context": "Look up on youtube \"WORLD CHAMPION RC Helicopter pilot Demonstrates his Awesome Skills",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "PhineasT.Phreakears",
        "time": "20 September, 2019",
        "context": "Read between the lines and what this is saying is that our country is no longer safe.  Who's to say these couldn't be launched from within our own country by terrorists (of any denomination, not just religious extremists).",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "derangedspaniard",
        "time": "20 September, 2019",
        "context": "Until there is loss of American life, this is Saudi Arabia's problem and not ours.  It's one thing for America to help defend an ally, and something totally different for America to engage an ally's enemy.",
        "good": "8",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "hoosierlib",
        "time": "20 September, 2019",
        "context": "Not content to just destroy America, now Donnie Bone Spurs (aka The Chosen One as his followers call him) seeks to destroy the entire world.",
        "good": "0",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "TempusEdaxRerum",
        "time": "20 September, 2019",
        "context": "The U.S. has been using drones for years, so it puzzles me as to why the U.S. would be so far behind in the defense against drones.  Once drones are used as weapons, and the U.S. has been using them as weapons against terrorists, it should be obvious that a drone defense is the next logical step.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sidehustle88",
        "time": "20 September, 2019",
        "context": "Thanks Obama.",
        "good": "16",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "sidehustle88",
        "time": "20 September, 2019",
        "context": "I wonder where Iran got all the money for those drones?",
        "good": "12",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Rolltide1776",
        "time": "20 September, 2019",
        "context": "I wonder where Iran got the money to modernize it's military?  Hey didn't Obama give them 150 billion dollars? Hey didn't Obama let them build nuclear centrifuges? I guess a logical person could say Obama had a hand in Iran's military build up.",
        "good": "32",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "GoldBeer",
        "time": "20 September, 2019",
        "context": "Just make the response overwhelming and devastating...",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mercenary76",
        "time": "20 September, 2019",
        "context": "seems reasonable to make areas of iran into glassy parking lots . no need for air defense against iranian vehicles then .",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Cmforhumanity",
        "time": "20 September, 2019",
        "context": "A large donation from Iran to the houthi rebels for taking responsibility is plausible.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "smartthink",
        "time": "20 September, 2019",
        "context": "We certainly do work hard to find new ways to kill each other don't we.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "hamburgler4005",
        "time": "20 September, 2019",
        "context": "if it wasnt for lack of internet security by the us military. the only people that would have drones is the usa. a drone war is coming . and with the internet , dont expect our drones to be any better then anyone elses.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jacklaw1221",
        "time": "20 September, 2019",
        "context": "If not for President Trump we would be looking at $5-$6 gas prices. Remember that every time you stop at the pump.",
        "good": "11",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "PurpleBone",
        "time": "20 September, 2019",
        "context": "Decades ago liberals (Democrats) schemed to raise oil prices high percentages to enrichen the middle east, to have a more globalized economy, to share wealth, bring it up to western standards, educate their poor........mission accomplished!",
        "good": "3",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "Hearingya",
        "time": "20 September, 2019",
        "context": "This is why energy independence is so important.  Instead of going to war, it would make more sense to focus on destabilizing the middle east by removing their funding source.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jjcoolbreeze1548",
        "time": "20 September, 2019",
        "context": "Do you know what is proficient in defending against drone attacks Iran?  The EMP that follows the mushroom cloud over Tehran.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "who'son1st",
        "time": "20 September, 2019",
        "context": "Looks like the military is going to have to up their reverse engineering efforts of all that alien tech they have out at Area 51...",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jaquas",
        "time": "20 September, 2019",
        "context": "Experts....LOL    If we can shoot down a missile we can shoot down drones.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "lewiscopy",
        "time": "20 September, 2019",
        "context": "When the president pulled out of the Iran deal, who could have anticipated payback?\n\nApparently not the superhero of the undereducated,The Orange Revenger.\n\nIronic.",
        "good": "1",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "LawrenceoftheRight",
        "time": "20 September, 2019",
        "context": "With all the money we spend on defense if we can't show a track these drones and cruise missiles flew in on we should be ashamed. Cruise missile tech has been around for decades and we know it is a threat. Spending billions on a plane that can be shot down by a 1 million dollar missile is crazy not to mention 13 billion on an aircraft carrier that would last maybe an hour in a conflict with our big two adversaries.",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "johnhull",
        "time": "20 September, 2019",
        "context": "Oil refineries are no smoking areas for a reason.  It doesn't take a cruise missile.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "PapaSmoke",
        "time": "20 September, 2019",
        "context": "Iran is able to shoot down drones but we cant?",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "ThoughtfulVoter",
        "time": "20 September, 2019",
        "context": "This is a problem....",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "NicKnack",
        "time": "20 September, 2019",
        "context": "Trump is taking orders from Saudi Arabia.\n\nWhy else can't he decide before asking them what he should do?",
        "good": "1",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "digitalfutur",
        "time": "20 September, 2019",
        "context": "Trump the paper tiger.  Iran learned from the drone downing that an isolationist Trump wouldn't take any military action against them, and the subsequent attack on the Saudi oil refineries is a direct result.",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "ptbot01042",
        "time": "20 September, 2019",
        "context": "Drones aren't any different from missiles really. In fact they are slower, and most likely can't even carry as much explosive as missiles. Anyway it's not the tech that is unstoppable, it's the current politics that either allow or disallow retaliation.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "OliveFries",
        "time": "20 September, 2019",
        "context": "Obama made better decisions than Trump does.",
        "good": "2",
        "bad": "10",
        "replies": []
    },
    {
        "user_name": "darkheartbear.",
        "time": "20 September, 2019",
        "context": "Lol this can be easily stopped.  Take out every refinery in Iran      Message for the next group wanting to do this",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "NicKnack",
        "time": "20 September, 2019",
        "context": "Iran is a friend of Putin and Putin is a friend of Donald.\nClearly Iran is a friend of Donald. He just doesn't want to admit it yet.",
        "good": "0",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "fnhound",
        "time": "20 September, 2019",
        "context": "The best defense is to turn Iran into dust.",
        "good": "11",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "jacklaw1221",
        "time": "20 September, 2019",
        "context": "No one is talking about the fact that oil prices have remained stable because of President Trump's investment in US oil production. Imagine that.",
        "good": "12",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "ancient_of_days",
        "time": "20 September, 2019",
        "context": "We don't need Saudi oil. The US should leave this fight alone.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "markscottduchar494",
        "time": "20 September, 2019",
        "context": "The total lack of creativity or originality of these anti-Trump posts tells me that it's the bots not the Dims posting them. The Dims are a very delicate creative bunch.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "peprman",
        "time": "20 September, 2019",
        "context": "Socialist Dems. just might be collaborating with our enemies in a traitorous manner. That's how strong their hate is for our country..",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "krymedawg",
        "time": "20 September, 2019",
        "context": "Sounds like a job for the CIWiS i Time to build the drone army.....",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "jacklaw1221",
        "time": "20 September, 2019",
        "context": "Tell Saudi Arabia if they cut off the head the snake will die.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "DebbySeven",
        "time": "20 September, 2019",
        "context": "If that's the best defense that could be made against drones and missiles, we don't need to send U.S. troops to be sitting ducks.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "johnhull",
        "time": "20 September, 2019",
        "context": "High explosives do not leave neat and tidy easily recognizable pieces.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Ramets",
        "time": "20 September, 2019",
        "context": "Sure we can stop it! Destroy the source!!",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "GerryNoname",
        "time": "20 September, 2019",
        "context": "retaliate by sending them a few thosand liberals immigrants.",
        "good": "15",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "samiamgreeneggsandham",
        "time": "20 September, 2019",
        "context": "At least we have Space Force Command now !",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "right4US",
        "time": "20 September, 2019",
        "context": "then we need to bomb the facilities where they keep the Drones and Cruise missiles. Its that simple, but im sure they are hiding them.  Its time Mister President.  No more dealing...",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "azman158",
        "time": "20 September, 2019",
        "context": "Send out the micro drones to Iran",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "OIF-VET319",
        "time": "20 September, 2019",
        "context": "Obama would be sending over a plane load of cash an apology to the terrorists - AGAIN!",
        "good": "13",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "MiddleGrounder",
        "time": "20 September, 2019",
        "context": "This was Iran's last ditch Tet Offensive.  They used and lost almost all of their devices with that kind of range.  They look powerful for a moment and they are done.  All while denying culpability.  Last breath desperate attack.  Keep choking them slowly, they will fall apart from the inside soon.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "notmyneeds",
        "time": "20 September, 2019",
        "context": "Nobody cares. The US does not have a defense agreement with SA. Also strange that this so called drone attack blew up only easily replaceable targets. The repairs will be completed this month.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "lcharlie",
        "time": "20 September, 2019",
        "context": "That anti drone laser tech is not a full ten years out, that's just a conservative estimate in regards to how long it will take to have it rolled out on all of our warships and land based defenses since its not only already been deployed on a few of our ships but its success rate in live fire training drills is as close to perfect as it gets already.  I believe it was National Geographic that did a special on that technology where they were filmed using it on real drones in training exercises, which was pretty amazing to watch and was already achieving a perfect success rate in those drills aboard one of our destroyers.  That came out well over a year ago so I have to imagine they've made big advances since then, in the wake of these attacks id expect to see that tech begin to get rolled out at a much faster pace going forward.  \n\nAs far as attacking non-military targets such as these oil fields in this manner, they are right, we'd have no chance of even deploying the tools we do have in time to prevent it.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "johnhull",
        "time": "20 September, 2019",
        "context": "The drones are toys off ebay.  Nothing in this attack looks very high tech.  In fact it all looks hastily fabricated.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "CyanPumpkin",
        "time": "20 September, 2019",
        "context": "News not on Fox\nTrump told the Ukraine  he would withhold money from them unless they opened an investigation against Joe Biden's kid. The Ukraine did as Trump required and money was allowed to be sent. \n\nWhat does it take you guys to impeach him?",
        "good": "1",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "americangirl25",
        "time": "20 September, 2019",
        "context": "It was so nice of Obama to invest so much in Iran and so little in America. Right, libbys?",
        "good": "45",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Canadian_Con",
        "time": "20 September, 2019",
        "context": "Can't stop it but can annihilate the culprits.",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "odemoe",
        "time": "20 September, 2019",
        "context": "\"Attack on Saudi Arabia oil field would likely not have been stopped by any country: expert\"\n\n_______________\n\n.......exactly right. This is Sunni vs. Shia.....they have been fighting and killing each other for tens of thousands of years. And guess what: they will do so for the NEXT tens of thousand of years....Let them.....",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "theworldhasgonenuts",
        "time": "20 September, 2019",
        "context": "Who is this \"expert\"?  It's not a question of whether these attacks can be stopped, it's a question of whether we are willing to export the technology necessary.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "hamburgler4005",
        "time": "20 September, 2019",
        "context": "id be curious to know if when obama bissied up with iran , if he sold them any weapons are allowed american military contractors to do so",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "concernedConstitutionalist",
        "time": "20 September, 2019",
        "context": "lol, this cracks me up.  'Even the United States.'  LOL.  Oh how I beg to differ....",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Hearingya",
        "time": "20 September, 2019",
        "context": "Energy efficient vehicles would address most of this issue. We can begin the process of making oil obsolete.",
        "good": "4",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "notmyneeds",
        "time": "20 September, 2019",
        "context": "how many gay ops will they need to do so that the military complex gets its war?",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "BigWhiteGuy691",
        "time": "20 September, 2019",
        "context": "Indefensible????? WRONG!\n20 nukes on Iran, and watch the drones become a token of the past.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "OIF-VET319",
        "time": "20 September, 2019",
        "context": "This guy knows nothing of our militaries ability to counter drone strikes. I very much doubt we are sharing top secret defense systems with employees of a foreign military institute.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "MyFoxThoughts",
        "time": "20 September, 2019",
        "context": "Hindsoght is always 20-20, the expert's assessment was never reported before the attack. Now the reputation of the US is at stake and the whole world is watching.",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "Great🇺🇸Since’76",
        "time": "20 September, 2019",
        "context": "Oh...STUXNET II...STUXNET III... STUXNET IV... coming soon! 🤘🏻",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sidejoe3232",
        "time": "20 September, 2019",
        "context": "Fox is hiding the \"POTUS is an Extortionist\" story pretty well",
        "good": "2",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "ThoughtfulVoter",
        "time": "20 September, 2019",
        "context": "Iran put all those billions in the airplane to good use... Thanks Obama",
        "good": "15",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "neacemr",
        "time": "20 September, 2019",
        "context": "(Countries are investing in laser technology to defend against drones. Companies like Boeing and Lockheed Martin are more than 10 years away from the technology, according to MarketWatch.) \n\nThat means China is only 11 years behind.  Right Biden?",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "wendykroy",
        "time": "20 September, 2019",
        "context": "We need to return to the Iran nuclear agreement and end the sanctions. If we're to sanction anyone, it should be the Saudis, who use American sourced weapons to massacre Yemeni civilians.",
        "good": "0",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "repealobamacarenow330",
        "time": "20 September, 2019",
        "context": "Yes we are likely to see more of these types of attacks, that is, if no one hits Iran hard enough that no sane country would think of trying it again. Bomb/Rocket attack Iran back to the dark ages and all other countries will think twice before pulling that stunt again. Yes if no consequences follow this Saudi Oil field attack, the world can expect other such attacks. Consequences exist for a reason. Make Iran feel those consequences.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "GreenFlask",
        "time": "20 September, 2019",
        "context": "We could have turned the desert into glass back in 1979. End of story.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jacklaw1221",
        "time": "20 September, 2019",
        "context": "College professors all across the country are lecturing how this is Trump's fault.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "notmyneeds",
        "time": "20 September, 2019",
        "context": "Back in my day being anti war used to be popular.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "samiamgreeneggsandham",
        "time": "20 September, 2019",
        "context": "The Religion of Peace!  LuLs",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "johnhull",
        "time": "20 September, 2019",
        "context": "The spot welded flanges on the cruise missile are adorable.  Nothing says put something together quick like spot welds and flanges.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tj967",
        "time": "20 September, 2019",
        "context": "So i'm sure Boeing and Lockheed announced that they are 10 years out on their technology advances!!!\nPleeez.  Marketwatch is the first place I'd disclose military secrets.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "johnhull",
        "time": "20 September, 2019",
        "context": "A cruise missile requires control fins.  Not spot welded rigged fins.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "22889964",
        "time": "20 September, 2019",
        "context": "Now watch the Hawks go nuts wanting to retaliate.  Get a grip buttercups.  SA is quite capable of defending its own borders.  If you read what is being put out by the media and spokesmen something is missing in this whole mess.  Waiting for the MSM to blame Trump for it but that would not be anything unusual.  The US does not need to get involved in any other conflict in the Middle East.  Keep the sanctions etc. on Iran and keep squeezing them.  The way they are going right now they will self-implode.",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "OliveBottle",
        "time": "20 September, 2019",
        "context": "What type of drones were actually used. If they originated from Iran they had to be high altitude drones.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "samiamgreeneggsandham",
        "time": "20 September, 2019",
        "context": "When Saudi's pay for 9/11 and create a fund for our First Responders, then sell them weaps to do it themselves.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Flyovercitizen16",
        "time": "20 September, 2019",
        "context": "The best defense is always a good offense",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Bigfreakindeal",
        "time": "20 September, 2019",
        "context": "Seems Like an EMP weapon would drop some drones straight out of the sky...or some other way to scramble or kill the electronics",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rumormayer",
        "time": "20 September, 2019",
        "context": "The only way to prevent the drone attack is to blow up the control center, which is Iran!!",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "MCoil",
        "time": "20 September, 2019",
        "context": "Sad that lack of Trump leadership has led to all this in Yemen, Saudi Arabia, Syria and Baltimore.",
        "good": "1",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "TrumpsMarvelousBrain",
        "time": "20 September, 2019",
        "context": "Fear not, Trump has a cunning plan!",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bear02",
        "time": "20 September, 2019",
        "context": "Bomb Tehran like we did Dresden .................................... it'll stop then !",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "CyanPumpkin",
        "time": "20 September, 2019",
        "context": "Trump's new nickname today is\n\"Trump the extortionist\". \n\nI know you have no idea why, but you will, and you wont care.",
        "good": "1",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "rufusleaking943",
        "time": "20 September, 2019",
        "context": "''Thanks Obama, best $1.7B we ever spent.''\n-Ayatollah",
        "good": "11",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "SteveLife223",
        "time": "20 September, 2019",
        "context": "Nothing Obama did, prevented Iran from continuing to build up its military and nuclear abilities.\nAll Obama did, was to fund Iran so they could continue to reek havoc in the middle east. \nWay to go Obama!",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "MCoil",
        "time": "20 September, 2019",
        "context": "Poor John Roberts. So close to the anchor seat on a major network and yet so far. Now a field reporter for Fox.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jacklaw1221",
        "time": "20 September, 2019",
        "context": "Who wants Elizabeth Warren in charge at times like these?",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "samiamgreeneggsandham",
        "time": "20 September, 2019",
        "context": "Obama was Iran's best President.",
        "good": "31",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sidejoe3232",
        "time": "20 September, 2019",
        "context": "We can always sell Saudi Arabia more weapons in exchange for dirt on democratic opponents",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "mikeahr",
        "time": "20 September, 2019",
        "context": "I believe that at some point the civilized world is going to end up in a fighting war against this barbarian government leading Iran.  Perhaps a real coalition should prepare to offensively take out this world-wide threat once and for all!  Overwhelming force to annihilate in quick & unrecoverable fashion.  Don't tell me it can't be done!",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "BuckFoeJiden",
        "time": "20 September, 2019",
        "context": "I don't know, it looks to me as if the drones don't fly all that fast and possibly not all that high. If that is true, then I bet I could knock them down with a good 12ga goose gun.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cj0529",
        "time": "20 September, 2019",
        "context": "I can think of one way to stop them",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "KinzingerSasse",
        "time": "20 September, 2019",
        "context": "I commend the US and Saudi... I’m really shocked they haven’t retaliated back in anger.\n\nGood thing Truman isn’t our President anymore (Hiroshima and Nagasaki).",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jacklaw1221",
        "time": "20 September, 2019",
        "context": "Thank God Hillary is not President.",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jacklaw1221",
        "time": "20 September, 2019",
        "context": "The Democrats answer to this is to dismantle our healthcare system.",
        "good": "13",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "TheBrand",
        "time": "20 September, 2019",
        "context": "Iran sure is putting Obummer’s billion dollar gift to good use..",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "RedBulb",
        "time": "20 September, 2019",
        "context": "Trump is in over his head.",
        "good": "1",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "MCoil",
        "time": "20 September, 2019",
        "context": "So sad we had an agreement in place and Trump blew it so the Iranians kept the loot and now thumb their noses at us.   Trumpy failure.",
        "good": "1",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "propergander028",
        "time": "20 September, 2019",
        "context": "looks like they are gonna have to legalize fully automatic machine guns so we can shoot the drones down.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "scootertramp",
        "time": "20 September, 2019",
        "context": "All the countries in the Middle East will have to have an Iron Dome.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "johnhull",
        "time": "20 September, 2019",
        "context": "If you believe spot welded rigid fins are how cruise missiles fly around to their target you don't know what a cruise missile is.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "error": "error"
    },
    {
        "user_name": "right4US",
        "time": "20 September, 2019",
        "context": "Trump said he wont telegraph what he will do in a crisis or conflict.  He will act, but nobody will know when.  and when he does, it will be well thought out by him.  He doesnt do anything he hasnt thought of and also discussed with his Admin officials.",
        "good": "13",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "foxtex",
        "time": "20 September, 2019",
        "context": "Thanks a lot Obama",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dothedangthing",
        "time": "20 September, 2019",
        "context": "What are we spending $650 billion a year on then?",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "carguy67",
        "time": "20 September, 2019",
        "context": "\"Eighteen drones and seven cruise missiles\" - geez thats alot  of ordinance and sophistication for a group of \"rebels\" - yet Iran continues to say they had no involvement.  So if I give an arsonist gasoline and a match and then he starts a blaze, by Iranian logic, I am innocent.  Got it...",
        "good": "13",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "WarIsDeception",
        "time": "20 September, 2019",
        "context": "Nobody stopped the attack because they either didn’t want to for various reasons or did not have knowledge of it beforehand. \n\nWithout knowledge beforehand there was no stoping it. \n\nThere is a good chance either Saudi, Israel, Iraq or the US knew the attack was  imminent but did nothing in hopes to drag Trump into war",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "helloagainamericanpride",
        "time": "20 September, 2019",
        "context": "What's next, kites?",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "RedBulb",
        "time": "20 September, 2019",
        "context": "Trump is rolling over like a Good Boy.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "error": "error"
    },
    {
        "user_name": "divisifiedfarm",
        "time": "20 September, 2019",
        "context": "If these reports are true, then it began December 5, 2011 when President Obama and Congress allowed Iran to keep our high tech drone, the RQ-170 that they downed in very good condition. Those leaders are complicit in the reverse engineering that most likely will now lead to the death of 1,000's if not millions of people. But remember, our government, with their infinite wisdom, wants to take your guns and disarm you because they will protect everyone else from you.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "SavetheRepublicImpeachNow",
        "time": "20 September, 2019",
        "context": "Trump broke a working treaty that Iran was complying with and now they are openly mocking him.",
        "good": "2",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "rprof793",
        "time": "20 September, 2019",
        "context": "Pete ButtyGig can stop it.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rufusleaking943",
        "time": "20 September, 2019",
        "context": "Might as well face it, Iran wants war. We should oblige them.",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Tostik",
        "time": "20 September, 2019",
        "context": "This attack just points out how difficult it still is to defend against low flying cruise missiles. And that includes the S-400 against the Tomahawk as well..... And it also shows how difficult it is to take out oil facilities for any length of time. Been that way since WWII, when the allies couldn't take down the Ploiești, Romania oil field. The Germans had it up and running in about 3 days.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "helloagainamericanpride",
        "time": "20 September, 2019",
        "context": "This is a surprise? Who hasn't seen THIS coming?",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "RedSnow",
        "time": "20 September, 2019",
        "context": "Should have a frequency jamming  device near oil fields and power plants to stop this type of attack.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "BullMoosePartisan",
        "time": "20 September, 2019",
        "context": "\"Air attack on Saudi oil fields ushers in new era of warfare even US can’t stop, say experts\"\n\nLol, the US basically invented this kind of warfare...",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "johnhull",
        "time": "20 September, 2019",
        "context": "The attack was reported as being from Iran, and cruise missiles.  This is another false flag involving drones.  The second in only a few months.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "jacklaw1221",
        "time": "20 September, 2019",
        "context": "What would Beto do?",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "OliveBottle",
        "time": "20 September, 2019",
        "context": "If these drones were launched from Iran then there is no way they are the type of low altitude drones. They could not fly that far. The drones had to be high altitude drones to go that far.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "RedBulb",
        "time": "20 September, 2019",
        "context": "What ever happened to Tough Guy Trump?  Maybe he’s just Big Talk Trump?",
        "good": "3",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "FerdTerguson",
        "time": "20 September, 2019",
        "context": "Is this only because they do not fear John Bolton now he is gone?",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "johnhull",
        "time": "20 September, 2019",
        "context": "When Obama was in office we had a diplomatic channel open and not on the verge of war.  Thank you Obama.",
        "good": "1",
        "bad": "4",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "exposethedems",
        "time": "20 September, 2019",
        "context": "There is one way to stop Iran, destroy Iran. Drastic, but that's probably the only way.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "rufusleaking943",
        "time": "20 September, 2019",
        "context": "Hillary has uncorked her strategic reserve.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Libtermlimits",
        "time": "20 September, 2019",
        "context": "Bomb Iran back to the Stone Age. That solves a lot of issues.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "john.howard",
        "time": "20 September, 2019",
        "context": "This is the FIRST story than bothered to tell me there were multiple drones AND cruise missiles too.  I couldn't understand how one little drone took out half the Saudi oil production.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "soucy64",
        "time": "20 September, 2019",
        "context": "How many more references to \"Game of Thrones\" will we have to endure?  It has been over for a while now!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "imright100",
        "time": "20 September, 2019",
        "context": "the way we protect against these type of attacks is when they happen, completely flatten those who did it.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "JohnFrostwind",
        "time": "20 September, 2019",
        "context": "It's just like dealing with the V2 rockets, you have to find and destroy them before they launch.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "MyFoxThoughts",
        "time": "20 September, 2019",
        "context": "The expert is also saying that the Age of Drone Warfare has began and AI will take over the role of humans in a highly coordinated attack.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "wendykroy",
        "time": "20 September, 2019",
        "context": "The rise of terrorism started with our involvement in the Middle East. Who profits from such wars?  It is not the average citizen of our country.  Follow the money into the pockets.\nLook at the smile on Pompeo's face as he sits across from MBS on Wednesday. \nLook at the glazed eyes of Trump as he orb danced with the veritable nerve center of money and fossil fuel.",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "TheGOATwon",
        "time": "20 September, 2019",
        "context": "scary times",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "johnhull",
        "time": "20 September, 2019",
        "context": "A pallet of cash would be a small price to pay to prevent war.  What is cash but painted money.  If people really cared about it's value they'd notice inflation has gone up over 2000% since 1973 when Nixon took us of the Gold Standard.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "usafreecitizen",
        "time": "20 September, 2019",
        "context": "Does Iran have the capability and resources to build drones and cruise missiles? They would have most likely bought them from Russia. Can't we find serial numbers or something on them telling where they came from? Once you find this you know who bought them... or so I would think.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rufusleaking943",
        "time": "20 September, 2019",
        "context": "If you can't stop the attack then you must make it's consequences unacceptable.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "BullMoosePartisan",
        "time": "20 September, 2019",
        "context": "\"Air attack on Saudi oil fields ushers in new era of warfare even US can’t stop, say experts\"\n\nAmerica ushered in drone warfare almost 20 years ago...",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "averagejoemn",
        "time": "20 September, 2019",
        "context": "Nuke Iran and I guarantee they'll never do it again.  Problem solved.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "RedSnow",
        "time": "20 September, 2019",
        "context": "A magnetic field will disrupt a drone...",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "SteveLife223",
        "time": "20 September, 2019",
        "context": "Iran brought the Yemen rebels to Iran to inspect their new purchase (cough). The Yemen rebels wanted a demonstration. Iran allowed the Yemen rebels to push the fire buttons. This gave Iran plausible deniability that they didn't launched the attack.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "1fordtech1",
        "time": "20 September, 2019",
        "context": "Dims would outlaw the use of drones for warfare to even the odds for our enemies.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "JimfromTexas",
        "time": "20 September, 2019",
        "context": "\"likely not have been stopped by any country\" - - is it really a good idea to tell everybody that???",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "nightfly12",
        "time": "20 September, 2019",
        "context": "Here's a newsflash:\nUntil you deal with Iran severely, these will keep happening.\nJust a fact of life.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "albert1191",
        "time": "20 September, 2019",
        "context": "\"A new era of warfare\", “Middle East Drones Signal End to Era of Fast Jet Air Supremacy,” \"something the US can't even protect against\"? Really, who did the reporter talk to? The US and other countries have been using drones for decades, it's nothing new. They have been saying that it's the end of the piloted aircraft for longer than that. With the technology I assume Saudi Arabia has I cannot see how they missed the attack. It must of looked like a swarm on a radar screen. My only guess is they let it happen to stir the pot. That might also be why it's hush hush at the moment on officially placing blame. \n\nAs far as the US not being able to protect against it, think again.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tbjnark",
        "time": "20 September, 2019",
        "context": "The Guardian?? Lol. That rag has been shouting doom and unsupported gloom as long as I can remember. We were supposed to be covered in ice by 1990, then acid rain would kill all the freshwater fish by 2000, then overpopulation would lead to worldwide famine by 2009, then half the US underwater and no arctic ice by 2014.  They aren’t a news source, they’re a tabloid.",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Iknowtoo",
        "time": "20 September, 2019",
        "context": "Funny how Fox sensor comments by shadow blocking. Three minutes ago I posted and on another browser not a line.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "observer101",
        "time": "20 September, 2019",
        "context": "\"ten years from developing defense weapons against drone attacks?   WHY SO LONG, and if they know where they are \"going with the development\", why not expedite it?      SOMEHOW I don't believe it.....",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "usafreecitizen",
        "time": "20 September, 2019",
        "context": "Al Gore invented cruise missiles.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "1nd3p3nd3nt",
        "time": "20 September, 2019",
        "context": "for those missing it :\nif we can't stop a drone attack on a stationary target, our aircraft carriers are sitting ducks",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "RedPizza",
        "time": "20 September, 2019",
        "context": "Never trust anyone who wears diapers on their head.",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "hamburgler4005",
        "time": "20 September, 2019",
        "context": "soon we will being fighting wars without the human element being involved. the big thing with that is when do you when a war like that. no human casualties, just physical ones. a war like that could go on forever",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "pleaseletmegohome",
        "time": "20 September, 2019",
        "context": "The world should eradicate all terrorism and hate.\nAll that is left is friendship and love.\nProblem solved.\nThank you!",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jacklaw1221",
        "time": "20 September, 2019",
        "context": "If one of the Democrat candidates were in charge they would simple implore both sides to stop producing oil.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "RedPizza",
        "time": "20 September, 2019",
        "context": "Dear Barack, thanks for the drones. \nHassan Rouhani",
        "good": "39",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "phantomx10",
        "time": "20 September, 2019",
        "context": "The incessant droning has already started in America: \nIt's what the Dems do best, especially the Squad",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mitchkilgore",
        "time": "20 September, 2019",
        "context": "What will stop these sort of attacks is accountability and consequences.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "elalamein",
        "time": "20 September, 2019",
        "context": "Iran now has drones thanks to the fact that they were able to copy our design after Barry landed one of ours  practically in their lap.",
        "good": "27",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "propergander028",
        "time": "20 September, 2019",
        "context": "imagine waves of drones coming in the millions",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "metalroxxstar",
        "time": "20 September, 2019",
        "context": "I don't why the Saudi's send some special forces into Iraq and launch some (Russian made, of course) missiles and drones at some of Iran's key infrastructure. All the Saudi's have to do is say \"nope, it wasn't us, we were busy watching Monday night football\"...",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rufusleaking943",
        "time": "20 September, 2019",
        "context": "It was clear Barry's ''Cower and Cash'' strategy wasn't working.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jamesjcarville",
        "time": "20 September, 2019",
        "context": "Tin foil hats are out in force this morning.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "GoingDeep1",
        "time": "20 September, 2019",
        "context": "Barry paid for these drones.................Thanks Barry",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Iknowtoo",
        "time": "20 September, 2019",
        "context": "Fox controls the narrative just like all the media.",
        "good": "2",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "LiberterianLogicWins",
        "time": "20 September, 2019",
        "context": "yes we can. nuke the source.",
        "good": "12",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "LeoT",
        "time": "20 September, 2019",
        "context": "Trump stopping the cash flow to Iran is a good start from Iran purchasing these drones",
        "good": "14",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "BuckFoeJiden",
        "time": "20 September, 2019",
        "context": "Those drones don't look like they are capable of long duration, high altitude or great speed. If I am correct in those assumptions then you go out and find some good duck and goose hunters, give them some good 12ga or 16ga shotguns an put them up on towers.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "RedPizza",
        "time": "20 September, 2019",
        "context": "Iran likes the use of drones because their  soldiers can spend more time at home with their goats.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "RadicalizedAmerican",
        "time": "20 September, 2019",
        "context": "Expert in drone defense?  Is there a community college course or did he stay at a Holiday Inn Express?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "error": "error"
    },
    {
        "user_name": "RedSnow",
        "time": "20 September, 2019",
        "context": "Let them fight ....it keeps them busy over there.....",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "TheoSam",
        "time": "20 September, 2019",
        "context": "Future oil storage facilities can be put underground, with wire mesh arrays above. Also, I’m sure that there will soon be anti-drone drones, if there aren’t already....",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "wendykroy",
        "time": "20 September, 2019",
        "context": "Seeing Pompeo thoroughly enjoying himself with the Crown Prince after what was done with Mr. Khashoggi is sickening. I'd rather see Trump Orb dancing with glazed eyes. \nOur presence there helps no average United States citizen.\nFollow the money.",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "apparentlynotquiteunbannable",
        "time": "20 September, 2019",
        "context": "EMP. Not that difficult at all.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "2boydogs",
        "time": "20 September, 2019",
        "context": "Iran can buy an awful lot of drones with the 140 billion dollars that Obama gave them.",
        "good": "20",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "Ohcomeonalready",
        "time": "20 September, 2019",
        "context": "Great news to make public.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "RedSnow",
        "time": "20 September, 2019",
        "context": "Let the young men of Saudi Arabia worry about it ....they did nothing  in the first gulf war...",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "joegoood821",
        "time": "20 September, 2019",
        "context": "Anything requiring GPS can be hacked...the weapon is only as smart as the guidance...similar to the so called \"Experts\" only being as smart as their own brains.  I do wish a definition of what constitutes \"Expert\" could be derived, it used to just be an \"Opinion\".",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "garyborder",
        "time": "20 September, 2019",
        "context": "If it's a true \"drone\" why not jam it's radio link?",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "SecureSborder",
        "time": "20 September, 2019",
        "context": "just the times in which we live. doesn't matter if you believe it or not, it's real.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "scootertramp",
        "time": "20 September, 2019",
        "context": "We give 3.8 million dollars of our money to Israel each year and they have commercials to send them more?",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "29stumps",
        "time": "20 September, 2019",
        "context": "Let the Saudi's take care of this mess themselves!",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "notalib.",
        "time": "20 September, 2019",
        "context": "Its not our problem. Period.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "CooterPossum",
        "time": "20 September, 2019",
        "context": "And therefore, the only way to stop it is to punish the perpetrator.\nShow in no uncertain terms that bad acts result in bad consequences.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "hamburgler4005",
        "time": "20 September, 2019",
        "context": "you know my entire life governments have tried to establish rules for war. there are no rules for war. the objective of war is to destroy the enemy. see how quickly leaders forgot about the rules of engagement established after ww2, when war broke out in middle east.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "varieze1138",
        "time": "20 September, 2019",
        "context": "What  ccurred after Pearl Harbor that ended the war & built a foundation for peace in the region? KA-BOOM,  KA- BOOM .",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "elalamein",
        "time": "20 September, 2019",
        "context": "Jam 'em. They'll drop like flies.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "magatastic",
        "time": "20 September, 2019",
        "context": "nobody could have defended better?  \n\nyou'd better hope not.  or else, saudi arabia will be asking for THEIR help next time....",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Retardant",
        "time": "20 September, 2019",
        "context": "Iran pollutes the air, no problem. Give a straw to someone, Jail.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "azguy5",
        "time": "20 September, 2019",
        "context": "Boeing and Lockheed Martin? God help us. I worked for the government and those companies are horrible. I would rather see Toyota build our defense lasers.",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "check4321",
        "time": "20 September, 2019",
        "context": "Test out a few emp bombs.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "hamburgler4005",
        "time": "20 September, 2019",
        "context": "facts are oil from the middle east is not something the usa is dependent on anymore.  so actually might be a good idea to just let iran and saudi fight it out. this attack only made gas go up a few cent.  10 years ago we were paying 3.99 a gallon",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Spaniard2000",
        "time": "20 September, 2019",
        "context": "Well, DeBlasio is out. \n\nBoth his supporters will be very disappointed",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "error": "error"
    },
    {
        "user_name": "imright100",
        "time": "20 September, 2019",
        "context": "This is the Saudi's fight... but our soil is attacked, seek and destroy without mercy",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "shogun459",
        "time": "20 September, 2019",
        "context": "I'm actually surprise this hasn't happened before.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "zambifreaker",
        "time": "20 September, 2019",
        "context": "Saudi paid 1B for each patriot system that is mainly an anti missle defense. A software upgrade would take care of the drones too.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rufusleaking943",
        "time": "20 September, 2019",
        "context": "If you really don't want Iran to have nukes, go in and take them out.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "BuckFoeJiden",
        "time": "20 September, 2019",
        "context": "Develop some kind of automated turret with auto-loading mega-shotguns and targeting systems.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "PurpleBone",
        "time": "20 September, 2019",
        "context": "Take all those parts, fix it, return to sender!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "MAGATearCollector",
        "time": "20 September, 2019",
        "context": "Former Secretary of State Rex Tillerson said that Israeli officials “played” Donald Trump during talks, using “misinformation” to manipulate the president. He warned that a “healthy amount of skepticism” is necessary when dealing with Prime Minister Benjamin Netanyahu.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "RedSnow",
        "time": "20 September, 2019",
        "context": "I love to smell oil burning in the morning...",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "YWORE",
        "time": "20 September, 2019",
        "context": "Sen. Menendez said this was not an attack on the US, well neither was the annexation of the Sudetenland, and the invasions of Korea and China in Pre-World War 2.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "elalamein",
        "time": "20 September, 2019",
        "context": "It's time for the Saudis to defend themselves. We're tired of doing it. \nWe can make some of our oil money back by selling them weapons.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "OrangeCupcake",
        "time": "20 September, 2019",
        "context": "You want to defend yourself, you stop the source... A 2MT nuke on Tehran would do nicely...",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "🇺🇸🙏",
        "time": "20 September, 2019",
        "context": "Arrest John Kerry...",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "gooddawg",
        "time": "20 September, 2019",
        "context": "Just like Game of Thrones, this will not end well",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "MAGATearCollector",
        "time": "20 September, 2019",
        "context": "Trump built this.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "error": "error"
    },
    {
        "user_name": "mitchwkr",
        "time": "20 September, 2019",
        "context": "Why would we have 2 large companies trying to develop technology that is 10 years away? Don't they know that the earth is going to be under water in 10 yrs. Just ask the libs. They'll be more than happy to tell you. It seems to me just wasted time and money.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jagged44",
        "time": "20 September, 2019",
        "context": "It can be stopped, we just don't want to pay the price that it takes to do it.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "MAGATearCollector",
        "time": "20 September, 2019",
        "context": "Obama destroyed ISIS and kept the peace. \nTrump turned lemonade into lemons.",
        "good": "0",
        "bad": "8",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "odemoe",
        "time": "20 September, 2019",
        "context": "......evidently we haven't learned a d@mm thing from our LAST fifty morasses in the Middle East, have we???",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tupperhouse",
        "time": "20 September, 2019",
        "context": "The question is why is a drone from Iran covered in English letters?",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "makalawena",
        "time": "20 September, 2019",
        "context": "It had to be Iran or NoKo. They’re the only aggressive countries that are launching test missiles",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Iknowtoo",
        "time": "20 September, 2019",
        "context": "Rheinmettal Oerlikon make a laser, the Turks used a laser to shoot a drone down in Libya. The rohtua has an agenda.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "neveraliberal1",
        "time": "20 September, 2019",
        "context": "Iran had a treaty with 7 other countries. Why did they break it?",
        "good": "7",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "RedSnow",
        "time": "20 September, 2019",
        "context": "Iran bought the drones with Obama  money...",
        "good": "12",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "brch441",
        "time": "20 September, 2019",
        "context": "The first attack may not be defendable , but any further attacks certainly are . Eliminate the threat.",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "elalamein",
        "time": "20 September, 2019",
        "context": "Oh boy here we go. Iran's attack on Saudi Arabia was all Trump's fault  - coming from the lefties on here. \nWell no one ever accused the left of rational thought.",
        "good": "12",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "lee73938",
        "time": "20 September, 2019",
        "context": "There's only one thing I like about Trump, he seems to have no interest in War. Most Americans will NOT support a war in the Middle East, and our allies would NOT support us if we tried.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "neveraliberal1",
        "time": "20 September, 2019",
        "context": "Liberals condoning the attack.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "phase",
        "time": "20 September, 2019",
        "context": "The Obama regime funded this attack.",
        "good": "15",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "vacca",
        "time": "20 September, 2019",
        "context": "Keep bombing the Saudis, they will eventually fight back. Our troops have to rely on the VA and that itself is an attack.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "NoAvatar",
        "time": "20 September, 2019",
        "context": "Iran, Winter is Coming.",
        "good": "12",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "QuitThat",
        "time": "20 September, 2019",
        "context": "What is the point of the \"World's Largest Military Budget\"....if it is useless?",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "SoyBoy4Trump",
        "time": "20 September, 2019",
        "context": "The Experts obviously don't study history.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Frankkrizzo",
        "time": "20 September, 2019",
        "context": "Well drop 8 Nuclear warhead missiles on Iran and see if they can defend themselves from them.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sailen4love",
        "time": "20 September, 2019",
        "context": "Must destroy them before they leave the ground. after all the article would wrote by somebody at work for the New York times. How much credibility is that?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "prowlman",
        "time": "20 September, 2019",
        "context": "I think this guy is totally wrong about the saudis. They depend on us to defend them. Otherwise, they have larry babba, curley ali, and moe hussein manning the radars and guns....",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "RedCoathanger",
        "time": "20 September, 2019",
        "context": "\"The bottom line is that we are likely to see many more of these sorts of attacks, and in particular, coordinated attacks on multiple targets are likely, possibly in tandem with a cyber attack component,\" \n\nIt works both ways.  Let's do it.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "butmyfeelingstrumplogic",
        "time": "20 September, 2019",
        "context": "THIS  is what happens when you send a pallet of cash to your mortal enemy Mr Obama.\n\nDid you really think they were going to buy rainbows and daisies with it?",
        "good": "26",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "hamburgler4005",
        "time": "20 September, 2019",
        "context": "the world no longer has any military superpowers. with the introduction of AI into war any country no matter the size could have the biggest army. the most effective weapon of the era seems to be drones . doesnt take a country the size of china to be the country with the most drones",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "sstarke2",
        "time": "20 September, 2019",
        "context": "I'm sure Pentagon does have weapon that is effective against the threat. It's just a secret weapon. They wouldn't tell anyone.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "zambifreaker",
        "time": "20 September, 2019",
        "context": "Super slow flying drones can’t be stopped? This article is incorrect",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "wendykroy",
        "time": "20 September, 2019",
        "context": "The rise of terrorism started with our involvement in the Middle East. Who profits from such wars?  It is not the average citizen of our country.  Follow the money into the pockets.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "polorpopkid",
        "time": "20 September, 2019",
        "context": "Saudi Arabia showed a photo of a NATO drone ?    Iran has our drone tech and knows how to use them ?",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "SaltyBill",
        "time": "20 September, 2019",
        "context": "Pull all US forces out of the Persian Gulf,  sell Saudi Arabia whatever weapons they can afford and sit back and watch China's oil supply go up in smoke!",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "filthycasual",
        "time": "20 September, 2019",
        "context": "Unfortunately, the only way to insure that this stops is all out war on Iran. They will never honor any agreement that they sign.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "magaman1964",
        "time": "20 September, 2019",
        "context": "8 years of the Obama apology tour certainly didn't help.",
        "good": "17",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "MrMorden",
        "time": "20 September, 2019",
        "context": "I looked up who’s got more military might/ Iran or Saudi Arabia. Iran is way more powerful. \nThats why Saudi’s are reluctant to fully call out Iran.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "imright100",
        "time": "20 September, 2019",
        "context": "Beto just came out with a drone buy-back plan",
        "good": "14",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "samuelweller832",
        "time": "20 September, 2019",
        "context": "Bought with Obama's pallet of cash",
        "good": "19",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "C4Myself",
        "time": "20 September, 2019",
        "context": "Iran is probably having the bombs delivered by Amazon.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "wendykroy",
        "time": "20 September, 2019",
        "context": "There are presently many world powers that want to see war between the US and Iran, that includes Russia, China, Israel and Saudi Arabia. Trump will base any and all his decisions on short term Trump profit.",
        "good": "1",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "glsfbg3",
        "time": "20 September, 2019",
        "context": "Notice that Israel has been defending itself against drones for years. There is a defense AND an offense against drones & cruise missiles. Retaliation is coming.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "howdydam1t",
        "time": "20 September, 2019",
        "context": "The US should have never given away Our GPS technology to the rest of the world, for free. No Doubt that is one of the things they are using  for the recent ship collisions in Asia, with our own system.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "tooterturtle",
        "time": "20 September, 2019",
        "context": "The Saudis must have been asleep at the radar.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "CyanBus",
        "time": "20 September, 2019",
        "context": "He should have destroyed the airstrip that attacked our drone .Then this wouldn't have happened",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "nowwhatlibs",
        "time": "20 September, 2019",
        "context": "Keep believing that...............",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "phase",
        "time": "20 September, 2019",
        "context": "Obama's Nevil Chamberlain like attitude causes this problem with Iran",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Xwingfighter00",
        "time": "20 September, 2019",
        "context": "If theocrats want to kill each other, why would reasonable people get in the way?\nSo far ZERO Americans have been ki||ed and that’s the right number.",
        "good": "12",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "larrylogic382",
        "time": "20 September, 2019",
        "context": "................its forces could do little to stop the onslaught, Roberts told the Times.\n\nAnd they wont be able to stop the return onslaught. The problem for them will be all their military bases will be gone. As well as any defense area outposts.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "RedScooter",
        "time": "20 September, 2019",
        "context": "Quite curious that at least some of the drones have NATO markings on them.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "areswest",
        "time": "20 September, 2019",
        "context": "Um, drone defense technology has been around for sometime now and is just starting to get deployed. Even the Chinese have a rifle that can shoot down drones without firing one bullet. It's actually far easier to disable drones than people think. Unfortunately like the Saudi's we do not have this tech generally deployed yet which absolutely makes many primary strategic locations vulnerable. Including major congested areas prime for terrorist attacks. Thus why I always say if you hear a loud high pitch buzzing sound fluctuating in frequencies... run.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "pattypat",
        "time": "20 September, 2019",
        "context": "I suppose this 'military expert' does not know that there are weapons that can make unmanned drones just fall out of the sky by separating the drone from its remote flyer via jamming technology.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "Iknowtoo",
        "time": "20 September, 2019",
        "context": "Block the comments as I record them for the FCC.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "quarky777263",
        "time": "20 September, 2019",
        "context": "Only a massive retaliation is going to prevent more of these attacks. It's the only language Iran understands.",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "makalawena",
        "time": "20 September, 2019",
        "context": "We have Bill Clinton to thank for NoKo and Obama to thank for Iran. I mean what could go wrong giving communist and terrorist countries that hate America nuclear capabilities",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sundaisy89",
        "time": "20 September, 2019",
        "context": "Saudi Arabia is a very wealthy country.  Let them fight their own war - we don't need to be fighting it for them.",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jameshurley",
        "time": "20 September, 2019",
        "context": "If Trump receives a conviction by the US Senate during an impeachment vote, then he should be court-ordered to repay his salary to the US Treasury.",
        "good": "0",
        "bad": "6",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "QuitThat",
        "time": "20 September, 2019",
        "context": "America spends almost a Trillion Dollars a year..... Just to hear that it wouldn't have made a difference.   That's just silly!",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tenbags",
        "time": "20 September, 2019",
        "context": "right. I'll get nervous when Iran upgrades their slingshots and spears to atomic slingshot and spears",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "DerRotBaron",
        "time": "20 September, 2019",
        "context": "Thanks to Obama for supplying the cash to Iran.",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tobadthebeastlost",
        "time": "20 September, 2019",
        "context": "USS Harry S. Truman didnt deploy with the carrier group headed over there why do you think?? It takes a long time to load all those little drones",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jack_hammer",
        "time": "20 September, 2019",
        "context": "Hey Ed I got news for you.......you’re wrong. You need to stop thinking and start knowing.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "texaninexile",
        "time": "20 September, 2019",
        "context": "The so called expert apparently has not paid attention to the us navy.  The old phalanx chain gun was replaced with a laser system back when Obama was President.  The system exists the questions become more of power requirements, cooling needs, and cost.  I guarentee that it is not for sale at this point to anyone outside of the special relationship countries(England, Australia etc)",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tobadthebeastlost",
        "time": "20 September, 2019",
        "context": "Use shotguns like dove season",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "gsavr1",
        "time": "20 September, 2019",
        "context": "Thank Hussein Obama for Iran having the Drone technology to do this",
        "good": "15",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "originalreggy1",
        "time": "20 September, 2019",
        "context": "Look how many drones Iran was able to buy/build with the money that Obama gave them.",
        "good": "32",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "VYCanisMajoris534",
        "time": "20 September, 2019",
        "context": "A total and complete air and sea blockade of Iran would bring them to the table.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "zionatheist",
        "time": "20 September, 2019",
        "context": "Trump showed restraint,  to his credit.   Iran is cornered and there is no immediate need to act.  Iran has to be stopped in its nuclear weapons ambitions.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "elalamein",
        "time": "20 September, 2019",
        "context": "Saudis need to hit multiple high dollar targets in Iran. They're already cash-strapped and won't be able to replace the destroyed equipment. The Saudis could begin with Iran's largest and most expensive warships. \nWe'll sell 'em the weapons, and keep our people home.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Friskylivesmatter",
        "time": "20 September, 2019",
        "context": "So the Guardian is the preeminent source of Military know how?",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "MAGATearCollector",
        "time": "20 September, 2019",
        "context": "George Bush allowed Abu Bakr Al-Baghdadi to be a leader of the inmates in an Iraqi prison because they respescted him. Al-Baghdadi was recruiting the inmates to meet up with him after release to create ISIS.\n\nRepublicans should not make decisions for our military. Period.",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "fox56",
        "time": "20 September, 2019",
        "context": "Saudi is a country of super rich. Let them figure it out.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "samiamgreeneggsandham",
        "time": "20 September, 2019",
        "context": "Saudi's can buy the weaps ONLY after they pay for the lives lost and our ailing first responders on 9/11.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "swampstomper",
        "time": "20 September, 2019",
        "context": "Who are these experts? That the US can't stop an attack from drones...  maybe the US can't protect other countries but we sure have the radar and defensive capability to protect ourselves. That's the kind of defenses we've been building up for years. The electronic counter measures alone have kept drones from going anywhere near our Navy ships. These experts remind me of the same expert who thought Saddam's military was formidable opponent.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "PurplePretzel",
        "time": "20 September, 2019",
        "context": "There have been many competitions for someone to successfully stop a mass drone attack. None have been successful.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Friskylivesmatter",
        "time": "20 September, 2019",
        "context": "When they launch their drones the next time and all fall from the sky after being jammed I will be snickering.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "DerRotBaron",
        "time": "20 September, 2019",
        "context": "Another mess caused by Obama.",
        "good": "8",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "RedSnow",
        "time": "20 September, 2019",
        "context": "Saudis are two face...they act religious..then party and drink at night....",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mojo88",
        "time": "20 September, 2019",
        "context": "Yemen’s Houthi fighters claimed they were behind the attack. I'd be inclined to believe them, especially as Iran denies the attack. So why the rush to punish Iran???? Ahh yes, some want WAR WAR WAR",
        "good": "1",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "guy012",
        "time": "20 September, 2019",
        "context": "Drones are not autonomous yet, should be able to stop them.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Jdckck",
        "time": "20 September, 2019",
        "context": "If you can disrupt the signal controlling a drone, you can completely shut down that threat.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "samiamgreeneggsandham",
        "time": "20 September, 2019",
        "context": "Some ppl did something.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "southlife1973",
        "time": "20 September, 2019",
        "context": "We knew this would happen eventually. I mean, there's now millions of drones around the work. You can buy them at Best Buy, Etc. It's unfortunate but not really surprising a terrorist group would do this. On a positive note there are ways to shoot them down, etc.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "stablegeniuskim",
        "time": "20 September, 2019",
        "context": "SA attacked us on 9/11... so let's help them...🙄",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Kittenfish",
        "time": "20 September, 2019",
        "context": "Just wait until someone gets nano swarm attack drones going....we're all done for then.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bossko291",
        "time": "20 September, 2019",
        "context": "It used to be expensive and technically difficult to make such drones. Now you can buy them at Walmart. Not exactly the same but not so far off either.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "putin1",
        "time": "20 September, 2019",
        "context": "bacon bombs",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "skyhog2",
        "time": "20 September, 2019",
        "context": "Expert: Ex: has been, spurt, a drip under pressure. Two can play this game, he who has the most toys wins the game.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Magnum5",
        "time": "20 September, 2019",
        "context": "The sanctions are working - they have Iran lashing out like a snake pinned down by someone stepping on it. 'Might have to put a second foot on the snake.",
        "good": "13",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "scootertramp",
        "time": "20 September, 2019",
        "context": "Let them settle it. It's none of our business.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sstarke2",
        "time": "20 September, 2019",
        "context": "We have space technologies. We can even intercept and shoot down flies in other countries if needed. We have lasers and lightsabers.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "BlueStrawberry",
        "time": "20 September, 2019",
        "context": "We should fly 10,000 miles to smoke a camel...",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "OrangeController",
        "time": "20 September, 2019",
        "context": "Those attacks can be stopped. Just untie our hands and those of our allies for a few days - this nonsense will stop.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "MadChemist",
        "time": "20 September, 2019",
        "context": "So, Iran shoots down our surveillance drone, attacks shipping, and now attacks a major oil complex of an ally.  What are we going to let them get away with next?  It is time for a measured response.  Full measure.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "samiamgreeneggsandham",
        "time": "20 September, 2019",
        "context": "Pay back for 9/11",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "MAGATearCollector",
        "time": "20 September, 2019",
        "context": "ISIS calls Obama \"The great destroyer\" \nTrump is known as the \"Invisible Man\"",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Spaniard2000",
        "time": "20 September, 2019",
        "context": "Why are we bothering with this when climate change is the existential threat to humanity?",
        "good": "7",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "scootertramp",
        "time": "20 September, 2019",
        "context": "Global Climate change participants need to not grill anything and drive an electric scooter.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "CyanBus",
        "time": "20 September, 2019",
        "context": "Drop a MOAB on Tehran",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "hacdoc761",
        "time": "20 September, 2019",
        "context": "Wipe'm out either way. Perfect incident to blame Iran.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Trump2020-6MoreYears",
        "time": "20 September, 2019",
        "context": "In my opinion this attack by Iran is designed to hurt Trump's re election chances, they would much rather have a democrat in office so they can get back in the nuke deal and end sanctions The attack is an attempt to hurt the economy and put Trump in a bind militarily. If he attacks he will be called wanting to start a war and if he does nothing then they will say he is weak. Clearly Iran would rather have a democrat as president.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "totochaos",
        "time": "20 September, 2019",
        "context": "Drones are going to kill us all. That's just a fact.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "Mr.BillK",
        "time": "20 September, 2019",
        "context": "If Iran knew that it would suffer sure and devastating reprisals they would never dare to act in this way. But Iran knows nothing will happen. So on with the show.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "vad5",
        "time": "20 September, 2019",
        "context": "Trump is an American traitor.......his name will replace Benedict Arnold as being synonymous with Traitor",
        "good": "0",
        "bad": "7",
        "replies": []
    },
    {
        "user_name": "johnhull",
        "time": "20 September, 2019",
        "context": "\"When asked how a twelve year old boy committed murders over thirty years ago police responded \"He's just that good.\"",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "sixpacktwo",
        "time": "20 September, 2019",
        "context": "Iran is a terrorist nation and supports terrorism around the World, appease them at your own risk.  They never stopped terrorist support or nucular activity even after Obama gave them billions. You can alway push a problem down the road but history tells us, it just becomes a bigger problem for someone else.  The World better get it's act together as there are bad actors out there.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sfchief",
        "time": "20 September, 2019",
        "context": "We sell Saudi Arabia munitions to defend themselves, why would we step in BEFORE they have done one thing to defend themselves? 15 of the 19 hijackers on 911 were Saudi, and no explanation?  Now, they want us to lead in the Proxy War with Iran?  NOPE.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "TonberryVsChocobo",
        "time": "20 September, 2019",
        "context": "Don't ever compare Pearl Harbor to some towel people's oil. Sick world we live in",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "MAGATearCollector",
        "time": "20 September, 2019",
        "context": "Just watch Rudy's epic meltdown to understand where the mindset of the unhinged right is these days. Doesn't Rudy have a family to keep him off tv?",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "odemoe",
        "time": "20 September, 2019",
        "context": "....this is Sunni vs. Shia.....one terrorist state fighting another....let them.....and keep out of it.......",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Kittenfish",
        "time": "20 September, 2019",
        "context": "This is comical in a way....imagine the faces of the Mullahs....expecting off the cuff Donald to respond immediately....provocation with the hopes our President will go in militarily....and them muttering \"anytime now, anytime now....days later....it's coming, alert, alert\".  That scenario makes me smile, let them stew.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Freddy420",
        "time": "20 September, 2019",
        "context": "How do desert people acquire such technologies?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "RedSnow",
        "time": "20 September, 2019",
        "context": "Let Saudia defend their country for once...",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "polorpopkid",
        "time": "20 September, 2019",
        "context": "Tariffs and sanctions is all we have right now ?",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "Thoughtoftheday",
        "time": "20 September, 2019",
        "context": "I have to ask myself, what would Reagan have done faced with the same problem?  \n\nBombs away.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tobadthebeastlost",
        "time": "20 September, 2019",
        "context": "the Mullahs \" bring me me brown pants\"",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "yipcoyote097",
        "time": "20 September, 2019",
        "context": "This sounds bogus. Devices that are basically smallish, slow airplanes are impossible to stop? really?",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Rufust.Firefly2018",
        "time": "20 September, 2019",
        "context": "If I had a nickel for everytime I've heard a pundit say, the era of \"(fill in the blank)\" is over.  When they invented the guided missile, these pundits said machine guns on jets were outdated.  Well, guess what...every jet has a machine gun of some time.  Tanks were suppose to end the role of infantry and look has that's turned out.  With each innovation on the battlefield, there is a response developed and I'm sure our military is working or may already have a response.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "aw1022018",
        "time": "20 September, 2019",
        "context": "This is more like a global deep state attack to  pull the U.S. into a war to try and put pressure  on Trump during the election year. This will allow the Socialist Dems  to feed the public with lies in order to get back in office.  Each time Trump keeps winning and moving forward, the deep state takes evil one more step up.",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Independent2024247",
        "time": "20 September, 2019",
        "context": "So it leaves us no choice but to totally destroy those who use them for aggression like Iran!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "CorporateShill",
        "time": "20 September, 2019",
        "context": "It's still not certain it came from Iran.  Both Saudi Arabia and Japan express doubts.  The Houthis claimed responsibility.  The neocons want to push us into another bloody war that don't benefit us.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "RedSnow",
        "time": "20 September, 2019",
        "context": "Send in the Canadian Special  Forces....ha...ha...",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "trollsniper101",
        "time": "20 September, 2019",
        "context": "USA bought those drones.....obama built that.....",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Independent2024247",
        "time": "20 September, 2019",
        "context": "I want something done about this with Iran. Whats next if we don't? We have to destroy all of their military assets and bunkers. Sorry its going to have to be done sooner or later.",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "MAGATearCollector",
        "time": "20 September, 2019",
        "context": "Rudy Giuliani proved last night Trumpism is a very serious mental disorder.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "runpoobear",
        "time": "20 September, 2019",
        "context": "Not Iran's fault, they figured we will always send them pallets of cash to fund their Uranium enrichment.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "chuckeasy128",
        "time": "20 September, 2019",
        "context": "Of course it can be stopped. Carpet bomb Iran military sites.",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "johnhull",
        "time": "20 September, 2019",
        "context": "So Giuliani has admitted that Trump did in fact ask the Ukraine to \"investigate\" Biden and his son.  He wants you to believe is was a completely benign and routine thing to happen.  You know, pay off other countries for dirt on opponents like you do.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "TotalmanSnow",
        "time": "20 September, 2019",
        "context": "Iran wants your money about 200 billion",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "NHSleddogs",
        "time": "20 September, 2019",
        "context": "Time to fire up the glass factory.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "buildthedamnwall387",
        "time": "20 September, 2019",
        "context": "Now we know how Iran spent all the money Obama sent them!!!!!",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Kittenfish",
        "time": "20 September, 2019",
        "context": "See, this is why it was a problem that Obama was so weak.....both Russia and Iran advanced and entrenched themselves in several countries when Obama stepped in.....now, only war will oust them as they are rooted deeply.....and gee, it wasn't like that until Obama.",
        "good": "13",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Kittenfish",
        "time": "20 September, 2019",
        "context": "Remember, Iran took one of our drones in 2011 on the Afghanistan side.....we didn't bite then either.\n\nAs far as Saudi oil fields, the Saudi's have to defend them first and foremost.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Goldmanstein",
        "time": "20 September, 2019",
        "context": "The Russian base at Latakia, Syria was attacked twice by at least a dozen drones each time.  All drones were either shot down by air defences or taken over using electronic warfare and landed.  That's the difference between Russian and American tech.",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "polban1",
        "time": "20 September, 2019",
        "context": "This attack brought to you by Obama.\nObama terrorism loans. When no bank will back you, ask Obama for pallets of cash.\nAnd... they deliver to you.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "vad5",
        "time": "20 September, 2019",
        "context": "If Iran asks Trump to build a casino in their country.....he will start sending them money.",
        "good": "0",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "johnhull",
        "time": "20 September, 2019",
        "context": "Trade wars, race wars, class wars, gender wars, nuclear wars, war.  It's fairly obvious what the republican agenda is.",
        "good": "1",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "trollsniper101",
        "time": "20 September, 2019",
        "context": "Obama’s religion of choice isn’ very peaceful.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "wlfrench",
        "time": "20 September, 2019",
        "context": "So do a drone attack on Iran's oil fields and call it even.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "markds071",
        "time": "20 September, 2019",
        "context": "It's nice to know that Iran didn't waste all of the money Obama gave them...",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "CyanBus",
        "time": "20 September, 2019",
        "context": "Call Iran's bluff hit a couple of their oil fields",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "GreenWrench",
        "time": "20 September, 2019",
        "context": "I'll bet Iran is especially thankful for that pallet of cash the Kenyan sent them.",
        "good": "18",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "joed123",
        "time": "20 September, 2019",
        "context": "It’s time to turn Iran into glass.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "DoctorEevill",
        "time": "20 September, 2019",
        "context": "Trump will win in 2020 Iran approves of this message!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "KingFrederick",
        "time": "20 September, 2019",
        "context": "Maybe Somalia will attack Iran with a unproven mega attack with drones.  Sounds good to me.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "vad5",
        "time": "20 September, 2019",
        "context": "Trump doesn't have the back bone to attack...as he didn't have the back bone to serve in Vietnam.....draft dodger",
        "good": "1",
        "bad": "7",
        "replies": []
    },
    {
        "user_name": "putin1",
        "time": "20 September, 2019",
        "context": "MAGA baby",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "putzthedog",
        "time": "20 September, 2019",
        "context": "This story is just wrong, there is defense, just need to have the radars in place and many would be shot down, if not all of them.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Buddypup",
        "time": "20 September, 2019",
        "context": "Did Fox go shopping for an \"expert\" to give them the answer they wanted? Were any drones shot down? Were the Saudi's asleep at the switch? There are a lot of open questions on this attack.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "sender9999",
        "time": "20 September, 2019",
        "context": "Peter Roberts might as well have entitled his article, \"MAD, The Only Defense Against Drone Attacks\".\n\nAnother reason to make sure Iran never has the capability to field a nuclear weapon.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "CyanCandy",
        "time": "20 September, 2019",
        "context": "GAME OF DRONES, did you sit around the news room and have a giggle at your wit? How cringeworthy.  Is this fox news or Mad magazine?...Never mind.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "abraham12",
        "time": "20 September, 2019",
        "context": "As no one has responded in kind to Iran, expect them to do this again soon, but causing greater damage and loss of life.\nAs with Hitler, when you try to appease, the enemy [Iran] just keeps attacking.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "trollsniper101",
        "time": "20 September, 2019",
        "context": "Does anyone remember obama giving a drone away and letting some one land it intact so the could steal our secrets? Wonder how much money super ears got for that one?",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "CoreyDMe",
        "time": "20 September, 2019",
        "context": "Surround these places with Phalanx system for starters. That'll take down a seagull that gets within range.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "GreenShirtGuy",
        "time": "20 September, 2019",
        "context": "It's about time for one of Trump's \"the likes of which the world has never seen before\" statements",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "MD2021",
        "time": "20 September, 2019",
        "context": "What has Trump done concerning Iran...NOTHING.  This is typical Republican, complain complain and complain again but do NOTHING",
        "good": "2",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "YourLeftNut222",
        "time": "20 September, 2019",
        "context": "This wasn't happening with the JCPOA in place.",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "BlueStrawberry",
        "time": "20 September, 2019",
        "context": "\"The only way to stop Iran is to give them lots of cash\" -- B. Obama",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "r.sommer",
        "time": "20 September, 2019",
        "context": "Shouldn't we be using our drones. Iran can't fly their drones if they have none left.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "johnhull",
        "time": "20 September, 2019",
        "context": "Renewable energy would stop the need to invade for oil.  Just sayin'.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Alamadusah",
        "time": "20 September, 2019",
        "context": "A drone is basically an aircraft with either a remote pilot or pre-programmed flight controls.  In either case they are aircraft.  Now I’m suppose to believe we don’t have the technology to shoot down aircraft!  Something don’t make sense here.",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "DeekTom",
        "time": "20 September, 2019",
        "context": "Oh good fox News is taking a different angle warming us up to the idea of why we have to fight a war on behalf of the financiers of 9/11.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "TrumpUNITESus2025",
        "time": "20 September, 2019",
        "context": "Trump to Iran: I don't WANT to kill you. Please don't MAKE me do so. Correct approach.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sydney335",
        "time": "20 September, 2019",
        "context": "Thank you President Trump for showing restraint. Bring our boys HOME! America first!",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Thoughtoftheday",
        "time": "20 September, 2019",
        "context": "Churchill was criticized many times by the Tucker Carlson kindred in the past and Churchill was proven right almost every time.   Bolton will be proven right too.  Trump should have never fired him.  It made America look weak.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "justincase66",
        "time": "20 September, 2019",
        "context": "Still no positive proof as to who sent the attacks.  We don't need another \"weapons of mass destruction\" on our hands again, do we?",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "jamieboi",
        "time": "20 September, 2019",
        "context": "The Green New Deal would stop the attacks. Oil fields will be obsolete and no one would attack a wind mil farm. Hahahahaha, hahahahaha. Just kidding, just kidding!!",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "crueltruth",
        "time": "20 September, 2019",
        "context": "They have their own air force they can do the job themselves",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "PCinsanity581",
        "time": "20 September, 2019",
        "context": "So exactly who are Irans trading partners buying the oil that let's Iran keep its military?",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "CyberTechie987",
        "time": "20 September, 2019",
        "context": "Somehow I believe Democrats are behind the attack! They are desperate, and they have all the motives!",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "vad5",
        "time": "20 September, 2019",
        "context": "Where's GW when you need someone with the back bone to defend American interests.",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "TrumpUNITESus2025",
        "time": "20 September, 2019",
        "context": "Arm the youth of Iran. The mullahs would be gone in days.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "oakborn524",
        "time": "20 September, 2019",
        "context": "I guess the Saudis didn't think protecting their nation's principal source of income was important.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "adrenoreceptor",
        "time": "20 September, 2019",
        "context": "Yes, it can be stopped. With a repeat of Operation Preying Mantis times 1,000.\n\nWithin days we could have Iran's capability crippled on all fronts. Naval, intelligence, cyber, nuclear sites, oil production capacity, airfields and assets. The current maximum pressure economic campaign has them already lashing out irrationally. They wouldn't last a week. No need to even send in any more than special ops.\n\nSad part is, the Iranian people would suffer more than they are now. A good many of the Iranian people are good and decent people who just want a good life like anyone else, and that cant be had under Islamic religious rule anywhere in the world",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "isaiah12",
        "time": "20 September, 2019",
        "context": "Drones can be defeated with surface to air missiles. The Israeli Iron Dome system can take down small rockets that fly at low altitude within seconds.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "MAGATearCollector",
        "time": "20 September, 2019",
        "context": "The right is in a state of mental decay.",
        "good": "0",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "RedSnow",
        "time": "20 September, 2019",
        "context": "Patton had it right ....should have wiped out Russia......",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "11mitnatemlukben",
        "time": "20 September, 2019",
        "context": "In 1989,  George senior,  responded to Iraq invasion of Kuwait,   he did it immediately,  called it the Persian Gulf War,  and did not get permission from congress.  To get congress to approve his war,  he allowed congress to increase middle class taxes,  in order to pay for it.  This is opposite of Reagan who warned about getting involved in the middle east.   \n\nWe are still there.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "smobe",
        "time": "20 September, 2019",
        "context": "I know little about the region honestly, and all the players in their ever changing conflicts.\nWhy do Yemen fighters claim responsibility when the US and Saudi Arabia place the blame on Iran?",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "trollsniper101",
        "time": "20 September, 2019",
        "context": "Bill Deblazio was polling at 0%.... he needed to promise more free stuff!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "BuckFoeJiden",
        "time": "20 September, 2019",
        "context": "Take your Navy Phalanx Close In Weapon System (CIWS) and design ammunition that is basically a shotgun shell on steroids. Should work beautifully with a lower expense in ammunition.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "oakborn524",
        "time": "20 September, 2019",
        "context": "It's easy to achieve air superiority when you have more air assets than your opponent.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "oothebrokeroo",
        "time": "20 September, 2019",
        "context": "Saudi Arabia can defend themselves. As luck would have it, they have money and we have weapons for sale.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "OliveScissors",
        "time": "20 September, 2019",
        "context": "Israel needs to man up.  We shouldn't have to do all the heavy lifting.",
        "good": "1",
        "bad": "3",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "Independent2024247",
        "time": "20 September, 2019",
        "context": "We can pick a time that is right for us to respond, doesn't have to be today or tomorrow but soon. Map every single target out and then carry out a multi pronged attack on the navy, ground bases and do it in one big giant non stop hit from the air and sea. Relentlessly!",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "johnhull",
        "time": "20 September, 2019",
        "context": "There's a good chance this attack was carried out on a nearby hill or home.  Those drones don't have much of a range for fuel or control.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "trollsniper101",
        "time": "20 September, 2019",
        "context": "JUST IN! Bill Deblazio drops out of the presidential race. In other news ? No one knew Bill Deblazio was in the presidential race.....MORE AT 11!",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "JBrickley",
        "time": "20 September, 2019",
        "context": "Yawn... Seems the technology has come down in cost.  We've had the highly advanced Tomahawk cruise missile since 1983. It can fly low to the ground under the radar, make turns, fly around buildings at ground level and hit a target within a couple of meters.  It can go right through a window.  It can also carry a thermonuclear warhead.  Our drones are far more advanced and getting better all the time.  Meanwhile our so called, “Air Supremacy” is unmatched and it's not just \"fast jets\".  No aircraft is a match for the US Air Force, Navy, and Marines. \n\nThe Saudi's have been shooting down just about every missile fired from Yemen using Patriot missiles.  This attack did not come from Yemen, it was launched from the near opposite direction.  These drones and cruise missiles are more advanced than anything used by the Houthi's to date.  The photos show parts of these device recovered from the Saudi oil fields.  It's going to be blatantly obvious who did it.  It will also reveal the nature of these weapons which no doubt we already know about.  There is technology to defend against such attacks but it wasn't installed by the Saudi's.  At least not yet.  \n\nThis is a desperate act by Iran.  They are under crippling sanctions and starting a war is an option open to them. Sanctions are going to get a lot worse shortly. The response is forthcoming.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "WerWeist513",
        "time": "20 September, 2019",
        "context": "The way I see it, all 'some country' has to do is fly some drones into Iran, 'bomb something' of 'someone's secret facilities', cause as much damage as possible, in the shortest amount of time, and no one would know where they came from, from whom they came, or why they came.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Sheepcantread",
        "time": "20 September, 2019",
        "context": "Thanks Barry, for emboldening our Islamic enemies at every turn.  Now, like the results we reaped when Clinton ignored the bombing of the Cole, we will pay a huge price for your actions (capitulations and pallets of cash/inactions (dismissing the Arab Spring) in years to come.",
        "good": "9",
        "bad": "0",
        "replies": []
    }
]