[
    {
        "user_name": "mikedwa",
        "time": "28 June, 2021",
        "context": "Yes we are alone, God made it that way, from dust to dust, look it up. its on the Holy Bible.",
        "good": "1",
        "bad": "11",
        "replies": []
    },
    {
        "user_name": "texgeekdude",
        "time": "28 June, 2021",
        "context": "It's without a doubt that we are not alone in the universe.  Perhaps it is only one cell entities, but the universe is too big for us to be the only lifeform.  However, it is a big stretch to think that we have been 'visited'.  There is no evidence in spite of what all five 'ufologists' bring out.",
        "good": "4",
        "bad": "7",
        "replies": []
    },
    {
        "user_name": "Harrykeepthechange",
        "time": "28 June, 2021",
        "context": "Nancy Pelosi and Hillary Clinton are proof that the lizard people are already here.",
        "good": "42",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "CounterRev22",
        "time": "28 June, 2021",
        "context": "You're fired Bill.  Come back when you have proof.",
        "good": "7",
        "bad": "8",
        "replies": []
    },
    {
        "user_name": "edward5286",
        "time": "28 June, 2021",
        "context": "Bill should know - he is from another planet!",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "Shuman59",
        "time": "28 June, 2021",
        "context": "Nothing new, he has always been a UFO advocate",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Itsmyfuturetoo",
        "time": "28 June, 2021",
        "context": "Well the Bible makes that 100% clear.",
        "good": "0",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "yourkidding016",
        "time": "28 June, 2021",
        "context": "C'mon Bill, didn't you get enough off the gravy train already. ",
        "good": "3",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "hellraiser",
        "time": "28 June, 2021",
        "context": "i have lived in Florida for a long time and he was the senator here for all the time i have been here, trust me he is not alone in his own mind",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tyredcynic",
        "time": "28 June, 2021",
        "context": "He would be blindly optimistic to believe otherwise.\nLook up at the sky and count those stars sometime when you're outside of a city.\nYou think every one of those suns has NOTHING floating around it?",
        "good": "52",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "TheMoth828",
        "time": "28 June, 2021",
        "context": "Kudos to the Fox web layout designer who selected that picture of Nelson...just look at the hand placement, the canted head the slitty eyes...only thing missing is the UFO in which he arrived.",
        "good": "56",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "Dr.AneasTaint",
        "time": "28 June, 2021",
        "context": "We are not alone, and to think we are is foolish. The only question is how many Gods are out there overlording their planets. Is each World assigned a God or do we have just one that is in charge of them all? That would explain some of the waiting around for God to do something.\nAnd if each World has it's very own All Mighty, are all of them required to go through the program and have their Son suffer for the peoples sins? Are all sins the same on every World or does that fall under the purview of said Lord? This has more questions than answers.",
        "good": "5",
        "bad": "10",
        "replies": []
    },
    {
        "user_name": "captnkirk1",
        "time": "28 June, 2021",
        "context": "Nelson has been seeing dead people for years he crazy",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "rwl",
        "time": "28 June, 2021",
        "context": "Of course we are not alone in the universe; His name is Yeshua the Messiah & Yahweh the Creator & Father of us all. And let’s not forget the ‘heavenly host’ & the enemy (we call him Satan, but that’s not his real name) & his demonic hordes.......",
        "good": "9",
        "bad": "2",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "johnboy126",
        "time": "28 June, 2021",
        "context": "Show me where the Bible says that. ",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "oldesalty",
        "time": "28 June, 2021",
        "context": "Based on the fact that there are billions of stars in a galaxy and that there are billions of galaxies, there has to be intelligent life out there.  If so, it would be a first in the universe.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "nightsight971",
        "time": "28 June, 2021",
        "context": "Fact 1 is we have craft flying around with no visible propulsion system. Fact 2 is they like hanging around the ocean. Solution. Put million dollar camera pods on our Navy fighters so we can get a better look at these things.",
        "good": "7",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "billd621",
        "time": "28 June, 2021",
        "context": "This dweebus figures he gets more funding by raising such unknowns!",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "mark3644",
        "time": "28 June, 2021",
        "context": "Nelson said he believes \"we are not alone.\"\nI'd have to say I agree with him.\nWe are not alone.\nI mean, Don lives next door.\nMike works in the office across the hall from me.\nMy wife just sent me a text and said she'll fill up the car on the way home from work.\nI have two kids. (I know, 'cause I put them through college.)\nThat's 6, right there. Not counting Nelson.\nDefinitely, not alone.",
        "good": "6",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "lakeshoredrive",
        "time": "28 June, 2021",
        "context": "\"some lawmakers raising concerns that the objects could be controlled by foreign adversaries potentially posing a national security threat.\"  Loosely interpreted as the democrats looking for move votes.......",
        "good": "13",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "1911¤trp",
        "time": "28 June, 2021",
        "context": "You're not alone Bill... there are 7B people in the universe with you.",
        "good": "2",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "deek1960",
        "time": "28 June, 2021",
        "context": "It's the Tribbles",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "randy478",
        "time": "28 June, 2021",
        "context": "You ever wonder why congress gets such low ratings from Americans? This is yet another example. Do members of congress really think if true an advanced civilization is a threat when all they are doing is monitoring us? Any advanced culture in this universe would have such superior weapons that \"IF\" they wanted to harm us we would already be dead. ",
        "good": "197",
        "bad": "9",
        "replies": []
    },
    {
        "user_name": "trumpfan58",
        "time": "28 June, 2021",
        "context": "If anyone looks like an alien its Bill Nelson and Mark Zuckerberg",
        "good": "9",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "miltonf",
        "time": "28 June, 2021",
        "context": "Zero evidence.",
        "good": "2",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "howaboutme",
        "time": "28 June, 2021",
        "context": "Where has he been? This isn’t anything that hasn’t already been thought of and discussed many moons ago.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "thx1140",
        "time": "28 June, 2021",
        "context": "Whatever life-form they are, they have proved that they are intelligent by NOT contacting humans!",
        "good": "15",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Misscosmo",
        "time": "28 June, 2021",
        "context": "This thing is as old and botoxed as Joe.  Cannot you retire space boy?",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "DanS.",
        "time": "28 June, 2021",
        "context": "\"My feeling is that there is clearly something there.\" Joe selected a genius, yeah there is clearly something there.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "ATCTroll",
        "time": "28 June, 2021",
        "context": "Based on the information already provided on the characteristics of these UFOs, the technology is advance at least 1000 years ahead of that known on Earth.  So I don't believe what is being seen is anything from this planet.  We have been found, and whatever they are, are very interested in us.",
        "good": "13",
        "bad": "2",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "edward5286",
        "time": "28 June, 2021",
        "context": "The only thing Bill Nelson knows is how to hang on to some political office or political appointment!",
        "good": "4",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "iseestorms58",
        "time": "28 June, 2021",
        "context": "Ooo people there is other life out there. Space goes forever and ever. Think about it. If space ended with a wall, what is on the other side??? Or how thick is the wall? Time never began because there always had to be something. ",
        "good": "28",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "rolland",
        "time": "28 June, 2021",
        "context": "Bill Nelson has had those voices in his head for years. It’s not alien life forms, he needs to stay on meds.",
        "good": "1",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "anotherdamlib",
        "time": "28 June, 2021",
        "context": "The odds are we are not alone and the \"others\" are at the same general level of tech.\nWe take months to get to the next planet.\nOf course if they have this fantastic advanced tech and travel billions of light years they will definitly draw circles in our crops.\nStands to reason....",
        "good": "10",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "johncbryant",
        "time": "28 June, 2021",
        "context": "so we, a lesser life form can lock radar on a UFO? yea, I don't think so.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "13thjuror",
        "time": "28 June, 2021",
        "context": "Looks Bill Nelson went to the same plastic surgeon who butchered John Kerry.  ",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ducklk4",
        "time": "28 June, 2021",
        "context": "Congress is clown central.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "howaboutme",
        "time": "28 June, 2021",
        "context": "I remember when I was little someone telling me humans were created by aliens and are just an experiment to see how long it will take them to destroy the planet and life as we know it today. Silly things people come up with…or is it not so silly!!!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "starcrafter",
        "time": "28 June, 2021",
        "context": "We are alone.  God didn't create Earth II.",
        "good": "1",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "hooklineandthinker",
        "time": "28 June, 2021",
        "context": "No Bill, you are not alone....Joe is \"out there\" with you.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "bigd55",
        "time": "28 June, 2021",
        "context": "Nelson correct about other life in the universe, we're not alone........yep, Joe Biden out there somewhere.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "slowchris",
        "time": "28 June, 2021",
        "context": "Okay Bill. Now remember, pants before putting on your shoes.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "gsaogb",
        "time": "28 June, 2021",
        "context": "Lord Shiva created life elsewhere.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "NepaleseTempleBalls",
        "time": "28 June, 2021",
        "context": "If they aimed this new telescope back at Earth they still won't find any signs of intelligent life.\n\nWhat satisfies the definition of intelligent life?\n\nIf we are the measuring bar then it's sitting pretty low.",
        "good": "133",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "mssassypants",
        "time": "28 June, 2021",
        "context": "The Vatican met a few yrs back with heads of different governments and then declared they would be accepting of acknowledging there is life on other planets, as long as it would be considered all from God. When that happened, I knew it was real. ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "holdmybeer2",
        "time": "28 June, 2021",
        "context": "I don't think we are alone either however no one is going to be visiting or us visiting them.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "watson21b",
        "time": "28 June, 2021",
        "context": "Perhaps he is one of them............................abracadabra",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "DeepSleep",
        "time": "28 June, 2021",
        "context": "They Live!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "donaldduck1959",
        "time": "28 June, 2021",
        "context": "Psalm 33:6",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "hoogivesaflynfork",
        "time": "28 June, 2021",
        "context": "Look at that guy...an alien if ever there was one.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "American4truthnjustice",
        "time": "28 June, 2021",
        "context": "Intelligent life forms that are a few hundred thousand years ahead of us in technology, and the understanding of the universe, would have no issue transversing vast distances and knowing our planet is here and occupied. They've been coming here for a very long time already. The evidence is all over the planet and documented in thousands of years of history. This really isn't news to the scientific or military communities. Especially those engrained within certain government's. Some governments openly admit they believe in other world intelligence visiting our planet and are actively investigating. Everything to gain for some.",
        "good": "163",
        "bad": "24",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "error": "error"
    },
    {
        "user_name": "bocon2534",
        "time": "28 June, 2021",
        "context": "What gets me is all these nay sayers talking about what 'THEY' what/who they are. If they were nefarious what has prevented them from doing something bad already? Speculating is just plain ignorant under the circumstances if you ask me !f they were going to do bad stuff why haven't they done it already?",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "mikeymike864",
        "time": "28 June, 2021",
        "context": "This dude looks like an alien, so yeah, I’m becoming a believer.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "foxwatcher1",
        "time": "28 June, 2021",
        "context": "If we aren’t and there are beings from other worlds, I wish they would let themselves be known. I would be very interested in what they think of us. I would love to know their opinion of our politics and who they believe is right and why. They have to be light years more intellectually advanced than we so we would be pretty stupid not to listen to what they had to say. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "burtj399",
        "time": "28 June, 2021",
        "context": "So please explain why they changed the name to UAP?  Is that supposed ot be different than a UFO? Or are we just avoiding google searches these days...",
        "good": "11",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "0211copper",
        "time": "28 June, 2021",
        "context": "Does this mean churches will start paying taxes???\nAbout time! Been freeloading way too long!!!",
        "good": "3",
        "bad": "10",
        "replies": []
    },
    {
        "user_name": "americafirstforever!",
        "time": "28 June, 2021",
        "context": "We probably are being watched as though an experiment of some sort.  Any superior civilization could have destroyed us long ago but they can’t until they collect all the data!   Who knows maybe it’s our civilization from the future trying desperately to keep Biden in office.  That must explain the crazy expenditures and the results of the last election!  One thing is for sure, we are not alone!",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "thisangryguy059",
        "time": "28 June, 2021",
        "context": "He's said that a ton of times.  This isn't news.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jactrac759",
        "time": "28 June, 2021",
        "context": "They never believe in God BUT they do believe in little green men from mars.....or something like in the beginning there was nothing....then it blew up....or aliens seeded us here. \nJust showing us that if they don't believe in God then they'll believe in anything.",
        "good": "25",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "steve781",
        "time": "28 June, 2021",
        "context": "\"But thus far, we don’t have any receipt communication from something that’s intelligent,\" he said. \"\n\nWell don't be pointing it at DC and expect results.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "richiealf65",
        "time": "28 June, 2021",
        "context": "That's not an astronaut. That's Fire Marshall Bill!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "usthunder",
        "time": "28 June, 2021",
        "context": "Most Astronauts have seen them up close. Our moon missions were flanked by them.\nNASA did not want to cause a Panic like Orson Wells War of the Worlds broadcast did",
        "good": "6",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "Registered_Independent",
        "time": "28 June, 2021",
        "context": "My suspicion is we are not alone, but what is lacking is proof. Scientists rightfully set a very high before accepting something as true.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "esween",
        "time": "28 June, 2021",
        "context": "Is it just me or does that guy look like an alien?",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "MrsMom357865",
        "time": "28 June, 2021",
        "context": "We're such a mess down here if they do exist they might wipe us out and take over.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "agbjr57",
        "time": "28 June, 2021",
        "context": "If they're looking for intelligent life they should stay away from DC.",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "WorkerBee370",
        "time": "28 June, 2021",
        "context": "Bill Nelson is right about “We are not alone.” He was definitely dropped off here from somewhere else. Take a look at that face!",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "86benz",
        "time": "28 June, 2021",
        "context": "i think biden is a alien.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "demwits972",
        "time": "28 June, 2021",
        "context": "I'm pretty sure there are aliens too because something extraterrestrial is surely tweaking the minds of democrats to make them act so demented and self destructive.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "AnotherCasualObserver",
        "time": "28 June, 2021",
        "context": "They are not interested in us. They are interested in our oceans. H2O is a fuel for them. We are just another gas station (with sushi!) in the universe. ",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "lukebusy66",
        "time": "28 June, 2021",
        "context": "Nelson was a senator that bumped a real astronaut from a shuttle flight so he could go.  I am not sure but he may have bumped someone who subsequently died on the Challanger.",
        "good": "3",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "ZhouBaiDen",
        "time": "28 June, 2021",
        "context": "If you believe that aliens are watching us, you should be barred from all leadership positions of any kind.",
        "good": "2",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "chairforce",
        "time": "28 June, 2021",
        "context": "How can Nelson be smart enough to be an astronaut and still be a democrat?",
        "good": "15",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "newlife63",
        "time": "28 June, 2021",
        "context": "Yep anyday,  Jesus is gonna' suck those people up to him and zap!  Gone.\nOf course many will say a bad something did it all, follow the science, wait a few years go give people cookies, since money won't matter.\n\nThere may be wonders in the heavens that tease mankind, but it is NOT from God.\nGod is NOT SLACK and HIS grace is sufficient. HE need not stray you away from the WORD.\nNor  does HE delight in Confusing you.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "mickync",
        "time": "28 June, 2021",
        "context": "The leaked videos are the the only reason the government is no longer denying the possibility.",
        "good": "50",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "can't_we_all_just_get_along?",
        "time": "28 June, 2021",
        "context": "Statistically speaking it's almost a sheer certainty that there is intelligent life somewhere out there in the universe.\n\nThe universe has infinite #s of galaxies containing infinite #s of planets but ours is the only one where events unfolded in such a way to facilitate the rise and evolution of intelligent life???\n\nHighly doubtful...",
        "good": "5",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "jcv1953",
        "time": "28 June, 2021",
        "context": "A life form capable of traveling across vast areas of space would be so different from humans that we may have little or no commonality.  \n\nIt could be a mindless microorganism of no interest other than the fact it exists.  It could be a vastly advanced and different organism viewing us of no more interest than we view a flatworm.  \n\nBut it’s fun to think about one way or the other.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "justiceneedsserved",
        "time": "28 June, 2021",
        "context": "When I'm alone in a room there is always some kind of conversation to have between me, myself, and I",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jchjr30",
        "time": "28 June, 2021",
        "context": "oh beavis, we voted you out for a reason. now your back. how much you need to control nasa, 4 billion, 12 billion? they were doing just fine without you, you double dipper.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "don'taskme",
        "time": "28 June, 2021",
        "context": "If anything, think of it as humans checking on the animals out in the wild. We watch and view the wild animals, we drug them and check them out and then let them go. All for science. \n\nWonder how scientists would feel if that was happening to us.....all for science 🤔",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "robincorrnwall",
        "time": "28 June, 2021",
        "context": "Is that the same Nelson that had a genie?",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "xcalubur300",
        "time": "28 June, 2021",
        "context": "Atheists do not hate fairies, elves, vampires, unicorns and Santa Claus because they know they do not exist. It does not make sense to hate what does not exist. \nAtheists hate God because they know He exists.\n© Xcalibur",
        "good": "18",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Messenger12",
        "time": "28 June, 2021",
        "context": "Bill Nelson did not say anything new. He is not allowed to. My contacts in DHS will only reveal to me what I call \"tid-bits\".  The Unknown has always been fascinating to a lot of people.  We must remember , Curiosity killed the Cat.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "earthnative",
        "time": "28 June, 2021",
        "context": "Pretty naïve to think we are the only ones.",
        "good": "13",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "LocoLopez",
        "time": "28 June, 2021",
        "context": "Anyone who believes in little green men needs psychiatric help.",
        "good": "2",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "antiwoke45",
        "time": "28 June, 2021",
        "context": "NASA is looking for something important to do.  Haven't found anything yet.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "bobpies",
        "time": "28 June, 2021",
        "context": "Bring back the UFO acronym.\nU nidentified \nF lying\nO bject\nIt's better than the (UAP).",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "travltexan",
        "time": "28 June, 2021",
        "context": "No...we are not alone.  Our Holy Creator God is with us.",
        "good": "9",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "itsjonny",
        "time": "28 June, 2021",
        "context": "Nelson looks like a 1/2 breed alien so he’d know.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "BlueCoffee",
        "time": "28 June, 2021",
        "context": "The question is not are we alone in the universe?  Of course there is likely much more life in the universe, but that is a mighty big place.  People don['t ask \"why did the chicken cross the Universe?\"   The question is are we alone in our own solar system and in particular on Planet Earth?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Trumplicious",
        "time": "28 June, 2021",
        "context": "The UFO's are from outer space. The government knows that. The UFO thing is too big to hide anymore. The FBI gave Travis Walton and his friends a lie detector test and they passed it. Explain that. Take any one of the popular cases and explain it. The government never says anything on it. Why not?",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bluemax79",
        "time": "28 June, 2021",
        "context": "Nelson has visitors living inside his head.",
        "good": "0",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "jtiwiruyw",
        "time": "28 June, 2021",
        "context": "Odds are that we aren’t alone in the universe.  If life evolved here that means it can evolve pretty easily wherever the conditions are right for it.   Based on the size of the universe and the amount of planets within it you have to reasonably assume it exists somewhere. \n\nThat’s not to say I believe it’s little green men with space ships, but to think we’re the only life that exists in the universe is a more extreme position to me than the opposite.",
        "good": "312",
        "bad": "37",
        "replies": []
    },
    {
        "user_name": "pagamundo",
        "time": "28 June, 2021",
        "context": "Nelson is a Space Cadet",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cc0974",
        "time": "28 June, 2021",
        "context": "It would be pretty arrogant to think that we are the only living beings in the universe, regardless of whether anyone has visited our planet or not",
        "good": "5",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "theconchrepublic",
        "time": "28 June, 2021",
        "context": "Nelson was a lousy dixie crat turned , for survival, a dem,, in Florida,, he got a   political ride  on the shuddle...this guy was the epitome   of southerners  , . we who moved to Florida 40-50 years ago from up north, remember..he knows nothing , and is Florida's Biben..old and extinct",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "RedCoffee",
        "time": "28 June, 2021",
        "context": "No, \n\nbut CNN is rotating around Trump is bad, and need more H1B visas from China",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "teaman654",
        "time": "28 June, 2021",
        "context": "What does Nelson know, he is just a political hack.",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "pinboy446",
        "time": "28 June, 2021",
        "context": "He looks like the alien on close encounters.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "LocoLopez",
        "time": "28 June, 2021",
        "context": "Just another way the government keeps people distracted and entertained. Just like breads and circuses.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "aura2020",
        "time": "28 June, 2021",
        "context": "To believe this universe was created to support earth alone is arrogant. We earthlings are not worthy. Earth is still primitive & bariatric, as far as I can tell. And not only do I believe we are not alone in this universe, I don't doubt there are more universes in addition to this universe. I doubt we the people of this planet have evolved enough or will ever evolve enough to comprehend the higher intelligence of other planets and other universes. That might be the equivalent of explaining how a vacuum works to a cockroach.",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "OrangePuzzle",
        "time": "28 June, 2021",
        "context": "I was told once by an alien that their technology exceeded ours by 172.000 years. Mostly their probes are doing atmospheric research, actual alien 👽 visits are purely for tourism, with that much tech & Wisdom they do not have a dark side, so was told me in 1981 at the Grand Canyon. Never told anyone this before, who would believe it?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "boxrocks",
        "time": "28 June, 2021",
        "context": "Wake up people, there are definitely aliens, flying right over our heads, have you seen the video?  They can destroy us anytime they want.  Hopefully they're held back by a version of the prime directive, and hopefully they will stop any nuclear strikes on earth.  DANGER Will Robinson!!!",
        "good": "0",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "IloveAmerica594",
        "time": "28 June, 2021",
        "context": "I agree , GOD is watching us",
        "good": "5",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "loozerbiden",
        "time": "28 June, 2021",
        "context": "Why would our Creator only settle for bringing life unto Earth? You forget He is a God of wonders and majesty. If there is life elsewhere in our universe,you can bet God created it. But do not be fooled. Those things in the sky? They are manifestations of evil,from the one who rebelled against God and those who followed him. God has a wonderous sense of humor,also. He created the Duckbill Platypus,didn't he? Pay no attention to the demonic UAPs,they thrive on fright and confusion.",
        "good": "2",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "IT_DON'T_MEAN_NUTHIN'!",
        "time": "28 June, 2021",
        "context": "Nelson is right...GOD exists in this universe and others, because He is transcendent.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "SilenceDogood",
        "time": "28 June, 2021",
        "context": "Well, one thing is for certain. If aliens came to earth in search for intelligent life and asked to be taken to our leader............well, five minutes with Joe would have had them laughing all the way back to their vessel as they prepared to continue searching for intelligent life after finding none in the White House.",
        "good": "25",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "LibsStoleWhiteHouse",
        "time": "28 June, 2021",
        "context": "A hundred billion stars make up our own Milky Way galaxy - many of which have now been proven to have their own planetary systems - and hundred of billions of galaxies in the universe.  Of COURSE we're not alone.\nIt's the absolute height of arrogance to believe that out of potentially TRILLIONS of planets out there, Earth is the only one with any kind of life.",
        "good": "24",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "teaman654",
        "time": "28 June, 2021",
        "context": "An alien worm crawled into Biden's brain through his ear.  You can tell by Biden's beady eyes.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "DrDave47",
        "time": "28 June, 2021",
        "context": "For anyone who thinks that we are being visited by alien life, I have an exercise for you.  Watch the video online called \"Powers of 10\".  Here is the problem.  Cellular life appears to have been present on the Earth several billions years ago, so it took those cells several billion years to evolve to the point where we are actually putting out radio waves which other advanced life forms might notice.  That is several billion years.  When you watch the video you will realize how absurdly improbable it is that anyone would have the slightest awareness of us.  We are a speck in a massive universe separated by time and space beyond your imagination.  The chances of anyone being in the exact time frame (much less close enough) to notice our noise is beyond infinitesimal.  Whether or not this has happened anywhere else doesn't matter.  It is absurdly improbable that we would cross paths.  To all intents and purposes we are alone here.",
        "good": "3",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "rtank2",
        "time": "28 June, 2021",
        "context": "Our solar system is under quarantine. This plant is infected with a deadly disease called SIN. Very soon, those faithful to God will be free to travel the universe as the holy angels do, at the speed of thought. The rest of the universe is unfallen, God has made many other  worlds, and after this rebellion is over, he will continue to create.",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "spotonviraat263",
        "time": "28 June, 2021",
        "context": "More like a 100 Years. But if we let LIBERALS remain in government, then it will be a THOUSAND.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "LongTau",
        "time": "28 June, 2021",
        "context": "Memo to Bill Nelson:\nHow about, it's simply mathematically impossible for us to be alone in the universe?",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Truthmaster695",
        "time": "28 June, 2021",
        "context": "If you’ve ever been to a Trump rally you’d know aliens walk among us ",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "northwoodsmilitia995",
        "time": "28 June, 2021",
        "context": "People have been seeing them for years but you called them crazy.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rusty1036",
        "time": "28 June, 2021",
        "context": "If any government knew of evidence that aliens are real someone somewhere would have said something.\nIf there was a Area 51 with a spaceship Donny would have told us.\nThe only aliens that have come to America is coming from south of the border not space!!",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Figmo2001",
        "time": "28 June, 2021",
        "context": "It is a certainty that we are not alone in the universe.  But the universe is a pretty big place.  How big?  Try to imagine how big you THINK it is.  Now multiply that size by a billion.  \n\nNot only is the universe unimaginably big - but is is also unimaginably old.  So time and space are both competing to place an intelligent alien species anywhere near us at this point in time. \n\nThen there is the theory that species will almost always kill themselves off before they are able to solve the problem of intergalactic travel (species will always apply new technology toward weapons before peaceful exploration)\n\nAdd it all up and you can bet some pretty safe money that ET is not buzzing around our skies these days.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "teaman654",
        "time": "28 June, 2021",
        "context": "Why is it so easy for dems to believe in space aliens, but not in God?",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "NancysNastyFlyTrap",
        "time": "28 June, 2021",
        "context": "Over the decades we've often wondered what galaxy Bill came here from.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "koloa",
        "time": "28 June, 2021",
        "context": "Astronaut?  Don't be ridiculous! Nelson went along for the ride the way a non-paratrooper or skydiver goes along on a tandem jump.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "dondiego573",
        "time": "28 June, 2021",
        "context": "I've been saying that for 65 years.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mandyalaska",
        "time": "28 June, 2021",
        "context": "It's about time we get some scientists to look at the data.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "robincorrnwall",
        "time": "28 June, 2021",
        "context": "Bermuda Triangle or just a boatload of Dems trying to prove the earth is flat.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "jimbob11",
        "time": "28 June, 2021",
        "context": "With our universe being 15 billion years old, what if another planet had life started a few hundred million years earlier than earth.   Be consistent with what's been seen lately.",
        "good": "25",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "HomeIsTexas",
        "time": "28 June, 2021",
        "context": "Aliens searching for intelligent life would by pass earth....",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "iceman#1",
        "time": "28 June, 2021",
        "context": "That would explain where The Squad came from...",
        "good": "6",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "CyanCar",
        "time": "28 June, 2021",
        "context": "The UFO's are the safari buses and we are the wildlife.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ogcstd7006",
        "time": "28 June, 2021",
        "context": "We are not alone. There is God and His Angels, as well as Satan and the fallen Angels. But no \" little green men\" anywhere.",
        "good": "4",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "stenniz803",
        "time": "28 June, 2021",
        "context": "CLEAR PICTURES PLEASE!!! You can put a vehicle on the moon and Mars and send back clear pictures but you cant take a clear picture of Aliens",
        "good": "7",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "RedWave22800",
        "time": "28 June, 2021",
        "context": "The small UFO's , if extraterrestrial, likely are drones. However, lacking a \"mother ship\" nearby, must have mastered travel at light speed, via wormholes, or through time all of which great minds theorize is possible. It is very possible humankind is so primitive (ya think) that advanced entities don't quite know what to think of us. They are just looking.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dachshundsrule",
        "time": "28 June, 2021",
        "context": "First intelligent thing this man has ever said.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "northwoodsmilitia995",
        "time": "28 June, 2021",
        "context": "Their already here they're called democrats.",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "usawillneverdie",
        "time": "28 June, 2021",
        "context": "Only a vey closed minded person would feel we are alone.  To quote Carl Sagan if we are alone it's an awful waste of space.",
        "good": "6",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "SlimJim22",
        "time": "28 June, 2021",
        "context": "Why would we be so arrogant to think we are? Billions of stars in a massive universe and we think we are the only planet near a star with conditions that can sustain life? There could be millions of similar conditions",
        "good": "1",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "proud2bprivelidged",
        "time": "28 June, 2021",
        "context": "Mel Gibson said in a movie that a good conspiracy is impossible to prove.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Covidcandy",
        "time": "28 June, 2021",
        "context": "they came saw Pelosi and said the check with you and went home",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "abetterdaycoming",
        "time": "28 June, 2021",
        "context": "I believe in God...and I don't believe we can justly assume he would create such a limitless space...for only one populated speck of dust we call Earth...",
        "good": "7",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "retirednavandmad604",
        "time": "28 June, 2021",
        "context": "Nelson has always been a “space cadet.\nNot sure who has the worse dementia, Biden or Nelson?",
        "good": "5",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "Sammies",
        "time": "28 June, 2021",
        "context": "An alien pusher trying to set up a fraud for when Christ returns to take His own.",
        "good": "4",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "htownoscar",
        "time": "28 June, 2021",
        "context": "Is it just me or does he look like a space alien?",
        "good": "4",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "CPO(SW)ret690",
        "time": "28 June, 2021",
        "context": "Odds are we won’t survive ourselves anything else really doesn’t matter",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "whatnowcornpop",
        "time": "28 June, 2021",
        "context": "As Voyager leaves our galaxy it may begin to see things that we once thought impossible.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "TexLancer",
        "time": "28 June, 2021",
        "context": "Bill Nelson is a moron!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "iamgroot",
        "time": "28 June, 2021",
        "context": "True and false. Yes, there are other intelligent beings in the universe. No, they are not aliens……\nAngels all around us, including the fallen ones.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "jackfromjax465",
        "time": "28 June, 2021",
        "context": "Bill Nelson, a has been Senator and is a real Space “Cadet” and looking to being “beamed up”🤣",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "TambourineMan508",
        "time": "28 June, 2021",
        "context": "Any thinking person who understands anything about the sheer numbers that make the universe KNOWS there is other life out there. It’sca mathematic certainty!",
        "good": "4",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "notacalifornian",
        "time": "28 June, 2021",
        "context": "ET is watching.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "LordDixon",
        "time": "28 June, 2021",
        "context": "There were UAP's in the 30's and 40's as well. They weren't that threatening. As powerful as their weapons were they could only fly around in rocket shaped ships and wore silver suits that if they were torn they couldn't survive earths atmosphere. Then their silence advanced while ours moved more slowly. They traveled to earth from distant planets in saucer shaped ships that didn't shoot fire to thrust the ship through space. We have yet to discover their energy source. Now they are so advanced they have large armadas and they can live for years in space. Their weapons could destroy the entire earth in the blink of an eye. Congress is right to consider this threat before we get obliterated.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "chiefsbrat",
        "time": "28 June, 2021",
        "context": "Okay, we probably are not.\nDoes not mean any UFO is flown by short green non-binary explorers that go by they/them.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sao_kirito",
        "time": "28 June, 2021",
        "context": "Elvis was an alien\nand the King left us a while ago\nnow with open borders\nthere are so many other aliens",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "oldasdirt023",
        "time": "28 June, 2021",
        "context": "Of course we are not alone. There are thousands of trillions of stars in our universe.",
        "good": "8",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "OrangeFries",
        "time": "28 June, 2021",
        "context": "I think they need to release the classified report.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "🧇altereggo🧇",
        "time": "28 June, 2021",
        "context": "Pentagon seems to think we are. Every time they say they are going to release “ The evidence “ it becomes a jerk around. \n\n“Well we don’t know the evidence is inconclusive”",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rjo",
        "time": "28 June, 2021",
        "context": "Other sentiment life in the universe, most definitely. But I seriously doubt they’ve been here. God created the stars of this distance for a very good reason. It wasn’t to keep them from us it was to keep us from contaminating the rest of the galaxy. Humanity it was probably the only sentiment species that defied God.",
        "good": "0",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "FibMcgee",
        "time": "28 June, 2021",
        "context": "With billions of separate and distinct galaxies. each with billions of stars with planets, it's a statistical certainty that life exists somewhere else.\nNothing unique about us.",
        "good": "75",
        "bad": "12",
        "replies": []
    },
    {
        "user_name": "justinthyme1786",
        "time": "28 June, 2021",
        "context": "Ever see the movie... They Live? \n\nThat's Pelosi\n\nObey!",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "steve1633",
        "time": "28 June, 2021",
        "context": "There very well may be intelligent life elsewhere in the universe, but since lefties have taken over in many countries of the world, there doesn't seem to be much intelligence here on planet Earth anymore.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "Pershing15e",
        "time": "28 June, 2021",
        "context": "You can \"believe\" in the existence of extraterrestrial life in the universe all you want.  But the question is academic since it is nearly impossible that humanity will ever reach far enough out to be in contact with it during our existence as a species.",
        "good": "4",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "1836T",
        "time": "28 June, 2021",
        "context": "How simple do you have to be to think we are the only life form in the vastness of space?",
        "good": "4",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "udontknowjackr",
        "time": "28 June, 2021",
        "context": "Trump did it its his fault",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dirtclod",
        "time": "28 June, 2021",
        "context": "Believing that life exists elsewhere is an act of faith, just sayin’.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "NMForFreedom",
        "time": "28 June, 2021",
        "context": "There are too many unexplained instances that point to the high possibility of other highly intelligent life forms out of our sphere or galaxy.  Too bad we don't have intelligent life forms in the White House!",
        "good": "9",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "understandthis",
        "time": "28 June, 2021",
        "context": "He looks like an alien",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mtnbikguy",
        "time": "28 June, 2021",
        "context": "Earth was established as a penal   colony for the Milky Way galaxy, which explains a lot 😬",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Biden=crook",
        "time": "28 June, 2021",
        "context": "of course we are not it would be ridiculous for us to think so",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "drheywood",
        "time": "28 June, 2021",
        "context": "The only good thing I can say about Biden is his commitment to exploring the solar system. I've read in countless articles that ever since the election Biden has done nothing except take up space.",
        "good": "18",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "really???240",
        "time": "28 June, 2021",
        "context": "Eek! He kinda looks Alien himself!!!",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "narivaboy12",
        "time": "28 June, 2021",
        "context": "Bill Nelson says he doesn’t think we \"are alone\nI don't know Billy boy- but I think that he is wrong.- Now prove me to be incorrect.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Misscosmo",
        "time": "28 June, 2021",
        "context": "A 78 year old man should have some sag and winkles!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "OrangeWheel",
        "time": "28 June, 2021",
        "context": "With over 200 billion stars in our Milky Way Galaxy, with over 100 billion galaxies identified by Hubble in the known universe, and an average of at least 2 planets per star with an unknown average # of moons, you really think we are the only life out there? Now whether they are flying around in really fast Tic Tacs is another thing.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "heaintheavy",
        "time": "28 June, 2021",
        "context": "Is this the same guy that served in Vietnam but really didn’t?",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "PeterBravo545",
        "time": "28 June, 2021",
        "context": "Mr Nelson, when in God's name did you finally wake up to the fact about \"others\" in the universe. It's so strange to me as to why you so called \"follow the science god\" followers  have not read with vigorous interest the Holy Bible. Therein is more  facts about our universe than you will ever learn from your secular studies. Start with the very first book of the bible , he book of Genesis,  there alone is a lifetime study of facts that will really blow your mind. Facts that make science fiction a child's story. We dedicated Christians  find in our studies so much joy of learning what our creator Jehovah God has done millions of years past and what He has planned for us  in the near and far future. Read it sir with a spiritual  mind , only available thru salvation....pb",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "netbetwin",
        "time": "28 June, 2021",
        "context": "Democrats are drawing up voting and tax plans for ET. ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "chachi01",
        "time": "28 June, 2021",
        "context": "looks kinda like an alien himself ",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dickhurtz530",
        "time": "28 June, 2021",
        "context": "With all of his face lifts, botox, and other stuff, Nelson is looking like something from another planet.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "fleendarthemagnificent",
        "time": "28 June, 2021",
        "context": "It would be ridiculous to believe that with the infinite vastness of the universe, and the billions of star systems, stars and planets out there, that we and the animal / plant life on earth be the only life forms in existence in the universe. While we still have no concrete evidence, I do believe that there's other life out there. It may not be more advanced than microbes, but there's life somewhere out there.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "human454",
        "time": "28 June, 2021",
        "context": "Given the vastness of the Universe, the chances that we are 'alone' are next to zero. The fact that we don't have concrete evidence of extra terrestrial 'life' means nothing. Alien civilizations who have the technology to reach Earth are probably avoiding us given how relatively dumb our civilization may be.",
        "good": "6",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "pacificdreams",
        "time": "28 June, 2021",
        "context": "Are we that arrogant to think we are the only life in the universe?\nConsidering the advancements we made in the last 100 years, imagine a species with a 5 million year head start.",
        "good": "6",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "Mr.Daddy",
        "time": "28 June, 2021",
        "context": "We are here...................are we so arrogant to assume we are the only creatures in this universe?",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "pootyspuppet",
        "time": "28 June, 2021",
        "context": "Wow ... Profound statement .... Considering there are over 100 billion galaxies and 500 septillion stars ....  in the \"observable universe\" I'm glad Nelson went out on a limb here .... However, for an alien life form to actually find earth in an ever expanding universe would be very impressive ... If you threw a grain of sand somewhere in the Pacific ocean and then tried to find it the scale of ocean and grain of sand would make the ocean10 billion times bigger to compare to the size of the universe.  Good luck!",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "error": "error"
    },
    {
        "user_name": "NationalJester",
        "time": "28 June, 2021",
        "context": "If this is a technology that our adversaries currently possess, we would already be under their direct authority. Which explains why Biden is now President.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "airpatriot",
        "time": "28 June, 2021",
        "context": "All these space craft have no discernable propulsion, defies gravity going up down sideways in the blink of an eye, transverses air to water, breaks sound barrier with no boom, has no wings..\n\nThis is pretty much my cat's description of me teasing her with a laser light.\n\nPerhaps this is an advanced projection system where pilots can see the object and it is fooling the radar systems.  This would tick all the boxes.\n\nIf it were our adversaries: They would not be messing around with us, but instead leveraging it strongly to change the worlds power structure.\n\nIf it were aliens and they are SOOO advanced, how do they keep making mistakes and getting sighted?\n\nIf they are super advanced they would have two simple questions - Can we consume you, can you consume us?\n\nIf it were aliens and they are only a bit more advanced, why would they not just come visit us directly, drop down an interactive probe to try and interact with us?",
        "good": "6",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "glamferal",
        "time": "28 June, 2021",
        "context": "Why do the aliens only go to America?",
        "good": "3",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "Mr.Daddy",
        "time": "28 June, 2021",
        "context": "Those aliens better get ready........................\"ol Joey 2 Fingers and his Ho\" are gonna raise their taxes",
        "good": "8",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "trumptard556",
        "time": "28 June, 2021",
        "context": "It's so funny when so-called experts refer to \"other intelligent\" beings in the universe. That assumes homo sapiens are intelligent. Compared to your average dung beetle, perhaps but compared to other beings in the universe, we may very well be the dung beetles. \nI believe there are intelligent extra-terrestrial beings, but the jury is still out on homo sapiens. If I were the ET's, I'd exploit the natural resources of this planet, while the indigenous creatures (us) are none the wiser and never reveal their presence.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "PKTeamMember",
        "time": "28 June, 2021",
        "context": "If astronomers can spot relatively small asteroids still months away and heading to the vicinity of earth, they would spot space ships.  Oh, wait -- the space ships are invisible and don't have any mass to detect, right ?  Or they're all under threat from the government, right ?",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "teazle1",
        "time": "28 June, 2021",
        "context": "I think most people believe we are not alone in the universe. \nWhat most question and debate is are we alone in our solar system?",
        "good": "3",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "right_to_be_right",
        "time": "28 June, 2021",
        "context": "We need to find evidence of intelligent life here before we can look for it elsewhere.",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "nightsight971",
        "time": "28 June, 2021",
        "context": "Oh god I hope they bring back Elvis!!!",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Headed4Heaven",
        "time": "28 June, 2021",
        "context": "This is actually Good News for Christians! It means the rapture of the church is imminent. UFO's are just the deception non-Christians will need to explain the sudden disappearance of all Christians. Non-Christians will refuse to believe that God pulled the Church out, so they will need some other explanation...aliens.  They will believe aliens took the Christians out of the world because we are restraining the anti-christ.  Non-Christians will think the anti-christ is the answer. That is until they begin experiencing the wrath of God.  Christians are not appointed to wrath, which is why God will take out Christians before pouring down His judgement on the unrepentant people of this world. I suggest everyone get a Bible and start reading it.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "PurpleHammer",
        "time": "28 June, 2021",
        "context": "In my fathers house are many mansions........... John 14.",
        "good": "7",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Geschichte",
        "time": "28 June, 2021",
        "context": "IMHO, sound judgment by former Senator Bill Nelson. I won't hold against him that he identified as a DNC operative.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mcianf8643",
        "time": "28 June, 2021",
        "context": "Look at Venus, Earth's twin. Same Terrain, Mountains, Valleys and water. Taken by Natural Climate Change with a turn of the Sun's Axial Tilt.  As is happening here.",
        "good": "4",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "prouduscitizen",
        "time": "28 June, 2021",
        "context": "The Universe is so huge its impossible for the Human mind to grasp. Distance and size are beyond our capability to comprehend. Of course there is life in the Universe, we are not that special.",
        "good": "7",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "nightsight971",
        "time": "28 June, 2021",
        "context": "Makes complete sense for them to hang out in the ocean. This is so cool...... unless they are mean. Thankfully it appears to be pure observation......... for now. Welcome to Earth aliens!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "teazle1",
        "time": "28 June, 2021",
        "context": "When aliens were probing Joe Biden, he politely asked not to use one finger, but 3.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "satellitecoffee",
        "time": "28 June, 2021",
        "context": "God is everywhere repent of your sins and be reborn from human original flaws. It’s so easy to fall in love, b begin your eternal life!",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "jtbest01",
        "time": "28 June, 2021",
        "context": "We’re not alone, God is alive and well. Nothing new to me.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "pkt326",
        "time": "28 June, 2021",
        "context": "I doubt there is any serious scientist who believes we're \"alone\" in the universe.  Life is likely very, very abundant and that includes intelligent life which may be rare but is definitely most likely out there.  The problem is distance and physics.  Unless an advance race has somehow figured out how to get around going faster than light or using a wormhole interstellar contact is unlikely.  We are basically the Podunk of the universe sitting on an isolated arm of the Milky Way away from where all the action is.  Unless an alien version of a broken down bus looking to repair a flat tire takes our particular offramp we're probably not even on the map.  As for the spate of UFO sightings, well, with all the high-def cameras we have now even in our cellphones I really would like to see a better picture than blurred black and white images.  I'm inclined to believe we're seeing glitches or technology using spoofing to fool our radar.  That is concerning but it's doubtful it's ET doing it.",
        "good": "7",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "thereckoning(Rev.16:11)",
        "time": "28 June, 2021",
        "context": "Arthur C. Clarke (2001: A Space Odyssey) once wrote that there are 2 possibilities -- either we're alone in the universe or we're not -- and both are equally terrifying. I disagree. The second is much scarier.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "godblessedtexas",
        "time": "28 June, 2021",
        "context": "It is a statistical certainty that we are not alone. The big question is whether or not ET has bothered to visit us.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "whathasbecomeofus",
        "time": "28 June, 2021",
        "context": "Who is to say that these beings aren't of a different dimension?  Life in the universe, doesn't necessarily mean life just like us.  \nI am open to many theories.  There are too many billions of years, and billions of stars out there to discount space and time travelers.  \nSome solar systems are billions of years ahead of us and others are billions of years behind us.",
        "good": "101",
        "bad": "12",
        "replies": []
    },
    {
        "user_name": "hogslayer950",
        "time": "28 June, 2021",
        "context": "there are aliens, they identify as liberals",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "maxinestaxadermist",
        "time": "28 June, 2021",
        "context": "What would the universe be without Klingons?",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "maxinestaxadermist",
        "time": "28 June, 2021",
        "context": "Hope there is intelligent life somewhere because there is not much of it on this planet.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "maxinestaxadermist",
        "time": "28 June, 2021",
        "context": "Big Mike is a Klingon.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mikeb.434",
        "time": "28 June, 2021",
        "context": "If \"aliens\" are checking us out and have observed the white house\nThe conclusion would be no intelligent life here on earth",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "DamnItJimImJustACountryDoctor!",
        "time": "28 June, 2021",
        "context": "I agree with the general idea that we are not alone.\nThe universe is too big for what happened here to not have happened elsewhere.\n\nAnd I'll admit the possibility that they are coming here.\nBut I think this is unlikely.",
        "good": "3",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "keithlongusa",
        "time": "28 June, 2021",
        "context": "You could get a satellite signal from Nelson's face. Gotta lay off the plastic surgery man...",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "goingoncegoingtwice",
        "time": "28 June, 2021",
        "context": "Nelson is proof itself that aliens  do exist.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "elmerwallace",
        "time": "28 June, 2021",
        "context": "NASA Administrator Bill Nelson says he doesn’t think we \"are alone\" after reading the US intelligence community’s recent report on unidentified aerial phenomena (UAP)...\n\"Journalism\" at its worst.  Find his interview with CNN and watch it for yourself.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "CharlieRunkle776",
        "time": "28 June, 2021",
        "context": "We are alone. Climate change has wiped out all life on other planets.",
        "good": "2",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "deserteagle69",
        "time": "28 June, 2021",
        "context": "The universe is very big, so it the chances are high.  But they are also so far away chances of contact is very low.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "johnnybags2469",
        "time": "28 June, 2021",
        "context": "Let’s hope they see how messed up life is down here and they get out while they can",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "taser317",
        "time": "28 June, 2021",
        "context": "Duh.  With all the billions of planets there is zero chance we are alone.  In fact the odds are we are not even leading the pack in technology.  I am sure there are worlds where the intelligent life forms work together as a team....",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "error": "error"
    },
    {
        "user_name": "123redlight379",
        "time": "28 June, 2021",
        "context": "I believe Bill is one of the Aliens.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "$hillbilly$",
        "time": "28 June, 2021",
        "context": "Look at bill Nelson and tell me he’s from this planet? Really?",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "OliveWeights",
        "time": "28 June, 2021",
        "context": "How profound.  Announcing something every three year old has known for years.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "scottj",
        "time": "28 June, 2021",
        "context": "Just imagine the tranquility of a planet that is devoid of democratic ideology, where everyone pulls their weight and doesn't expect handouts who are able bodied, oh what a wonderful  world it would be.",
        "good": "21",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "irish_jack203",
        "time": "28 June, 2021",
        "context": "It's God, He's having the angels check things out. For the time being everybody should be good and maybe we won't stir up his wrath. Remember, he promised he would never destroy earth again. It was too awful. He's leaving it up to us through fire and brimstone. I often wonder how he knew way back then we were capable of that. Anyway, just be good and it will be OK.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "nightsight971",
        "time": "28 June, 2021",
        "context": "Do yall think our wars involving religious beliefs will end when the aliens pop their heads out? It took me 30 years being a cop and seeing senseless death to lose my faith, but I still hang on to maybe God is just busy because he created billions of worlds with life. He's not always here. ",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "imrightyourwrong816",
        "time": "28 June, 2021",
        "context": "Earth is about 4.5 billion years old and that the universe is 13.5 billion years old. I’m pretty sure there’s a couple of planets/civilizations out there about 10-11 billion years old that can run rings around us. They probably think of us as crude monkeys.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "DamnItJimImJustACountryDoctor!",
        "time": "28 June, 2021",
        "context": "To Rigel a beam was projected.\nYears later, an answer detected.\nWhen finally translated\nThe message had stated\nWe're sorry, that line's disconnected.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rexkarrs",
        "time": "28 June, 2021",
        "context": "they will never contact us they would be afraid that humans would start a war with  them and then we would send Priests to convert them to Christianity",
        "good": "0",
        "bad": "5",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "ACMEProducts",
        "time": "28 June, 2021",
        "context": "Thanks to liberals, any alien force would deem us too primitive and not worth the effort to conquer.",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "49ford",
        "time": "28 June, 2021",
        "context": "Only human arrogance would believe we are alone in the universe.  Questions is what would other life look like?",
        "good": "6",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "bubbafrombrooklyn",
        "time": "28 June, 2021",
        "context": "Well I guess we now know why Biden is whispering to the press.....",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jsuehrxi",
        "time": "28 June, 2021",
        "context": "The Russians, Chinese and Americans have been experimenting with alternate flying technology since the end of WWII.  I can't find it now but there is video out there showing the USAF testing a \"flying saucer\", although the only thing they could get it to do was hover before losing control and having it crash.   That was 1950.   But the Chis's and the Rus's don't want us to know about their tech and vice versa. The stuff the Navy cant' seem to get decent video of ( or  anyone else for that matter) is probably drones?  I dunno, but E.T. seems unlikely.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Sabata",
        "time": "28 June, 2021",
        "context": "Well, if the aliens are searching for intelligent life, they won't find it in the White House or Nancy Pelosi's house.  They can find it at Mar-A-Lago but they won't get that information from any social media.",
        "good": "3",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "JaneSmith528",
        "time": "28 June, 2021",
        "context": "He looks like he could be from another planet! Yikes!  ",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "johne37179",
        "time": "28 June, 2021",
        "context": "Maxine Waters is absolute proof of that.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "phillywilly",
        "time": "28 June, 2021",
        "context": "The truth is out there",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "alexxx888",
        "time": "28 June, 2021",
        "context": "What proofs do you have, Nelson?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "alexxx888",
        "time": "28 June, 2021",
        "context": "I BELIEVE covid virus escaped from Chinese lab...Much more likely.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "stevesg",
        "time": "28 June, 2021",
        "context": "They Live!",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "vic740",
        "time": "28 June, 2021",
        "context": "To accept that\nWe Are Not Alone.\nTo me it is not hard to accept that LOGIC.\nOther humans would have to set aside their ARROGANCE.\nFor some humans with Titles in front of their names tags that is not so EASY to accomplish.\nI see that within the company i work some employees think they can\nWALK ON WATER.\nYou get the picture.",
        "good": "11",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "tjl49779",
        "time": "28 June, 2021",
        "context": "When you consider the enormous size of the universe, it would be reasonable to conclude there are other life forms in this vast universe.",
        "good": "84",
        "bad": "9",
        "replies": []
    },
    {
        "user_name": "prouduscitizen",
        "time": "28 June, 2021",
        "context": "In November 2013, astronomers reported, based on Kepler space mission data, that there could be as many as 40 billion Earth-sized planets orbiting in the habitable zones of Sun-like stars and red dwarfs in the Milky Way, 11 billion of which may be orbiting Sun-like stars. The observable universe is estimated to contain 200 billion to two trillion galaxies\n\n\nCome on folk, really?",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bobby408",
        "time": "28 June, 2021",
        "context": "Why are Big Foot sightings and UFOs sightings similar? They both have unintelligible grainy photos and videos that no sane person would take seriously.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "right_to_be_right",
        "time": "28 June, 2021",
        "context": "Why is the Pentagon and the White House in bed with the media trying to reinvigorate this decades old garbage with their seedy, grainy photos and complete lack of meaningful evidence of anything? What kind of a diversion is this, and why?",
        "good": "7",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "SSN591",
        "time": "28 June, 2021",
        "context": "Bill Nelson couldn’t convince me that snow is cold.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sarasotadave",
        "time": "28 June, 2021",
        "context": "Seems like the media is obsessed with calling Bill Nelson a former astronaut. He's a attorney/politician just like most of the other slimy people in Washington DC. Just because he was a token payload specialist on ONE shuttle flight, he is still capable of walking under the belly of a snake!",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "rccgto",
        "time": "28 June, 2021",
        "context": "Click bait. Of course there are other intelligent beings in the Universe. But tell me, which one or ones of the billions of galaxies are they in? And then, once that is narrowed down - in which one of the solar systems in that galaxy? Do you know there are more Stars like our Sun, than there are grains of sand on all of earth? Think about that for a minute.  The problem is that interstellar space flight is near impossible. At the speeds we can currently attain in space, it would take us to get to the closest star, which is Proxima Centauri - about 6,300 years. Who's signing up their kids?",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "newsfreak2",
        "time": "28 June, 2021",
        "context": "I was skeptical until I read the book, \"The Day After Roswell \" ! The part that caught my attention was the wording concerning Star Wars, alluding to the fact that based on Reagans conversations with Russia, it was agreed both we and Russia and the rest\nof  our world faced a common threat ,  from outside. The recent establishment of \nthe SPACE FORCE adds weight to that history ! It has been made clear, the next war will be a SPACE war ! The enemy  !!??? Time will tell !",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "ndamix375",
        "time": "28 June, 2021",
        "context": "Why would anything smart enough to engage in space travel want to stop here?",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "JWWhelan",
        "time": "28 June, 2021",
        "context": "Don’t know, but I agree with Hawking’s assessment of a species meeting another vastly more advanced species. It never works out good for the more primitive species.",
        "good": "12",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "WhitePrivilege951",
        "time": "28 June, 2021",
        "context": "Well now I feel better .",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "jsuehrxi",
        "time": "28 June, 2021",
        "context": "So you take out the trash and notice ants out there and think, \"hmmm, ants\" and you go back inside.  E.T. flies over Earth and thinks, \"hmmm, ants\" and continues on his/her way.  The point being,  they haven't stopped in to say \"howdy\".  Or maybe they a) saw us wipe out 500,000 of our own kind to end WWII, b) saw all the space junk and thought, \"nothing for us here\" and thought it not worth the time/energy to stop, c) both a and b.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tomg698",
        "time": "28 June, 2021",
        "context": "Nelson proves that \"There's no fool like an old fool\".",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "gordo69",
        "time": "28 June, 2021",
        "context": "Proxima Centauri is 4 light years away. If one could travel the speed of light (which is impossible) it would take 4 years to get to our closest neighbor and if we strike out there we would have to go another 2 light years to get to the next star (Barnard's Star) that just might have planets in it's system. In simpler terms traveling at 8,500 miles a second it would take about a hundred years to get to PC.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "idon'tknow810",
        "time": "28 June, 2021",
        "context": "YOU GOT THAT RIGHT!!!!!! WE ARE NOT ALONE! LOOK AT THE ALIENS IN THE WHITE HOUSE... NEXT!",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "GreenBone",
        "time": "28 June, 2021",
        "context": "Alien chicks are hot.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "theconchrepublic",
        "time": "28 June, 2021",
        "context": "Passenger / politician/ dixiecrat",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Whattheh3ll",
        "time": "28 June, 2021",
        "context": "One look at senator Nelson and I believe we are not alone. Lol",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "lgem",
        "time": "28 June, 2021",
        "context": "Space is fake. We live on a flat earth. These \"elites\" are all liars.",
        "good": "3",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "doubleneck",
        "time": "28 June, 2021",
        "context": "Xenomorphs",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Say.it.aint.so.joe642",
        "time": "28 June, 2021",
        "context": "the guy was a 🤡 as a senator, a lazy old do nothing...is why he was booted out.  now pal Biden appoints the same 🤡 to head NASA.  HILARIOUS.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "123redlight379",
        "time": "28 June, 2021",
        "context": "😅🤣😂 We can’t talk amongst ourselves. So how is this alien thing going to work out?",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "nightsight971",
        "time": "28 June, 2021",
        "context": "I hope when we hit the space lanes we use Earth's other name to identify ourselves to aliens. Terra is so much better. Earth is anglo saxon for dirt. Terra is latin for earth. Terrans sounds better than Earthlings.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tho193",
        "time": "28 June, 2021",
        "context": "Christianity in general, and the Catholic church in particular has been saying the same thing for 2021 years. Miracles are have been around for a long time.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "maxinestaxadermist",
        "time": "28 June, 2021",
        "context": "In space, no one can hear dem-nazis scream racist.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "ReadyOnTheRight?-ReadyOnTheLeft?",
        "time": "28 June, 2021",
        "context": "If there's other life in the universe, we'll never see it.",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "jimsmall336",
        "time": "28 June, 2021",
        "context": "There is zero scientific evidence that life exists anywhere outside of our planet.  \nThere is zero scientific evidence of how life originated on our planet.\nThere is zero scientific evidence that UFO’s are designed spacecraft.\nThere is zero scientific evidence our planet has ever been visited by space aliens.\nPeople have been looking for such evidence for a very long time.\nScientific evidence doesn’t care about your feelings, your beliefs, or your opinions.\nI’m old and I want desperately to see real evidence of any of this before I die.\nBut my biological clock is on super speed now racing to the end of my time on this planet.\nPlease, please, please find something I can take with me to that silent land where I’m going.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "gopherwrangler",
        "time": "28 June, 2021",
        "context": "We’ll probably never a being of equal or greater intelligence in our lifetime.  There is definitely life out there, but they’d have to be able to create a wormhole in order to get around the distance and nothing is faster than light problem.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ol’boolobster🦞",
        "time": "28 June, 2021",
        "context": "Gotta wonder how they made a space helmet big enough to enclose that melon 🍈",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "razecs",
        "time": "28 June, 2021",
        "context": "\"We are already finding examples of other planets around other suns,\"\n\nAnd that means what exactly?\n\nYou can hear most of the folks on Science Channel, like Tyson and others, talk about the Goldilocks Zone repeatedly on episodes because people are drawn into it. But they always say they \"believe\" or they \"think\". \n\nJust like the Drake Equation they are all based on our favorite \"scientific\" word, assumptions.",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "unapologeticallywhite820",
        "time": "28 June, 2021",
        "context": "“Science” and engineering used to believe that the sound “barrier” couldn’t exceeded either.\nThey were wrong.",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "inbox",
        "time": "28 June, 2021",
        "context": "is he the alien from men in black? ",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bm60dd",
        "time": "28 June, 2021",
        "context": "If it has intelligent life we should let them in to teach at schools including colleges and elect them mayors in our large cities with Democrat Mayors",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Banzai475",
        "time": "28 June, 2021",
        "context": "So did Senator Nelson reveal classified information that military pilots were able to “lock on” to the UFO? Probably… he is, after all, a politician. So if his info is accurate, and he’s not just making stuff up like Biden does, then the UFOs are definitely man-made. I can’t fathom aliens with interstellar technology would actually allow our primitive radar to actually achieve a lock. My Vegas money is on the Chinese.",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "Goodday419",
        "time": "28 June, 2021",
        "context": "Well, he should know. He is a martian ",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "johndoesr",
        "time": "28 June, 2021",
        "context": "Nelson is definitely a space cadet...........",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Catman956",
        "time": "28 June, 2021",
        "context": "Didn’t you see Independence Day?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "californiamojo",
        "time": "28 June, 2021",
        "context": "It would be pretty weird if we were the only life in the universe",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "qta",
        "time": "28 June, 2021",
        "context": "I've known for a long time that we're not alone in the universe. There is no way that so-called people like Pelosi ,Schumer and Biden could come from this planet. They come from a planet called bizarro world 🤪🥴",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jpkj410",
        "time": "28 June, 2021",
        "context": "Biden wants 10%.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ol’boolobster🦞",
        "time": "28 June, 2021",
        "context": "Bill Nelson looks like his skin suit is slightly askew. Never trust someone named Bill.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "#lockdiaperdonup!!...bigly.",
        "time": "28 June, 2021",
        "context": "\"Someone needs to check Senator Rick Scott's birth certificate.....I'm pretty sure that freak wasn't born in this Solar System, LOL!!!\"- Bill Nelson",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Sabata",
        "time": "28 June, 2021",
        "context": "Biden's watching E.T. right now so he'll know what to expect if he has to meet with them.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "bigcheesemaker167",
        "time": "28 June, 2021",
        "context": "I believe most of us have thought that for a long time.  After 70+ years he's just coming to that conclusion??  Thank God he's no longer a Senator.  We Floridians are better off already.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "soldierofwisdom",
        "time": "28 June, 2021",
        "context": "The Universe is so unimaginably big that it is statistically impossible that we are alone. Has absolutely nothing to do with belief or a 96 year old astronaut taking his last breaths. \n\nAnd just to make sure, still doesn’t mean that it is very probable that any of the out of focus images show alien UFOs.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "borkumriff",
        "time": "28 June, 2021",
        "context": "bill likes red rockets.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "WhiteLivesMatter(WLM)",
        "time": "28 June, 2021",
        "context": "When are you people going to wake up and accept the fact that they are aliens from outer space? Watch the documentaries, read the books, listen to the words of the people who have been abducted. Wake up!",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "johndoesr",
        "time": "28 June, 2021",
        "context": "He must have stayed at the Holiday Inn Express last nite...............",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mlipst",
        "time": "28 June, 2021",
        "context": "Nelson is not an astronaut who was also a Senator.  He was a Senator who hitched a ride on the Space Shuttle. ",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "anti-liberal996",
        "time": "28 June, 2021",
        "context": "He's right. I watched Startrek last night and can vouch for him.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "dolemite1000",
        "time": "28 June, 2021",
        "context": "What blows my mind is the concept of an infinite universe.  Not just bc its so hard to envision something that never ends, but bc if the universe is truly infinite, that means there are infinite versions of you out there.  One with one less hair on their head than you have.  One with 2 less hairs, one with a nose ring, one with 4 toes, and on and on and on and on...  What's scariest about this is that means there is an infinite number of Hillary Clintons out there, meaning there are infinite versions of you \"committing suicide\".",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "walterscott",
        "time": "28 June, 2021",
        "context": "When on flight duty in 60’s we couldn’t talk what we saw if anything. When discharged we signed documents to that effect.",
        "good": "50",
        "bad": "7",
        "replies": []
    },
    {
        "user_name": "juspassingthru",
        "time": "28 June, 2021",
        "context": "This is why I wear a foil mask.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "techguyfred",
        "time": "28 June, 2021",
        "context": "We're not alone. God is out there. While He doesn't exist within this physical universe, He still interacts with it.",
        "good": "3",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "jerryst",
        "time": "28 June, 2021",
        "context": "Read Carl Sagan's book COSMOS. Mathematically there are thousands, if not millions of planets with life of some form.",
        "good": "22",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "ColoradoJD",
        "time": "28 June, 2021",
        "context": "Doesn’t anyone think it strange that all of a sudden the government is discussing UFOs when they’ve been so tight lipped?  What’s changed?  Maybe they want to crest a galactic common enemy to unite the world toward a one world government? ",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Life",
        "time": "28 June, 2021",
        "context": "perhaps it's hunters escape module or clintons \"hide his hoes\" craft? both are tough to nail down",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "lucabrasi940",
        "time": "28 June, 2021",
        "context": "We here on Earth are not alone. I know this for a fact. What about those people in the Space Station ?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "micdund3836",
        "time": "28 June, 2021",
        "context": "Any fool already knows that.\nEach star you see in the sky has an average of 3 planets orbiting it. \nThe sun is just 1 star and we are just one planet. \nThere is obviously other life out there.",
        "good": "16",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "semperinfronte",
        "time": "28 June, 2021",
        "context": "Democrats are kinda funny.  They'd call a few cells on Mars \"life\", but won't give the same respect to a 15-week human fetus with a beating heart.",
        "good": "19",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "durnrightnooônbnbIndio",
        "time": "28 June, 2021",
        "context": "Take them to our leader?\n\nYeah great.  They will just report back there is no intelligent life on earth but we are a good source of protein.",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "coolhandluke066",
        "time": "28 June, 2021",
        "context": "This guy is off his rocker",
        "good": "2",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "CyanRaindrop",
        "time": "28 June, 2021",
        "context": "If you are looking for intelligent life you would avoid earth",
        "good": "10",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "gunsnguitars",
        "time": "28 June, 2021",
        "context": "We might be alone in the universe, the jury is still out.  Here on Earth we have each other.  Treat folks with kindness and empathy and stop letting political activists divide us.",
        "good": "21",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "ricardocabeza73",
        "time": "28 June, 2021",
        "context": "I'm offended!",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "oaksen",
        "time": "28 June, 2021",
        "context": "That's ridiculous! 140 UAP and the Defense department was unable shooting down one of the objects.\n\n\"We are not alone\" beautiful baby song.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "KillerMcGirk",
        "time": "28 June, 2021",
        "context": "Of course there is other life in the universe, even in our galaxy, but we will never meet because....even at the speed of light, it would mean sitting in a spaceship for thousands of years. ",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "nightsight971",
        "time": "28 June, 2021",
        "context": "Hey Lockheed, Boeing, Northrop, and Raytheon!!! Develop a powerful camera pod for our jets to record the aliens! That will end the debate.",
        "good": "15",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "notmikegundy",
        "time": "28 June, 2021",
        "context": "If they locked on with radar and tracked it then shoot that Green SOB down. We will know then if it's a foreign adversary or extraterrestrial. It ain't over until the Fat Lady Sings.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "skydog759",
        "time": "28 June, 2021",
        "context": "Pretty sure it’s a bunch of racist flying saucers",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "No,notaJoke!",
        "time": "28 June, 2021",
        "context": "Yep, we gotta keep lookin for da aliens. Why?  cause they're out there someone. Besides the U.S. taxpayer will foot the bill.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "chuckeasy128",
        "time": "28 June, 2021",
        "context": "What if they're invisible and they follow you into the bathroom?",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "lesterpbrown",
        "time": "28 June, 2021",
        "context": "Gee I thought the same thoughts years ago and I am not even important.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "whatabout522",
        "time": "28 June, 2021",
        "context": "no you are not alone \nwe have been watching you for centuries \nyour technology has evolved \nbut your prejudice hate propensity for war has not \nwe will never reveal ourselves until you evolve \nour technology would destroy your world and more likely to be used against us \n\nperhaps in another thousand years \nif you ever grow up ",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "123ededed",
        "time": "28 June, 2021",
        "context": "Gee... he’s really going out on a limb with this quote. Next he’ll be telling us he doesn’t believe in Santa Claus.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "ThunderCat",
        "time": "28 June, 2021",
        "context": "Nelson has always looked other worldly to me ... plastic mask man ... Dude is one of them !!!",
        "good": "5",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "AirforceVet55",
        "time": "28 June, 2021",
        "context": "We haven't found intelligent life in the White House in over 6 months...\n\nSo there is that.",
        "good": "19",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "justheretohelp",
        "time": "28 June, 2021",
        "context": "So it's still a headline story to claim we're not alone in the Universe. With no proof, it's an act of faith, but it contradicts what people usually consider to be faith.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "momomomo",
        "time": "28 June, 2021",
        "context": "No one is coming from many light years away to play peek-a-boo. And a UFO is not necessarily from another planet",
        "good": "3",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "just_ask_me",
        "time": "28 June, 2021",
        "context": "Yeah, when I first saw Maxine Waters... I knew we were not alone in this universe.",
        "good": "15",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "semperinfronte",
        "time": "28 June, 2021",
        "context": "And I betcha they're all being flown by BigFoots!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Proverbs3:5🙂",
        "time": "28 June, 2021",
        "context": "We have never ever received one radio transmission from anywhere in outer space. No crop circles have been made since video cameras became abundantly available. What everybody thinks are UFOs the Bible clearly states in Ezekiel 1:16 that they are spirits that protect the heavenly realm of God described as a wheel within a wheel shiny like diamonds moving at any rate of speed in any direction God bless everybody.",
        "good": "4",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "thevoiceinyourhead",
        "time": "28 June, 2021",
        "context": "If we are alone then the universe is an awful waste of space.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "stand&amp;be123",
        "time": "28 June, 2021",
        "context": "I have read accounts of sporadic \"UFO\" sightings in the past. I personally witnessed the\"Lights Over Phoenix\" in the late 90's, however, it seems like this is an intentional distraction for something that is REALLY going on. It seems like before  we get blindsided and our lives get disrupted, something like this ALWAYS happens.",
        "good": "28",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "whollyd",
        "time": "28 June, 2021",
        "context": "Take some better pictures and I might believe it.",
        "good": "4",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "robertprice07",
        "time": "28 June, 2021",
        "context": "There are billions of earth-like planets and the idea we are the only one with life is the pinnacle of arrogance. However, visiting aliens defies logic.\n\nVoyager 1 was launched in 1977, passed Pluto in 1990, and left the Solar System in November 2004. It will be another 80,000 years to reach the closest star. \n\nWhy would any \"visitor\" overcome the vast time and distance just to come here? We are not that interesting.",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Humanehuman",
        "time": "28 June, 2021",
        "context": "A no brainer when you consider there are millions of galaxies containing trillions of planets. ",
        "good": "14",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ralphyeee",
        "time": "28 June, 2021",
        "context": "Go away crypt keeper. We finally got you out of Florida yet here you are again. As worthless as ever.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "annewade",
        "time": "28 June, 2021",
        "context": "He is NOT a former astronaut.  Just another washed up career politician who is Biden’s contemporary in congress and probably blackmailed JoeBaby to get this appointment.  He went along on ONE space flight and complained about his resulting flatulence for months afterward.  He knows nothing about anything.",
        "good": "3",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "fox56",
        "time": "28 June, 2021",
        "context": "Biden is the only one who is completely alone",
        "good": "5",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "Not-Shocked-or-Awed",
        "time": "28 June, 2021",
        "context": "To think otherwise is complete denial.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dreamcatcher",
        "time": "28 June, 2021",
        "context": "It is highly probable that there is intelligent life somewhere else in the universe.  We cannot even comprehend the size of the universe and the billions upon billions of stars that may have planets orbiting them.  If they have been here we obviously don’t understand how they got here.  To our knowledge, nothing can travel faster than light and at 186,000 miles per second it would take you 4 years to get to the nearest star. They must have found away to travel faster if they have been here.",
        "good": "12",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Hansy",
        "time": "28 June, 2021",
        "context": "The so called aliens are demons...read your Bibles!",
        "good": "3",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "DMC1983",
        "time": "28 June, 2021",
        "context": "Report ignores the most obvious possibility that the craft are indigenous to earth but not ours nor our major adversaries but of a more advanced civilization that has chosen to remain apart for reasons known only to them.  If so they could be concerned many nations now have the capability to destroy the planet in nuclear war; so they are making themselves and their superior capabilities known. The existence of superior beings on earth is not something politicians nor military forces could allow themselves to contemplate so they say “we don’t know” more study is needed.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "GuajiroMiami",
        "time": "28 June, 2021",
        "context": "he was a grifter that got a free ride for his personal glory. Asstronut is more like it...",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "Merridian",
        "time": "28 June, 2021",
        "context": "There may very well be other intelligent life in the universe but unless they have an understanding of physics and space way beyond our knowledge it seems impossible for them to travel the cosmos and reach earth.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "willlandru",
        "time": "28 June, 2021",
        "context": "Yes there are aliens, and they're looking at this planet like a grand buffet.\n\nNote to Aliens: Liberals are delicious. Please visit Seattle, Portland, San Francisco, Minneapolis, and Chicago. Good eatin' there!",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "dgbjones",
        "time": "28 June, 2021",
        "context": "There better not be. Cause if they're of my mindset, they'd be making ready to totally exterminate humanity and seize the planet, which is much more valuable than humans.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "VictorVega",
        "time": "28 June, 2021",
        "context": "Are pilots seeing these with their actual eyes? or are they always on instruments (radar, thermal, etc)",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Sgt_J_J_Sefton🇺🇸",
        "time": "28 June, 2021",
        "context": "Of all the millions of known species, only one has shown to place any value on civilization, intelligence or technology.\n\nIntelligent extraterrestrial life?\nHighly unlikely.",
        "good": "0",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "ThatsawrapJudy",
        "time": "28 June, 2021",
        "context": "Time travelers from our future.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "john_cocteausten",
        "time": "28 June, 2021",
        "context": "So they're all going to hell, right? No Jesus.",
        "good": "3",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "GoldFlower",
        "time": "28 June, 2021",
        "context": "I find it harder to believe there isn't other life out there than not.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Keyser_Soze999",
        "time": "28 June, 2021",
        "context": "Oh Please...if we make contact with them, please, please, please...do not honor their request to take them to our leader!!??  How embarrassing!!!",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "burningdownthere",
        "time": "28 June, 2021",
        "context": "“Two possibilities exist: either we are alone in the Universe or we are not. Both are equally terrifying.” - Arthur C. Clarke",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bongodriver",
        "time": "28 June, 2021",
        "context": "Bill Nelson is not an astronaut.  He hitched a ride on STS-61C as a Member of Congress.  Now he is demonstrating how NASA can also be a retirement home (he turns 79 in a few months).",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "dogsrmything",
        "time": "28 June, 2021",
        "context": "we are not alone in the universe God The Creator of Heaven and Earth is watching over us",
        "good": "4",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "dreamcatcher",
        "time": "28 June, 2021",
        "context": "Humans are the most intelligent creatures on this planet.  Just suppose there is some other planet out there where our intelligence matched against the intelligent beings there is comparable to a dogs intelligence matched to ours here on earth.  It’s possible and it would be scary since they would see us as lowly beasts.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ra2013532",
        "time": "28 June, 2021",
        "context": "Aliens from URANUS. ;D",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "CyanBattery",
        "time": "28 June, 2021",
        "context": "This guy's face and head/neck area resembles \"ET\", so he might be right and he might be \"It\"!!",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Keyser_Soze999",
        "time": "28 June, 2021",
        "context": "There are many things going on we do not understand...",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "davidl411",
        "time": "28 June, 2021",
        "context": "It is SO wrong to headline this story \"former astronaut\", and to continue that misleading characterization of Nelson's credentials. Did he go into space once: yes, but he did so only as NASA's invited guest from Congress. He was a politician who went along for the ride. He was not an astronaut in the sense of being a trained mission specialist, or one with a test pilot's background. His ticket to ride was the politician's equivalence of the teacher-in-space program that picked Christie McAuliffe. Who wrote this piece?",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "mc1950",
        "time": "28 June, 2021",
        "context": "All we know about UFOs is that the government needs millions of dollars to study them.  The study will be headed by Mueller, with the final report coming from Durham in the year 2100.",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "🐧thereisagod2⭐",
        "time": "28 June, 2021",
        "context": "YA KILLING ME NANCY!!!!\nOhhhh my, ya killing me!!!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "samcrane",
        "time": "28 June, 2021",
        "context": "Seems that UFO ‘S and people who have studied them have always been ridIculed ,\nThose who are able to see beyond the shadows and lies of there culture will never be understood, Let alone believed,  by the masses ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "shouthard",
        "time": "28 June, 2021",
        "context": "Calling Bill Nelson “former astronaut” is an insult to every aerospace PhD, fighter pilot or aeronautical engineer who has a career in astronautics. ",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "Silencionomore",
        "time": "28 June, 2021",
        "context": "UFO Report\n\nWalking on eggshells is my take on this “UFO Report”.  These things have been observed for years; notably beginning back during World War II where they were observed by U.S. Military fighter pilots and earned the name “foo fighters”. Even during that time, they had the same characteristics of extreme speeds, no visible propulsion system, and extreme maneuverability. More recently, they have interacted with our military aircraft, with our navy ships at sea, and with our land based military installations. We can not match their level of technology. \n\nThey have been observed both during the daytime and at night, visually, through radar, and by photography by both military and civilian pilots who, by virtue of their profession, carry a high degree of credibility.  They have been observed by numerous civilians both visually and by photography but those reports by civilians are largely ignored or discredited in general due to a lack of credibility attributed to their status as non-professionals. \n\nThe fact that alongside this published report is a undisclosed, classified report that accompanied the report that was presented to the Congressional  Intelligence Committee is, of itself, indicative of their reality. The two biggest questions (Where do they come from? and Are they a threat to us?) beg the question as to their reality.",
        "good": "13",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "constitutionalvalues",
        "time": "28 June, 2021",
        "context": "I hope they get here soon, democrats are allowing the radicals within their party to destroy America. Maybe they can convince them to stop.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "fiscalconserv",
        "time": "28 June, 2021",
        "context": "Astronomers estimate there are about 100 billion stars in our galaxy.  And the Milky Way is just a small to average size galaxy among millions and millions of other galaxies.  To think that we are alone in the vastness of all this would be hard to fathom.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mikem1355080",
        "time": "28 June, 2021",
        "context": "He’s right, we are not alone. God is there.",
        "good": "3",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "cognisergosum",
        "time": "28 June, 2021",
        "context": "He referred to them as \"aliens\"?!!!\n\nPoor man, will be cancelled in no time.\n\nAlso makes me wonder if he has seen these \"extra terrestrial citizens of the universe\" while working as an astronaut or is he only speculating like everybody else.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Rtkaye",
        "time": "28 June, 2021",
        "context": "A real genius. And to think he was elected to run a giver in Florida and in us.  Now wonder we are where we are now ",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "GreenWeights",
        "time": "28 June, 2021",
        "context": "Has the International Space Station, Hubble Telescope, satellites, or earth based telescopes ever detected UFOs entering our atmosphere or entering the earth's orbit?  Or, have the UFOs entered undetected?  It's amazing that there is not one clear photo or video, or image, of a UFO.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "NotDemNotEver",
        "time": "28 June, 2021",
        "context": "UFO's .....they travel billions and billions of miles and come to a planet with lifeforms... then they stop 1 mile above the surface , play cat and mouse with airplanes and then leave",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "NASAGuy2",
        "time": "28 June, 2021",
        "context": "He is not a former astronaut!  He used his position in Congress to force NASA to put him on the Space Shuttle.",
        "good": "8",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "missouririchard",
        "time": "28 June, 2021",
        "context": "Okay, you wanted proof of powers greater than man, and then when we see powers unexplainable to anything that we have known, the first thing that pops into people's heads is aliens and star wars. Simpler explanations might be more on what we have heard, like just what do Angels look like? They are right, we are not alone, we have never been alone, but billions have done their best to ignore the one thing that has been spoken of, for thousands of years. Nothing you do or say is hidden from our creator, for God is everywhere. Still going to demand proof though, aren't they? Will our judgement be proof enough?",
        "good": "2",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "kennethknerr196",
        "time": "28 June, 2021",
        "context": "Aliens probably lock their doors when they fly past Earth.",
        "good": "14",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sapinva",
        "time": "28 June, 2021",
        "context": "Pilots have seen these things for 100 years. It's not Russia.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "beachbum483",
        "time": "28 June, 2021",
        "context": "I think most people consider it possible for life to exist elsewhere in the Universe. Thinking otherwise would require an extremely narrow and unimaginative mind lacking a single iota of creative thought. \"We know nothing about it so it can't exist\" kind of thing.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tywebbcaddie",
        "time": "28 June, 2021",
        "context": "I agree...I think there is a moderate politician out there somewhere  :)",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "SidenBux",
        "time": "28 June, 2021",
        "context": "Alone only by distance. I have seen the future and know the plan.  We got a long way to go.  But we’re doing alright.  ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "solarlight",
        "time": "28 June, 2021",
        "context": "Nothing is there to support viable interstellar travel, NADA. \nFar more likely a SUPERNATURAL God having infinite powers.\nTrust in God, be spiritual.",
        "good": "6",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "cj529",
        "time": "28 June, 2021",
        "context": "hardly alone...there are over 7 billion of us",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "error": "error"
    },
    {
        "user_name": "roadapples",
        "time": "28 June, 2021",
        "context": "We have had aliens infiltrating us for years--- they're coming here across the Southern border, guided by the other aliens- Dem's from the planet Uranus....",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "thatsfunnyrightthere",
        "time": "28 June, 2021",
        "context": "The fastest space craft man has built goes about 450k mph. \n\nAny alien civilization that may be able to send a ship here (the videos in question) would be so technologically advanced compared to us that they would only be reconning for a possible take over. \n\nBecause if friendly and they were here, they'd have tried making contact by now. Yes, it begs the question that maybe they have tried but we are so primitive that we don't recognize the communication, but that's probably even harder to imagine.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "navrat960",
        "time": "28 June, 2021",
        "context": "Sorry but the experts we trust so much said they unidentifiable . Same as it ever was.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "PurpleCoffee",
        "time": "28 June, 2021",
        "context": "What will the crooked people in our government do when they can’t dig up stories about people they don’t know from other places?  That’s easy.  They’ll make it up.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "GreenWeights",
        "time": "28 June, 2021",
        "context": "Why is it that they only come during election years and they always seem to vote for Democrats?  That ain't right.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "agrigento58",
        "time": "28 June, 2021",
        "context": "I would like to ask the aliens where the hell Pelosi,AOC and Maxine Waters are from...what planet vomited them on us",
        "good": "4",
        "bad": "2",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "mattyk",
        "time": "28 June, 2021",
        "context": "I’m surprised our military hasn’t taken a shot at one of these unidentifiable unauthorized objects flying in our airspace. ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "catusbird",
        "time": "28 June, 2021",
        "context": "If I was from outer space, I'd take one look at this mess and shoot off to another planet.\nFar\nFar\nAway",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "agrigento58",
        "time": "28 June, 2021",
        "context": "Humans are afraid to admit that we may not be the \"supreme\" beings and that there are beings far more advanced than us...we are just used to being at the top of the food chain",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "mentalblock438",
        "time": "28 June, 2021",
        "context": "please Mr spaceman come and remove me from this garbage dump I don't think I can take these Democrats anymore they have turned this country into a cesspool of hate and civil unrest I will keep my eye on the sky and await your arrival",
        "good": "4",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "sgt.bulldog",
        "time": "28 June, 2021",
        "context": "Bill Nelson is a total whack job liberal Democrat, that's why he was run out of Florida, he's been in Politics for decades, accomplished nothing.. He looks like a corpse from the Walking Dead tv show. He has zero credibility.  If there are aliens out there, Please take him with you.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jay1950911",
        "time": "28 June, 2021",
        "context": "I agree with Bill.  Jesus said: \"Other Sheep have I that are not of this fold.\"  I'm almost positive that there being over 150 Billion Stars in the heavens, many of them with planets that would support life, it is very asinine to think we are the only ones.  Most likely, the others are civilized and not as stupid, not murderers, not rapist, and most like very good being.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "10028tb",
        "time": "28 June, 2021",
        "context": "As if we don't have enough to worry about, now we have to worry about aliens attacking us, just keeps getting crazier and crazier.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "presidentdiaperfacepoopypants",
        "time": "29 June, 2021",
        "context": "Well, there's the holy spirit and angels. But as far as some space creature travelling in negative 452.47 through highly radioactive space and traveling 4.5 light years (which physically cannot be achieved) to just get to the next star? I don't believe.",
        "good": "4",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "aretee",
        "time": "29 June, 2021",
        "context": "Maybe the AI that we created and chose to destroy us can make the trip?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "PurplePretzel",
        "time": "29 June, 2021",
        "context": "BILL IS CORRECT   we are not alone  there are to many democrats and liberals",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "101stParatrooper",
        "time": "28 June, 2021",
        "context": "Christians have a good idea what these objects are.  Atheists don't have a clue.",
        "good": "5",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "broken_sky",
        "time": "29 June, 2021",
        "context": "Only incredibly stupid people believe we have been visited by an alien civilization.",
        "good": "2",
        "bad": "7",
        "replies": []
    },
    {
        "user_name": "anyonebutyou233",
        "time": "29 June, 2021",
        "context": "Stands to reason.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dovelove1",
        "time": "29 June, 2021",
        "context": "For years, people who advocated for AFOs were considered loony; now they just might be correct in thinking we have been and are being visited by aliens.  I would be interesting to know just what the government knows that we are not being told - Roswell anyone?",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "mk101mk693",
        "time": "29 June, 2021",
        "context": "I believe we are - who you going to believe? a space cadet or me?",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "aro3670",
        "time": "29 June, 2021",
        "context": "He should think so. He used to live with a genie when he was still a Major.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "LetsGoBrandonAMillionTimes",
        "time": "28 June, 2021",
        "context": "If we, the inhabitants of Earth are the only lifeforms in this great big universe of ours, then given all the planets and all the vastness of that same universe, then statistically, life here is so insignificant it must appear as \"statistical error\" and therefore is too insignificant to mention. \nIf we are it, then humans specifically are the most \"messed up\" lifeform possible, because we are on the verge of destroying ourselves day-to-day. We gotta' fix that and not by stupidity like CRT, or differences in political or economic theoretical assumptions. \nQuoting Jack Nicholson in that Mars Attack movie, \"Can't we all just get along?\"",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "texican1836/1952",
        "time": "28 June, 2021",
        "context": "\"Former astronaut\"? If I book a flight on an airliner do I instantly acquire the title of \"pilot\"?",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "faitaccompli42",
        "time": "29 June, 2021",
        "context": "......and there will be wonders in the sky and on the earth...",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "physicalspecimen2020",
        "time": "28 June, 2021",
        "context": "He looks like an alien",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "BlueFlask",
        "time": "29 June, 2021",
        "context": "And he would be correct.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "superbeing007",
        "time": "28 June, 2021",
        "context": "I've already told everyone what this is, and its not other world aliens.   It's angels from the GOD dimension keeping any eye on mankind's development.  Other world aliens do not exist; they never have and never will.  GOD said in the Bible that he laughs at our intelligence and makes fools of us for rejecting him, so you can take it from that.    We on this small ball in this vast universe are it.  Everything was created for us.  That's it.  Besides, if there were other world aliens that could travel here, they would no doubt look at us the same as we look at cattle, pigs, etc. and say about us \"good meat\".  What you better worry about is what will happen to your essence when you die, cause you don't have long to think about it no matter your age.  It's either heaven in the GOD dimension or hell.  Jesus said that the path to hell is wide enough to accept all that wishes to go that way.",
        "good": "3",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "testingtesting",
        "time": "28 June, 2021",
        "context": "He's right about that, God has a lot of things going on but it's not aliens like in sci-fi movies and TV. It's something much worse and even the Archangel Michael knew it and said \" God rebuke thee\".",
        "good": "6",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "xonlyrepublicanlivesmatterx",
        "time": "29 June, 2021",
        "context": "I can see it now, white Republicans will finally find a way to get away from racist minorities and their crime and away from our fellow embarrassing minority worshiping white Democrat animals and embarrassing dark baby factory white women and finally get settled in on Mars. Then some black worshiping Democrat animal president will demand free housing on Mars for racist minorities and infest that planet too",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "broken_sky",
        "time": "28 June, 2021",
        "context": "Obviously, his IQ has been revoked.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "austifreedom66",
        "time": "29 June, 2021",
        "context": "I don't believe we're alone in the universe either. Especially when this guy looks like an alien.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bennys5149",
        "time": "29 June, 2021",
        "context": "No way we are alone.  They are just too far away to find before our civilization is decimated by leftism.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "dande-man",
        "time": "29 June, 2021",
        "context": "Look up the Drake equation. It shows you how to calculate the odds. My thoughts, Life in the universe sure...intelligent life yes ... but definitely no in AOC's district. Intelligent life with technology...that is tougher. Once you develop technology you develop the ability to annihilate yourself. Once a species manages to develop technology the next normal phase may well be self annihilation. That is one of the variables in the Drake equation. When JWST launches in October we may know more.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "1+1",
        "time": "29 June, 2021",
        "context": "\"We have a program in NASA called the Search for Extraterrestrial Intelligence\".\nA waste of money, like him!",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "7254",
        "time": "28 June, 2021",
        "context": "We can track space debris the size of a bottle cap. We've got more eyes in the sky than ever. But all we ever get is some blurry halfassed picture.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Ohello",
        "time": "29 June, 2021",
        "context": "Write it down.  Eventually they will get smart enough to realize they are here and have been for a very long time. We are just looking in the wrong place.   Look to the ocean.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "humanish",
        "time": "29 June, 2021",
        "context": "This is how they slowly bring the general public to be able to accept that we are about to be visted!!!",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "bflyroses988",
        "time": "29 June, 2021",
        "context": "I agree, logically how could our 🌍  be the only planet with life?",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "guitarsRcool",
        "time": "29 June, 2021",
        "context": "Any rational mind has to believe there is life on other planets.  Maybe even advanced societies with space faring technology.  But he hit on the part that makes it unlikely we are being visited.  Space is huge.  It is possible that there is a way to traverse these distances way faster than light but if not then we might never meet another intelligent species.  \n\nIf they can actually visit  why hide?  Why travel all that distance just to dissect some cows and probe some butts.  They can't be afraid of us since we can barely travel to our own moon.  Wherever they are from is safe from us.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "LetsChangeTheNarrative",
        "time": "29 June, 2021",
        "context": "here's a thought :\n\nwhat if I were from another star system, came here 50 years ago and have assimilated to your Culture, your ways and language in the USA and here I am, typing out comments about aliens at Fox Forums? None of you reading this would ever know nor would you believe me if I told you that was the truth of the matter. Na-Nu Na-Nu ...",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "arguemint",
        "time": "29 June, 2021",
        "context": "\"NASA Administrator Bill Nelson believes we are not alone in the universe\"\n\nI think progressives are way out there too!",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "WhistlingWithStacy",
        "time": "29 June, 2021",
        "context": "First, a poll - who is the biggest idiot?  Pres house plant or lost in space Nelson?  Second - does \"aliens\" explain bath house Barry and his \"merry\" band?",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "divisifiedfarm",
        "time": "29 June, 2021",
        "context": "He thinks he's not alone in his special universe. His pills help quite a bit.",
        "good": "0",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "JohnnyCage",
        "time": "29 June, 2021",
        "context": "Aliens arnt real.\nWe are alone.\nJust us and God.",
        "good": "1",
        "bad": "5",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "discuspunch",
        "time": "29 June, 2021",
        "context": "Dude looks like Anne Murray",
        "good": "1",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "VideoVerity",
        "time": "29 June, 2021",
        "context": "Many have the notion that we'll colonize other planets. Don't be surprised if these sightings are eventually related to an interstellar border patrol. We should never believe that aliens will ever be as tolerant with invaders as USA is.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dzerres513",
        "time": "29 June, 2021",
        "context": "Of course we are not alone \"out there\" but that isn't the question.  The question is:  have we been visited by extra-terrestrials?  The answer is \"no\" because the chances are pretty much nil.  With any concrete evidence the answer remains \"no\".  The distances are just too large for another civilization to visit, sneak in and do a colonoscopy on a farmer in Iowa, and quietly leave.  It would take eight years round trip from the nearest star system, Alpha Centauri, (that's assuming it has a liveable planet with an advanced cilvilizaton - again zero odds) to come here and return.  Eight years going at the speed of light!  That kind of commitment requires a lot more than a late night visit to a corn field in our mid-west.",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "jlpeters",
        "time": "29 June, 2021",
        "context": "We're merely an experiment a planetary prison, of sorts! \n\nIn a galaxy far, far away, occupants of a planet riddled with chaos gathered up all it's problem inhabitants and transported them to live with the dinosaurs on earth.......and they didn't leave us with any fuel they use with their transports, because they don't wanna' even dream of us someday leaving our own galaxy. \n\nThat's why we're where we are and in the mess we're in today!",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Joseph.Barnyard",
        "time": "29 June, 2021",
        "context": "I don't know myself that there is, or that there isn't, and I don't care.  But I'm beginning to wonder if Bill Nelson has started reading books by George Adamski.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "HPLwasright",
        "time": "29 June, 2021",
        "context": "He looks like an ET. Photo said he campaigned for the crackhead who ended up in a crackhouse with his head in a crack.\nAlien logic, I guess.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cbama11",
        "time": "29 June, 2021",
        "context": "What is the evidence?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ajpmam919",
        "time": "29 June, 2021",
        "context": "They're  all in his head.",
        "good": "0",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "marine_warrior",
        "time": "29 June, 2021",
        "context": "The greatest G Force s human can withstand is 9 Gs..Some of these craft make turns that would generate 600 Gs..Interesting..",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "millman88229",
        "time": "29 June, 2021",
        "context": "Nelson looks like one of the bad low budget aliens on Lost In Space",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "buskman",
        "time": "29 June, 2021",
        "context": "I believe, these are demonic entities, folks.\n\n..They are duping humanity into believing in \"extraterrestrials/aliens\"...(as some already do, now) in order for the world powers to be able to explain the sudden, strange departure that is about to occur, when The Son of God (Jesus The Messiah) Keeps His Promise...and Returns to Remove His Bride, The Church, from earth.\n\nThen?... all Hell breaks loose on planet earth.\n\n(Hence my plea for everyone to come to Christ...now.  ...Not later.)\n\nThe MSM...will then spread the \"theory of alien abduction\" to the non-Christian viewer, who are left on earth, in order to explain the sudden disappearance of millions of people, world-wide, who were already Christian, at the time of Christ' Return.\n\n\n...to put it in a more light-hearted, comical format, if you'd rather...?\n\n\"Past life experience intruding on present time.\"-Dr. Ray Stantz, Ghost Buster, NYC, 1984",
        "good": "3",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "eddieb883",
        "time": "29 June, 2021",
        "context": "A news story like this always reminds one that they need to be aware of Klingons surrounding Uranus at any time. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "WhereisJohnGalt?",
        "time": "29 June, 2021",
        "context": "Max Waters is proof that Space Munkeys are real.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "art1029",
        "time": "29 June, 2021",
        "context": "Another case of lowering the bar \"Bill Nelson astroaunt.\" Only got to space becaause he was US congressman.",
        "good": "0",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "HawnschottFurzt",
        "time": "29 June, 2021",
        "context": "I find it hard to believe we are alone in the Universe. \nThat said, I find it hard to believe that casual, superluminal travel between stars is possible.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "horace",
        "time": "29 June, 2021",
        "context": "He’s right. How else do you think AOC got here. ",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "1daysoon",
        "time": "29 June, 2021",
        "context": "If it was made public with freedom of information act. He is an Alien.  What irritates me I voted when he first ran for an office.  So, I am part and parcel to the start of this numb-skull's political leftists idiot ology.\nThere, \"I came out\"\nI just can't help it, I guess things happen that way\"\nI didn't write that, John did \nLEM",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "web02",
        "time": "29 June, 2021",
        "context": "The universe is a pretty big place.  Believing that the chemical reactions that produced life on the Earth could not have happened elsewhere is rather naive.  ",
        "good": "11",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "rjs508",
        "time": "29 June, 2021",
        "context": "I hope Nelson at least got his money back for that botched face lift.",
        "good": "0",
        "bad": "3",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "notwar2568",
        "time": "29 June, 2021",
        "context": "Did you know there are more atoms in a cup of water than there are cups of water in all the earth's oceans?  There are more stars in the universe than that.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "walter2012",
        "time": "29 June, 2021",
        "context": "Maybe it's us coming back through time on a historical mission to figure out how it all went wrong when Biden got elected.",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ashehousewares",
        "time": "29 June, 2021",
        "context": "I don't see how we are not.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "jeffersoniansheepdog",
        "time": "29 June, 2021",
        "context": "Hypersonic hMD drives\nChina and Russian airforce have these advanced weapon systems \nThey probably have antimatter bombs to stick on there as well\nWhile the USA is fighting to become socialist \nIts population is so dumb they believe Aliens are here to vist the special people of earth \nYou know were so important to the universe they just had to visit",
        "good": "6",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "rkw29",
        "time": "29 June, 2021",
        "context": "When I drive on the beltway I always wish I am alone in the universe.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dragonspray",
        "time": "29 June, 2021",
        "context": "Bill Nelson is less astronaut and more space cadet.",
        "good": "2",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "iffradar",
        "time": "29 June, 2021",
        "context": "He's looks like an alien",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "LetsChangeTheNarrative",
        "time": "29 June, 2021",
        "context": "\"A Russian cosmonaut aboard the International Space Station (ISS) has shared footage of what he describes as 'space guests'\"   there's a video from the ISS that he took ... Google it",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "iffradar",
        "time": "29 June, 2021",
        "context": "He must know Al Gore",
        "good": "3",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "RedBus",
        "time": "29 June, 2021",
        "context": "Some folk just plain look strange, alien hybrids, that cat is strange looking.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "kenndog",
        "time": "29 June, 2021",
        "context": "Looking at his weird photo above, I'm not so sure he's not an alien.",
        "good": "1",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "texaspatriot89",
        "time": "29 June, 2021",
        "context": "If they are out there. They ain't coming down to chit chat until we deal with the liberals and the violent cultures that inhabit every MLK street in America.",
        "good": "3",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "happygome",
        "time": "29 June, 2021",
        "context": "Only God knows and his will will be done ",
        "good": "5",
        "bad": "5",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "mikidoralives",
        "time": "29 June, 2021",
        "context": "If they're here, they're here and there isn't much we can do about it.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "DoDaDad",
        "time": "29 June, 2021",
        "context": "There's a lot of bugs out there, just like on Earth. Other than human's, all other life is bugs.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "liberaldestroyer163",
        "time": "29 June, 2021",
        "context": "The question is. . . are the aliens the only sentient beings in the universe!\n\nIf its just humans and them. . the answer is a resounding YES!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "1daysoon",
        "time": "29 June, 2021",
        "context": "I often see \" ODDS ARE\".  So far it's zero to zero....I don't gamble, I don't understand odds like that.\nPat...I need an answer on this ..\nLEM",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "PoliticiansR4power",
        "time": "29 June, 2021",
        "context": "Either the blues or the grays are behind the UFOs",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "befair027",
        "time": "29 June, 2021",
        "context": "The audacity of some \"intelligent\" people.  If there is other life and I doubt it, what makes you think they would need oxygen or an atmosphere like ours?",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "johnwayne54",
        "time": "29 June, 2021",
        "context": "He's got a point.  However, that other being isn't an alien.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "imgonnagogetthepapersgetthepapers",
        "time": "29 June, 2021",
        "context": "If they're aliens, they didn't come all this way in a big can of tuna fish without porn. I wonder what they watch, and how they do it.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "alersteen",
        "time": "29 June, 2021",
        "context": "So let's hope it's not true.  Yes, there are trillions of planets, odds are there is other life.  But the distances are vast.   We may be the top of the pyramid on earth, but to a civilization which has the technology to get here, we would be like cows to them.  Unintelligent animals burning sticks and rocks to cook and eat.  Let's not hope they are interested.  Let us evolve ourselves.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "davegreen50",
        "time": "29 June, 2021",
        "context": "Well, it would be an awful waste of space, but we're talking a really big space. This universe could be teaming with intelligent life and it be probable, not just possible, that none ever find another simply due to sheer distances.\nI'll say this though. If aliens have/are visiting this planet, they must be incredibly bored. I don't think we're all that fascinating.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "apocalypsenear",
        "time": "29 June, 2021",
        "context": "At his age I'm sure he's seeing a lot of things that aren't really there.",
        "good": "2",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "MEGA2020",
        "time": "29 June, 2021",
        "context": "The UFO's are American made aircraft. The US Navy applied for a patent and it can be found in the Patent Office web page. Just look up patent #10,144,532 B2.  OR US  10144532.\n\"Craft using inertial mass reduction device\". \nWhy would the Navy apply for a patent, who knows?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "liesofpotus167",
        "time": "29 June, 2021",
        "context": "It is a mathematical certainty life life exist elsewhere in the universe- how advanced is not known but given the age of the universe it is highly probable that life forms much more advanced then ours either exist or existed",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "datscap",
        "time": "29 June, 2021",
        "context": "Not sure how anyone could think planet earth is the only planet amongst an infinite number of planets that supports life. Simple logic does not bear this out.",
        "good": "7",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "SQZ",
        "time": "29 June, 2021",
        "context": "Those aliens peering into their own scopes will conclude that intelligent life on Planet Earth is ebbing.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "gsaogb",
        "time": "29 June, 2021",
        "context": "it is silly to think that earth is the only planet with life in this vast universe.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "FauxNewsSux856",
        "time": "29 June, 2021",
        "context": "With an estimated 10^21 (a billion trillion) stars in the universe, there’s probably plenty of extraterrestrial life in the universe. Scientists estimate that there are probably at least a few dozen planets with life like ours in our galaxy alone.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mirolo",
        "time": "29 June, 2021",
        "context": "I tell my little 6 year old that I love him more than all the stars in the universe.  Then I decided to see just how many stars there are in the universe.  I read that according some scientists there are ten thousand stars (10,000) for every grain of sand there is on the earth.  When I tried to explain this to my little 6 year old grandson, who of course is too young to understand what I was talking about, he replied, \"well, I love you more than infinity papa\"  I guess he got me beat, lol.",
        "good": "7",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "RC135AMT",
        "time": "29 June, 2021",
        "context": "Duh....when will this guy just go to the pasture!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "rkw29",
        "time": "29 June, 2021",
        "context": "This is like saying I believe there is a chance I could win the lottery if I play.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "raps19",
        "time": "29 June, 2021",
        "context": "Trump summoned them to influence the next election ",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "OldGloryStillWaves",
        "time": "29 June, 2021",
        "context": "Gee, you just realized that? There is me, you, them, her,  we're definitely not alone in this universe. There are about 8 billion of us;",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mellonhead61",
        "time": "29 June, 2021",
        "context": "Skeletor ! Is he still alive? We dodged the bulllet on that one here in FL.",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "CyanHat",
        "time": "29 June, 2021",
        "context": "\"We are not alone in the universe\". What a ridiculous statement, on so many levels! If what is meant by \"we\" is life as it is known on Earth, then on a universal scale, life on Earth is alone. That there might be Earth-like life on some planet thousands of light years away, that, from the point of view of life on Earth, is practically irrelevant. All that might impact life on Earth is the absolute certainty that life on Earth is alone. There is only one tree of life on Earth, and there aren't two. Big or small, we all come from the same DNA tree. Now if we think of \"we\" as purely material creatures who evolve following strictly laws of matter, then on a universal scale \"we\" are not just alone.  There is not even a \"we\", just an infinitesimal illusion on the space-time of the Universe. Entirely different perspectives open, if we turns towards the spiritual...",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "🤡HarrisAndBidenSuck🤡",
        "time": "29 June, 2021",
        "context": "Saw that big D by his name and went straight to the comments.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ProudNavVet",
        "time": "29 June, 2021",
        "context": "I've not believed we are alone in the universe either for many decades.  I believe it is incredibly short-sighted and arrogant to think we are the only intelligent beings out of the billions and billions of stars in the universe.  I also believe that the main reason why the other intelligent beings of the universe haven't actually attempted to make their presence known to us is that they also know how incredibly unevolved we are.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "MEGA2020",
        "time": "29 June, 2021",
        "context": "T\nhe UFO's are American made aircraft. The US Navy applied for a patent and it can be found in the Patent Office web page. Just look up patent #10,144,532 B2.  OR US  10144532.\n\"Craft using inertial mass reduction device\". \nWhy would the Navy apply for a patent, who knows?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "upn2dwind",
        "time": "29 June, 2021",
        "context": "\"But thus far, we don’t have any receipt communication from something that’s intelligent,\" he said.\n  \nDid somebody  supply them with a wiretap of AOC's phone?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "🆘🆘🆘🆘🆘🆘🆘⚠️⚠️⚠️⚠️⚠️⚠️⚠️🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸",
        "time": "29 June, 2021",
        "context": "Umm, he looks like he could be a little alien, yes?",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "mayberry",
        "time": "29 June, 2021",
        "context": "Unbelievable Fried Onions. 🔪🔪",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "manifoldwitnesscowboyup",
        "time": "29 June, 2021",
        "context": "Perhaps we'll find a planet with \"intelligent alien life\". \nWouldn't we be the aliens?\nUnlike here in the US.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "algorerhythm070",
        "time": "29 June, 2021",
        "context": "A secretary?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "HawnschottFurzt",
        "time": "29 June, 2021",
        "context": "As soon as Apple patents the I-Perdrive, we can cruise around and find the BEMs ourselves...",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "blehem",
        "time": "29 June, 2021",
        "context": "\"he doesn’t think we \"are alone\" after reading the US intelligence community’s recent report on unidentified aerial phenomena\"\n\nSo he doesn't think we're alone in the universe?  Or he doesn't think we're alone in our atmosphere.  One of those is perfectly reasonable, the other is insane.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "OptedOut",
        "time": "29 June, 2021",
        "context": "So? A lot of people, some astronauts, some former astronauts, millions of never-been-astronauts believe we are \"not alone\" even without reading any reports. Gee... I'm one of them!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "padre986",
        "time": "29 June, 2021",
        "context": "Little green men…….",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "itsborken",
        "time": "29 June, 2021",
        "context": "Bill Nelson wasn't an astronaut. He was a space tourist on the taxpayer's dime. His expertise as a 'Payload Specialist' is based on  his long Dem Pol career he filled shipping containers full of useless bills, or it that they classified him as Payload for the mission?",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "maxinestaxadermist",
        "time": "29 June, 2021",
        "context": "We already know there is no intelligent life in the democratic party.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "padre986",
        "time": "29 June, 2021",
        "context": "Fritz I think your on to something!  We cannot define life by our standards, hear on earth we have a Star Trek mentality. We need to explore what is life ,time and distance and who we are.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "redryder996",
        "time": "29 June, 2021",
        "context": "The reason extra terrestrials have never landed on earth is that they didn't want to catch the 'stupid bug' from earthlings. They didn't get the ability for intergalactic travel by paying their citizens to sit home and do nothing. They certainly didn't get their knowledge from 'woke' education and rewarding bad behavior. Nope, they are leaving us alone for a reason.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "daveed970",
        "time": "29 June, 2021",
        "context": "I agree we are not alone. The question is where is the other life and it is probably millions and millions of light years away from us. ",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "fritzcarlton",
        "time": "29 June, 2021",
        "context": "Ok. I want to play. \n\nSomeone tell me the definition of life.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Meg594",
        "time": "29 June, 2021",
        "context": "if you believe in UFOS you are not a Christian ",
        "good": "0",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "manny574",
        "time": "29 June, 2021",
        "context": "This former astronaut obviously has spent too much time in outer space, and his brain must have deteriorated quite a bit due to prolonged weightlessness in space. For the last few years many scientists all over the world have agreed that intelligent life is abundant throughout the universe, like about one million planets presently.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "gatormagic",
        "time": "29 June, 2021",
        "context": "Interesting. We have been sending various, simple and complex, signals into the universe for decades. No response. Nada, zilch. UFOs have become a part of our outer space lexicon, but they are all, still, UFOs.  Unidentified, no communications, no contact. Makes for good TV and movies though; The X Files, Close Encounters of the Third Kind, etc. Let me know when UFOs become IFOs, extraterrestrials become terrestrials.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "manifoldwitnesscowboyup",
        "time": "29 June, 2021",
        "context": "Perhaps we'll find a planet with \"intelligent alien life\". \nOr, maybe we'll just happen upon the dumb ones.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "robin365075",
        "time": "29 June, 2021",
        "context": "He is correct.\nNeed proof? We have Pelosi.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "Isandlwana",
        "time": "29 June, 2021",
        "context": "We're nothing special. Just a bunch of complex chemical reactions.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Patriot658676",
        "time": "29 June, 2021",
        "context": "Genius! ",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "RULibs4Real",
        "time": "29 June, 2021",
        "context": "Bill Nelson ,a lifetime career politician cut from the Biden mold and equally as intelligent.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bobbymarshall",
        "time": "29 June, 2021",
        "context": "After looking at the former Democrat Senator, I believe there definitely are aliens amongst us.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "HawnschottFurzt",
        "time": "29 June, 2021",
        "context": "Now I need to re-watch \"To Serve Man\"",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "appalling",
        "time": "29 June, 2021",
        "context": "Like all living things...things (life, planets, solar systems, stars)  evolve and devolve. When it flickers out, matter  gathers and space explodes again. It is a self creating and evolving process. Matter (atoms and molecules) can be changed but never destroyed. There is nothing that can stop it or change it. So...enjoy the interlude.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "😁MAGA2024😁",
        "time": "29 June, 2021",
        "context": "We're all living in a Simms game.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "😁MAGA2024😁",
        "time": "29 June, 2021",
        "context": "AOC is an alien implant",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "5561967",
        "time": "29 June, 2021",
        "context": "Logic would tell you we are one of very very many. ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "coolhandluke603",
        "time": "29 June, 2021",
        "context": "LIFE IS EVERYWHERE IN THE UNIVERSE, ALL AROUND US, WAITING FOR MODERN MAN/WOMAN TO SAY HELLO. we are led to believe this is not true, that we are basically alone or that any intelligent life is too far away to make the journey to earth. THE TRUTH WILL SET THE WORLD FREE! free from the endless wars our government make us believe are necessary for our safety and way of life…. ITS ALL A LIE THEY USE AGAINST US FOR THEIR OWN POWER AND GREED! ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "beerdrinkersandhellraisers",
        "time": "29 June, 2021",
        "context": "This clown was a space-cadet long before.\nHe & Biden probably sync their nap times.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Marine1970",
        "time": "29 June, 2021",
        "context": "Any one who believes that humans are the only people in the universe are really dumb. How can anyone really believe that there was only one \"big bang\". As a religious person I know within my heart and mind that there are other world populated with people just like us. God has said so in the Bible. If you don't believe in God, then you probably don't believe in anything, even science. If scientist don't believe in other worlds then they should retire.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "berserker1",
        "time": "29 June, 2021",
        "context": "Nanoo Nanoo.........Nanoo  Nanoo.....Nanoo Nanoo.........Nanoo  Nanoo.....",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "alexander111",
        "time": "29 June, 2021",
        "context": "Maybe the movie,”Race to Witch Mountain,” about two blond hair blue eyed teens with telekinesis and mind reading powers, that look like they are from Denmark 🇩🇰, but are actually from another planet on a peaceful mission to stop a hostile takeover of our planet isn’t fictional! Perhaps they were actually Nordic teen aliens! Maybe we got lucky 🍀, and they were able to convince their planet’s authorities not to conquer us humans and takeover planet Earth 🌎! LOL",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "baton435634",
        "time": "29 June, 2021",
        "context": "The Earth is at the center of the observable universe.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Zdzx",
        "time": "29 June, 2021",
        "context": "Ted Arroway to Ellie...'I don't know. Sparks. But I guess I'd say if it is just us...seems like an awful waste of space.'",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "berserker1",
        "time": "29 June, 2021",
        "context": "Nanoo Nanoo.........Nanoo  Nanoo.....",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "teamski",
        "time": "29 June, 2021",
        "context": "There are over 200 billion galaxies out there in the visible universe, each with billions of stars.  I would think it would follow that there is life elsewhere outside this solar system.  This isn't news.  It is logic.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sandiegoecho",
        "time": "29 June, 2021",
        "context": "We can't possibly be the most advanced beings in existence.  Man has always known this.  Every religion teaches us to be humble before a higher power or creator.  A sane man knows how insignificant he is.  ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "phbbft",
        "time": "29 June, 2021",
        "context": "If there is life elsewhere it’s probably SATANIC!!! GOD gave Jesus Christ, his only begotten son, to us humans and no one else, the BIBLE would have said so. Us humans should not go looking for SATAN out in GOD’s celestial heavens. Praise GOD and Praise JESUS and GOD bless the USA.",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "GreenWrench",
        "time": "29 June, 2021",
        "context": "Democrats are running out of people who believe their bullschiff so they are now dreaming about  using aliens out of space as a way to steal the next election.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "godhelpus1",
        "time": "29 June, 2021",
        "context": "attention all extraterrestrials avoid planet Earth if you can help it... you might regress a couple million years after coming here. ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ItWasAboutTime",
        "time": "29 June, 2021",
        "context": "Former astronaut needs to stay away from the plastic surgeons office. Anesthesia use among the elderly can compromise one's thinking...",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "🇺🇸rangeduster",
        "time": "29 June, 2021",
        "context": "What’s funny is, we have an entire solar system that we have search for any sign of life, and there is not one teeny tiny piece of evidence showing that there is any life out there.\n\nIt seems to me we have more evidence that we are alone in the universe than any other conclusion.\n\nThere is way more evidence that God exists than intelligent Exists in outer space.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "makeminefreedom228",
        "time": "29 June, 2021",
        "context": "There may be life but our galaxies are spread so far apart we won't be able to talk to each other. The nearest galaxy is 42,000 light years away. That means it would take 42,000 years to send a message and another 42,000 years to receive an answer. I don't think anyones going to wait that long for a phone call.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mlow11",
        "time": "29 June, 2021",
        "context": "Of course we’re not alone.  Bill Nelson is a supreme leader from another planet.  Look at him.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "padre986",
        "time": "29 June, 2021",
        "context": "If a ship landed on my farm I would go out and offer a glass of wine and a handshake and define if I’m on the menu.😀",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tln995",
        "time": "29 June, 2021",
        "context": "No not alone….God has always been here.  People want to believe in aliens but not in God….sad. ",
        "good": "2",
        "bad": "1",
        "replies": []
    }
]