[
    {
        "user_name": "freeflyer",
        "time": "9 August, 2021",
        "context": "Article says that they have been tracking these bats since 2014. Yet despite it being only 7 years of data they have noted that there is a change in migratory patterns and they attribute this to climate change (whatever that means). This is where supposed scientist go off the rail. They clearly do not have nearly enough data to make any assessment that the there is any changes in migration happening let alone attribute it to long term climate changes. Whoever said that is guessing - maybe it was just the reporter.",
        "good": "250",
        "bad": "19",
        "replies": [
            {
                "user_name": "editherudite882",
                "time": "9 August, 2021",
                "context": "It's like they tell you about global warming down to the degree.  Yet there were no thermometers scattered about until about 75 years ago, and the slightest change in location can produce different results.  The simple fact is that they have created a general theory and are reciting that theory.  It is all a figment of imagination.",
                "good": "73",
                "bad": "6",
                "replies": [
                    {
                        "user_name": ",brook,",
                        "time": "9 August, 2021",
                        "context": "You guys are insane a scientific theory, and a conspiracy theory are not the same thing.     It’s almost sad that you are so ignorant that you think just because they both have the word theory in their name you think they are equivalent.",
                        "good": "0",
                        "bad": "10",
                        "replies": []
                    },
                    {
                        "user_name": "RustyBarrel",
                        "time": "9 August, 2021",
                        "context": "There are still many areas that aren’t covered.  Do a web search for global thermometer locations.",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "civilwar2020",
                        "time": "9 August, 2021",
                        "context": "No lie. It’s 10 degrees warmer on an average day in my front yard than in my back. That’s only feet away. More convenient lying  science.",
                        "good": "9",
                        "bad": "2",
                        "replies": []
                    },
                    {
                        "user_name": "halflife",
                        "time": "9 August, 2021",
                        "context": "It's not even a theory, it's simply a hypothesis.",
                        "good": "4",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "letsgetrel",
                                "time": "9 August, 2021",
                                "context": "Anthropogenic global warming has been elevated to theory status.\nIt is an ineluctable conclusion from vast sources of data.",
                                "good": "1",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "✨bluehourlife",
                "time": "9 August, 2021",
                "context": "And yet you are able to read a single non-scientific non-peer reviewed human interest article on Foxnews and determine that all bat migration / climate study research is faulty.",
                "good": "6",
                "bad": "6",
                "replies": []
            },
            {
                "user_name": "OrangeTrafficCone",
                "time": "9 August, 2021",
                "context": "There is plenty of data that the earth is warming.  It has been warming since the last ice age when the atmosphere formed to support life.  It has cooler and warmer cycles for sure but there can be no doubt it is warming.\nThe place they go off the rails is blaming it on humans burning of fossil fuels and the assertion that we can actually change the earth's climate by not burning fossil fuels.  \nThe modeling they use is developed by governments and used for political agendas.  You might have noticed that none of the predictions have come true.  ie) NY city is still an island and is not flooded by ocean water,  the world did not enter a mini-ice age in the 1970s as the climate scientists (models) told us it would, we have not lost all of the barrier islands along the Atlantic coast.  \nSo you have to wonder, \"If all of the science is demonstrably wrong\", \"what is behind the climate change agenda?\"\nAnswer: Follow the money!",
                "good": "57",
                "bad": "6",
                "replies": [
                    {
                        "user_name": "jamrpoi336",
                        "time": "9 August, 2021",
                        "context": "\"and the assertion that we can actually change the earth's climate by not burning fossil fuels\" caveat here, it seems it's only America polluting the atmosphere and we are the only ones $paying$ for it.",
                        "good": "4",
                        "bad": "2",
                        "replies": [
                            {
                                "user_name": "OrangeTrafficCone",
                                "time": "9 August, 2021",
                                "context": "Well, they finally admitted that if America reduced our emissions to zero, it wouldn't change the model trajectory.  That tells the whole story.",
                                "good": "3",
                                "bad": "2",
                                "replies": [
                                    {
                                        "user_name": "beadgBass",
                                        "time": "9 August, 2021",
                                        "context": "So you want to make the trajectory worse?",
                                        "good": "0",
                                        "bad": "1",
                                        "replies": [
                                            {
                                                "user_name": "OrangeTrafficCone",
                                                "time": "9 August, 2021",
                                                "context": "That's a dumb question.  Next question...(?)",
                                                "good": "0",
                                                "bad": "1",
                                                "replies": [
                                                    {
                                                        "user_name": "beadgBass",
                                                        "time": "9 August, 2021",
                                                        "context": "If it is a dumb question to you, then you either did not understand it, or you just don't care about the future of this planet.",
                                                        "good": "1",
                                                        "bad": "0",
                                                        "replies": [
                                                            {
                                                                "user_name": "OrangeTrafficCone",
                                                                "time": "9 August, 2021",
                                                                "context": "You can help the planet by just not farting.",
                                                                "good": "0",
                                                                "bad": "0",
                                                                "replies": [
                                                                    {
                                                                        "user_name": "beadgBass",
                                                                        "time": "10 August, 2021",
                                                                        "context": "You can help the planet by doing some serious reading on how you can both understand and help the planet.\nI don't mean political blogs.\nI mean scientific readings.",
                                                                        "good": "1",
                                                                        "bad": "0",
                                                                        "replies": [
                                                                            {
                                                                                "user_name": "OrangeTrafficCone",
                                                                                "time": "10 August, 2021",
                                                                                "context": "I won't guess at your qualifications, but I will tell you that for every environmental activist scientist you can cite, I can find a scientist that reviewed the same data and came to a different conclusion.  Also, if you have ever looked at the \"available\" raw climate data for the last 100 years, you would quickly notice that the scatter is too big to draw any significant conclusions.  Only when you pick a very short period of years, can you reach conclusions that support the environmental climate disaster theories.  Now when you tailor the climate models to reflect that short period, you will extrapolate your desired cataclysmic results.",
                                                                                "good": "0",
                                                                                "bad": "1",
                                                                                "replies": [
                                                                                    {
                                                                                        "user_name": "beadgBass",
                                                                                        "time": "10 August, 2021",
                                                                                        "context": "PhD in zoology. And no, you can't find more than one or two scientists who disagree with anthropogenic global warming. If they exist, they certainly have not published anything on it in the past 15 years.",
                                                                                        "good": "0",
                                                                                        "bad": "0",
                                                                                        "replies": [
                                                                                            {
                                                                                                "user_name": "OrangeTrafficCone",
                                                                                                "time": "10 August, 2021",
                                                                                                "context": "Uh huh,...\"PhD in zoology\"  translation Piled high & Deep in animal excrement.",
                                                                                                "good": "0",
                                                                                                "bad": "1",
                                                                                                "replies": [
                                                                                                    {
                                                                                                        "user_name": "beadgBass",
                                                                                                        "time": "10 August, 2021",
                                                                                                        "context": "My, my, aren't you the mature one!",
                                                                                                        "good": "0",
                                                                                                        "bad": "0",
                                                                                                        "replies": [
                                                                                                            {
                                                                                                                "user_name": "OrangeTrafficCone",
                                                                                                                "time": "10 August, 2021",
                                                                                                                "context": "Well, thank you!",
                                                                                                                "good": "0",
                                                                                                                "bad": "0",
                                                                                                                "replies": []
                                                                                                            }
                                                                                                        ]
                                                                                                    }
                                                                                                ]
                                                                                            }
                                                                                        ]
                                                                                    }
                                                                                ]
                                                                            }
                                                                        ]
                                                                    }
                                                                ]
                                                            }
                                                        ]
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "user_name": "satchmolives",
                        "time": "9 August, 2021",
                        "context": "“It has been warming since the last ice age when the atmosphere formed to support life.”\n\nWhat the heII? The last ice age was approximately 40,000 years ago when the Great Lakes were formed.\n\nThere was life on earth for over THREE BILLION YEARS. That’s if you mean Earth and not earth (land).\n\nIf you mean land, that was about 500 million years ago.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "OrangeTrafficCone",
                                "time": "9 August, 2021",
                                "context": "\"Roughly 20,000 years ago the great ice sheets that buried much of Asia, Europe and North America stopped their creeping advance. ...... As a result—and for reasons that remain unexplained—the waters of the Southern Ocean may have begun to release carbon dioxide, enough to raise concentrations in the atmosphere by more than 100 parts per million over millennia—roughly equivalent to the rise in the last 200 years. That CO2 then warmed the globe, melting back the continental ice sheets and ushering in the current climate that enabled humanity to thrive.\"",
                                "good": "1",
                                "bad": "3",
                                "replies": [
                                    {
                                        "user_name": "beadgBass",
                                        "time": "10 August, 2021",
                                        "context": "Cite the source of your quote, then we can put it into context for you.",
                                        "good": "1",
                                        "bad": "0",
                                        "replies": [
                                            {
                                                "user_name": "OrangeTrafficCone",
                                                "time": "10 August, 2021",
                                                "context": "You're boring me.  I'm not here to teach you.  If you have any skills at all, go teach yourself.",
                                                "good": "0",
                                                "bad": "1",
                                                "replies": [
                                                    {
                                                        "user_name": "beadgBass",
                                                        "time": "10 August, 2021",
                                                        "context": "So you can't cite the quote. Did you just make it up?",
                                                        "good": "0",
                                                        "bad": "0",
                                                        "replies": [
                                                            {
                                                                "user_name": "OrangeTrafficCone",
                                                                "time": "10 August, 2021",
                                                                "context": "So you struggle with the English language?  Confusing \"can't\" with \"won't\" is really a telling clue about you.",
                                                                "good": "0",
                                                                "bad": "1",
                                                                "replies": [
                                                                    {
                                                                        "user_name": "beadgBass",
                                                                        "time": "10 August, 2021",
                                                                        "context": "So you still can't. How pathetic!",
                                                                        "good": "0",
                                                                        "bad": "0",
                                                                        "replies": [
                                                                            {
                                                                                "user_name": "OrangeTrafficCone",
                                                                                "time": "10 August, 2021",
                                                                                "context": "I can see your key strokes but all I read is Hee Haw Hee Haw.",
                                                                                "good": "0",
                                                                                "bad": "0",
                                                                                "replies": [
                                                                                    {
                                                                                        "user_name": "beadgBass",
                                                                                        "time": "11 August, 2021",
                                                                                        "context": "That sounds like your reading level.",
                                                                                        "good": "0",
                                                                                        "bad": "0",
                                                                                        "replies": [
                                                                                            {
                                                                                                "user_name": "OrangeTrafficCone",
                                                                                                "time": "11 August, 2021",
                                                                                                "context": "I have great company.  Come join us.",
                                                                                                "good": "0",
                                                                                                "bad": "0",
                                                                                                "replies": []
                                                                                            }
                                                                                        ]
                                                                                    }
                                                                                ]
                                                                            }
                                                                        ]
                                                                    }
                                                                ]
                                                            }
                                                        ]
                                                    }
                                                ]
                                            }
                                        ]
                                    },
                                    {
                                        "user_name": "beadgBass",
                                        "time": "11 August, 2021",
                                        "context": "I found the source of your quote. It was a 2012 Scientific American article. Now that I see the full text, I see why you put the ... in convenient places, and cut out other parts.\nThe article then goes on to obviate every point you made in an earlier post.\nSo I just piled higher and deeper that undermine your entire argument.\n\nSorry, kid, yours was an epic fail.",
                                        "good": "2",
                                        "bad": "0",
                                        "replies": [
                                            {
                                                "user_name": "OrangeTrafficCone",
                                                "time": "11 August, 2021",
                                                "context": "Aren't you the busy beaver.  So I'm guessing that I am right....you don't have anything to do all day.  But hey, there's lots more info where that came from so keep digging.  Maybe you will actually learn something.",
                                                "good": "0",
                                                "bad": "2",
                                                "replies": []
                                            }
                                        ]
                                    }
                                ]
                            },
                            {
                                "user_name": "beadgBass",
                                "time": "9 August, 2021",
                                "context": "Technically we are still in an ice age, just an interglacial period.\nStrange how temperatures are rising much faster than in previous interglacial periods.",
                                "good": "3",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "user_name": "beadgBass",
                        "time": "9 August, 2021",
                        "context": "\"Follow the money\" is the weak troll's way of saying \"I don't understand the science.\"",
                        "good": "4",
                        "bad": "7",
                        "replies": [
                            {
                                "user_name": "demlibslie1",
                                "time": "10 August, 2021",
                                "context": "the science is flawed kind of like you",
                                "good": "0",
                                "bad": "2",
                                "replies": [
                                    {
                                        "user_name": "beadgBass",
                                        "time": "10 August, 2021",
                                        "context": "The science is actually quite strong and supported by multiple scientific disciplines, including my own field of zoology.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "commonsenseapproachbs",
                "time": "9 August, 2021",
                "context": "Just remember 100% of all climate models have been wrong to date.  There is a huge \"boy who cried wolf\" element that is often overlooked.",
                "good": "11",
                "bad": "8",
                "replies": [
                    {
                        "user_name": "letsgetrel",
                        "time": "9 August, 2021",
                        "context": "It is fair to conclude that you have never -- never ever -- looked at a single scientific paper on climate models, and rely on blogs instead.\n\nThe dirty little secret is that contemporary climate models are frighteningly accurate, tested, and verified.",
                        "good": "2",
                        "bad": "4",
                        "replies": [
                            {
                                "user_name": "commonsenseapproachbs",
                                "time": "10 August, 2021",
                                "context": "Okay.  Provide me with the models that are accurate and tested.  I'll look them up and you can turn me into a believer.  I believe science, so please point me in the right direction.",
                                "good": "1",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "letsgetrel",
                                        "time": "10 August, 2021",
                                        "context": "NOAA has a good summary of them.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "rakulp",
                "time": "9 August, 2021",
                "context": "Why is everything always linked to climate change?  It just shows how little scientists really know about anything.",
                "good": "13",
                "bad": "4",
                "replies": [
                    {
                        "user_name": "shadowbannedagainlmao",
                        "time": "9 August, 2021",
                        "context": "I know, right? Don’t they know that whatever we don’t like hearing about is a lie? Sheesh. They should get an education and become as smart as us.",
                        "good": "0",
                        "bad": "3",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "saggydrawers",
                "time": "9 August, 2021",
                "context": "Not enough data to make any opinion like Climate change.  Bats like most warm blooded mammals migrate where it warm.  We have weather data going back thousands of years but non eof that supports the Climate Agenda.  That itself is overblown and out of touch with real science.",
                "good": "6",
                "bad": "4",
                "replies": [
                    {
                        "user_name": "shadowbannedagainlmao",
                        "time": "9 August, 2021",
                        "context": "Interesting.  What is your field of study, doc?",
                        "good": "3",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "saggydrawers",
                                "time": "10 August, 2021",
                                "context": "Astro-theology",
                                "good": "0",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "shadowbannedagainlmao",
                                        "time": "10 August, 2021",
                                        "context": "Odd that you would put a hyphen in a word that you’re an expert on, when the word isn’t hyphenated. But cool. I can see why you consider yourself an authority on climatology.",
                                        "good": "1",
                                        "bad": "1",
                                        "replies": [
                                            {
                                                "user_name": "saggydrawers",
                                                "time": "10 August, 2021",
                                                "context": "Climate is not just the Ambient Temperatures of ones environment physically.  It is also the Ambient Temperatures and temperment of ones Mental and Spiritual environments as well.",
                                                "good": "0",
                                                "bad": "0",
                                                "replies": [
                                                    {
                                                        "user_name": "shadowbannedagainlmao",
                                                        "time": "10 August, 2021",
                                                        "context": "Gotcha.  You're insane.",
                                                        "good": "0",
                                                        "bad": "0",
                                                        "replies": []
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "fover",
                "time": "9 August, 2021",
                "context": "They were Chinese scientists, so it's possible they could make this deduction after seeing one bat.",
                "good": "11",
                "bad": "4",
                "replies": [
                    {
                        "user_name": "Tenshi",
                        "time": "9 August, 2021",
                        "context": "Chinese scientists supported by the CDC and Fauci.",
                        "good": "7",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "bikepharm",
                "time": "9 August, 2021",
                "context": "That BAT Pelosi routinely flies farther that that utilizing a broom.",
                "good": "6",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "WarlpiriMan",
                "time": "9 August, 2021",
                "context": "It is now well-established orthodoxy is that if students, from Kindy through to PhD programs, answer any and all test questions with 'Climate Change', they will pass and probably with Honors.",
                "good": "15",
                "bad": "4",
                "replies": []
            },
            {
                "user_name": "shadowbannedagainlmao",
                "time": "9 August, 2021",
                "context": "How much data would be enough in your scientific opinion?",
                "good": "4",
                "bad": "6",
                "replies": [
                    {
                        "user_name": "HA814WA",
                        "time": "10 August, 2021",
                        "context": "There is never enough data, science is just an educated guess.",
                        "good": "2",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "shadowbannedagainlmao",
                                "time": "10 August, 2021",
                                "context": "So if there’s never enough data, we’ll just ignore whatever we don’t like the sound of?",
                                "good": "2",
                                "bad": "1",
                                "replies": [
                                    {
                                        "user_name": "Shitzandgiggles",
                                        "time": "10 August, 2021",
                                        "context": "If…blah blah, then…blah blah. Sounds a lot like a an hypothesis followed by a conclusion.  Not terribly “scientific”. ",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": [
                                            {
                                                "user_name": "shadowbannedagainlmao",
                                                "time": "10 August, 2021",
                                                "context": "If you would like to tell me what part of that confused you, I can maybe translate it into Red Hat.",
                                                "good": "0",
                                                "bad": "0",
                                                "replies": []
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "irie366",
        "time": "9 August, 2021",
        "context": "Cats? Ask the Australians what they think of them. I personally think that they are the most destructive invasive species ever! Owners have no clue as to what they do...",
        "good": "13",
        "bad": "16",
        "replies": [
            {
                "user_name": "thercattrainer",
                "time": "9 August, 2021",
                "context": "That’s why cats need to be spayed or neutered while staying indoors. ",
                "good": "10",
                "bad": "4",
                "replies": []
            },
            {
                "error": "error"
            }
        ]
    },
    {
        "user_name": "ts2122",
        "time": "9 August, 2021",
        "context": "This is what happens when you leave a free, capitalist society for a socialist society.",
        "good": "25",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "arnoldthepoet",
        "time": "9 August, 2021",
        "context": "apparently, cats are the first item to worry over what may affect their migratory patterns!",
        "good": "55",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "EmptyMoneybags",
        "time": "9 August, 2021",
        "context": "The bat of course could have hitched a ride on a airplane cargo area or on a ocean liner. An overnight cargo plane is most likely. ",
        "good": "70",
        "bad": "4",
        "replies": [
            {
                "user_name": "(|)387",
                "time": "9 August, 2021",
                "context": "It must glide a lot on the air currents? Wonder how long the journey took.",
                "good": "3",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "wallyman2",
                        "time": "9 August, 2021",
                        "context": "What?  the cargo plane???",
                        "good": "2",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "cunning1",
        "time": "9 August, 2021",
        "context": "I guess Van Helsing won't have to worry about that one. Ha",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "thercattrainer",
        "time": "9 August, 2021",
        "context": "That’s a heck of a way to die after flying that far! ",
        "good": "7",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Covidcandy",
        "time": "9 August, 2021",
        "context": "Bat rehab?   that's so exciting.....Wonder if Fauci is an investor.",
        "good": "51",
        "bad": "5",
        "replies": [
            {
                "user_name": "PurpleBulb",
                "time": "9 August, 2021",
                "context": "Good thing it didn't fall in to the Chinese hands---it might have been eaten for lunch.",
                "good": "25",
                "bad": "2",
                "replies": [
                    {
                        "user_name": "1951stu",
                        "time": "9 August, 2021",
                        "context": "But not before infecting millions!",
                        "good": "1",
                        "bad": "1",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "mrkimber",
        "time": "9 August, 2021",
        "context": "The poor little thing. Cats are serial killers.",
        "good": "5",
        "bad": "7",
        "replies": []
    },
    {
        "user_name": "ashehousewares",
        "time": "9 August, 2021",
        "context": "Did it knock over any water bottles?",
        "good": "19",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "bonnie_blue_flag",
        "time": "9 August, 2021",
        "context": "I thought bats are bad, carriers of viruses.\n\nShould we not kill all bats?",
        "good": "0",
        "bad": "4",
        "replies": [
            {
                "user_name": "jimbob5006",
                "time": "9 August, 2021",
                "context": "Lets ask Ozzie. Wonder if has been on Jeopardy?",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "bonnie_blue_flag",
        "time": "9 August, 2021",
        "context": "It’s not an Olympian.\n\nIt did not even go to the trials.",
        "good": "3",
        "bad": "0",
        "replies": [
            {
                "user_name": "winterwarrior",
                "time": "9 August, 2021",
                "context": "Vaccine trials?",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "wdreefer123",
        "time": "9 August, 2021",
        "context": "This makes the news????",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "BillDuffer",
        "time": "9 August, 2021",
        "context": "Tomorrow's headline, cat infected with Omega Varient of WuhanFlu.",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "OrangeGoggles",
        "time": "9 August, 2021",
        "context": "I LOVE bats! They are just the coolest!",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Misfit",
        "time": "9 August, 2021",
        "context": "Dr Death Fauci experiments going international!!",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "🔥🌑🌑🌑🔥",
        "time": "9 August, 2021",
        "context": "When I saw the pic I thought it was Detroit.",
        "good": "16",
        "bad": "2",
        "replies": [
            {
                "user_name": "1951stu",
                "time": "9 August, 2021",
                "context": "I thought it was Maxine Waters without her James Brown wig smiling.",
                "good": "10",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "wdreefer123",
        "time": "9 August, 2021",
        "context": "Well anyway the bats a better athlete than S. Biles. At least the bat didn’t quit. ",
        "good": "56",
        "bad": "15",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "kingsknight2",
        "time": "9 August, 2021",
        "context": "\"The travel route of the Nathusius' pipistrelle – which needs a suitable habitat as a migratory species – could also be impacted by wind turbines, both onshore and offshore.\n\"Better knowledge can help inform the positioning and management of wind turbines to reduce risks,\" the release added.\"\n\nObviously this has to do with *climate change*......Yes good old climate change.  Any quirks in the weather or strange things happening to critters is all about climate change....we need to spend mucho more money on climate change, lots more....",
        "good": "85",
        "bad": "8",
        "replies": [
            {
                "user_name": "Nukeman999",
                "time": "9 August, 2021",
                "context": "🤣 good one....",
                "good": "11",
                "bad": "3",
                "replies": []
            }
        ]
    },
    {
        "user_name": "GoldPopsicle",
        "time": "9 August, 2021",
        "context": "Sounds like a tourist that goes to New York City only to be shot and robbed by the feral 13%",
        "good": "30",
        "bad": "1",
        "replies": [
            {
                "user_name": "bonnie_blue_flag",
                "time": "9 August, 2021",
                "context": "Or Seattle where you will get stomped on the head by one.",
                "good": "26",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "DougDryden",
        "time": "9 August, 2021",
        "context": "Well, a cat's gotta do what a cat's gotta do.",
        "good": "5",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "diver_down47",
        "time": "9 August, 2021",
        "context": "Mystery solved. The missing Wuhan bat that escaped from the lab.",
        "good": "23",
        "bad": "3",
        "replies": [
            {
                "user_name": "wallyman2",
                "time": "9 August, 2021",
                "context": "and to think Randy from South Park had sex with the poor thing. . .",
                "good": "2",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "justgoaway",
        "time": "9 August, 2021",
        "context": "Is the cat okay? Has it gone batty?",
        "good": "8",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "GoldPopsicle",
        "time": "9 August, 2021",
        "context": "I bet the Killer Cat was Black. It’s what they do, it’s who they be",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "RamoanSamoan",
        "time": "9 August, 2021",
        "context": "The cat in this, shall we say, funny and sad story obviously doesn't give a tinker's da__n about when and where a thumb sized bat goes and how it is guided by global warming. \n\nThe sad thing about this story is that now (6:02 AM EDT) I can't have a bigger and better laugh for the rest of this day.\n\nOK, that's enough foolishness, I have to get to my job of attaching tracking bands to my assigned flock of mosquitos. I have to tag at least 1,000 per day. Most of them die before getting out of the neighborhood, but you know, everybody has to make a living somehow.",
        "good": "20",
        "bad": "1",
        "replies": [
            {
                "user_name": "1951stu",
                "time": "9 August, 2021",
                "context": "Have you figured out how climate change has affected the mosquito population in your neighborhood?",
                "good": "9",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "RamoanSamoan",
                        "time": "9 August, 2021",
                        "context": "No. 'cause we (unbeknownst to our researchers) tag 'em and then place them in jars that are then loaded onto a refrigerated truck headed to Alaska.  Now this really throws a monkey wrench into the scientific data, but these idiot scientists that me and Earl work for are still insisting on global warming. Go figure, huh.",
                        "good": "6",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "1951stu",
                                "time": "9 August, 2021",
                                "context": "I can't wait to read their report. But I know now to take it with a grain of salt.",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "SagittariusA*",
        "time": "9 August, 2021",
        "context": "I guess the Chinese aren’t the only things on earth that eat bats. ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "😲gam-esq5.0😲",
        "time": "9 August, 2021",
        "context": "This has Dr. Seuss potential: \"Olympic Bat, who ate a rat, killed by a cat, and that is that!\"",
        "good": "47",
        "bad": "3",
        "replies": [
            {
                "user_name": "truth007",
                "time": "9 August, 2021",
                "context": "Good one!",
                "good": "8",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "bonnie_blue_flag",
        "time": "9 August, 2021",
        "context": "So after this big bad virus the earth is still overpopulated.\n\nWhat we need is a major plague to kill about 1/2 the population in order to cleanse the earth",
        "good": "2",
        "bad": "0",
        "replies": [
            {
                "user_name": "winterwarrior",
                "time": "9 August, 2021",
                "context": "... of progressive liberals. ",
                "good": "3",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "nomorelaws468",
        "time": "9 August, 2021",
        "context": "rescued by a Russian bat rehabilitation group \n\nThose crazy Russians",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "libssuckbd",
        "time": "9 August, 2021",
        "context": "Testing of more biochemical weapons!!!!",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "UltraRight",
        "time": "9 August, 2021",
        "context": "\"An \"Olympic bat\" the size of a human thumb managed to fly more than 1,200 miles from London to Russia – only to be killed by a cat.\"\nDon't blame the cat.  I'll bet the bat didn't even have a flight plan.",
        "good": "45",
        "bad": "1",
        "replies": [
            {
                "user_name": "johnfrankwillia",
                "time": "9 August, 2021",
                "context": "Or a passport",
                "good": "7",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "JohnDoe55005500",
        "time": "9 August, 2021",
        "context": "good kitty",
        "good": "4",
        "bad": "1",
        "replies": [
            {
                "user_name": "winterwarrior",
                "time": "9 August, 2021",
                "context": "awwww. You beat me to it!",
                "good": "2",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "art0fwar1776",
        "time": "9 August, 2021",
        "context": "We need to buy Pelosi a cat.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "PurpleBulb",
        "time": "9 August, 2021",
        "context": "HAVE ANY OF YOU SEEN DRACULA?    BETWEEN THE BATS AND THE CATS---I AM ON TEAM CAT.",
        "good": "9",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "regicidalbestfriend",
        "time": "9 August, 2021",
        "context": "Was it a black cat by any chance?",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "tocqueville",
        "time": "9 August, 2021",
        "context": "Nah, the bat hitched a ride on a Norwegian cruise ship - one that had no vax rules, apparently.\nAnd BTW - good for the cat - just doing its job.\nLike they said in Stalingrad in 1942-43 about another invader, 'You came a long way just to die'.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Obamawasafraud",
        "time": "9 August, 2021",
        "context": "Probably has more courage then Some at the Olympics like a certain gymnast !",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "pronghorn",
        "time": "9 August, 2021",
        "context": "BLM",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "just_admit_it",
        "time": "9 August, 2021",
        "context": "Yet, another example of flying blind gone bad....",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "USAallthewaytoday",
        "time": "9 August, 2021",
        "context": "Bats lives matter! ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "balrogs69",
        "time": "9 August, 2021",
        "context": "I want to see pic of that awesome cat",
        "good": "3",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "rogertheindependent",
        "time": "9 August, 2021",
        "context": "..and now Fauci and his Chinese and Russian research buddies will blame this bat with being the source of COVID-19.  They'll all say that the British were intentionally trying to infect Russia.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "collusiondelusion2019",
        "time": "9 August, 2021",
        "context": "Great, another strain of Covid coming",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "LoveLaughterAndSarcasm",
        "time": "9 August, 2021",
        "context": "When the cat was interviewed : 🐱” Yeah, 1,200 miles ended by one strike of my paw.” 🎤 drop",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "RickInIndy",
        "time": "9 August, 2021",
        "context": "Within every cat lies the heart of a lion.  Or the gateway to hell.  One of those two.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bluevanmansc",
        "time": "9 August, 2021",
        "context": "Trump is too blame for this",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "OZ1290",
        "time": "9 August, 2021",
        "context": "This is news?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ssn590(ss)",
        "time": "9 August, 2021",
        "context": "Rabies carrier.  Good riddance.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bigmikegalaxy",
        "time": "9 August, 2021",
        "context": "Scary, weird, often rabies-infested little monsters.  Oh, wait.  Sorry, I thought we were talking about Whoopi Goldberg and her cast mates on The View.  My bad!",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "equinox5933",
        "time": "9 August, 2021",
        "context": "The cat mistook the bat for a BLM MEMBER.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "chentallymallenged1",
        "time": "9 August, 2021",
        "context": " is linked to climate change.\nRepetition is key to your believing it.",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "derangedspaniard",
        "time": "9 August, 2021",
        "context": "Someone should give the cat a gold medal for a job well done.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "pete0107",
        "time": "9 August, 2021",
        "context": "Good job FOX!  This has to be today's top news story.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "alfredstoner",
        "time": "9 August, 2021",
        "context": "Demacat cat or kat for the dumb or dembs",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "RED-5",
        "time": "9 August, 2021",
        "context": "GOOD KITTY!!!!!!!!",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "campfunnyfarm",
        "time": "9 August, 2021",
        "context": "I know i am going to pissoff a lot of people but this is hysterical 🤣 😂 😆",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "namvet038",
        "time": "9 August, 2021",
        "context": "An Olympic Bat named Fauci is killed by a local cat named Patriot.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "john7755",
        "time": "9 August, 2021",
        "context": "circle of life",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "error": "error"
            }
        ]
    },
    {
        "user_name": "obamawho?",
        "time": "9 August, 2021",
        "context": "That’s just China trying  to blame COVID on England by dropping a bat in Russia and blaming a cat for killing a bat. Nice try President  Xi but your overthinking things!",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "TheSmartGuy1",
        "time": "9 August, 2021",
        "context": "Chinese propaganda media is encouraging everyone to “eat mor cat”",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mikez11",
        "time": "9 August, 2021",
        "context": "Probably illegally boarded some plane",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "(|)387",
        "time": "9 August, 2021",
        "context": "Fauci is the problem and his Chinese accomplices, not bats.\nThat bat deserves a gold medal. \nFauci and the bat lady can be hung upside down deep inside a cave.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "kolv91",
        "time": "9 August, 2021",
        "context": "Chinese bat virus traveling around the globe, unstoppable.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "regalley900",
        "time": "9 August, 2021",
        "context": "Cats suck.",
        "good": "4",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "jaja009",
        "time": "9 August, 2021",
        "context": "cats rule",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "sho'nuff",
        "time": "9 August, 2021",
        "context": "Animals can do some pretty amazing things.   Hummingbirds migrate 2500 miles with their wings beating up to 80 times a second.   That is a lot of flapping.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "helltopay038",
        "time": "9 August, 2021",
        "context": "Now that's a racist cat......",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Bring_It_On",
        "time": "9 August, 2021",
        "context": "And now the bat will be voting Democrat.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "libmindsrdiseased",
        "time": "9 August, 2021",
        "context": "Cats are awesome.",
        "good": "2",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "AmericaFIRST467",
        "time": "9 August, 2021",
        "context": "Now England has a natural transporter to deliver things to Russia",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "StrandedinLaos+FJB",
        "time": "9 August, 2021",
        "context": "The chinese are the masters at this...Did that cat have any chinese connection? What was the cat trying to destroy? Maybe the cat was trying to cover up the Wu-flu (Euro strain)",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "depalma13136",
        "time": "9 August, 2021",
        "context": "Cat just stopping by the spread of disease.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "woofgang",
        "time": "9 August, 2021",
        "context": "Does the cat win a gold medal?",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "fredfarkleberry",
                "time": "9 August, 2021",
                "context": "No but I bet it doesn't whine about it for a month on international news and Fox doesn't help either!",
                "good": "0",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "crewcutrick",
        "time": "9 August, 2021",
        "context": "Good kitty!!",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "thebuydimcrimefamily",
        "time": "9 August, 2021",
        "context": "Maxipad Waters' baby picture.",
        "good": "17",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "marko66",
        "time": "9 August, 2021",
        "context": "Carrying the dreaded Cockney variant!",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "karek",
        "time": "9 August, 2021",
        "context": "Bat Lives Matter, but not to a cat.\nWasn't aware any critter traveled by climate, I have read - magnetic fields, stars, even winds but climate, suspect a liberal made that statement.",
        "good": "18",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "TheSmartGuy1",
        "time": "9 August, 2021",
        "context": "Fauci declares cats the cure for Covid. Manufacturer’s are furiously trying out gadgets to attach cats to peoples faces",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "OrangeWeights",
        "time": "9 August, 2021",
        "context": "I love all animals, but I hate when people leave their cats outdoors. I see so many birds destroyed by cats, sad.",
        "good": "11",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "tableg13",
        "time": "9 August, 2021",
        "context": "Apparently Russian cats are smart enough not to eat bats. \nKill them? yeah, but not eat. Yuck!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bailey05",
        "time": "9 August, 2021",
        "context": "Who knew that Russia had a bat rehabilitation group??",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "liberals_are_why_we_can't_have_nice_things",
        "time": "9 August, 2021",
        "context": "Bat Lives Matter.",
        "good": "15",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "roy998",
        "time": "9 August, 2021",
        "context": "Sure it did !",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "libsdonlast",
        "time": "9 August, 2021",
        "context": "How do they know if some russian kids in a different neighborhood didn't write london zoo on it and are sitting back laughing thier bums off !",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tonykat",
        "time": "9 August, 2021",
        "context": "Too bad so sad!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rwr450",
        "time": "9 August, 2021",
        "context": "Had there been an investigation to see if it was a white cat that murdered the black bat? Most likely a hate crime that can be used to motivate racial unrest worldwide.",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "marvinshort1953",
        "time": "9 August, 2021",
        "context": "This is why you need a tennis racquet.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Apollo9305",
        "time": "9 August, 2021",
        "context": "Shame it wasn’t carrying an infectious disease - Fauci could use that.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "diktheduk",
        "time": "9 August, 2021",
        "context": "Russian bat rehabilitation group. Wonder if that is an arm of the GRU?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "saitlykitiz",
        "time": "9 August, 2021",
        "context": "Ill bet the cat didn’t even bat an eye!",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "spfish",
        "time": "9 August, 2021",
        "context": "\"...Russian bat rehabilitation group...\"  LOL  LOL....",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bms711",
        "time": "9 August, 2021",
        "context": "I guess it's Olympic event was \"long distance flying\".",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bluemountainoysters3353",
        "time": "9 August, 2021",
        "context": "Lets reward the cat for keeping that bat from reaching Wuhan.",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Hammeron",
        "time": "9 August, 2021",
        "context": "That bat looks like AOC!",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "ProudDeplorableWokaphobic",
        "time": "9 August, 2021",
        "context": "Cats rule.",
        "good": "10",
        "bad": "3",
        "replies": [
            {
                "user_name": "(|)387",
                "time": "9 August, 2021",
                "context": "That bat logged a lot of miles and finally reached its destination...only to get pounced on by a cat!",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "slayerofall",
        "time": "9 August, 2021",
        "context": "Bat had an odometer attached",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "thewoof'sback",
        "time": "9 August, 2021",
        "context": "Ahha!  The Delta bat......",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "DumbdadumbBiden",
        "time": "9 August, 2021",
        "context": "They didn't know that bats travel this far but, the do know that it's because of climate change. Really?",
        "good": "23",
        "bad": "1",
        "replies": [
            {
                "user_name": "doc126",
                "time": "9 August, 2021",
                "context": "Forget the fact that another bat had traveled even further once before. Yes, the earthly cycle changes, which man has known about for centuries are suddenly the cause of everything negative happening in the world. They are the reason we must spend more money on an infrastructure bill. They are the reason money must be spent on the Kennedy Center ( ~ Nanny Pee-lousy). They are the reason for a Variant of Covid-19 ( ~ Dr. Fauci). They are the reason for the oceans rising so I am buying Beachfront property ( ~ Al Gore). They are the reason I am cancelling the Keystone XL Pipeline & all of those jobs which would have been going to American Indians ( ~ joe biden), etc., etc., etc.!\n\n.\n\n.",
                "good": "4",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "marvinshort1953",
        "time": "9 August, 2021",
        "context": "Oh, great. Now we have the Nathusius variant.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "doc126",
        "time": "9 August, 2021",
        "context": "\"The Bat was heading back to China in order to reload its supply of Covid-19 Variant to unload upon the world & cause another pandemic!\"\n~ Dr. Fauci",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "texasisnotforliberals",
        "time": "9 August, 2021",
        "context": "Any chance the cat was named Ozzy?",
        "good": "18",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "wewil",
        "time": "9 August, 2021",
        "context": "The bat was probably kneeling in protest when the cat got it.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "ferrariguy",
        "time": "9 August, 2021",
        "context": "Probably headed for the lab in Wuhan...",
        "good": "13",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "antoniusbloch",
        "time": "9 August, 2021",
        "context": "That bat obviously practices poor dental hygiene.  Compare with the big-toothed fish from the fox article of a couple of days ago. You can tell right away that the fish brushes.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "martin1955896",
        "time": "9 August, 2021",
        "context": "It was a homing bat?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "IQ168-plus",
        "time": "9 August, 2021",
        "context": "I learn something new every day.  Who would have thought that anyone would want to preserve bats?  Buried in the article was their danger from \"wind turbines\" - the well known 'green energy' boondoggle that slices and dices birds.",
        "good": "8",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "rolfehumphries",
        "time": "9 August, 2021",
        "context": "Now the cat will turn into a vampire.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "wallyman2",
        "time": "9 August, 2021",
        "context": "Used to crew on off-shore sailboat races on Lake Michigan in my younger days.  It was fairly common to have a bat or 2 land on the boat during the night when we were out of sight of land.  Lots of times, they'd basically \"crash land\" on the boat out of sheer exhaustion, and we'd have to gently pick them up and place them somewhere safe while they rested up.   There was even a few that wouldn't leave.  We'd finally get into port and have to \"transfer\" them to the nearest tree.  poor l'il guys!  \n\nHad the same thing happen with small birds during the day at times as well.  They'd land on the life lines right next to you, or up in the rigging somewhere and rest up for a couple hours before heading on their merry way.",
        "good": "63",
        "bad": "4",
        "replies": [
            {
                "user_name": "AlwaysUSA248",
                "time": "9 August, 2021",
                "context": "That’s nice that you help them and gave them a ride. 😃.  Lol my grandma‘s neighbor used to chase them around with a broom. I don’t know who was more scared us little kids or the bats and we run around screaming and I couldn’t figure out why she wouldn’t just let them be. ",
                "good": "18",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "rpayne556",
                "time": "9 August, 2021",
                "context": "Where did you race “off shore” from Lake Michigan.   I foolishly thought Lake Michigan was land locked.  🤣🤣🤣",
                "good": "1",
                "bad": "20",
                "replies": [
                    {
                        "user_name": "wallyman2",
                        "time": "9 August, 2021",
                        "context": "It's all perspective, my man!  ;)  \n\n\"The Great Lakes!  No Salt, and Shark Free!\"",
                        "good": "11",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "DemocratsDisgustMe",
                        "time": "9 August, 2021",
                        "context": "I wish you experienced the same pain the rest of us do while reading your stupidity!  ",
                        "good": "12",
                        "bad": "3",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "OrangeMustache",
        "time": "9 August, 2021",
        "context": "The cat won the gold 🏅",
        "good": "2",
        "bad": "0",
        "replies": [
            {
                "user_name": "(|)387",
                "time": "9 August, 2021",
                "context": "For what country, thinking UK",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "error": "error"
    },
    {
        "user_name": "ranger75th383",
        "time": "9 August, 2021",
        "context": "I guess the bat should have stayed where it was at.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "clynn",
        "time": "9 August, 2021",
        "context": "Hope the cat was wearing a mask and was vaccinated. ",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "dbrint",
        "time": "9 August, 2021",
        "context": "I suppose now this bat is a \"hero.\"   Its a bat!  Hec, if it was near your kids or flying around in your house you'd of swatted it down.  Good kitty. ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sdmmd",
        "time": "9 August, 2021",
        "context": "China sent it with he virus...way to go cat",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "lizardman",
        "time": "9 August, 2021",
        "context": "That's batty",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "joyserve25309",
        "time": "9 August, 2021",
        "context": "My take on the climate change theory, unless these experts were around billions of years ago, the earth has been warming and cooling long before man came along, and the earth will continue the process long after man has gone.",
        "good": "92",
        "bad": "11",
        "replies": [
            {
                "user_name": "sciencerocks",
                "time": "9 August, 2021",
                "context": "These scientists know a LOT more about past climate change than you.\nThat is how we know that something has gone awry in the past century.",
                "good": "12",
                "bad": "15",
                "replies": []
            },
            {
                "user_name": "dixiepixie207",
                "time": "9 August, 2021",
                "context": "We are responsible for polluting earth ,dont be the problem ,as a senior ive seen how humans are destructive mindless consuming locusts,we are most stupid selfish generation!",
                "good": "5",
                "bad": "5",
                "replies": []
            }
        ]
    },
    {
        "user_name": "chile10001488",
        "time": "9 August, 2021",
        "context": "Funny and sad.. That's how hungry the people of china are thanks to their government. They live off an animal a cat won't eat.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "(|)387",
                "time": "9 August, 2021",
                "context": "Bats keep the bug population down except in D.C.",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "HotCarl80",
        "time": "9 August, 2021",
        "context": "That bat is a metaphor for the Toyko Olympic games.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "brockton-by-the-sea",
        "time": "9 August, 2021",
        "context": "There's a cat that knows how to deal with illegal immigrants.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "tuk-z",
        "time": "9 August, 2021",
        "context": "From the cat's perspective, it was business; not personal.",
        "good": "18",
        "bad": "1",
        "replies": [
            {
                "user_name": "ranger75th383",
                "time": "9 August, 2021",
                "context": "Now that was funny.",
                "good": "4",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "mcf25",
        "time": "9 August, 2021",
        "context": "Poor thing was probably weighed down by the ring they put on it, which is why the cat caught it, which is why PETA should go after them with a lawsuit.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Alotta.Anger",
        "time": "9 August, 2021",
        "context": ".\nReminds me of the attempted release of Snuffy the seal a few years ago . . . . \n\nOne of he all time great commercials.\n\n.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "joyserve25309",
        "time": "9 August, 2021",
        "context": "Love cats, I hope the cat wasn't white, CNN,MSNBC,etc! will be all over that story, will BCLM groupies riot and accuse the cat of being racist, maybe defund cat chow or stage protest at humane societies? just asking.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "JohnnyBBadd",
        "time": "9 August, 2021",
        "context": "Did the bat provide a negative PCR test before flying to Russia?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bobg.",
        "time": "9 August, 2021",
        "context": "Watch out now, the cat has COVID!",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "biscuitcrux",
        "time": "9 August, 2021",
        "context": "There is nothing good to be said about cats. Ever. \nCats are murdering, serpent-eyed animal kingdom terrorists.",
        "good": "1",
        "bad": "4",
        "replies": [
            {
                "user_name": "hicksie",
                "time": "9 August, 2021",
                "context": "You're just jealous cuz you don't have claws !!!!!  LOL",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "biscuitcrux",
                        "time": "9 August, 2021",
                        "context": "Sure I am. Sure.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "rockriverlar15761",
        "time": "9 August, 2021",
        "context": "Good cat. Was it Walter?",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "eteee051",
        "time": "9 August, 2021",
        "context": "\"The travel route of the Nathusius' pipistrelle ........ could also be impacted by wind\n turbines, both onshore and offshore.\n\"Better knowledge can help inform the positioning and management of wind turbines to reduce risks,\" the release added.\"......\nYeah !!! Let's place the Wind Turbines away from the Flyways where there's no wind!!! SMART!!!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "DaCultfider",
        "time": "9 August, 2021",
        "context": "Yo UK, mess with a Russia and get hurt",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "atlantisauthor",
        "time": "9 August, 2021",
        "context": "The domestic cat is the single most destructive pet in history.  I don't hate them (I've owned several), but they are absolutely devastating to wildlife wherever they're allowed to roam outside their homes, and if they go feral they can and have caused extinction events.  One famous example was a cat named Tibbles that lived at a lighthouse on Stephens Island in 1894.  The last remaining colony of Lyall's Wrens happened to reside on that same island; they once had been widespread throughout New Zealand but were hunted to extinction by the Maori.  Lyall's Wrens were small, flightless birds, and Tibbles killed every last one of them.\n\nUnfortunately, it's what cats do.  And even when well-fed, they do so for pure sport, as it were, sometimes to an obsessive degree.\n\nAustralia estimates that domestic and feral cats in particular account for BILLIONS of wildlife deaths there every year, often involving species that are already endangered.  While other countries generally don't keep such detailed records, the full toll the domestic housecat has taken on global wildlife is appalling.\n\nIt goes without saying that pet cats should be kept indoors at all times and that feral populations are a menace.  On a deeper level it also goes to show how they're a fitting companion for humans, since we tend to destroy everything we touch.\n\nI just felt the urge to post this upon reading the headline, because like countless others, this bat's death was both tragic and unnecessary.",
        "good": "3",
        "bad": "4",
        "replies": [
            {
                "user_name": "thomasmedicine",
                "time": "9 August, 2021",
                "context": "Cats stay around humans for the rodents that also stay around humans. Cats shouldn't take the blame because humans are the ones bringing the cats with them. I'm sure Tibbles didn't choose to live at a lighthouse on an island.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "papakev",
        "time": "9 August, 2021",
        "context": "Oh great, the London Russia Bat Cat fever. We're doomed!",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "kamano55",
        "time": "9 August, 2021",
        "context": "The \"ring\" around its neck probably had as much to do with it dying as the cat.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Armyguy74112",
        "time": "9 August, 2021",
        "context": "bat'er up",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "guitargeek111",
        "time": "9 August, 2021",
        "context": "Like that demotivational poster with the bear and salmon says; 'A journey of 1000 miles sometimes ends very badly.'",
        "good": "7",
        "bad": "0",
        "replies": [
            {
                "user_name": "rickinjerusalem",
                "time": "9 August, 2021",
                "context": "THAT is funny!!",
                "good": "3",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "jgwingfield",
        "time": "9 August, 2021",
        "context": "That's my kitten.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jsmith970",
        "time": "9 August, 2021",
        "context": "China is taking some pretty lame steps to deflect their role in the coronavirus by labeling a bat \"London Zoo\" and letting it loose into the wild.",
        "good": "39",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "HammerToe196",
        "time": "9 August, 2021",
        "context": "Offer it to the local Chinese restaurant.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "WLeoB",
        "time": "9 August, 2021",
        "context": "Knew a man that had a cat. His wife kept a bird in a cage in her kitchen. Cat would watch that bird with lust for hours. One day, cat was sleeping in the living room and the bird got out of the cage and flew a maiden flight though the living room. Cat woke, leaped off the couch and nailed that bird mid air. Wife was there immediately to pronounce the bird DOA! LOL",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "jel88",
        "time": "9 August, 2021",
        "context": "it was a KGB Kat that killed it....cause it was a spy bat.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Obtusionist",
        "time": "9 August, 2021",
        "context": "Cats have to eat too.",
        "good": "4",
        "bad": "1",
        "replies": [
            {
                "user_name": "Armyguy74112",
                "time": "9 August, 2021",
                "context": "cat lives matter",
                "good": "6",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "Obtusionist",
                        "time": "9 August, 2021",
                        "context": "Cats and bats matter, you can't stop nature.",
                        "good": "0",
                        "bad": "1",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "brianskinsfan",
        "time": "9 August, 2021",
        "context": "Was headed to Transylvania.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jsmith970",
        "time": "9 August, 2021",
        "context": "Two questions.\nWho cares?\nWho cares?",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "34u2",
        "time": "9 August, 2021",
        "context": "So does this mean we need to worry about wuhan bats flying here from china with the new china virus?",
        "good": "6",
        "bad": "1",
        "replies": [
            {
                "user_name": "joecars",
                "time": "9 August, 2021",
                "context": "..... no, the virus has to be modified in the lab first ... just ask that little PR--k Dr. Fauci  !!!",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "maometto207",
                "time": "9 August, 2021",
                "context": "Probably. China/Fauci weaponized  Wuhan virus so they will send infected bats and whatever else to our shores. ",
                "good": "0",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "Aimsmallmisssmall",
        "time": "9 August, 2021",
        "context": "Good kitty.",
        "good": "7",
        "bad": "1",
        "replies": [
            {
                "user_name": "(|)387",
                "time": "9 August, 2021",
                "context": "Cat woman what would life be like without cats in the world, well Joker Without cats, there's a lot of rat-mouths to feed. Our agricultural systems would collapse, and now with disease rampant, \nand food scarce, humans would be forced to scrounge for scraps… kind of like rats! But humans aren't the only ones who have to worry.",
                "good": "2",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "seeker9",
        "time": "9 August, 2021",
        "context": "well smart cat..it didn't eat it, just like most dishes from England.",
        "good": "17",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "AmericaIsGreat540",
        "time": "9 August, 2021",
        "context": "Curious if that bat was patient zero",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "(|)387",
        "time": "9 August, 2021",
        "context": "Batman what would life be like without bats in the world, well Robin One bat can eat between 600 to 1,000 mosquitoes and other flying pests in just one hour! If bats disappear the insect \npopulation will boom, causing crop failure, economic damage and human illness.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "FLbyBirthTXbyChoice",
        "time": "9 August, 2021",
        "context": "Here's our prep for next virus pandemic. ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "myname325603",
        "time": "9 August, 2021",
        "context": "These scientists have been monitoring a handful of bats for a mere seven years but have come to the conclusion that every nuance is attributed to climate change. So the climate changed just in the past seven years? ",
        "good": "79",
        "bad": "6",
        "replies": [
            {
                "user_name": "34u2",
                "time": "9 August, 2021",
                "context": "And they have been monitoring weather for just a little longer (150 yrs.),, very accurate conclusions!",
                "good": "8",
                "bad": "6",
                "replies": [
                    {
                        "user_name": "sciencerocks",
                        "time": "9 August, 2021",
                        "context": "We have climate data going back 700,000 years in high resolution, millions of years in lower resolution.",
                        "good": "3",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "34u2",
                                "time": "10 August, 2021",
                                "context": "And who were the weather forecasters back then? All you have is dirt, rocks and petrified trees,,, then someone's best educated guess as to the climate! Was aoc there to verify the conclusions?",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "fover",
                "time": "9 August, 2021",
                "context": "My guess is the bats aren't migrating, they are being caught and transported to Wuhan",
                "good": "28",
                "bad": "5",
                "replies": [
                    {
                        "user_name": "esarem",
                        "time": "9 August, 2021",
                        "context": "And now the cat has Covid.",
                        "good": "2",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "markk.",
                        "time": "10 August, 2021",
                        "context": "As a food source, I would presume.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "beadgBass",
                "time": "9 August, 2021",
                "context": "Yes, climate has changed.\nOddly enough, animals and even plants are more in tune with this than some humans, as biogeographical ranges are changing rapidly.",
                "good": "12",
                "bad": "6",
                "replies": []
            }
        ]
    },
    {
        "user_name": "toaster2",
        "time": "9 August, 2021",
        "context": "This bat could easily have fallen victim to a predator bird or dog, but the cat got to it, first.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dblac2",
        "time": "9 August, 2021",
        "context": "Those darn cats!",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Dave.",
        "time": "9 August, 2021",
        "context": "Maybe it was all the wind turbines prompted by the supposed \"climate change\" that screwed up the bats migratory pattern.",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "jsmith970",
        "time": "9 August, 2021",
        "context": "In unrelated news, the Chinese Government cannot understand why their \"London Zoo\" variant of COVID-19 has not yet reached the United States...",
        "good": "8",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "embracethehate",
        "time": "9 August, 2021",
        "context": "Is it just me or does anyone else find those kids in that endlessly repeating \"Climate Pledge/Paris 10 Years Early\" commercial, extremely punchable? Especially the ones at the end giving everyone the side-eye?",
        "good": "17",
        "bad": "3",
        "replies": [
            {
                "user_name": "liberals_are_why_we_can't_have_nice_things",
                "time": "9 August, 2021",
                "context": "Yes, but not nearly as punchable as the scowling special needs Swedish teenager.",
                "good": "4",
                "bad": "2",
                "replies": [
                    {
                        "user_name": "embracethehate",
                        "time": "9 August, 2021",
                        "context": "True. Fortunately she's not up in your face every day like that freakin' commercial.",
                        "good": "1",
                        "bad": "1",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "whiteandunashamed",
                "time": "9 August, 2021",
                "context": "Right there with you. Work, pay bills and taxes, then you're opinion will matter to me.",
                "good": "9",
                "bad": "1",
                "replies": []
            },
            {
                "user_name": "kimgibbler",
                "time": "9 August, 2021",
                "context": "I agree, they're just so pouty. ",
                "good": "3",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "WLeoB",
        "time": "9 August, 2021",
        "context": "I admire great predators.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "yourmomwilladoreme",
        "time": "9 August, 2021",
        "context": "'Bat experts in Russia and the UK are working together to understand more about the bat's voyage, noting that the range expansion of the Nathusius' pipistrelle is linked to climate change.'\n\nReally? Did they have records of Bat migration from 100 years ago or longer to compare this data to?",
        "good": "36",
        "bad": "0",
        "replies": [
            {
                "user_name": "holdthesausage",
                "time": "9 August, 2021",
                "context": "The beauty of climate science is that in no way does it rely on data.",
                "good": "25",
                "bad": "4",
                "replies": [
                    {
                        "user_name": "yourmomwilladoreme",
                        "time": "9 August, 2021",
                        "context": "Same for most liberal theories",
                        "good": "3",
                        "bad": "3",
                        "replies": []
                    },
                    {
                        "user_name": "sciencerocks",
                        "time": "9 August, 2021",
                        "context": "It is ALL data, from multiple scientific disciplines.",
                        "good": "2",
                        "bad": "2",
                        "replies": [
                            {
                                "user_name": "berserker1",
                                "time": "10 August, 2021",
                                "context": "Yes and all of it twisted and manipulated to each governments goals and John Kerry's investments. except Russia they had the most  accurate forecast of the climate for the last 15 years because they are not part of the global carbon tax crowd.... I meant to say global cooling errr that was 1970 or so I meant global warming err that did not hold up to fact either so I think its climate change now ....back in the 50's we called it weather but errr uhhh ummm.",
                                "good": "1",
                                "bad": "1",
                                "replies": [
                                    {
                                        "user_name": "sciencerocks",
                                        "time": "10 August, 2021",
                                        "context": "I oppose carbon taxes.\nThat does not obviate the science from around the world.\nTake one hour out of your life to read the science rather than the blogs.\nYou'll change your mind.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": [
                                            {
                                                "user_name": "berserker1",
                                                "time": "10 August, 2021",
                                                "context": "Would you care to place a wager ? The science you speak of was purchased by the carbon tax invested and is manipulated to achieve results required for inclusion and more grants and funding etc. in 1971 1972 we studied global cooling with equal passion and obstinance and were positive the suns rays were being excluded from the planet earth by smog and man made impurities , then on to global warming till the facts did not collaborate the theory so...climate change to cover any circumstance encountered and thus unquestionable. I question it as it was invented for power and profit . Perhaps my friend you should take an hour or three and read and view with an open mind some opposing views from very credentialed people if they haven't been censored out of your reach. \nYou'll change your mind !",
                                                "good": "0",
                                                "bad": "0",
                                                "replies": []
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "F_l_23",
        "time": "9 August, 2021",
        "context": "That’s bat hsit crazy .",
        "good": "5",
        "bad": "0",
        "replies": [
            {
                "user_name": "jpcook",
                "time": "9 August, 2021",
                "context": "The technical name for that is \"guano psychosis\"....",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "maometto207",
        "time": "9 August, 2021",
        "context": "Hope the cat had received his/her rabies vaccine and follow up rabies vaccine after catching the bat. Yuck!",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "norskigal",
                "time": "9 August, 2021",
                "context": "who said the bat had rabies? if it did and then bit the cat, then it would need a shot. that little fella didnt stand a chance against that cat!",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "Orange8Ball",
        "time": "9 August, 2021",
        "context": "It’s so ugly it’s kinda cute. Is the Olympic name meant to be ironic?",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "sheldania",
        "time": "9 August, 2021",
        "context": "I think it is spreading Covid.  Because Covid was spread by bats; right?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "laughingoutloud123816",
        "time": "9 August, 2021",
        "context": "Biowarfare bat.  Goodbye Russia ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "danlxi",
        "time": "9 August, 2021",
        "context": "Hahahahahahahahaha",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "hicksie",
        "time": "9 August, 2021",
        "context": "Good Kitty !!",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "cardrake",
        "time": "9 August, 2021",
        "context": "If it was the size of a human thumb and a cat had mauled it, how the heck would anyone have examined it close enough to see London Zoo tag???",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "chaffer",
        "time": "9 August, 2021",
        "context": "A Russian bat rehabilitation group ? Did I read that correctly?",
        "good": "2",
        "bad": "0",
        "replies": [
            {
                "user_name": "norskigal",
                "time": "9 August, 2021",
                "context": "that is correct. find out why these amazing mammals are important to us and stop villifying them. they pollinate countless plants like bees and we would be lost without them. i took in an orphaned bat 3 years ago and tried to save it. I am not a bat rehabilitator but when it died, I cried like a baby.",
                "good": "2",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "Woken=Broken",
        "time": "9 August, 2021",
        "context": "Go cats!",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "yukiko70",
        "time": "9 August, 2021",
        "context": "#batlivesmatter",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "opaoma036",
        "time": "9 August, 2021",
        "context": "The bat was lost, simply put it had a spiked blood drink from some far left idiot.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "sincitypatriot",
        "time": "9 August, 2021",
        "context": "Since they only use temperatures taken in Alaska to determine global warming I'm not buying what they're selling. 99 percent of all research funding goes to propaganda telling us we are the cause of the earth getting warmer. Not",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "lillyskywalker",
        "time": "9 August, 2021",
        "context": "The bat who flew from China to the USA unfortunately made the flight.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "HurleyHayekSandwich",
        "time": "9 August, 2021",
        "context": "Are we supposed to sympathize with the bat?",
        "good": "3",
        "bad": "1",
        "replies": [
            {
                "user_name": "anglothaibabe",
                "time": "9 August, 2021",
                "context": "I sympathize with the cat....hope the cat gets to the vet. who knows what diseases the bat was carrying.",
                "good": "2",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "EatenByAGrue",
        "time": "9 August, 2021",
        "context": "bats are cool",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "joemagoo575",
        "time": "9 August, 2021",
        "context": "Send it to Wuhan for testing…",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "dacash",
                "time": "9 August, 2021",
                "context": "Bats can get and spread it, and clearly fly quite a distance. Yet people believe the answer to stopping the spread is to vaccinate all the people and lock all the people down. Let's just forget that there are at *least* 20 times more bats int he world than people.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "concerned_conservative668",
                        "time": "9 August, 2021",
                        "context": "Okay, time to take your meds.  SARS CoV-2 is an engineered virus; there is exactly zero evidence that a bat-human interface is responsible for COVID spreading to the human population, and a growing mountain of evidence that Chinese virologists (with Fauci bankrolling them) took a coronavirus with an affinity for bats and tinkered with it until they succeeded in switching it's affinity to human.  Perhaps you should refrain from operating machinery until you are examined by a healthcare professional...",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "dacash",
                                "time": "9 August, 2021",
                                "context": "I didn't say it was the responsible mechanism for its introduction. I did say bats can get it and spread it, just like deer, cats (domestic and large), dogs, ferrets and minks that have all been demonstrated to do this. \n\nTry not to read what you already know into other's posts, and instead be open to learning new things. Trust me: people will like you better if you do.",
                                "good": "0",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "concerned_conservative668",
                                        "time": "9 August, 2021",
                                        "context": "Firstly, I don't give rat spit whether people like me or not.  I've been out of high school plenty long enough to have grown accustomed to myself independent of other's opinions.  Secondly, when the virus' affinity was changed to that of human it lost it's ability to transmit to animals.  I know of no study which demonstrated that deer or cats or dogs or any other animal can spread COVID to humans. Perhaps you'd like to share your source material?",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": [
                                            {
                                                "user_name": "dacash",
                                                "time": "9 August, 2021",
                                                "context": "Sure, let's start with:\nUniversity of Minnesota CIDRAP. \"Covid-19 Likely spreading from people to animals and vice versa\" reviews 3 studies on this topic. \n\nIt is widely accepted that corona viruses do this all the time, and there is no reason to believe COVID 19 doesn't especially given the evidence that it has been found in the wide variety of mammals I noted above.\n\nIf people find you likeable, they might actually care what you think. I'm thinking from your general insulting and demeaning attitude that most people don't.  Which leads to be being even more of a jerk, and the cycle continues. But, by all means: you do you.",
                                                "good": "0",
                                                "bad": "0",
                                                "replies": [
                                                    {
                                                        "user_name": "concerned_conservative668",
                                                        "time": "9 August, 2021",
                                                        "context": "\"Likely\" means \"I think.\"  It hardly substitutes for peer-reviewed data.  That COVID has been found in animals does NOT prove or even INDICATE it can be transmitted to humans.  As I said, there is zero empirical data to support that claim.  And I'm just fine with being called a jerk.  You can call me anything you want as long as you don't call me late for dinner.",
                                                        "good": "0",
                                                        "bad": "0",
                                                        "replies": [
                                                            {
                                                                "user_name": "dacash",
                                                                "time": "9 August, 2021",
                                                                "context": "So, you didn't read the studies they quoted, you're just attacking your misunderstanding of verbiage of the headline?\n\nYou would know, if you'd read any of the article, that the COVID found in cats is exactly the same COVID in humans. It doesn't translate or change. It is just exactly the same virus. It is 100% transmissible. \n\nAnd this is a lovely way to point out that the wording \"likely\" refers to the fact that one cannot see a particular viral particle that is transmitted, but finds overwhelming evidence that it is happening and therefore as a good scientist having healthy skepticism writes \"likely.\" When you hear a scientist say \"definitively\" or \"only possible mechanism\" or such, alarm bells should go off in your head because that person is probably lying (either about being a scientist or about their results). Were a scientist to merely *think* something based on research of similar situations and/or experience they would properly use the word \"hypothesize.\" In either case it is a great deal more meaningful than \"I think.\"\n\nI didn't call you a jerk. I merely am pointing out that the only person you're affecting with your insulting style is yourself and that you are pushing a cycle that doesn't lead to happy.",
                                                                "good": "0",
                                                                "bad": "0",
                                                                "replies": [
                                                                    {
                                                                        "user_name": "concerned_conservative668",
                                                                        "time": "9 August, 2021",
                                                                        "context": "Still gnawing on this bone, are we?!?  Believe what you will and I shall do likewise.",
                                                                        "good": "0",
                                                                        "bad": "0",
                                                                        "replies": [
                                                                            {
                                                                                "user_name": "dacash",
                                                                                "time": "9 August, 2021",
                                                                                "context": "Kinda figured you had your mind made up before you looked at any facts. Just like you went off half cocked about my first post over something I didn't actually write. Here's the thing: We probably  argue for the same basic things, but I find people like you detract rather than add to the weight of sensible arguments. So I made a a plea to you here to get some real understanding before shooting off your mouth. Don't be counting on this degree of kindness the next time I see you post.  I find willful ignorance abhorrent, no matter which side of the field it comes from. \n\nHave a blessed day!",
                                                                                "good": "0",
                                                                                "bad": "0",
                                                                                "replies": [
                                                                                    {
                                                                                        "user_name": "concerned_conservative668",
                                                                                        "time": "9 August, 2021",
                                                                                        "context": "Not to worry; I won't be able to see your posts anymore.  I'll let you figure out why.",
                                                                                        "good": "0",
                                                                                        "bad": "0",
                                                                                        "replies": [
                                                                                            {
                                                                                                "user_name": "dacash",
                                                                                                "time": "9 August, 2021",
                                                                                                "context": "Good idea. When you don't like what you're seeing, just close your eyes.",
                                                                                                "good": "0",
                                                                                                "bad": "0",
                                                                                                "replies": [
                                                                                                    {
                                                                                                        "user_name": "concerned_conservative668",
                                                                                                        "time": "10 August, 2021",
                                                                                                        "context": "Nope, no longer visible...",
                                                                                                        "good": "0",
                                                                                                        "bad": "0",
                                                                                                        "replies": [
                                                                                                            {
                                                                                                                "user_name": "dacash",
                                                                                                                "time": "10 August, 2021",
                                                                                                                "context": "lol. Guess that didn't work as well as you planned. De nile ain't just a river in Egypt.",
                                                                                                                "good": "0",
                                                                                                                "bad": "0",
                                                                                                                "replies": [
                                                                                                                    {
                                                                                                                        "user_name": "concerned_conservative668",
                                                                                                                        "time": "10 August, 2021",
                                                                                                                        "context": "Still can't see your post...",
                                                                                                                        "good": "0",
                                                                                                                        "bad": "0",
                                                                                                                        "replies": [
                                                                                                                            {
                                                                                                                                "user_name": "dacash",
                                                                                                                                "time": "10 August, 2021",
                                                                                                                                "context": "And yet you keep replying to them.",
                                                                                                                                "good": "0",
                                                                                                                                "bad": "0",
                                                                                                                                "replies": [
                                                                                                                                    {
                                                                                                                                        "user_name": "concerned_conservative668",
                                                                                                                                        "time": "10 August, 2021",
                                                                                                                                        "context": "Still unable to see your post.  I wonder what's going on?!?   😒",
                                                                                                                                        "good": "0",
                                                                                                                                        "bad": "0",
                                                                                                                                        "replies": [
                                                                                                                                            {
                                                                                                                                                "user_name": "dacash",
                                                                                                                                                "time": "10 August, 2021",
                                                                                                                                                "context": "You must be wishing them gone, since when you block a poster, you don't even know that they've posted. \n\nBut this is perfect behavior for someone like you: head in the sand.",
                                                                                                                                                "good": "0",
                                                                                                                                                "bad": "0",
                                                                                                                                                "replies": [
                                                                                                                                                    {
                                                                                                                                                        "user_name": "concerned_conservative668",
                                                                                                                                                        "time": "11 August, 2021",
                                                                                                                                                        "context": "You are nothing if not persistent.  Do you not understand that you are muted?!?",
                                                                                                                                                        "good": "0",
                                                                                                                                                        "bad": "0",
                                                                                                                                                        "replies": [
                                                                                                                                                            {
                                                                                                                                                                "user_name": "dacash",
                                                                                                                                                                "time": "11 August, 2021",
                                                                                                                                                                "context": "I understand you're putting your fingers in your ears and yelling NAHNAHNAH I CAN\"T HEAR YOU. And yet it doesn't seem to be helping you. \n\nBut were I muted, you wouldn't even know I'd posted.",
                                                                                                                                                                "good": "0",
                                                                                                                                                                "bad": "0",
                                                                                                                                                                "replies": [
                                                                                                                                                                    {
                                                                                                                                                                        "user_name": "concerned_conservative668",
                                                                                                                                                                        "time": "11 August, 2021",
                                                                                                                                                                        "context": "Nope, still can't hear you.  What was that again?",
                                                                                                                                                                        "good": "0",
                                                                                                                                                                        "bad": "0",
                                                                                                                                                                        "replies": []
                                                                                                                                                                    }
                                                                                                                                                                ]
                                                                                                                                                            }
                                                                                                                                                        ]
                                                                                                                                                    }
                                                                                                                                                ]
                                                                                                                                            }
                                                                                                                                        ]
                                                                                                                                    }
                                                                                                                                ]
                                                                                                                            }
                                                                                                                        ]
                                                                                                                    }
                                                                                                                ]
                                                                                                            }
                                                                                                        ]
                                                                                                    }
                                                                                                ]
                                                                                            }
                                                                                        ]
                                                                                    }
                                                                                ]
                                                                            }
                                                                        ]
                                                                    }
                                                                ]
                                                            }
                                                        ]
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "manx",
        "time": "9 August, 2021",
        "context": "Never trust a \"Democat\"",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "joecars",
        "time": "9 August, 2021",
        "context": "..... good cat  !!!",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "opaoma036",
        "time": "9 August, 2021",
        "context": "Don’t insult the bat calling it an Olympic champ.  The bat has more pride then that.",
        "good": "37",
        "bad": "7",
        "replies": [
            {
                "user_name": "Angus139",
                "time": "9 August, 2021",
                "context": "It wasn't a \"woke\" bat?",
                "good": "1",
                "bad": "5",
                "replies": []
            }
        ]
    },
    {
        "user_name": "Woken=Broken",
        "time": "9 August, 2021",
        "context": "I recently learned that if not for cats, we'd be overrun by rodents in no time.",
        "good": "7",
        "bad": "1",
        "replies": [
            {
                "user_name": "34u2",
                "time": "9 August, 2021",
                "context": "Your wrong, we have been overrun by rodents, dems!",
                "good": "7",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "34u2",
                        "time": "9 August, 2021",
                        "context": "We need bigger cats!",
                        "good": "4",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "Woken=Broken",
                        "time": "9 August, 2021",
                        "context": "You have a point.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "norskigal",
                "time": "9 August, 2021",
                "context": "bats are not rodents.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "OldSalt808",
        "time": "9 August, 2021",
        "context": "Yesterday I cut the grass, today I think I’ll wash the car.  Maybe not. ",
        "good": "3",
        "bad": "0",
        "replies": [
            {
                "user_name": "Woken=Broken",
                "time": "9 August, 2021",
                "context": "Do it now.  Thanks.",
                "good": "0",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "justpassingas938",
        "time": "9 August, 2021",
        "context": "Probably a black cat.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "killabeejesus",
        "time": "9 August, 2021",
        "context": "Looking for asylum from Putin after stealing COVID-20 formula from Fauci...realized too late that NIH had already funded the BL4 biolab in Koltsovo. CIA hired Hunter (what a great pun - intended) to buy cat and take out bat; then made a finger-painting accusing Trump and prostitutes of the deed. Sold said painting to Epstein's estate as an investment...and the story will continue.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "TheRealChappy",
        "time": "9 August, 2021",
        "context": "Bat experts in Russia and the UK are working together to understand more about the bat's voyage, noting that the range expansion of the Nathusius' pipistrelle is linked to climate change. \nHow TF do they know?!?!\nThe bat is dead. Did it tell them before if died?  Maybe it was simply lost. Maybe it had brain damage and was just flying to be flying. Might have been looking for a boyfriend. That’s a pretty big assumption.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dedoke1963",
        "time": "9 August, 2021",
        "context": "That bat was a spy trying to get back to the motherland to offload intel. Cat was either CIA or MI6. Nice work cat.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "kemios",
        "time": "9 August, 2021",
        "context": "Good kitty.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "whatbillofrights",
        "time": "9 August, 2021",
        "context": "Psy. op..\n\nMultiple intel agencies conspired to create this bat story to buck up the China virus natural occurrence lie.\n\nThe type of bat that carries the original unmodified virus is not natural to the region of China that the pandemic began in.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mikel29",
        "time": "9 August, 2021",
        "context": "It had \"London Zoo written on it\".  The words \"London Zoo\" were written right next to the words \"Wuhan Lab\", which was crossed out",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "USMC_Drum_&_Bugle",
        "time": "9 August, 2021",
        "context": "Thank God the Russian Bat Rehabilitation Group (RBRG) found the poor thing.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "norskigal",
        "time": "9 August, 2021",
        "context": "poor little guy. we would be lost without bats to do pollination like bees. dont know why they get such a bad rap. people need to see how they help us including eating many times their weight in mosquitoes every evening.",
        "good": "13",
        "bad": "0",
        "replies": [
            {
                "user_name": "Woken=Broken",
                "time": "9 August, 2021",
                "context": "Nature is full of poor little guys.  It's how we all live.",
                "good": "5",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "hebrews1024",
        "time": "9 August, 2021",
        "context": "You know it's bad when animals are choosing Russia over the UK.",
        "good": "7",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "DEMSUXBT",
        "time": "9 August, 2021",
        "context": "How do they know that it didn't just get caught in a jet stream , and just drifted there?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "georgeinsandiego",
        "time": "9 August, 2021",
        "context": "People who are paid to know such things say that if the hoary bat goes extinct it will be because of industrial wind turbines. An endangered bird of prey known as the red kite may be extincted for the same reason.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "timberghost914",
        "time": "9 August, 2021",
        "context": "Putin thought it was a spy bat and ordered his cat to out a hit on it!!! 🤣",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sagebrush4",
        "time": "9 August, 2021",
        "context": "symbolic for America, look how far we have come .......and then joe shows up.......",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "JECampbell",
        "time": "9 August, 2021",
        "context": "(smh)\nCat had the right idea. Should have just let the cat finish the job. Frankly, one can only wonder how many of these bats made it to the Wuhan lab. Worse yet, how many have escaped from the Wuhan lab.  :o)",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "noncommunist",
        "time": "9 August, 2021",
        "context": "Is the Cat in Prison?",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "TheRealChappy",
        "time": "9 August, 2021",
        "context": "They’re good eatin when they’re that size.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "iftheyonlyknew",
        "time": "9 August, 2021",
        "context": "keep your cats indoors.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "rickyramjet",
                "time": "9 August, 2021",
                "context": "your English is pretty good for a bat",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "poeticpatriot🇺🇸",
        "time": "9 August, 2021",
        "context": "L👀k one of their family members got l😆🤣se.. by the way this reminds of story when I was at Wal-Mart, I had the not so pleasant experience of standing in line behind three of them; looked just the bat and my stomach was turning the whole time. I did everything I could to k🤢🤢p from throwing up.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "HPLwasright",
        "time": "9 August, 2021",
        "context": "Let's hope it was Nancy Pelosi.\nHas she been sighted today?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "josebideno",
        "time": "9 August, 2021",
        "context": "The earth is always in a state of change. There have mass extinctions before humans even considered a species. We may have exacerbated, but we aren’t the total cause. And if we need to really address climate change, then we need to look at birthing rates. Especially in countries like India and China.  ",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "morykwas",
        "time": "9 August, 2021",
        "context": "Now the COVID supporters can say: \"See I told you so, the virus was natural, and not made in our Chinese lab.\"",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "billrach658",
        "time": "9 August, 2021",
        "context": "Maybe it got into a luggage bag or in a plane's landing gear. Who says it had to fly all that way? It's very small...could easily fit into anything, even, a cargo trailer.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "anothercountryheardfrom",
        "time": "9 August, 2021",
        "context": "They forgot to mention the Bat originated from China.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "EggsAckley",
        "time": "9 August, 2021",
        "context": "Was it a White cat?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "nothimagain",
        "time": "9 August, 2021",
        "context": "There is another migratory phenomenon going on in the Western Hemisphere. Over the course of the last thirty years the nine banded armadillo range has expanded northward and has nearly matched the range and numbers of its Central American neighbors, the Mestizos.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "highplaindrifter",
        "time": "9 August, 2021",
        "context": "Pelosi uses a private jet.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "morningjoke",
        "time": "9 August, 2021",
        "context": "A \"harley\" was spotted recently in Sturgis, SD with a \"tag\" from NY.  Celebration ensued.",
        "good": "30",
        "bad": "0",
        "replies": [
            {
                "user_name": "7enderbender",
                "time": "9 August, 2021",
                "context": "Maybe that was also due to climate change. Political climate that is.",
                "good": "14",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "Justsaynotocommunism",
        "time": "9 August, 2021",
        "context": "That’s not a bat! \nThat AOC when she wakes up",
        "good": "7",
        "bad": "0",
        "replies": [
            {
                "user_name": "caed",
                "time": "9 August, 2021",
                "context": "Typical though, mouth is always open and ready to bite anything that gets near.",
                "good": "4",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "Rockpaperscissorslizardspock",
                "time": "9 August, 2021",
                "context": "Come on man, that bat is much cuter than aoc",
                "good": "5",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "justvisiting",
        "time": "9 August, 2021",
        "context": "Rename the bat from \"London Zoo\" to \"Grub Hub\" it delivered a meal to a hungry cat in Russia.",
        "good": "12",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "brock_o_bama",
        "time": "9 August, 2021",
        "context": "An \"Olympic bat\" the size of a human thumb managed to fly more than 1,200 miles from London to Russia – only to be killed by a cat.\nThat's what happens when you kneel in Russia!",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "Fatticous10",
        "time": "9 August, 2021",
        "context": "Good job cat.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "robertfalls57",
        "time": "9 August, 2021",
        "context": "Most likely was in a shipping container in Britian and flew out when the door was open at night in Russia.  Some times the most likely answer is the correct answer.",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "freeko",
        "time": "9 August, 2021",
        "context": "Did the bat test positive for Covid??",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rhugh",
        "time": "9 August, 2021",
        "context": "we can add bats to the wildlife cut up by cats and wind turbines",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "PurpleLeaf",
        "time": "9 August, 2021",
        "context": "I thought for sure it was gonna be, \"And was enjoyed in a Chinese Bat soup.\"",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Long4years",
        "time": "9 August, 2021",
        "context": "How fantastic. Having bats from one part of the world make it to another.  What a wonderful way to spread more viruses, insects and problems.  It’s always great to have animals introduced into nonnative environments ",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "lyindems050",
        "time": "9 August, 2021",
        "context": "Good Kitty!",
        "good": "4",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "captainlinger",
        "time": "9 August, 2021",
        "context": "When she fought the cat, it was com-Bat.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "fover",
        "time": "9 August, 2021",
        "context": "Cat probably thought the bat might be carrying coronavirus.  Cats can be pretty smart sometimes.  LOL",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rhugh",
        "time": "9 August, 2021",
        "context": "carrier bat",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dankasull",
        "time": "9 August, 2021",
        "context": "Bats are very important to insect control among other things.  Cats kills millions of song birds yearly.",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "caed",
                "time": "9 August, 2021",
                "context": "And Congress kills millions of trees every day.",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "sharronf",
        "time": "9 August, 2021",
        "context": "A cat just doing its job.",
        "good": "7",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "VikingsMatters",
        "time": "9 August, 2021",
        "context": "Global warming ! Ha!  Tell that to the cat.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "buffalo8031",
        "time": "9 August, 2021",
        "context": "CLIMATE Change?????? Give me a break! ",
        "good": "3",
        "bad": "1",
        "replies": [
            {
                "user_name": "realist12345678",
                "time": "9 August, 2021",
                "context": "All over the world species are moving their distribution due to CC.",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "Sleepydwarf",
        "time": "9 August, 2021",
        "context": "Maybe he got a ride  in the wheelwell of a woke United Airlines flight.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Tenshi",
        "time": "9 August, 2021",
        "context": "Perfect.\nThe Communist Chinese will now claim that the Nathusius' pipistrelle bat was responsbile for the Wuhan Lab Leak Coronavirus/COVID Worldwide outbreak.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "rabbimark",
        "time": "9 August, 2021",
        "context": "I'm sure some people are ignorant enough to not understand that this is their lame attempt to blame CoViD on bats - still. \"Look, see? They can travel thousands of miles.\" Idiots.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "EatenByAGrue",
        "time": "9 August, 2021",
        "context": "was the cat white? ...of course not",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mytruthhurtsyou",
        "time": "9 August, 2021",
        "context": "hopefully that was Nosferatu-Pelosi in her bat form.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "BidensButtWiper",
        "time": "9 August, 2021",
        "context": "China liked this the article ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "exmedic113",
        "time": "9 August, 2021",
        "context": "My pesky Democrat neighbor found a bat in her garden.... Louisville Slugger.... thought she would get rabies....I said no....not if she was wearing a mask.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "msplissken",
        "time": "9 August, 2021",
        "context": "Very sad. Bats are wonderful creatures, very maligned and misunderstood.",
        "good": "2",
        "bad": "0",
        "replies": [
            {
                "error": "error"
            }
        ]
    },
    {
        "user_name": "case1967",
        "time": "9 August, 2021",
        "context": "\"Her journey is an exciting scientific finding and another piece in the puzzle of bat migration, So someone stuffed it in a suitcase and flew it to Russia, not so exciting.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "sigsauer911",
        "time": "9 August, 2021",
        "context": "Everything is due to Climate Change. We were once molten lava, then an Ice Age… Go look at Yuma, Az in the winter, people go there….because of Climate Change",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "smartthink",
        "time": "9 August, 2021",
        "context": "When one end of the story is Russia, I don't believe it.",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "askmenow7",
        "time": "9 August, 2021",
        "context": "Yeah big deal - was it vaccinated?",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "WhatCouldPossiblyGoWrong?",
        "time": "9 August, 2021",
        "context": "In a somber ceremony, the \"Olympic\" bat was posthumously awarded a little gold medal.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Jesusrodedinosaurs",
        "time": "9 August, 2021",
        "context": "Outdoor cats should be shot on site.",
        "good": "2",
        "bad": "8",
        "replies": []
    },
    {
        "user_name": "knucklehead86",
        "time": "9 August, 2021",
        "context": "Karma for COVID.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jpnightrain",
        "time": "9 August, 2021",
        "context": "The only bat I like are the ones that help the Agave (Tequila) plant thrive.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "DOGG4America",
        "time": "9 August, 2021",
        "context": "Right out of the gate it’s climate change and man made apparatus that’s at fault for any perceived unusual behavior.   There’s no proof on any of it.   Climate change has been around since the earth had an atmosphere.    ",
        "good": "13",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "DDTM2",
        "time": "9 August, 2021",
        "context": "Crimmminy!  Thought it was another article on Kathy Griffin, Griffith or whomever.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "thereckoning(Rev.16:11)",
        "time": "9 August, 2021",
        "context": "That's really sad. But I'm sure the cat had its reasons.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Hunter’sPipe",
        "time": "9 August, 2021",
        "context": "Can't we all agree to stop studying bats for a while? How about we both leave each other alone for a few years and we'll revisit our relationship then?",
        "good": "7",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "scarcelysaved",
        "time": "9 August, 2021",
        "context": "*belch* meow...",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jacksrevenge214",
        "time": "9 August, 2021",
        "context": "Thankfully, the cat didn't eat the bat. Thats how covid started, according to the CDC.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "4nelliebly",
        "time": "9 August, 2021",
        "context": "This is a story ‘bout a thumb-sized bat,\nWho wanted to travel the world, and all that,\nHe flew far and wide\nWith all that implied\nOnly to be downed by a cat … at that!!",
        "good": "12",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "chuckjohnson802",
        "time": "9 August, 2021",
        "context": "Thumb Bats just get batted around by cats.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "whitechocolate159",
        "time": "9 August, 2021",
        "context": "Climate change, pfft. Can’t a bat take a vacation?!",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "mr.george",
        "time": "9 August, 2021",
        "context": "A metaphor for Trump’s attempt to hide his tax returns from Cyrus Vance?",
        "good": "1",
        "bad": "2",
        "replies": [
            {
                "user_name": "scarcelysaved",
                "time": "9 August, 2021",
                "context": "It's Biden they're trying to keep in his cave...",
                "good": "2",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "skyefox23",
        "time": "9 August, 2021",
        "context": "Brave cat just doing its part to keep Covid 2021 from happening.  If that bat had made it to China it would have ended up as a lab bat in Wuhan.",
        "good": "6",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "thunker54",
        "time": "9 August, 2021",
        "context": "Typical cat: Kill for the sake of killing, not for food. The only good place for a cat is on a farm where they can work as a mouser.  And DON'T FEED farm cats - make them start killing for food instead of enjoyment.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "sunsearay670",
        "time": "9 August, 2021",
        "context": "First it was in a zoo and then it was killed by a cat!  What a sorrowful life it had. But now it is safe in heaven.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "trucker49003",
        "time": "9 August, 2021",
        "context": "Are these scientist's part of the SOPHISTICATED bunch?? Cat ate a bat and we have climate change...............",
        "good": "2",
        "bad": "1",
        "replies": [
            {
                "user_name": "scarcelysaved",
                "time": "9 August, 2021",
                "context": "Leave them alone... they're \"elite\".",
                "good": "1",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "start.of.the.eel",
        "time": "9 August, 2021",
        "context": "In a plot twist, the bat turns out to be radioactive and the cat becomes the next Marvel supervillain.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "havgunwiltrav",
        "time": "9 August, 2021",
        "context": "Some really shallow minded people on this site.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "sinyemt",
        "time": "9 August, 2021",
        "context": "The things bats will do to avoid Wuham",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "libmindsrdiseased",
        "time": "9 August, 2021",
        "context": "\"This is very exciting. It’s great to be able to contribute to the international conservation work to protect these extraordinary animals and learn more about their fascinating lives,\" said Briggs.\n\nNo, what’s exciting is the cat did exactly what thousands of years of evolution had designed it to do, kill vermin. And that bat’s sole purpose in its life was to be killed by that cat. Thanks be to the cat.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Rollingdownhilllikeasnowballheadingforhell",
        "time": "9 August, 2021",
        "context": "Did it have purple hair and kneel?  ",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Bellilote",
        "time": "9 August, 2021",
        "context": "How sad that a cat mauled the little creature.  Cats know not what they do.",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "wastrel",
                "time": "9 August, 2021",
                "context": "Oh, yes they do.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "easydoesit196",
        "time": "9 August, 2021",
        "context": "was there any trace of Polonium in the bat?",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "start.of.the.eel",
                "time": "9 August, 2021",
                "context": "You stole my joke!!!  Good one.",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "jermatt",
        "time": "9 August, 2021",
        "context": "That is it ban all cats.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "LostLenore",
        "time": "9 August, 2021",
        "context": "Poor bat. I always liked these creatures.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rikiticytavy",
        "time": "9 August, 2021",
        "context": "Why was nasty nancy flying to Russia?",
        "good": "2",
        "bad": "0",
        "replies": [
            {
                "user_name": "iksung",
                "time": "9 August, 2021",
                "context": "Stock up on poison.",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "scott3708",
        "time": "9 August, 2021",
        "context": "So the cat now has Covid, and bit a rat, gave it Covid, and along came a snake who ate the rat, and it got Covid, that was sold in wuhan, that a human ate the snake got Covid, then the human bit Trump caused all of the US infections…… Fauci",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Mr.X030",
        "time": "9 August, 2021",
        "context": "SARS-COVID-MOSCOW? Poor cat...",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "badenof",
        "time": "9 August, 2021",
        "context": "The bat flew to Russia because of climate change, beautiful.",
        "good": "6",
        "bad": "0",
        "replies": [
            {
                "user_name": "LostLenore",
                "time": "9 August, 2021",
                "context": "Yeah, I caught that too. EVERYTHING is either related to climate change or racism if you are a lib.",
                "good": "7",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "Ganderman",
        "time": "9 August, 2021",
        "context": "Does Batman know about this??",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "iamstein",
        "time": "9 August, 2021",
        "context": "Cat changed bats climate alright..Good kitty!",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "knowledgebeyondcollege",
        "time": "9 August, 2021",
        "context": "CAT 1\nBat 0",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "nickdammit504",
        "time": "9 August, 2021",
        "context": "Russia has a bat rehabilitation group?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "7enderbender",
        "time": "9 August, 2021",
        "context": "Any now the cat has Covid.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "TomOkc",
        "time": "9 August, 2021",
        "context": "Let me guess. Someone cooked it, ate it, and now we have another pandemic coming?   Great….",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "harmony",
        "time": "9 August, 2021",
        "context": "london to russia is just 1200 miles? (i get the \"more than\" part)",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jppppp",
        "time": "9 August, 2021",
        "context": "Landed in China....dinner!",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "commieslayer1776",
        "time": "9 August, 2021",
        "context": "Was it virus free?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "don1234321",
        "time": "9 August, 2021",
        "context": "Apparently the cat wasn’t impressed.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "1nation_god",
        "time": "9 August, 2021",
        "context": "What a difference it would make if humans had compassion for each other.\nSo tire of the save the whales but kill the fetus mentality.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "error": "error"
    },
    {
        "user_name": "start.of.the.eel",
        "time": "9 August, 2021",
        "context": "In a plot twist, the bat turns out to be radioactive and the cat becomes the next Marvel supervillain.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "commieslayer1776",
        "time": "9 August, 2021",
        "context": "Was it virus free?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "TomOkc",
        "time": "9 August, 2021",
        "context": "Let me guess. Someone cooked it, ate it, and now we have another pandemic coming?   Great….",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rikiticytavy",
        "time": "9 August, 2021",
        "context": "Why was nasty nancy flying to Russia?",
        "good": "2",
        "bad": "0",
        "replies": [
            {
                "user_name": "iksung",
                "time": "9 August, 2021",
                "context": "Stock up on poison.",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "badenof",
        "time": "9 August, 2021",
        "context": "The bat flew to Russia because of climate change, beautiful.",
        "good": "6",
        "bad": "0",
        "replies": [
            {
                "user_name": "LostLenore",
                "time": "9 August, 2021",
                "context": "Yeah, I caught that too. EVERYTHING is either related to climate change or racism if you are a lib.",
                "good": "7",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "libmindsrdiseased",
        "time": "9 August, 2021",
        "context": "\"This is very exciting. It’s great to be able to contribute to the international conservation work to protect these extraordinary animals and learn more about their fascinating lives,\" said Briggs.\n\nNo, what’s exciting is the cat did exactly what thousands of years of evolution had designed it to do, kill vermin. And that bat’s sole purpose in its life was to be killed by that cat. Thanks be to the cat.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "iamstein",
        "time": "9 August, 2021",
        "context": "Cat changed bats climate alright..Good kitty!",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "nickdammit504",
        "time": "9 August, 2021",
        "context": "Russia has a bat rehabilitation group?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "1nation_god",
        "time": "9 August, 2021",
        "context": "What a difference it would make if humans had compassion for each other.\nSo tire of the save the whales but kill the fetus mentality.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "don1234321",
        "time": "9 August, 2021",
        "context": "Apparently the cat wasn’t impressed.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "LostLenore",
        "time": "9 August, 2021",
        "context": "Poor bat. I always liked these creatures.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Mr.X030",
        "time": "9 August, 2021",
        "context": "SARS-COVID-MOSCOW? Poor cat...",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "harmony",
        "time": "9 August, 2021",
        "context": "london to russia is just 1200 miles? (i get the \"more than\" part)",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jppppp",
        "time": "9 August, 2021",
        "context": "Landed in China....dinner!",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "havgunwiltrav",
        "time": "9 August, 2021",
        "context": "Some really shallow minded people on this site.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "easydoesit196",
        "time": "9 August, 2021",
        "context": "was there any trace of Polonium in the bat?",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "start.of.the.eel",
                "time": "9 August, 2021",
                "context": "You stole my joke!!!  Good one.",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "jermatt",
        "time": "9 August, 2021",
        "context": "That is it ban all cats.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Rollingdownhilllikeasnowballheadingforhell",
        "time": "9 August, 2021",
        "context": "Did it have purple hair and kneel?  ",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "scott3708",
        "time": "9 August, 2021",
        "context": "So the cat now has Covid, and bit a rat, gave it Covid, and along came a snake who ate the rat, and it got Covid, that was sold in wuhan, that a human ate the snake got Covid, then the human bit Trump caused all of the US infections…… Fauci",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "knowledgebeyondcollege",
        "time": "9 August, 2021",
        "context": "CAT 1\nBat 0",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "7enderbender",
        "time": "9 August, 2021",
        "context": "Any now the cat has Covid.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Bellilote",
        "time": "9 August, 2021",
        "context": "How sad that a cat mauled the little creature.  Cats know not what they do.",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "wastrel",
                "time": "9 August, 2021",
                "context": "Oh, yes they do.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "Ganderman",
        "time": "9 August, 2021",
        "context": "Does Batman know about this??",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sinyemt",
        "time": "9 August, 2021",
        "context": "The things bats will do to avoid Wuham",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "timbcktwo",
        "time": "10 August, 2021",
        "context": "\"This is a remarkable journey and the longest one we know of any bat from Britain across Europe. What an Olympian!\nSome Olympians are worthy and some are not...America shows you their losers!",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "guineapigg",
        "time": "10 August, 2021",
        "context": "The bat's Spirit Airlines reservation was cancelled, so he had to find an alternate form of transportation. SO SAD!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dex99",
        "time": "10 August, 2021",
        "context": "Someone give that Cat a medal!! Could have caused another bad batch of bat soup……. Lol…… right  China!!…….. sure , sure…..",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Wellwe'rewaiting704",
        "time": "9 August, 2021",
        "context": "Did that bat's journey begin in china? Is that the elusive covid bat? The WHO will say so, along with fauci. ",
        "good": "4",
        "bad": "0",
        "replies": [
            {
                "user_name": "shadowbannedagain335",
                "time": "10 August, 2021",
                "context": "So far, only you are suggesting that.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "markk.",
        "time": "10 August, 2021",
        "context": "Christians have Jesus. Jews have Abraham. Muslims have Mohammad. And, the Climate Change Cult has the Olympic Bat and Al Gore crying in the wilderness.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "skihunter",
        "time": "12 August, 2021",
        "context": "Good kitty",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "thecaptaindj",
        "time": "10 August, 2021",
        "context": "LOL! This is like a real Far Side comic! Gary Larson...",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "retardJoe",
        "time": "10 August, 2021",
        "context": "good cat.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "...john3:16...",
        "time": "9 August, 2021",
        "context": "What would Pat say about  this.............................................................................................................",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ap727",
        "time": "10 August, 2021",
        "context": "We'd never know if not for that cat.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bluesnjacks",
        "time": "10 August, 2021",
        "context": "Just look at that bat's eyes! It is crazy! I bet it was the initial Covid spreader. Doesn't even freaking wear a mask!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "joebidet46",
        "time": "10 August, 2021",
        "context": "Are you positive it's from London, not just the last one leaving his bellfry",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "shaun1982457",
        "time": "10 August, 2021",
        "context": "If you look for the information you will find this is not unusual for this bat.  They routinely fly 2000km for migration.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "kuffco",
        "time": "10 August, 2021",
        "context": "My cat runs from ants. lol.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "levberezov",
        "time": "10 August, 2021",
        "context": "The bat and the cat. That's that.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "firstnlast",
        "time": "10 August, 2021",
        "context": "and how do we know the bat traveled without the help of humans???? all kinds of animals hitch rides..",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "FreedomfromtheLeft",
        "time": "10 August, 2021",
        "context": "House cats multiply fast and kill an enormous amount of wildlife. People should keep cats inside and under control.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "jsmith338",
        "time": "9 August, 2021",
        "context": "Cats kill everything. Birds, mice, snakes, bats, insects. They are a real problem.",
        "good": "3",
        "bad": "6",
        "replies": [
            {
                "user_name": "RedPizza",
                "time": "10 August, 2021",
                "context": "Democrats are the Real Problem!!!",
                "good": "4",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "Mr8ch855",
                "time": "10 August, 2021",
                "context": "Good! Less for me to kill! I keep 3 barn cats in the barn and have NO birds, mice, snakes, bats, and only some insects -they are the REAL problem and the cats deal with it..",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "Areukiddingme161",
        "time": "10 August, 2021",
        "context": "Good kitty.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mrocguy",
        "time": "10 August, 2021",
        "context": "What about the cat?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "wyattg",
        "time": "15 August, 2021",
        "context": "Cats and dog are wreaking havoc with wildlife.\nThey are like the left, wherever they are present, they destroy everything around them.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Mr8ch855",
        "time": "10 August, 2021",
        "context": "Bat Lives Matter",
        "good": "2",
        "bad": "0",
        "replies": [
            {
                "user_name": "leftisclearlynotright",
                "time": "10 August, 2021",
                "context": "Far more than the others!",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "saynotochinajoe",
        "time": "10 August, 2021",
        "context": "I wish a cat would get the Old Bat Nancy Pelosi.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "eddyareyoukiddingzappa",
        "time": "10 August, 2021",
        "context": "You forgot the point of the story,dont mess with cats",
        "good": "2",
        "bad": "0",
        "replies": []
    }
]