[
    {
        "user_name": "jcv1953",
        "time": "30 August, 2022",
        "context": "I’d rather see landers on moons of Jupiter or Saturn than go to the Moon or Mars.  That’s were the really fun stuff is. \nLet the billionaires build the space roller coasters for their well-heeled buddies.  NASA should be headed for Titan and Europa.",
        "good": "4",
        "bad": "1",
        "replies": [
            {
                "user_name": "rubiks6",
                "time": "31 August, 2022",
                "context": "Why? There’s nothing more on those Moons than on our own. \n\nThis planet is the only place in the universe where there is life. It was put here by the eternal living Gᴏᴅ. Life only comes from Life.",
                "good": "1",
                "bad": "5",
                "replies": [
                    {
                        "user_name": "quietsmith",
                        "time": "31 August, 2022",
                        "context": "Cry more :D",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "rubiks6",
        "time": "31 August, 2022",
        "context": "If you’re searching the heavens for proof of principle for abiogenesis you will not find it. Earth is the only place in the entire universe where there is life. It was put here by the eternal living Gᴏᴅ. Life only comes from Life. Life only ever comes from Life. All of the empirical evidence supports the claim that life only comes from life. If you have a scientific mind, do some observing and get a clue.",
        "good": "0",
        "bad": "8",
        "replies": [
            {
                "user_name": "quietsmith",
                "time": "31 August, 2022",
                "context": "The resident \"I think science is a big mean conspiracy against Jesus\"\n\nNo clown, we are not exploring space to search for evidence of abiogenesis out of some desperate attempt to continue the big mean conspiracy you think exists.\n\nAll of the evidence we have says that there would have been a point at which the first life existed, and all evidence we have says this was simplistic and microbial, and not specially created out of thin air by a god.",
                "good": "3",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "rubiks6",
                        "time": "31 August, 2022",
                        "context": "I’ve unmuted you. \n\nDo you know the difference between evidence and hypotheses (conjecture)?",
                        "good": "0",
                        "bad": "2",
                        "replies": [
                            {
                                "user_name": "quietsmith",
                                "time": "31 August, 2022",
                                "context": "Yes, did you need me to tell you again?",
                                "good": "4",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "rubiks6",
                                        "time": "31 August, 2022",
                                        "context": "I don’t think you do know the difference. Yes, I need you to demonstrate that you know the difference. Yes. Tell me again.",
                                        "good": "0",
                                        "bad": "2",
                                        "replies": [
                                            {
                                                "user_name": "quietsmith",
                                                "time": "31 August, 2022",
                                                "context": "Well above you state that there is no evidence for abiogenesis, which is completely wrong, as when it comes to abiogenesis we actually have a fairly good working model of how it works. \n\nThe problem with our current model is that we do not know which of two steps came first, and there are two competing models for that fact. This is a far, far, far cry from your claim that we have nothing what so ever, because that's completely false. \n\nConjecture is to make an conclusion based on incomplete information, which is what you are doing here, and what creationists often do with respect to many things in science. \n\nCreationists like yourself reject out of hand mountains and mountains of empirical evidence that spans across basically every field of science, so quit pretending that even if we did develop a theory of abiogenesis based on one of the two models that you'd accept it :D",
                                                "good": "1",
                                                "bad": "0",
                                                "replies": []
                                            }
                                        ]
                                    }
                                ]
                            },
                            {
                                "user_name": "beadgBass",
                                "time": "31 August, 2022",
                                "context": "First you must learn the difference between hypotheses and conjectures. Conjectures can be about anything, and stated in any form.. Scientific hypotheses must be statements about the natural world, formulated in such a way that they can be tested by empirical evidence.",
                                "good": "3",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "rubiks6",
                                        "time": "31 August, 2022",
                                        "context": "Has abiogenesis ever been successfully tested? Thus far abiogenesis has no evidentiary support. Abiogeneses has never been observed or measured. There is no empirical evidence for abiogenesis. Abiogenesis, presently, is conjecture.\n\n(Perhaps you need to learn the meaning of “empirical.”)",
                                        "good": "0",
                                        "bad": "3",
                                        "replies": [
                                            {
                                                "user_name": "beadgBass",
                                                "time": "31 August, 2022",
                                                "context": "Empirical evidence for abiogenesis: we're here!",
                                                "good": "3",
                                                "bad": "0",
                                                "replies": [
                                                    {
                                                        "user_name": "rubiks6",
                                                        "time": "31 August, 2022",
                                                        "context": "God reproduces in a spiritual sense when He creates a mind that can reason and feel emotion and create – a lot like your mind. What you do with your mind is amazing and beautiful but you have some errors in your thinking, as we all do.\n\nOur minds are more than biology. Our brains are the interface between our minds and the physical world. I told you earlier, that I am not a naturalist (speaking philosophically). I am also not a materialist. Biology is not all there is to being human (gasp!).\n\nIf you consider why I left a long career as a programmer to study theology, you will know me better.",
                                                        "good": "0",
                                                        "bad": "2",
                                                        "replies": []
                                                    }
                                                ]
                                            }
                                        ]
                                    },
                                    {
                                        "user_name": "rubiks6",
                                        "time": "31 August, 2022",
                                        "context": "em·pir·i·cal — adjective —\n\nbased on, concerned with, or verifiable by observation or experience rather than theory or pure logic.",
                                        "good": "0",
                                        "bad": "2",
                                        "replies": [
                                            {
                                                "user_name": "beadgBass",
                                                "time": "31 August, 2022",
                                                "context": "I probably knew that long before you did, as I've been in science for a very long time. But thanks for verifying that I used the term correctly.",
                                                "good": "2",
                                                "bad": "0",
                                                "replies": [
                                                    {
                                                        "user_name": "rubiks6",
                                                        "time": "31 August, 2022",
                                                        "context": "You did not use the term correctly. There is no empirical (observable, experiential) evidence for abiogenesis. Abiogenesis has never been observed. \n\nIf you know how science works then you should know the difference between “evidence” and “interpretation of evidence.”",
                                                        "good": "0",
                                                        "bad": "3",
                                                        "replies": []
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "beadgBass",
                "time": "31 August, 2022",
                "context": "There is a LOT more to learn about the universe than just abiogenesis beyond Earth, though that would be icing on the cake.\nMeanwhile, we have evidence of abiogenesis right here on Earth. Even in the Holy Bible there was no life until the third \"day,\" so biological life must have come from something without life -- abiogenesis.",
                "good": "4",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "rubiks6",
                        "time": "31 August, 2022",
                        "context": "On the third day, plant life came from God. God is living. Life only comes from life.",
                        "good": "0",
                        "bad": "2",
                        "replies": [
                            {
                                "user_name": "beadgBass",
                                "time": "31 August, 2022",
                                "context": "Is God biological life in your narrow view of God?",
                                "good": "3",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "rubiks6",
                                        "time": "31 August, 2022",
                                        "context": "God is living. Whether that is biologically based, I cannot say. I have not shaken His hand. He has certainly taken on biological form in the person of Jesus Christ who is the Creator in Genesis 1.1. We are made in his image.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": [
                                            {
                                                "user_name": "beadgBass",
                                                "time": "31 August, 2022",
                                                "context": "I'm a zoologist so I take a view of biological life as something that can reproduce, metabolize, and so on (there are a variety of definitions). God does not fit any definition of 'life' as we know. Yes, He is living, but as a supernatural being He is not living in a biological sense. A good analogy is that he is living like a memory.",
                                                "good": "0",
                                                "bad": "0",
                                                "replies": [
                                                    {
                                                        "user_name": "rubiks6",
                                                        "time": "31 August, 2022",
                                                        "context": "Men still have no clear definition of “life.”  As a zoologist, you should know that.\n\nA memory exists in a mind. It is not an independent thing. \n\nJesus Christ is biological and spiritual. \n\n(I prefer not to use the words “supernatural” or “natural” as they are poorly defined and I don’t believe in naturalism. I believe everything is designed and has purpose.)",
                                                        "good": "0",
                                                        "bad": "0",
                                                        "replies": [
                                                            {
                                                                "user_name": "beadgBass",
                                                                "time": "31 August, 2022",
                                                                "context": "\"Men still have no clear definition of “life.”  As a zoologist, you should know that.\"\n\nWomen don't either. And, if you had read more carefully, you would have noted what I said in a parenthetical statement.",
                                                                "good": "0",
                                                                "bad": "0",
                                                                "replies": [
                                                                    {
                                                                        "user_name": "rubiks6",
                                                                        "time": "31 August, 2022",
                                                                        "context": "Your next sentence following your parenthetical statement contradicts your parenthetical statement.\n\nAs for women, your statement can be taken on different levels and that's amusing. More seriously, I sometimes use the words \"Men\" and \"Man\" in a genderless fashion, as I'm sure you've encountered in the prose of others. The difference between gendered and genderless can usually be identified by the context but you're right – sometimes women don't know the definition of life 🤣.",
                                                                        "good": "0",
                                                                        "bad": "0",
                                                                        "replies": []
                                                                    }
                                                                ]
                                                            }
                                                        ]
                                                    },
                                                    {
                                                        "user_name": "rubiks6",
                                                        "time": "31 August, 2022",
                                                        "context": "Thank you for volunteering your profession as a zoologist. It is pleasant to know with whom I am having a conversation. \n\nI respect what you do and the education you have received. In our discussion today, I wish to demonstrate a bit of misinformation you received in your education. \n\nLife only comes from life. We have daily, constant demonstrations of that claim.\n————\n\nI am a computer programmer from the 60s to 2000 but have more recently attended seminary studying theology. Technically, I have an 8th grade education and a GED. Papers hung on walls do not necessarily indicate a person’s level of knowledge or ability to reason well, as I’m sure you know.",
                                                        "good": "0",
                                                        "bad": "0",
                                                        "replies": [
                                                            {
                                                                "user_name": "beadgBass",
                                                                "time": "31 August, 2022",
                                                                "context": "\"Life only comes from life. We have daily, constant demonstrations of that claim.\"  Here you received misinformation from your lack of education in science. We have no demonstrations of that at all. It is just your conjecture, not even an hypothesis.",
                                                                "good": "0",
                                                                "bad": "0",
                                                                "replies": []
                                                            }
                                                        ]
                                                    }
                                                ]
                                            }
                                        ]
                                    },
                                    {
                                        "user_name": "rubiks6",
                                        "time": "31 August, 2022",
                                        "context": "My “narrow view of God”?\n\nDo you have a broader view of God?",
                                        "good": "0",
                                        "bad": "2",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "Where’sYourProof",
        "time": "31 August, 2022",
        "context": "Maybe Spacex personnel should supervise the entire process ensure fueling happens without any glitches",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Straightarrow852",
        "time": "30 August, 2022",
        "context": "Huh...NASA can't get it up...Join the club.",
        "good": "1",
        "bad": "1",
        "replies": [
            {
                "user_name": "rubiks6",
                "time": "31 August, 2022",
                "context": "Too much information, dude. No one is interested in your junk.",
                "good": "0",
                "bad": "4",
                "replies": [
                    {
                        "user_name": "Straightarrow852",
                        "time": "31 August, 2022",
                        "context": "Why did you assume I was referring to myself?  The fact you even responed is actually weird.",
                        "good": "3",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "Straightarrow852",
                "time": "3 September, 2022",
                "context": "Well, Well....talk about the bull in the china shop...Better call Elon.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "rubiks6",
        "time": "31 August, 2022",
        "context": "\"Life only comes from life.\" – Louis Pasteur.\n\nRemember that the next time you drink sour milk. Abiogenesis doesn't happen. That's why the milk on my pantry shelf doesn't go bad. Abiogenesis doesn't happen, even though the \"building blocks of life\" are all there inside the cartons.\n\nLife does not exist on the Moon. Neither does it exist on Mars or Titan or Europa or Io or in the atmosphere of Venus or on or around any body in the universe other than Earth. Life only exists on Earth where God put it. Abiogenesis doesn't happen.",
        "good": "0",
        "bad": "5",
        "replies": [
            {
                "user_name": "ArneSaknussem",
                "time": "31 August, 2022",
                "context": "I think that Louis Pasteur was wonderful for his time, but some of his thoughts have soured.\nAbiogenesis happens. Life's existence is all the evidence you need.",
                "good": "3",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "rubiks6",
                        "time": "1 September, 2022",
                        "context": "What you really need is an explanation for life's existence. To say 'life exists' does not explain how or why life exists. That life exists is not in question. The question is, can life emerge from non-living materials without the intervention of an already living agent? Louis Pasteur said it cannot. I agree with him. Unless you can show otherwise you have nothing more than your own conjecture.\n\nI have offered you an alternative explanation for the existence of life that does not involve abiogenesis. That alternative is that life was created by the eternal, living God. Life only comes from life.\n\nY'know – it's possible you're a Boltzmann brain but it's highly unlikely. It's possible life emerged from non-living material without the intervention of an intentional agent but it's highly unlikely.\n---------------------------------\n\nHow does life exist?\nYour answer ... Life exists.\n\nSee how that fails?\n\nWhy does life exist?\nYour answer ... Life exists.\n\nAgain, see how that fails?",
                        "good": "0",
                        "bad": "2",
                        "replies": [
                            {
                                "user_name": "quietsmith",
                                "time": "1 September, 2022",
                                "context": "All evidence shows that the earliest forms of life were simplistic, precisely as one would expect as life arising from the process of abiogenesis. \n\nYou were already schooled on Pasteur but apparently you didn't learn.\n\nHe was talking about spontaneous generation and he's more than a century out of touch with biological and biochemical sciences. \n\nName dropping a famous scientist to lend credibility to your nonsense doesn't help you. Pasteur wouldn't have a clue what was going on in any modern lab anymore than a doctor from the same time period as Pasteur would understand the concept of DNA.",
                                "good": "3",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "rubiks6",
                                        "time": "1 September, 2022",
                                        "context": "“All the evidence “? You mean all the conjecture. The simplest bacterium is far more complex than researchers can understand. Every living cell comes from a living cell. You need to explain how a living cell can arise from non-living materials. There is no observable evidence that this can happen. No one has ever seen it happen — ever.",
                                        "good": "0",
                                        "bad": "2",
                                        "replies": [
                                            {
                                                "user_name": "quietsmith",
                                                "time": "1 September, 2022",
                                                "context": "No I mean all of the evidence. We go from simplistic to complex as the fossil record goes on and there's not the least bit of conjecture involved there. Conjecture is a conclusion based on incomplete information.\n\nYou know, what you're doing right now.\n\nAs you were already instructed on, but we can go over it again if you want.\n\nWe actually have a very good idea of how abiogenesis happened, but our current problem is that we don't know which of two critical steps happened first, and so there are competing models for both of them. The notion that we have \"no idea\" is completely false. \n\nAnd since you reject out of hand basically the entirety of scientific knowledge as a 'conspiracy' of some sort, quit pretending you'd accept an explanation of abiogenesis if one of the two competing models was shown to be correct and we had 'theory of abiogenesis'",
                                                "good": "3",
                                                "bad": "0",
                                                "replies": []
                                            }
                                        ]
                                    },
                                    {
                                        "user_name": "rubiks6",
                                        "time": "1 September, 2022",
                                        "context": "Your complaint about “name dropping” is a straw man. Answer the quote — “life only comes from life.” Stay on topic. Argue that life can arise from non-living materials without the intervention of a living agent. That is the topic. Can you argue about that?",
                                        "good": "0",
                                        "bad": "1",
                                        "replies": [
                                            {
                                                "user_name": "quietsmith",
                                                "time": "1 September, 2022",
                                                "context": "No, that's not a strawman, that's precisely what you did. \n\nYou went back to a scientist from the 1800s who isn't even talking about abiogenesis as if what he had to say on spontaneous generation was relevant to abiogenesis. \n\nMostly because you don't know enough to know that those are not the same things. I am staying on topic, you're going to the 1800s to name drop a famous scientist who isn't even talking about the subject of abiogenesis.\n\nSure I can argue about that. You can't, because you don't know anything about it, but I can which is why I keep having to tell you about the two competing models for abiogenesis that you pretend don't exist.",
                                                "good": "0",
                                                "bad": "0",
                                                "replies": []
                                            }
                                        ]
                                    }
                                ]
                            },
                            {
                                "user_name": "beadgBass",
                                "time": "2 September, 2022",
                                "context": "If God is living, and life only comes from life, what life form did God come from?",
                                "good": "1",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "rubiks6",
                                        "time": "2 September, 2022",
                                        "context": "God is eternal. \n———\n\nGlad you’re back with a serious question. Your earlier insult was not befitting of your intelligence.",
                                        "good": "0",
                                        "bad": "1",
                                        "replies": [
                                            {
                                                "user_name": "beadgBass",
                                                "time": "2 September, 2022",
                                                "context": "Your answer is a contradiction of \"life only comes from life.\"\nWhereas I believe that God is eternal, it is a contradiction of your own words.",
                                                "good": "1",
                                                "bad": "0",
                                                "replies": [
                                                    {
                                                        "user_name": "rubiks6",
                                                        "time": "2 September, 2022",
                                                        "context": "There is no contradiction. God is life and God is eternal, therefore God's life comes from Himself, for He is eternal.\n\nThis is known as God's aseity. You can look it up.\n\nYour question has been asked by countless numbers of people but I'm happy to answer it anew for you.",
                                                        "good": "0",
                                                        "bad": "0",
                                                        "replies": [
                                                            {
                                                                "user_name": "beadgBass",
                                                                "time": "2 September, 2022",
                                                                "context": "You have no answers, only obfuscations to contort scientific reality into your own narrow misinterpretation of the Holy Bible.\nScience moved on from that in the 1830s, with the support of many a devout Christian such as Charles Lyell and Charles Darwin.",
                                                                "good": "0",
                                                                "bad": "0",
                                                                "replies": [
                                                                    {
                                                                        "user_name": "rubiks6",
                                                                        "time": "2 September, 2022",
                                                                        "context": "That was an answer. Just because you disagree with it does not mean it stops being an answer. Do you have your own private definition of “answer”?\n\nWhile Lyell and Darwin may have attended church because it was a cultural thing to do, both men stated their interest in eliminating God as an explanation for existence and for life. My private definition of “Christian” includes believing the Christian Bible. Both Lyell and Darwin contradicted the Christian Bible.",
                                                                        "good": "0",
                                                                        "bad": "0",
                                                                        "replies": [
                                                                            {
                                                                                "user_name": "beadgBass",
                                                                                "time": "3 September, 2022",
                                                                                "context": "Now you are outright lying about Lyell and Darwin. They were friends, and whereas Lyell was a mentor to Darwin, he never accepted Darwin's then hypothesis, now theory, of evolution through natural selection, because of his Christian faith.\nIt was not about \"attending church\" for cultural reasons. How silly.\n\n Lyell, who guided science beyond 'natural theology,' made the same mistake as you in rejecting biological evolution. \nOf course we now have much, much more evidence for biological evolution from a host of scientific disciplines, including my own field of zoology. Even Lyell would give us a closer listen now, if he were still around.",
                                                                                "good": "0",
                                                                                "bad": "0",
                                                                                "replies": [
                                                                                    {
                                                                                        "user_name": "rubiks6",
                                                                                        "time": "3 September, 2022",
                                                                                        "context": "Is your evidence a counterfactual, ‘what Lyell would do if he were around’??\n\nYou’ve got to be kidding. We are talking about science, not making up stories. You are making up a story about what you think  Charles Lyell would think if he were around today. Do you think that’s doing science. Can you interview Charles Lyell and ask him what he would think today?  \n\nThis is the kind of silliness I am talking about when I say you guys don’t even know what “evidence” means. I have to wonder if you are really a zoologist or any kind of scientist. You certainly don’t talk like a scientist. Maybe you’re a zookeeper.\n\nLet’s stick to “origin of life.” As a geologist Charles Lyell had nothing to say about that and Charles Darwin only spoke briefly about some nondescript pond. Neither Lyell nor Darwin belong in this discussion. “Evolution” doesn’t belong in this discussion. Without life, no biological evolution takes place. I’m telling you that life only comes from life. You say abiogenesis happens. I’m telling you that all the empirical evidence we have supports my claim and discounts yours. \n\nGod made it so, so simple, even a small child can get it. Giraffes make giraffes and goldfish make goldfish. It doesn’t get simpler than that. Alligators make alligators. Robins make robins. Snails make snails. This is the empirical evidence — what can be observed. C’mon, Mr. Zoologist — do they just hand out zoologist certificates to anyone who asks?",
                                                                                        "good": "0",
                                                                                        "bad": "0",
                                                                                        "replies": [
                                                                                            {
                                                                                                "user_name": "beadgBass",
                                                                                                "time": "3 September, 2022",
                                                                                                "context": "Goodbye. You are uneducable and not worth my precious time.",
                                                                                                "good": "0",
                                                                                                "bad": "0",
                                                                                                "replies": [
                                                                                                    {
                                                                                                        "user_name": "rubiks6",
                                                                                                        "time": "3 September, 2022",
                                                                                                        "context": "You certainly can’t educate me to believe a lie. That’s exactly how you have been educate. You’ve been taught a lie. You drank it all up like cheap wine. You will not find much truth in ivory towers but you sure can find delusions. Do you think I am uneducated? I’ve learned to think for myself with guidance from the Living God, who gave me the ability to think. I wouldn’t trade my 8th-grade education for your type of atheistic, materialistic, sheepish, worthless education ever. To what you have to teach, I say, PSHAW!\n\n“For the wrath of God is revealed from heaven against all ungodliness and unrighteousness of men, who by their unrighteousness suppress the truth. For what can be known about God is plain to them, because God has shown it to them. For his invisible attributes, namely, his eternal power and divine nature, have been clearly perceived, ever since the creation of the world, in the things that have been made. So they are without excuse. For although they knew God, they did not honor him as God or give thanks to him, but they became futile in their thinking, and their foolish hearts were darkened. Claiming to be wise, they became fools,”\n— The Bible,  Romans‬ ‭1.18 -  22‬ ‭(ESV)\n\n\nOnly God, who created your mind, can open your mind to see and understand Him, if He chooses to do so. I wish you blessings. You have been prayed for. G’bye.",
                                                                                                        "good": "0",
                                                                                                        "bad": "0",
                                                                                                        "replies": []
                                                                                                    }
                                                                                                ]
                                                                                            }
                                                                                        ]
                                                                                    }
                                                                                ]
                                                                            }
                                                                        ]
                                                                    }
                                                                ]
                                                            }
                                                        ]
                                                    }
                                                ]
                                            }
                                        ]
                                    },
                                    {
                                        "user_name": "rubiks6",
                                        "time": "4 September, 2022",
                                        "context": "The audacity! The arrogance! That you thought you could teach me something – as though you had some wisdom?!\n\nYou, who have walked this Earth for just a few days, don't even remember when or how you got here, and you actually think you know something? Ridiculous!\n\nPersonally, I know nothing but what I have from God's Word. God has wisdom. I do not. You most certainly do not, as one who rejects God and God's Word. True science starts with Genesis 1.1. Isaac Newton knew this, as he noted in his introduction to the Principia. (I have handled, turned the pages of the original Principia, kept in the Library of Congress before it was closed to the public – a sad day.)\n\nUnteachable? You'd better believe it! Certainly not by the likes of you – someone who has swallowed and relished all the best lies offered by his ivory-towered jesters. No, thanks. There's nothing you can teach me. You are correct. I am uneducable by you. (But \"unteachable\" is so much easier to pronounce.)\n\nB'bye.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "quietsmith",
                "time": "31 August, 2022",
                "context": "What is it about fundies that have them running away to create new threads because they don't like how an argument is going? \n\nPasteur was talking about the concept of spontaneous generation and how it was shown to be wrong. He had no concept of abiogenesis and abiogenesis is not even remotely close to being the same thing as spontaneous generation. \n\nOf course abiogenesis happens, because if it didn't, there wouldn't be life.",
                "good": "2",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "rubiks6",
                        "time": "1 September, 2022",
                        "context": "There is an alternative explanation for the existence of life.\n-------------------------\n\nThe only difference between \"abiogenesis\" and \"spontaneous generation\" is the phonemes used to express them. Both terms have exactly the same definition.",
                        "good": "0",
                        "bad": "1",
                        "replies": [
                            {
                                "user_name": "quietsmith",
                                "time": "1 September, 2022",
                                "context": "Oh and did you not see the response where I explained how laughably wrong you were about \"no evidence\" for abiogenesis? :D",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "NormanBlanton",
        "time": "30 August, 2022",
        "context": "I get the impression there are no major issues,\n\nthough it maybe be them just trying to put a positive spin on things.",
        "good": "4",
        "bad": "0",
        "replies": [
            {
                "user_name": "fibonacci1.618",
                "time": "31 August, 2022",
                "context": "I'm glad they had detectors for the valves. Since 1967, too many missions have gone up in flames.",
                "good": "3",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "Iclimbedthemountain",
        "time": "31 August, 2022",
        "context": "Space travel should be handled by private enterprise and NASA should divert all funding toward that goal.\nSpaceX is so far ahead of NASA in all aspects, especially in cost efficiency.",
        "good": "0",
        "bad": "2",
        "replies": [
            {
                "user_name": "beadgBass",
                "time": "31 August, 2022",
                "context": "NASA's partnership with SpaceX, which started with the Obama administration, worked really well, and much funding was diverted to SpaceX. There is nothing keeping SpaceX from doing more on their own (besides just junkets for billionaires.)",
                "good": "4",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "splootch14",
        "time": "1 September, 2022",
        "context": "Russia or China are gonna destroy Artemis 1 if NASA have biblical apocalyptic intentions.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dobrt",
        "time": "2 September, 2022",
        "context": "It's too bad Biden couldn't be put on hold because of his leaks......",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rubiks6",
        "time": "31 August, 2022",
        "context": "The Moon is still a dead rock, even after 50 years.",
        "good": "0",
        "bad": "5",
        "replies": [
            {
                "user_name": "beadgBass",
                "time": "1 September, 2022",
                "context": "Your understanding of science appears to have suffered the same fate.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "rubiks6",
                        "time": "1 September, 2022",
                        "context": "Our conversation was so productive yesterday. Now you’ve turned back into a donkey’s rear end. Too bad.\n\nTough day at the zoo?",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "Straightarrow852",
        "time": "3 September, 2022",
        "context": "Amazing...Space-X is launching on a monthly basis and NASA can't even turn the ingition key.  What a horrible waste of taxpayer money",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "charlestonbeach",
        "time": "22 September, 2022",
        "context": "The Artemis rocket is leaking 3.4% of the fuel. To compare that to my car, that would be equivalent to be having 3/4 of a gallon of gasoline sloshing around the interior when I fill up. Would that be OK if you had 3/4 of a gallon of gas inside your car? Ah, no. No it would not be OK.",
        "good": "0",
        "bad": "0",
        "replies": []
    }
]