[
    {
        "user_name": "ChillWills",
        "time": "2 days ago",
        "context": "Garland's Gestapo strikes again...",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "hooklineandthinker",
        "time": "2 days ago",
        "context": "Yet the Catholics continue to vote Democratic.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "USADAD59432",
        "time": "2 days ago",
        "context": "So he pushes someone and his house is raided, he’s arrested and could do time.  What about this pro-life 84 year old…\nAn 84-year-old volunteer canvasser was shot in the back while campaigning door-to-door in her own community for pro-life issues.\n\nAccording to a Sept. 24 statement from Michigan Right to Life, on Sept. 20 a “heated conversation” took place between one of its local volunteers and an occupant of a home in Odessa, Michigan, a small community near Grand Rapids.\n\nAs the volunteer was leaving the residence, she was allegedly shot in the rear part of her shoulder by a man that had not been a part of the discussion.\n\nWhere’s the FBI to go get the guy who shot her… not pushed… shot!",
        "good": "141",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "gs106",
        "time": "2 days ago",
        "context": "Republicans breaking the law again… no surprise there",
        "good": "2",
        "bad": "12",
        "replies": []
    },
    {
        "user_name": "Cherrio",
        "time": "2 days ago",
        "context": "No trust at all anymore for the FBI!  They’re just agents of Biden’s woke policies!",
        "good": "32",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Failedonceagain",
        "time": "2 days ago",
        "context": "Corruption at its finest.....once again political attack by our government using Third World tactics.  The DOJ and FBI has lost all credibility at the highest levels....very sad and will take decades to repair if they take the time to clean up their act!",
        "good": "65",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bluemax79",
        "time": "2 days ago",
        "context": "This is how they roll in Pennsylvania. It also explains Fetterman.",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Antidivisionist",
        "time": "2 days ago",
        "context": "Congressional committees are getting interested in the DOJ tactics, Garland is even uglier under a microscope.",
        "good": "48",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Tripod",
        "time": "2 days ago",
        "context": "Our DOJ and FBI are the laughing stock of law enforcement. Plain and simple. ",
        "good": "56",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "ErinS069",
        "time": "2 days ago",
        "context": "The FBI is really scraping the bottom of the barrel if this is the biggest FACE Act prosecution they can find. And a testament that Pro-Lifers are acting non-violently nationwide.",
        "good": "57",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Goonter1",
        "time": "2 days ago",
        "context": "I heard his attorney speak. They offered to meet with the opposition attorney s 3 months prior to the raid without ever getting a response",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "foxisnotamerican",
        "time": "2 days ago",
        "context": "So I guess this is no longer just a misdemeanor anymore.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "eljefegrande",
        "time": "2 days ago",
        "context": "Leave your kid at home when protesting.",
        "good": "1",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "william4life",
        "time": "2 days ago",
        "context": "Dems. have turned into Fascists !!! How obvious .",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "gs106",
        "time": "2 days ago",
        "context": "Republicans sure do love their crime",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "loler817",
        "time": "2 days ago",
        "context": "I have ZERO confidence of a fair and just FBI, CIA and the Federal Justice system..so very sad and maddening ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ellmd",
        "time": "2 days ago",
        "context": "I think we can all smell the intimidation in this. Liberals should be outraged by this themselves but are too short-sighted to realize they may be on the receiving end of this one day also.",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "hocuspocus86",
        "time": "2 days ago",
        "context": "Another political arrest and prosecution. The FBI is now a special wing of the Democrat party.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Fifewasright",
        "time": "2 days ago",
        "context": "That’s rich — Democrats burn and loot almost every day and nothing happens, but be a parent and defend your child and your house is raided and you are arrested 🙄🙄🙄",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "rockhead",
        "time": "2 days ago",
        "context": "Long story short, he was protesting in front of an abortion clinic and that's what the left wants, sensational news about abortion to keep it in the news.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "free~energy",
        "time": "2 days ago",
        "context": "The BIASED FBI on steroids!\nI am sure, per AG Garlands order.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "terryyaqui",
        "time": "2 days ago",
        "context": "The current F.B.I is irreparably compromised and corrupt at the highest levels!\n\nThe high-ranking bosses at the F.B.I. can't be bothered or concerned with such trivialities like constitutionally protected rights, equal treatment or even \"attorney-client privilege.\"  Instead, they have become the Democrat Party's version of the \"Nazi Gestapo,\" \"East German Stazi,\" and \"Iranian Savak\" secret government police forces!\n\nThe current F.B.I. motto is \"Fidelity, Bravery, Integrity.\"\n\nThanks to the \"Seventh Floor\" occupants of F.B.I. headquarters in Washington D.C., it is time to change it to \"Treachery, Cowardice, Duplicity.\"",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "safe1y",
        "time": "2 days ago",
        "context": "JB's DOJ  pushing the  conservates are terrorist agenda. \nThere are very few facts that support this agenda so the FBI/DOJ are helping JB pad the numbers.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "danceswithrats",
        "time": "2 days ago",
        "context": "From the fbi targeting political opponents of dictator biden to the irs hiring 87k to also go after what we can only assume political opponents to a whole list of insane things going on, id say we are deep in the twilight zone",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "UltraMagaMan2000",
        "time": "2 days ago",
        "context": "The DOJ and the FBI have become political assault weapons  for the DNC to use on the American people.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ishmir",
        "time": "2 days ago",
        "context": "Spin away Fox, the guy assaulted an elderly man.",
        "good": "0",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "judah",
        "time": "2 days ago",
        "context": "I am 100% pro-life, come beat on my door! ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "VikingsMatter606",
        "time": "2 days ago",
        "context": "These are scary times...The FBI acting like the KGB. This is all the result of the father of a Junkie and his woke string pullers. I'm glad Biden is pushing all this woke garbage way too fast. Time is running out for Biden. The American people will become wise sooner than they expected and is a major factor come mid term.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "banditairborne32582",
        "time": "2 days ago",
        "context": "why would you take your kid to an abortion clinic?",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "tndavid",
        "time": "2 days ago",
        "context": "DOJ needs overhauling.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "crimestopper1",
        "time": "2 days ago",
        "context": "We pray the Rosary in front of, but not blocking, a Planned Parenthood operation. Other than obscenities from pro-abortion folks, so far no problems.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "godzilla054",
        "time": "2 days ago",
        "context": "Could it be the Stasi ?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "seaden",
        "time": "2 days ago",
        "context": "Christopher Wray needs to be fired, if not, he and all of his administrators need to be relocated to an office in the Aleutian Islands.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "deadred01",
        "time": "2 days ago",
        "context": "Doesn't matter if they lose the case the message has been sent go against us and you'll be jailed even if it's for a short amount of time.\n\nFBI comes knocking on my door they will be meet with a wall of lead.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "RobynFritter",
        "time": "2 days ago",
        "context": "The government does not care if it is a “loser case”; the process is the punishment.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Alrightythen388",
        "time": "2 days ago",
        "context": "GOP says it’s ok the assault elderly people. Ok, got it.",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "davior",
        "time": "2 days ago",
        "context": "The FBI and DOJ have become completely corrupt over the last dozen or so years.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "donnie’sboy",
        "time": "2 days ago",
        "context": "Gotta love a former prosecutor who gets his facts from a Fox News story about what the missus of the guy who beats up old people said.",
        "good": "3",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "CG28",
        "time": "2 days ago",
        "context": "BBB: Biden's Brown-shirt Brigade...🤔🃏",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "flicewater",
        "time": "2 days ago",
        "context": "Does Hollywood have a contract to provide directors to the FBI for raids?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "eljefegrande",
        "time": "2 days ago",
        "context": "Republicans won't be content to ban abortion in red states. They'll travel to blue states to cause trouble. The guy in this story drove 2.5 hours each week.",
        "good": "1",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "underbelly568",
        "time": "2 days ago",
        "context": "Just another case of the FBI cracking down on free speech, cracking down on free speech on social media, only concerning itself with Hollywood cases, instead of doing real work, like busting up the massive fraud in Medicare!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "usisfallingaprt",
        "time": "2 days ago",
        "context": "The people that are using the DOJ and FBI as a political tool for revenge should be themselves indicted for miss using the office for political reasons. And follow the trail clear to the White House, and charge all involved.",
        "good": "31",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "fatdaddy635",
        "time": "2 days ago",
        "context": "This American will alwase be absolutely convinced of the FBI's corruption. \n I don't believe that most agents arre good people.  No more than I believe most of the Hells Angeles are basically goid people. \n Both are gangs bent on doing criminal things.\n ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "berightnow",
        "time": "2 days ago",
        "context": "15 armed agents for a shove, this is beyond lunacy. The guy's attorney sent a letter stating that he would turn his client in, but the FBI would rather politicize and grandstand.\n\nThis is sick stuff....",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "i_care",
        "time": "2 days ago",
        "context": "WHO IS GOING TO WATCH THE WATCHERS?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rjc2011",
        "time": "2 days ago",
        "context": "May be time to do away with the FBI and start over",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "70olds",
        "time": "2 days ago",
        "context": "this is another black eye against the F.B.I. there starting to look verry bad as a group. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "snowflakemaker",
        "time": "2 days ago",
        "context": "this DOJ/FBI does not seek to prosecute....they look to find an excuse to simply intimidate others. on behalf of those seeking to completely destroy this once-great nation.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rowdygoering",
        "time": "2 days ago",
        "context": "Local authorities should be handling this, not the brown shirts.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "LeskoBrandin",
        "time": "2 days ago",
        "context": "The FBI keeps exposing itself as the enforcement arm of the democrat tyrants. Their own secret police.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "newkenjones",
        "time": "2 days ago",
        "context": "So, they spent what, $100,000 to arrest this guy, when they could have simply called his lawyer and ask he come down to the office?\nC'MON. This is obviously a show arrest, ment to determine anyone form being a pro-lifer.\nThe FBI needs to be restructured. They are quickly becoming the KGB.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "threedogs",
        "time": "2 days ago",
        "context": "You’d like to THINK it’s a loser case, but with an out of control fascist Democrat government and their Gestapo in the FBI, we can’t be sure. Our institutions are no longer working for the people. They’re working for Democrats.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "lvlawyer",
        "time": "2 days ago",
        "context": "The facts of this matter are almost inconceivable. The reason I say almost is that Merritt Garland and Christopher Wray will do anything to keep their jobs. Garland is, and will be, forever angry that he did not get the Supreme Court appointment (God, forbid!); and, Wray is so in fear that his past performance will come to the forefront that he will do anything. How sad for our country!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "zepplinrules",
        "time": "2 days ago",
        "context": "Dim's just being Dim's, make it up, try to prosecute, waste time and money, get 0 accomplished.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "patgreyc",
        "time": "2 days ago",
        "context": "To the point made in the article about notifying him of the indictment, it was confirmed that his attorney had been notified and arrangements had been made to let him turn himself in. The FBI showing up to arrest him at home is a disgusting publicity stunt.",
        "good": "41",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "NotCornPop",
        "time": "2 days ago",
        "context": "Planned Parenthood is a liberal communist extremism group.  It needs to be defunded. ",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "davior",
        "time": "2 days ago",
        "context": "Typical of an arrest of a conservative. 25 officers and 15 vehicles for a simple assault misdemeanor. What a waste of tax dollars and resources.",
        "good": "49",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "whiskeymike446",
        "time": "2 days ago",
        "context": "This fascist regime…. Biden’s personal little SS group…",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ThayThay",
        "time": "2 days ago",
        "context": "Hmm pro-life protester arrested while murdered are sent home. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "carmine24",
        "time": "2 days ago",
        "context": "Abolish Corrupt FBI replace with U S Marshals.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "1shonuf1494",
        "time": "2 days ago",
        "context": "But if the poor guy can't afford $250k in legal fees, he may have to enter in to a plea bargain though not guilty. That's the way they work.  Not to convict, but destroy you.",
        "good": "81",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "dwtwin",
        "time": "2 days ago",
        "context": "The FBI, our American Left wing Gestapo.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "r.k.and1776others",
        "time": "2 days ago",
        "context": "I used to trust the FBI. Now, that they have become an arm of the Democrat party, not so much.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "zbernie",
        "time": "2 days ago",
        "context": "Biden's gestapo strikes again!  These Nazis are are out of control!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "GOLDENJET9",
        "time": "2 days ago",
        "context": "Exclusive comment from John Fetterman ....\nDuh,. I........ believe....duh.....it ... duh was ...duh...\nVanilla....Thank you....",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "nutnfnc",
        "time": "2 days ago",
        "context": "IF YOU ARE OLD ENOUGH TO RUN THAT TRAP, YOU ARE OLD ENOUGH TO SUFFER THE OUTCOME.........................................................................................................................................",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "bidensinflamedcolon",
        "time": "2 days ago",
        "context": "The FBI has a serious public perception problem. This is definitely not helping.",
        "good": "10",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Captain74",
        "time": "2 days ago",
        "context": "The Federal Bureau of Intimidation is very good at what they do.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "domino2121487",
        "time": "2 days ago",
        "context": "Waited almost a year!!  PURE POLITICS!  WAKE UP AMERICA NOW!  ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "eljefegrande",
        "time": "2 days ago",
        "context": "When there's an altercation at a protected space like a women's clinic, I blame the guy who drove 2.5 hours -- with his kid -- to protest there.",
        "good": "1",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "not-for-sale",
        "time": "2 days ago",
        "context": "Thats a beautiful family. Probably what was so threatening to the socialist movement.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "yelnatsekud",
        "time": "2 days ago",
        "context": "America’s leftist fascists on display for the world to witness. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "AnaJaneHead",
        "time": "2 days ago",
        "context": "The FBI sends 20 armed agents to a man’s house to arrest him because he pushed a crazy guy away from his 12 year old. That’s just another reason to hate the politically weaponized DOJ and FBI. They’re reprobates.",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "littlegreenapple",
        "time": "2 days ago",
        "context": "Sounds like religious persecution to me.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "demswilldie",
        "time": "2 days ago",
        "context": "Like I said the FBI gestapo comes looking for you give them bullets in return!",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sledgecity340",
        "time": "2 days ago",
        "context": "I am surprised the FBI had the resources.  I thought all their agents were still looking for J6 insurrectionists and Trump. ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "avoiceinthewoods",
        "time": "2 days ago",
        "context": "Here is the why, they will make this arrest and others like it fit the bill for some new domestic terrorism statistic on the annual reports, they need events that create a statistic (whether it is true or not) that will be used to justify a new FBI dedicated team or increase the size of an existing one.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mikeso",
        "time": "2 days ago",
        "context": "The DOJ and FBI, what a joke. Lets go after anyone that does not agree with the woke,  should be there motto.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "seapadre",
        "time": "2 days ago",
        "context": "The FBI has become a embarrassment to our country of late ",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "MiddleC",
        "time": "2 days ago",
        "context": "How many of the Jane’s Revenge group have been arrested  by the FBI on similar charges ! Zip, zero, nada …we now have a political police force in our country. ",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mackhess901",
        "time": "2 days ago",
        "context": "The Heritage Foundation gets sued and loses a lot... Remember that while reading the opinion of their \"legal expert\"",
        "good": "2",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "pj58",
        "time": "2 days ago",
        "context": "This is so sad and you know the FBI is weaponized when they take 30 agents to arrest 1 man for pushing another man who was bothering his 12 year old son, but they never do anything close to this to any Democrats!!",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "whatever66666",
        "time": "2 days ago",
        "context": "The only way of fixing this Country is a full gut.  Anyone think that will ever happen?  Yeah, me neither.  Put a fork in her, America is done.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ranger11989",
        "time": "2 days ago",
        "context": "This is crazy if accurate. How about the 83 yr old woman in Odessa Michigan who was shot in shoulder after heated argument ( she is Right to Life volunteer) where is the suspect?!No arrest yet! 😡",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "ohnutstoyou",
        "time": "2 days ago",
        "context": "The FBI ??  America's premier terrorist organization !!  How many left wingers have been arrested for attacks on conservatives !!!!     ZERO !!!!!!!!!!!!!1",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Lakpa",
        "time": "2 days ago",
        "context": "This is not FBI, I respected for years !!!  “Thanks” to Democrats, FBI is very close to KGB and Putin’s mentality. Unfortunately !",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "joepike274",
        "time": "2 days ago",
        "context": "This law prohibits \"the use of physical force, threat of physical force, or physical obstruction to intentionally injure, intimidate, interfere with or attempt to injure, intimidate or interfere with any person who is obtaining an abortion.\"\n\nHow does a 72 year old man fit as the \"victim\" in this case?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "civilwar2020",
        "time": "2 days ago",
        "context": "Don’t mess with the liberal agenda, is the message the FBI and DOJ are proudly and openly driving across America.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "swbatti",
        "time": "2 days ago",
        "context": "Magats should be able to shoot somebody on 5th Ave. and get away with it.\nIf they are arrested everyone knows it’s DOJ and FBI left wing corruption.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "DeplorablePsychophant#258638",
        "time": "2 days ago",
        "context": "Conservatives need to get better at knowing when they’re being setup. If you’re within the legal distance from the abortion clinic and the “escort” goes out of their way to confront your child, you’re getting bated. If Jan 6 teaches us anything it’s that these leftists will bait/ manufacture a scenario to arrest conservatives. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "fightthefarleft",
        "time": "2 days ago",
        "context": "Lawfare, or making the legal process into warfare.  The process becomes the punishment, regardless of guilt or innocence.  Average citizens can not afford to defend themselves.\n\nGOP!  Where are you?!  WE NEED HELP!!!!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "repblicoftexas",
        "time": "2 days ago",
        "context": "The power of the USG to send the FBI to your home to \"rattle your cage\". This is nothing but intimidation.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "stagrcoach268",
        "time": "2 days ago",
        "context": "Garland wins even if he loses this case because his objective is to cause Houke to go broke defending himself.  No one can afford legal cost to defend against the US government.  That’s the purpose of the 87,000 new IRS employees.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Culper487",
        "time": "2 days ago",
        "context": "This is Biden and Garland sending a message to anyone pro-life.  Same message sent to parents or people who worked in trump admin.  The message is the US government controlled by Libs will come and arrest you for anything they want at any time. Even if you’re found not guilty, your life will be destroyed from legal costs and the cancel culture warriors.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Stockton",
        "time": "2 days ago",
        "context": "Keep at it FBI thugs. You’re well on your way to being eliminated as a federal law enforcement agency.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dudelbug",
        "time": "2 days ago",
        "context": "The fbi the new brown shirts...did everyone hear about what they did in Beverly hills?",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "FloridaCrackerGV",
        "time": "2 days ago",
        "context": "The DOJ and FBI are beginning to act a lot like the Gestapo. Is this what you Democrats voted for. And who’s the fascist",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "68_corvette",
        "time": "2 days ago",
        "context": "Need that many beta boy’s from FBI for one man?\nHave M1 tank ready to breach the door?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "navy1977656",
        "time": "2 days ago",
        "context": "This is a DOJ/FBI intimidation arrest, they knew it would hit all the Liberal news outlets and stir up the Left with a bunch of \"See I Told you so Dangerous MAGA'S\" .\nCan't have anyone looking at the lefts violence over the last couple of weeks. ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "quarantaa",
        "time": "2 days ago",
        "context": "WHY    ISN'T     ANTIFA    BEING  ARRESTED    AND  JAILED  ???    AFRAID  OF  THEM ??   WORKING  FOR  THE  DEMOCRATS  ??",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cmwyo",
        "time": "2 days ago",
        "context": "I'm still wrapping my head around the fact that Garland's DOJ, and Wray's FBI, would go to a \"Pro Life\" Pastor's home, who's been a part of the community for a LONG time, with that many agents and cars, with weapons drawn.  Did they really expect the Pastor to run, or shoot his way out?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "eljefegrande",
        "time": "2 days ago",
        "context": "Would anyone drive 2.5 hours to shout at men contemplating vasectomies?",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "krampus227",
        "time": "2 days ago",
        "context": "The IRS will soon be using similar tactics now that Biden doubled their size in both manpower and budget.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "lauren331",
        "time": "2 days ago",
        "context": "All the more reason to vote straight Republican ticket",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "veryoldcop202",
        "time": "2 days ago",
        "context": "Having two dozen agents might suggest the agents don't have the ability to handle a simple arrest . Most police depts would only have one or two officers for an arrest of that type .",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "feisty7",
        "time": "2 days ago",
        "context": "Biden's weaponized FBI/DOJ. The new American gestapo under Biden.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "djphoenix1",
        "time": "2 days ago",
        "context": "Is that the same 72 year old man who last year suffered a face plant while trying to interfere in a Police operation?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rollsroyce222",
        "time": "2 days ago",
        "context": "the fbi needs a complete over haul starting at the top wray has done nothing, anyone with  a little back round in law enforcement know they are being excessive",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "RedSkyAtNight",
        "time": "2 days ago",
        "context": "During my 43 year career in law enforcement I participated in serving thousands of warrants of all kind. From the information provided I can't believe that the agents approached in numbers with guns drawn.   Doesn't pass the smell test.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "goodgrief!545",
        "time": "2 days ago",
        "context": "Everything the FBI does these days is overkill and intended to be intimidating, not only to their \"suspect,\" but to the general public who read about their tactics.  Whoever is running this show needs to put the kibosh on these theatrics.  The general public is losing respect for the organization.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "purosis",
        "time": "2 days ago",
        "context": "The gestapo, sorry, the FBI is only following orders from their boss, Heinrich Muller.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "SilviaAviles",
        "time": "2 days ago",
        "context": "Time to make the dictator in chief a lame duck asap!!!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "WhiteIsBeautiful",
        "time": "2 days ago",
        "context": "But, but, Sean Hannity says the rank and file are upstanding and there are overwhelming numbers of whistleblowers coming forward! Like 2 of them at last count...",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "ItsJustme456",
        "time": "2 days ago",
        "context": "Is it the FBI or KGB or MSS? This administration and the left have gone full blown Communist.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "proudtobefortrump2020",
        "time": "2 days ago",
        "context": "The FBI is a Leftist weapon now.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "RetiredLEO(itsgoodtobegone)",
        "time": "2 days ago",
        "context": "It’s profoundly clear that federal law enforcement has been politicized and will do anything to prosecute those who oppose their agenda. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "eljefegrande",
        "time": "2 days ago",
        "context": "Righties suddenly want to defund law enforcement.",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "dede09",
        "time": "2 days ago",
        "context": "The DOJ and the FBI are taking on Biden's bidding.\nThey should be reviewed for entering the political agenda.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "vwhite572",
        "time": "2 days ago",
        "context": "According to the article he was arrested in accordance with the FACE act and is a federal crime. Act works for both pro life and pro choice facilities.\n \nThe Freedom of Access to Clinic Entrances Act of 1994, or FACE Act, is a law that ensures Americans' access to pro-life and pro-choice reproductive health services.\nThe FACE Act makes it a federal crime, with potentially steep fines and jail time, to use or threaten to use force to \"injure, intimidate, or interfere\" with a person seeking reproductive health services, or with a person lawfully trying to exercise the First Amendment right of religious freedom at a place of religious worship. The FACE Act also prohibits intentional property damage to a facility providing reproductive health services or a place of religious worship.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mahgo",
        "time": "2 days ago",
        "context": "This is gross overuse of power. For Petes Sake, the guy even offered to surrender himself if indicted. That happens all the time in the Federal system. The FBI and DOJ are out of control.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "littlegreenapple",
        "time": "2 days ago",
        "context": "Anti-Catholic Bigotry!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jamesh.",
        "time": "2 days ago",
        "context": "Enemies of the regime will not be tolerated.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "truthbtruth",
        "time": "2 days ago",
        "context": "From 1936, didn't a leader from a different country have his Gestapo???.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "swbatti",
        "time": "2 days ago",
        "context": "Trump has reportedly sidelined his $3million dollar lawyer, and has fallen back to using the parking garage ‘lawyer’.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Pookysmithers",
        "time": "2 days ago",
        "context": "FBI always over reacts, all about the \"show\" to them. They are not cops so they get really scared when doing this kind of stuff.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "kentruthman",
        "time": "2 days ago",
        "context": "Ahh the FBI, America’s Gestapo? Or just a bunch of liberal accountants with guns playing cops and robbers. There’s not a local law enforcement department in the country that would send 15 police officers to pick up a person wanted on basically a simple assault warrant. Come to think of it, the FBI didn’t even have 15 FBI agents present during Al Capone’s arrest.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "greydawg62",
        "time": "2 days ago",
        "context": "Garland's Gestapo strikes again. Parents of school children, anyone opposed to barbaric abortions - those are now the enemies in Biden's America.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Scott98",
        "time": "2 days ago",
        "context": "I hope everyone realizes that this SS force is not going to give up its new mission and authority based on elections. America lost and the fascists are here to stay",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "wednor64",
        "time": "2 days ago",
        "context": "Yet the murderer of a Republican teen by a 41 year old Democrat hate crime terrorist runs free.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "leftistsworstnightmare",
        "time": "2 days ago",
        "context": "Every FBI agent on that arrest violated their oath of service. They should have refused. If the locals had nothing to prosecute on, there was certainly nothing for the Feds to go after.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "txgulfgal1",
        "time": "2 days ago",
        "context": "Makes you afraid of them.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "AnaJaneHead",
        "time": "2 days ago",
        "context": "When is the FBI going to raid Alec Baldwin’s house and arrest him?",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "NEVERvotedemocratEVER.",
        "time": "2 days ago",
        "context": "This case isn't about right and wrong, or even about pro/con abortion. it's all about conservative shaming and harassments.\nIf this had happened in a small town, outside a convenience store over some trivial issue, there would be no federal case, or even a local case. it would be no case at all.\nThis is EXACTLY why I always say, NEVER vote for a democrat. EVER.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "marine0846",
        "time": "2 days ago",
        "context": "Conservatives have been screaming about the FBI for more than 6 years and nothing has changed. They are now, and will continue to be an arm of the Democrat party.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "marxismlost",
        "time": "2 days ago",
        "context": "So, the FBI arrested this guy but not any of the BLM/ANTIFA's that caused over a billion in damages to Federal property in 2020?\n\nSeems legit.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "patriotforever937",
        "time": "2 days ago",
        "context": "Authoritarian Marxist hate religion or family. It interferes with their control over the people.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "redryder996",
        "time": "2 days ago",
        "context": "I can't believe the Hypocrats thought this was a good idea, especially this close to the election. If a do-gooder like Houck and his family can be stormed by jack-booted thugs with automatic weapons in full riot gear, you could too. The only way to send a real message is to pull the red level in November.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "RLI538",
        "time": "2 days ago",
        "context": "The mere fact that the ultra-woke Philly DA turned down the case tells u everything need to know….it’s absolutely is a loser case. ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "nocetverum",
        "time": "2 days ago",
        "context": "good, last people you need to take a chance with is some nut hiding behind the bible",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "ENA497",
        "time": "2 days ago",
        "context": "FBI just following what the Democrats wish....",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "eljefegrande",
        "time": "2 days ago",
        "context": "No tactic is too brutal for poor people of color, but whites must be treated with kid gloves.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "prenticet",
        "time": "2 days ago",
        "context": "One of the things that the DOJ looks at when they target another law enforcement agency with a consent decree is the use of \"canned\" language.  Language that is not usual and descriptive but what shows up time and time again in police reports.  But here we have the same thing in statements issued by the FBI - canned language.  Disingenuous, you bet.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "nuuser",
        "time": "2 days ago",
        "context": "Politicized FBI. America can no longer be trusted.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tig1960jhv",
        "time": "2 days ago",
        "context": "This has ZERO to do with guilt and EVERYTHING to do with intimidation!",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "DennisM",
        "time": "2 days ago",
        "context": "If it takes 20 agents to arrest one man perhaps we should reevaluate their budgets and adjust staffing levels. A typical arrest for a misdemeanor takes two police officers. One to make arrest and the other to act as overwatch or cover. 20 agents? Come on man!",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Civil_Whites",
        "time": "2 days ago",
        "context": "Demstapo",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "chrisaj",
        "time": "2 days ago",
        "context": "Well, the FACE acts also protects Churches, but you don't see the FBI arresting left wing rioters who disrupted churches this past spring and summer.  You wonder why the right doesn't trust the FBI anymore.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "missouririchard",
        "time": "2 days ago",
        "context": "Sounds like the government is prepared to make him rich, beyond his wildest dreams!",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "kolv91",
        "time": "2 days ago",
        "context": "Power tends to corrupt; absolute power corrupts absolutely",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "david2657",
        "time": "2 days ago",
        "context": "State sponsored intimidation seems like a new norm, ugh!",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "darrellr227",
        "time": "2 days ago",
        "context": "I have heard of so many stories of 2 FBI Agents going to the door of known criminals and get shot.  Why send 2 to the criminals home and 15 to 20 to a family's home that houses no criminal history.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "SheldonOtter",
        "time": "2 days ago",
        "context": "the Biden police state rises ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "frustratedcitizen404",
        "time": "2 days ago",
        "context": "Experts from The Heritage Foundation yet again.  What else is new?  Fox relies heavily on the foundation for its disinterested observations and opinions.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "1969camaro!",
        "time": "2 days ago",
        "context": "The FBI has become nothing more than the gestopo for the democrats. They are not a fair and impartial law enforcement anymore working to keep us safe, rather they’re working to keep us in line. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "needtermlimits4crooks",
        "time": "2 days ago",
        "context": "Minor scuffle requires FBI raid??  Guess that means Hunter's laptop will result in an army of FBI to show up.  -Yeah, right.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "yourreplacement",
        "time": "2 days ago",
        "context": "Lily white--that's how all these domestic terrorists look.\nCoincidence?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Focused711",
        "time": "2 days ago",
        "context": "The arms of the DNC are long enough to scrape the bottoms of any barrel.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "iceeeone",
        "time": "2 days ago",
        "context": "What does a rogue agency look like, is the question I have? Is the FBI a rogue agency in this case? Does this incident rise to the level that the Federal Bureau of Investigation needs to intercede where the LOCAL law enforcement, County law enforcement, State law enforcement and local lawyers did not do anything?\n\nSorry but It appears to be a SERIOUS problem at the FBI if they are taking this kind of action! There is something behind the scenes controlling this outcome. It appears that there is someone at the Planned Parenthood that can pull some big strings.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "talibiden161",
        "time": "2 days ago",
        "context": "When DeSantis takes over in Jan. 2025 he MUST fire the top 3 layers of the DOJ and FBI and the DoD..",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "usisfallingaprt",
        "time": "2 days ago",
        "context": "Its all about optics, the message is Vote Democrat and we will take down any Republican that stands in the way no matter how trivial!",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "66+",
        "time": "2 days ago",
        "context": "THE FBI IS NOW THE DEMOCRAT VERSION OF THE NAZI-SS.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rhix",
        "time": "2 days ago",
        "context": "As of this week five hundred people have been murdered in Chicago alone, maybe the FBI should be focusing on the taxpayers right no to be murdered",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "jacknocoke",
        "time": "2 days ago",
        "context": "Joe's gestapo.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ToldYouSo0274",
        "time": "2 days ago",
        "context": "Here's an idea, dont bring your 12 year old son, when you are harrasing people outside of an abortion clinic. \n\nThen maybe you won't have to assault a senior citizen, who is actually working, which is what you should of been doing.",
        "good": "3",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "bubba_d",
        "time": "2 days ago",
        "context": "The Spetznas FBI and DOJ are testing the limits that they can push the public using totalitarian suppression tactics.  Incrementally these tactics are being used to desensitize Plain Joe as freedom  is removed and the population blindly accept their change from we the people to peon surfs under feudal lords.",
        "good": "7",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "eljefegrande",
        "time": "2 days ago",
        "context": "Imagine the uproar when Trump gets cuffed.",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "sandmansmith",
        "time": "2 days ago",
        "context": "The FBI is out of control!  Under Director Wray, they have demonstrated they act on behalf of Democrat Party elected officials to support the Democrat agenda rather than the Constitution.  When the Republican majority is sworn in, Director Wray and AG Garland need to be tried and removed from office for failing to faithfully execute the duties of their offices.  The FBI is too tempting an agency for one party to gain control over and should be split into functional departments like Forensic Accounting, Crime Laboratory, HRT/SWAT, etc. which would work under the direction of individual state police agencies.  Federal Law Enforcement has grown far too powerful for central federal control and must be remanded to the states!",
        "good": "54",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "freedomRequiresChoice",
        "time": "2 days ago",
        "context": "Why are there 15 agents, because the DOJ wants to intimidate this man and his family, there is no other reason. So the DOJ is now intimidating private citizens. I know at one time the DOJ was beneficial to this country but today, are they? I come up with no, they are not.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "justwonderingoutloud",
        "time": "2 days ago",
        "context": "Federal Bureau of Instigation",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "selfemployed_ct070",
        "time": "2 days ago",
        "context": "Our DOJ/SS is more dangerous to US citizens than the violent criminals the left refuses to lock up.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "at6texan",
        "time": "2 days ago",
        "context": "BIG news!!  Right up there with \"Russia claims to secure up to 98% support for annexation>\"",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "chuckwagen63",
        "time": "2 days ago",
        "context": "Biden \"reclassified\" the documents  Trump had. So how did Biden not have anything to do with it?",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Pookysmithers",
        "time": "2 days ago",
        "context": "Not helping the FBI's image or the current administration for that matter.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "crushthelies",
        "time": "2 days ago",
        "context": "How many days will Fox News milk this non-story?",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "jollyroger418",
        "time": "2 days ago",
        "context": "Bidens Gestapo coming to a town near you.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "amazingoly",
        "time": "2 days ago",
        "context": "Only way to stop this harassment is to hire a high profile attorney and sue the heck of of those who are abusing their authority.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "2flychris",
        "time": "2 days ago",
        "context": "I'm pro-life! I'm pro-conservative! I'm pro-Houck! ... and he's probably in the right (I don't know enough about this case to weigh in) but please stop bringing kids to ADULT activities.  Kids should not be involved with politics and adult activities such as these...I've been saying this about both sides of the fence bringing their kids to these events.  \"Let the kids be kids!\"",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "webertype40",
        "time": "2 days ago",
        "context": "What's everyone so upset about? It's just our government overlords reminding us that we're not allowed to disagree with them or speak out.",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "CDC1925",
        "time": "2 days ago",
        "context": "The FBI is the American version of china’s secret police.   Next then you know is off to work camps and re education camps. And the  biggest lie is that the US Government represents  that the US is a free nation with a  free republic government.  ",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "machoman",
        "time": "2 days ago",
        "context": "And what federal law was broken. As my good friend Bang Ding Ow use to say “Sum Ting Wong”",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "BannedByFauxNews",
        "time": "2 days ago",
        "context": "Fox was saying the same thing when the insurrectionists were being arrested.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "orionsbelt",
        "time": "2 days ago",
        "context": "What do I think, I think the FBI is no longer and is now the Gestapo of the Democrats.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "EdwardR.RooneyDeanofStudents",
        "time": "2 days ago",
        "context": "When will these people learn to mind their own business?",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "TexasLawDog477",
        "time": "2 days ago",
        "context": "He had a fully loaded Rosary and probably a bottle of Holy water. FBI and Demons are afraid of both. ",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "luispierrend",
        "time": "2 days ago",
        "context": "FBI will apprehend a pro-life person but they won’t do nothing about Antifa or BLM. Someone in the FBI and the government are manipulating these injustice.  Why democrats or republicans don’t condemn to those who are abusing power. ",
        "good": "7",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "elbowsmcfadden",
        "time": "2 days ago",
        "context": "It isn't a \"misdemeanour\" as this so called \"legal expert\" should know.\n\nThe location of the assaults makes them Federal crimes.",
        "good": "3",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "willy23",
        "time": "2 days ago",
        "context": "Definitely a case for the Thought Police. Ever vigilant, protecting the Party.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "snodad114",
        "time": "2 days ago",
        "context": "The left's weaponizing of the FBI. This will not end well if not corrected.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "letemeathope625",
        "time": "2 days ago",
        "context": "Going nowhere, should be the basis for a ruling of unconstitutionality for the FACE act if this guy can get some pro-bono legal help!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "peauxboy",
        "time": "2 days ago",
        "context": "Meanwhile violent criminals are let back out in the streets everyday.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dingus558",
        "time": "2 days ago",
        "context": "More like the department of just-us. Lately it looks like Biden’s brown-shirt brigade (fbi) only goes after parents who fight groomers (teachers) and conservatives. ",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "nosniveling235",
        "time": "2 days ago",
        "context": "Hilarious the Biden staffers are running the FBI and DOJ.  Wonder how the FBI clowns can look in the mirror. Certainly their manhood is shrinking.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "JB008",
        "time": "2 days ago",
        "context": "The DOJ has now blackened both of the FBI’s eyes!",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "willy23",
        "time": "2 days ago",
        "context": "The war is over, China won.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rcinsc",
        "time": "2 days ago",
        "context": "This smells like meadow muffins to me! LOL",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sickofitallinca",
        "time": "2 days ago",
        "context": "Just a question.  Why hasn't the FBI arrested the N. Dakota man who murdered the teen with his car?  Far more of a hate crime than this garbage case.  Hmmmm.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "texasbob41",
        "time": "2 days ago",
        "context": "Yeah, there's something fishy here. It's not that it was a pro-life guy that was arrested, so much. It's that it was the FBI that did it. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Lovingleftypain",
        "time": "2 days ago",
        "context": "It's that leftist 72 year old dude that gets pushed down and sue's all the time.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bidenistyrant",
        "time": "2 days ago",
        "context": "The FBI has become the lefts version of Germany's Storm Troopers.  This country is no longer the same country I grew up in.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Litemyfire",
        "time": "2 days ago",
        "context": "I wonder which conservative/Republican or Christian is next on the list to harass by the regime?",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "yasteril",
        "time": "2 days ago",
        "context": "What's worrying is all the agents that took part in this raid, in all the recent raids that have obviously been political hit jobs. Either there's one team they have doing this or the culture in the FBI on a very basic level is broken.",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "judy76",
        "time": "2 days ago",
        "context": "The DOJ, Merrick Garland, and the FBI have more than earned the contempt and distrust of the American people.   They have become nothing more than hired bullies of the Democrat Party!",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "eljefegrande",
        "time": "2 days ago",
        "context": "Rumor has it, Trump will be receiving a matching pair of silver bracelets for Christmas.",
        "good": "2",
        "bad": "8",
        "replies": []
    },
    {
        "user_name": "FJB!monami",
        "time": "2 days ago",
        "context": "FEAR YOUR GOVERNMENT!",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jrettinger",
        "time": "2 days ago",
        "context": "Stimson should be indicted for personal income tax evasion and deception.",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "Lewis68",
        "time": "2 days ago",
        "context": "FBI and IRS, the second and third arm of the DNC.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Frontlines1",
        "time": "2 days ago",
        "context": "Where’s the raid on Hunter Biden. FBI is now the SS ",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "crumz",
        "time": "2 days ago",
        "context": "Impeach Garland!",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "karozans1980543",
        "time": "2 days ago",
        "context": "I find it odd how these former prosecutors find their moral compass after they stop prosecuting people.  How many tens of thousands of people did he put in prison for decades for druq possession and thousands of other victimless crimes?  Dstryng the lives of hundreds of thousands of people in the process.",
        "good": "0",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "Hawk59064",
        "time": "2 days ago",
        "context": "The “Face Act” is unconstitutional. It’s a clear violation of the 1st Amendment! This again is just the democratic liberals attacking conservatives. We have to put a end to the democrats in November! ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "EdwardR.RooneyDeanofStudents",
        "time": "2 days ago",
        "context": "Harassing people outside a clinic does nothing so why do it?",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "hangtraitorjoe",
        "time": "2 days ago",
        "context": "FBI hasn't worked for the United States or the American  people since Obama was President now they are just are a criminal organization with too much power",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ladydragonspell",
        "time": "2 days ago",
        "context": "why be baffled? everyone knows that the FBI and DOJ has been weaponized. the whole government needs to be purged of their craziness and EVERYONE who is involved needs to be arrested ",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "areyouready?",
        "time": "2 days ago",
        "context": "Where is the FBI on the churches that were burned down or vandalized? On Hunter's laptops? On how Obama, Biden, Schumer, Fauci, Pelosi and Feinstein have made so much money over the years? Where did they not infiltrate BLM, Antifa? Where are the indictments for the destruction they committed? Why isn't an investigation going for the labeling of parents as terrorists? Innocent people are targeted by a political party, and they don't' even ask how that happened? What about all the money doled out to NY during Covid's impact that vanished? 104 pro-life centers are vandalized and not one arrest, yet they come out swinging to intimidate a pro-life person for a possible misdemeanor charge, a local charge, not a federal charge...\nPeople, we all know they are sending a message. with the new armed, 87,000 IRS agents, we all know what this means. The new and improved Gestapo is coming. Any who speak out, dissent or vote wrong, can expect that knock on the door. And the DNC has already handed the US over to the globalists... All it needs is one big event to pledge all over to the one world government... Something like Jesus removing his own... People, understand, it's all falling into place as the Bible has warned. Jesus' return is imminent, and the government of the AntiChrist is about ready to implement. The time to repent, seek forgiveness of sins and leave with Jesus is now. Sin matters to God, and if one isn't forgiven and trusting him... Normal isn't coming back; Jesus is.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Elitistsaretheproblem",
        "time": "2 days ago",
        "context": "The FBI should be dismantled! They are not even close to being bias and clearly are getting their pockets filled by the current administration. Maybe every single FBI agent and leaders homes should be raided. I’m betting there is probably miles of incriminating things that would be found.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jonclegion",
        "time": "2 days ago",
        "context": "And yet the Feds go after the violent pro-choice activists or the BLM leaders who lead riots that torched businesses. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jimmycrackcorn1",
        "time": "2 days ago",
        "context": "No merit, but they will make him defend himself nonetheless.  That process is not cheap to this person, while the DOJ has all the funds in the world.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tc1838",
        "time": "2 days ago",
        "context": "The FBI was using very German SS or Gastopo tactics!",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Edward208",
        "time": "2 days ago",
        "context": "…So does the Raid on Trumps Place…",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "xsnowflakes",
        "time": "2 days ago",
        "context": "The FBI has gotten so political they have lost their credibility. Even if the case is a 'loser\" they have achieved their intended goal. Intimidate and paint conservatives in the shade of criminality. The mainstream media will pick up the story and repeat it and spread it trying to discredit the person involved. IF it ever goes to court and  the DOJ loses, the mainstream will never publish anything about it.",
        "good": "7",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "cybercommand648",
        "time": "2 days ago",
        "context": "what is up with the FBI? \nthey have been weaponized into the democrats private gestapo.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Edward208",
        "time": "2 days ago",
        "context": "…Smells like Joe Biden’s…with a trail of Flies….",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "beautifulman457",
        "time": "2 days ago",
        "context": "Biden's police state will still march forward.  Next step is a physical takeover of the judiciary.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "quizblog",
        "time": "2 days ago",
        "context": "So he assualted a 72 yr old man, and is shocked to learn of consequences for it?",
        "good": "1",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "TheghostofBobDole.",
        "time": "2 days ago",
        "context": "FBI-Federal Bureau of incompetence!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "macdad1",
        "time": "2 days ago",
        "context": "Who nazis Hillary? Gestopo comes to your door cause he doesn’t like your religion",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "joeblow555666",
        "time": "2 days ago",
        "context": "Our legal team at work always said......\"the punishment is the process.....\"....meaning in this case, terrorizing your family at home.....making a spectacle of you to intimidate others and to cost you a lot of $$$$.......Nothing more....",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ChaosSurfer",
        "time": "2 days ago",
        "context": "You can't force your pompous morality onto others. Simple concept.",
        "good": "0",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "fsudog45",
        "time": "2 days ago",
        "context": "The FBI and \"injustice\" department are run like the former Soviet KGB. People and now identified by the liberal democrats as \"enemies of the state\" and the FBI goes after them. We no longer live in a free society, at least if you disagree with biden, garland, pelosci, etc.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "knights-who-say-ni",
        "time": "2 days ago",
        "context": "The FBI goes after a Pro Lifer for protecting his son and meanwhile has done nothing to stop the radical leftist terrorists of Janes Revenge that has committed arson and vandalism of pro life centers.  The FBI goes after parents protecting their kids at school board meetings but won't go after people pushing gender reassignment to kindergarteners against their parents will.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "notimefor",
        "time": "2 days ago",
        "context": "Harassment by the feds...",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "BigPicture416",
        "time": "2 days ago",
        "context": "If the former prosecutor is a Jesus Freak then who cares what he says? Christians are not known to be moral, truthful or unbiased.",
        "good": "0",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "fedvsstate875",
        "time": "2 days ago",
        "context": "The communist KGB is today's FBI attacking those who disagree with the left agenda.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "crush41",
        "time": "2 days ago",
        "context": "Insane Pro-Life activists need a padded cell",
        "good": "0",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "Mark1966",
        "time": "2 days ago",
        "context": "Harrassing a 12 year old warrants a parent defending them. This is a fact. Any 72 year old that harasses a 12 year old deserves what they get. Id love to be on that jury. This is simply further proof that the FBI and other federal law enforcement are the weaponized “tools” of the far left. There are two crimes that have been committed in this case. The harassment of a 12 year old and the over reach and fraudulent arrest of another US citizen by federal agents. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bobrn59092",
        "time": "2 days ago",
        "context": "Another fine case for the Federal Bureau of Intimidation. ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bigislandhawaiian580",
        "time": "2 days ago",
        "context": "It appears the FBI is playing politics again.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "316",
        "time": "2 days ago",
        "context": "Ant-Catholic bigotry.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jigglyjojo",
        "time": "2 days ago",
        "context": "Welcome to Liberal America. We are in deep trouble folks……an evil regime.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dan-in-pa",
        "time": "2 days ago",
        "context": "So, just who is it that's the REAL \"threat to our democracy?\"",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "krx",
        "time": "2 days ago",
        "context": "Disband the FBI.  Burn it down.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "txbart",
        "time": "2 days ago",
        "context": "There is more to come. The FBI and DOJ are misrepresenting again. I can't wait for all the facts to come out at trial. This is using the power and weight of our politicized and weaponized government to bankrupt the man because the lefties don't like his position on abortion. If it were a civil legal action its called a slap action. We desperately need to clean these agencies out, from top to bottom.",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "buckshoe",
        "time": "2 days ago",
        "context": "The FBI has lost all credibility. It's pathetic a great organization is now in the toilet. Agents who are involved in these political raids should resign in protest if they had any moral or ethical bone in their body.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "alibangbang",
        "time": "2 days ago",
        "context": "In actuality, few women need an abortion, only those who got pregnant and are denying their responsibilities.  The majority of women in the country are good, kind-hearted and responsible.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "redwoodkingfish",
        "time": "2 days ago",
        "context": "One more red hat goes to jail. Good times",
        "good": "0",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "foxinhenhouse167",
        "time": "2 days ago",
        "context": "The FBI and DOJ are biased. It is that simple.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "freightman",
        "time": "2 days ago",
        "context": "this is why nobody trusts the FBI.  Wray and Garland need to go and be fired.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "nomad1965",
        "time": "2 days ago",
        "context": "Just a little taste of Neo-Nazi intimidation.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "demsareholdingmeprisoner",
        "time": "2 days ago",
        "context": "Oh no. It wasn't 25 agents. We only used 20 agents with their guns drawn for a suspect who had already been cleared by local law enforcement. It wasn't our SWAT team. \nWhew. What a relief.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tat123",
        "time": "2 days ago",
        "context": "Looks like another case where Pelosi and Schiff are involved!  YCMTSU..",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "scout666",
        "time": "2 days ago",
        "context": "Hmm - Putin uses the same tactics.  If you disagree with him you get sent to jail.  If you protest he sends his goons out to arrest you.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "freightman",
        "time": "2 days ago",
        "context": "This is pure corruption on the FBI and DOJ's part",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "vote786",
        "time": "2 days ago",
        "context": "I feel better, there was only 20 not 25 armed FBI agents in bullet proof vests in black clothing, big difference",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ciystal",
        "time": "2 days ago",
        "context": "Wray is an evil man.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "EdwardR.RooneyDeanofStudents",
        "time": "2 days ago",
        "context": "Republicans are on the wrong side of history when it comes to the abortion issue",
        "good": "1",
        "bad": "7",
        "replies": []
    },
    {
        "user_name": "makeyourplay",
        "time": "2 days ago",
        "context": "Just another reason to clean out upper management in DOJ and FBI.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ElmerFudd&GigglesCartoonShow",
        "time": "2 days ago",
        "context": "Who has a war on Democracy? These tactics were common in the 1930's and 1940's Germany!",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "charliedog2",
        "time": "2 days ago",
        "context": "It is time.  \"FBI organized crime\" needs to be dealt with.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "endymio",
        "time": "1 day ago",
        "context": "Meanwhile, the man who shot an 83-year old pro-life activist in the back still hasn't even been charged .... much less been taken down by a 25-man federal assault team.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dtgilbert1",
        "time": "17 hours ago",
        "context": "All Americans should be in an uproar against Biden’s DOJ and FBI leadership who are invading, arresting and prosecuting citizens with no prior criminal histories while violent drug offenders, child molesters,  and murderers are going free. Their goal is clear to the most inane observers serves political purposes. ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bertco",
        "time": "4 hours ago",
        "context": "I’m surprised the FBI didn’t burn down their house and kill the family like they did in WACO. The FBI has clearly lost it way when it comes to serve and protect Americans . Hopefully the future FBI will find greener pastures and regain the respect the agency Deserves. Americans needs the real FBI not the political FBI .",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Bingo2016",
        "time": "1 day ago",
        "context": "Twenty-five agents isn't a SWAT Team. It's a couple of them.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "garbo661944",
        "time": "2 days ago",
        "context": "That the FBI used a SWAT team army to arrest a solitary law-abiding American family man with zero record (over a pushing match) shows FBI management has consciousness of guilt.  At the very least those in management, if not rank-and-and-file, know what they deserve.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "donr332",
        "time": "14 hours ago",
        "context": "Anyone still defending the FBI?  They want you to shoot back so their actions don't stink so much. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tammies375",
        "time": "1 day ago",
        "context": "EPA ignored Trump’s personnel order so federal workers wouldn’t be ‘upset,' says watchdog\n\nThe prosecutor that's speaking up, he'll be facing Ethic Violation charges soon",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "DimsRDum770",
        "time": "16 hours ago",
        "context": "Who are these Democrat rogues trying to kid? Most Americans realize now that Democrats are the totalitarian terrorists, and if you don't conform, something like this happens. Now, people who own a gun, have a U.S. flag, and voted for Trump are extremists. Who believes this stuff? You can't make this up. They are losing their...you know what.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Bingo2016",
        "time": "1 day ago",
        "context": "Woking class Jack and Jills used to respect and revere the FBI.  Now?  Leftist thugs.  Sad.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dangerismymiddlename",
        "time": "2 days ago",
        "context": "Why is the FBI involved at all in a simple assault case?  Do they have nothing better to do than send more than a dozen armed agents to arrest one pro-lifer on a misdemeanor charge?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "arclite89",
        "time": "2 days ago",
        "context": "The time delay alone shows it is a frame up. I hope this guy sues everybody involved in this atrocity.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "djpage315",
        "time": "2 days ago",
        "context": "Meanwhile, a democrat who ADMITTED to running over and killing a conservative with his car because he had a political argument with him has been released on a relatively low bail.  And, he told the judge he does not understand why he is being charged and complained about the bail.  Do any of you really think that the justice department of the USA is fair?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "hawkman1001",
        "time": "2 days ago",
        "context": "Another anti-abortion zealot playing the victim",
        "good": "1",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "Please4giveMe",
        "time": "2 days ago",
        "context": "I'm proud of our 'top of the line' Law Enforcement for breaking up this gang before they can entice other potential criminals to beat down and attack our poor elderly escorts who are giving their time to help young ladies find their way through the corridors of human slaughter.\nI've read as much as I can find about this gang and am amazed to find there are millions who agree with their basic line of thought. There were many unanswered questions regarding the alleged assault, especially the one about 'did it actually happen'?\nUnfortunately, this isn't the beginning of Brandon misusing his power of office, but, one would think even he isn't so senile as to miss how asinine this Gestapo move was.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "freesouthafrica",
        "time": "2 days ago",
        "context": "INVESTIGATE OBAMA'S FBI",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ElikaS",
        "time": "2 days ago",
        "context": "The FBI needs to be Defunded and the agency shut down ",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "uscombatvet452",
        "time": "2 days ago",
        "context": "The Biden Admin's unlawful assault on straight White Christian males who \"dare\" to do their religious duty is in full bloom now.  You others, don't be smug.  You may be next on their agenda of hate and forced compliance with their extreme leftist ideology.  Have no fear, though, the lie-manipulated clowns will NEVER get through us.  The truth is on our side, and it has a way of coming out on top in the end.  This will be no exception.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "seniorpop",
        "time": "2 days ago",
        "context": "FBI/DOJ trying to intimidate pro life movement.  No jury will find the Dad guilty.\nSo, shove a baby killer and the GESTAPO shows up.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "esparti24",
        "time": "2 days ago",
        "context": "this is an absolute embarrassment.. they need to ask which Democratic pro abortion George Soros backed filtered the money to pay off this nonsense ..  ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Lion4Lambs",
        "time": "2 days ago",
        "context": "Sounds like Former FBI special agent Stuart Kaplan is trying to explain his prior agency’s practices but sorry it doesn’t fly. Local and state police don’t draw their firearms  for serving most warrants nor do they bring 15 other officers; it’s usually 2 to 4. If the FBI is training agents to bring that much backup and draw firearms on non violent and non drug related warrants they are out of step with how most other agencies train. The FBI is reported as diverting agents off of human trafficking cases claiming increase domestic terrorism related work, but they obviously don’t need to hire anyone if they can take 15 agents to serve a warrant like this one.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "RonaldReagan192",
        "time": "2 days ago",
        "context": "Shootings everyday in Philly and we send SWAT to get someone that is pro-life.  Man we are upside down.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bonespur322",
        "time": "2 days ago",
        "context": "They should add a hate crime enhancement to the charges. \nAnd does anyone remember when Rudy Giuliani had the Black guy who tapped him on the back, charged with at least one felony for assault for basically nothing?",
        "good": "0",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "pawpawof6315",
        "time": "2 days ago",
        "context": "Welcome to Bidens American go after anyone that disagrees with his administration the fbi is politically corrupt ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "uscombatvet452",
        "time": "2 days ago",
        "context": "From the article:  \"Stimson noted that the FBI is 'a really important institution to have in our country' and that 'most FBI agents, do their job, do their job really well.' \"  \n\nWell, then, it is too bad that corrupt, partisan appointed leadership has tainted such a previously fine organization.  If the Special Agents are so \"good,\" where are the whistleblowers who should be speaking up about being used this way by the leftist Dems?  Are they gutless or brainless, to be sent willingly to make such a bogus arrest with no chance of it resulting in a conviction; just basically political harassment?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cavemaneek",
        "time": "2 days ago",
        "context": "biden and the doj and his fbi minions are driving a wedge between libs and cons and it will not end well",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "uscombatvet452",
        "time": "2 days ago",
        "context": "He's right.  This is a garbage case thrown out by the courts months ago, as was the civil suit the clown who harassed the kid tried to file.  The fact that Biden's DO\"J\" would gobble it up and send 15 to 20 armed federal agents to arrest this man is Garland and his partisan FBI screaming \"I want to make a political point\" loudly.  Why else would the feds do this?  The \"victim\" apparently should not even be considered having been assaulted as a violation of the FACE Act.  Mark Houck cannot be blamed for protecting his 12-year old child.  Must one be DERANGED to be a Dem official?  It would appear so.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "generallee1",
        "time": "2 days ago",
        "context": "Is it possible that the FBI has assumed a new identity...?\nThey appear to have aligned themselves on the wrong side of justice....Could it be that they are the hands and feet of Joe Biden...?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "robinson",
        "time": "2 days ago",
        "context": "if the Republicans take Congress I hope they start to impeach in the DOJ.\nI doubt they will, though.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jrrjrr063",
        "time": "2 days ago",
        "context": "Joe uses the FBI and DOJ to enforce his politics.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "theansweris42984",
        "time": "2 days ago",
        "context": "Prolife weirdo can’t keep his hands to himself, gets arrested, and thin blue liner republicans don’t understand laws apply to everyone, not just people with different skin color.",
        "good": "1",
        "bad": "7",
        "replies": []
    },
    {
        "user_name": "Bracer",
        "time": "2 days ago",
        "context": "DOJ used this guy as an example.  The guy's lawyer had the target letter and was willing to surrender him, but instead they decided it was in the best interest of everyone if we send a dozen agents over to his house and make a news splash.  What a waste on a case that will never be prosecuted.  If this had a been a pro-abortion incident, there would have been no case.  Another example DOJ doing what the WH says.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "RonaldReagan192",
        "time": "2 days ago",
        "context": "FBI ever actually solve a real crime??? ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Spodrick",
        "time": "2 days ago",
        "context": "So this father supposedly shoved a 72 year old man for harassing the father's 12 year old son. Well, the father did wrong. What he should have done, was knock every one of his teeth down his 72 year old throat. Well done, Father; you are to be commended!",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "superbigsexy2",
        "time": "2 days ago",
        "context": "Don’t do the crime if you can’t do the time",
        "good": "1",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "RoadRunner57",
        "time": "2 days ago",
        "context": "Wow, a domestic terrorist, looks like someone on the FBI Most Wanted List. All those family pictures, I bet there are a lot more pictures too. Go into the city and see how many families like this you can find with family pictures.\nThe FBI should be ashamed of their actions and their directions. I ask for more whistleblowers to come forward and tell their stories!",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sgtk",
        "time": "2 days ago",
        "context": "The FBI and DOJ have lost all credibility.  What's next.  Death penalty for littering?",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "guru360",
        "time": "2 days ago",
        "context": "Is the FBI sure they had enough manpower?",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "timfmiller",
        "time": "2 days ago",
        "context": "I no longer trust the FBI--- they are the law enforcement arm of the DNC!",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jaxjag",
        "time": "2 days ago",
        "context": "3 years ago a judge in the same district dismissed/threw out a case with the same circumstances. Lawyers will argue same point. Don't see it going anywhere.",
        "good": "4",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "theiranotthenra955",
        "time": "2 days ago",
        "context": "Having hand to hand combat with a 72 year old in the name of Jesus. \nYep true Christian right there.",
        "good": "0",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "garbo661944",
        "time": "2 days ago",
        "context": "Leges sine moribus vanae.  FACE is part of the final solution.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "geniusdetector107",
        "time": "2 days ago",
        "context": "If you think those agents are your fellow citizens, think again. Yet another reason why the blue stripe on the American flag is desecration.",
        "good": "1",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "usn82-88",
        "time": "2 days ago",
        "context": "Yep - this is just another example of how this Administration is pushing it's agenda through fear and intimidation...",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "docbill",
        "time": "2 days ago",
        "context": "The two federal entities that should be shuttered in a government shutdown are the DOJ and the FBI.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "jerrybales",
        "time": "2 days ago",
        "context": "Garland has now sent his storm troopers out to arrest a family man and father who was protecting his son. I wonder if they sent team with the AR 15's and machine guns, or just the ones in tactical gear and sidearms? Please note, that as of today, they still haven't visited Hunter Biden.",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mthomas731",
        "time": "2 days ago",
        "context": "Just wait until the IRS starts putting every day conservatives in shackles for \"tax evasion.\"",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "texas_bluebonnet",
        "time": "2 days ago",
        "context": "The FBI is out of control. I don't know what the solution, but something needs to be done about this immediately.",
        "good": "10",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "pcinus",
        "time": "2 days ago",
        "context": "Tax dollars at work. Where is the FBI when stored are being robbed by gangs?",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "hope7677",
        "time": "2 days ago",
        "context": "Yeah, this man looks real dangerous. They had cintsct information for his lawyer. This is unbelievable what is happening in our country! The democrats and the fascists have to be stopped. ",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Tennisbum825",
        "time": "2 days ago",
        "context": "Wow!!  One wonders how this rises to the level of a federal issue. Politics, perhaps???",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "smackass",
        "time": "2 days ago",
        "context": "They did it to President Trump, they did it Roger Stone, this guy, and they will do it any perceived MAGA republican they want to. This DOJ is out of control.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Oceanswimmer",
        "time": "2 days ago",
        "context": "How do we wrest control away from Emperor Biden.\nvote in GOP governors\nvote in GOP DAs\nvote in GOP congressmen\nvote in GOP senators\nvote in GOP secretary of states\n\nbecome a poll watcher",
        "good": "4",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "mikeham",
        "time": "2 days ago",
        "context": "Maybe this pro-life 'tough guy' should pick on people his own size and age.",
        "good": "1",
        "bad": "7",
        "replies": []
    },
    {
        "user_name": "mthomas731",
        "time": "2 days ago",
        "context": "It's quite obvious that the DOJ and FBI are political arms of the Democrat party.",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "checkyoself107",
        "time": "2 days ago",
        "context": "The fbi is trying scare tactics. They are intimidating with\" overwhelming force\" which is a joke. They are taking all these \"conservative criminals down\". You don't hear about liberals being arrested this way. It's not scary. The fbi has become a laughing stock. This cartoonish attack and swarm on these unarmed, harmless individuals shows their incompetence. The fbi should be tasked with these domestic disputes where deputies are being shot. Does the fbi think the average person is afraid of them? All those guns and they're going to make a mistake, and I hope the individuals involved pay dearly and forever.",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "superbigsexy2",
        "time": "2 days ago",
        "context": "Don’t do the crime if you can’t do the time no no don’t do it",
        "good": "0",
        "bad": "8",
        "replies": []
    },
    {
        "user_name": "ilovefoxnews246",
        "time": "2 days ago",
        "context": "Fox News and conservatives HATE law enforcement, the military, schools, and scientists more every day.  These propaganda stories prove it.  They hate everything that’s good about a civilized society.  Sad.  ",
        "good": "2",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "FTD",
        "time": "2 days ago",
        "context": "Time for the military to step up and protect the rights of citizens as directed by the constitution.  The military swears an oath to protect the constitution and the rights of citizens guaranteed by the constitution.  The FBI, DOJ have violated those constitutional rights  since they now put the support the Democratic party over people.  Time for the military to clean house!",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "garbo661944",
        "time": "2 days ago",
        "context": "Ever since \"Operation Showtime\" (yes, that was the official name) where the FBI rammed a compound triggering a sequence of events that caused it to burn to the ground killing over a hundred in Waco, Texas, it was clear the so-called FBI has thought of its mission as \"shaping public opinion\" and trying to influence political perceptions.  In Waco they wanted to be the big, tough FBI, \"boy you better look out for us\"!  \n\nWhen they declined to communicate through his attorney and have Roger Stone show up voluntarily, they instead preferred to create another big street theater and tipped off CNN so cameras would be rolling when they showed up at dawn with a SWAT team.  In that case, they wanted to say, \"Roger Stone is a bad, bad, bad man.  He lied!  He is associated with the President.  Look at us!  We are the experts, and we are sending the signal Roger Stone is a terrorist!\"\n\nSame with Mar a Lago.  The FBI is rotted through to the core.  It is itself a crime organization which supports the Democrat Crime Syndicate.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "alejandropena",
        "time": "2 days ago",
        "context": "Why would the US Attorney General's office pick this case up after it had been kicked out by a state district court for being frivolous, in a civil suit.  \nIf an assault actually occurred, how come the state police never arrested him? How come there were never any charges for assault filed?\nWhat \"evidence\" did they actually review before approving the indictment?",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "newengland1",
        "time": "2 days ago",
        "context": "\"And this is the verdict, that the light came into the world, but people preferred darkness to light, because their works were evil.\"  John 3:19    \n1shonuf1494 is correct, they will bleed you dry of resources, and destroy your present and future.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sothankful97",
        "time": "2 days ago",
        "context": "This is terribly egregious and outrageous, I can't believe they would do this over an incident between 2 adults where the injured result in a scratch to his arm, what the? And their argument in the article that they didn't have 25 agents but may have had 15-20 agents...really, does it matter the point is too many dispensed for a man with no criminal history. The FBI did this to humiliate and intimidate. Something must be done about the politicization of our US justice dept...where are the Republicans? Not crickets, again!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "NuclearWarhead",
        "time": "2 days ago",
        "context": "We had 15 when we took down Al Qaeda with guns and bombs.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "twolf1136",
        "time": "2 days ago",
        "context": "I have NO APOLOGIES  For my DISDAIN  for the Elite FBI........ Or any and ALL lower ranking officers in the FBI following these kind of orders..............  They ALLLLLLLLL  NEEEEEEEED  TO  BE  UPROOTED  AND  REPLACED!!!!!    ALLLLLLLL  OF  EM'!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "alexander111",
        "time": "2 days ago",
        "context": "I feel sorry for his children the most. It had to be terrifying to see a couple dozen armed men come to arrest their father. They were probably in tears I am sure, and very scared about what is going to happen to their father. If I were on the jury, and I was convinced that the plaintiff was harassing the 12 year old son, I would find the dad not guilty. Any good father is supposed to protect their child! I think that it’s important for street preachers to have camera recording equipment in case someone tries to bring an accusation against you. Also, since the people they are preaching to people that don’t believe in God why wouldn’t they bear false witness, and leave out parts of their testimony that would make them look like the aggressor? I wonder if the Catholic Church will help the father with his legal bills, and lost wages?",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "socrates470426",
        "time": "2 days ago",
        "context": "Will cost him $100s of thousands to fight\nThey are ruining people by litigation or getting them to plead guilty to a crime to stop the financial bleeding/ruin and mental stress.\nThere are several cases (Flynn and Hollywood safety deposit case for example) where FBI lies and forces innocent citizens to spend a fortune to get their property back or freedom back.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "momma249248",
        "time": "2 days ago",
        "context": "I think it is disgusting that the FBI are using our tax dollars in this manner.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "NuclearWarhead",
        "time": "2 days ago",
        "context": "FASCIST BUREAU INTIMIDATION 100%",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Oceanswimmer",
        "time": "2 days ago",
        "context": "This is clearly an intimidation tactic, just like the raid on Trump's home, and many other acts. The FBI is now Biden's own personal Gestapo.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "GunsAGoGo056",
        "time": "2 days ago",
        "context": "Das Gestapo in der Biden Reich.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sirfrank",
        "time": "2 days ago",
        "context": "these american communist are out of control and using the arm of the government is a crime that needs to punished. nov will not get here quick enough",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bazinski",
        "time": "2 days ago",
        "context": "At the direction/level the FBI cracking on, It seems reasonable in the future to expect a response when one gets reported for having two expended flashlight batteries the trash versus not turned into a collection depot. Perhaps, the \"Defund the Police\" movement has left a void that has to be filled by the Feds.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "manbearpig60",
        "time": "2 days ago",
        "context": "Houck is a straight, white, Christian married man with kids. To the left? That's a criminal act in and of itself. To Brandon, being those things make you an \"extremist, MAGA terrorist that is a direct threat to democracy itself.\"  15 Gestapo agents rolling up armed to take one religious man with NO CRIMINAL HISTORY into custody was done for no other reason than to gain the media's attention. Just like CNN being on site to capture Roger Stone's arrest. It was to get the message out there that just being pro life might get you the same treatment. This happening one month before the midterms, and after Roe V Wade was overturned, when they could've arrested him almost a year ago tells you all you need to know. Since when does the FBI send 15 armed agents to arrest a man with no criminal history for misdemeanors that another judge tossed out?  When you want to send a message....that's when.  Wray and Garland don't care if the case is thrown out. They only care that the, \"message\" is delivered loud and clear.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "transparentcross",
        "time": "2 days ago",
        "context": "it took almost a year to do this.\nImagine how long it takes them to present the case of Hunter and his pop? ",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "pikebishop",
        "time": "2 days ago",
        "context": "\"A senior FBI source previously told Fox News there may have been 15 to 20 agents at the scene, but denied 25 were there.\" A \"senior FBI source\" has to guess how many agents were dispatched but at least it wasn't 25.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bostonmrk",
        "time": "2 days ago",
        "context": "\"\"People that are so passionate and so crazy over this… who knows what they may do to resort to escalating already a terrible situation. \"\nYou mean like sending in over 15 armed agents with guns drawn to arrest person with no criminal history over an old guy who fell and scraped his arm? It sure looks and sounds like a federal SWAT team to me. Kinda surprised they didn't call in the media to film the arrest.",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mthomas731",
        "time": "2 days ago",
        "context": "15, 20 or 25... Does it really make a difference? 15 is also excessive in this case.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "hochigilot",
        "time": "2 days ago",
        "context": "The SS Gestapo is at it again. However, this time Jews will not be persecuted, but Christians will up to the expend of the law..",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "practicalmagic2019",
        "time": "2 days ago",
        "context": "You push a 72 years old man to the ground causing injury, and it's not assault?",
        "good": "1",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "calamagrostis88",
        "time": "2 days ago",
        "context": "When a woman gets pregnant in an anti-abortion state, her body becomes the property of the government.  States are already making plans to lock women up to force them to give birth, and to send women and their doctors to jail.   Republicans are losing the votes of millions of women.",
        "good": "0",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "quan272",
        "time": "2 days ago",
        "context": "That should tell the public if the FBI has been indeed weaponized.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mike95831",
        "time": "2 days ago",
        "context": "Shame on the FBI and the agents who continue working for this evil organization.  They have been politicized and are all the same.  One sided enforcement against those who speak up against the current regime and disagree with their propaganda.  They cannot be respected or trusted and are despicable to the core.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "o57",
        "time": "2 days ago",
        "context": "gettin realllll political out there",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "wldflr878",
        "time": "2 days ago",
        "context": "This situation for an arrest STINKS....and there is something radically wrong if the FBI is going to such extremes for one Christian human.....IMO",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "fatdaddy635",
        "time": "2 days ago",
        "context": "I have ZERO respect for the FBI. I don't agree that there are good agents either. \n No more than I think there are goid Hells Angeles. \n both know what they are doing and who they are working for when they put on the colors or pick up the badge.\n You don't join a gang because you are a good guy. and you don't join the FBI because you believe in protecting the innocent. \n both men are evil and should be feared.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "MrPibb",
        "time": "2 days ago",
        "context": "“ no way it was 25 guys!  More like 15 to 20 guys.  This is standard fbi procedure to go after an old white guy a year after he gets into a slap fight with another old white guy!”  They were too busy to go to the nearby Wawa where a large contingent of African American youth were ransacking the convenience store. Please",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ocbob",
        "time": "2 days ago",
        "context": "Welcome to Biden's America. Vote red to save our country.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mdlace",
        "time": "2 days ago",
        "context": "The FBI investigated a shoving match between two people that was investigated by the police and determined to be a minor “mutual assault” in which no charges were warranted.  After indicting one of the individuals (not both) they bring 15 armed agents to his home to arrest him in front of his wife and children.  Shame on you FBI.  ",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Villa",
        "time": "2 days ago",
        "context": "The FBI is a disgrace.  There has not been a noteworthy arrest or operation in recent memory.  Their focus has been  minor law enforcement violations which are highly publicized.  \n\nCharlatans.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "netman",
        "time": "2 days ago",
        "context": "no we didnt have 25 agents to arrest 1 man but we did bring 15 or 20 just in case he gave us a hard time!",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Biden_is_a_MORON938",
        "time": "2 days ago",
        "context": "The FBI is nothing more than the Germany Gestapo.\nThis is what old monkey ears Obama wanted federal police",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "alejandropena",
        "time": "2 days ago",
        "context": "It is pointless to blame the FBI.  They don't make these decisions.  It was pointed out extremely clearly that this was picked up by the US Attorney General's office, after it was kicked from a US District court as frivolous.  And that was a civil suit, not even criminal.\nSo you want a boogeyman, look at the US Attorney General who not only picked this case off the dead pile, for obviously political reasons, approved the indictment, and then instructed the FBI to give this guy the old Roger Stone.   \nThe FBI was only following orders.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "kbj940",
        "time": "2 days ago",
        "context": "they are coming for us",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "urdelusional",
        "time": "2 days ago",
        "context": "Pro-life is the criminal group in the abortion issue.\nThey are also wrong-headed and oppressors.",
        "good": "0",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "NMW1960",
        "time": "2 days ago",
        "context": "The weaponization of our “justice” system has gone beyond the pale. ",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "reaganbestpresidentever",
        "time": "2 days ago",
        "context": "Biden’s USSR!",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jmejrs",
        "time": "2 days ago",
        "context": "NOT the direction the FBI should be going to regain the trust of the people!  Now I begin to wonder:  Do they care to have our trust?  If not, the FBI needs to be abolished.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "anex",
        "time": "2 days ago",
        "context": "Pattern of heavy-handed unequal application of the law. Politicized DOJ and FBI. Simply indisputable.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "planetpluto859",
        "time": "2 days ago",
        "context": "The leadership will be gone once the Republicans take the WH in2024. Of course, they will do their best to hang on by teaming up again with Big teach.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "BillyJackwasaliberal",
        "time": "2 days ago",
        "context": "Republicans have lost all credibility on this issue.  FBI knows who is a dangerous threat to America. Pro life extremists have killed doctors in the past...Republicans just say they care about law and order and law enforcement but their words and actions say different. Congressman Graham suggests political violence is a option. Congresswoman Greene and others call to defund the FBI. Republicans say they will take to the streets if we hold Trump accountable. How does any of that support law enforcement?! Let's not forget 1\\6 Republicans beat Capitol police , called for a vice president to be hang! As Trump supporters tried to overthrow the United States of America! Republicans still say it was a regular tour of the Capitol! Trump said he is giving financial aid to the criminals that attacked the Capitol! ENOUGH!",
        "good": "1",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "NuclearWarhead",
        "time": "2 days ago",
        "context": "Should not lose Trust in by far the most heavily armed populace.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "onlyrational",
        "time": "2 days ago",
        "context": "I'm completely Pro Choice. With that said, this stinks to high heaven. Where is the FBI when it comes to solving cases of murder and assault against Pro Life folks??",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "...ontheFly",
        "time": "2 days ago",
        "context": "Once the government is used as an instrument to infiltrate and terrorize your life… akin to Brown Shirt Doom. The Silver Bullet Scheme takes on many forms. Report suspicious behavior on anyone and watch the government agents turn a black head into a boil.  The more it stinks the more agents will get involved to hide incompetence and failure with more failure. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Never_Forget_Jan6",
        "time": "2 days ago",
        "context": "Violent religious zealots in this country murdered doctors who provided abortion to women to prove to their God they saved lives, this violent domestic terrorist is no different if left unchecked. \n\nNo sympathy for this terrorist, DOJ should prosecute and sent him to jail.",
        "good": "0",
        "bad": "7",
        "replies": []
    },
    {
        "user_name": "garyt602",
        "time": "2 days ago",
        "context": "Biden has weaponized the DOJ against American Patriots. Watch out Joe, our army is much bigger than yours.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "yaj334",
        "time": "2 days ago",
        "context": "Biden’s Geheime Staatspolizei (German: “Secret State Police”), the political police",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ricnok#fjb",
        "time": "2 days ago",
        "context": "The FBI has been subverted by the Democrites, so much so that they should be referred to as the FBI (D) just like every politician  in the party.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "MissAmerica",
        "time": "2 days ago",
        "context": "We must stand strong against the evil that our government has embraced. We are truly living in scary times, much like Germany did.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rt1959",
        "time": "2 days ago",
        "context": "A pro-life canvasser is shot, nothing happens.  A pro-life advocate pushes awat a person harassing a child, and the FBI moves in, with guns drawn, to arrest a man who had already agreed to come to them.  FBI=Gestapo",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jaxjag",
        "time": "2 days ago",
        "context": "Sure they are enjoying their mandatory dress code; brown shirt,caps , boots and guns.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jbnsd",
        "time": "2 days ago",
        "context": "One has to wonder why any self respecting FBI agent us proud of what his agency has devolved into. Absolutely disgraceful. ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "silencedogood1001409",
        "time": "2 days ago",
        "context": "So after almost 1 year of investigation they arrest him for 2 misdemeanors.  So when does the FBI get involved in a misdemeanor?  This is like Lorretta James investigating Trump for 5 years and coming out with a civil suit.  Biden by weaponizing the FBI is destroying any credibility the FBI has left.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "padre99",
        "time": "2 days ago",
        "context": "Merick Garland a true disciple of Satan.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Command_Shift_Right",
        "time": "2 days ago",
        "context": "Elections are coming and the persecution clock is ticking.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "1776rcs",
        "time": "2 days ago",
        "context": "I hope he sues them for millions for false arrest.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "endliberaldems",
        "time": "2 days ago",
        "context": "I’m moving to Russia ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "NuclearWarhead",
        "time": "2 days ago",
        "context": "As DOJ cracks down on whistleblowers reporting internal wrong doings...!!!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Dansthoughts1",
        "time": "2 days ago",
        "context": "A clear case of excessive force. All they needed to do was issue an arrest warrant and ask him to turn himself in. A real waste of resources. All this was is intimation. There should be a new movement to defund the FBI",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sammy_i_am",
        "time": "2 days ago",
        "context": "They won't help anyone who is being murdered, raped, beaten, assaulted with deadly force, car jacked or robbed in the city/county of Philadelphia, but this guy is worth their attention?",
        "good": "12",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tom_pritchard",
        "time": "2 days ago",
        "context": "Republicans have lost all rational thought. \nThey are mindless sheep now. So sad what the party has become!",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "BillyJackwasaliberal",
        "time": "2 days ago",
        "context": "Our fine American  FBI knows who is a dangerous threat to America. Pro life extremists have killed doctors in the past...Republicans just say they care about law and order and law enforcement but their words and actions say different. Congressman Graham suggests political violence is a option. Congresswoman Greene and others call to defund the FBI. Republicans say they will take to the streets if we hold Trump accountable. How does any of that support law enforcement?! Let's not forget 1\\6 Republicans beat Capitol police , called for a vice president to be hang! As Trump supporters tried to overthrow the United States of America! Republicans still say it was a regular tour of the Capitol! Trump said he is giving financial aid to the criminals that attacked the Capitol! ENOUGH!",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "1776rcs",
        "time": "2 days ago",
        "context": "Once again the FBI makes up bogus charges against a conservative who speaks out against the liberals agenda, and once again nothing will be done to the FBI.  The FBI needs to be completely dismantled!  Because all they are is the liberals kgb hit men.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "shawnl",
        "time": "2 days ago",
        "context": "Gestapo sent to create fear, intimidation in those that oppose the government…at least THE EXECUTIVE BRANCH of the government…",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "NuclearWarhead",
        "time": "2 days ago",
        "context": "Democrats are awesome at destroying trust.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "oregonrepublican553",
        "time": "2 days ago",
        "context": "Sending the FBI a video clip of a 100 youngsters looting a convenience store in Philly.\n\nOh wait, wrong color for the FBI to do anything about. Never mind send 20 agents.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bayerit447",
        "time": "2 days ago",
        "context": "I read about this happening ... it was in the '30s and '40s involving brown-shirted squads of goons.  Just the way the Nazis worked against people who disagreed with their leaders.  Shameful, just shameful.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dbedit",
        "time": "2 days ago",
        "context": "So  his12 year old son is verbally attacked by an adult, and he was pushed down.  Seems he got off light,    A man has a right and a duty to protect his family.  You would have thought a 72 year old would have learned this lesson long ago.  But I guess your never to old for the learning.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "puckhndler",
        "time": "2 days ago",
        "context": "That goofy ol Gestapo strikes again. How many have been arrested in connection with the Pro-Life assistance center bombings?\n0.\nZip.\nNada.\nWhy?\nThey're not members of the Jackbooted Thugs of Washington DC. ",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "littlegreenapple",
        "time": "2 days ago",
        "context": "When are all the cowardly men in this country gonna put a stop to this kind terrorism by these Criminal  Marxist Thugs that think they have right to terrorize innocent children in their own home?  Those kids didn't commit any crimes.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "childrenareourfuture",
        "time": "2 days ago",
        "context": "The FBI is just following the orders given to them by the DNC.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "PīwakawakaFromNZ",
        "time": "2 days ago",
        "context": "\"Pro life\"... sometimes, more isn't more. \nIt's high time to stop behaving like animals and focus on quality of life.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "citizenusaone",
        "time": "2 days ago",
        "context": "Do think that the Freedom of Access Clinic Entrances Act had anything to with it as it is a federal crime.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "graptemy",
        "time": "2 days ago",
        "context": "The FBI is just one of many groups of violent democrats.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "kornfed151",
        "time": "2 days ago",
        "context": "The FBI is corrupt. We all see it",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bribing-Bidens",
        "time": "2 days ago",
        "context": "The Dem FBI is no longer the Federal Bureau Investigation, but the Federal Biden of Investigation, a gestapo for Biden and the socialist Dems regime",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "beardstache",
        "time": "2 days ago",
        "context": "the FBI is \"a really important institution to have in our country\"\n\ndo as you're told. be mindful of your programming.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "L*a101",
        "time": "2 days ago",
        "context": "As a conservative I take this as a warning.  If Biden or another democrat is elected president in 2024 this type of over stepping of authority will become the order of the day, outspoken conservatives will be targets and democrats will be looking to silence them through fear of democrat retaliation.  USA conservative citizens welcome to China.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "NoPineappleJuice",
        "time": "2 days ago",
        "context": "Why so many excuses for a person from the 60%? The guy committed a federal crime. An investigation began and is now moving forward. If this was someone from the 13%, most of you would be trying to solve a puzzle. Stop crying 😭",
        "good": "0",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "Clyde’sGirl",
        "time": "2 days ago",
        "context": "White, rural, religious, married, lots of kids……. The perfect target to be made an example of.  Do not trust the government.",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Kemaris",
        "time": "2 days ago",
        "context": "Clearly the Klain/Garland DOJ and FBI are pushing another political persecution to drive Democrat turnout during election season. \"Look at how hard we're protection abortion access\" and similar nonsense.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Tomsteenerson",
        "time": "2 days ago",
        "context": "Maybe we will get brave republicans this fall who will disband the fbi ",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jw_",
        "time": "2 days ago",
        "context": "FBI proudly announcing that they got Public Enemy #1",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "leftturnedright",
        "time": "2 days ago",
        "context": "DOJ is a joke.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "averagejoebruh",
        "time": "2 days ago",
        "context": "Sue for malicious persecution, get it in front of the Supreme Court and teach the gestapo a lesson....",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "millermight660",
        "time": "2 days ago",
        "context": "Well it’s good to know now that it is “standard practice “ for the FBI to send two platoons of heavily armed agents who are practiced on special weapons and have trained in tactics to deal with people who could possibly have as much as a kitchen knife at their disposal.  So just to be clear:  FBI agents trained with Special Weapons in Tactics descend on an typical American family  in military platoon like tactics is standard procedure for a minor scuffle between a retiree and a 12 yr old.  \nWell, as typical Americans at least we know who the FBI is now and what to expect from them.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "starzout",
        "time": "2 days ago",
        "context": "Bring down the FBI or this is going to get a lot worse.  They are a little too proud of themselves.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "maximus53",
        "time": "2 days ago",
        "context": "What needs to happen is fire the director of the FBI and why wasn't this a local issue. It worries me what the FBI is turning into.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "a-thomas-paine-guy",
        "time": "2 days ago",
        "context": "The far left Democrats have successfully turned the FBI against their political opponents. This is the only reason why they have not enacted a defund a \"Defund the FBI\" movement.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Svsp",
        "time": "2 days ago",
        "context": "Just another case where the FBI is abusing their power and then trying to deny or cover up just like a good Democrat 😆🤷‍♂️ just 📞like i 👀",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "littlegreenapple",
        "time": "2 days ago",
        "context": "We're putting you on notice, you pro-life Catholics:\n\n“I want to tell you Gorsuch. I want to tell you Kavanaugh. You have released the whirlwind and you will pay the price. You won’t know what hit you if you go forward with these awful decisions.”  \n\nSincerely, \nChuck ''the godless'' Jewmur.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dannyb662",
        "time": "2 days ago",
        "context": "You see this kind of behavior from Gestapo police third world countries, and Biden has weaponized the DOJ/FBI against the American people. Cases in point; parent who oppose woke agenda of NEA teaching children CRT and LGBQ against parents' wishes being targeted for investigation as domestic terrorist, raiding a former president's home on a bogus documents charge then planting evidence, going after a pastor who protested against abortion then arresting him on charges that had already been dismissed in court. America is under attack by Fascists of the left Democrats.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "coralreefer",
        "time": "2 days ago",
        "context": "..The   Campaign  Poster for  2024!... this   family    portrait, and   the  caption...\" If  they  can do it  to Trump  , they  can do it  to you!..........DeSantis 2024!............",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "hadenuf794",
        "time": "2 days ago",
        "context": "I don't think the FBI cares about its reputation anymore. This is naked political partisanship.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "littlegreenapple",
        "time": "2 days ago",
        "context": "Anti-Catholic Bigotry, plain and simple.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "72boogaloo",
        "time": "2 days ago",
        "context": "If you go against the party line they will find a way to come after you. Even if they know they wont get a convictions... harass the non-conformists",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jwip",
        "time": "2 days ago",
        "context": "FBI!!!!   Very sad!!!!   God save America!!!!   🙏🙏🙏🙏🙏🙏🙏",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "redhatretard",
        "time": "2 days ago",
        "context": "Nobody plays victim better than MAGA",
        "good": "1",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "lostincalif",
        "time": "2 days ago",
        "context": "The Brown shirts, er, I mean FBI, need to be investigated and prosecuted once the Republicans take control of Congress. Wray and Garland need to be impeached.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "truepatriot#1",
        "time": "2 days ago",
        "context": "That Catholic needs to be locked up for the good of America",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "nativeunionco",
        "time": "2 days ago",
        "context": "This has nothing to do with what he might have done.  It is an opportunity for the progressives to ruin an individual's life.  Think how much this man will have to spend to defend himself. Remember the amount that it cost Gen. Flynn to defend himself.  They don't care about convicting anyone.  They want revenge on any Republican.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "machoman",
        "time": "2 days ago",
        "context": "As my good friend Bang Dang OW use to say “Sum Ting Wong”",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Encrypto",
        "time": "2 days ago",
        "context": "“A senior FBI source previously told Fox News there may have been 15 to 20 agents at the scene, but denied 25 were there.”  So the Biden gustapo showed tremendous restraint I guess against a peaceful father of seven who pushed a guy that was verbally assaulting his 12 year old daughter? Oh and guns were drawn but holstered once he was in custody. So that makes everything even more copacetic? ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ricardoh180",
        "time": "2 days ago",
        "context": "Have you ever watched Narcos Mexico?  Tell me our government is doing it all it can to stop deadly drugs from coming out of Mexico and into our country.  The hundred thousand lives it cost is the price of trade relations. Drugs could be stopped but politicians don't want it stopped.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "stopstopitnow",
        "time": "2 days ago",
        "context": "DOJ is out of control.   It’s time. ",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "demsrdirty",
        "time": "2 days ago",
        "context": "We are about one year away from a full-blown banana republic government.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "noneyourbusiness143",
        "time": "2 days ago",
        "context": "Biden’s Gestapo…",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tuckerthetucker",
        "time": "2 days ago",
        "context": "boo the catholic church booooooooooooooooo",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "demsareholdingmeprisoner",
        "time": "2 days ago",
        "context": "If the dems are successful at breaking up all American families, who are they going to groom in 20 years? Won't the public schools be empty by then? All of today's little girls will want to be married to their job. It seems to be a self defeating system.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "stopstopitnow",
        "time": "2 days ago",
        "context": "Wasting my tax dollars on frivolous prosecution. ",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bytheway...244",
        "time": "2 days ago",
        "context": "Wray and Garland are \"all in\" with the Big guy's criminal regime as they attempt to influence their upcoming November disaster by any means possible. Mr. 10% will focus his corrupted DoJ and FBi to intimidate, harass and arrest Republicans while leaking slander to the MSM for coverage.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "grazer",
        "time": "2 days ago",
        "context": "It's about making it hard for people.  There are kids in that household, and if they are scarred, the Democrats are happy.  If they go hungry, the Democrats are happy.  Democrats are evil people.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "trump2020and2024",
        "time": "2 days ago",
        "context": "Who pays the Piper? The FBI, because the American people now despise them like the nazis they are. Guess what will be dismantled?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "702dano",
        "time": "2 days ago",
        "context": "They know they have nothing\nIt's called a vendetta against him, plain and simple.\nThat's how they work, hope he sues them for millions",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "michaelholt727",
        "time": "2 days ago",
        "context": "So this was a simple assault case between two adults and the FBI needed to get 15 to 20 agents involved? \n\nThey came to his door with guns out because he had access to \"a firearm\"? Those boys will need a tank if they ever come by my house.",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "gonefishin\"",
        "time": "2 days ago",
        "context": "Facts and law have nothing whatsoever to do with this. It is pure politics and is a MSM fed agenda just before the elections. Vote like the country depends on it in November.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Sawthatcoming",
        "time": "2 days ago",
        "context": "Political prosecution in this case is religious persecution.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "th0mas",
        "time": "2 days ago",
        "context": "Hope this guy establishes a Go Fund Me Page.  I would contribute. This just stinks to high heaven and the FBI guys are just following orders.  Their bosses are the ones to be fired.   He no more blocked anyone from going into the clinic than the man in the moon.  What feckless man would chastize a 12 year old instead of just confronting the child’s parent?   The man didn’t have the spine to confront his parent.   He was just protecting his son by backing him off.   This just stinks!",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "scottys57",
        "time": "2 days ago",
        "context": "Biden’s America! 👎",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "DudesEast",
        "time": "2 days ago",
        "context": "The DOJ & FBI are now the Biden Gestapo Squad.  Vote Republican people so we can clean this up.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "RoyBatty357",
        "time": "2 days ago",
        "context": "Legality means nothing to the Democrat FBI. Even if they lose the case, their goal is to bankrupt the man's family by forcing him to defend himself against fake charges. That's success for the Dem Gestapo.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "PatrioticChub",
        "time": "2 days ago",
        "context": "Is this propaganda, intending to discredit FBI/DOJ, subtle support of Trump?",
        "good": "2",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "jimmy@beach",
        "time": "2 days ago",
        "context": "That is very scary!\nIt is what happens in communist and/or fascist countries where the federals are arresting any political opponents who dare to not walk the party line.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "gacreekrat",
        "time": "2 days ago",
        "context": "The FBI Modus Operandi.   The Feds don't mess with folks who shoot back.  Not Eliot Ness' FBI.  They Gang Up on old men and their elderly wives while sleeping in their night clothes.  Scariest thing they get involved in is going thru Melania's underwear.  Sad state of affairs.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "deek1960",
        "time": "2 days ago",
        "context": "Some 72 year old gets in my 12 year old's face? I'd be willing to go to jail for that.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "br549-386-8463",
        "time": "2 days ago",
        "context": "Pure Marxist violent intimidation tactic.  Every agent that consented to participate should be fired if not not arrested.",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Ritem",
        "time": "2 days ago",
        "context": "THIS IS YOUR DEMOCRATIC PARTY AMERICA NOW.    NOT the pro abortion vandalism. ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "arch_stanton",
        "time": "2 days ago",
        "context": "The FBI and DOJ are crying to have their wings clipped.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "drgnl8d",
        "time": "2 days ago",
        "context": "These are Gestapo tactics.  Just not secret police, but our own, once beloved FBI!",
        "good": "13",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "notforsure",
        "time": "2 days ago",
        "context": "At least the situation did not end up like Waco or Ruby Ridge.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ohgeez349",
        "time": "2 days ago",
        "context": "Remember when that “prolife” protestor took over a section of seattle and renamed it, “chop?” Then the FBI raided their homes and made arrests….\nNo. Oh…that was based around the BLM movement and I looked but did not see any FBI arrests after those protestors took over a section of the city!!!",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rwven193",
        "time": "2 days ago",
        "context": "The process is the punishment.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bidensinflamedcolon",
        "time": "2 days ago",
        "context": "People from other countries that have fled because of government tyranny are warning us that is how their governments behaved. We better start listening to them.",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "citow",
        "time": "2 days ago",
        "context": "It kind of reminds one of Germany back in the days before WWII.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Flipandflop",
        "time": "2 days ago",
        "context": "I never thought I would say this…DEFUND THE FBI/DOJ!",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "ahopfer",
        "time": "2 days ago",
        "context": "While the FBI and DOJ act as White Supremacists they claim White Supremacists are terrorists.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "AmericaisBack915",
        "time": "2 days ago",
        "context": "You poor souls DO know this man is being charged with attempting to block someone from gaining access to an abortion clinic AND that attempting to block ANYONE from gaining access to ANY clinic is a FEDERAL crime, right?\n\nYou DO know it's the DOJ's JOB to enforce federal law, right?\n\nI'm JUST checking.\n\nFeel better soon.",
        "good": "0",
        "bad": "9",
        "replies": []
    },
    {
        "user_name": "abcd123532",
        "time": "2 days ago",
        "context": "This is all part of Biden's team just trying to use any tactic to keep Roe vs. Wade on the forefront of voter's minds. Hoping the abortion topic will be enough to keep their seats. This poor guy was just a useful pawn.",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mxdrink",
        "time": "2 days ago",
        "context": "It is truly time to replace Wray and his management team with a non poltical patriot that follws the constitution and the rule of law...",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jamesokc",
        "time": "2 days ago",
        "context": "\"FBI has denied the agents were part of a SWAT team\" or how about the one \" may have been 15 to 20 agents\"  that makes it all better.   Wonder how many other law breaking people got the afternoon off because the department was too busy spending their time at his front door and   they were too busy to deal with them.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "#BidenBodyCount",
        "time": "2 days ago",
        "context": "Guy gets raided over 2 misdemeanor counts of assault??!!\n\nYeah, If I'm the judge I say \"Plead guilty and go home with time served during the raid, and don't push people anymore.\"",
        "good": "4",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "DefundthePoliticians194",
        "time": "2 days ago",
        "context": "But if he had agreed with the ideology of the Department of Injustice, the FBIden wouldn’t have even gotten involved.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "endymio",
        "time": "2 days ago",
        "context": "The FBI sent more armed agents to arrest this guy than were sent to take down bin Laden.   And they didn't touch this until both a local prosecutor refused to take action, and a judge threw out the civil suit for lack of evidence.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "spartacus311",
        "time": "2 days ago",
        "context": "I’ll bet it was on camera with assault rifles in full view.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cbaseball",
        "time": "2 days ago",
        "context": "I have been disappointed in our government for a long time and also disappointed at the Republican's during President Trump's 4 years in office. Hopefully the Republicans that have rap sheets on them by the FBI will resign or lose in November so that we can get some real Republicans in office and destroy the deep state. Arrest the rest of the Dems to please.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "GloriaStitts",
        "time": "2 days ago",
        "context": "So the Heritage cult is now in favor of violent assaults on 72-year-olds, as long as the attacker is \"pro-life\"? Thanks for clearing that up!",
        "good": "1",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "bunchie1",
        "time": "2 days ago",
        "context": "Everything the left touches turns to #%$&. FBI, military, schools, media, Hollywood",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "draco304",
        "time": "2 days ago",
        "context": "i'm calling 'shenanigans'!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Egoybugoy",
        "time": "2 days ago",
        "context": "Our own version of the KGB, the FBI.",
        "good": "12",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "billcroft",
        "time": "2 days ago",
        "context": "I think that FBI involvement pretty well identifies a mess.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "PatrioticChub",
        "time": "2 days ago",
        "context": "Another opinion piece masquerading as news.  The \"loser\" prosecutor admits that his opinion is merely speculation but Fox decides to promote this story to reinforce the narrative that conservatives are under attack.\n\nHow about we wait to see what kind of case the FBI has against this man.  We won't hear about it again, because there is clearly something more going on.",
        "good": "1",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "hopefulinca573",
        "time": "2 days ago",
        "context": "The agency followed standard practices to carry out the arrest of republicans.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "teerocka",
        "time": "2 days ago",
        "context": "The FBI were hoping he was combatant so they could go all ATF on people again.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "scoopdapoop",
        "time": "2 days ago",
        "context": "fbi going to learn a lesson.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "repubsrgroomers",
        "time": "2 days ago",
        "context": "The majority of domestic terrorists in our country are either Trump or DeSantis supporters. This is just a fact. We need to eradicate any terrorists that are associated with these groups.",
        "good": "0",
        "bad": "7",
        "replies": []
    },
    {
        "user_name": "rogertheindependent",
        "time": "2 days ago",
        "context": "The DOJ and the FBI .................     \n ...... the new deplorables.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dvankeuren",
        "time": "2 days ago",
        "context": "FBI is clearly overstepping their bounds, they need to be reined in.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "ahopfer",
        "time": "2 days ago",
        "context": "The common elements here is 2 organizations. The Department of Selective Justice and the Federal Bureau of Selective Investigation. Previously known as the DOJ and FBI.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ahopfer",
        "time": "2 days ago",
        "context": "The DOJ and FBI only enforce the Law when against Conservatives. It is painfully obvious.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Dazedandconfused",
        "time": "2 days ago",
        "context": "His attorneys offer to bring him to the US Attorney’s office and they don’t respond, but they have to send a score of armed agents with guns out to arrest him at his home in front of his family? Political hit job. Absolute intimidation is the name of the game. Might wish to change DOJ to KGB.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "robespierresneck",
        "time": "2 days ago",
        "context": "The FBI is getting a bit out of hand in my opinion. \n\nIn 2021 they \"legally\" committed the largest bank robbery in US history when raiding U.S. Private Vaults and lied to a judge to get a warrant to empty the contents of 800 privately held safety security boxes without even knowing who rented them but simply tied them to the raid on the company and imposed civil forfeiture of over 83 million in cash, millions in jewelry and other assets. They even photographed all the documents in the boxes.\n\nOver 400 people are part of a newly filed civil suit. Civil forfeiture is legal theft of private property and all too often people never get their property back or only a small portion even if they are complete vindicated.\n\nI kind of hope it goes all the way to the SCOTUS, those laws were well intended against criminal activity have been abused far too often. Thomas has already indicated that he hoped the right case would come before the court to end the practice.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ectexas",
        "time": "2 days ago",
        "context": "Just another example of how far the Libs will go to oppress and eliminate anyone who doesn't follow their distorted, anti American way of thinking. ",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "osufan1015056",
        "time": "2 days ago",
        "context": "The Gestapo hard at work.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "TheCakeLady",
        "time": "2 days ago",
        "context": "Id be interested in knowing if any of his neighbors have surveillance cameras that may have caught this injustice on camera… our govermental agencies are out of control and people working for them need some jail time of their own… Merick Garland needs to be first in line with Christopher Wrey 2nd…",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "havemercy",
        "time": "2 days ago",
        "context": "They are trying to scare us, so we will think twice about praying in front of a killing zone.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bidenisadisgrace",
        "time": "2 days ago",
        "context": "The FBI has absolutely zero credibility, my uncle would be rolling in his grave seeing what his beloved FBI has become.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "BigJohnD",
        "time": "2 days ago",
        "context": "And once the neighbors and the media see Feds at your door, people automatically think, \"Wow! S/He must have done something really bad and HAS to be guilty\"\nIt's hard to defend yourself, when the government is making public arrests to make you look guilty of something terrible.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "omeomi",
        "time": "2 days ago",
        "context": "The DOJ and FBI have gotten by with arresting Americans for one solid year - keeping them in jail - sentences of up to ten years....for ONE 3 hr protest that turned into a riot.   ONE PROTEST.  It was not 'insurrection' - there was no 'takeover' - just a demonstration out of hand.  A fake investigation rigged for dems and to protect dems (pelosi)....but Americans have stood by for a year and watched this travesty of an 'investigation'?   The FBI and DOJ think they can do anything they want now - or anything their dem bosses tell them to do.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jlguitarguru",
        "time": "2 days ago",
        "context": "burning down multiple cities causing billons in damages- not worthy of investigation.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Liberalskneeltotheenemy",
        "time": "2 days ago",
        "context": "Removing Comey and Strozk was obviously not enough.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "JDog39",
        "time": "2 days ago",
        "context": "Pro-Life.\nYes, appears to be an arrestable offensive with the Biden Regime. \nThey will tolerate nothing but Pro-Death",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jusconserv",
        "time": "2 days ago",
        "context": "political hit jobs right before the election and their last fiction Jan 6th hearing ",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "omeomi",
        "time": "2 days ago",
        "context": "A 72 yr old man verbally assaults a 12 year old child and the father pushes the man away.  The man has a 'scrape' on his arm....police do nothing, prosecutors say 'no case' - and a year later this child's father is arrested using 2 dozen cops and charged????   Do you want to say 'police state'?   If not, we need to stop tolerating this sort of behavior by THE FEDERAL AGENCIES.",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "gomerpyle534",
        "time": "2 days ago",
        "context": "FTHEFBI, Trump will dismantle the place starting with ray  the liar and swamp creature.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "agtoau",
        "time": "2 days ago",
        "context": "Still trying to figure out how this has federal jurisdiction",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jmiker1",
        "time": "2 days ago",
        "context": "See, you just don't understand.  The FBI was once the country's premiere law enforcement agency.  But under Biden, it has a new roll; to enforce administration policy.  That's why there have been no arrests or prosecutions of Antifa rioters.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "va_rebel1863",
        "time": "2 days ago",
        "context": "Biden/Garland's FBI new uniforms will be Brown.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "taxslave033",
        "time": "2 days ago",
        "context": "Time to FACE the consequences of your actions.",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "screwthelibs001908",
        "time": "2 days ago",
        "context": "The FBI are liberal goons they represent the left and should be treated like the left,  Any time and anywhere they show up someone should be recording them.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "muleboy",
        "time": "2 days ago",
        "context": "Meanwhile MS - 13 moved in next door. the kid down the street Od'd on Fentanyl and the guy down the street with a convenience store has been robbed repeatedly on a daily basis. DOJ, FBI are total failures.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "theodg",
        "time": "2 days ago",
        "context": "Ah yup, this is most definitively the weaponization of the FBI and the DOJ.\nThis is so corrupt!",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "NATAMCIT278",
        "time": "2 days ago",
        "context": "This is what happens when you don’t\n\nShut up and obey",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sthompson82",
        "time": "2 days ago",
        "context": "There are actually people in the DOJ and FBI who think that shoving someone justifies the response of sending 20 armed agents to raid the person's home.  Well, I guess it does if you're trying to send the message the decent will not be tolerated.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "karma-prevails",
        "time": "2 days ago",
        "context": "#WokeCultFBI",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "frosty24",
        "time": "2 days ago",
        "context": "Something is wrong, the killer Shannon Brandt gets released on minimum bail over a murder of young conservative Cayler Ellingson, and they send the FBI to Mark Houcks house with backup for simple assault.\nFBI is just Bidens hit squad now for left wing nut cases.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "2950",
        "time": "2 days ago",
        "context": "It's about time for the FBI to be disbanded.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "kb466",
        "time": "2 days ago",
        "context": "I used to work with and had the highest respect for the FBI and it’s agents. But no more— the FBI and the Department of Justice have been politically weaponized by the Democratic Party. Both should be defunded and abolished.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "pattlee",
        "time": "2 days ago",
        "context": "Democrat tyrant government want Americans know that how they will use FBI tactic force like in China to attack anyone against the evil of abortions and Democrat agendas.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "tobinator1",
        "time": "2 days ago",
        "context": "when the people fear the gov't, it's tyranny, when the gov't fears the people, it's liberty- think we are at the tyranny stage",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "BigJohnD",
        "time": "2 days ago",
        "context": "Another instance where the Feds overstepped.  Is this going to become the norm for Republicans/Conservatives/Christians?  Is our own government at war with us for standing up for what we believe in? It sure seems it.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "trumpmobster",
        "time": "2 days ago",
        "context": "This country is over, just over",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "saltqueen99",
        "time": "2 days ago",
        "context": "They think they are untouchable because of Mar-A-Lago.  They think they got off scot-free.  We have to wait and see what happens after the midterms.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tcm65",
        "time": "2 days ago",
        "context": "The more the FBI and DOJ do these things, the less credible they become and become hated as much as BLM, which I'm sure is already happening.  Also, they might be painting a target on their back.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "clinocio",
        "time": "2 days ago",
        "context": "No threat yet a SWAT team shows up to make him look like a drug dealer to his neighbors. \nA clear case of excessive use of force and defamation for which criminal charges should apply.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "hope&pray494",
        "time": "2 days ago",
        "context": "FBI Needs reforming vetting liberal woke bias Democrats ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "clownyfish",
        "time": "2 days ago",
        "context": "Biden's Law Enforcement really hates it when people actually bear children against their wishes in 2022 America.... \nMy, how the world is a changin'...",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Kelt_Witch",
        "time": "2 days ago",
        "context": "This was an asinine move by the FBI.  Houck stepped between the old man and his 12-yo son.  The old man was harassing the boy and yelling at him while approaching.  So, Houck stepped between the two - and the old man fell.  Big deal.\n\nIf the old man wasn't harassing the boy - he wouldn't have fallen.  Seems like Houck should counter-sue for the harassment of the young boy.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "another_nc_guy156",
        "time": "2 days ago",
        "context": "Philly police and prosecutors didn't find a basis to charge the guy.  A court dismissed a civil suit against the guy.  After doing nothing related to multiple actual attacks (you know, with evidence) on pro-life organizations, the DOJ/FBI distract attention by doing a publicity stunt to charge this guy.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "roman45",
        "time": "2 days ago",
        "context": "They brought automatic machine guns to Trump’s home to get nothing, that’s why there’s no charges",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "RBK",
        "time": "2 days ago",
        "context": "Let’s state the obvious,…, the FBI is OUT OF CONTROL!!!!!!!!! The DOJ is OUT OF CONTROL!!!!!! Seriously, the FBI is just asking for the Patriots of this country to take up arms! If they are going to continue with these Gestapo tactics, they are in for HUGE fight. They will be taken down!!!!",
        "good": "1",
        "bad": "0",
        "replies": []
    }
]