[
    {
        "user_name": "j.w288",
        "time": "11 September, 2022",
        "context": "Aleem's opinion on many subjects doesn't reflect mainstream ideas. ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "TheJeffersonians",
        "time": "11 September, 2022",
        "context": "Free Speech is only allowed if your a liberal democrat. Anyone else has to follow the suppression of think like us. Sickening that MSDNC defended but hey that’s who they are aligned with. Anyone interested should read on Mass Formation.  It’s not a theory. ",
        "good": "15",
        "bad": "2",
        "replies": [
            {
                "user_name": "NotEstablishment232",
                "time": "11 September, 2022",
                "context": "She certainly has the right to say that. And we have the right to brand her as human trash for saying it,",
                "good": "10",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "craz",
                        "time": "12 September, 2022",
                        "context": "We can even be glad she revealed herself so students and others can be on the lookout.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "you'reallselfishidiots",
                "time": "12 September, 2022",
                "context": "You don't understand the concept of free speech. Just because Twitter kicked your orange fuhrer off, doesn't mean his 1st amendment rights were violated. Yours have not been either. Stop whining. No one cares.",
                "good": "0",
                "bad": "3",
                "replies": [
                    {
                        "user_name": "craz",
                        "time": "12 September, 2022",
                        "context": "So, you believe only you understand.  And you also can decide for everyone whether or not they care. Interesting attitude.",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "cestmoi024",
                        "time": "14 September, 2022",
                        "context": "It's amazing that the sight of a Democrat brings up thoughts of garbage.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "windolin536",
        "time": "11 September, 2022",
        "context": "The comment was not \"free speech \". It was hate speech. Kudos to the University.",
        "good": "21",
        "bad": "0",
        "replies": [
            {
                "user_name": "EMeshaw",
                "time": "12 September, 2022",
                "context": "We can't control what people say, but we can denounce the spirit of hate and her total disrespect for Queen Elizabeth and Great Britain. Her behavior is despicable.",
                "good": "14",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "iamright477",
                        "time": "12 September, 2022",
                        "context": "But y'all people brought them here..",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "modernmillie517",
                "time": "12 September, 2022",
                "context": "If your hate is \"politically correct,\" it's perfectly fine,",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "you'reallselfishidiots",
                "time": "12 September, 2022",
                "context": "Too bad royals aren't a protected group of people. Guess they just haven't suffered to much at the hand of anybody.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "craz",
                        "time": "12 September, 2022",
                        "context": "Seems that would also be true these days of a number of college professor types who seem to believe they are fit to tell other people how to think.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "bdub63",
        "time": "12 September, 2022",
        "context": "Uja, the attention you are seeking for yourself may be conducive to your own notoriety, but it is corrosive to the black community.",
        "good": "9",
        "bad": "1",
        "replies": [
            {
                "user_name": "you'reallselfishidiots",
                "time": "12 September, 2022",
                "context": "How? She's right. You just want to deny the reality of what england is. A tiny island that ruled the world with an iron fist without regards to the natives. Kinda like America.\nOooooohhhh. I get it now. You're actually defending American imperialism and slavery aren't you? Yes you are.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "phantom",
        "time": "12 September, 2022",
        "context": "CNN OR MSNBC always  lying for the Democrats socialist party.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "the_light_in_dark_places",
        "time": "11 September, 2022",
        "context": "Wow!!  So now MSNBC condones and encourages hate speech??   Not surprising for the mouthpieces of the hypocritical liberal, progressive agenda.  Hate speech is wrong and must be stifled, except when it is our hate speech, then it must be defended!! ",
        "good": "12",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jburns",
        "time": "11 September, 2022",
        "context": "To Uju Anya..may you reap what you sow.  Hatred and excruciating pain.  ",
        "good": "12",
        "bad": "1",
        "replies": [
            {
                "user_name": "FangFang092",
                "time": "12 September, 2022",
                "context": "IMO Barbados should pay reparations to the UK for giving them a legal and governance system, for stopping the inter tribal violence and for teaching them how to play cricket",
                "good": "7",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "procommonsence",
                        "time": "12 September, 2022",
                        "context": "Was that before or after they made them stop eating each other.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "you'reallselfishidiots",
                        "time": "12 September, 2022",
                        "context": "Lol. Nope. Not a cent. Republicans support imperialism over the lives of ordinary people.",
                        "good": "0",
                        "bad": "1",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "you'reallselfishidiots",
                "time": "12 September, 2022",
                "context": "Ummm.......... You realize you could fall under your own judgement, right?",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "rearadmiraljockrash",
        "time": "12 September, 2022",
        "context": "Sour grapes. This is the 21st century. Get over it and make a positive contribution to America or leave.",
        "good": "10",
        "bad": "1",
        "replies": [
            {
                "user_name": "you'reallselfishidiots",
                "time": "12 September, 2022",
                "context": "Eagerly awaiting your positive contribution. I'd bet no one will notice whatever you think it is.",
                "good": "0",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "libertywastelands",
        "time": "11 September, 2022",
        "context": "I am trying to recall the exact number of the many who lost their employment, careers and life ultimately ruined for saying far less than Anya, however the right boxes are checked.",
        "good": "29",
        "bad": "0",
        "replies": [
            {
                "user_name": "iamright477",
                "time": "12 September, 2022",
                "context": "Excatly ",
                "good": "2",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "you'reallselfishidiots",
                        "time": "12 September, 2022",
                        "context": "What did you do to the cat?",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "tapdancingmom",
                "time": "12 September, 2022",
                "context": "I can remember not too long ago that some teachers and/or professors were either fired or put on leave and probation for saying \"All Lives Matter\".  And that wasn't even hate speech.  This woman spews vile hateful speech and now we are excusing it as First Amendment Freedom of Speech.  Where was that freedom before?  Interesting to say the least wouldn't you say?",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "republicansareguilty",
        "time": "11 September, 2022",
        "context": "Zeeshan never went to CMU. She has no idea what she's talking about. Some \"H and Guess-Guess\" professor said something hateful.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "pip380509",
        "time": "12 September, 2022",
        "context": "\"A university would never be presumed to endorse any of its scholars' individual beliefs\" - Riiight....unless it's a conservatives individual belief.",
        "good": "6",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "sigmandkh",
        "time": "12 September, 2022",
        "context": "My TRIBE was attacked and men, women and children were killed by another rival TRIBE in Africa 350 years ago so I demand reparations from the government that has evolved from those events.\nWhen can I expect my check to arrive?",
        "good": "5",
        "bad": "1",
        "replies": [
            {
                "user_name": "you'reallselfishidiots",
                "time": "12 September, 2022",
                "context": "Sue the other tribe then. What's wrong? The tribe in question has nothing to sue for? Hmmmm.... Guess they didn't take over enough of the world and kill enough people to do it. It's almost like that was a poor analogy.",
                "good": "0",
                "bad": "2",
                "replies": []
            },
            {
                "user_name": "will6lb",
                "time": "12 September, 2022",
                "context": "And what if a government didn't evolve and the two tribes just kept killing each other for the last 350 years?    Who would be issuing the check then?",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "zugdog",
        "time": "13 September, 2022",
        "context": "Maybe BurnLootMurder will accidentally pay her and unscheduled visit.  \nA little ruthless mayhem may change her perspective… 👹🤬",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "blueflower",
        "time": "12 September, 2022",
        "context": "Google is blocking all of my conservative emails and calling them spam. Look under your spam tab.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mirsh327",
        "time": "12 September, 2022",
        "context": "I don't care how it sounds, but I wish the most terrible death to every Leftist. I have zero sympathy to fascists. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "republicansaretraitors148",
        "time": "12 September, 2022",
        "context": "Never before in American history has a president been impeached twice.",
        "good": "0",
        "bad": "9",
        "replies": [
            {
                "user_name": "aionesco",
                "time": "13 September, 2022",
                "context": "That says more about the fascists who are running this country than the President they harassed....and imagine had Zelensky not been such a greenhorn and investigated Biden after that phone call! He'd currently be negotiating the return of territory captured during Biden's last term in office.",
                "good": "1",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "incatnito727",
                "time": "13 September, 2022",
                "context": "Never before in American history has a president been targeted by the opposition party so often for so little cause with so little evidence. They've cheapened what should have been a serious undertaking and there you are, little fascist in training, cheering on all their moves to unseat a duly-elected President. Do you even know what they have planned for you if the Democrats take control of the Senate and retain the House? It won't be pretty.",
                "good": "1",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "republicansaretraitors148",
                        "time": "13 September, 2022",
                        "context": "The Democrats are in control of the Senate. Republicans are all so poorly informed.",
                        "good": "0",
                        "bad": "2",
                        "replies": [
                            {
                                "user_name": "rickthemick",
                                "time": "13 September, 2022",
                                "context": "50-50 bud. And don't believe those Yahoo polls. It'll just get your hopes up. ",
                                "good": "2",
                                "bad": "0",
                                "replies": []
                            },
                            {
                                "user_name": "incatnito727",
                                "time": "13 September, 2022",
                                "context": "They need 52 to end the Senate filibuster, silencing the minority, and then pushing through their Liberal Democrat agenda without any checks. They'll pack the Supreme Court with activist Liberal Justices, they'll Federalize elections taking power away from the states and that will be just the start. Wait until they mandate smart thermostats in every home so energy companies can do what Colorado did: lock the temperature in your home where THEY want it. Can you afford an electric vehicle? No? Tough. They'll follow California and outlaw gas-powered cars and you'll be stuck with public transportation. Meanwhile, the political elite and the wealthy will continue their privileged lifestyles while you watch from the sidelines.\n\nPoorly informed? It's not me, Skippy.",
                                "good": "0",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "republicansaretraitors148",
                                        "time": "13 September, 2022",
                                        "context": "Reported for misinformation.",
                                        "good": "0",
                                        "bad": "1",
                                        "replies": [
                                            {
                                                "user_name": "rickthemick",
                                                "time": "14 September, 2022",
                                                "context": "Oh he's triggered now. Watch out, he reported someone for get this, \"misinformation\". Hahaha.",
                                                "good": "0",
                                                "bad": "0",
                                                "replies": []
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "rickthemick",
                "time": "13 September, 2022",
                "context": "Wait till 2023. History will repeat. You are desperate and November is going to be rough for you. ",
                "good": "1",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "rickthemick",
                "time": "13 September, 2022",
                "context": "Guess you forgot what the article was about. ",
                "good": "2",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "republicansaretraitors148",
                        "time": "13 September, 2022",
                        "context": "There is no rule here requiring me to be on topic. You should apologize to me.",
                        "good": "0",
                        "bad": "3",
                        "replies": [
                            {
                                "user_name": "rickthemick",
                                "time": "14 September, 2022",
                                "context": "Guess you didn't notice you're off topic. You should apologize to society.",
                                "good": "0",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "republicansaretraitors148",
                                        "time": "14 September, 2022",
                                        "context": "Society doesn't care if I am off topic. Republicans don't even have enough family values to apologize for anything. They didn't even apologize for 1/6.",
                                        "good": "0",
                                        "bad": "1",
                                        "replies": [
                                            {
                                                "user_name": "rickthemick",
                                                "time": "14 September, 2022",
                                                "context": "Sure it does. You're trying to spread more lies. Society perfers some measure of intelligence that you obviously don't possess. The rioters who have burned so many cities have not apologized. Care to do it for them?",
                                                "good": "0",
                                                "bad": "0",
                                                "replies": [
                                                    {
                                                        "user_name": "republicansaretraitors148",
                                                        "time": "14 September, 2022",
                                                        "context": "No cities have been burned. Reported for misinformation.",
                                                        "good": "0",
                                                        "bad": "0",
                                                        "replies": []
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "bsmith7189",
                "time": "14 September, 2022",
                "context": "You conveniently forgot Clinton's two articles of impeachment.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "republicansaretraitors148",
                        "time": "14 September, 2022",
                        "context": "Link?",
                        "good": "0",
                        "bad": "1",
                        "replies": [
                            {
                                "user_name": "bsmith7189",
                                "time": "14 September, 2022",
                                "context": "Nice try skippy.  You initially responded with he was acquitted.  Which you deleted that post.  You and I both know why.",
                                "good": "0",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "republicansaretraitors148",
                                        "time": "15 September, 2022",
                                        "context": "That's not a link. Care to try again or are you willing to admit you are a liar?",
                                        "good": "0",
                                        "bad": "1",
                                        "replies": [
                                            {
                                                "user_name": "bsmith7189",
                                                "time": "19 September, 2022",
                                                "context": "#justthefacts",
                                                "good": "0",
                                                "bad": "0",
                                                "replies": []
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "taxedenoughalready378",
                "time": "14 September, 2022",
                "context": "Uju?  is that you trying to change the subject to other reasons to hate Marxist democrats?",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "republicansaretraitors148",
                        "time": "15 September, 2022",
                        "context": "The Republican hatred for Marxists is one of the defining characteristics of fascism.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "xminus1",
                "time": "14 September, 2022",
                "context": "The Bolsheviks had many show trials under Stalin.  The left craves to emulate him.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "republicansaretraitors148",
                        "time": "15 September, 2022",
                        "context": "Lying about your fellow countrymen is a betrayal of your country. You should be ashamed of yourself but you just aren't patriotic enough to be ashamed.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "rickthemick",
        "time": "13 September, 2022",
        "context": "And people actually believe MessNBC offers news that's fair and unbiased. ",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "midahu",
        "time": "12 September, 2022",
        "context": "Is it just me or does everyone's skin crawl when the left starts talking about free speech?!!",
        "good": "17",
        "bad": "0",
        "replies": [
            {
                "user_name": "alwaysrightoo411",
                "time": "14 September, 2022",
                "context": "Free speech for progressives and closely censored if you are not.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "JamesD'Monquay",
        "time": "12 September, 2022",
        "context": "The right to free speech comes with a corresponding obligation to use good judgment (not yelling \"fire\" in a crowded theater, being courteous, being tolerant, showing respect, etc.). Anya can say what she wants, but this comment reflects poorly on her character and fitness to teach.",
        "good": "15",
        "bad": "0",
        "replies": [
            {
                "user_name": "craz",
                "time": "12 September, 2022",
                "context": "And for a linguistics Assistant Professor at Carnegie-Mellon her choice of words seems pretty guttural. Like a raging 12 yr. old, in fact.  We also must assume if she hates the British leader for her country's supporting colonization in the past,  she must positively despise Pres. Biden for his leading a country that once sanctioned slavery.  And with the harm she claims was don to her country why is she not back there helping to right past misdeeds?",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "ddr2029",
                "time": "13 September, 2022",
                "context": "More than that, it reflects on the University, giving them every right to condemn her.  ",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "draftagain320",
                "time": "14 September, 2022",
                "context": "You are too kind",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "aionesco",
        "time": "13 September, 2022",
        "context": "The fact that such a tasteless, vulgar hater is a professor here just reflects so poorly on Carnegie Melon. ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "diverchic",
        "time": "13 September, 2022",
        "context": "To Uju Anya slavery still exists in Africa and the Middle East.  Slavery in Africa existed long before 1619.  How about you look at your own history first.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "liberalism=dementia",
        "time": "12 September, 2022",
        "context": "although, if the professor had tweeted the same thing about Trump or MAGA people...  the statement would have been completely supportive AND endorsed by same MSNBC correspondent.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "aionesco",
        "time": "13 September, 2022",
        "context": "Most of us don't know anything about Carnegie Melon so this introduction just automatically nixes it for consideration for our children' educations or any demands they might need for taxpayer support.",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "calirefugee",
                "time": "13 September, 2022",
                "context": "Carnegie-Mellon's endowment may take a hit as many rich alumni may well stop donating.  Same with many other universities who are bastions of woke radicalism.",
                "good": "4",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "taxedenoughalready378",
                        "time": "14 September, 2022",
                        "context": "exactly...my alma matter is off my donation list for this exact reason",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "scoopdapoop",
        "time": "13 September, 2022",
        "context": "Because it's satanic.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "JazzyP1992",
        "time": "13 September, 2022",
        "context": "Maybe Aleem should first check his cognitive biases before commenting?  Where was he when critics of COVID-based policies questioned the efficacy of said policies and were censored and de-platformed. Was Aleem commenting on the threats made against members of the Supreme Court? When speech is subject to the whims of those in power and positions of influence - it is not free speech.",
        "good": "7",
        "bad": "0",
        "replies": [
            {
                "user_name": "jrfool323488",
                "time": "14 September, 2022",
                "context": "Aleem is so one-sided that he does not even know that there is another side.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "mppmcoop",
        "time": "12 September, 2022",
        "context": "BECAUE Zeeshan Aleem, ITS NOT CM'S OPINION!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Tigercat1987",
        "time": "12 September, 2022",
        "context": "To the liberal, worthless, democrats, free speech only applies to what they advocate or agree with. Actually, now that I think about it - I hate all democrats.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "lauraed73",
        "time": "12 September, 2022",
        "context": "There is nothing sacred any more.   People like this professor have no sense of dignity or respect.   The queen does not symbolize white supremacy.  She was an amazing woman who was dignified and ethical for her entire reign.  Which was imposed on her by the man who negligently walked away from this duty because of a woman.  I cannot imagine being joyful about having this enormous responsibility suddenly placed on your shoulders.  At last she is free and able to rest.  I also think maybe it is a blessing as she does not have to continue to watch the disintegration of our society.",
        "good": "3",
        "bad": "0",
        "replies": [
            {
                "user_name": "HeavilySeasoned",
                "time": "14 September, 2022",
                "context": "To be clear, it was the brother, Edward, of King George VI that abdicated.  Queen Elizabeth was King George's daughter.  King George ruled from Dec 1936 to Feb 1952.",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "lauraed73",
                "time": "15 September, 2022",
                "context": "Yes.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "cherrygarcia",
        "time": "12 September, 2022",
        "context": "hmmm well then in the spirit of free speech I guess she won't mind if I wish her exactly what she wished for the Queen.  ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "TheTruthAndNothingButTheTruth",
        "time": "12 September, 2022",
        "context": "Hate speech should always be condemned.  Even Liberals know this.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "trulydepressed",
        "time": "13 September, 2022",
        "context": "Give the Falklands to Argentina?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ImUltraMAGA",
        "time": "12 September, 2022",
        "context": "She's being a good Democrat, but she said the silent part out loud.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "exmark",
        "time": "12 September, 2022",
        "context": "\"... the very premise of a university is to serve as a bastion of independent thinking and provide a forum for intellectual free-for-alls.\"\nThe statement posted on Twitter about the Queen was not independent thinking or an intellectual masterpiece.  It was disgusting and degrading.  End of story.\nThe professor will see no punitive action.  The message being sent to the CMU students is that such statements are acceptable.  The message is to make your statements outrageous and controversial in order to get your name in the news.  The professor has shown herself to leverage the great colleges of the US, all for her own benefit.  She has no credibility to condemns others for their actions.",
        "good": "17",
        "bad": "0",
        "replies": [
            {
                "user_name": "virgilene7071",
                "time": "12 September, 2022",
                "context": "And when I tried to condemn the comment and the professor, I was blocked. 🤔",
                "good": "2",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "exmark",
                        "time": "12 September, 2022",
                        "context": "👎",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "smooth-1",
        "time": "12 September, 2022",
        "context": "It's not about your approval. It's all about freedom of speech, so GET OVER IT.",
        "good": "0",
        "bad": "3",
        "replies": [
            {
                "user_name": "incatnito727",
                "time": "13 September, 2022",
                "context": "I wish you'd yell that at the Left. I'm tired of the double standard.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "smooth-1",
                        "time": "13 September, 2022",
                        "context": "me too, my friend. Me too...",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "OpinionRadio730",
        "time": "13 September, 2022",
        "context": "The fact she wished excruciating pain on a dying old lady tells me all I need to know about the person who publicly made the comment.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Ausfaller",
        "time": "14 September, 2022",
        "context": "\"I may not approve what you say, but I will defend to the death your right to say it.\"  Yeah, channelling words attributed to Voltaire is serious virtue signaling, but I imagine his reaction would be different if they were said about Mandela at his funeral.  MSNBC is such a joke.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "lookyloo",
        "time": "14 September, 2022",
        "context": "Karma is coming for her like a bulldozer.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "draftagain320",
        "time": "14 September, 2022",
        "context": "I wish to meet Uju some day to exercise my right of self expression.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "honesty187",
        "time": "14 September, 2022",
        "context": "If all these white countries conquered and controlled countries of color what does that say about the ability, culture and civilization of these conquered countries...maybe, they should continue to pay for bringing elements of advanced civilization to them",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "subotai1241",
        "time": "14 September, 2022",
        "context": "Wherever the British empire went they, in the main, made things better than they were. \n\n India for example, was turned from a collection of warring principalities in to a unified nation with a now burgeoning world economy.   The British Empire turned a disjointed set of colonies in North America into a group that while they rebelled and became indepenedent, became a world powerhouse. \n\n In Africa, the British Empire brought civilization to a lawless collection of warring tribes barely out of the stone age and turned them into prosperous countries.  That the majority of those nations have collapsed [Kenya, Zimbabwae and South Africa] - or are collapsing as I write this - and are turing to the Communist Chinese for succor is a a sure sign that they were not ready for independence when they demanded it.  \n\nOh yeah, Malaya is another British Empire success story…\n\nAs for Uju Anya, she’s a classless ghool.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "nwmalamo",
        "time": "14 September, 2022",
        "context": "I guess that Anya and others like her should just give up the citizenship of whatever country they live in and go back to Africa, put on animal skins or go naked, and live in mud and straw huts.  They can give up their cell phones and everything that being part of the UK had brought.  Maybe living a few years in the mud and insect infested landscape of hunter/gatherer Africa might change her mind.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rickthemick",
        "time": "14 September, 2022",
        "context": "I have a close friend who's son received a scholarship/fellowship to Carnegie-Mellon. Good guy, athlete in undergraduate school. Has told his mother now that he doesn't see himself coming back for visits much as he hasn't been able to \"enlighten\" them to the bizarro world of liberals. It's sad that an educated man has decided his parents are not worth his time. Not even because they might disagree, but that they don't agree enough. Parents dislike Trump, a lot. But it went south when it goes to a dual system of justice, who is investigated and who is not and why it's wrong to loot and burn cities. Big argument? Law enforcement.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "deanbennett",
        "time": "14 September, 2022",
        "context": "God save the Queen! 🇬🇧",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "robespierresneck",
        "time": "14 September, 2022",
        "context": "Elizabeth II was the monarch overseeing the decolonization of Africa and the Caribbean.\n\nShe took a monumental stance on \"The Troubles\" extending her hand to shake the hand of former IRA leader who helped arrange the assassination of her uncle helping put an end to decades of bloodshed.\n\nWas her rule perfect? No it wasn't, but to put all the woes solely upon her shoulders from over a 100 years of colonization in Africa is absurd. \n\nIt's no different than saying because you had a criminal as an ancestor, you are a criminal or that your race is the only determining factor of your value.",
        "good": "2",
        "bad": "0",
        "replies": [
            {
                "user_name": "yourmama",
                "time": "14 September, 2022",
                "context": "I believe it was the \"IRA\" who helped assasinate Lord Montbatten, not the \"NRA\".",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "robespierresneck",
                        "time": "14 September, 2022",
                        "context": "You're right, never claimed I could multitask. At least I used the correct version of 'your/you're'",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "taxedenoughalready378",
                "time": "14 September, 2022",
                "context": "remember facts don't matter to lunatics that push Marxism to our youth",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "GreenHelmet",
        "time": "14 September, 2022",
        "context": "If it weren't for social media and MSM, these fringe lunatics would almost never be heard.  \"off\" is often a good thing.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Antiantifa841",
        "time": "13 September, 2022",
        "context": "I ask anyone applying for a job who had a CMU degree for a transcript. If they have taken this despicable creeps course, their app goes nowhere.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cestmoi024",
        "time": "14 September, 2022",
        "context": "Just another example of failed emancipation.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "demsliecitiesdie",
        "time": "14 September, 2022",
        "context": "When the Queens ancestors where conquering the world Uju Anya's ancestors where running around naked with bones through their noses .",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "princessroxana",
        "time": "14 September, 2022",
        "context": "Vicious hate speech should be condemned. Which is nor at all the same thing as censored.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "HeavilySeasoned",
        "time": "14 September, 2022",
        "context": "Flush.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "taxedenoughalready378",
        "time": "14 September, 2022",
        "context": "DEFUND the University: alumni have to stop giving money to alma matter if they have lunatics like Uju providing liberal social marxism indoctrination...find a different charity to repurpose your giving",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "spokester",
        "time": "14 September, 2022",
        "context": "Sorry CM, this is one of your employees and employees whether on the job or in private represent the university. Others have been dumped for much less than what she (is she a she?) said.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Patsfan43",
        "time": "14 September, 2022",
        "context": "Referring to themselves as \"intellectuals\" ....too funny. Anti American racists Uju Anya and Zesham Aleen lecturing Americans on their view of world history. Only in the USA.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "nondealingdesktrader",
        "time": "14 September, 2022",
        "context": "And blacks wonder why an increasing number of whites, Hispanics, and Asians have little or no respect for them.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "MadeInAmerica72",
        "time": "14 September, 2022",
        "context": "This guy is wrong. They just hate free speech from the Right of course. I've worked at a very large, prominent public university for over 20 years. It is entirely common for the school to put out statements that say \"doesn't share our values\" while allowing free speech from all kinds of professors. Usually done when the language used is just despicable, like this was, and not someone posting merely an informed opinion.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "kenishawashington",
        "time": "13 September, 2022",
        "context": "Anyone with a name like professor \"Uju Anya\" would clearly be full of hate and jealousies.  I hope she/it gets fired.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Gen3",
        "time": "14 September, 2022",
        "context": "For every UJU wishing a painful death there are a million people wishing the same for her and her kind. When the Revolution starts the first targets should be the woke colleges.",
        "good": "0",
        "bad": "0",
        "replies": []
    }
]