[
    {
        "user_name": "EDeploribusUnum",
        "time": "21 September, 2022",
        "context": "Is there time to build a massive catapult to launch Dems, being this close and all? Don’t want to miss the opportunity.",
        "good": "6",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "dan5047628",
        "time": "21 September, 2022",
        "context": "Only 367 Million miles. I'm surprised NASA didn't spend 367 Billion sending some kind of craft there knowing how close it was. I mean its just Tax payers money.",
        "good": "1",
        "bad": "5",
        "replies": [
            {
                "user_name": "kareemoweet",
                "time": "21 September, 2022",
                "context": "NASA has sent spacecraft there. Try and keep up to date,",
                "good": "4",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "donmartin'sbigtoe",
                "time": "21 September, 2022",
                "context": "Almost everything you touch and do today is the direct result of the study of Jupiter.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "mainefreak",
        "time": "21 September, 2022",
        "context": "Stacey abrams has more mass than jupiter",
        "good": "16",
        "bad": "6",
        "replies": [
            {
                "user_name": "Ditchdoc0331",
                "time": "21 September, 2022",
                "context": "Her teeth even practice social distance",
                "good": "3",
                "bad": "2",
                "replies": []
            },
            {
                "user_name": "dan5047628",
                "time": "21 September, 2022",
                "context": "Thank You. Laughs are few and far between these days.",
                "good": "1",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "marq690",
                        "time": "21 September, 2022",
                        "context": "Like her teeth!",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "kareemoweet",
                "time": "21 September, 2022",
                "context": "Jupiter is a gas giant, just like Trump",
                "good": "0",
                "bad": "5",
                "replies": [
                    {
                        "user_name": "hogart_hojewitson3",
                        "time": "21 September, 2022",
                        "context": "Does Jupiter have TDS like you do? ",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "20yeara10guy",
        "time": "21 September, 2022",
        "context": "367 million miles? So an EV would need to stop how many times to charge up on the trip?",
        "good": "10",
        "bad": "4",
        "replies": [
            {
                "user_name": "TheyAreAllLying",
                "time": "21 September, 2022",
                "context": "1,129,230 - assuming 325 miles per charge before recharging.  Assuming 45 minutes/charge, the charging alone would take 348,000 years.",
                "good": "6",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "cakeforbreakfast",
                        "time": "21 September, 2022",
                        "context": "What ev gets that kind of mileage with full charge?",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "TheyAreAllLying",
                                "time": "21 September, 2022",
                                "context": "My Ford F150 Lightning.",
                                "good": "1",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "cakeforbreakfast",
                                        "time": "2 days ago",
                                        "context": "😲 I didn't believe you so I looked it up. Amazing! 👍",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": [
                                            {
                                                "user_name": "TheyAreAllLying",
                                                "time": "2 days ago",
                                                "context": "It is a very interesting vehicle - stupid fast.  I've had it since July, and it is really nice, and fine for my driving needs.  I'd still prefer a gas vehicle for long trips - the charging scene is way too spotty at this point.",
                                                "good": "0",
                                                "bad": "0",
                                                "replies": []
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "user_name": "larsfox",
                        "time": "21 September, 2022",
                        "context": "And you'd need some battery change-outs along the way. 😉",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "conaug",
                        "time": "21 September, 2022",
                        "context": "Yeah...think I'll go out and buy me one",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "kareemoweet",
                "time": "21 September, 2022",
                "context": "At least you could recharge from the sunlight, Good luck carrying around 20 million gal of gas for your ICE car",
                "good": "0",
                "bad": "2",
                "replies": [
                    {
                        "user_name": "quietsmith",
                        "time": "22 September, 2022",
                        "context": "In no way shape or form can an electric car recharge from sunlight without carrying around many times its own weight in solar panels.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "conaug",
                "time": "21 September, 2022",
                "context": "LOL",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "sciencerocks",
        "time": "21 September, 2022",
        "context": "I used to love looking at Jupiter through my telescope, and ponder the image over a beer or three. Now my suburban neighborhood has grown and there is too much light pollution to have any fun with the telescope. I have to drive about 30 miles to find a dark enough spot, but then I have to limit my beers.\n\nBut now it is close enough for just glancing skyward, and maybe using some binoculars.",
        "good": "9",
        "bad": "0",
        "replies": [
            {
                "user_name": "gradivusgraham",
                "time": "21 September, 2022",
                "context": "If you're serious, then you should know that Jupiter is so bright that as long as it's not cloudy you should be able to see Jupiter's features through your telescope at night just fine, even from a location as bright as Times Square!",
                "good": "2",
                "bad": "2",
                "replies": [
                    {
                        "user_name": "sciencerocks",
                        "time": "21 September, 2022",
                        "context": "Oh, I know I can see it. It is just that the quality of the vision is diminished.",
                        "good": "6",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "gradivusgraham",
                                "time": "22 September, 2022",
                                "context": "Diminishment of the quality of the seeing is usually caused by heat currents, which can be caused by the heat generated by cities.",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "user_name": "firstnlast",
                        "time": "22 September, 2022",
                        "context": "sciencerocks is not a serious person.. his/her opinions on everything from covid to the gop to trump are that of a partisan and or ignorant person.. the name \"sciencerocks\" should be your first clue that they are a fraud.. just look at the historical comments..",
                        "good": "0",
                        "bad": "6",
                        "replies": [
                            {
                                "user_name": "gradivusgraham",
                                "time": "22 September, 2022",
                                "context": "I hardly think resorting to ad hominem attacks and personal insults is necessary for discussion of the topic.",
                                "good": "5",
                                "bad": "0",
                                "replies": []
                            },
                            {
                                "user_name": "sciencerocks",
                                "time": "2 days ago",
                                "context": "Interesting perspective you have there. I'm a very serious person when it comes to serious matters. But I've gotten to know a lot of the people who frequent the science section, so get more casual with a post like the one that started this thread, as a conversation among friends.\nI can hardly be \"partisan\" in that I no longer support any American political party. You might not like my honest conservative views, but what was once the GOP I embraced has been dying for decades. It is hard to tell, as the last good GOP president was George HW Bush -- and even that is hard to judge because I was living overseas during his presidency. I voted for his son, but was not impressed most of the time. And Congress declined as well, with Republicans, like Democrats, putting party before country. I really miss the Howard Bakers that used to make Congress shine. And, yes, you might not like that I see Trump as the presidential force that nailed the coffin shut in the GOP, and that the Party of Lincoln no longer exists. But that is my long-term perspective.\nAs for Covid, the only things I've written about that come straight from the scientific literature, and certainly not from politics.\nThank you for your interest in following my \"historical comments\" on this outlet. Perhaps you'd like to read more of my writing by checking out one of my published books, two of which are aimed at a general audience with scientific interests.\nHappy autumnal equinox, today at 9:03 pm ET.",
                                "good": "5",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "gradivusgraham",
                                        "time": "1 day ago",
                                        "context": "The old Republican party, eh? Do you consider yourself a neocon (not that I know exactly what that means these days)? What are the science books you've published?",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": [
                                            {
                                                "user_name": "sciencerocks",
                                                "time": "1 day ago",
                                                "context": "Yeah, good question. But I don't really identify as \"a\" neocon, or \"a\" conservative.  I am just \"a\" scientist and citizen with reasonably conservative views, coming from being \"a\" parent and \"a\" well-traveled and experienced individual.\nTwo of my books are human evolution textbooks, the other two on evolutionary ecology. Soon I hope to find a publisher for my fifth book on the reconciliation of science and faith.",
                                                "good": "0",
                                                "bad": "0",
                                                "replies": [
                                                    {
                                                        "user_name": "gradivusgraham",
                                                        "time": "1 day ago",
                                                        "context": "So what are your books? How can I buy them?",
                                                        "good": "0",
                                                        "bad": "0",
                                                        "replies": []
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "user_name": "kentuckywindage152",
                        "time": "14 hours ago",
                        "context": "It was too bright... couldn't adjust for any detail on the planet without losing the Galilean moons in the darkness, so opted for a 'family photo' instead. Even captured a minor moon between Europa and Ganymede, but have no idea which it is.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "gradivusgraham",
                                "time": "10 hours ago",
                                "context": "You're talking about astrophotography or being able to observe Jupiter's moons. We were talking about observing Jupiter itself.",
                                "good": "0",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "kentuckywindage152",
                                        "time": "9 hours ago",
                                        "context": "You can see Jupiter without the aid of any telescope, but all you get is a twinkle in the night sky. A small telescope with a 6mm - 10mm eyepiece will let you see the Galilean moons, but still none of the planet's details due to the glow from the sun on its surface. For that, you need something a bit bigger. Where the camera comes in is being able to adjust the shutter speed and ISO to dim the image and see the detail. It's not always about capturing the image, sometimes it just about being able to see it more clearly.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "kentuckywindage152",
                "time": "22 hours ago",
                "context": "Come out to western New Mexico. We have dark skies, and a beer cooler next to the Celestron...",
                "good": "1",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "kentuckywindage152",
                "time": "14 hours ago",
                "context": "Just shot Jupiter and her Galilean moons. The surface was too bright to see any detail without loosing the moons. Tomorrow night will shoot just the planet (Astromodified Nikon Z7 II attached to an 11\" Celestron Edge HD / with a 10X eyepiece projection rig, possibly a Barlow if the atmosphere cooperates). As bright as it is, I shouldn't have to shoot a stacked run. Wish me luck.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "edwinmandephamp",
        "time": "21 September, 2022",
        "context": "Speaking of not being close to a gigantic, gaseous body in years, isn’t Donald and Melania’s anniversary coming up soon?",
        "good": "0",
        "bad": "8",
        "replies": [
            {
                "user_name": "carol1010",
                "time": "21 September, 2022",
                "context": "Childish statement.  Grow up.",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "wiggyteepee",
                "time": "21 September, 2022",
                "context": "seek help.\na little creepy that you keep track of their wedding anniversary.\nagain, seek help.",
                "good": "2",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "Rubrbsct",
        "time": "21 September, 2022",
        "context": "Isn’t Jupiter where Creepy Joe thinks he lives?",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "steve3800",
        "time": "21 September, 2022",
        "context": "Yep, I can feel the pull of Jupiter. My hair is standing on end!",
        "good": "1",
        "bad": "1",
        "replies": [
            {
                "user_name": "noddingham",
                "time": "21 September, 2022",
                "context": "Jupiter high tides might wipe out Martha's Vineyard!",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "thetechguy",
                        "time": "21 September, 2022",
                        "context": "More likely Florida if that's the case",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "noddingham",
        "time": "21 September, 2022",
        "context": "Joe wants to know if we should duck.\nCommiela says \"Jupiter is a planet that orbits in an orbit like planets orbit in.\"",
        "good": "12",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "rubiks6",
        "time": "21 September, 2022",
        "context": "Jupiter — another demonstration of God’s creativity.",
        "good": "10",
        "bad": "3",
        "replies": [
            {
                "user_name": "fibonacci1.618",
                "time": "21 September, 2022",
                "context": "So wasteful and uncreative to not put life out there, but maybe He did!",
                "good": "4",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "rubiks6",
                        "time": "21 September, 2022",
                        "context": "Why is it wasteful?\n\nI’m trying to figure out if you like God or hate God or just what you think God is. \n\nGod’s intentions with this creation are all focused on Man. He himself became a man. Jupiter is there for Man to look at and enjoy and perhaps to accomplish some astronomical things for the betterment of Man. Do you need more places to explore? You haven’t finished exploring this one yet. \n\nIf God had put life on other planets or moons, you might come to believe something like abiogenesis could happen. God made things simple for you by keeping all the life right here in one place. He did this for you. \n\nHow do you measure “waste”? How do you measure “creativity”? Your opinions of God’s wastefulness or His creativity are your own. I do not share them.",
                        "good": "1",
                        "bad": "3",
                        "replies": [
                            {
                                "user_name": "fibonacci1.618",
                                "time": "21 September, 2022",
                                "context": "I love God. He created this universe in such a fascinating way, through cosmic and biological evolution.\nIt is only your arrogance that makes you think all of this was for \"Man\" and \"Man\" alone. And you have nothing Biblical to support your view.\nThe rest of us have God's writings across the planet and around the universe to appreciate.",
                                "good": "1",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "rubiks6",
                                        "time": "2 hours ago",
                                        "context": "“So God created man in his own image, in the image of God he created him; male and female he created them. And God blessed them. And God said to them, “Be fruitful and multiply and fill the earth and subdue it, and have dominion over the fish of the sea and over the birds of the heavens and over every living thing that moves on the earth.””\n— Genesis‬ ‭1:27-28 (ESV)\n\n\nGod has given His testimony how He created the Earth and that He gave dominion to Man. It doesn’t get clearer than that. \n\nReal writing use human language to record ideas. What you refer to as “writings” are not writings at all. \n\n“For in six days the Lord made heaven and earth, the sea, and all that is in them, and rested on the seventh day. Therefore the Lord blessed the Sabbath day and made it holy.”\n— Exodus‬ ‭20:11‬ ‭(ESV)\n\nSix days. All that is in them. It doesn’t get clearer than that.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": []
                                    },
                                    {
                                        "user_name": "rubiks6",
                                        "time": "1 hour ago",
                                        "context": "God’s Word trumps any other epistemology. God cannot lie.\n\nIf you say you trust God, you must trust God’s Word.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": []
                                    }
                                ]
                            },
                            {
                                "user_name": "kwitchyerbeliakin",
                                "time": "22 September, 2022",
                                "context": "Abiogenesis happened, no matter how you look at the universe.",
                                "good": "2",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "rubiks6",
                                        "time": "22 September, 2022",
                                        "context": "Well, if by \"abiogenesis\" you mean God spoke commanding words and took inanimate material and turned it into the great many kinds of living creatures we see on Earth on days five and six of creation week then I guess it happened. If you mean what the evolutionary biologists mean by \"abiogenesis,\" some vaguely specified chemical evolution that became life without the input of an agent, that didn't happen. All of the empirical evidence you have is that life only ever comes from life.\n\nI thought you said you believed in God. Why would you ignore the clear narrative God has given us about the beginning of life on Earth? It's really easy to understand.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": [
                                            {
                                                "user_name": "penguinsfan87",
                                                "time": "22 September, 2022",
                                                "context": "Your comments are meaningless.",
                                                "good": "0",
                                                "bad": "1",
                                                "replies": [
                                                    {
                                                        "user_name": "rubiks6",
                                                        "time": "22 September, 2022",
                                                        "context": "Sorry you cannot understand. The internet can be a dictionary for you.",
                                                        "good": "0",
                                                        "bad": "1",
                                                        "replies": [
                                                            {
                                                                "user_name": "penguinsfan87",
                                                                "time": "22 September, 2022",
                                                                "context": "You have no right to speak on topics you don't understand. Your god isn't real. You have no evidence that your god is real.",
                                                                "good": "0",
                                                                "bad": "1",
                                                                "replies": [
                                                                    {
                                                                        "user_name": "rubiks6",
                                                                        "time": "22 September, 2022",
                                                                        "context": "Sir – I will speak on any topic I wish. You have no authority here.\n\nI have a great deal of evidence for the reality of my God. You too have the same evidence but you choose to ignore it or discount it because you know that the existence of God means you are accountable for your actions, words, and even your thoughts. Saying there is no God will not free you from the penalty of His judgment. God has provided a way that you can be freed from the penalty. If you ask, I will explain to you how it works.",
                                                                        "good": "0",
                                                                        "bad": "0",
                                                                        "replies": []
                                                                    }
                                                                ]
                                                            }
                                                        ]
                                                    },
                                                    {
                                                        "user_name": "kwitchyerbeliakin",
                                                        "time": "22 September, 2022",
                                                        "context": "And you think that your comment adds meaning to the conversation?\nSorry, it does not.",
                                                        "good": "1",
                                                        "bad": "0",
                                                        "replies": [
                                                            {
                                                                "user_name": "penguinsfan87",
                                                                "time": "22 September, 2022",
                                                                "context": "This section of Fox is for science, not religious babble. His god isn't real and has no place here.",
                                                                "good": "0",
                                                                "bad": "2",
                                                                "replies": []
                                                            },
                                                            {
                                                                "user_name": "rubiks6",
                                                                "time": "22 September, 2022",
                                                                "context": "Re: your response to penguinsfan87 —\n\nSometimes you and I agree with one another. Thank you for your support.",
                                                                "good": "0",
                                                                "bad": "0",
                                                                "replies": [
                                                                    {
                                                                        "user_name": "penguinsfan87",
                                                                        "time": "2 days ago",
                                                                        "context": "No we don't.",
                                                                        "good": "0",
                                                                        "bad": "1",
                                                                        "replies": []
                                                                    }
                                                                ]
                                                            }
                                                        ]
                                                    }
                                                ]
                                            },
                                            {
                                                "user_name": "kwitchyerbeliakin",
                                                "time": "22 September, 2022",
                                                "context": "There was no life, and then there was. Abiogenesis happened. Evolutionary biologists don't really deal with the origin of life; that is a separate issue that we biologists take great interest in, but leave it to organic chemists to figure it out.\n\nYes, I do believe in God. God has provided us with a very clear narrative that I certainly do not  ignore. It is told so eloquently in the fossil record of our evolution starting from microbiota through to every highly evolved organism alive today. It captures so much more of the story than the simple allegory in Genesis.",
                                                "good": "1",
                                                "bad": "0",
                                                "replies": [
                                                    {
                                                        "user_name": "rubiks6",
                                                        "time": "22 September, 2022",
                                                        "context": "The organic chemists aren’t having too good a time figuring out how life might have started. In fact, the more they learn about how life works (which they can learn from life that actually exists now) the further they seem to be from coming up with any idea how life could have begun spontaneously. Without life, no biological evolution takes place. By the theory you believe, you can’t exist. \n\nIn the “tree of life” (taxonomic tree) images, the vast majority of branch nodes are question marks. Only end points of branches show actual known creatures. The fossil beds contain the remnants of millions of creatures buried suddenly in sedimentary (flood created) layers all over the Earth. The same layers are found over vast areas of every continent. Your interpretation of the fossil record is wrong. There was a global flood, just as it is written in Genesis. \n\nYou reject God’s Word which is inspired by God’s Holy Spirit (2 Peter 1.21). You blaspheme the Holy Spirit. Genesis is no allegory. There is nothing in the text to indicate it is allegory. Jesus treats as historical. Peter and Paul and Luke treat it as historical. \n\nDo you also think the resurrection of Jesus Christ is allegory? It certainly seems to violate known scientific laws. \n\nWhy would you exchange the narrative given by God for a narrative invented by godless men?",
                                                        "good": "0",
                                                        "bad": "0",
                                                        "replies": [
                                                            {
                                                                "user_name": "kwitchyerbeliakin",
                                                                "time": "2 days ago",
                                                                "context": "Nobody is godless.\n\nI believe in the manifest God, seen everywhere here on Earth.\n\nYou believe in a magician who pulls rabbits out of a hat.",
                                                                "good": "2",
                                                                "bad": "0",
                                                                "replies": []
                                                            }
                                                        ]
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            },
                            {
                                "user_name": "penguinsfan87",
                                "time": "22 September, 2022",
                                "context": "You have no place here.",
                                "good": "0",
                                "bad": "3",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "user_name": "penguinsfan87",
                        "time": "22 September, 2022",
                        "context": "God has zero place here and he is not capitalized.",
                        "good": "0",
                        "bad": "3",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "hogart_hojewitson3",
                "time": "21 September, 2022",
                "context": "Which god? Zeus? you didn't say. ",
                "good": "1",
                "bad": "3",
                "replies": [
                    {
                        "user_name": "rubiks6",
                        "time": "21 September, 2022",
                        "context": "The God that created Jupiter. Did Zeus claim to have created the planet Jupiter? Which God do you know of who has claimed to have created everything in the heavens and on Earth? Stop feigning ignorance.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "rubiks6",
                        "time": "21 September, 2022",
                        "context": "A better question to ask is, \"How can I learn about this God?\" Start by acknowledging that a real God exists who created Jupiter and many more things.",
                        "good": "0",
                        "bad": "1",
                        "replies": [
                            {
                                "user_name": "hogart_hojewitson3",
                                "time": "21 September, 2022",
                                "context": "There may be a creator. But he is no God. ",
                                "good": "0",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "rubiks6",
                                        "time": "21 September, 2022",
                                        "context": "Well, what else would he be?",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": []
                                    }
                                ]
                            },
                            {
                                "user_name": "kwitchyerbeliakin",
                                "time": "22 September, 2022",
                                "context": "It is about time you learn about this God, and how He works.\nScience is God's best friend, because it reveals the nature of God.\nNote that term: Nature. Stop ignoring Nature.",
                                "good": "0",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "rubiks6",
                                        "time": "1 day ago",
                                        "context": "\"And he [Jesus] said to all, “If anyone would come after me, let him deny himself and take up his cross daily and follow me. 24 For whoever would save his life will lose it, but whoever loses his life for my sake will save it. 25 For what does it profit a man if he gains the whole world and loses or forfeits himself? 26 For whoever is ashamed of me and of my words, of him will the Son of Man be ashamed when he comes in his glory and the glory of the Father and of the holy angels.\"\n– Luke 9.23 - 26 (ESV)\n\nYou told me what you do for your career but I can't remember. I think it has something to do with biological evolution. You think if you accept the Genesis narrative as it is written you will be ridiculed and may even lose your career.\n\n\"... for they loved the glory that comes from man more than the glory that comes from God.\"\n– John 12.43\n\nThose words were spoken by Jesus concerning the most deeply religious men in Israel. Are you like those deeply religious men? Do you love the honor you receive from men more than the honor you that comes from God?\n\n\"Not everyone who says to me, 'Lord, Lord,' will enter the kingdom of heaven, but the one who does the will of my Father who is in heaven. On that day many will say to me, 'Lord, Lord, did we not prophesy in your name, and cast out demons in your name, and do many mighty works in your name?' And then will I declare to them, 'I never knew you; depart from me, you workers of lawlessness.' \"\n– Matthew 7.21 - 23\n\nStop ignoring God.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "user_name": "rubiks6",
                        "time": "22 September, 2022",
                        "context": "\"Zeus?\"\n\nI was just now exploring the Greek gods. (I have a turtle named Atlas.) It occurs to me that if Zeus were really a god, his stories would not have been lost. The true, living God has given us His Word and it has been transmitted faithfully throughout the ages to us today. Not only that but it has remained uncorrupted. God's Word belongs to Him and He makes sure it gets transmitted accurately to all generations.\n\nThe true, living God is the God written about in God's Word. I think you've heard about Him. The pronunciation of His name is lost to antiquity but that is just phonemes anyway. What is important are His words and His deeds and His attributes.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "quietsmith",
                        "time": "22 September, 2022",
                        "context": "The amusing thing here is Zeus did technically create \"Jupiter\"... in as much as Jupiter is Zeus... as in the Roman name for Zeus.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "penguinsfan87",
                "time": "22 September, 2022",
                "context": "Get out of here.",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "theycallmedad",
                "time": "1 day ago",
                "context": "Do you think maybe we can live there someday say in a billion years or so? Because it will be around that time the sun will be too hot to sustain life on earth and everything and everyone including their religions will be dead.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "rubiks6",
                        "time": "1 day ago",
                        "context": "\"Do you think maybe we can live there ...\"\n\nNo. I don't. The Earth was created for Man – not Jupiter or any of its moons.\n\nThe stage, the Earth, was built for the narrative. The props were set up – the oceans, the mountains, the trees, the lights in the heavens, the sea creatures and animals – and last of all, the main actors, Mankind, were put here and the play began. The hero of the narrative, Jesus Christ, came on the scene and gave the most compelling performance – the King giving his life for his subjects and then rising from the dead. Very soon it will be time for the lead performer to return to the scene and finally conquer all of his enemies ... in my opinion, less than 100 years.\n\nWhen Jesus has conquered all of his enemies, this portion of the play will be over. The stage will no longer be needed and will be uncreated far more quickly than it was created.\n\n\"But the day of the Lord will come like a thief, and then the heavens will pass away with a roar, and the heavenly bodies will be burned up and dissolved, and the earth and the works that are done on it will be exposed. Since all these things are thus to be dissolved, what sort of people ought you to be in lives of holiness and godliness, waiting for and hastening the coming of the day of God, because of which the heavens will be set on fire and dissolved, and the heavenly bodies will melt as they burn! But according to his promise we are waiting for new heavens a new earth in which righteousness dwells.\" 2Pet 3",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "hogart_hojewitson3",
        "time": "21 September, 2022",
        "context": "\"C'mon folks these Jupiter folks ain't bad folks, folks!\"\n- Joke Bribem",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "gradivusgraham",
        "time": "21 September, 2022",
        "context": "Jeepers, that's pretty close. I hope it doesn't hit us!   ;-)",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "foxisgreatamericannews",
        "time": "1 day ago",
        "context": "Jupiter is the Stacy Abrams of planets. Huge round and fully of toxic gas.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "kareemoweet",
        "time": "21 September, 2022",
        "context": "Having failed to buy Greenland, Trump has promised, if reelected,  he will buy Jupiter.",
        "good": "0",
        "bad": "3",
        "replies": [
            {
                "user_name": "hogart_hojewitson3",
                "time": "21 September, 2022",
                "context": "How much did you sell your brain to him for? ",
                "good": "2",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "kareemoweet",
                        "time": "21 September, 2022",
                        "context": "He couldn't afford it. But I encouraged him to keep shopping.  He really needs one.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "hogart_hojewitson3",
                                "time": "21 September, 2022",
                                "context": "I'm sorry for you but TDS is a life sentence. ",
                                "good": "1",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "kareemoweet",
                                        "time": "21 September, 2022",
                                        "context": "Sounds like you're in the market for a brain too. Good luck finding one.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "bbq4u616",
        "time": "22 September, 2022",
        "context": "\"Kobelski recommends using a larger telescope to see it in more detail.\"\n\nI see.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Dangerfield508",
        "time": "1 day ago",
        "context": "Next thing you know there will be a fentynl vaccine.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tiredofurlies",
        "time": "22 September, 2022",
        "context": "It happens every 13 months? \nThen why haven't we ever heard about it long before now?",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "jcv1953",
                "time": "22 September, 2022",
                "context": "Opposition occurs every 13 months but the actual distance varies.  This is the closest one since 1963.",
                "good": "2",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "infantryman300",
        "time": "22 September, 2022",
        "context": "All you climate nuts fly out there and fix it may cause temperatures to fall a degree",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "infantryman300",
                "time": "22 September, 2022",
                "context": "Over 35 years",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "una998",
        "time": "21 September, 2022",
        "context": "Sun Ra was from Jupiter.  Look it up. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "darrenhuntershow.com",
        "time": "22 September, 2022",
        "context": "Will it be close enough to jump over to? Because this place is nuts.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "fld11",
        "time": "22 September, 2022",
        "context": "Opposition? Why is Jupiter opposed to us? ",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "alvawolf",
                "time": "2 days ago",
                "context": "Dang Jupiterin’s",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "commonpeaceful",
        "time": "22 September, 2022",
        "context": "Gas giant only eclipsed by a compulsive lying commander in grief. ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "harathra",
        "time": "22 September, 2022",
        "context": "This explains why Democrats have gone over the edge!\nThe gravitational influence from Jupiter reverses their anatomical polarity,!",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "dogfacedponysoldier033",
        "time": "22 September, 2022",
        "context": "Must be climate change.",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "infantryman300",
                "time": "22 September, 2022",
                "context": "Kerry’s private jet caused it",
                "good": "2",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "georgeinsandiego",
        "time": "22 September, 2022",
        "context": "There also happens to be a sixty year cycle in Earth's cloud cover that is caused by the relative movements of Earth and Jupiter. Jupiter's powerful magnetic field sometimes prevents cosmic rays from striking Earth and sometimes doesn't, depending on the relative positions of the two bodies. Cosmic rays are a substantial factor in the formation of clouds, and clouds reflect incoming sunlight, having the effect of cooling the atmosphere and thus the Earth's surface as well. There are cyclic influences on our climate that we are only beginning to understand.",
        "good": "9",
        "bad": "1",
        "replies": [
            {
                "user_name": "mr.president809",
                "time": "22 September, 2022",
                "context": "'COSMIC FORCE' -\n\nDennis Brown (1992)",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "BlueBlood617",
                "time": "22 September, 2022",
                "context": "Mopar or no car brother!",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "ArneSaknussem",
                "time": "2 days ago",
                "context": "Or misunderstand, as in your case.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "georgeinsandiego",
                        "time": "1 day ago",
                        "context": "I fully understand a principle of physics called saturation, which makes catastrophic global climate change from manmade carbon dioxide emissions impossible. Trillions in real money are being spent on an entirely imaginary problem.",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "Dangerfield508",
                "time": "1 day ago",
                "context": "Saturn used to be our sun, how you think the dinosaurs and everything else got so big? Not the same solar system back in the day, they call it the Golden Age.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "sniffynchief",
        "time": "21 September, 2022",
        "context": "Jill and Joe Biden go to a steakhouse for dinner. Jill says, “I will have the petite filet medium rare with a baked potato with sour cream and butter.” The waiter asks, “What about your vegetable?” Jill replies, “Oh, he will have the same.”",
        "good": "8",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "Tinmann",
        "time": "22 September, 2022",
        "context": "A curious thought.\n\nOn October 18, 2021, the Great Salt lake's (Utah) elevation had dropped to 4190.2, which was a new record low at that time. Prior to that, the previous record low was set in October 1963, with an elevation of 4191.35, rounded to 4191.4 to conform with data reporting formats of the time and a recorded size of 950 square miles.\n\nThat was about 60 years ago.  The last time Jupiter was this close to the earth.\n\nCould the earth just be going though natural cycles with the cycles of the planets?",
        "good": "2",
        "bad": "0",
        "replies": [
            {
                "user_name": "sciencerocks",
                "time": "22 September, 2022",
                "context": "There is no doubt that Earth goes through many natural cycles, though I don't know if your correlation is significant or spurious.\nWhat we do know is that Earth's natural cycles have been disrupted and changed by human activities over the past century.",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "alvawolf",
                "time": "2 days ago",
                "context": "Interesting. Wonder if we have any records further back",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "JohnnySokko",
        "time": "21 September, 2022",
        "context": "Interesting fact: Stacey Abrams has a higher gravitational pull than the planet Jupiter.",
        "good": "12",
        "bad": "3",
        "replies": [
            {
                "user_name": "oregonsilverado",
                "time": "22 September, 2022",
                "context": "awesome",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "##___TJATAW___##",
                "time": "22 September, 2022",
                "context": "I have noticed that food can not escape her gravitational pull.  lol",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "nostradamus.2",
                "time": "1 day ago",
                "context": "When Stacy Abram jumps, the other side of the world suffers an earthquake.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "shavedkitty69",
        "time": "21 September, 2022",
        "context": "so right during monday night football.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Thatbeingsaid",
        "time": "22 September, 2022",
        "context": "I challenge you folks who cannot comment on ANYTHING without bringing Trump or Biden into it to go just ONE day with mentioning politics...",
        "good": "2",
        "bad": "0",
        "replies": [
            {
                "user_name": "burtj399",
                "time": "22 September, 2022",
                "context": "I had a glass of milk before bed tonight. ",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "crazydoogan",
        "time": "22 September, 2022",
        "context": "Russian propaganda.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mr.president809",
        "time": "22 September, 2022",
        "context": "Twinkle Twinkle Lil Star/Planet ...",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "independent2022",
        "time": "21 September, 2022",
        "context": "It's time for a moon base.",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "infantryman300",
                "time": "22 September, 2022",
                "context": "Yah for all the climate nuts",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "rpassinblgrd072",
        "time": "1 day ago",
        "context": "I'll be setting up 4 telescopes Sunday night since Jupiter's opposition is ALSO happening at a New Moon - so, no other bright objects in the night sky. :-) I'll have my 10\" LX200 with a 3X Barlow and a 5.5x Crop Sensor shooting Jupiter, my 8\" Quattro f/4 + ASI178MM shooting either the Ring Nebula, Helix Nebula, or Dumbbell Nebula, my William Optics GT71 + ASI1600MM shooting the North America Nebula, and my Sky-Watcher 72ED + ASI2600MC-P shooting Andromeda (for the first 3 hours of the night) and then shooting the Pleiades for the remaining 5 hours... It's been quite a while since I've been able to play but, the smoke is FINALLY GONE. :-) Clear Skies, everybody!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "hogart_hojewitson3",
        "time": "21 September, 2022",
        "context": "Might have to break out the telescope. ",
        "good": "1",
        "bad": "0",
        "replies": []
    }
]