[
    {
        "user_name": "nicki5222",
        "time": "8 August, 2021",
        "context": "Wonderful now what?",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "PurpleApple",
                "time": "8 August, 2021",
                "context": "arms",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "flipper973",
        "time": "8 August, 2021",
        "context": "It always turns out just like it does in the movies.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "exmark",
        "time": "8 August, 2021",
        "context": "\"Performing tasks that will help people live more fulfilling lives at work and at home.\"\n\nOh my!  Mankind is in deep trouble, no mark that, DEEP TROUBLE, if we thin a robot will lead to fulfilment living life.  Fulfillment is not found in robots, or other such nonsense.  While robots may be useful, there is no way to connect the dots between robots and fulfillment.  Fulfillment hinges of an understanding of meaning and purpose.  Sadly, many people today have no clue about meaning and purpose.  \n\nProf Marston of New York University recently did a survey.  He asked 3,000 people, “What have you to live for?\"  94% were enduring the present, hoping for something in the future. They had no substance on what they were hoping for.  \n\nWith 94% only enduring, meaning and purpose, (hence fulfillment) was beyond their reach.  No robot will make the 94%, 50%, or 25%.  When we search the wrong places, we cannot expect to find answers.",
        "good": "14",
        "bad": "2",
        "replies": [
            {
                "user_name": "eelanad",
                "time": "8 August, 2021",
                "context": "Robots like this will enhance the lives of millions of people that are too old to do some things and others that are handicapped.\nSomeday they will be able to cook, clean help lift someone who may have fallen, call for help when someone is in trouble.\nYou remember the commercials of the woman on the ground that yells \"I've fallen and can't get up\" you remember how you laughed? A properly designed robot could help her get up or call for help and guard her from harm until help arrives.\nWhat a bout a chair that a paralyzed person can sit in and it will walk outside and around the neighborhood, walk up a set of stairs with the person sitting in it, the store etc.\nYou don't think this will be fulfillment in the purist form? \nYou sound like a technophobe to me.",
                "good": "1",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "exmark",
                        "time": "8 August, 2021",
                        "context": "Not any of your examples apply to a \"fulfilled\" life.  You missed the entire paragraph about the 94% - absolutely nothing to do with the woman on the floor, paralyzed person.  \n\nNo technophobe here - been involved with technology for more than  50 years.  I had a long career based in technology.  What was done with this bi-ped is amazing and well intentioned.  But, adding fulfillment, ... no, not at all.   Some of the least fulfilled people I know are deep into technology.  Recall my comment about looking in the wrong places....?\n\nRemember, when the personal computer began an upswing, mid-80s?  Consider what Ken Olson said regarding PCs. The goal was to make things easier so that people would have \"more time to do what they wanted to do.\"  Remember when cell phones first came to the market, \"... make life easier.\"  How many people are slaves to this technology in 2021?  What happened to all the relief of time, \"to do what you want to do?\"",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "denfallna",
        "time": "8 August, 2021",
        "context": "\"Deep reinforcement learning\"  Sounds complicated. Guess we'll be paying more for these robots...cuz we \"deserve\" a better life. Can't wait for the commercials.",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "usbubba",
        "time": "8 August, 2021",
        "context": "Can this robot read my \"NO Trespassing\" signs??",
        "good": "4",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "esteban51",
        "time": "8 August, 2021",
        "context": "As if our society isn't relationship-challenged enough already.....",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tomdahl",
        "time": "8 August, 2021",
        "context": "Next step is teaching the robots how to make burgers and fries so McDonalds can replace all those college educated idiots.  It all helps the corporate bottom line.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "philipbuster1",
        "time": "8 August, 2021",
        "context": "Maybe they can make a robot that can clean up their filthy disgusting streets.",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "NorCalPatriot",
        "time": "8 August, 2021",
        "context": "Yet what most people need in most states are computers that sit there and turn on when they need ithem.  Oregonians, on the other hand, need computers that can run away from Marist mobs.",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "thatParrotsDead",
        "time": "8 August, 2021",
        "context": "If they come around my house I'll do the same as I do to drones over my property....Shotgun them",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "SaintNick882",
        "time": "8 August, 2021",
        "context": "its got Kim K's butt",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "venomousguineapig",
        "time": "8 August, 2021",
        "context": "Yeah... That's' not creepy at all.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "eelanad",
        "time": "8 August, 2021",
        "context": "A great advancement, but I would not exactly call this running. More like a fast walk, the record for a 5k run is something like 13 min., 53 min. is not quite the same.",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "boejiden764",
        "time": "8 August, 2021",
        "context": "Boe Jiden here, I support these LGBTQ bi robots. They can run man, pretty soon they'll be doing diaper duty for me. Merica baby,I'm Boe Jiden",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sender9999",
        "time": "8 August, 2021",
        "context": "Bye bye minimum wage jobs in 2050. Better learn to repair and program them.",
        "good": "2",
        "bad": "0",
        "replies": [
            {
                "user_name": "eelanad",
                "time": "8 August, 2021",
                "context": "Kind of like a buggy repairman, learn to repair cars or lose your livelihood.\nAlthough buggy repairman is a niche job and probably pays better now than it did in 1890.",
                "good": "1",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "fierce388",
                "time": "9 August, 2021",
                "context": "The robots will repair each other. iRobot. ",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "guyfawkes1105",
        "time": "9 August, 2021",
        "context": "No doubt Terminators will be made within decades.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "LibsH8UrHappiness",
        "time": "8 August, 2021",
        "context": "Remember, Genisys is Skynet....",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "RedCorn",
        "time": "8 August, 2021",
        "context": "Oregon State??  Yeah, put a uniform on that robot and have it go out for a sport.   Any sport, they could use the help.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "jfllive1",
        "time": "8 August, 2021",
        "context": "But can it bring me a beer...?",
        "good": "5",
        "bad": "0",
        "replies": [
            {
                "user_name": "eelanad",
                "time": "8 August, 2021",
                "context": "I believe that's the first thing they will program it to do once they figure out how to put arms on it and it will not fall on its face.",
                "good": "2",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "VietVet46",
        "time": "8 August, 2021",
        "context": "Give robots 'personhood' and soon the Olympics can be run totally by robots, and they will all be programmed to not kneel or raise their arms on the podiums.\n\nBesides, the real market will be for 'sex' robots.  Could keep a lot of politicians out of trouble.",
        "good": "12",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "whiteknigh",
        "time": "8 August, 2021",
        "context": "OH, look more targets. How long before its hacked and steals purses, money, and on and on?  Nah,, that would never happen.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "thongor1",
        "time": "9 August, 2021",
        "context": "How long before they start leaving comments here, and get far more likes than we do??",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "fierce388",
        "time": "9 August, 2021",
        "context": "Anyone watch iRobot?",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "RedCorn",
        "time": "8 August, 2021",
        "context": "They develop robots that don't actually do anything, but when it comes to wildfires, they use a helicopter with a bucket hanging from a cable.   Genius.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "realist12345678",
        "time": "8 August, 2021",
        "context": "Whenever you hear a politician talk about \"Bringing back your jobs\" you know he doesn't have a clue about tech like this. \nRobots have taken the blue collar jobs and they ain't ever coming back. \nAdvanced robots like these will just work their way higher up the job food chain.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cobom041",
        "time": "9 August, 2021",
        "context": "Just spent the weekend putting in a new floor, up and down off my knees for 16 hours. Will take me a few days to walk normal now. Robots, used properly, will enhance millions of lives - just like a power saw enables us to cut wood efficiently instead of using a hand saw. I see medical uses the most beneficial - ever wonder how CNEs manage to move 200-300 patients around? Sheer struggling right now, with some technique and assistance. In Japan robots or \"electro-mechanical tools\" - already assist moving patients.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "gotstuff",
        "time": "8 August, 2021",
        "context": "But being created in Oregoonie, Robot Cassie will be Protesting Violently, Burning Buildings, Assaulting Police, Destroying Public and Private Property, then RUNNING AWAY! It will Live on the Streets of Portlandia in a Tent and Chitting and Pizzing Nuts and Bolts on the public sidewalks.",
        "good": "12",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "lizardman",
        "time": "8 August, 2021",
        "context": "Robot Olympics!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "fleendarthemagnificent",
        "time": "8 August, 2021",
        "context": "Guess we didn't learn anything when we watched the Terminator movies....",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "wadamader4u",
        "time": "8 August, 2021",
        "context": "One will ride a bicycle next.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "sender9999",
                "time": "8 August, 2021",
                "context": "One will BE  bicycle next",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "bbabe36530",
        "time": "8 August, 2021",
        "context": "This is scary.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "AliceBowie",
        "time": "8 August, 2021",
        "context": "A robot will be able to run a 5000k.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dirkbroadcloth",
        "time": "9 August, 2021",
        "context": "...and sold the plans to the chicoms",
        "good": "2",
        "bad": "0",
        "replies": [
            {
                "user_name": "brontosaurus",
                "time": "9 August, 2021",
                "context": "china has stolen the plans LONG ago !\nchina produces NOTHING on it's own !",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "TPuncher",
        "time": "8 August, 2021",
        "context": "They'll probably program it to loot and riot.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "fierce388",
                "time": "9 August, 2021",
                "context": "Well, it is Oregon….",
                "good": "1",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "TPuncher",
                        "time": "10 August, 2021",
                        "context": "They're \"different\" in Oregon.  I have a few friends from there.  Some are very intelligent, but there are others who have what I shall describe as \"limited horizons\".",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "fierce388",
                "time": "9 August, 2021",
                "context": "By the way, in Oregon they don’t call it looting and rioting. They refer to it as socializing and shopping. ",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "bill9351",
        "time": "9 August, 2021",
        "context": "You need to be a robot to walk the streets of Portland. Only a robot could take a bullet or be knife on a daily stroll around this socialist utopia.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "brontosaurus",
        "time": "9 August, 2021",
        "context": "COMPLETE WASTE OF MONEY !",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "svengolly",
        "time": "9 August, 2021",
        "context": "While this may be an incredible technical achievement, I wonder if the next step will be to move from motors, wires and computers to an engineered carbon based technology. Unintended consequences anyone ?",
        "good": "4",
        "bad": "2",
        "replies": [
            {
                "user_name": "ferd4328",
                "time": "10 August, 2021",
                "context": "we've all seen the terminator and i robot and know how this plays out.",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "torpedoman",
        "time": "9 August, 2021",
        "context": "Oregon State's robot appears smarter than the robot we have in White House.",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sandyone699",
        "time": "9 August, 2021",
        "context": "Now if only they could teach their graduates to work.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "georgeois",
        "time": "9 August, 2021",
        "context": "Impressive, but that's not running. There's no flight phase with both feet off the ground. That's a 5K walk.",
        "good": "2",
        "bad": "0",
        "replies": [
            {
                "user_name": "nr70",
                "time": "9 August, 2021",
                "context": "Agreed, this particular demonstration is of walking. That said the article does mention walking and running. Regardless, remarkable piece of work by OSU.",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "pir8fan091",
        "time": "9 August, 2021",
        "context": "There have been bipedal robots for years.  They're called liberals.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ThePsycho",
        "time": "11 August, 2021",
        "context": "I, Robot is coming to a neighborhood near you.!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "austindoc461",
        "time": "9 August, 2021",
        "context": "Military applications maybe. Dont see much use otherwise.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "magruder",
        "time": "9 August, 2021",
        "context": "that's pretty cool! Though I read somewhere that Oregon State is the home of Antifa. I guess you got to take the good with the bad!",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Trump-Is-A-Legend",
        "time": "20 August, 2021",
        "context": "Once Oregon is finished testing the robots, they will be deployed as BLM rioters.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "brian1264464",
        "time": "23 September, 2021",
        "context": "Make one that will do 26K and I will have it run the Marathon for me.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "EggsAckley",
        "time": "10 August, 2021",
        "context": "But can it teach math to minorities.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "azulthedefiler",
        "time": "10 August, 2021",
        "context": "Not surprising it wants to run out of Oregon!!!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "nogovcntrl164",
        "time": "9 August, 2021",
        "context": "So the military give them $1 million to develop and one of the Chinese students take the plans and send them home for them to use for free.  Got it!  Happens all the time!  China has no R&D.  They steal and replicate everything.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cqql72",
        "time": "9 August, 2021",
        "context": "Try to quiet it down.",
        "good": "1",
        "bad": "0",
        "replies": []
    }
]