[
    {
        "user_name": "jmmul123",
        "time": "15 March, 2021",
        "context": "Never may have happened had she been born in America at the same time period. After all, she's a woman. \n\nOh wait, with the Proud Boys and other groups, wouldn't happen now if they had their way.",
        "good": "3",
        "bad": "22",
        "replies": []
    },
    {
        "user_name": "TexasGrandpa-19",
        "time": "15 March, 2021",
        "context": "Also the first Nobel Prize winner to glow in the dark.",
        "good": "12",
        "bad": "7",
        "replies": [
            {
                "user_name": "imfortrump2020",
                "time": "15 March, 2021",
                "context": "probably still glowing.....that stuff has an extremely long shelf life",
                "good": "6",
                "bad": "2",
                "replies": []
            },
            {
                "user_name": "thekemist",
                "time": "15 March, 2021",
                "context": "Her body was exhumed in 1995 for reburial in the Pantheon, she was placed in a lead-lined coffin.  Her research papers and lab notebooks are still highly radioactive from Radium and Polonium contamination.",
                "good": "9",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "imfortrump2020",
                        "time": "16 March, 2021",
                        "context": "Things that make you go \"hmmmm\". Interesting piece of trivia there.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "nevermore44444444",
        "time": "15 March, 2021",
        "context": "I wonder if everyone said she didn't know what she was doing because she didn't get it 100% right off the bat?",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "openperspective677",
        "time": "15 March, 2021",
        "context": "A brilliant scientist, tragically lost before her time due to her fascination with radium and the lack of available knowledge on how ionizing radiation affects the body.  There were many geniuses back then, and many since, but her place in history will always be assured.",
        "good": "56",
        "bad": "1",
        "replies": [
            {
                "user_name": "kmartcorp",
                "time": "15 March, 2021",
                "context": "Not really.  She could be erased at any moment by the left - kinda like how Newton's Laws are right now at some schools being taught as the Three  Fundamental Laws of physics.",
                "good": "5",
                "bad": "14",
                "replies": [
                    {
                        "user_name": "lycopine",
                        "time": "15 March, 2021",
                        "context": "Newtonian mechanics will live forever in school, you are off base...",
                        "good": "6",
                        "bad": "2",
                        "replies": [
                            {
                                "user_name": "kmartcorp",
                                "time": "16 March, 2021",
                                "context": "Not as \"Newton's Laws\".  Very much on-base here.  Google it, friend of Physics.",
                                "good": "2",
                                "bad": "1",
                                "replies": [
                                    {
                                        "user_name": "lycopine",
                                        "time": "16 March, 2021",
                                        "context": "Newtonian mechanics, or classical mechanics, embody the mathematics behind those \"laws\", which are basically a few words for laymen to grasp the ideas of motion. The mathematics will never change or \"erased\".\nMeanwhile the religious right continues its onslaught of passing laws MANDATING creationism be taught as science in public school to indoctrinate children to conservative Christian theology.",
                                        "good": "3",
                                        "bad": "1",
                                        "replies": [
                                            {
                                                "user_name": "kmartcorp",
                                                "time": "16 March, 2021",
                                                "context": "Brilliant, man. Cuz I really thought the liberals could actually change the laws of physics.   Listen carefully to me here.  There is a movement afoot RIGHT NOW to change the NAME of Newtonian mechanics to something other than Newtonian mechanics.  the reason being to dismantle the patriarchal white supremacist underpinnings of physics.  You are not to mention Sir Isaac Newton anymore when you speak of these laws.  Maybe they willre name them the Kwaise Mfume Laws of Physics.\nDon't know about an onslaught of laws mandating creationism.",
                                                "good": "0",
                                                "bad": "2",
                                                "replies": [
                                                    {
                                                        "user_name": "lycopine",
                                                        "time": "16 March, 2021",
                                                        "context": "Never read or heard of such a movement regarding Newtonian mechanics. Classical mechanics has been the much more common name the past century though.\nThe far right has been attempting their creationism mandate for decades, which is much worse than taking Newton's name out of the mix.",
                                                        "good": "3",
                                                        "bad": "0",
                                                        "replies": [
                                                            {
                                                                "user_name": "kmartcorp",
                                                                "time": "16 March, 2021",
                                                                "context": "The upperclassman explained why the school dropped the name “Newton’s Laws.”\n“We\n call them the three fundamental laws of physics. They say we need to \n‘decenter whiteness’ and we need to acknowledge that there’s more than \njust Newton in physics,” the student added.",
                                                                "good": "0",
                                                                "bad": "1",
                                                                "replies": [
                                                                    {
                                                                        "user_name": "letsgetrel",
                                                                        "time": "16 March, 2021",
                                                                        "context": "It has nothing to do with whiteness.\n\nNothing.",
                                                                        "good": "0",
                                                                        "bad": "0",
                                                                        "replies": []
                                                                    },
                                                                    {
                                                                        "user_name": "lycopine",
                                                                        "time": "17 March, 2021",
                                                                        "context": "So who is this \"upperclassman\" and who is the \"we\" and \"they\"? And why would anyone care anyway?\nThis supposed \"movement\" is meaningless compared to the religious right's movement, which is far more organized with money and political support, to install their religious doctrine in public school children by law.",
                                                                        "good": "0",
                                                                        "bad": "0",
                                                                        "replies": []
                                                                    }
                                                                ]
                                                            }
                                                        ]
                                                    }
                                                ]
                                            }
                                        ]
                                    },
                                    {
                                        "user_name": "sciencerocks",
                                        "time": "16 March, 2021",
                                        "context": "A lot of science has taken place since Newton. He is given credit for the \"laws\" he discovered. \nAs a parallel, scientist never talk about 'Darwinian evolution' but talk about 'biological evolution.' Darwin and Wallace are still given credit for the concept of evolution through natural selection, but the field has grown enormously.",
                                        "good": "3",
                                        "bad": "0",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "kellysheroes1965",
                "time": "16 March, 2021",
                "context": "I learned about Marie & Pierre Curie from school history text books at about 11.  A brilliant scientist who happens to be a woman.   Bet you many millennials never heard about her but they sure can tell you a lot about the Kardashians and Lady Gagu.",
                "good": "16",
                "bad": "4",
                "replies": [
                    {
                        "user_name": "sciencerocks",
                        "time": "16 March, 2021",
                        "context": "My sons, who are millennials (a meaningless term), learned about Marie Curie in public school science classes and probably know more about her work than you.",
                        "good": "4",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "kellysheroes1965",
                                "time": "16 March, 2021",
                                "context": "Do you have a bumper sticker ?",
                                "good": "1",
                                "bad": "2",
                                "replies": [
                                    {
                                        "user_name": "sciencerocks",
                                        "time": "16 March, 2021",
                                        "context": "No. But somewhere in my collection of memorabilia I have a bumper sticker of \"Nixon - Now more than Ever.\" LOL!",
                                        "good": "2",
                                        "bad": "0",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "someotherview",
        "time": "15 March, 2021",
        "context": "One thing is for certain. She was more concerned about advancing science for everyone instead trying to be the first woman that (fill in the blank).",
        "good": "53",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "saggydrawers.",
        "time": "15 March, 2021",
        "context": "More Peter Aitken and her Women's Hysterectomy Month",
        "good": "1",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "RichardZZ",
        "time": "15 March, 2021",
        "context": "Naturally she was an atheist .... one can't be that smart and not be.",
        "good": "4",
        "bad": "16",
        "replies": [
            {
                "user_name": "sciencerocks",
                "time": "15 March, 2021",
                "context": "There are a lot of exceptionally smart scientists who are people of faith.\nFor example, Francis Collins who led the American Human Genome project and is now head of the National Institute of Health became a person of faith after being an atheist for many years. Many bright scholars are former atheists who became people of profound faith. C.S. Lewis is one of them.",
                "good": "11",
                "bad": "2",
                "replies": [
                    {
                        "user_name": "RichardZZ",
                        "time": "15 March, 2021",
                        "context": "I wish I had a dollar every time Francis Collins is used as an example of scientists that are NOT atheists   .... about the ONE and only.",
                        "good": "2",
                        "bad": "4",
                        "replies": [
                            {
                                "user_name": "sciencerocks",
                                "time": "15 March, 2021",
                                "context": "I use Francis Collins as an example because he is the best know of American scientists. But there are tens of thousands of us who are scientists of faith. It is more common than you imagine. Many of them are featured in my next forthcoming book which is an investigation of the intersections of science and faith.",
                                "good": "7",
                                "bad": "1",
                                "replies": [
                                    {
                                        "user_name": "RichardZZ",
                                        "time": "16 March, 2021",
                                        "context": "Sounds like not many pages, maybe more of a pamphlet rather than a book",
                                        "good": "1",
                                        "bad": "8",
                                        "replies": [
                                            {
                                                "user_name": "sciencerocks",
                                                "time": "16 March, 2021",
                                                "context": "It is a shorter book than my previous publications, but only by a few pages and words ... and fewer illustrations, though the ones I use are very effective.\n\nYou need to read more and understand science better.",
                                                "good": "5",
                                                "bad": "1",
                                                "replies": [
                                                    {
                                                        "user_name": "RichardZZ",
                                                        "time": "16 March, 2021",
                                                        "context": "LOL, okay, I'm an expert on Evolution, you being a Jesus Freak, do you believe it?",
                                                        "good": "1",
                                                        "bad": "5",
                                                        "replies": [
                                                            {
                                                                "user_name": "sciencerocks",
                                                                "time": "16 March, 2021",
                                                                "context": "I've been teaching human evolution for 40 years, 3 of my 4 published books deal with human evolution, and I was elected a Fellow of the AAAS for my work in evolutionary theory and science education.\nYet technically I do not \"believe\" in evolution, but only because science is not a belief system.",
                                                                "good": "4",
                                                                "bad": "0",
                                                                "replies": [
                                                                    {
                                                                        "user_name": "RichardZZ",
                                                                        "time": "16 March, 2021",
                                                                        "context": "So you're a Catholic, an enabler of worse cult in human history.",
                                                                        "good": "0",
                                                                        "bad": "5",
                                                                        "replies": [
                                                                            {
                                                                                "user_name": "sciencerocks",
                                                                                "time": "16 March, 2021",
                                                                                "context": "Sorry, I am not a Catholic. What a weak assumption on your part. You said you were am expert on evolution. You lied. You know nothing.",
                                                                                "good": "4",
                                                                                "bad": "0",
                                                                                "replies": [
                                                                                    {
                                                                                        "user_name": "RichardZZ",
                                                                                        "time": "16 March, 2021",
                                                                                        "context": "I'm narrowing it down  ....   Jewish, your ego gave you away.",
                                                                                        "good": "0",
                                                                                        "bad": "5",
                                                                                        "replies": [
                                                                                            {
                                                                                                "user_name": "sciencerocks",
                                                                                                "time": "16 March, 2021",
                                                                                                "context": "Oh, so you're a bigot too.\n\nI spent about 30 of my adult years as an atheist. The difference between me and you is that I treated others with dignity no matter what their beliefs. That is one reason I've come so far in life and you never will.",
                                                                                                "good": "5",
                                                                                                "bad": "0",
                                                                                                "replies": [
                                                                                                    {
                                                                                                        "user_name": "RichardZZ",
                                                                                                        "time": "16 March, 2021",
                                                                                                        "context": "Gotcha! LOL",
                                                                                                        "good": "0",
                                                                                                        "bad": "4",
                                                                                                        "replies": [
                                                                                                            {
                                                                                                                "user_name": "sciencerocks",
                                                                                                                "time": "16 March, 2021",
                                                                                                                "context": "Wrong again.",
                                                                                                                "good": "3",
                                                                                                                "bad": "0",
                                                                                                                "replies": []
                                                                                                            },
                                                                                                            {
                                                                                                                "user_name": "lycopine",
                                                                                                                "time": "17 March, 2021",
                                                                                                                "context": "Are you an expert in MAGAtry?",
                                                                                                                "good": "0",
                                                                                                                "bad": "0",
                                                                                                                "replies": [
                                                                                                                    {
                                                                                                                        "user_name": "RichardZZ",
                                                                                                                        "time": "17 March, 2021",
                                                                                                                        "context": "Yes, of course.",
                                                                                                                        "good": "0",
                                                                                                                        "bad": "0",
                                                                                                                        "replies": [
                                                                                                                            {
                                                                                                                                "user_name": "lycopine",
                                                                                                                                "time": "17 March, 2021",
                                                                                                                                "context": "and THE expert in arrogance and narcissism too.",
                                                                                                                                "good": "0",
                                                                                                                                "bad": "0",
                                                                                                                                "replies": [
                                                                                                                                    {
                                                                                                                                        "user_name": "RichardZZ",
                                                                                                                                        "time": "17 March, 2021",
                                                                                                                                        "context": "That too.",
                                                                                                                                        "good": "0",
                                                                                                                                        "bad": "0",
                                                                                                                                        "replies": []
                                                                                                                                    }
                                                                                                                                ]
                                                                                                                            }
                                                                                                                        ]
                                                                                                                    }
                                                                                                                ]
                                                                                                            }
                                                                                                        ]
                                                                                                    }
                                                                                                ]
                                                                                            }
                                                                                        ]
                                                                                    }
                                                                                ]
                                                                            }
                                                                        ]
                                                                    }
                                                                ]
                                                            },
                                                            {
                                                                "user_name": "ArneSaknussem",
                                                                "time": "16 March, 2021",
                                                                "context": "Wow! An expert on evolution! Please tell us what you think about Sewall Wright's Shifting Balance model and adaptive landscapes.",
                                                                "good": "4",
                                                                "bad": "0",
                                                                "replies": [
                                                                    {
                                                                        "user_name": "RichardZZ",
                                                                        "time": "16 March, 2021",
                                                                        "context": "I have some problems and questions with it. Wright's proposed SB between different evolutionary forces IS a complex process that raises two sets of theoretical questions: The first concerns phases I and II. Do populations of a species often occupy alternative adaptive peaks? How often do evolutionary transitions correspond to movements between peaks on an adaptive landscape of mean fitnesses? Under what circumstances will populations switch peaks by crossing adaptive valleys against the force of selection? Is drift necessary for movement between peaks?",
                                                                        "good": "0",
                                                                        "bad": "2",
                                                                        "replies": [
                                                                            {
                                                                                "user_name": "ArneSaknussem",
                                                                                "time": "17 March, 2021",
                                                                                "context": "Just as I thought. You are a complete charlatan, and not Jerry Coyne.",
                                                                                "good": "0",
                                                                                "bad": "0",
                                                                                "replies": [
                                                                                    {
                                                                                        "user_name": "RichardZZ",
                                                                                        "time": "17 March, 2021",
                                                                                        "context": "Nice to meet you, call me Jer, all my friends do at Stanford and Cal.",
                                                                                        "good": "0",
                                                                                        "bad": "0",
                                                                                        "replies": [
                                                                                            {
                                                                                                "user_name": "ArneSaknussem",
                                                                                                "time": "18 March, 2021",
                                                                                                "context": "Sure. You got caught. Ya see the internet has search engines, so I searched your answer to my question and got an almost verbatim match to the real Jerry Coyne.\nEpic fail there, charlatan dude, epic fail!",
                                                                                                "good": "0",
                                                                                                "bad": "0",
                                                                                                "replies": [
                                                                                                    {
                                                                                                        "user_name": "RichardZZ",
                                                                                                        "time": "18 March, 2021",
                                                                                                        "context": "Dude, there is no shaming on the anonymous internet, but nice try anyway. LOL",
                                                                                                        "good": "0",
                                                                                                        "bad": "0",
                                                                                                        "replies": [
                                                                                                            {
                                                                                                                "user_name": "ArneSaknussem",
                                                                                                                "time": "18 March, 2021",
                                                                                                                "context": "Epic fail. You deserve the shame.",
                                                                                                                "good": "0",
                                                                                                                "bad": "0",
                                                                                                                "replies": [
                                                                                                                    {
                                                                                                                        "user_name": "RichardZZ",
                                                                                                                        "time": "18 March, 2021",
                                                                                                                        "context": "What shame? I was playing you.",
                                                                                                                        "good": "0",
                                                                                                                        "bad": "0",
                                                                                                                        "replies": [
                                                                                                                            {
                                                                                                                                "user_name": "ArneSaknussem",
                                                                                                                                "time": "18 March, 2021",
                                                                                                                                "context": "You made yourself the fool.\nNobody here will ever believe you again.",
                                                                                                                                "good": "0",
                                                                                                                                "bad": "0",
                                                                                                                                "replies": [
                                                                                                                                    {
                                                                                                                                        "user_name": "RichardZZ",
                                                                                                                                        "time": "18 March, 2021",
                                                                                                                                        "context": "Do I care?",
                                                                                                                                        "good": "0",
                                                                                                                                        "bad": "0",
                                                                                                                                        "replies": []
                                                                                                                                    }
                                                                                                                                ]
                                                                                                                            }
                                                                                                                        ]
                                                                                                                    }
                                                                                                                ]
                                                                                                            }
                                                                                                        ]
                                                                                                    }
                                                                                                ]
                                                                                            }
                                                                                        ]
                                                                                    }
                                                                                ]
                                                                            }
                                                                        ]
                                                                    }
                                                                ]
                                                            }
                                                        ]
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "Gloomycon",
                "time": "16 March, 2021",
                "context": "I'm not religious at all but I've found that atheists proselytize much more aggressively than people of faith. It's almost as if atheists doubt their faith.",
                "good": "12",
                "bad": "2",
                "replies": [
                    {
                        "user_name": "RichardZZ",
                        "time": "16 March, 2021",
                        "context": "I do here at Fox because this is the belly of the beast as far as finding the unhinged faithfuls.",
                        "good": "1",
                        "bad": "3",
                        "replies": []
                    }
                ]
            },
            {
                "error": "error"
            }
        ]
    },
    {
        "user_name": "Golden_Comb_Over",
        "time": "15 March, 2021",
        "context": "I am surprised the anarchists haven't found something in her past that would make her cancellable.",
        "good": "11",
        "bad": "11",
        "replies": []
    },
    {
        "user_name": "nicki5222",
        "time": "15 March, 2021",
        "context": "Wasn’t there any LSMFTD around to rush in claim they felt like a scientist and claim the prize?",
        "good": "1",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "kmartcorp",
        "time": "15 March, 2021",
        "context": "Is she being canceled?  She was a white supremacist wasn't she? LOL.  With this line of racist garbage being shoved down our throats 24/7 ... be honest ... isn't that the first thing that crossed your mind?",
        "good": "3",
        "bad": "6",
        "replies": [
            {
                "user_name": "gib2020",
                "time": "15 March, 2021",
                "context": "Not mine. Just yours.",
                "good": "5",
                "bad": "1",
                "replies": []
            },
            {
                "user_name": "BRBRBR8",
                "time": "16 March, 2021",
                "context": "Nope.",
                "good": "1",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "balatonian359",
        "time": "16 March, 2021",
        "context": "Women's History Month!\nHow much more worthwhile this is than black history month!\n.",
        "good": "2",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "balatonian359",
        "time": "16 March, 2021",
        "context": "The Woke Movement, the Cancel Culture, the Communist/Leftist/Socialist brigades are surely working on Madame Curie already. \nThey are hunting for something, anything to point out the in her heart of hearts she was a racist and did not like black people.\nIt is coming to you soon in the next editions of the New York Times, the Washington Post and the Huffington Post and other oh-so-liberal tabloids.\n.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "speed811499",
        "time": "16 March, 2021",
        "context": "Marie was actually black, so we are aloud to celebrate her accomplishments.",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "theodg",
        "time": "15 March, 2021",
        "context": "This was back when the \"Nobel\" actually meant something!",
        "good": "29",
        "bad": "5",
        "replies": [
            {
                "error": "error"
            }
        ]
    },
    {
        "user_name": "balatonian359",
        "time": "16 March, 2021",
        "context": "There are too few comments about this famous scientists. People born in the US are very ignorant about  European scientific achievements. They believe all major discoveries were made on American soil. But, practically all major scientific fundamentals originate from Europe and elsewhere. Americans could then use that knowledge base to build on it.\nAmerican ego is unbeatable.\n.",
        "good": "5",
        "bad": "5",
        "replies": [
            {
                "user_name": "dan6604",
                "time": "16 March, 2021",
                "context": "The USA spends most of their time inventing Military Weapons because the world won't defend themselves. It has been up to us to do it for them in the name of Global freedom.",
                "good": "1",
                "bad": "7",
                "replies": []
            },
            {
                "user_name": "MaybeMary",
                "time": "18 March, 2021",
                "context": "What you say is in the Sumption on your part. Americans are not stupid. We give credit where credit is due.",
                "good": "3",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "sjcomo",
                "time": "3 May, 2021",
                "context": "Your statement, in of itself, is ignorant.  I know no one that believes such a bombastic statement.  No one I've ever spoken with, or read, has ever uttered such things.  Kinda sounds like you have an axe to grind.  Oh well, haters are gunna hate!",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "tonks",
        "time": "16 March, 2021",
        "context": "THIS is what earning a Nobel Prize is about...not for just 'showing up' as someone did in 2009.",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "balatonian359",
        "time": "16 March, 2021",
        "context": "Only 54 comments during all these hours!\nIt is a shame how few people reading Fox News know about this world famous scientist.\nNo excuse!\n.",
        "good": "2",
        "bad": "0",
        "replies": [
            {
                "user_name": "dan6604",
                "time": "16 March, 2021",
                "context": "The only science most people care about today is finding life on other planets. \nReal science escapes them.",
                "good": "0",
                "bad": "4",
                "replies": [
                    {
                        "user_name": "ArneSaknussem",
                        "time": "16 March, 2021",
                        "context": "Real science completely escapes creationists.",
                        "good": "5",
                        "bad": "1",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "neverpoliticalbull",
        "time": "16 March, 2021",
        "context": "The world needs more Marie Curie's!\nThe world needs less politicians.",
        "good": "11",
        "bad": "1",
        "replies": [
            {
                "user_name": "letsgetrel",
                "time": "16 March, 2021",
                "context": "Fewer politicians, but point well taken.",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "DanielH5",
        "time": "15 March, 2021",
        "context": "Hundreds of people that worked for her died painful, early deaths. Even when it was apparent there were dangers she ignored the warnings and pushed on with the work.",
        "good": "1",
        "bad": "9",
        "replies": [
            {
                "user_name": "thekemist",
                "time": "15 March, 2021",
                "context": "Hundreds of people may have died from the commercial use of radium but they most certainly were not employed by the Curies not to mention the fact that the connection between radiation and DNA damage was unknown in the early 1900s.",
                "good": "15",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "patriot247365",
        "time": "15 March, 2021",
        "context": "She won two Nobel Prizes. At least she accomplished something unlike Dumbobama who wondered why he had won the coveted award.",
        "good": "30",
        "bad": "7",
        "replies": [
            {
                "user_name": "lycopine",
                "time": "15 March, 2021",
                "context": "Or \"W\" who would have won the Nobel WAR prize...",
                "good": "3",
                "bad": "13",
                "replies": []
            }
        ]
    },
    {
        "user_name": "Blindbeach",
        "time": "16 March, 2021",
        "context": "When the Nobel Peace Award meant something",
        "good": "12",
        "bad": "4",
        "replies": [
            {
                "user_name": "ArneSaknussem",
                "time": "16 March, 2021",
                "context": "She won the Nobel prize for physics and one for chemistry.\nThis has nothing to do with the Peace prize.",
                "good": "5",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "longdrive11",
        "time": "16 March, 2021",
        "context": "She never was good at playing hide-and-seek.",
        "good": "7",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "mofac",
        "time": "15 March, 2021",
        "context": "lol the trump trash don't understand science",
        "good": "5",
        "bad": "13",
        "replies": [
            {
                "user_name": "Gloomycon",
                "time": "15 March, 2021",
                "context": "And our critics don't understand capitalization and punctuation.",
                "good": "6",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "louietagooey",
        "time": "16 March, 2021",
        "context": "Can't wait until I hear the reasoning behind harris getting her Nobel Prize. It should be like obama getting his. Just for showing up and not being Bush.",
        "good": "7",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "dan6604",
        "time": "16 March, 2021",
        "context": "That was back in the day when they actually gave it to people that deserved it.\nWhen you get a peace prize for funding, bowing to and laying down for your enemies it kind of loses its zeal.",
        "good": "2",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "rdsouza",
        "time": "15 March, 2021",
        "context": "Watch. Now some 'woke supremacist' (hat tip to Sen Scott. He deserves re-election for that one) body will note that Poland resisted socialism on their western front, and communism on their eastern front...and its all Marie's fault.",
        "good": "2",
        "bad": "9",
        "replies": []
    }
]