[
    {
        "user_name": "grot706",
        "time": "1 September, 2022",
        "context": "Success????",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "get.real",
        "time": "1 September, 2022",
        "context": "China is operating under a deadline here. During the Obama years, China achieved technological superiority over the American military as Obama cancelled one weapons research program after another. Specifically I mean hypersonic missile technology and antimissile defenses.\n\nWe are slowly catching up, but there must be great pressure on China to press their advantage while they still have it.  This is why they have been taking an aggressive posture in the South China Sea, capturing territory by military occupation like a game of Go.",
        "good": "14",
        "bad": "2",
        "replies": [
            {
                "user_name": "sadler66",
                "time": "1 September, 2022",
                "context": "lol",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "fair&amp;balanced678",
                "time": "1 September, 2022",
                "context": "There is some truth in your post.  Agree.",
                "good": "1",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "Burndcdown",
                "time": "2 September, 2022",
                "context": "Do you have The Facts on your Statement?",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "survivingpnw",
                "time": "3 September, 2022",
                "context": "Well said.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "thatchief",
        "time": "1 September, 2022",
        "context": "At the beginning of the Ukraine war Donald Trump, Tucker Carlson, and Fox News in general made NUMEROUS public statements about how Russia isn't the bad guys and isn't the aggressor and we shouldn't be critical of them. \n\nAre we about to get the same things from the same people but regarding China instead?",
        "good": "1",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "CyanBottle",
        "time": "1 September, 2022",
        "context": "The Three Gorges Dam is within range of Taiwan's missile systems. One Earth Penetrating Weapon (EPW, formal name of nuclear bunker buster) would elevate it several thousand feet.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "joe-knows-trump-won",
        "time": "1 September, 2022",
        "context": "Russia's faltering war?\n\nKiev's Kherson offensive has failed. Over 3000 Ukrainian soldiers have been killed since the start, hundreds of tanks and armored vehicles have been lost and Ukrainian forces have been pushed back to their starting points.\n\nNo wonder Kiev is making a desperate plea for civilians to sign up for service to go to Kherson to fight, Mykolaiv is broadcasting ads in desperation for blood donations and doctors and nurses in Odessa are breaking down in tears as the sheer numbers of wounded Kiev Nazis pouring into the hospital for treatment for their wounds.",
        "good": "1",
        "bad": "7",
        "replies": [
            {
                "user_name": "beatairforce038",
                "time": "1 September, 2022",
                "context": "Nonsense.  Over 5000 Russian soldiers have been killed and wounded in Ukraine's offensive.  157 Russian tanks have been destroyed, and over 100 artillery pieces.\nYou're telling the story backwards.",
                "good": "5",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "whatishuman485",
                        "time": "1 September, 2022",
                        "context": "Thanks ghost of Kherson!",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "beatairforce038",
                                "time": "1 September, 2022",
                                "context": "My information is just as believable as his.",
                                "good": "1",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "alupchuk",
                "time": "4 September, 2022",
                "context": "russian bot",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "travestar869",
        "time": "1 September, 2022",
        "context": "Biden may give $50 billion to Taiwanese dead-enders.\nChina should prepare for a months long fight.",
        "good": "2",
        "bad": "3",
        "replies": [
            {
                "user_name": "fair&amp;balanced678",
                "time": "1 September, 2022",
                "context": "And let's say you are right and the Communist Chinese Party \"take\" Taiwan after a protracted fight.   There will nothing left of value for them to celebrate.  A hollow \"victory.\"",
                "good": "1",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "travestar869",
                        "time": "2 September, 2022",
                        "context": "A Pyrrhic victory one might say.",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "Burndcdown",
                "time": "2 September, 2022",
                "context": "Dam! The Man with the Plan! Sign Him Up!",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "fordprefec",
        "time": "1 September, 2022",
        "context": "I have a wakeup call for you. Russia is not losing in Ukraine. They are fighting a long-term conflict. Ukraine simply doesn't have the resources to fight a long-term conflict and Russia does. Putin is simply waiting them out and wearing them down. In the long-haul, Russia is going to eventually win. As far as Tiawan is concerned, Biden and his son Hunter are up to their eyeballs in the pockets of the Chinese. When China invades Tiawan (and they will because of Biden's weakness) Biden will talk tough and try to convince the world that he is going to do something about it. However, in the end he will do what his Chinese masters tell him to do, which is nothing of any substance.",
        "good": "5",
        "bad": "6",
        "replies": [
            {
                "user_name": "beatairforce038",
                "time": "1 September, 2022",
                "context": "Go back to sleep.\nRussia is going to run out of gas in Ukraine.\nI don't think the Russian military can maintain an offensive for six more months or even longer.",
                "good": "4",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "hamaichi01204",
                "time": "1 September, 2022",
                "context": "The current Administration seems to be behaving competently on both fronts.   Presently the US does not have the industrial capacity to fight an actual two front war.   We should be aware that one reason the US was able to unite NATO early on was because of the perception that the US is falling apart, which it may be as ex-Confederate states are on a path to secession.   That perception emboldens China also and is entirely a result of near-homicidal Republican politics.   In reality, the US would not be weaker if that happened, but stronger without that drain and gerrymandering.  The bought-out Republican Party is trying to overthrow the United States and its Constitution and has been for decades now.  Conservative, it's not.",
                "good": "0",
                "bad": "3",
                "replies": []
            },
            {
                "user_name": "fair&amp;balanced678",
                "time": "1 September, 2022",
                "context": "Russian BOT alert.  When they are not writing Fox posts supporting Trump or calling for civil war in America, they are busy lying about Ukraine and Putin's invasion.",
                "good": "1",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "fair&amp;balanced678",
                        "time": "1 September, 2022",
                        "context": "PS - Where is \"Tiawan?\"",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "randy4usa",
                        "time": "1 September, 2022",
                        "context": "Russian BOT?  You do know the Russian collusion is now known to be a dem plot, right?",
                        "good": "0",
                        "bad": "2",
                        "replies": [
                            {
                                "user_name": "hamaichi01204",
                                "time": "2 September, 2022",
                                "context": "There needn't have been any \"collusion\".   Russia did work for Trump because they calculated it to be in their interest.   It was the same plan we have seen unfolding in Ukraine more recently and it originally assumed more.  If Trump had achieved a second term, the norm, Russia would have had a much easier time of it in Ukraine and other former satellites as well all the way to the Baltic.   It is true that the US has greater strategic interest in Taiwan then Ukraine as the US is a Pac Rim country.  \n\nThere do seem to be posts on this site that have a foreign interest in mind, but they may not be bots.   Most of the bot-seeming posts here reflect US ultra Right views as on other popular sites and they appear very quickly.",
                                "good": "0",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "randy4usa",
                                        "time": "2 September, 2022",
                                        "context": "You remind me of Jerry \"Moonbeam\" Brown, lots of words, but no meaning.  There was collusion, now proven to be between the dems, Russia, and the FBI.  Bury your head in the sand, if you wish.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "randy4usa",
                "time": "1 September, 2022",
                "context": "Will Putin win?  Yeah, probably, just like Pyrrhus.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "murica572",
        "time": "1 September, 2022",
        "context": "Taiwan is America's base so we can keep China contained and see whatever they are doing close up.  We have Japan , South Korea, Taiwan, and the Philippines strategically placed on China's coast so we can always blockade China, if need be. The Chinese have demanded that Biden do something !",
        "good": "1",
        "bad": "1",
        "replies": [
            {
                "user_name": "beatairforce038",
                "time": "1 September, 2022",
                "context": "What U.S. forces are stationed on our Taiwan 'base'?",
                "good": "1",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "murica572",
                        "time": "1 September, 2022",
                        "context": "yes",
                        "good": "0",
                        "bad": "1",
                        "replies": [
                            {
                                "user_name": "beatairforce038",
                                "time": "1 September, 2022",
                                "context": "Don't be obtuse.",
                                "good": "0",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "murica572",
                                        "time": "1 September, 2022",
                                        "context": "Every other Taiwanese soldier is an American. Don't blab it all over the place!",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "beatairforce038",
        "time": "1 September, 2022",
        "context": "The Russian military has only been able to advance about 200 km beyond its border into Ukraine over six months while suffering massive losses in men and material.\n\nThe lesson China should take away from Russia's experience, especially since it would have to be an amphibious invasion, is to not do it.  Leave Taiwan alone, just as Russia should have done with Ukraine.",
        "good": "25",
        "bad": "3",
        "replies": [
            {
                "user_name": "FaithSeeker",
                "time": "1 September, 2022",
                "context": "Do we really want our military fighting with Biden as Commander and Chief? You seen his lack of leadership in Afghanistan. I pray for our military. Biden along with the Bushes, Cheneys, Clintons, and Obamas have caused nothing but destruction for our country. ",
                "good": "12",
                "bad": "2",
                "replies": [
                    {
                        "user_name": "beatairforce038",
                        "time": "1 September, 2022",
                        "context": "Separate issue from the article.\nI want neither the likes of Biden nor Trump as our next president in 2024.",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "WarsЯus",
                        "time": "1 September, 2022",
                        "context": "Biden wants a proxy war to knock down all our competitors in the far east.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "hamaichi01204",
                        "time": "1 September, 2022",
                        "context": "Bush II/Cheney, near to the least competent Presidency in US history, lost the war in Afghanistan by pulling resources from it for his trumped-up war in Iraq.   Obama tried a \"surge\" there, but it was too late as the Taliban were entrenched in Pakistan by then.   Actually, there was no reason to be there after al Qaeda was dealt with.  The US hasn't reformed and assimilated our own Confederate Culture Area in 150 years and some of the states are now in the process of seceding having become Evangelical Afghanistans.  Why do we think we can occupy and change countries in the Sand Trap?  \n\nThe Right never discusses Clinton's war in the Balkans.   That's because it was successful; results held for years.  So far, Biden's Administration and military seem to have done well in Ukraine and  backed Taiwan as necessary.   It's necessary to avoid a two-front war as the US does not have the industrial capacity to support it and our own military.  Of course, we know that most advanced weaponry depends on Taiwan's integrated circuit as our military has been aware of for years.   Also packaging and other services in other Pac Rim countries.  \n\nThe conduct of Intel also helped to shrink the US fab industry and progress in favor of their old \"x86\" devices.  They were fined after a trial  $500+ million in the EU and fined in Japan.  The US software industry so overused their H1-B cheaper labor for engineers/programmers that they seriously cut the domestic supply, especially women.",
                        "good": "0",
                        "bad": "1",
                        "replies": [
                            {
                                "user_name": "randy4usa",
                                "time": "1 September, 2022",
                                "context": "Bush didn't lose in Afghanistan, Obama took months to do the surge after the military requested it, the \"Confederate Culture\" exists only in your imagination, no states are attempting to secede, Biden CAUSED the war in Ukraine with his \"minor incursion\" comments.",
                                "good": "2",
                                "bad": "1",
                                "replies": [
                                    {
                                        "user_name": "hamaichi01204",
                                        "time": "2 September, 2022",
                                        "context": "Bush lost the opportunity to win in Afghanistan as the Taliban set up  untouchable in Pakistan.   He pulled substantial resources from Afghanistan for his bogus Iraq war.  \n\nThe existence of the US Confederate Culture Area is not arguable.  And we shouldn't forget - South Chicago isn't the place it is because so many people are black Americans.  It's the place it is because it's a piece of Dixie transplanted - Down Home hospitality.\n\nA few states, especially along the Gulf Coast, have set themselves up as Evangelical Afghanistans and thrown out much of the US Constitution.  They have thrown out the Establishment Clause and the Bill of Rights for women, half the population.  Their gerrymandering throws out Article 4, Section 4 and the 14th Amendment.  They are now debating surveillance and physical control of all women of child bearing age.   With today's US tech, even Afghanistan itself can't match them.   They are making it risky for anyone, especially Obstetricians, to practice medical care for women at all.  Since at least 10% of pregnancies end in miscarriages indistinguishable from abortions, they have turned all pregnancies, including wanted ones, into a lottery with persecution and dire harassment as the prize.\n\nA gun in every pocket and an M-16 in every house policies assure an ascending homicide rate from their already highest rates in the US.  It will increase the mass shooting rate as well.\n\nLet the Confederate states go.  We have to subsidize them too.",
                                        "good": "0",
                                        "bad": "2",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "user_name": "Virgil.the.Vegan",
                        "time": "3 September, 2022",
                        "context": "Do we really want our military fighting with fat donnie as Commander-in-Chief ?  We've all seen his lack of leadership  and patriotism at the Helsinki summit ...",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "son12",
                "time": "2 September, 2022",
                "context": "YAWN !!! Why has Putin not bombed the city Zelensky resides in since start of the invasion! No red flags popping up in your mind ! Yes I get it even Fox News seems to be asleep at the wheel here ! Furthermore according to Fox News Zelensky has been to the front lines on two occassions and \"handing out medals \" ! WOW !! Guess the fighting must not be too intense for that to happen ! Again another mystery !",
                "good": "0",
                "bad": "2",
                "replies": [
                    {
                        "user_name": "hamaichi01204",
                        "time": "2 September, 2022",
                        "context": "When Dwight Eisenhower ran for US President, one of his campaign promises was  \"I will go to Korea.\"  And he did.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "beatairforce038",
                        "time": "2 September, 2022",
                        "context": "Putin has never visited his troops.  \nThat’s because many of them want to frag him.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "ADaddy",
                "time": "2 September, 2022",
                "context": "Instead of Taiwan, take over vast areas of unprotected Russia instead.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "shruggingatlas",
        "time": "1 September, 2022",
        "context": "Biden continues to follow Obama's failed policies of throwing out allies and profiting from enemies.  The administration is throwing Israel and Saudi Arabia under the bus as \"Civil Rights Violators\" who supporting Iran and China, two of the most repressive regimes in the world.  Biden's Laptop is a smoking gun to direct payoffs from foreign adversaries which fully explains why he will not take actions necessary to protect American interests in the Pacific or anywhere else.",
        "good": "13",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "alfranken",
        "time": "1 September, 2022",
        "context": "All china has to do is a naval blockade. China has the biggest navy in the world thanks to American money and politicians like China Joe Xiden",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "mhbox4",
        "time": "1 September, 2022",
        "context": "China won't stutter step when they go in.",
        "good": "0",
        "bad": "2",
        "replies": [
            {
                "user_name": "WarsЯus",
                "time": "1 September, 2022",
                "context": "They've said what they will do. They said the Taiwanese leadership will not survive 24 hours.",
                "good": "1",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "beatairforce038",
                        "time": "1 September, 2022",
                        "context": "That was Putin's plan.  He failed.\nTaiwan has enormous bases under big mountains.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "WarsЯus",
                                "time": "1 September, 2022",
                                "context": "That was indeed Putin's plan, but the coup failed. Taiwan is a much smaller nut to crack. Only 5% of the area. Easily blockaded and pounded from every direction. Even if they don't manage to take out the leadership, the economic squeeze will collapse the economy in a matter of weeks.",
                                "good": "0",
                                "bad": "1",
                                "replies": [
                                    {
                                        "user_name": "beatairforce038",
                                        "time": "1 September, 2022",
                                        "context": "The trillion dollar question is whether Taiwan's neighbors and the U.S. would break an attempted blockade.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": [
                                            {
                                                "user_name": "WarsЯus",
                                                "time": "1 September, 2022",
                                                "context": "Biden will avoid direct conflict at all cost. He wants Japan, South Korea and Australia to fight China. That way, 5 competitors get knocked down, while in the west, all of Europe is getting less competitive.",
                                                "good": "1",
                                                "bad": "1",
                                                "replies": [
                                                    {
                                                        "user_name": "beatairforce038",
                                                        "time": "1 September, 2022",
                                                        "context": "I don't think Biden is coherent enough to think that way.  \nWhen you say \"competitors\" - with whom?  China?",
                                                        "good": "0",
                                                        "bad": "1",
                                                        "replies": [
                                                            {
                                                                "user_name": "WarsЯus",
                                                                "time": "1 September, 2022",
                                                                "context": "Japan, China, South Korea, Australia, and Taiwan.",
                                                                "good": "0",
                                                                "bad": "1",
                                                                "replies": [
                                                                    {
                                                                        "user_name": "beatairforce038",
                                                                        "time": "1 September, 2022",
                                                                        "context": "How are Japan, SK, Australia and Taiwan competitors to the U.S.?",
                                                                        "good": "1",
                                                                        "bad": "0",
                                                                        "replies": [
                                                                            {
                                                                                "user_name": "WarsЯus",
                                                                                "time": "1 September, 2022",
                                                                                "context": "You're kidding, right?",
                                                                                "good": "0",
                                                                                "bad": "0",
                                                                                "replies": [
                                                                                    {
                                                                                        "user_name": "beatairforce038",
                                                                                        "time": "1 September, 2022",
                                                                                        "context": "Enlighten me.",
                                                                                        "good": "0",
                                                                                        "bad": "0",
                                                                                        "replies": []
                                                                                    }
                                                                                ]
                                                                            }
                                                                        ]
                                                                    }
                                                                ]
                                                            }
                                                        ]
                                                    },
                                                    {
                                                        "user_name": "beatairforce038",
                                                        "time": "1 September, 2022",
                                                        "context": "Then why are we (the U.S. in my case), still conducting FON transits through the Taiwan Strait?",
                                                        "good": "0",
                                                        "bad": "0",
                                                        "replies": [
                                                            {
                                                                "user_name": "WarsЯus",
                                                                "time": "1 September, 2022",
                                                                "context": "Poking the dragon. And when it wakes up and the war starts, Biden will wail at the UN and pull hundreds of already prepared sanctions from his back pocket. He's riling up our vassal states and will supply them with weapons, but no way is he sending the 7th fleet to get sunk by China's carrier killer missiles.",
                                                                "good": "0",
                                                                "bad": "1",
                                                                "replies": [
                                                                    {
                                                                        "user_name": "beatairforce038",
                                                                        "time": "1 September, 2022",
                                                                        "context": "The PLAN fleet will be trapped in port by the US Navy and Japanese ships that you never see, the submarine force.",
                                                                        "good": "2",
                                                                        "bad": "0",
                                                                        "replies": [
                                                                            {
                                                                                "user_name": "WarsЯus",
                                                                                "time": "1 September, 2022",
                                                                                "context": "China's warships outnumber ours 360 to 300, and their subs outnumber ours 79 to 68. Theirs aren't nuclear powered so they don't have the range, but they are quieter than nuclear subs, and thus have an advantage. China's ship killer ballistic missiles give them an A2/AD that reaches out thousands of miles. So tangling with them will be a disaster.",
                                                                                "good": "0",
                                                                                "bad": "0",
                                                                                "replies": [
                                                                                    {
                                                                                        "user_name": "beatairforce038",
                                                                                        "time": "1 September, 2022",
                                                                                        "context": "I spent 7 years stationed in Japan, 4 of it on sea duty.\nThe U.S. and Japanese are well prepared to deal with the PLAN.",
                                                                                        "good": "1",
                                                                                        "bad": "0",
                                                                                        "replies": []
                                                                                    }
                                                                                ]
                                                                            }
                                                                        ]
                                                                    }
                                                                ]
                                                            }
                                                        ]
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "yo666",
        "time": "1 September, 2022",
        "context": "China and Russia should learn from history. \nRemember these words uttered after the attack on Pearl Harbor. \n\n“I fear all we have done is to awaken a sleeping giant and fill him with a terrible resolve.”—Admiral Yamamoto",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "WarsЯus",
                "time": "1 September, 2022",
                "context": "In this case the sleeping giant is China, and Biden has been poking the dragon to wake it up.",
                "good": "1",
                "bad": "3",
                "replies": []
            },
            {
                "user_name": "yankeedogg",
                "time": "1 September, 2022",
                "context": "\"I fear all we have done is to awaken a sleeping giant...\"\nWhat does Stacey Abrams have to do with this????",
                "good": "1",
                "bad": "1",
                "replies": []
            },
            {
                "user_name": "badtothebone",
                "time": "2 September, 2022",
                "context": "Except now China is the sleeping giant and they want Formosa back.",
                "good": "0",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "hamaichi01204",
                        "time": "2 September, 2022",
                        "context": "\"Back\"?  Their actual claims to Taiwan are thin and consist of a lot of invented history.  Through much of its history Taiwan was dominated by native people who are Austronesian, not East Asian or Chinese.   One of their tribal languages is distantly related to native Hawaiian from that great diaspora across the Pacific.   Farmers from Fujian province were settled in Taiwan in the 1620's by Dutch colonists who thought them more tractable and civil than the Taiwan natives.  The last pretender to the Ming dynasty fled to Taiwan with an army and kicked out the Dutch.   He died prematurely and an army from China defeated his son and took control.   Taiwan was governed from China until 1895 when it was ceded to Japan as minor in value after the loss of the 1895 war.   It was part of Japan till 1945 when the winners awarded it to the government of China at the time.  \n\nThey in turn lost the civil war with the Communists and fled to Taiwan, setting up Chang's Nationalist, Nanjing government there in 1949.   The Taipei government of Taiwan descends from that government, but the government has reformed and evolved and early on had reforms imposed on it.  AFAIK, the US regarded Chang as a crook and Mao as a monster.   Both views seem correct.   The Communists in Beijing have never run Taiwan; it's been run from China for 4 years in the last 105.  Taiwan is part of the Chinese Culture Area, but evolved away from China, and is now the only democracy in that history.",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "ADaddy",
                "time": "2 September, 2022",
                "context": "That is when he saw more US airplanes fly overhead than they believed existed in the world. Unfortunately, we no longer have that manufacturing ability, we use China for that now. Still, I'd like to think we can hold our own in a fist fight.",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "chuckt746",
                "time": "2 September, 2022",
                "context": "But that back in the day the US was a superpower, we had the factories as well as the will to mass equipment, and people who worked and volunteered to build and win two major wars, today we don't, no factories, no shipyards to build ships, people either don't want to work, or don't have the skills, a DOD that spends it's time discharging personal, teaching race hating, or speaking in pronouns, China reads the US news, they know what's happening and laughing about it behind our backs, no they' laugh out openly.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "guyfawkes1105",
        "time": "1 September, 2022",
        "context": "Lol, China is not going to attack either the U.S. or Japan.  They will just have to accept the general rule that you can attack the proxy but not the superpower behind the proxy--unless you want all out war with the superpower.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rightsidewins",
        "time": "1 September, 2022",
        "context": "we could win a war with china hands down just lacking leadership",
        "good": "1",
        "bad": "1",
        "replies": [
            {
                "user_name": "samuelwhittemore-1775",
                "time": "1 September, 2022",
                "context": "Don't underestimate our foe. Dangerous. Dems and Libs don't have the stomach. Or spine.",
                "good": "1",
                "bad": "2",
                "replies": [
                    {
                        "user_name": "rightsidewins",
                        "time": "1 September, 2022",
                        "context": "don lemon assured me",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "dumocratssuck!",
        "time": "1 September, 2022",
        "context": "Global Disarmament: “UN Peace Force”\nA direct affront to our Second Amendment, the 1961 State Department document entitled Freedom From War: The United States Program for General and Complete Disarmament in a Peaceful World is a call for all nations to disband their armed forces and turnover their military assets and weaponry to the UN, in order to establish a “UN Peace Force.” This “Freedom From War” and “UN Peace Force” proposal remains in effect as it has not been withdrawn.\nIf that was not troubling enough, another United Nations Agenda aims to rule over and strictly regulate your land, your education, your healthcare, and even your nutrition",
        "good": "0",
        "bad": "2",
        "replies": [
            {
                "user_name": "hamaichi01204",
                "time": "1 September, 2022",
                "context": "Nooooo, you are confusing them with the demons under Sunnydale.   Keep an eye on things though - Buffy is old and retired these days.   \n\nRepublicans can't replace the demons either, though they try.   Sarah Palin thought she could replace Buffy, but it hasn't worked out....",
                "good": "0",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "yankeedogg",
        "time": "1 September, 2022",
        "context": "Chia is all Blah-Blah-Blah....",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "beatairforce038",
                "time": "1 September, 2022",
                "context": "China literally has hundreds of millions of actual peasants to feed.\nIt has a Ponzi-scheme housing bubble which is about to explode.\nChina will not be much of a threat to anyone soon.",
                "good": "1",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "yankeedogg",
                        "time": "1 September, 2022",
                        "context": "I agree.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "hamaichi01204",
                        "time": "2 September, 2022",
                        "context": "Recently they shut down more industry with more Covid19 quarantines too,  and more has shut down because deadly drought has cut down available hydropower.   \n\nThe world price of food may go up in the coming months from drought-caused shortages more than the war.  It would be an error to treat that as inflation as it's an actual, real price increase.   Calling it inflation and crushing the US economy with interest rates would just put millions of people on pricier food stamps.   Another cause of price increases in the US is increasing Oligopoly or Monopoly in more and more markets and adding a layer of financialization and its profits to most markets.   The financialization has partly come from cash left over from the Trickle Down policies that are slowly looting and draining the real economy.  Interest rates don't deal with that either.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "ThePunisher",
        "time": "1 September, 2022",
        "context": "Of coarse China strengthened itself during the Obama presidency, That's because Obama was a very weak and non effective president!",
        "good": "3",
        "bad": "1",
        "replies": [
            {
                "user_name": "hamaichi01204",
                "time": "1 September, 2022",
                "context": "Most Americans appreciate that the Clinton and Obama Presidencies were the best of times and both cut back the Republican deficits and unemployment.  National Republicans are not Conservative and haven't been for decades.  Republicans only loot the economy in favor of our would-be Oligarchs, their funders, and subsidized corporations through their Trickle Down program.  \n\nI remind the rabid Republicans here that their President Trump  ran a record US government deficit in 2020 - $3.1 trillion - and had added to the Trickle Down program.  He actually subsidized billionaires with United States public debt.  Trickle Down so drains the real, demand driven US economy that Republicans have to run big deficits to keep the real economy from slow collapse.   That's not sustainable and a real cause of inflation.",
                "good": "1",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "Ccjohn",
        "time": "1 September, 2022",
        "context": "Do not compare China to Russia in terms of war. China has enough people they can just stand on Taiwan and sink the island.",
        "good": "2",
        "bad": "1",
        "replies": [
            {
                "user_name": "beatairforce038",
                "time": "1 September, 2022",
                "context": "Sort of like what the Marines were going to do to Guam, according to Hank Johnson....",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "bryozoan",
        "time": "1 September, 2022",
        "context": "The ONLY thing that will save Taiwan is if they have WMD's able to reach Shanghai !",
        "good": "2",
        "bad": "2",
        "replies": [
            {
                "user_name": "WarsЯus",
                "time": "1 September, 2022",
                "context": "That won't save Taiwan. It will result in its immediate and total destruction. Taiwan has a choice for its future: the Hong Kong path, or the Ukraine path. Hong Kong is one of the wealthiest countries/regions per capita, and has the highest longevity. Ukraine is the reverse.",
                "good": "0",
                "bad": "4",
                "replies": [
                    {
                        "user_name": "bryozoan",
                        "time": "2 September, 2022",
                        "context": "HK is now COMMUNIST !",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "hamaichi01204",
                        "time": "2 September, 2022",
                        "context": "China has ended the \"Hong Kong path\".  It is also concerned to obliterate whatever was culturally distinct about HK over time.  Taiwan has evolved away from China though it is still part of the Chinese Culture Area.  It's even become the only democracy in history in that area.   China would be very concerned to obliterate Taiwan's differences and might even largely replace its population.   They would need the foreign-educated population, but would restrict and never trust them.\n\nIn the case of HK, IMO, the US made a strategic error in not cherry-picking HK for at least a million people or more.   Actually, the US gained a lot from the refugees from Vietnam and they were whoever showed up on a boat, large or small.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "kpmcg",
                "time": "2 September, 2022",
                "context": "There is no guarantee that Taiwan does not have weapons of mass destruction, up to and including nuclear weapons. It certainly has the technological capacity to develop them and to develop the means of deiivering them.",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "ADaddy",
                "time": "2 September, 2022",
                "context": "Or friends that do.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "dcjj143540",
        "time": "1 September, 2022",
        "context": "China will  annihilate Taiwan. Russia should have waited and watched how the Chinese do it first. Taiwan is begging to be wiped from the map.",
        "good": "1",
        "bad": "3",
        "replies": [
            {
                "user_name": "beatairforce038",
                "time": "1 September, 2022",
                "context": "What good does that do China?  Of course, slaughtering 24 million Free Chinese on Taiwan is meaningless to the ChiCom regime.  China is a nation of barbarians.\nSort of like how Russia is \"liberating\" Ukraine....",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "maryah",
                "time": "1 September, 2022",
                "context": "You are wrong. Taiwan Island is very safe. Because China like to get the beautiful Taiwan island. China don't like to get the ruined Taiwan island.  China intends to acquire Chinese cultural relics and Taiwanese chip factories on the island of Taiwan. So China will not attack Taiwan Island. But China will attack Japan. According to the Chinese prophecy, the United States is both a friend and an opponent of China. I don't think the US will be attacked the most intensively by the Chinese empire like Japan.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "beatairforce038",
                        "time": "1 September, 2022",
                        "context": "A Chinese attack on Japan will result in a direct U.S. - China war.\nChina cannot afford that with its largest trading partner.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "WarsЯus",
                                "time": "1 September, 2022",
                                "context": "Why not? China views us as a deadbeat. We account for 15% of their total trade, and 2/3rds of it are products shipped to the US that we pay for in dollars that we don't want them to spend in the US (and in some cases Europe as well). They will have to cut us off eventually.",
                                "good": "0",
                                "bad": "1",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "user_name": "WarsЯus",
                        "time": "1 September, 2022",
                        "context": "Think blockade.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "beatairforce038",
                                "time": "1 September, 2022",
                                "context": "China blockade Japan?\nFat chance.",
                                "good": "0",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "WarsЯus",
                                        "time": "1 September, 2022",
                                        "context": "Taiwan, obviously.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": [
                                            {
                                                "user_name": "beatairforce038",
                                                "time": "1 September, 2022",
                                                "context": "Under what justification?",
                                                "good": "0",
                                                "bad": "0",
                                                "replies": [
                                                    {
                                                        "user_name": "WarsЯus",
                                                        "time": "1 September, 2022",
                                                        "context": "Why do you think they keep flying around Taiwan? They want Taiwan to shoot down one of their aircraft.",
                                                        "good": "0",
                                                        "bad": "0",
                                                        "replies": []
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "Pizzadragon",
                "time": "1 September, 2022",
                "context": "russia is winning..    lets see ukraine has more people living in other countries than its own,,, russia has taken land and yet all we hear about is this big counteroffensive that never has or will happen.     taiwan is another border dispute we should avoid",
                "good": "0",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "maryah",
        "time": "1 September, 2022",
        "context": "The Chinese missile army has indeed stepped up its missile manufacturing. The United States should be well aware of China's medium-range missiles and ICBMs. However, in the future, China will also speed up high-speed missiles. The faster any missile is, the less it will be intercepted by ground defenses. In fact, the Chinese prophecy is to warn the United States that China will attach great importance to the development of missiles. But it is more about ordering the Chinese embassy in the United States to go to American universities with a lot of money to recruit Chinese students to the United States. There are some technologies that are very welcome. Rocket technology, artificial intelligence, chip technology, automation technology. The United States must know the spying activities of the Chinese embassy in the United States on American soil.",
        "good": "12",
        "bad": "0",
        "replies": [
            {
                "user_name": "guyfawkes1105",
                "time": "1 September, 2022",
                "context": "Hypersonic missiles are great as long as your adversaries use missiles to shoot them down.  They are terrible if your opponent has lasers.  DoD is really underplaying the advantage that the U.S. has right now in laser development.  \n\nRonald Reagan is responsible for American leadership in military laser technology.  His \"crazy\" star wars idea was no folly.  \n\nSimilarly,  Trump's Space Force will be the tip of the spear in the coming years as it develops the capability to rain fire and brimstone from above.",
                "good": "13",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "ChillWills",
                        "time": "3 September, 2022",
                        "context": "Look for if not already deployed.....Space based Lasers...",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "trevornosletrab",
                        "time": "3 September, 2022",
                        "context": "Lasers work great as long as it's not cloudy or worse yet (foggy). Then they are useless!\n\nBoth space-based and ground-based lasers can be defeated by weather!\n\nThere are atmospheric hypersonic missiles that cannot be hit by ground-based lasers on a cloudy day and hypersonic cruise-missiles that cannot be hit by space-based lasers on a cloudy day.\n\nThere are seasons in certain parts of the world where laser based missile defense would be useless for most of the season.\n\nThat means we need anti hypersonic missile technology besides laser-based missile defense. We need a back-up or better primary system.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "nagurski",
                "time": "2 September, 2022",
                "context": "We have nuclear weapons already in every major city in the world. We do not need a delivery system. Delivery systems are for show and distraction.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "hitemp",
        "time": "1 September, 2022",
        "context": "Joe thinks green energy will turn everyone into pastoral sheep.",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "OliveDucky",
        "time": "1 September, 2022",
        "context": "Some people are not trainable? Russia & China for example? They are repeating the exact same mistakes as Germany & Japan, last century. The are doomed to repeat the ending too?",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "lookslikeaduck352",
        "time": "1 September, 2022",
        "context": "In a fight, China would have a powerful opening with good technology and massive resources, but in time, it would come down to the individual soldier's will to fight. China has never won a foreign war in 2000 years. They do not have a warrior culture. Dying in conflict and not perpetuating the family is still considered shameful, and with the long-standing one-child-only policy, it is even more critical. It makes a difference.",
        "good": "9",
        "bad": "0",
        "replies": [
            {
                "user_name": "fair&amp;balanced678",
                "time": "1 September, 2022",
                "context": "Can understand why people are ready to sacrifice for freedom, high ideals, democracy.  But why would anyone sacrifice their life for the Communist Party elite?",
                "good": "15",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "lookslikeaduck352",
                        "time": "1 September, 2022",
                        "context": "True believers do, but that phase of communism has passed. The regime cannot expect public support for a war against us.",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "jrx770",
                        "time": "2 September, 2022",
                        "context": "Because the true believers have a gun at your back making sure you tow the line.",
                        "good": "3",
                        "bad": "1",
                        "replies": [
                            {
                                "user_name": "fair&amp;balanced678",
                                "time": "2 September, 2022",
                                "context": "History shows that can work in the short term but never in the long term.  There is a basic human thirst for freedom.  At least in my humble view.",
                                "good": "1",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "user_name": "ADaddy",
                        "time": "2 September, 2022",
                        "context": "Other than that they threaten to imprison and torture your family if you don't",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "mark08859",
        "time": "1 September, 2022",
        "context": "That third rule just might be the start of WW3.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "der-tod",
        "time": "1 September, 2022",
        "context": "Two destroyers in the Indian Ocean stopping all oil tanker traffic to mainland china and its game over for them.",
        "good": "1",
        "bad": "1",
        "replies": [
            {
                "user_name": "WarsЯus",
                "time": "1 September, 2022",
                "context": "China's ballistic ship killers have the range to hit ships in the Indian Ocean, all the way to the Persian Gulf, and they are getting all the oil that Russia is not selling to Europe. By pipeline.",
                "good": "1",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "der-tod",
                        "time": "1 September, 2022",
                        "context": "Right....LOL",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "ralph56",
        "time": "1 September, 2022",
        "context": "If you are going to write such articles you need to understand the nature of war.  Wars are  won by the country that can out produce the other in wartime material needs. Russi is no CHina. CHina has the capability at this point to outproduce the USA Thanks to CLueless Joe nobody works anymore and it will be just a short time before China exerts their influence over most of the world Thank the  clueless democrats",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "whatishuman485",
        "time": "1 September, 2022",
        "context": "Thanks to Obama/Bidens coup in Ukraine in 2014,  Russia now encompasses Crimea and over 20% of Ukraine landmass.   Europe panicking over a deep freeze.  China learned that Russian fuel is affordable and the west is too deindustrialized to win a battle against a limited special operation.   NATO collectively donating to the point the cow is dry and Russia keeps out producing arms and grinding away all within range.",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "WarsЯus",
        "time": "1 September, 2022",
        "context": "The lesson from Ukraine is that Russia is awash in cash while Europe is struggling to make ends meet. Biden's war has been a disaster, and his war in the far east will be a bigger disaster.",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "quidmevexari",
        "time": "1 September, 2022",
        "context": "Its real simple.  Just \"loan\" Taiwan a couple hundred tactical nuke missiles and only release the launch codes if attacked.  A little MAD goes a long way.  Should probably do the same thing for Japan and South Korea but they might use them on each other.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "frankdrafman",
        "time": "1 September, 2022",
        "context": "Reality Check:  China is no match for us just like the Russians would never be.  The Chinese military has absolutely no fighting experience and their equipment generally sucks.  Like the Russians, they have not been in a war against a capable opponent in many decades. They have no battle hardened troops at all, their pilots have no combat experience and they have absolutely no capacity to deliver war anywhere outside their boarders unless they are attacking hapless Magyars or Nepalese.  Meanwhile, America has always been a warrior nation with very few year spans when we are not fighting someone either next door or on the other side of the globe.  China can only bluster and they know it ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jolantru",
        "time": "1 September, 2022",
        "context": "Any attempted invasion of Taiwan/ROC will make Gallipoli, Iwo Jima, and Okinawa seem like cakewalk.\nThe Terrain, amphibious logistics, and the fact that Taiwan has modern weapons of every stripe ensures a debacle for Xi. He has of course offered the 1 nation, 2 governments option and was laughed out of town.",
        "good": "14",
        "bad": "0",
        "replies": [
            {
                "user_name": "basicreality",
                "time": "2 September, 2022",
                "context": "China has a population of 1.4 billion. The vast majority of those are borderline poor. The economical stress that China would go through in financing the war and loss of international exports will probably throw it into internal disarray. Trust me, if this was not the case China would have already invaded Taiwan.",
                "good": "5",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "badtothebone",
                        "time": "2 September, 2022",
                        "context": "Yes and the people want Formosa back. Just a matter of time before they act.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "rgcheek58",
                                "time": "2 September, 2022",
                                "context": "then they are delusional",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            },
                            {
                                "user_name": "Unicorncycle",
                                "time": "7 September, 2022",
                                "context": "Actually the people want mainland China back from the occupying communist forces, the most murderous regime the world has ever known.",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "user_name": "rgcheek58",
                        "time": "2 September, 2022",
                        "context": "There is in China a tradition that if the government is too disastrous (too many die from plague, drought, starvation, democide, etc) then the government has lost the 'Mandate of Heaven' and they then consider it not legitimate and they over throw it.\n\nAny Taiwanese strategy must include this as the terminating condition; inflict enough casualties to make its citizens think the government is no longer blessed and sanctioned by 'Heaven'.",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "ChillWills",
                        "time": "3 September, 2022",
                        "context": "You make a very valid point !",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "jtgcs",
                "time": "2 September, 2022",
                "context": "The only perfect time to have attacked Taiwan was when Nancy Pelosi took a visit there. Missed window of opportunity for both sides of the Pacific.",
                "good": "1",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "TexasSniper",
                        "time": "2 September, 2022",
                        "context": "😂😂😂🇺🇸🇺🇸🇺🇸",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "TexasSniper",
                "time": "2 September, 2022",
                "context": "China has zero experience in amphibious and airborne warfare and there won’t be a learning curve.  A large amphibious operation is about the most difficult operation a military force can be asked to perform.",
                "good": "8",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "fbi314159",
                "time": "2 September, 2022",
                "context": "I can't imagine why Taiwan wouldn't go for the one nation two systems option...  It worked so well for Hong Kong...",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "jolantru",
                        "time": "2 September, 2022",
                        "context": "Xi did offer it and was laughed out of town.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "inplainsight",
        "time": "1 September, 2022",
        "context": "Once the manufacture of the advanced chips is moved to other countries the importance of a democratic Taiwan will wain.  China always plays the long game. In a few more years, Taiwan will be on its own and China will have more votes in the UN because of their Belt and Road initiative.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "ADaddy",
                "time": "2 September, 2022",
                "context": "No. The waterways and deep water ports that convey with ownership of Taiwan are significant. Also, it makes a great aggressive base against other neighbors.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "inplainsight",
                        "time": "2 September, 2022",
                        "context": "Let's hope you are correct. I would love to be wrong on this one.",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "cajuntransplant",
                "time": "3 September, 2022",
                "context": "China's long gain....you are correct. They plan in decades.\nThe US plans in daily Stock Market closing numbers, quarterly earnings and end of year reports.\nTHAT is why China's has been one of the most positive economies for decades. Their government is doing what is best for their nation (economically, that is) while the US government is in it for themselves, NOT the nation.....and that many on BOTH sides of the aisles.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "uncommmonsense",
        "time": "2 September, 2022",
        "context": "In July 2021, China threatened Japan with nuclear annihilation.  “We will use nuclear bombs first. We will use nuclear bombs continuously. We will do this until Japan declares unconditional surrender for the second time.\"  That is beyond terrifying. And Joe Biden is on the CCP payroll.",
        "good": "2",
        "bad": "1",
        "replies": [
            {
                "user_name": "hamaichi01204",
                "time": "2 September, 2022",
                "context": "Your line about Biden is total nonsense.  If you or your peers try to overthrow the US and the Constitution by force you will lose badly.  That line can't be part of the cover story.\n\nIf China did that it would very unfortunate with instant nuclear war with the US which would likely end with a mostly uninhabitable US west coast west of the Rockies and an end to civilization in and much of the population of China, with most of the rest gone from famine soon enough.  It would not be in Russia's interest to back them up, quite the contrary.  We may hope that cooler heads prevail as they occasionally have in the past.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "46vintage",
                        "time": "2 September, 2022",
                        "context": "Why would only the west coast of America be affected by a war with China ?",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "nagurski",
        "time": "2 September, 2022",
        "context": "If China was really smart they would lay off Taiwan for now. They have so many irons in the fire why jeopardize them now for just Taiwan? Sooner or later Taiwan will want to be part of.",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "beatairforce038",
                "time": "2 September, 2022",
                "context": "Why would Free Chinese in Taiwan want to join in with hundreds of millions of brainwashed Chinese peasants?",
                "good": "1",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "republicofalberta",
                        "time": "2 September, 2022",
                        "context": "A handful of oligarch families own everything worth owning in Taiwan and everyone else would be jealous of the living conditions Mexican migrant farm workers enjoy. For 99.99999999999% of the population life in places like Taiwan or North Korea offers zero opportunities to advance oneself. That's why if any make a reasonable amount of money they cash out and run....",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "hamaichi01204",
                                "time": "2 September, 2022",
                                "context": "Sound like you haven't been in Taiwan for decades.",
                                "good": "1",
                                "bad": "1",
                                "replies": [
                                    {
                                        "user_name": "republicofalberta",
                                        "time": "2 September, 2022",
                                        "context": "I was last in Taiwan in 2018. There were ZERO opportunities for non oligarchs beyond little hustles on the periphery of new sectors. If any of those peripheries bloomed you had two options:\n\n1. Sell a controlling stake to oligarchs at an unbelievable price.\n\n2. Be regulated out of business by the oligarch controlled regime.\n\nI was actually there to see if it was feasible to help such an upstart flee to China. In the end, he smuggled what he could to China and then sold the company to the oligarchs who promptly issued  treasury stock to all their helpers in the regime... No worries though, the entrepreneur is soon going to have enough money to hire his own mercenary company to lead the assault on Taiwan when the time comes.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "user_name": "nagurski",
                        "time": "3 September, 2022",
                        "context": "If you start with their children in schools you can have it in one generation. Sound familiar?",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "jtgcs",
                "time": "2 September, 2022",
                "context": "Was that a joke? Biden is the weakest President right now for the perfect strike. China wouldn't even think about it when Trump was in office.",
                "good": "0",
                "bad": "1",
                "replies": []
            },
            {
                "user_name": "ADaddy",
                "time": "2 September, 2022",
                "context": "If China wooed Taiwan instead of demanding and threatening, it would be more effective.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "beatairforce038",
        "time": "2 September, 2022",
        "context": "I live in east LA County with many Chinese neighbors and friends.  \nThey got the heck out of China for many good reasons.",
        "good": "2",
        "bad": "1",
        "replies": [
            {
                "user_name": "badtothebone",
                "time": "2 September, 2022",
                "context": "Yes, I too know people that swam out of China via Hong Kong and are now US citizens. I believe Taiwan is in a terrible place as with Biden I suspect that China will see this as the time to take back Taiwan.",
                "good": "0",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "beatairforce038",
                        "time": "2 September, 2022",
                        "context": "I just don’t think they can do it.",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "markxyz",
        "time": "2 September, 2022",
        "context": "If China goes into Taiwan and we get involved our supply lines will disappear. We manufacture almost nothing here. We will be in a big, big mess! ",
        "good": "4",
        "bad": "0",
        "replies": [
            {
                "user_name": "bfanley1",
                "time": "2 September, 2022",
                "context": "The truth is both economies would collapse, which is why it won’t ever happen",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "socialismthedeathknelloffreedom",
        "time": "2 September, 2022",
        "context": "Given another year or so and China can see how Russia fares in their land grab, hopefully it gives them pause. I expect Russia to fail simply because it has little Russian support among non putin loyalists. Non putin loyalists fall out of hospital windows in tragic and fatal accidents.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bfanley1",
        "time": "2 September, 2022",
        "context": "China has not had any real military campaign since WWII. Theoretical fighting is vastly different than actual experience, where the US has had endless real world fighting. This will be a huge disadvantage for China",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "son12",
        "time": "2 September, 2022",
        "context": "Get your head out of the sand ! Why is no one asking the question I have for past 4 months now when it comes to Ukraine ! My question: Why is it since the invasion the only city not at all touched by Russian ground troops and Russian planes is the city Zelensky resides in question mark ! So safe Nancy Pelosi and company and UKs leader and many others have gone to to meet Zelensky and smooze with him ! Again why does Putin not give one rip about Zelensky and Ukraines capital yet narrative still the same Russia trying to take over Ukraine ! Too many red flags here ! I say Putin and Zelensky has struck up some underhanded deal etc !!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "civilwarisinevitablenow",
        "time": "2 September, 2022",
        "context": "Russia has already won in Ukraine.  Ukraine is like a tree that doesnt know its dead yet.",
        "good": "1",
        "bad": "1",
        "replies": [
            {
                "user_name": "sociallydistancedalready",
                "time": "2 September, 2022",
                "context": "So this is what victory looks like?",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "civilwarisinevitablenow",
                        "time": "2 September, 2022",
                        "context": "My brother had a beautiful tree is his front yard.  It started looking a bit sickly so he called an arborist to look at it. He said it was dead and just didnt know it yet.  It looked far from dead.  But sure enough in a years time, it was dead.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "my_thoughts_today",
                                "time": "5 September, 2022",
                                "context": "So have you specifically asked your brother's arborist about Ukraine, or is this your own uneducated guess?",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "my_thoughts_today",
                "time": "5 September, 2022",
                "context": "Actually, Russia looks sickly. I think it's days are numbered. I've worked with trees for years so I would know.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "civilwarisinevitablenow",
                        "time": "5 September, 2022",
                        "context": "Again with the leftist ideals.  If you say something and believe hard enough, it makes it true. ",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "son12",
        "time": "2 September, 2022",
        "context": "Fox News had a headline story when the invasion happened ! \"Putin hires hundreds of mercenaries to hunt down Zelensky\" ! Boy what a bogus story !! Everyone and his brother knows where Zelensky is while he wines and dines world leaders and world politicians on a dizzy daily basis ! Heck Senators Lindsey Graham and his Dem buddy came to town and Nancy Pelosi and gang showed up and UK s leader came to town as well and there was a rock concert one night in Zelenskys home town ! Boy this has been one tough war they are fighting !!! HMMMMM ! Just saying !",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jalistair586",
        "time": "2 September, 2022",
        "context": "If China decides their Taiwan policy based upon lessons from the Ukraine/Russia war, they will surely invade Taiwan after seeing the success Russia has and continues to have in Ukraine.  Russian moral is high, their artillery is well supplied and outguns their Ukrainian counterparts even after being supplied by western powers.  The Ruble is strong, Russia is swimming in cash as energy and food prices skyrocket.  Oh, and they now control over 14 trillion dollars worth of Ukrainian natural resources.  Russia is winning while the United States, the UK, and Europe is losing.",
        "good": "4",
        "bad": "3",
        "replies": [
            {
                "user_name": "oh'scereal",
                "time": "4 September, 2022",
                "context": "7 months in. \n\nJust like Putin planned it.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "fastidious1",
        "time": "2 September, 2022",
        "context": "China will just go to war in order to keep it's leadership from losing face and position. It needs to kill off a lot of it's own population just to keep it's own peace. It needs a reason to \"fix\" inflation. Taiwan just doesn't have the resources to fight. It would not be the six day war but the five minute war. Shorter, if biden has anything to do with it.",
        "good": "3",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "texas505356784",
        "time": "2 September, 2022",
        "context": "Well - if Xi wants Taiwan - now is the time while Brandon is POTUS?  This chance may not come around for a while.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "socialismthedeathknelloffreedom",
        "time": "2 September, 2022",
        "context": "\"Third, expect that Taiwan will have friends — attack American and Japanese forces in the region that might interfere with an invasion.\"                                                                                                              Their won't be a fourth as the third starts world war three.",
        "good": "3",
        "bad": "0",
        "replies": [
            {
                "user_name": "beatairforce038",
                "time": "2 September, 2022",
                "context": "That would be on China",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "socialismthedeathknelloffreedom",
                        "time": "2 September, 2022",
                        "context": "Yes it would be, yet it still starts WW3 and once started it could escalate to nuke use. The authors suggestion that China attack the US and allied ships in the area was my point as advising China to attack US an allied fleets in the area would definitely lead to war with China. If China believes they could gain from such an attack they are clueless. I don't see such an attack as anything other than mutual assured destruction. She may be correct militarily though I doubt it, politically it's insanity.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "rckymtn4",
        "time": "2 September, 2022",
        "context": "If seizing Taiwan (no sure bet) will allow China to threaten Japanese and South Korean trade routes, the reverse is also true, so if a war with Taiwan, the worldwide sanctions that go with it, don't sink China,, the collapse of their export-based will surely do it.",
        "good": "3",
        "bad": "1",
        "replies": [
            {
                "user_name": "republicofalberta",
                "time": "2 September, 2022",
                "context": "😂🤣 You think you see empty shelves now? Try to stay alive for a while week using nothing made in China. You could, if you have the foraging skills and find a cave  to live in....",
                "good": "1",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "rckymtn4",
                        "time": "2 September, 2022",
                        "context": "Food from China? None.\nFuel from China? None.\nCheaply made trinkets from China. Many.\n\nI'm good.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "TheRepublicMatters🎬",
        "time": "2 September, 2022",
        "context": "Probably war isn’t the best way to go about things.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bobo77777",
        "time": "2 September, 2022",
        "context": "Dementia Joe's too busy working on getting the lumps out of his cream of wheat.",
        "good": "2",
        "bad": "1",
        "replies": [
            {
                "user_name": "46vintage",
                "time": "2 September, 2022",
                "context": "True story , the real funnies on here are the ones keep saying Joe does this and Biden does that ( like Laura Ingraham ) .",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "badtothebone",
        "time": "2 September, 2022",
        "context": "No need to invade, Just use mobile missiles every few days on military targets. No body will bring ships to port and no one will fly in or out of Taiwan. About 98% of their resources including most of their energy is imported. In just few weeks they will surrender. The island is one of the most heavily populated areas in the world. SIEGE attacks work well as their strength of being an island fortress works against them.",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "beatairforce038",
                "time": "2 September, 2022",
                "context": "Taiwan’s important military installations are inside of mountains. \nThey’ve been preparing for the ChiComs for decades.",
                "good": "0",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "badtothebone",
                        "time": "2 September, 2022",
                        "context": "Then they will starve to death in their mountains.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "beatairforce038",
                                "time": "2 September, 2022",
                                "context": "China won’t last ten years.  \nThe Taiwanese will never give up.",
                                "good": "0",
                                "bad": "1",
                                "replies": [
                                    {
                                        "user_name": "badtothebone",
                                        "time": "2 September, 2022",
                                        "context": "That what people said about Hong Kong.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": [
                                            {
                                                "user_name": "beatairforce038",
                                                "time": "2 September, 2022",
                                                "context": "They weren’t willing to fight. \nAnd now Hong Kong has been ruined. \nThe Taiwanese will fight.  \nHard.",
                                                "good": "0",
                                                "bad": "0",
                                                "replies": []
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "basicreality",
                "time": "2 September, 2022",
                "context": "That might be true if nobody else in the world were to interfere. But the rest of the world is so much invested in Taiwan that all sort of sanctions and possibly military intervention is very, very likely. Trust me, if this was not the case China would have already invaded or attacked Taiwan.",
                "good": "1",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "badtothebone",
                        "time": "2 September, 2022",
                        "context": "Only a handful of countries recognize Taiwan. The UN does not. Military intervention will not be possible, the US see Taiwan as part of China. China has made it clear that they want Formosa back.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "beatairforce038",
                                "time": "2 September, 2022",
                                "context": "China would get a broken nose if it tries to take over Free Taiwan.",
                                "good": "0",
                                "bad": "1",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "user_name": "jalistair586",
                        "time": "2 September, 2022",
                        "context": "The only nation (other than Russia and India) that could even interfere militarily is the Untied States.  I don't think China has anything to fear from us.",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "jrcowboy49",
        "time": "2 September, 2022",
        "context": "China's leader XI, has already stated in his annual statement for China's military, prepare for war with the USA! If the US is not preparing for same with adequate offensive firepower enough to destroy China's military capability then expect another \"Pearl Harbor.\" China only understands offensive firepower and lightning strikes. We better have a \"real threat\" capability and prepared to use it with our included allies, Australia, Japan, South Korea, Taiwan, India, and VietNam. And the USA needs to provide them with nuclear missiles for their defense, especially Taiwan! SI's call to prepare for War should not be taken lightly or you have already lost the fight! All need to be strengthening their offensive firepower capability like yesterday and stand ready to use it instantly. Get hot or go home!",
        "good": "0",
        "bad": "1",
        "replies": [
            {
                "user_name": "vaperdave",
                "time": "2 September, 2022",
                "context": "Let's just hope the guys who have eyes on the US radar are not in Diversity Class that day.",
                "good": "3",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "ambiguous",
        "time": "2 September, 2022",
        "context": "Its Geography. Taiwan has no close 'allies' like Ukraine and there is no land resupply capability. If China wants Taiwan enough, China can get Taiwan. They'd have to face the backlash though so I think more than Russia/Ukraine their example is the Democrat party in the US. Democrats have been in control for 13/4 years with disastrous results yet through demagoguery and disinformation have managed to make their powerless opponents out to be the culprits. If China can do that, there will be no issue with Taiwan.",
        "good": "3",
        "bad": "1",
        "replies": [
            {
                "user_name": "hamaichi01204",
                "time": "2 September, 2022",
                "context": "If you want to discern what Republicans are up to, just look at what they accuse their opponents of, even the Republicans that are not trying to overthrow the United states and its Constitution.   Old story and Journalism 101.   And check out the religious fanatics on the McConnell Court and the states becoming Evangelical Afghanistans..",
                "good": "1",
                "bad": "7",
                "replies": [
                    {
                        "user_name": "socialismthedeathknelloffreedom",
                        "time": "2 September, 2022",
                        "context": "Nonsense.",
                        "good": "3",
                        "bad": "1",
                        "replies": []
                    },
                    {
                        "user_name": "onlyeng",
                        "time": "2 September, 2022",
                        "context": "Off your drugs for today?",
                        "good": "1",
                        "bad": "1",
                        "replies": [
                            {
                                "user_name": "hamaichi01204",
                                "time": "2 September, 2022",
                                "context": "Nothing but invective and name calling?   Doesn't that suggest that my post is correct?",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "error": "error"
                    }
                ]
            },
            {
                "user_name": "groovdog",
                "time": "2 September, 2022",
                "context": "There hasnt been a significant amphibious assault in 70 years (Inchon). You underestimate what it would take and how telegraphed this would be. And you dont need to be local. The combined air forces/navies of the West would take a huge toll. I assume of course that the West doesnt want to lose its access to chips and would fit for it.",
                "good": "2",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "ambiguous",
                        "time": "2 September, 2022",
                        "context": "Hmm. Thanks for the thoughtful reply. Agreed it would not be easy but I'm not sure the West would go to war over Taiwan. At least not the current West. But in any case, I still think logistics are in China's corner. And there are a LOT of Chinese. Oh BTW, Taiwan does make IC's but very little they make cant easily be made elsewhere. The real proprietary stuff, AMD, Intell, Ti, Samsung etc. are all fabricated in their respective countries for IP reasons. The chips bill wont pull fabrication from Asia, it will just help domestic companies build what they would have anyway.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "badtothebone",
                        "time": "2 September, 2022",
                        "context": "No need to invade just a siege.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "navymustang292",
        "time": "1 September, 2022",
        "context": "China? Really? China is ruthless to it's own population. Killing their own defenseless people comes easy to them. They have had little regard for human life within China's borders. The last \"REAL\" war China was involved with excluding the Boxer rebellion was fought with Black power, wooden sticks and wooden ships. It will be a very telling scenario when the adversary shoots back at troops & aircraft. China may have stolen a significant technical advantage however, China has little or NO COMBAT TESTED forward operating experience. China has partnered up with the likes of Putin to test their weapons looking to improve them.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "socialismthedeathknelloffreedom",
                "time": "2 September, 2022",
                "context": "Well a million Chinese came over what is now the N.Korean border in the early 50's, so there's that. Taiwan needs to make sure that China can't land troops, mine their harbors and basically make it a fortified island. It can still be starved out but you can make an invasion not worth the cost if you try hard enough. My worry is if Taiwan has the fight in them .",
                "good": "2",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "onlyeng",
                "time": "2 September, 2022",
                "context": "Exactly.  Just in the last couple of years, China \"sacrificed\" tens or hundreds of thousands of it's elderly, sick and unproductive comrades to a modified virus, just to gather biological warfare data",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "averageamerican1126",
        "time": "1 September, 2022",
        "context": "While they are training in war games in Moscow with India and a couple other country’s. Fox News give me a break, quit with your cowardly wars in the Middle East and brace for a major war against the east.",
        "good": "1",
        "bad": "1",
        "replies": [
            {
                "user_name": "ranger231674",
                "time": "1 September, 2022",
                "context": "Huh?",
                "good": "2",
                "bad": "1",
                "replies": []
            },
            {
                "user_name": "hamaichi01204",
                "time": "2 September, 2022",
                "context": "It's interesting that 3 countries in the wargames Russia, China, and India are also potential adversaries.  They may bring as many intelligence people as soldiers.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "toros2700",
        "time": "2 September, 2022",
        "context": "Russia isn't the one who started the war. But what ever Joe says. What's that other article about was the sacrifice worth it? Look at Ukraine. Russia didn't start this war. Just like Crimea. So get ready to keep paying up. The US news is so guilty of propaganda and disinformation it's heartbreaking really. But EU and NATO expects payment. Not my money. Unlike you I don't sit on my couch. Everything Moscow said was true.",
        "good": "2",
        "bad": "0",
        "replies": [
            {
                "user_name": "ADaddy",
                "time": "2 September, 2022",
                "context": "So what territory of Russia did Ukraine attack and annex? And what are you better news sources? The Kremlin?",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "son12",
        "time": "2 September, 2022",
        "context": "Fox News : How about an investigation into why Putin and the Russian forces have not touched the capital of Ukraine in 5 months now since the invasion! No bombings no nothing ! Heck city so safe Nancy Pelosi and many other social lights have come to wine and dine Zelensky !",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jimmiebob1",
        "time": "2 September, 2022",
        "context": "Self ruled, nope . History folks.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "evasaiden",
        "time": "2 September, 2022",
        "context": "One lesson that China can learn from the Russia's -Ukraine war is the loss for life. War only comes with the loss and economy effects the most.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "ADaddy",
        "time": "2 September, 2022",
        "context": "Taiwan is the last remnant of the true government of China. The usurpers, The \"People's\" Republic of China never occupied Taiwan. Perhaps, China belongs to Taiwan and China should immediately submit to Taiwan, the legitimate government of China.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "JamesBomb",
        "time": "2 September, 2022",
        "context": "Not your yard, dog.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "northtexas78691",
        "time": "2 September, 2022",
        "context": "If China Controls Taiwan, it Would Control Ninety Percent of All The CPU Chips in The World, in Effect China Would Control The World.",
        "good": "0",
        "bad": "1",
        "replies": [
            {
                "user_name": "harless",
                "time": "2 September, 2022",
                "context": "Their economy would suffer massively losing the 18% that the US represents. That is assuming the logical end of trade relations that should follow any invasion, but with Brandon and his donors who knows?",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "KHunt984",
        "time": "2 September, 2022",
        "context": "and the beat goes on.\nand to think, it was our government that sent our jobs to china giving then all this strength.\nJust to make some of their friends rich. Themselves too, I am sure!",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "alextoo",
        "time": "2 September, 2022",
        "context": "Ukrainian success can teach China———\nDid not need to read any further. \nThanks for your opinion, but no, thanks.",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "harless",
                "time": "2 September, 2022",
                "context": "You don't like Ukrainian success or don't find it real?",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "alextoo",
                        "time": "2 September, 2022",
                        "context": "How I can find Ukrainian  success real when all I hear from them is complains we are not giving enough?  Simple logic tells me they are not successful, blame our lack of help.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "harless",
                                "time": "2 September, 2022",
                                "context": "I think anyone would have thought they would have been overrun in 2 weeks when it started. So in that regard this has been highly successful. It has cost the Russians so much in equipment losses they won't be a serious threat conventionally for decades. It's easy to see that if we didn't have a potato for president that they would have gotten more help from us too.",
                                "good": "1",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "alextoo",
                                        "time": "2 September, 2022",
                                        "context": "If you thought you are flying to Florida, but confused your flight with  plane headed to Chicago, who is successful in reaching the goals,  you or the pilot who took the plane to the scheduled destination? Unless you convinced yourself Chicago is your place, not Florida… 😜\n\nAt the onset of this war Putin spelled out his objectives, followed his plan. \nNot his problem what ‘everyone’ would have thought.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "atomsite",
        "time": "2 September, 2022",
        "context": "hmmm, why do they want Taiwan? What’s the point? China has a lot going for it right now. Why mess it up? Russia just tanked their world standing by invading another country, Must be an ego thing…",
        "good": "2",
        "bad": "1",
        "replies": [
            {
                "user_name": "Lbeh",
                "time": "3 September, 2022",
                "context": "A free Taiwan is an embarrassment to the CCP. One party rule with no free elections and absolute power over its citizenry compared to some individual rights, due process, no secret police, a free press, etc. etc. Taiwan citizens are all Chinese people not living under one party rule and they communicate this to the other Chinese people in the so-called, PRC. The fact that a well-functioning democracy of Chinese people sits right next door demonstrates that real options exist to the one Party \"communist\" rule. Like all autocrats, they don't like free people states.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "MuricanKeeter",
        "time": "2 September, 2022",
        "context": "There was multiple reasons we did not invade Formosa during WW2.  Geography, logistics, and very few beaches to use for an amphibious assault.  Hopefully the Chinese will try.  Will be a lot of Communist bodies floating in the Strait for a while.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bobgary",
        "time": "2 September, 2022",
        "context": "so Polosi's visit managed to speed up an invasion by China.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "jager342",
        "time": "2 September, 2022",
        "context": "Three lessons for China to take away from Russia's invasion of Ukraine:\n1) Massive use of artillery works.\n2) Neighbours of Taiwan can be forced to back down and withdraw support.\n3) Joe Biden is a corrupt senile weakling and the US military is run by incompetents.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mw44",
        "time": "2 September, 2022",
        "context": "so this guy gives China advice on the proper way to attack Taiwan? why is he being given a platform to spew his opinion?",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "methuselah3",
        "time": "3 September, 2022",
        "context": "Biden gives billions and billions to illegals and Black racists and LGBTQ’s for Socialism to be ushered into America through Democracy and a trickle down pittance to our military as China, Russia, North Korea and Iran build up their nuclear and conventional arsenals. At least our enemies will have new bridges.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "howardgrant",
        "time": "2 September, 2022",
        "context": "The US disarmed the free Chinese and put them on the Island that is now called Taiwan.  The US put a fleed of ships in between them and China to keep peace.  They should put the ships back, I don't know why they took the ships out.",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "delcatforfacts",
        "time": "2 September, 2022",
        "context": "They will not attack us unless we interfere and Biden has promised them we won't do that. What they have learned from Russia and Ukraine is go big and go fast, no one will stop them. Last couple days of October or first couple of November, it's the end of a free Taiwan.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "burnet1187917",
                "time": "3 September, 2022",
                "context": "Who let this yellow Mr. Chang in here?",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "chuckt746",
        "time": "2 September, 2022",
        "context": "It was during the Biden/Obama administration that China built up Islands in the sea and constructed military bases, can't blame Trump since he wasn't president, so nothing was said.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "independent1952x",
        "time": "2 September, 2022",
        "context": "If Biden was interested in saving Taiwan, he would be sending all kinds of weapons, he is not.  China is just waiting for America's Nov elections.  If republicans don't gain any control China will invade Taiwan.  At that point Biden will claim China has that right to bring Taiwan under China control and stay out of the conflict.  China doesn't care what happens in Ukraine.  Biden does want access to his money in China and to have access, he THINKS, he will have to do almost nothing when China invades.  After China succeeds, China will want nothing to do with Biden because why would they want to,  with a man who betrayed his own country.",
        "good": "2",
        "bad": "1",
        "replies": [
            {
                "user_name": "JamesBomb",
                "time": "2 September, 2022",
                "context": "The best weapon you've got is the one between your own two ears..\nAnd you ain't got enough of that.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "pete3215",
        "time": "2 September, 2022",
        "context": "The problem is :America can live without Taiwan but Taiwan is dead wo American support.\n\nWhat now ?    It's just a matter of time till the  commos/chinks go in .  \n\nChang says \"go to defcon 2\".    \n\nOver to you slo jo.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "super_decathlon",
        "time": "3 September, 2022",
        "context": "Joe Biden is an agent of The Chinese Government.  Bought and Paid for.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "lmao_commies",
        "time": "2 September, 2022",
        "context": "I dont blame Putin for NOT wanting a WOKE LIBERAL state beside him",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "gesunde",
        "time": "2 September, 2022",
        "context": "Three lessons the Chinese learned:\nJoe Biden is the most incompetent President in the history of the United States\nKamala Harris is the laughing stock of the planet\nLloyd Austin is more concerned about having a \"WOKE\" military than a prepared one",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "chuckt746",
        "time": "2 September, 2022",
        "context": "I'm waiting for some disgruntled Chinese officials to leak what they have over Biden and his family.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "IBeTenBeers",
        "time": "2 September, 2022",
        "context": "China has owned Taiwan since Jan, 2021.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ADaddy",
        "time": "2 September, 2022",
        "context": "China, No matter how proud you are of what you have achieved, the bottom line is people would gladly risk dying to get out of China and would risk dying to get into the USA.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "abestein",
        "time": "2 September, 2022",
        "context": "Hopefully can get the chip factories moved to USA.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cajuntransplant",
        "time": "3 September, 2022",
        "context": "Per the article : \"Unfortunately, the Biden administration continues with what appears to be a single-minded focus on Russia, while tension in the Pacific heats up to the boiling point.\"\n\nWonder why ? Because Hunter and Joe's brother James have gotten more \"influence pay\" from China than they have from Russia.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "holdmybeer2",
        "time": "3 September, 2022",
        "context": "There is no faltering war. Russia has pretty much won.",
        "good": "0",
        "bad": "4",
        "replies": [
            {
                "user_name": "tortuga6",
                "time": "3 September, 2022",
                "context": "Exactly right!  The Russians captured Kyiv, captured Kharkiv, captured Snake Island, the Ukrainian army has surrendered, and the Moskva will be docking in Odessa shortly so that Major General Andrei Sukhovetsky can lead a victory parade.  /s",
                "good": "2",
                "bad": "2",
                "replies": [
                    {
                        "user_name": "holdmybeer2",
                        "time": "4 September, 2022",
                        "context": "Russian didn't want Kiev or Kharkov. Snake island was abandoned by Russia not taken. Ukraine Army is gone, most surrendered or killed in action in the east. Ukraine lost months ago son.",
                        "good": "0",
                        "bad": "2",
                        "replies": [
                            {
                                "user_name": "tortuga6",
                                "time": "4 September, 2022",
                                "context": "Ivan, your propaganda is a joke.  The rusting hulks of destroyed and abandoned Russian tanks litter the battlefields where your armies have been driven away, though",
                                "good": "1",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "hammy017",
        "time": "6 September, 2022",
        "context": "China would probably nuke Taiwan and wipe it out just for the show of force. It is proven they don't care one iota about people unless it benefits them.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "manualjames",
        "time": "4 September, 2022",
        "context": "Biden his Clan and the rest of the Democrat's are in the back pockets of the CCP they need to be stopped at the Midterms. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "yourlowiqisshowing",
        "time": "3 September, 2022",
        "context": "Chinas only experience at fighting a war is either with itself or when it is being supplied by another communist power...and that communist power is in a meat grinder right now.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "chuckbrown65",
        "time": "4 September, 2022",
        "context": "China also knows two things:\n\n1 - it is NOT self-sufficient in food\n2 - it is NOT self-sufficient in energy (oil).\n\nIf they manage to drag the US into it, our woke Navy could still interdict ships far outside the range of the Chinese air force. With well over a billion mouths to feed, it would not take long for the populace to feel the effect of a blockade, especially after this year's drought will deplete state reserves.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jn8218",
        "time": "3 September, 2022",
        "context": "What China learned: 1. Sanctions are jokes 2. US and the West only good at bluffing",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "bangkapi238",
        "time": "3 September, 2022",
        "context": "If China does attempt an invasion they will not stop there because at that point they have nothing to lose. People should expect an invasion of the rice bowl countries. An invasion of Taiwan would show the world that China has nothing to lose!",
        "good": "0",
        "bad": "0",
        "replies": []
    }
]