[
    {
        "user_name": "😲gam-esq5.0😲",
        "time": "12 November, 2021",
        "context": "In related news, seafood specials abound at restaurants around Florida Aquarium....",
        "good": "0",
        "bad": "11",
        "replies": []
    },
    {
        "user_name": "foxrox!",
        "time": "12 November, 2021",
        "context": "A dolphin's intellect is indeed astonishingly impressive. I wish we could say the same for the POTUS. However, God bless, Winter. May you splash and swim forever in the purified waters of Heaven's oceans knowing the Divine God who created you.",
        "good": "11",
        "bad": "1",
        "replies": [
            {
                "user_name": "libsou812",
                "time": "12 November, 2021",
                "context": "she's still smarter than Brandon",
                "good": "8",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "marcusar15ius207",
                        "time": "12 November, 2021",
                        "context": "My last BM had more intellect than Biden!",
                        "good": "5",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "lycopine",
                "time": "13 November, 2021",
                "context": "Certainly the last POTUS. And which of the 10,000+ documented gods are you referring to?",
                "good": "0",
                "bad": "2",
                "replies": [
                    {
                        "user_name": "foxrox!",
                        "time": "13 November, 2021",
                        "context": "Get back down to your mommy's basement believing in \"nothing\" & adoring a decrepit presidential puppet, OK Einstein?",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "libsou812",
        "time": "12 November, 2021",
        "context": "No tunas were harmed in the filing of this story.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "leela284",
        "time": "12 November, 2021",
        "context": "So sad to hear this. I own and love that movie. May Winter rest in peace and enter Heaven.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "fly'smom",
        "time": "12 November, 2021",
        "context": "Sorry about Winter...",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Wack506",
        "time": "12 November, 2021",
        "context": "How sad.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "VoteRepublican286",
        "time": "12 November, 2021",
        "context": "Now for spring, summer and fall - a trio of dolphins to entertain the paying customer.",
        "good": "0",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "foxrox!",
        "time": "12 November, 2021",
        "context": "This is heartbreaking, but we hope & pray she is back with her Creator & fully restored once again. God bless.",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "thomaswinslow009",
        "time": "12 November, 2021",
        "context": "There is something fishy about this story. First!",
        "good": "0",
        "bad": "10",
        "replies": [
            {
                "user_name": "ninibong",
                "time": "12 November, 2021",
                "context": "Dead dolphin and all you can do is joke.",
                "good": "3",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "I’mNotDorothy",
                "time": "12 November, 2021",
                "context": "And worst!",
                "good": "1",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "sciencerocks",
                "time": "12 November, 2021",
                "context": "Dolphins are mammals, not fish.",
                "good": "4",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "rubiks6",
                        "time": "15 November, 2021",
                        "context": "Dolphins live in water. The taxonomic categories are man-made – they are artificial.\n\n\"And God said, Let the waters bring forth abundantly the moving creature that hath life, and fowl that may fly above the earth in the open firmament of heaven.\n\"And God created great whales, and every living creature that moveth, which the waters brought forth abundantly, after their kind, and every winged fowl after his kind: and God saw that it was good.\n\"And God blessed them, saying, Be fruitful, and multiply, and fill the waters in the seas, and let fowl multiply in the earth.\n\"And the evening and the morning were the fifth day.\n– Genesis 1.20 - 23 (KJV)\n\nOf course, you don't believe that narrative. You don't believe the God of the Bible. You blaspheme the Holy Spirit, the Author of the Bible.",
                        "good": "0",
                        "bad": "2",
                        "replies": [
                            {
                                "user_name": "thomaswinslow009",
                                "time": "15 November, 2021",
                                "context": "No. ScienceRocks is correct. Dolphins are mammals even though they resemble fish. Your ancient book of mythology is wrong and your holy spirit only exists in your head.",
                                "good": "1",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "rubiks6",
                                        "time": "15 November, 2021",
                                        "context": "Dolphins are not mentioned in the Bible, except in the class of all creatures that live in the sea. Dolphins live in the sea, do they not?",
                                        "good": "0",
                                        "bad": "1",
                                        "replies": []
                                    }
                                ]
                            },
                            {
                                "user_name": "sciencerocks",
                                "time": "15 November, 2021",
                                "context": "Dolphins are still mammals, and still not fish.",
                                "good": "1",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "rubiks6",
                                        "time": "15 November, 2021",
                                        "context": "Of course, dolphins are mammals but that is still a man-invented label. We have chosen certain traits with which to group animals together. Other traits could have been chosen. It may make sense to it but it is, in fact, arbitrary.\n\nThe \"mammal\" label indicates that an animal feeds its offspring with milk, among other traits. I do not deny that. The \"fish\" label indicates a creature the breathes primarily water, with other traits necessary to isolate \"fish\" from, say, arthropoda, like a spine. I do not deny what fish are.\n\nWe choose to group animals together into categories based on shared traits. What I am saying is not primarily about biology so much as it is about language. Taxonomy is at its root a linguistic endeavor. It was the first task assigned to Adam. Adam was a scientist before he was a gardener.\n\nThe diversity of God's created creatures is just extraordinary!",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": [
                                            {
                                                "user_name": "thomaswinslow009",
                                                "time": "15 November, 2021",
                                                "context": "Adam is a myth. He never existed.",
                                                "good": "0",
                                                "bad": "0",
                                                "replies": [
                                                    {
                                                        "user_name": "rubiks6",
                                                        "time": "15 November, 2021",
                                                        "context": "Says you. Who the hell are you? \n\nYou've been on this Earth only a few days and you don't even remember when or how you got here, and you think you know something? Pshaw.",
                                                        "good": "0",
                                                        "bad": "1",
                                                        "replies": [
                                                            {
                                                                "user_name": "thomaswinslow009",
                                                                "time": "15 November, 2021",
                                                                "context": "I can look at the fossil evidence and see clearly that human's evolved for other primates. You have ZERO evidence that Adam ever existed other than your book of fairytales.",
                                                                "good": "0",
                                                                "bad": "0",
                                                                "replies": [
                                                                    {
                                                                        "user_name": "rubiks6",
                                                                        "time": "15 November, 2021",
                                                                        "context": "You've been on this Earth only a few days and you don't even remember when or how you got here.\n\nYou have never even handled a human fossil. What's your epistemology? What makes you think you know anything? You're a high school graduate who believes the stories he's been told – nothing more.",
                                                                        "good": "0",
                                                                        "bad": "1",
                                                                        "replies": [
                                                                            {
                                                                                "user_name": "thomaswinslow009",
                                                                                "time": "16 November, 2021",
                                                                                "context": "College graduate and I HAVE handled human fossils. Do you enjoy being wrong about EVERYTHING?",
                                                                                "good": "0",
                                                                                "bad": "0",
                                                                                "replies": []
                                                                            }
                                                                        ]
                                                                    }
                                                                ]
                                                            }
                                                        ]
                                                    }
                                                ]
                                            },
                                            {
                                                "user_name": "sciencerocks",
                                                "time": "15 November, 2021",
                                                "context": "The taxonomic system we use is FAR from \"arbitrary.\"\nThat you can make such an outlandish claim simply demonstrates your complete ignorance of the system.",
                                                "good": "1",
                                                "bad": "0",
                                                "replies": [
                                                    {
                                                        "user_name": "rubiks6",
                                                        "time": "15 November, 2021",
                                                        "context": "Why do we not group all creatures that live in the sea together. That’s an obviously shared trait. The taxonomy system is a product of human pattern recognition but no creature comes with a tag that says “mammal” or “vertebrae.” The primary task of a scientist is taxonomy — to identify traits and categorize and name things. The nuclear physicist identifies subatomic particles, discerns their properties and names them. The astronomer identifies different types of astronomical objects and describes and names them. The biologist has this relationship with living things. Some so-called “scientific” endeavors are not science at all — like paleontology. Many, many scientific fields are filled with nothing but undemonstrable conjecture. There is a place for that in the human experience but it is not rightly called “science.”",
                                                        "good": "0",
                                                        "bad": "0",
                                                        "replies": [
                                                            {
                                                                "user_name": "sciencerocks",
                                                                "time": "16 November, 2021",
                                                                "context": "Okay, I don't have time to rip to shreds your every illogical comment (i.e. all of them.) But since you are now a delusional purveyor of what constitutes science, let me ask you this:\nDo you think that it would be useful to biological science to link together sea urchins, starfish, catfish, sharks, and dolphins all in the same category, just because they live in the oceans?\nThe taxonomic system we have was first published in 1758 by Swedish botanist Carl von Linne (Linnaeus). That was 100 years before Darwin and Wallace announced their then hypothesis, now confirmed theory, of biological evolution through natural selection. Yet the system works pretty well with evolution too, except at the species level which is more slippery than Linnaeus proposed.\nOne more question: Do you have any idea how much damage you people cause to Christianity and faith in general?",
                                                                "good": "0",
                                                                "bad": "0",
                                                                "replies": []
                                                            }
                                                        ]
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "dalbur",
        "time": "12 November, 2021",
        "context": "I remember a few years ago we went down to see Winter, we spent a few hours touring the facility.  Our son who just turned 17 still has his stuffed Winter doll on his nightstand.  We went there a couple of times before Covid hit.  They do great work there and at the other marine sites.",
        "good": "13",
        "bad": "0",
        "replies": [
            {
                "user_name": "cmsgt(ret)89",
                "time": "13 November, 2021",
                "context": "your son needs help",
                "good": "0",
                "bad": "2",
                "replies": []
            }
        ]
    },
    {
        "user_name": "selkie614",
        "time": "12 November, 2021",
        "context": "😢",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mytruthhurtsyou",
        "time": "13 November, 2021",
        "context": "Replace it was a sasquatch-kamala display",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "dan5047628",
        "time": "12 November, 2021",
        "context": "I hope they saved the meat. Dolphin makes a great meal.",
        "good": "0",
        "bad": "16",
        "replies": []
    },
    {
        "user_name": "nightowl13",
        "time": "13 November, 2021",
        "context": "RIP sweet little Winter! 🐬😥",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rubiks6",
        "time": "15 November, 2021",
        "context": "Science will be held back due to the loss of this creature.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "1MAGA_MFr",
        "time": "13 November, 2021",
        "context": "Terrible\nSo many millions of kids inspired by this girl\nRIP",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tomuchtoask",
        "time": "12 November, 2021",
        "context": "I bet Winter will vote Democrat in the next election ",
        "good": "10",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "rubiks6",
        "time": "17 November, 2021",
        "context": "Wow. 4 days the dead dolphin remains the top headline for the science section.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mkeadifference",
        "time": "12 November, 2021",
        "context": "I volunteered there many many years ago when I was a teenager.  They are a very valuable asset to Marine Biology programs and educational opportunities for the public.  ",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tomuchtoask",
        "time": "12 November, 2021",
        "context": "This just in: Hillary Clinton was seen running from the aquarium wearing a wet suit, snorkel and goggles. Very suspicious!!",
        "good": "7",
        "bad": "0",
        "replies": [
            {
                "user_name": "annoyedreader439",
                "time": "13 November, 2021",
                "context": "LOL I doubt hillary was seen running from the aquarium...not with those cankles.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "annoyedreader439",
        "time": "13 November, 2021",
        "context": "Fox is being very liberal today in their use of the word star to describe everyone that has passed on today. They even called Chuck a Happy Days \"star\" for his 3 whole 5 second appearances.......\n\nSorry that she passed...losing an animal that one has been around for 16 years is much like losing a relative.....",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "drdoolittleandearthfriend",
        "time": "13 November, 2021",
        "context": "Such beautiful beings. Rest well Winter.  Thank you for touching our lives",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Hwarren",
        "time": "13 November, 2021",
        "context": "Was she vaccinated ",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "EEngr=mc^2",
        "time": "13 November, 2021",
        "context": "Wild dolphins are dying from out toxic runoff.",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "lycopine",
                "time": "13 November, 2021",
                "context": "and plastic pollution and strip mining fishing nets",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "Grumpymansd",
                        "time": "13 November, 2021",
                        "context": "Like the lithium and gold in the device your spouting off on.",
                        "good": "1",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "lycopine",
                                "time": "13 November, 2021",
                                "context": "plastic pollution and strip mining fish nets are in my computer? Now that's a hoot.\nMost oceanic plastic pollution is soft; bottles, bags, wrapping, containers, etc. as are almost ALL fishing nets.\nYou'd better revise your birdbrain statement...",
                                "good": "0",
                                "bad": "1",
                                "replies": [
                                    {
                                        "user_name": "Grumpymansd",
                                        "time": "13 November, 2021",
                                        "context": "The strip mining pollution is the majority of the plastic is 3rd world countries the runoff is mostly from growing vegan food the copper strip mines are needed for all green electrical devices. Have you ever been to an offshore oil rig. If so you would know they are a haven for sea life",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": [
                                            {
                                                "user_name": "lycopine",
                                                "time": "13 November, 2021",
                                                "context": "Fish nets are routinely dumped in the ocean once damaged, prior to that, they are used to strip mine the ocean creating a mass killing of \"bycatch\" that is also dumped overboard. Nearly ALL plastic is made by 1st world countries because it is cheap to sell to third world ones who can't afford to control waste. Toxic fertilizers are used MOST extensively in industrial farming operations around the world and cause the VAST majority of the runoff, and most of that farming is for animal feed, especially in the USA.\nI've scuba dove on oil rigs and the stilts do indeed support sea life. The rigs also pollute the ocean in numerous small spills and MASSIVE catastrophic ones too, that kill far more sea life than all the rigs combined support.\n\nTry again.",
                                                "good": "0",
                                                "bad": "1",
                                                "replies": [
                                                    {
                                                        "user_name": "Grumpymansd",
                                                        "time": "13 November, 2021",
                                                        "context": "Oil leaks naturally from the sea floor China buys the most recycling products and dumps the in other 3rd world countries",
                                                        "good": "1",
                                                        "bad": "0",
                                                        "replies": [
                                                            {
                                                                "user_name": "lycopine",
                                                                "time": "14 November, 2021",
                                                                "context": "Natural oil leaks are miniscule compared to man made ones. China stopped buying plastic recycling a long time ago. Try to keep up.",
                                                                "good": "0",
                                                                "bad": "0",
                                                                "replies": [
                                                                    {
                                                                        "user_name": "Grumpymansd",
                                                                        "time": "14 November, 2021",
                                                                        "context": "I will tell you I can see dolphins everyday thy are thriving I see baby's every spring and summer nature with adapt and continue on like it has before us and will long after us",
                                                                        "good": "0",
                                                                        "bad": "0",
                                                                        "replies": []
                                                                    }
                                                                ]
                                                            }
                                                        ]
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "dlw0613",
        "time": "13 November, 2021",
        "context": "To honor Winter's passing, Joe Biden has decided to make Nov. 11th National Sushi Day.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sh83",
        "time": "12 November, 2021",
        "context": "poor thing she was still just a baby!",
        "good": "2",
        "bad": "0",
        "replies": []
    }
]