[
    {
        "user_name": "followernotafan",
        "time": "3 hours ago",
        "context": "Who's surprised?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Wxtz",
        "time": "6 hours ago",
        "context": "Stealing from you is what it is. Your representative didn’t vote for that. ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "labrador2008519",
        "time": "4 hours ago",
        "context": "corruption at every level of every government...they believe the taxpayers will never find out. ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "torpedoman",
        "time": "7 hours ago",
        "context": "Government never spends tax dollars on what they say it is intended for. All tax collections are spent on whatever politicians like at the time with no oversight or accountability. This is known as legal extortion.",
        "good": "6",
        "bad": "0",
        "replies": [
            {
                "user_name": "lovefreedomhatelibs",
                "time": "6 hours ago",
                "context": "You are correct.  The government takes in $.41 per gallon of gas in taxes and our roads are terrible.\nAnd yet, they claim that the oil companies, that make somewhere between $.05 to $.10 a gallon in profit, are raking in the cash.  The government takes in more than 4 time the amount of the oil companies and yet they claim that the oil companies are evil?",
                "good": "2",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "speakingtoyou",
        "time": "7 hours ago",
        "context": "Remember folks, Democrats pushed hard to Mandate and Coerce every man, woman and child to be injected with an experimental and harmful mRNA Gene Therapy Shot against their will.",
        "good": "5",
        "bad": "0",
        "replies": [
            {
                "user_name": "Rudbny",
                "time": "6 hours ago",
                "context": "So.",
                "good": "0",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "tatorhill",
        "time": "3 hours ago",
        "context": "So, what to expect in the future!  Congress refuses to raise taxes for states to build their toys! Then, the dems get on the phone to Hunter Biden and he gets his buddies in China to come up with another \"bug\", to infect us, so the dems can get that free money to build anew!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "miketexan",
        "time": "2 hours ago",
        "context": "Is anyone really surprised that governments would use funds allocated for health for any other purpose their pointy little heads come up with?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Rudbny",
        "time": "6 hours ago",
        "context": "If it was used to keep americans working then, so what.",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "ozhog",
        "time": "6 hours ago",
        "context": "I don't know Chairman Troy Waymaster, but his ignorant comments about the Docking Office Building, tearing it down and use  \"the new space for events and meetings could allow better social distancing during a COVID-19 resurgence or future pandemic.\" As a life long Kansan I wonder what kool-aid Gov. Kelly has made him drink.",
        "good": "1",
        "bad": "0",
        "replies": []
    }
]