[
    {
        "user_name": "ptdusn",
        "time": "2 days ago",
        "context": "My wife and daughter a in the Medical Field and they both say you can detect the heartbeat at around 5 weeks",
        "good": "47",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "Nomanbun",
        "time": "2 days ago",
        "context": "Are there pro choice people on here that would be fine aborting that baby if they were the person doing the procedure?",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "crazycuban01",
        "time": "2 days ago",
        "context": "there is a point in the pregnancy that the fetus becomes a baby.  Thats where the GOP compromise of 15 weeks comes in.  That is what we as a nation should do, this is what every other nations does, have a sensible period for the woman to have an abortion if they want to.",
        "good": "9",
        "bad": "8",
        "replies": []
    },
    {
        "user_name": "Iyápi-wapásika_hemáčha",
        "time": "2 days ago",
        "context": "Dems deny science all the time. \nWe saw it with COVID, we see it with the abortion issue and with the gender issue. Ideology trumps science to Liberals.",
        "good": "63",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "jamiec",
        "time": "2 days ago",
        "context": "How is pushing the decision down to the state level banning abortions?",
        "good": "34",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "luv5",
        "time": "2 days ago",
        "context": "I think nbc gave the republicans a bunch of campaign commercials!  Co-anchor Dylan Dreyer gave an \"Awww!\"  Now that remark in the background will be a hoot!",
        "good": "27",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "kbreedlove50",
        "time": "2 days ago",
        "context": "Bill Cosby (50+ years ago): \"Hey, get those brussel sprouts outa there!\"",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "williamweiss",
        "time": "2 days ago",
        "context": "Celebrating because a news reader says a baby in the womb is a baby?\nHow sad that this is so extraordinary!",
        "good": "30",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "freepeople660",
        "time": "2 days ago",
        "context": "Some NBC producer is in big trouble for dabbling in journalism:  \"You're FIRED!\"",
        "good": "31",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "RJ0888",
        "time": "2 days ago",
        "context": "Why Republicans are weighing in on this issue confuses me. The Supreme Court has ruled it is a state issue - bow out, let the individual states vote their conscious, stay out of a losing proposition.",
        "good": "2",
        "bad": "10",
        "replies": []
    },
    {
        "user_name": "freedomfighter2022",
        "time": "2 days ago",
        "context": "A baby’s life is viable at conception, and ALL babies, wanted or unwanted, have a right to life.  If a parent abuses their child they will be charged.  If a parent forgets their child in a hot car and the child dies, that parent will likely be charged.  If a parent willingly submits their child to be killed by a doctor, the doctor should be charged with murder and the parent an accomplice to murder.  Life begins at conception, and all life belongs to God.",
        "good": "52",
        "bad": "8",
        "replies": []
    },
    {
        "user_name": "geefostabc",
        "time": "2 days ago",
        "context": "Every once in a while, a Liberal \"News\" network slips and tells the truth.\nNot to worry though, they will be forced to run an opposing story or\nissue a retraction by their masters, the Democratic Party.",
        "good": "47",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "daddio927",
        "time": "2 days ago",
        "context": "Then the Today Show co-hosts had a good chuckle about how, after the taste experiment, the Dr. dismembered the \"fetus\", yanked it out, and threw it in the garbage can.",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "mary-peterson",
        "time": "2 days ago",
        "context": "Later term abortions are extremely rare and very expensive. The represent a fraction of 1% of all abortions and cost 5x more to do in most cases. Virtually 100% of late term abortions are due to health of mother or sever deformity such as imminent death of the baby in the womb or shortly there after. And virtually all were by women with wanted and planned to bring the baby to term but a medical emergency led them and their doctors to agree to terminate.",
        "good": "0",
        "bad": "7",
        "replies": []
    },
    {
        "user_name": "bobbyjones123",
        "time": "2 days ago",
        "context": "We officially have a Comment Section abortion debate! Can we also discuss which religion is best?",
        "good": "1",
        "bad": "8",
        "replies": []
    },
    {
        "user_name": "Ronmyth1",
        "time": "2 days ago",
        "context": "Did you ever see a fetus sucking their thumb, it’s amazing to see.  And the first thing an infant will do is suckle right after birth.  It isn’t taught but sometimes they have a problem finding the right spot at first.  ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jmandering",
        "time": "2 days ago",
        "context": "Good political material!!! A baby in the womb in the last trimester, likely the 8th or 9th month. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "lesfender",
        "time": "2 days ago",
        "context": "Of course there is a baby in there.  The pro choice people just want to down play this issue.  I mean....you're not going to an abortion clinic for an earache right?  You're going because there is a baby inside you and you dont want the baby any more.  Im pro choice, but I also believe you're basically killing a baby here.  At least be honest about it.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mary-peterson",
        "time": "2 days ago",
        "context": "\"The cat who was completely obsessed with my bump when I was pregnant is quite uninterested in the baby now that she's out. It's a weird way to find out that my cat is a Republican.\"\n\nDr. Dana Ménard",
        "good": "3",
        "bad": "11",
        "replies": []
    },
    {
        "user_name": "theleftlivesinafantasyworld",
        "time": "2 days ago",
        "context": "Right after this segment, she is quoted as saying, \"And in other news the democrat party believes that an abortion is a right up until birth.  And rightfully so.\"",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "foxwatcher1",
        "time": "2 days ago",
        "context": "What gets me is that any democrat would be horrified if they heard a story of someone throwing a bag with a puppy or kitten into a river. They can’t even stand hearing about animal shelters that euthanize animals after a time when they are not adopted, but a human fetus that could survive outside the womb at 6 or 7 months gestation? No problem. Abort it. It makes no sense. Is it because they aren’t cute and furry?",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "andweallfelldown",
        "time": "2 days ago",
        "context": "Of course, NBC is fake news, right?",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "Xidenistheenemy",
        "time": "2 days ago",
        "context": "Don't believe your lying eyes!! That is not a bab.....oh wait, never mind!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "morrispatriot",
        "time": "2 days ago",
        "context": "Can you imagine how many women who were 19 and told it was just a clump of cells and then they see this report and realize they were lied to and therefore killed their own child-- a child with feelings!  Imagine the mental damage done to women who were lied to.  Perhaps a class action is in order.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "daveed970",
        "time": "2 days ago",
        "context": "Republicans should run ultrasound images when discussing abortions. Many women change their mind about getting an abortion after they see an ultrasound of their baby. ",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "52guns",
        "time": "2 days ago",
        "context": "Liberals sure aren't gonna like this",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "justsaying025",
        "time": "2 days ago",
        "context": "Baby likes carrots, dems say abort it.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Youvegottobekidding589",
        "time": "2 days ago",
        "context": "DEM MSU … they will say anything to fit their agenda and beliefs wtheck ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "democracy2024",
        "time": "2 days ago",
        "context": "This is hilarious..Fox news running lead stories on the abortion issue...I guess no one told them it's the main reason they are getting killed in the midterms!!!!  Keep up the good work!!!!",
        "good": "2",
        "bad": "11",
        "replies": []
    },
    {
        "user_name": "DemBabykillers",
        "time": "2 days ago",
        "context": "LILA ROSE , my #####1 hero in the world!!!!!!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "wowwhatsnext",
        "time": "2 days ago",
        "context": "Now that they admitted it's a baby, will they admit that only women are capable of child birth?",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "NoDisplayName404",
        "time": "2 days ago",
        "context": "hopefully these video clips will not be taken down ......\nare they on youtube, yet?",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "spartan77965",
        "time": "2 days ago",
        "context": "They’re either going to be forced to apologize or loose their jobs ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jrettinger",
        "time": "2 days ago",
        "context": "Mehmet Oz should admit to his illicit sales of synthetic performance drugs developed to race horses on dirt tracks to professional Athletes.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "kurtsfish",
        "time": "1 day ago",
        "context": "These are 32 week+ old fetuses. Meaning they are almost 2 months past 2nd trimester and capable of actually being born at any minute. this is NOT what pro-choice is about. Nobody wants elective abortions in the 3rd trimester and to say such is a bold faced lie to advance a draconian agenda. \n\nViability is at 24 weeks.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "BookLover@Heart840",
        "time": "2 days ago",
        "context": "This is nothing but speculation and nonsense. And this is a near term baby. ",
        "good": "0",
        "bad": "8",
        "replies": []
    },
    {
        "user_name": "FINN319",
        "time": "1 day ago",
        "context": "Remarkable resemblance to Rosie O'Donnell.  She always has a happy reaction to food of any type.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "StormyDonald",
        "time": "1 day ago",
        "context": "it could be a baby if that's what the woman wants it to be.  It could also be a parasite if it still requires the use of the woman's body to survive, if she sees it that way.\n\nIf she does view it as a parasite, it should be handled like any other parasite in the body :)",
        "good": "1",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "confessions",
        "time": "1 day ago",
        "context": "If anybody thinks this will make a difference to true leftist justice warrior Democrats they are wrong. Empirical evidence has been available for a long time",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "vic7",
        "time": "1 day ago",
        "context": "How can they deny that.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "texksah",
        "time": "2 days ago",
        "context": "What face does the unborn baby make when the abortion Dr sticks the needle in it's eye socket to abort it?",
        "good": "12",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "fightthefarleft",
        "time": "1 day ago",
        "context": "Just a tumor, correct lefties?",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "itzunbelievable",
        "time": "1 day ago",
        "context": "\"A ‘baby’ when it makes for a cute news story. A ‘fetus’ when justifying killing them.\"\nEXACTLY. There is no argument in the world that can change those facts.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Rocky5055",
        "time": "1 day ago",
        "context": "Need many Rep ads showing progress from fetus to baby in the womb so aborters and Dems see what life is.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "LescoBrandon993",
        "time": "2 days ago",
        "context": "I thought the baby was just a clump of cells",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "itzunbelievable",
        "time": "1 day ago",
        "context": "This should really be a top 5 news story on FOX. Pretty remarkable the producers at NBC are too blinded by their own false perspective to see how they let a \"Pro-Life\" story slip through the cracks.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "honorbound",
        "time": "1 day ago",
        "context": "\"Fauci admitted that certain aspects of the GOVERNMENTS response to the pandemic were BOTCHED\"  Remember when Fauci used the pronouns I, me and my to describe HIS response to the pandemic.. It was up to ME and I made MY decision... He wanted all the credit for HIS response to the pandemic.. Now that the \"Response WAS BOTCHED\" he wants to give the credit to the Government... What a silly little man.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "indicat20",
        "time": "2 days ago",
        "context": "GOP flipping backwards and forwards to try to dance around their full abortion bans. Gotta love politics jajajajajaja",
        "good": "0",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "urbeyondgaslitimright",
        "time": "1 day ago",
        "context": "See that smiling baby in the womb up above in that photo? That's who democrats want to MURDER in a late term abortion. They want to rip that smiling baby from their mothers womb and throw it in a medical trashcan. That's who democrats are and that's all one needs to know. They are not moral people.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "endofussoon",
        "time": "1 day ago",
        "context": "Imagine laws that only apply to blacks. Well they are doing it to woman, and clearly that is wrong. .ACLU where are you.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "paperpusher75",
        "time": "1 day ago",
        "context": "I bet that abortion would end if they could show its face while it was being killed.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "lawabider",
        "time": "1 day ago",
        "context": "Maybe they are being compassionate to try to show Democrats' humanity.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "tedman11954",
        "time": "1 day ago",
        "context": "I'll bet the baby would really smile if mom ate a democrat.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "lesfender",
        "time": "2 days ago",
        "context": "You're not going to an abortion clinic to get rid of your earache, right?  You're going there to get that baby out of your body.  At least be honest about it.  I'll respect you more for it also.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "liberalbiasmediadestroyingusa",
        "time": "1 day ago",
        "context": "Their radical, twisted way of thinking always winds up backing them into a corner. When your rules lack any resemblance of common sense, this is the result. ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "brian73",
        "time": "2 days ago",
        "context": "regardless what liberals want to call the growing life form inside a woman... when getting an abortion, it is ending a human life period.",
        "good": "14",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "PatrioticPete701",
        "time": "1 day ago",
        "context": "That is amazing! That the baby frowned for kale that is. It would interesting if tried what mom thought was a tasty meal that they wasn't necessarily health food. I'm thinking something like KFC or Wendys. Tastes good, not junk food per se. If you landed on Earth and tried carrots and kale, we might be surprised at the answer. What is taste anyhow? We use it English to convey that the person has good or popular opinions.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "lesfender",
        "time": "2 days ago",
        "context": "Now Im wondering what face the baby makes right before they abort it.....",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "MarineSgtAl",
        "time": "1 day ago",
        "context": "Before you can get an abortion you must view the ultrasound and listen to the heartbeat of your son or daughter.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "lightitup",
        "time": "1 day ago",
        "context": "They are dreaming in there. Maybe life is not in the heart. Maybe we should be measuring brain activity. Bottom line is maybe mommy loves you, maybe mommy doesn't. Awesome pics. Man, I just want the best case for every kid. Angers me when folks give up.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "liberalitarian",
        "time": "1 day ago",
        "context": "Fox gets more disgusting every day.",
        "good": "0",
        "bad": "7",
        "replies": []
    },
    {
        "user_name": "proud*patriot",
        "time": "1 day ago",
        "context": "The libs are hating this one. But don't blame FOX for your fake news accusations. Go talk to NBC.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "techgeeklang",
        "time": "1 day ago",
        "context": "Smiling = emotion.\nEmotion = understanding.\nUnderstanding = human.\nMath class is dismissed.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "SVP.Para.Bellum",
        "time": "1 day ago",
        "context": "I wonder what face they make when mom downs a morning after pill.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "northpole189",
        "time": "1 day ago",
        "context": "Thank you Fox for this story, it shows how evil so called Christians are\n\nThis story is worth a million how many times the queen of England went to the bathroom before she pasted",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "lumenpraetorius",
        "time": "1 day ago",
        "context": "It’s good to see that hearts and minds are changing.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bridgeman",
        "time": "1 day ago",
        "context": "Dem women who can't control their se. xual  urges need abortion to cover up the consequences of their immorality",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "northpole189",
        "time": "1 day ago",
        "context": "Show this before you celebrate Jesus coming in the world as a baby",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "perky28",
        "time": "1 day ago",
        "context": "Maybe that's what Joe is, a fetus, here to defeat us all...",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mary-peterson",
        "time": "1 day ago",
        "context": "New GOP pronoun for women: Government mandated birthing unit.",
        "good": "0",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "centristbutnevertrumpist",
        "time": "1 day ago",
        "context": "There is no such thing as an unborn baby.  A baby is a born human.\n\nMost abortions destroy zygotes which is a pre-fetus stage where the cell cannot even be seen without a microscope.\n\nAbortion rights are fundamental human rights guaranteed by the privacy clause and equal protection clause of the constitution.  \n\nIf the state is powerful enough to control a woman's organs and treat her as a fetus cargo, we are in big trouble.  That is not freedom.",
        "good": "1",
        "bad": "6",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "ironranger281",
        "time": "1 day ago",
        "context": "Liberals are in human !",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tomdamron",
        "time": "1 day ago",
        "context": "I know an attorney who received an extended sentence in prison because while DUI, he ran a red light and killed a lady who was three months pregnant,  and was convicted of double vehicular homicide.  If a baby in the womb is not a person, how could they convict him for killing two people?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "northpole189",
        "time": "1 day ago",
        "context": "Don't let Christians for Kamala see this\n\nTHIS IS HORRIBLE \nIM SURE CHRIST WOULD AGREE",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "northpole189",
        "time": "1 day ago",
        "context": "This is BLASMEPHY ISNT IT",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "liberalitarian",
        "time": "1 day ago",
        "context": "Even the photo has a disclaimer. Meaningless to the lemmings.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "dontavious",
        "time": "1 day ago",
        "context": "Democrats see those as targets of opportunity.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Saticoy",
        "time": "1 day ago",
        "context": "That fetus is black.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "northpole189",
        "time": "1 day ago",
        "context": "OH CHRISTIANS FOR THIS ADMINISTRATION,  COME OUT ,COME OUT WHEREVER YOU ARE\nTHIS IS HORRIBLE ISNT IT",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "vern1957",
        "time": "1 day ago",
        "context": "That baby in the womb would be illegible for abortion  if Biden, Harris , Abrams, AOC, O'Rourke, Pelosi,  Warren,  and the rest of the socialist get their way.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "humboldthoney2",
        "time": "1 day ago",
        "context": "Aww, how cute!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "FastPass123",
        "time": "1 day ago",
        "context": "I only want to cry when realizing how innocent these “human beings” really are. Even more so as to how pure.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Thalvor",
        "time": "1 day ago",
        "context": "I remember I was engaged to a gal in college, we lived together for 2 years. She went off her rocker at 27 and started getting into drugs. She'd be gone for days, then come back out of no where. My roommate and his gal would ask if we needed to kick her out, but she was on the lease... longer story short, when the 3 of us confronted her, she talked about hating herself for an abortion she had at 19. Luckily, I was able to get off the lease and move out and on with my life. The other guy and gal got stuck with her until the lease was up. PSYCHO AMY!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "allwillberevealed",
        "time": "1 day ago",
        "context": "I’ve seen these 3-D pictures of my own daughter at  7 months gestation, right after this technology was first commercialized. My wife was nervous so remained almost silent. When we got the first really clear view of the baby’s face, my wife shouted with glee. Our baby smiled so big it was clear and undeniable (we have the pictures!).  When the smile faded, the technician asked her to “call” the baby. She did and almost the same result except now the baby was turning her head left and right, like she was looking for the sound. Still smiling for the entire time Mom was calling to her. To end this baby’s life at this point would have been to destroy a life that already recognizes the sounds of her mother, can express feelings on her face and knows to glance around to try to locate a sound. \n\nIf one would still end the life of their baby knowing all this,  you should at least ask, “When will the buyers have enough meat and organs?",
        "good": "31",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "yavapai",
        "time": "1 day ago",
        "context": "Woke Homer says \"doh\"",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "allenrobert",
        "time": "1 day ago",
        "context": "I ve been against murder longer than I have abortion",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "johnny1",
        "time": "1 day ago",
        "context": "The experience flavor and pain!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sanrafaelblue..534",
        "time": "1 day ago",
        "context": "I don't like Kale either. It's like eating boiled peppered paper.\nGive me Collard or Mustard Greens instead.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "voellerc",
        "time": "1 day ago",
        "context": "\"babies in the womb\"???\n\nThat's not a \"baby\" - LOL..  it's a worthless clump of irrelevant, tumor-like cells that should be aborted so to not inconvenience it's birthing person..\n\nRight, democrats??",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ScaryPoppins",
        "time": "1 day ago",
        "context": "Just a clump of cells, huh libs?",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "en0ughn0w",
        "time": "1 day ago",
        "context": "With the advances in birth control, including the morning after pill, and the widespread distribution of contraceptives at the taxpayers' expense, there are very few cases where an ab0rtion should be acceptable in our society. --Notice, liberals, that I did not say \"FREE contraceptives\".",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "en0ughn0w",
        "time": "1 day ago",
        "context": "Tell me liberals,\n\nHow is it equitable that if a woman wants to abort her offspring but the father does not, he has no \"choice\" in the matter...\n\n      ...however, roles reversed, he is held responsible and told, \"You should have thought about the consequences of your actions before you drop your pants!\"?",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "thekingofcool784",
        "time": "1 day ago",
        "context": "Chris Matthews another good Catholic!!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "silencedogood212",
        "time": "1 day ago",
        "context": "As a liberal I love this.  It is what liberals have been saying all along.  You think it is called baby?  Good for you.  Don't get an abortion.  It is abortion RIGHTS.  That means you are allowed to believe what you want!",
        "good": "0",
        "bad": "7",
        "replies": []
    },
    {
        "user_name": "yogi584",
        "time": "1 day ago",
        "context": "Must be a guy because real men don't eat kale.  Have mom take a Guinness and see what happens .",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "HuntersDealer",
        "time": "1 day ago",
        "context": "Whoops!!!!! Libs weren’t supposed to put that there. That’s a body inside a body and you give it no choice.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "coaster1",
        "time": "1 day ago",
        "context": "Fetuses have feelings, who new. Follow the science.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "LuvinMyTrump",
        "time": "1 day ago",
        "context": "dems have always used the \"not human\" argument to subject and oppress others.  It worked so well, we had to have a civil war to stop the last one.",
        "good": "23",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "valdane",
        "time": "1 day ago",
        "context": "That was my absolute first thought when I saw this. What a stunning miscalculation for the “Hooray For Abortions!” National Broadcasting Company.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ObeseIllegitimo676",
        "time": "1 day ago",
        "context": "How inconvenient for the baby murderers.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "en0ughn0w",
        "time": "1 day ago",
        "context": "We as a society should create public service announcements featuring a cartoonish character that liberals can understand...\n\n\"Pokey the Hare\", \"Only YOU can prevent unwanted pregnancy!\".",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "altair13",
        "time": "1 day ago",
        "context": "The RNC should run an ad with this picture. And explain that the democratic barbarians have no problem hacking this child to pieces.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "snoopcat",
        "time": "1 day ago",
        "context": "I like the photos but it makes me depressed and troubled please send a copy to AOC",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "brooklynnick",
        "time": "1 day ago",
        "context": "Biden has the same look after a good trip to his other Oval Office.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "6.5gren779",
        "time": "1 day ago",
        "context": "The miracle we call life, Beautiful.",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "freemarkethomer",
        "time": "1 day ago",
        "context": "leftists scoff at morality but somehow reality always comes around to bite them in the a--.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "constitutionalrepublic646",
        "time": "1 day ago",
        "context": "Planned Parenthood will not show ultrasound images.  They prefer harvesting organs.",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "JynxLynx",
        "time": "1 day ago",
        "context": "Good one.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "pourbastrd",
        "time": "1 day ago",
        "context": "Democrats believe it is nothing but a pollywog for the first nine months, and only turns into a baby upon exiting. That is just sooooo “scientific”...",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "DaftDims",
        "time": "1 day ago",
        "context": "What NBC failed to reveal is that that’s actually a sonogram of Stacy Abrams when her mom was at the chicken wing section of Golden Coral…",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "lageff",
        "time": "1 day ago",
        "context": "There have also been stories about people performing abortions having a change of heart, after seeing the baby fighting for it's life, literally.  But yep, it's just a lump of lifeless cells, right.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "oneguy481",
        "time": "1 day ago",
        "context": "A “baby” when it makes for a cute news story. \nA “fetus” when justifying killing them\n\nJust two sentences but they say so much. Not only do these two sentences expose a great hypocrisy but they also show the lack of morality In the hypocrisy.",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "tinman550",
        "time": "1 day ago",
        "context": "Abortion is taking a life, plain and simple.  Once we can all agree on that, then we can move forward.  Don't talk about it like it is something virtuous; at its best it is medically prudent to save a life, prevent untold suffering, or protect a victim.  At its worst, it is premeditated murder.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "imgonnagogetthepapersgetthepapers",
        "time": "1 day ago",
        "context": "I can't imagine what he'd look like if some satanic abortionist was going up in there and starting to rip him apart.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "BayouB486",
        "time": "1 day ago",
        "context": "Hallelujah!!... and Amen!... All life matters!\nVaya Con Dios",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "MAGARules!",
        "time": "1 day ago",
        "context": "Maybe they should do a segment showing the baby's face as it is cut to pieces, so that the pro-choice people can see what they are fighting for.",
        "good": "11",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "lajackal",
        "time": "1 day ago",
        "context": "Now they should have the integrity to show similar video of a baby being aborted. See how that changes the conversation.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "8dk",
        "time": "1 day ago",
        "context": "This will be swept off the internet real fast.\nI will bet this story is gone in 3 days, Pro Abortion cannot have a picture like this exist.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "noninja2",
        "time": "1 day ago",
        "context": "When the baby heard the mother say that she is a conservative, he/she knew it was safe.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "lanceanne2785",
        "time": "1 day ago",
        "context": "First of all 3 black people and only one white person.  Is this a good representation of our country’s population.  Secondly, the lady said “when I was pregnant”, how come none of the men discussed life when they were pregnant?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tadahzip",
        "time": "1 day ago",
        "context": "Pro birthers. Pro lifers provide prenatal care, help for the child and mother once it’s born",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "thekingofcool784",
        "time": "1 day ago",
        "context": "Put this on a video billboard across from every one of Murdering Newsoms.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bear_creek_angus",
        "time": "1 day ago",
        "context": "God is keeping score.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "phivesolas",
        "time": "1 day ago",
        "context": "Between this and the recent Dr Phil episode, the abortion facade continues to take blows. It is crumbling because people are finally confronted with what actually happens to the pre-born human life in the womb.",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "phivesolas",
        "time": "1 day ago",
        "context": "Facts are stubborn things.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "pourbastrd",
        "time": "1 day ago",
        "context": "Now... let’s do those same ultrasound images as the abortion doctor sticks a suction needle into the baby’s head. Make a recording of it, and make every abortion patient watch the video prior to the procedure.... this will save millions of lives!!!",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Choke-on-it-Liberals",
        "time": "1 day ago",
        "context": "Abortion is MURDER because they ARE ‘babies in the womb'",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "rdtrip",
        "time": "1 day ago",
        "context": "Democrats voters actually have to not think about what an abortion is to be able to support them.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ThingsFallApart",
        "time": "1 day ago",
        "context": "Whoa…they refer to the baby as a he. How do they know? 😂",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mydrivewaycrackskeepmeawake",
        "time": "1 day ago",
        "context": "Jackie Gleason and Norm Macdonald had a kid. Just sayin'.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "HPLwasright",
        "time": "1 day ago",
        "context": "Oh, God, it looks like Ted Kennedy!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Home.of.the.Free.Because.of.the.Brave",
        "time": "1 day ago",
        "context": "Hard to believe that there are those who would terminate such a beautiful thing, a human life, at the drop of a hat.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "ustaxpayer",
        "time": "1 day ago",
        "context": "Up until 8 weeks of pregnancy it is called an embryo\n8 weeks til birth it is called a fetus - \nbirth before 21 weeks the fetus will not survive.\nAfter birth it is a baby.\n\nThe choice of abortion should be up to the woman. There are too many reasons to take the right of an abortion away. It is not anyone's business what choice the woman makes. Abortions should be legal.",
        "good": "1",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "El'",
        "time": "1 day ago",
        "context": "Support LGBTQ+ \n\"Let's Get Biden To Quit plus Pelosi\" !!!!!!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "stelmo984",
        "time": "1 day ago",
        "context": "I believe you can ask any biologist and they will tell you life begins at conception.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "imamarine",
        "time": "1 day ago",
        "context": "He likes it, hey Mikey!!!",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Sniffy_McBiden",
        "time": "1 day ago",
        "context": "those crazies in the street that are pro abortion should be ashamed.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "omnioasis",
        "time": "1 day ago",
        "context": "Now show the face they make when being murdered by an abortion.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "gaelsneverfail",
        "time": "1 day ago",
        "context": "The superficial and manufactured ‘Awwwww’ response.\nUsually typifies the ones that would like to destructively select which conception gets to enjoy carrots.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "MadDawg66",
        "time": "1 day ago",
        "context": "Lovely baby… smiling, thinking… “I cannot wait to be born… hopefully I’ll live in America… the absolute greatest country in the world… hopefully the Republican Party will have taken control of both the House and the Senate and the Presidency as well. If I could control my middle fingers, I’d show whoever sees this ultrasound exactly how I feel about Creepy Joe”.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "KnowTheDifference",
        "time": "1 day ago",
        "context": "How can anyone not understand that the fetus is a living soul?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "J.KirkTiberius",
        "time": "1 day ago",
        "context": "\"Fear and anxiety of becoming a parent\" is not a life and death scenario which justifies killing your child.\n\nAbortionists are murderers; there is no way around it.",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Sniffy_McBiden",
        "time": "1 day ago",
        "context": "hopefully this baby is not born to a liberal dem. once they learn the gender, they will have \"corrective\" surgery in the womb to change it.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "billc01",
        "time": "1 day ago",
        "context": "Too bad few people watch NBC",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "MAGA_Buttplugs_Hate_America🇺🇸",
        "time": "1 day ago",
        "context": "Yes. Viable, 34-36 week fetuses. Not abortion candidates.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "UncomfortablyNumb769",
        "time": "1 day ago",
        "context": "Beautiful",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Sniffy_McBiden",
        "time": "1 day ago",
        "context": "Those hosts probably got a tongue lashing when show was over",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jalang",
        "time": "1 day ago",
        "context": "Just more proof that the liberal talking points of \"reproductive rights\" and \"protecting women's health\" is at its root an evil ideology.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "WalterTobiasFrankfurter",
        "time": "1 day ago",
        "context": "Of course NBC did this, that baby is the splitting image of Jay Leno",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "irasmatter",
        "time": "1 day ago",
        "context": "Maybe similar high resolution images should be taken during abortions at all stages of development. Let’s all look at the undeniable evidence of what is happening. Hint: a newly conceived egg/cluster of cells that fails to implant in the womb because an IUD is present, or is aborted within a few days by a morning after pill, will not show much to be alarmed about. Aborting a baby nearing birth would be horrific (ask anyone who has seen the dismembered body parts coming out). Somewhere in between lies the answer that most sensible people would agree to.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "john894",
        "time": "1 day ago",
        "context": "Did NBC reveal whether it was a man or a woman who was pregnant?",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "freesouthafrica",
        "time": "1 day ago",
        "context": "WHITE GENOCIDE SOUTH AFRICA \n\nWAKEUP CALL TO WHITE AMERICANS. \n\nWARNING ⚠️ \n\nA North West farmer has died after being hacked with pangas and stabbed with knives.\nFrans Venter, 68, was at home with his gardener and domestic worker when four men broke in.\nThe men overpowered the workers and tied them up using cables.\nNews24 SA",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Checkmate504",
        "time": "1 day ago",
        "context": "It's obvious the mother has used her right of choice to carry the fetus to LATE TERM and soon birth.  You have no say so on what she decides.  I'm personally against abortion but that is my personal virtue, but I will defend your rights.",
        "good": "0",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "Keith3648",
        "time": "1 day ago",
        "context": "DemocRats the most uncivilized barbaric self obsessed excuse for human beings to ever exist.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "MAGA_Buttplugs_Hate_America🇺🇸",
        "time": "1 day ago",
        "context": "Sure looks like Donnie.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "grillmasterp",
        "time": "1 day ago",
        "context": "You can detect the heartbeat at 5 weeks. It's there before that even before we can detect it.\nAbortion IS murder.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "holdon",
        "time": "1 day ago",
        "context": "wow, they didn't even realize they would help pro life",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "BigJohnD",
        "time": "1 day ago",
        "context": "Now show the video where the baby in the womb feels pain from a needle injected into him/her.  The baby cries in pain in the womb.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "box948",
        "time": "23 hours ago",
        "context": "If this baby was aborted it would be a killing!  I believe a woman has rights to make her own decision.  However I do not understand with all the birth control available why abortions are increasing according to Planned Parenthood.  I also believe when pregnancy reaches a stage in which you have a living human, being a baby, the child has human rights which trumps the woman’s rights.  I know others believe otherwise that is where the beauty of the Supreme Court decision comes to play.  By the states establishing laws that coincide with the peoples beliefs.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "baldingeagle980",
        "time": "1 day ago",
        "context": "I refuse to watch NBC. That channel is total Democrat propaganda. I only watch Fox and Newsmax to get the real truth.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "food4thought718",
        "time": "1 day ago",
        "context": "All I can say is, think about what your life would have been like if your mother had an abortion.\nOh, right. You wouldn't have a life.\nHow would YOU feel if YOU were aborted at a late stage?\nOh, right. You wouldn't have any feelings.\nHow did you feel after seeing the baby's reaction?\nOh, right. You don't have any feelings.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "betoo'dork947",
        "time": "1 day ago",
        "context": "\"Yes there were. I’m glad you asked,\" Jones replied, before describing a photo of an unborn baby apparently frowning after its mom ate kale.\nDreyer remarked, \"That’s adorable though!\" and Roker added, \"Because once they get out of the womb, it’s that same look.\" All around the table agreed, laughing.\"\n\nWhat   more   do   you   need   to   see? \nABORTION IS MURDER! Some of these killers in the Democrat Party want to abort right up to birth. Unreal.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "FigNooton",
        "time": "1 day ago",
        "context": "I dunno... that's a big kid in that womb!  Looks like he's in there for 10 months and doesn't want to leave!  This is a sign he won't leave the house after he turns 18!",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "joey77",
        "time": "1 day ago",
        "context": "Two days ago my 4th beautiful granddaughter was born. They all make my life better.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "tangowft5209",
        "time": "23 hours ago",
        "context": "How about those 15 weeks now? 33 weeks (8 months) vehemently wrong to kill something that already knows how to smile and frown....unless you are knowing the life you are bringing into this world won't survive or you won't survive (medical outs)...that should be the only time taking a life works.  15 weeks seems to be a good compromise!  Curious how NBC so conveniently picked 33 weeks...what's the face look like at 24 weeks, 18 weeks, and so on.  Women can have the choice, but obviously life is better out of all anyways--find a middle ground people.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ORANGEMANSAYS2020",
        "time": "1 day ago",
        "context": "..........Democrats, following their own version of made up science..........",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "easygoer13",
        "time": "1 day ago",
        "context": "Stacy Abrams said these are fake",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "karl_sweetchuck",
        "time": "23 hours ago",
        "context": "I’m not defending NBC, but this was a business decision. An overwhelming majority of Americans are pro-life, particularly when they are presented with gruesome images of the procedure.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "go_figure7722",
        "time": "23 hours ago",
        "context": "Uh-oh. Have the network Apologies begun, yet?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "8ba11",
        "time": "1 day ago",
        "context": "Such a cute mass of lifeless cells...",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "hewhoplayswiththemostwins",
        "time": "1 day ago",
        "context": "This is why we need to ban late term abortions.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "katman2480",
        "time": "1 day ago",
        "context": "A rose by any other name is still a rose.  Calling a baby by the Latin word for baby, \"fetus\", is still a baby.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "FigNooton",
        "time": "1 day ago",
        "context": "Kids face went from Kale... to Tacos!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cropshear",
        "time": "1 day ago",
        "context": "I’ve been saying for years,Hollywood has been using the sonogram scene in movies and never calls it a fetus, it’s always your baby !",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "observer1892",
        "time": "23 hours ago",
        "context": "This should \"delight\" anyone who's living and breathing and able to see it.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "walker49",
        "time": "1 day ago",
        "context": "Funny how they don't even realize at the time they are being hypocritical and calling this child a baby and not a fetus.  I bet that just TICKED them off after it aired and everyone tweeted it.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "MoreRedWhiteandBlue",
        "time": "1 day ago",
        "context": "Because of this, next week the TODAY show will have a segment: Why abortion is the right decision and that a fetes is not a human till born. They have to keep the wacky left watching after all.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "JoeyHairPlugs",
        "time": "1 day ago",
        "context": "A fetus can't vote, so liberal Democrats don't care whether they exist or not.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "stungiba",
        "time": "1 day ago",
        "context": "Another thing Conservatives have right.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "LT1Formul@",
        "time": "1 day ago",
        "context": "Liberals don't have a heart.\nSo a babies heartbeat means absolutely nothing to them.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ChildhoodObesity",
        "time": "1 day ago",
        "context": "Imagine That!!! A blob of tissue that responds to stimulus! Kinda like a real baby!!!",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bidenbabbles",
        "time": "1 day ago",
        "context": "Things were so much better under Trump",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ValkyrieIA",
        "time": "20 hours ago",
        "context": "Does the left care what the expression looks like reacting to the vacuum?",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "libtardsbware",
        "time": "17 hours ago",
        "context": "Wow Democrats no comments on the murders your party commits daily.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "AZ_CindyBlueWho💨",
        "time": "14 hours ago",
        "context": "The one on the left is unwanted, the other one is not.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "misskitty432",
        "time": "20 hours ago",
        "context": "The movie Unplanned shows an abortion.  It made me physically ill.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "LGBTQRST",
        "time": "17 hours ago",
        "context": "The kid obviously has GAS.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "#ohreally?",
        "time": "14 hours ago",
        "context": "Oh no, someone's probably getting fired. Maybe they can interview AOC while she eats her daily bowl of fetus soup?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "too_late",
        "time": "22 hours ago",
        "context": "Ahnold:  \"It's not a tumor\"",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "br549887",
        "time": "19 hours ago",
        "context": "Dems like late term abortions so the more developed baby parts sell for a higher price",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "eagle0431462",
        "time": "17 hours ago",
        "context": "That baby only “identifies” as a baby, therefore, according to the baby killing Dems, is NOT a baby.  Problem solved for the abortion loving Dems.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "donnerparty1",
        "time": "22 hours ago",
        "context": "Planned parenthood will claim its not possible to prove that was a baby , just a bunch of cells that resembles one.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "anotherresponse",
        "time": "17 hours ago",
        "context": "Liberals saw this and all lined up with suction tubes!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Grumpy78",
        "time": "21 hours ago",
        "context": "All life belongs to God and all those that don't believe that will pay a terrible price, the Almighty has a long memory.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jtgcs",
        "time": "23 hours ago",
        "context": "The photo on the right shows the unborn baby smiling after mom said she will never vote for a Democrat again!",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "radicalrightofcenter",
        "time": "22 hours ago",
        "context": "How did we become a society so unconcerned with the lives of the children women provide???...How did so many Mother's decide killing the child growing inside of them is acceptable???...\nThe leftist feminist cares places more importance on the life of that cow or pig I'm eating than the child in her womb...\nPresent interpretation of women's rights have truly advanced us so much as a society.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "crabbyfarmer",
        "time": "17 hours ago",
        "context": "babys are a gift from God and made for love not killing",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "HA!669",
        "time": "20 hours ago",
        "context": "Democrats everywhere remind me of Kevin Bacon at the end of \"Animal House\" shrieking \"All is well! All is well!\"",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "goodtry",
        "time": "19 hours ago",
        "context": "That is outstanding!  They let down their guard and acted like real human beings.  They are going to have to take some more liberal thought training.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rethinkthis063",
        "time": "18 hours ago",
        "context": "How long till NBC cancels itself for a pro-life segment in one of their shows?",
        "good": "0",
        "bad": "0",
        "replies": []
    }
]