[
    {
        "user_name": "Rjmont",
        "time": "11 September, 2022",
        "context": "The ice wall at the edge of Flat Earth...",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "luv2step",
        "time": "11 September, 2022",
        "context": "I see it every day watching the political ads. I watch some of them and say to myself that's not true. Why are they saying that?",
        "good": "68",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "oldernotwiser643",
        "time": "11 September, 2022",
        "context": "News flash, 9/11 was an inside job.",
        "good": "2",
        "bad": "8",
        "replies": []
    },
    {
        "user_name": "billygoatkid",
        "time": "11 September, 2022",
        "context": "That explains a lot.  Biden has been dead for 2 years now. He is the ultimate deep fake",
        "good": "34",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "fulghn",
        "time": "11 September, 2022",
        "context": "The Russia Collusion witch hunt is a perfect example of that.",
        "good": "36",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "Trump4Prison989",
        "time": "11 September, 2022",
        "context": "Believing fake news is a right wing problem.\n Leftists don't fall for fake news as easily as conservatives do",
        "good": "2",
        "bad": "10",
        "replies": []
    },
    {
        "user_name": "Runner4Life",
        "time": "11 September, 2022",
        "context": "People also believe in big foot, yeti, and that there was no moon landing. With all the fake news out there I understand the skepticism. ",
        "good": "27",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "CyanButton",
        "time": "11 September, 2022",
        "context": "This whole administration is a deepfake created by the CCP. ",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "libhatr178",
        "time": "11 September, 2022",
        "context": "You still have people believe biden actually won honestly",
        "good": "97",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "Konan956",
        "time": "11 September, 2022",
        "context": "People mostly believe what  they would like to believe.",
        "good": "28",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "criticalthinking919",
        "time": "11 September, 2022",
        "context": "Dims favorite words:  I'm with the Government and I'm here to help.  LOL",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "StandoftheBrave",
        "time": "11 September, 2022",
        "context": "There is ABSOLUTELY NOTHING I trust the government with. I don’t believe one single word out of ANY politicians mouth. NOT one word. ",
        "good": "40",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "galoman_returns",
        "time": "11 September, 2022",
        "context": "I believe it....anything that a Fox host says is believed by all their trained seals, without  questions. ",
        "good": "1",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "hwy13",
        "time": "11 September, 2022",
        "context": "Joe Biden’s a deep flake ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "perogi007",
        "time": "11 September, 2022",
        "context": "The fact that people actually believe Biden got over 80 million legitimate votes tells me people are capable of believing anything.",
        "good": "71",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "deplorableindependent",
        "time": "11 September, 2022",
        "context": "Are you trying to say Michael Jackson wasn't frozen to be brought back in the future ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "czechster625",
        "time": "11 September, 2022",
        "context": "Now how do you fake the facts that fourteen Saudis who were trained in the USA flew the planes into the World Trade Center and other landmarks?  Why did Bush allow only Saudis to fly out of the United States on 9/11?  How many know who Bandar Bush is and why he had an office in the West Wing?  Why did we immediately invade Iraq and Afghanistan claiming they were at fault?\nNow tell me about your CNN Fake comments.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "MerIin",
        "time": "11 September, 2022",
        "context": "People only believe what fits their agenda. They read headlines and if they don’t like the headline, it’s a lie. \n\nThey never do the research to find out what the truth is. ",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "JonDrake801",
        "time": "11 September, 2022",
        "context": "That’s because people don’t dig deeper - they read the headline and maybe the first paragraph.  ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "criticalthinking919",
        "time": "11 September, 2022",
        "context": "But...  When it's debunked so many times & it was a lie what do you expect?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jobro49",
        "time": "11 September, 2022",
        "context": "And then you have Hunter Biden’s laptop that would really have made a difference in 2020 but the media, DOJ, and FBI decided to hide the truth and even now don’t think it is a big deal… as much as has come out about the deals with China, Russia and Ukraine, videos, witnesses, pictures and texts and yet the President has denied knowing anything and no one has interviewed Hunter.",
        "good": "65",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "samr372",
        "time": "11 September, 2022",
        "context": "Yep. Like many republicans who think Biden’s victory is fake. ",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Malakie457",
        "time": "11 September, 2022",
        "context": "Time for a method of marking legit video to prevent this.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "ksense99",
        "time": "11 September, 2022",
        "context": "When those that use fake to achieve power have control, you are left with debunking the truth to protect that which is false. ",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "rdtrip",
        "time": "11 September, 2022",
        "context": "Dems live in a made up world where they took what is evil and call it good.",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ElGato",
        "time": "11 September, 2022",
        "context": "He meant democrats ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "stevejuststeve2468",
        "time": "11 September, 2022",
        "context": "It's how Trump won in 2020.\nThe gullible voters....Lapping it up....",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "deplorableindependent",
        "time": "11 September, 2022",
        "context": "Biden, pelosi, Schumer,Obama, aoc, are aliens sent down to earth to destroy humans",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "reason101t",
        "time": "11 September, 2022",
        "context": "He looks like Assange.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "averagejoe39",
        "time": "11 September, 2022",
        "context": "Of course the 2020 election was rigged against Trump.  Why is there no evidence? It is a National Security priority to keep it a secret. National secrets cannot be used in court.",
        "good": "43",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "Humility750",
        "time": "11 September, 2022",
        "context": "You don’t need to explain a deep fake, you just know something’s wrong when people tell you not to ask questions and explain things. The biggest TELL that a deep fake is either real or a prop in a larger plan, is when you are silenced for asking questions at any stage of the dig for truth.",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Civil_Whites",
        "time": "11 September, 2022",
        "context": "Ultra democrats are one big deep fake, ultra deep, ultra fake",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rocko411",
        "time": "11 September, 2022",
        "context": "that is how dementia Joe won the 2020 election. and now all of us in the USA are suffering for it. ",
        "good": "9",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "2504732",
        "time": "11 September, 2022",
        "context": "90% of liberals still believe in the Russia collusion hoax even tho its been debunked.",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "broodingprussian",
        "time": "11 September, 2022",
        "context": "The Goebbels principle: repeat a lie often enough and it will be believed.",
        "good": "10",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "LetsGoBrandon_clap_clap_clap",
        "time": "11 September, 2022",
        "context": "Remember, you do not need to debunk anything. You only need to introduce doubt. It’s really that simple as the CIA has shown. ",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cancelcultureisforcowards",
        "time": "11 September, 2022",
        "context": "2000 Mules is a great example of deepfake",
        "good": "0",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "HumptyTrump183",
        "time": "11 September, 2022",
        "context": "According to Trump at his Bedminster Golf Club...\"we're still trying to get to the bottom of 9/11. People still don't really know what happened.\" ",
        "good": "0",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "TomNJ1961xx",
        "time": "11 September, 2022",
        "context": "It was aliens",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "F100",
        "time": "11 September, 2022",
        "context": "Safe and Effective ®",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "rdtrip",
        "time": "11 September, 2022",
        "context": "Democrats want you to believe that a biological Boy who feels like a girl is a girl. \nRepeat the lie long enough people will start to believe it.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rdtrip",
        "time": "11 September, 2022",
        "context": "Dems have repeated the lie that Abortion is Women’s Health Care so often , millions believe them.\nAbortion is without a doubt, ending the life of an Unborn Baby.",
        "good": "6",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "HomeoftheBills",
        "time": "11 September, 2022",
        "context": "Let's take a look at some disturbing facts.\n1 year before 9/11 there was a panting on Epstein's wall sign and dated with George Bush jr.\nsitting on the floor and crashing paper airplanes into the twin towers.\nFireman at 9/11 site seen FBI agent take black boxes that were from the plane s and load them in their black SUV and drive away later to announce that the Black boxes were never recovered.\nThen you have all the steel structure that was stored in a locked and guarded building that Jesse Ventura did a story about would not let him in to see the beams who a scientist did test on for super thermite that was put into grease and paint in the elevator shafts to quickly cause these buildings to collapses.\nNext look up building 7 a federal building that had nothing to do with either tower was also destroyed.\nWhen you have this much information against and already terrible government agency it is very easy not to believe.\nBTW all the steel from the twin towers after Jesse's interview all of it was shipped to China and was quickly melted down.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "CMAG🇺🇸",
        "time": "11 September, 2022",
        "context": "Jean-Pierre still believes No Illegals are “just walking across the Border” ",
        "good": "12",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "dontdrinkthekoolaid888",
        "time": "11 September, 2022",
        "context": "911?!  Bush did that...",
        "good": "0",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "gtfoms",
        "time": "11 September, 2022",
        "context": "My sister became a 9/11 truther believing it was an inside job.  No amount of education in explaining the miles of cable needed to be wired since explosions cause an EMP so you can't remote sequence detonate.\nAs well as the fact that you have to tear all the walls away to get to the critical support beams and you can't have 5,000 plus people coming in and out of the building every day and not one person notice.\nIt didn't matter.  We haven't spoken once since.  I banned her from ever meeting or even talking to my children.  They are 2 and 4yrs old and don't even know she exists.\nSad but my sister has chosen to live a self-destructive life that comes with serious consequences. \nNow that the man she was living with for food, shelter and clothing passed away, I expect she'll be living on the streets in due time since she can't work a 9-5, she claims it's bad for her health (makes sense considering she stays up on social media every night to 3-4 in the morning).",
        "good": "9",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "NavalAircrewmanretired.",
        "time": "11 September, 2022",
        "context": "I knew this would come out sooner or later. Many have already been misled. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rocko411",
        "time": "11 September, 2022",
        "context": "I think they use that technology to make the world believe there is a war in Ukraine, except we never see any war footage, just the supposed aftermath.",
        "good": "4",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "akhanaton",
        "time": "11 September, 2022",
        "context": "Poisoning the Deep Fake well is easy. Expose it. Show how it’s done, eliminate confusion in advance.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "lucky_luke",
        "time": "11 September, 2022",
        "context": "Cor sure. MAGA’s will always believe the election was stolen no matter what.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "ispyart",
        "time": "11 September, 2022",
        "context": "There you have it the deepfake has clouded a small parcel of the population.\nThe “stolen election” lie is a perfect example - zero evidence presented in court and the gullible blindly follows with attacks to DOJ, CIA, FBI….,,,, the pope and anyone between \nWhat these fake news does to people, it is simple pitiful.",
        "good": "3",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "weebes",
        "time": "11 September, 2022",
        "context": "This article was ridiculous.  I still believe a Presidential candidate who ran his campaign from his basement ,and could barely fill a High School Gym when he did speak got more votes than anyone in history.  I also believe Kavanaugh is guilty even though his accusers couldnt give dates, times, or places",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "comment_nado",
        "time": "11 September, 2022",
        "context": "Yeah, Biden is the pres, enuf' said",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "hcklbery716",
        "time": "11 September, 2022",
        "context": "There are this very minute some for unfathomable reasons are yet convinced,  in spite of modern science that the Earth is flat.\nCompare these with pervasive liars and you'll find little difference.\nIt takes a liar to believe such obvious falsehoods.\nRemember this one?\nA man who tells lies, like me, merely hides the truth but a man who tells half lies has forgotten where he put it.\n(Lawrence of Arabia).",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "4d4e",
        "time": "11 September, 2022",
        "context": "Duh. This is FOX .   We know people believe the lie. Suitcases full of bamboo ballots, Italian satellites and Venezuelan dictators stealing elections.  ",
        "good": "2",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "jeremyrnr058",
        "time": "11 September, 2022",
        "context": "Democrats could just create a deep fake of Trump organizing and commanding an invasion of the Capital to activate the military against innocent Republicans.  They could start a civil war while claiming to be the ones trying to prevent it.  It is time to admit we are dealing with fascists that are capable of all of these atrocities and much worse.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rowdyncross",
        "time": "11 September, 2022",
        "context": "I guess we can throw in climate change as well with the \"Deep Fake\"",
        "good": "10",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Notyouagain300",
        "time": "11 September, 2022",
        "context": "This administration is so corrupt….it’s shocking!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "averagejoe39",
        "time": "11 September, 2022",
        "context": "There is one secret the government will never admit to. That secret is that our election system is not secure and the results cannot be confirmed, the way that we do it.\nWhy did the Supreme Court step in  2000? The Constitution has a solution when the results of the election cannot confirm a winner in the election. That solution is to hand it to Congress. But that solution was deemed too destabilizing for the US government.  So, the Supreme Court stepped in and ignored the Constitution. It wasn't legal so they needed a better solution.\nThe Supreme Court, the White House and Congress came up with a plan that met the requirements of the Constitution and did not undermine the legitimacy of the government. That plan was put into place for the 2020 election. The actual election was a fraud. Congress picked the winners just as the Constitution requires. They just did it before the election.",
        "good": "1",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "howaboutthem",
        "time": "11 September, 2022",
        "context": "the swamp is real",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ANewDay493",
        "time": "11 September, 2022",
        "context": "When you hold certain principles to be True, you can more ceasily discriminate between People, what they really are. \nExample, Biden proclaims he is For America, he is For Freedom, He is For the Constitution.  Then you see what he does, what his beliefs and policies Are and you know the Effect of those policies. Clearly then, by his Actions, you know who and what he really is.\nBiden not only talks about his core beliefs but he actually goes about to implement them. This is true for everyone. \nSo, Bidens Actions prove he's Doesn't put America first and He doesn't Care about freedom. His policies have place America on a collision course of self- destruction and slavery.  His policies speak this loud and clear.\n(Retired,  USAF)🇺🇸",
        "good": "16",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "demandthetruth",
        "time": "11 September, 2022",
        "context": "9-11 was an inside job, as to whether Bush had anything to do with it, well, nothing out of the question on that. There was too much evidence that something was majorly fishy about 9-11. From the terrorist that flew the planes not being detained when they were known about and from the buildings collapsing the way they did whilst structural engineers stated it was not possible for burning kerosene (jet fuel) being able to cause that, just to name of couple of major red flags. Not even counting the secrecy behind the collapsed buildings themselves, no one was allowed near the materials without special permission.\nNo, there was nothing funny going on with 9-11, sure, and my grandmother was the queen of England.",
        "good": "3",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "zookah",
        "time": "11 September, 2022",
        "context": "Some shifty dealings went on with the insurance of the twin towers right before they fell if I remember right. We went to the middle east for lithium don't let anyone tell you otherwise.",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "F100",
        "time": "11 September, 2022",
        "context": "Flat Earth, Fake Moon Landing, JFK Junior is Alive, “Lizard People”, etc are just some of the many conspiracies created by the Feds to discredit real conspiracies and genuine inquiries. ",
        "good": "5",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "conservativeNana191",
        "time": "11 September, 2022",
        "context": "Reading he liberal comment proves that Mr Wright knows what he is talking about. ",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Coolcajun82",
        "time": "11 September, 2022",
        "context": "See? I knew all those Kamala interviews were fake....no one can be that mentally buggard. And Biden falling off a stopped bike and saying \"let's go brandon\" on national tv.....no way that really happened....its just...too....awesome. ",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Jeff.Idaho",
        "time": "11 September, 2022",
        "context": "The thing about deepfakes is beyond 720p; with current technology, they are easy to prove fake. It might seem counterintuitive as a quality deepfake of 1080p appears more real to the human eye than, say, 240p, but that is how it works. \nAs resolution increases, the difficulty of creating goes up exponentially. At the same time, the comparative processing power to disprove goes down linearly. No matter how perfect a 4k image is to create, it will take many times less processing power to prove it fake than creating.\nSo why are low resolutions easier to fake? It has to do with the number of pixels required. At low resolutions, there are far fewer items to process. At higher resolutions, far more. However, proving a fake requires only a certain number of \"false\" pixels to conclude validity. As the number of pixels checked increases, the percent needed to be proven \"false\" decreases. This makes them harder to create and easier to detect. (easier being relative to the original creation time.)\nTLDR: You can fool the Human eye with massive time invested, but a computer can prove validity in a fraction of that time. Think of it like this. It took a British mathematician 15 years to calculate pi accurately to 528 places. Meanwhile, a modern Apple mac computer can calculate a million digits in 2.3 seconds. If you were presented with 1000 digits of PI and had to prove all 1000 digits, even if you had the correct version to reference, it would take you ~2.3 seconds per number.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "1772weareriots",
        "time": "11 September, 2022",
        "context": "Nothing new.\nWe see that daily from the inculcated trolls in here.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "nothingbuta",
        "time": "11 September, 2022",
        "context": "Got any of Robin Meade? ",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "F100",
        "time": "11 September, 2022",
        "context": "Odd timing of this article, don’t you agree? \nMr. Smith in Full Effect ",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "randysloan",
        "time": "11 September, 2022",
        "context": "some deepfake's are true you just halve to know which one's",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "MarkBinder716",
        "time": "11 September, 2022",
        "context": "He is correct. \nJust look at how many Democrats still think we did NOT find WMD in Iraq.\nOr how many Democrats still think Trump colluded with Russia. \nThey are a gullible bunch.",
        "good": "10",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "chidog402",
        "time": "11 September, 2022",
        "context": "Why does the government make these deep fakes then? You try to  impress your fake reality onto the world then are aghast when people actualy believe you. Tell the world the truth. You can start with the fake moon walk.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "shanedaughtry",
        "time": "11 September, 2022",
        "context": "I don't believe anything I see or hear anymore and question everything. I don't trust the government ever.",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "F100",
        "time": "11 September, 2022",
        "context": "Reminder that they use ridicule to stifle inquiry. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "themoretruthfultruth",
        "time": "11 September, 2022",
        "context": "Debunking is its own problem. Take 2000 mules for example. I saw lots of debunking articles but they didn't really live up to the title. If liberals don't like something they are quick to jump on the debunked wagon. All it takes is a good title and a few sentences.",
        "good": "11",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "billofrights1776120",
        "time": "11 September, 2022",
        "context": "How many times have the MSM \"fact checkers \" \"dubunked\" something and got it wrong? What a joke of an article. ",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "tomdahl",
        "time": "11 September, 2022",
        "context": "Don’t watch the adds, just vote republican so you can sleep at night.  Democrats are a disaster.",
        "good": "14",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "MoreMajorum",
        "time": "11 September, 2022",
        "context": "Democrats still believe Putin put Trump in the White House, seriously.  ",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cultiekiller",
        "time": "11 September, 2022",
        "context": "There must be a bad video of trump about to come out that fox is trying to get ahead of and call a “deep fake” to protect to the corrupt golden one.",
        "good": "0",
        "bad": "8",
        "replies": []
    },
    {
        "user_name": "TimeStandsStill",
        "time": "11 September, 2022",
        "context": "Yeah, we know.  We’ve lived it since Trump won.  And they’re still going after him. ",
        "good": "16",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "BornAndRaisedInTheOnceGreatAmerica",
        "time": "11 September, 2022",
        "context": "RUSSIA RUSSIA RUSSIA, How many Brain dead Libbies and Dems Still believe that LIE from Hillary and the FBI!",
        "good": "13",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "thankschina898",
        "time": "11 September, 2022",
        "context": "Everyone needs to remember  \"some people did some things\".",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dontdrinkthekoolaid888",
        "time": "11 September, 2022",
        "context": "Deepfake is real!  Just look at Biden who couldn't get but a fraction of seats filled a rallies... And he got more votes that any other president?!  \nYeah, right!",
        "good": "14",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "galoman_returns",
        "time": "11 September, 2022",
        "context": "Best deep fake ever: Donald and Fox saying the 2020 election was stolen.",
        "good": "2",
        "bad": "15",
        "replies": []
    },
    {
        "user_name": "blueflower",
        "time": "11 September, 2022",
        "context": "The bible predicted this. Revelation 13:15. There is nothing new under the sun.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Dr.a#maga#2024",
        "time": "11 September, 2022",
        "context": "There's a lot more to 9/11 than civilians are aware of. including staged events. I know this to be factual, since I've worked in the Industry for several decades. \n\nBeware of false knowledge, it is more dangerous than ignorance. \n\nGeorge Bernhard Shaw 1856-1951 ",
        "good": "4",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "F100",
        "time": "11 September, 2022",
        "context": "Political Correctness is Communist Propaganda. They tell you obvious lies yet you’re forced into silence & submission and eventually you start repeating the false narrative. It’s no wonder they consider you as “cattle”. ",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "F100",
        "time": "11 September, 2022",
        "context": "The only thing “elites” are good at is pushing propaganda that makes you think they have everything set in stone. These people are going to try and end up failing. Science, for lack of better term, will stop them. Real science, not pop culture, obey your incompetent masters being larped as “Science.” This propaganda is meant to demoralize you, it’s all they’re good at, they have no idea what they’re doing and think they know exactly what they’re doing. If the situation was hopeless, their unprecedented propaganda would be unnecessary.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "arthur061",
        "time": "11 September, 2022",
        "context": "REMEMBER   9 - 11  ❗️❗️❗️\nI DO❗️❗️❗️\nREMEMBER   CHARLES   E .  SABIN   ,,,, PENTAGON ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "retiredrealnewspaperman",
        "time": "11 September, 2022",
        "context": "Whenever someone accuses you, it is time to do a thorough background check on them and their accusations compared to their own actions. ",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "welovedesantis",
        "time": "11 September, 2022",
        "context": "It always amazed me that both those towers came straight down just like every building implosion I've ever seen. The small explosions in the building just before they came down just like the explosions in other imploded buildings. I'm not saying I agree with that but it does make one think. We needed a reason to invade Iraq and Afghanistan.",
        "good": "3",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "F100",
        "time": "11 September, 2022",
        "context": "Anytime someone says the word “Debunk” online I immediately know they’re lying to me. ",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "r.i.d.",
        "time": "11 September, 2022",
        "context": "In 2024 Trump will resume cleaning out the very rotten, and decayed swamp.",
        "good": "10",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "commonpeaceful",
        "time": "11 September, 2022",
        "context": "There’s nothing “deepfake” about planes and people that turn into subatomic particles upon impact that are reduced beyond identification or 50,000 Architects and engineers for 911 truth because the physics and facts don’t add up. 9/11 the inside job has not been debunked. Don’t even try to insult anyone with a enough common sense to question the “official” narrative. ",
        "good": "6",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "chidog402",
        "time": "11 September, 2022",
        "context": "Although she wasn't in the best of health, she passed suddenly. Did her 5th vaccine kill her? ",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "chidog402",
        "time": "11 September, 2022",
        "context": "Did the queen die from her 5th vaccine?",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "Olympus",
        "time": "11 September, 2022",
        "context": "I believe it was Mark Twain who said that it's easier to fool a person than it is to convince that person that they've been fooled.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "F100",
        "time": "11 September, 2022",
        "context": "Q: What do the Globalists at the U.N. use for their flag? \nA: A map of the Flat Earth! \n🤣",
        "good": "4",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "PīwakawakaFromNZ",
        "time": "11 September, 2022",
        "context": "No different than the \"big lie\".  Even that it's been debunked a million times people still believe it. Because it resonates with their emotions.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "milucylu8",
        "time": "11 September, 2022",
        "context": "🤣🤣🤣🤣they trying hard to flip ur minds😁🤣🤣🤣🤣. you know whats right and whats wrong. they are adorable 😍 🤣🤣🤣🤣🤣",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Shutooooop",
        "time": "11 September, 2022",
        "context": "One name….mike obama….I WIN!!!…..",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "JosephinSac375",
        "time": "11 September, 2022",
        "context": "Still waiting to see Flight ✈️ 93 wreckage.  In 60 years. I have never Not seen the wreckage of a passenger jet being hauled into a hangar and shown to the public. I'm not some conspiracy nut, just sayin.  ",
        "good": "3",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "F100",
        "time": "11 September, 2022",
        "context": "If Bob Lazar is a hoaxer, why did ~someone~ wipe his education and employment history?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "0ldtime'r'",
        "time": "11 September, 2022",
        "context": "After...all...these..yrs...I've....learned...to...live.......amongst....\nWashington....thugs.....and...you....don't...see...me....swinging...axes....at......anyone...but.....never...ask...me...to.....send...a....birthday...card....to....BUSH....or...LIZ..CHENEY....or...all.....those.....names.....I've....read...that....are.....involved......in.....3,000+lives.....lost........on...9/11",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "BigBadJohn",
        "time": "11 September, 2022",
        "context": "Half of Americans, it has been determined,  are actually sheep disguised as Democrats.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "milucylu8",
        "time": "11 September, 2022",
        "context": "keep proving it wrong🤣! you respond so it must be true😆. your so desperate to prove it wrong! otherwise you wouldn't mention it!!!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "MachE",
        "time": "11 September, 2022",
        "context": "Meanwhile.....Bill Clinton confirmed that he believes in the Peter principle.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "0ldtime'r'",
        "time": "11 September, 2022",
        "context": "corporate..MEDIA,....need..I....say..more!",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "f.foo",
        "time": "11 September, 2022",
        "context": "There are still people in the Country that  believe the \"Deep Fake\" Automaton, programmed to read a Teleprompter and  masquerade as a Duly Elected President is actually a living, cognitively fit Human being with a Soul, Morals and Ethics. ",
        "good": "12",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cjr1982580",
        "time": "11 September, 2022",
        "context": "The internet was supposed to bring the world together. The truth is that humans are not mature enough for the technology we have. ",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tom61",
        "time": "11 September, 2022",
        "context": "Hell. You still have people that believe that the Earth is flat....",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "HaroldBaker",
        "time": "11 September, 2022",
        "context": "Well we all know when a democrat says the election was rigged you better believe it the 2016 election the Russians fix it Stacey Abrams the election was fixed 2020 election Trump said the election was fixed he gets impeached ",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Shutooooop",
        "time": "11 September, 2022",
        "context": "Just look at bidens earlobes, they are different, past pics show the same ear lobes. Two different ear lobes are impossible.  80 yr old breaks a leg, then seen jogging in two weeks…..can debunk the obvious",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "voteoutdirtydems",
        "time": "11 September, 2022",
        "context": "If it's nefarious in nature, the Dems are using it. You can bet your life in that. ",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "usahaspoliticalcancer",
        "time": "11 September, 2022",
        "context": "People will believe anything because they haven't developed the skills of commonsense to do otherwise. Young people are no longer allowed to figure out, find out things for themselves. They are being programmed at a very young age starting at three years old in most cases. Its those personal experiences of learning on ones own, that gains knowledge in behavioral patterns that leads to know how to separate fact from fiction. And of course the fiction keeps getting more outlandish as time goes on. And those that have been programmed to believe everything they are told by their Leftist programmers, are gullible to every word like a sponge is to water.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "DoRealWork",
        "time": "11 September, 2022",
        "context": "Religion and Royalty has trained the masses to believe in fakeness. ",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "greymatter132",
        "time": "11 September, 2022",
        "context": "Why is this a surprise; our government leaders lie to the face of the American people, even when current events contradict what they say, and people believe the lies. Liars are evil, no matter in person or electronic. Liars are successful because, in the general sense, people want to believe people are honest. ",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "NChGeorgalis",
        "time": "11 September, 2022",
        "context": "People who believe what is not true are democrats and they have always existed regardless of technology.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "spartacus311",
        "time": "11 September, 2022",
        "context": "Just like the Mar-a-Lago raid, the first impression is what people believe. Right or wrong, show a good opening optic, and it’s real.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "getalife2019",
        "time": "11 September, 2022",
        "context": "yes,  they're called democRats ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "iowapd",
        "time": "11 September, 2022",
        "context": "I don't consider myself as someone who believes in most of conspiracy theories. However, a couple of decades or so ago, had you asked me if the FBI could have pulled the stunts they have recently, I would have said \"no way\"\nThere is no evidence th 2020 election was undermined by hackers?\nHow do we know?  Have any states contacted each voter and done a comparison?  My credit cards have been compromised at least 3 times.  I knew because I saw the transactions.  Was my electronic vote compromised? I don't know and no one else does. ",
        "good": "20",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "lyindems050",
        "time": "11 September, 2022",
        "context": "Kinda like the deep fake the FBI and DOJ just did on Trump.",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "planetary",
        "time": "11 September, 2022",
        "context": "I think the bigger issue right now is that the media has become so brazenly biased that it will actively squash stories that aren't favorable to Democrats, which is the exact opposite of what journalists are supposed to do. When you really think about it, it's extraordinary: In a democracy, the so-called free press doesn't just ignore stories that could hurt Dems/help GOP candidates, it pressures online platforms to censor users from talking about or posting links to those stories. That's Chinese government-level stuff. No doubt Xi Jinping himself is impressed by the US left.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "AccessDenied343",
        "time": "11 September, 2022",
        "context": "Inside job? No, it was an outside job by the globalists. They probably used one of our CIA black projects which officially they don't exist.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "coffeehubby",
        "time": "11 September, 2022",
        "context": "You mean those videos where Biden is talking coherently?",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "basspro699",
        "time": "11 September, 2022",
        "context": "Biden got 81 million votes ? He couldn’t, and still can’t get a handful of people to attend his rally/speech. Sure he got 81 million votes",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "voteoutdirtydems",
        "time": "11 September, 2022",
        "context": "Look for the deep fake of President Trump doing something the Democrats can use to railroad him again. Coming soon to a liberal news station near you. ",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "666god999",
        "time": "11 September, 2022",
        "context": "And the young people go with the flow.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "protrump,prousa",
        "time": "11 September, 2022",
        "context": "Chinese dominion voting machines - the deep fake ",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "juliobytheschoolyard",
        "time": "11 September, 2022",
        "context": "You are lied to daily, step back and use your brain and common sense.  The truth will come to you.   the haters will try and poison you.  ",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mcal4",
        "time": "11 September, 2022",
        "context": "excelsior!  i love my country, but i fear my government.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "robstall",
        "time": "11 September, 2022",
        "context": "Which one of these court jesters is the real Biden? Out of the 81M \nwill the real voters please stand up.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "devilstorch",
        "time": "11 September, 2022",
        "context": "One thing for certain, after 9/11, our government will lie to us, and our government will attack us, and our government will use propaganda to influence the gullible and easily manipulated to believe their lies to control us.\nDC is a a Swamp. It's a cesspool of corruption and greed, and the worst kind of people trying to seek control over every last American. ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "scouser1010",
        "time": "11 September, 2022",
        "context": "Most of them are called the voters ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "taser317",
        "time": "11 September, 2022",
        "context": "You see this as election days get really close one side will put out a lying video that slams the opponent.  Zero facts to back up what they said.  Just horrible attacks.  People then go to the polls with that image in their minds and vote according.  ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dr.vu",
        "time": "11 September, 2022",
        "context": "When your hand is in the cookie jar every time we switch on the lights, it’s easy to believe the security footage showing you eating cookies.  Especially when you have a second hand in the security footage. ",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "johndoesr",
        "time": "11 September, 2022",
        "context": "Wow....that article took a lot of effort to write. Morgan is right however, some folks will never be convinced otherwise even after debunking. I do know two people that still believe the moon landing was faked.............",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sardonicsemite",
        "time": "11 September, 2022",
        "context": "Deepfakes also allow Real videos to be called \"deepfake\"... like the real videos of biden from the 1990's and The video of him bragging about what he did as Vice President (to Ukraine), all labeled \"deepfake\", and then ignored. \n     Its like This article is a Prep-piece for doing exactly that... calling real videos \"possibly\" fake...  ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "frilly",
        "time": "11 September, 2022",
        "context": "The problem is the American people are lied to and tricked constantly. We are kept in the dark for our own \"good\". There is so much corruption in our politics we can never be sure of what's true and what's not.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "just4laughs",
        "time": "11 September, 2022",
        "context": "Democrats lie, it's their core tenet.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Apache150",
        "time": "11 September, 2022",
        "context": "Deep fake didn’t start with the advent of video. Politicians and pundits have been doing it for centuries. ",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "slave",
        "time": "11 September, 2022",
        "context": "A disgusting human behavior is about to get worse",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "thatswhatyouget",
        "time": "11 September, 2022",
        "context": "One thing I will say for people. As a whole, we are not much better than mindless sheep, and it's true that a percentage of us will believe absolutely anything. If someone says Trump broke into the white house and tried to kill biden with a potato peeler, guaranteed some people will believe it. The only question is, how many? I'd say between 10 -15%.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "titanictwenties",
        "time": "11 September, 2022",
        "context": "The best line from that interview is the Mark Twain quote: A lie can travel halfway around the world while the truth is putting on its shoes.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "fdeno",
        "time": "11 September, 2022",
        "context": "A long winded way of saying what Churchill said decades ago, \".....a lie gets half way round the world before the truth has a chance to get its pants on\"",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ghost311",
        "time": "11 September, 2022",
        "context": "Seems like everything is a “national security” issue these days. It’s rather annoying.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dtr01d",
        "time": "11 September, 2022",
        "context": "Believe nothing you hear; half of what you see.  ",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "MB1918",
        "time": "11 September, 2022",
        "context": "Afghanistan and Ukraine both have 1 thing in Common. They Contain Huge amounts of Rare Earth Metals. Ukraine having Europe's Largest deposit. Metals not OIL that is needed for future Technology and  Green movement. How convient the U.S was involved in both Wars\n\n Nobody is talking about it either.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "redav143",
        "time": "11 September, 2022",
        "context": "“The biggest problem with the internet is you never know what’s true.”\n- Abraham Lincoln",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Blood_on_Dems_Hands",
        "time": "11 September, 2022",
        "context": "I didn’t believe 9/11 was an inside job until Covid when “science” was supposed to have “debunked” “conspiracy theories”. Yeah, that play of the playbook has been exposed. ",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jpcook",
        "time": "11 September, 2022",
        "context": "\"Wag The Dog\".......  I could only wish that Bobby DeNerdo was a 'deepfake'....",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "numbersdontlie854",
        "time": "11 September, 2022",
        "context": "The deepfake expert is Biden himself.\nHe knocked off Trumps “Make America Great Again” with “Build Back Better”. But in all reality, “These Aren’t the Droids You’re Looking For” has been the real ongoing theme in his deep-faked Presidency as his admin and media attempt to run cover daily for his “America Last” policies.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "voteoutdirtydems",
        "time": "11 September, 2022",
        "context": "The only people who would believe it are the indoctrinated sheep of the left. They are so gullible it makes you wonder how they made it out of the birth canal. ",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "no3putts612",
        "time": "11 September, 2022",
        "context": "What you need to know about the modern democrat party can be summed up by the answer the late Senator Harry Reid gave to the question “why did you lie about Mitt Romney not paying taxes.”  His answer: “(because) it worked…”",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "grot706",
        "time": "11 September, 2022",
        "context": "Why should people trust your \"debunking\"?",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "denniscerasoli065",
        "time": "11 September, 2022",
        "context": "What I have to say isn't nice but it's true. Those that believe something that has been debunked are by and large Democrats they are the least intelligent on the issues. They also tend to be Democrat those that live off government entitlements as in food stamps and Medicaid if indeed they even bother to vote. They will believe anything the media tells them because research isn't in their vocabulary their main interest how to keep the checks coming. I used to run my own neighborhood variety store in a lower then middle class neighborhood trust me I know what I'm talking about.",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "MB1918",
        "time": "11 September, 2022",
        "context": "Imagine naming a Bill \"Inflation Reduction Act\"  While claiming there is no Inflation",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "humanish",
        "time": "11 September, 2022",
        "context": "quick someone deepfake me winning the lottery",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "scf8169",
        "time": "11 September, 2022",
        "context": "\"To this day, there are still people who think 9/11 is an inside job, that Bush did it. You will still have a certain percentage of people that even if you debunk it and disprove it, they'll believe the deepfake.\" \nYou've never done a very good job of that, actually.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "mockingbird",
        "time": "11 September, 2022",
        "context": "Most of the news is a deep fake",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "baronhydron",
        "time": "11 September, 2022",
        "context": "Media lied about President Trump every day 3 times a day and Biden got 20 million more votes than Obama !",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "OrangeStrawberry",
        "time": "12 September, 2022",
        "context": "The whole problem started with Section 230 giving immunity to the platforms. You simply cannot give publishers carte blanche to permanently allow anyone to post whatever they want including unvetted defamation. It is simply too easy to ruin a reputation built over a lifetime in 30 seconds with no legal liability by the owner of the megaphone such as Yelp. ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "s1k4",
        "time": "12 September, 2022",
        "context": "Too bad good examples are not cited in this article.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "EverythingisaHoax",
        "time": "11 September, 2022",
        "context": "MAGA have proven this. ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "GreenSage",
        "time": "11 September, 2022",
        "context": "Well, let's be fair on this point. When someone thinks of \"cybersecurity\" as in \"cybersecurity expert\" what do people immediately point to? They think of CIA, FBI, Anon, and then Iran, Chinese Firewall officers, and finally Russian spies.\nIf your significant other was associated with--or worked for even-- any of those agencies listed...would you be able to fully trust them? Unless you're a pacifist/pessimist/masochistic who doesn't rely on logic and rationality...you would never fully trust them.\nEDIT: And if you're wondering how this ties into the article...the government often hires useless contractors as Subject Matter Experts in the said field. Another arm of the government/law not to trust. And the daisy chain just continues.\nAnd this \"cybersecurity expert\" has the gall to say we should support him at his word. Go take a hike buddy.",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "letemeathope625",
        "time": "11 September, 2022",
        "context": "These deep fake believers are called Democrats and we need to avoid them wherever possible!",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "onfulldisplay",
        "time": "11 September, 2022",
        "context": "This is nothing new for as long as I can remember I have said people hear what they want to hear, this is from decades of working retail.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dinn",
        "time": "11 September, 2022",
        "context": "Well, people still believe the 2020 election was stolen from Trump, so what need or value is evidence?  It's all about emotion these days.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "angryfrightenedred",
        "time": "11 September, 2022",
        "context": "Once you debunk it people still believe it? I’ll take GOP voters for $500 Alex",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ooooooooooooooooooooooooooooooooooooo",
        "time": "11 September, 2022",
        "context": "ABC, CBS, NBC, MSNBC, CNN PBS  NPR  NY Times, Boston Globe, LA Times, Washington Post, AP, Reuters,  ESPN, ",
        "good": "0",
        "bad": "0",
        "replies": []
    }
]