[
    {
        "user_name": "dogsofwar2",
        "time": "1 day ago",
        "context": "Why don’t members of NEA vote this person out. Unless of course membership agree with the spew this leader is giving.",
        "good": "17",
        "bad": "0",
        "replies": [
            {
                "user_name": "likefrieswiththat",
                "time": "1 day ago",
                "context": "It's the money. Not skills, or kids, or parents, or community, or schools, or business, or government, or civility...",
                "good": "5",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "commonscents028",
        "time": "1 day ago",
        "context": "As it was mentioned in the article, Is it any wonder our schools are in the deplorable state they are in with someone so ill-informed in charge of one of the unions? A brief glance at the history of the Founding of the U.S. will tell you that nearly all of the Founders from the northern states opposed slavery and that many in the south had serious reservations about it. I guess if you get your \"historical (or hysterical)\" information from The 1619 Project misinterpretation is inevitable!",
        "good": "66",
        "bad": "1",
        "replies": [
            {
                "user_name": "alwaysrightoo411",
                "time": "1 day ago",
                "context": "Colleges train teachers how to\"teach\" .. The graduates learn methodology.  They rarely have a degree in anything except 'education\" ... Their knowledge of history, science, math, physics, astronomy, biology, genetics, is practically zero.🧐🙃🤣🤪🥸🤪😣☹️😢😭😱",
                "good": "14",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "majorityrule?",
                        "time": "1 day ago",
                        "context": "their knowledge may be zero but indoctrinaters don't care.",
                        "good": "5",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "nannmurphy",
                                "time": "1 day ago",
                                "context": "Indoctrinating is so much easier than educating.  \n\nEducating requires knowledge, and the skills and caring to find ways to break down material and communicate it to young people who do NOT think in the same manner as the teacher.  \n\nIndoctrinating only requires emotional commitment to a set plan, and a willingness to force conformity on students.",
                                "good": "2",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "user_name": "amerfirst970",
                        "time": "1 day ago",
                        "context": "Yes!   An important fact for parents to recognize.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "wastrel968",
                        "time": "1 day ago",
                        "context": "It's true. When I went to high school, the physics teacher had a master's degree in physics, not education. Ditto the chemistry teacher and at least one English teacher. This insistence on an education degree and \"certification,\" which is controlled by the teacher's union, has ruined education. And the administrators of schools pile more work upon teachers, work that has nothing to do with education but is simply busywork. And \"lesson plans\" are not needed. You choose a textbook appropriate to the level of the class, and you work your way through it.",
                        "good": "4",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "cordopolitin070",
                        "time": "1 day ago",
                        "context": "If they actually taught how to teach.... and that is a BIG IF...",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "nannmurphy",
                        "time": "1 day ago",
                        "context": "Even 40 years ago, they were not teaching as much \"methodology\" as they were training ED majors to join-serve-obey the union no matter what, to conform to the pack when it comes to \"education philosophy\" fads, and to put adult convenience ahead of student needs/information.  Scorn the students, despise the parents, fight to keep school separate and secret were already being preached.\n\nThey did still teach some things - like \"Don't write 'trick' questions on quizzes or exams; the point of testing is to determine the rate of success in gaining and maintaining knowledge and skills, NOT to prove the teacher can outsmart their own students.\"  With pre-purchased programs, that's no longer a thing; on my kid's tests, way too many questions are incomplete or offer \"multiple choice\" answers where ALL the options are incorrect...and even more questions are definitely designed to \"trick\" the students, to the point where a lot of class time with better teachers winds up  wasted on educating students about the bizarre testing \"games.\"",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "amerfirst970",
                "time": "1 day ago",
                "context": "The 1619 project is not history.   It is political advocacy.  The fact that some public schools want to treat it as history taught to students is malicious mismanagement.  It is scary that many schools have adopted this nonsense.",
                "good": "34",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "daveh.200",
                        "time": "1 day ago",
                        "context": "1619? I can't remember...   Was that when Columbus bumped into North America or was that when the Mayflower landed?  This history thing is so hard!",
                        "good": "3",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "flagman51",
                                "time": "20 hours ago",
                                "context": "Just remember that history and truth are two things that remain constant",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "user_name": "Shadowplay",
                        "time": "1 day ago",
                        "context": "Pretty easy really. The U.S. did not exist in 1619, they need to complain to the countries in control then, France, Britain, etc. The US abolished slavery less than 100 years after becoming a nation. Faster than any country in history.",
                        "good": "4",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "brennenstuhl",
        "time": "1 day ago",
        "context": "The 3/5's compromise involved slaves, but not actually about slavery itself. It was about people trying to boost their state's say in the affairs of the nations, the same reason why we went with the bicameral legislature - because big states naturally wanted it based on population, and small states wanted all states equal.\n\nHeck, tell me half the squabbling over DC Statehood isn't over what way they'd vote.",
        "good": "53",
        "bad": "0",
        "replies": [
            {
                "user_name": "danew",
                "time": "1 day ago",
                "context": "Slaves were not allowed personhood or the right to vote, yet Southern States demanded they be counted as whole persons to boost their numbers in the House of Representatives. Northern States resisted; hence the 3/5ths compromise.",
                "good": "22",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "majorbummer",
                        "time": "23 hours ago",
                        "context": "The correct explanation given by danew is a perfect example of how we \"deplorables\" know more about our history than an \"educated person\" like Randi Weingarten.",
                        "good": "3",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "Joebammy3.0",
                "time": "1 day ago",
                "context": "That’s correct but it doesn’t fit the liberal narrative so they must rewrite history. ",
                "good": "14",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "trollhunterdee",
                "time": "1 day ago",
                "context": "To be more precise. Democrats wanted their slaves to count because like then and like now, democrats own the black vote.",
                "good": "9",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "noname11",
        "time": "1 day ago",
        "context": "\"All men are created equal.\"  Except for slaves who we won't even count as a whole person.  She has a point.  The founders were very flawed individuals.",
        "good": "1",
        "bad": "14",
        "replies": [
            {
                "user_name": "huronia945",
                "time": "1 day ago",
                "context": "Great to see how you've finally reached human  perfection.",
                "good": "5",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "JustKeith",
                "time": "1 day ago",
                "context": "Everyone is flawed.",
                "good": "4",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "ambiguous",
                "time": "1 day ago",
                "context": "Look up the definition of presentism, please.",
                "good": "5",
                "bad": "1",
                "replies": []
            },
            {
                "user_name": "dave7976",
                "time": "1 day ago",
                "context": "How moronic!  You are completely clueless as to how RADICAL our Constitution was and for many countries STILL is.\nCodifying the individual God-given or human rights that those chosen to govern can't overturn or skirt for citizens?   It had never been done.  \nThe ability to foresee issues and how to solve them with a democratic process for each state while retaining the individuality of each state as they joined the union?  It was a work of genius among many that argued bitterly to ensure the best product.\nSlavery was ONLY allowed to ensure that we won our freedom from a monarchy yet written into the fabric of our Constitution so that it could NOT last.  A pathway to get better from the times they lived in and was expounded on again and again by those that wrote it.  \n\nThe biggest tell is that they KNEW they were flawed and worked to overcome those flaws to create a Constitution that could withstand time itself!  They knew they would be judged and probably judged by a standard that those doing the judging would be so frail and flawed themselves that were unable see the genius or appreciate how hard they worked to provide every check and balance they could to make sure their new nation would never experience the tyranny they had to fight to escape!  \nYOU are indeed flawed beyond your understanding!!",
                "good": "2",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "huronia945",
                        "time": "16 hours ago",
                        "context": "Unfortunately, a Constitution is only as good as the people who hold a belief in it.\n\nWhen people turn their back on their Constitution, it's only a piece of paper.\n\nIt's the people who are the problem, not the Constitution.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "dave7976",
                                "time": "12 minutes ago",
                                "context": "Agreed.  Until one of \"the people\" come up with a BETTER solution then it's all just noise.  Usually the noise of whining leftists complaining about how it stymies their leftist agenda!  \nHowever that Constitution also calls for citizens to ensure we never live under tyranny again.",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "flagman51",
                "time": "20 hours ago",
                "context": "It was the practice of the day and if you would avail yourself to a study of true history you would find that the vast majority of slaves were sold into slavery by their own people in Africa",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "noname11",
        "time": "1 day ago",
        "context": "Go back and read the history of the Constitutional Convention.  The issue of slavery was intentionally ignored, because it was the only way the southern states would agree to join the union.  The south should have been excluded from the very beginning.  We'd all be better off today.  We certainly wouldn't have endless culture wars like we do today.",
        "good": "2",
        "bad": "10",
        "replies": [
            {
                "user_name": "animosque",
                "time": "1 day ago",
                "context": "Most of the \"Southern states\" were all territories of Spain at that time. It was only the original 13 English colonies that declared Independence from England.",
                "good": "4",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "noname11",
                        "time": "1 day ago",
                        "context": "Virginia, North & South Carolina, and Georgia were part of the original 13.  They were slave states.",
                        "good": "3",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "chinlewitt",
                                "time": "1 day ago",
                                "context": "As was Maryland.",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "saveenergyguy",
                "time": "1 day ago",
                "context": "Well, if it was just the northern states in the US, you'd have a bumper crop of arrogant entitlement, to be sure.  And I can't help southern states have to teach you northern states how to behave in a civil manner.",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "InknQuill700",
                "time": "1 day ago",
                "context": "Virginia, the power house of that time would have crushed this young country.  Thus the issue of slavery was pushed aside.",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "broncocinco",
        "time": "1 day ago",
        "context": "Could we please get a teacher to weigh in on what they think of Weingarten after all these mishaps?  How can they possibly continue to be supportive??",
        "good": "12",
        "bad": "0",
        "replies": [
            {
                "user_name": "NOTaMARXISTDem",
                "time": "1 day ago",
                "context": "She is clueless and the union is a Marxist organization, hence I left the union and no longer contribute a cent to them. Almost ready for retirement thank God!",
                "good": "18",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "noname11",
        "time": "1 day ago",
        "context": "The Constitution was so inadequate, that the Bill of Rights (The first 10 amendments) had to be included before even one state would agree to ratify it.",
        "good": "2",
        "bad": "11",
        "replies": [
            {
                "user_name": "saveenergyguy",
                "time": "1 day ago",
                "context": "That's not true either.  The Bill of Rights was drafted and sent to the states in October 1789 - after 11 states had ratified the Constitution.  NC waited until the Bill of Rights had been sent and ratified the Constitution with the BoR in November 1789.  Rhode Island was the last in 1790 to ratify the Constitution.",
                "good": "8",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "patriot67477",
                "time": "1 day ago",
                "context": "You can repeal an amendment, but the Constitution is nonnegotiable.  So having a separation of the two in order to gain support of every colony makes total sense.  Not sure  why that makes it \"inadequate\".",
                "good": "9",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "InknQuill700",
                        "time": "1 day ago",
                        "context": "Don't confuse the Bun Boi.  History and facts just annoy them.",
                        "good": "2",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "alane68",
                "time": "1 day ago",
                "context": "And yet MILLIONS around the world would rather live here. Boy, makes you think!! I am sure someone, somewhere else, say China or N Korea would trade places with you in a heartbeat!!!!!",
                "good": "3",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "captbob642",
        "time": "1 day ago",
        "context": "She's a walking, talking example of everything that's wrong with education today.",
        "good": "39",
        "bad": "1",
        "replies": [
            {
                "user_name": "myheadhurts",
                "time": "1 day ago",
                "context": "Walking billboard for Jenny Craig. Sets a bad example of healthy eating for the kids",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "uncledooky",
        "time": "1 day ago",
        "context": "I'm a 50 year old man that quit school and got a GED started working and self educated myself by reading a lot. When I hear these \"College Educated \" people speak it makes me glade that I didn't further my education in school.\nGood lord",
        "good": "52",
        "bad": "1",
        "replies": [
            {
                "user_name": "patriot67477",
                "time": "1 day ago",
                "context": "I'm college educated, and they make me sick too.",
                "good": "30",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "genegausman",
                        "time": "1 day ago",
                        "context": "Ditto.",
                        "good": "5",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "alwaysrightoo411",
                "time": "1 day ago",
                "context": "I taught at the university and college level from 1964 until 2019.  The graduates from the K-12 system were unbelievably worse in 2019 than they were in 1964.  The work ethic changed dramatically.",
                "good": "15",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "hansenwt",
                        "time": "1 day ago",
                        "context": "And that was before stay at home teaching...",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "satchmolives",
                        "time": "1 day ago",
                        "context": "I went back to school later in life. On the first day of freshman English I walked into the classroom and written on the white board was:\n\nIts it’s\n\nTo too two\n\nThere their they’re \n\nShe then had to explain what each one meant. A COLLEGE ENGLISH CLASS!!! And no, it wasn’t a remedial class.",
                        "good": "2",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "nannmurphy",
                        "time": "1 day ago",
                        "context": "It's not coming from the kid's initial \"work ethic.\"  It's coming from the teachers' \"work ethic\" - or rather, their severe lack of same.  Parents are lectured before kindergarten that they must NOT teach their kids many normal things, but they MUST teach their kids everything a normal adult would expect the school to teach (physical writing skills, typing, etc.)\n\nSchools pointedly refuse to teach math tables, damaging kids' future speed at more complex problems (new phenomena:  kids are faster at extreme \"imaginary numbers\" matters than they are at multiplying 7 times 9).  Basic addition methods have been replaced by ridiculous processes that take better drawing skills and half a page of paper for each simple one or two-digit problem.  \n\nWriting isn't taught.  Not the physical skill, not proper letter shaping.  Nothing is repeated enough to develop speed or dexterity, so writing is torture (school excuse:  \"Nobody's gonna write in the future; it's all computers!\")  No structure is taught:  spelling \"rules\" are boring and somehow \"insulting\" to certain \"groups,\" and forget ideas about paragraph or essay structure.  Essays are requested starting in FIRST GRADE, because it's \"cute\" and who needs to learn form or build up knowledge of communication methodology?  Oh, and \"typing\" is only taught for a few weeks or months in Kindergarten as a matter of nearly useless online games, where kids hunt-and-peck for letters to save puppies crossing rivers, etc.  So they can't type either",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "nannmurphy",
                        "time": "23 hours ago",
                        "context": "As I try to explain below, it's not that the kids are all that lazy, it's that they really cannot do the work, and are \"schooled\" to display uncaring, even defiant emotional reactions when the subject comes up.\n\nElementary schools refuse to teach basics, even simple things like reading a clock, or alphabetical order (letters need to be learned in vocal \"developmental\" order, which makes NO sense, really).  Kids who raise their hands willingly are declared \"rude\" (seriously) and their parents hear complaints of \"showing off.\"  Kids who don't raise their hands soon learn that being active in class is loudly punished with insults, so they stay quiet; better to part of the pack getting the teacher's general expression of despair and disdain, than to be singled out for personal abuse).\n\nParents are assured that the \"scattershot\" approach to every subject is fine, that \"it will all come together\" in sixth grade, where everything will miraculously \"synthesize\" and suddenly our kids will \"know\" all the math, science, English lit, writing, etc.\n\nBut when 6th grade comes, the teachers are upset, and keep repeating that they do not have time to teach what should have been learned before, so they simply won't do it.  They pass them along, too often for social reasons, or by \"elevating\" lousy work.\n\nThe students don't know, or can't fix it.  Being \"still\" and \"conforming\" is all they get rewarded for.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "datj",
                        "time": "20 hours ago",
                        "context": "My experience was similar to yours and many in my department felt the same way. I taught freshman level courses from 1987 to 2014. The 1990's were not bad, but the new century brought students with no reasoning skills and little knowledge.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "victory5",
        "time": "1 day ago",
        "context": "She really needs to have a re-do of 6th grade history and it needs to be completed at a non-public school with a real history teacher.",
        "good": "33",
        "bad": "1",
        "replies": [
            {
                "user_name": "mmaviation",
                "time": "1 day ago",
                "context": "The major problem her is she is re-doing or rewriting 6th grade history for all our kids right now. This is the main problem in our society, liberals want to rewrite history",
                "good": "11",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "amerfirst970",
                        "time": "1 day ago",
                        "context": "Yes.   That is the communist method of indoctrination used in the Soviet Union and China.",
                        "good": "2",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "covvboy",
        "time": "1 day ago",
        "context": "If ignorance is bliss......... just call her bliss. Besides, they will change the definition to suit their agenda's anyway....",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "norseman554",
        "time": "1 day ago",
        "context": "So... the head of the teacher's union doesn't even know basic history?\nPerhaps it is time to reconstruct the education system in this country, starting with the elimination of the NEA.  It is clearly failing our youth and subsequently the entire country.",
        "good": "47",
        "bad": "1",
        "replies": [
            {
                "user_name": "yankeedogg",
                "time": "1 day ago",
                "context": "Maybe she is a math teacher....????",
                "good": "5",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "norseman554",
                        "time": "1 day ago",
                        "context": "The head of the national teacher's union, and doesn't know basic history.  What she taught makes no difference whatsoever.",
                        "good": "10",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "yankeedogg",
                                "time": "1 day ago",
                                "context": "Maybe she is an art teacher....",
                                "good": "3",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "nannmurphy",
                                        "time": "1 day ago",
                                        "context": "My kid's Art Teacher knows a heck of a lot more history than this sorry excuse of an ex-teacher.  Please stop making excuses.  Being incompetent, ill-educated, or forgetful in a field you don't focus on may be okay, UNLESS you try using your \"unknowledge\" to score points or make policy for everyone else..",
                                        "good": "1",
                                        "bad": "0",
                                        "replies": [
                                            {
                                                "user_name": "yankeedogg",
                                                "time": "22 hours ago",
                                                "context": "Maybe she teaches Home Ec....",
                                                "good": "0",
                                                "bad": "0",
                                                "replies": []
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "user_name": "nannmurphy",
                        "time": "1 day ago",
                        "context": "No excuse.  She's ranting about the subject; if a history teacher spouted nonsense about physics, inaccurate chemistry, or preached false math postulates or theorems, there would be no \"understanding.\"  You cannot teach - or \"lead\" teachers - if you haven't even developed the ability to recognize what you DON'T know.",
                        "good": "3",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "scottpm953",
                "time": "1 day ago",
                "context": "The real root cause is the Democrat Party.",
                "good": "18",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "tony—c",
        "time": "1 day ago",
        "context": "No one said that you have to be smart to be a teacher.  You just have to a Democrat union member.",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ConfederateFaceCaver",
        "time": "1 day ago",
        "context": "She sure triggered all the 2022 Confederates who worship their \"Heritage\" of treason\nhttps://www.foxnews.com/politics/trump-build-upon-our-heritage-not-tear-it-down",
        "good": "0",
        "bad": "5",
        "replies": [
            {
                "user_name": "ConfederateFaceCaver",
                "time": "1 day ago",
                "context": "https://www.foxnews.com/us/gop-lawmaker-celebrates-kkk-leader-birthday-alabama-john-lewis",
                "good": "0",
                "bad": "4",
                "replies": []
            }
        ]
    },
    {
        "user_name": "barenakedsalsa",
        "time": "1 day ago",
        "context": "No unions should be allowed when it involves taxpayer money. All the unions do is launder the money and contribute to Democrat candidates that is why unions have not been abolished but I have an idea that their days are numbered as far as education.",
        "good": "55",
        "bad": "0",
        "replies": [
            {
                "user_name": "joebrady052",
                "time": "1 day ago",
                "context": "It is the most ridiculous conflict of interest in America.  Teachers unions elect the mayor.  The mayor gives the teachers raises in return.  It's like me deciding who my next boss will be.",
                "good": "32",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "InknQuill700",
                        "time": "1 day ago",
                        "context": "SEIU runs California.   It's a fiscal reach-around.",
                        "good": "4",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "InknQuill700",
                "time": "1 day ago",
                "context": "Spot on.\nUnions have killed more jobs than they assisted.   Workers are robbed blind.  It's not 1930 anymore.  The unions are now the corruption.",
                "good": "38",
                "bad": "1",
                "replies": []
            },
            {
                "user_name": "rozie325",
                "time": "1 day ago",
                "context": "Unions are one of (not all of) the reasons so much manufacturing left the country decades ago.\nWhen they started telling companies how to run their business it was only a matter of time.\nThere was a need for them in the early part of the last century, now they have ruined any goodwill they collected along the way.\nThey failed to evolve their tactics and policies, its not the 1930's any more.",
                "good": "3",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "StoptheDNCatallcosts",
                "time": "20 hours ago",
                "context": "all teacher unions should be destoyed!!!",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "nonliberal1",
        "time": "1 day ago",
        "context": "Teachers Union. Nothing but a bunch of radical left wing Karens.",
        "good": "7",
        "bad": "0",
        "replies": [
            {
                "user_name": "InknQuill700",
                "time": "1 day ago",
                "context": "And Kens.   And other assorted newly created genders.",
                "good": "2",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "donthave1307",
        "time": "1 day ago",
        "context": "If you have ever watched the “man show n the street” interviews that Fox does on college campuses, asking kids whose parents are forking over hundreds of thousands of dollars for their Ivy League “sheepskin” you understand just how far education in this country. Look up an 19th  Century High School final exam and get one of these geniuses to take it. After 5 years at Harvard, they won’t pass it. Neither would their professors. ",
        "good": "74",
        "bad": "0",
        "replies": [
            {
                "user_name": "huntingtonsmythe",
                "time": "1 day ago",
                "context": "\"If you had an economics class...\" and she said, \"Actually, that was my major\".",
                "good": "1",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "tinker1949",
                "time": "1 day ago",
                "context": "I've seen those and it's embarrassing that most of them are clueless about the country they live in or how it came to be!  Lots of \"book\" learning without any knowledge at all!  Some even thought we fought the Chinese for our independence!",
                "good": "8",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "daveh.200",
                        "time": "1 day ago",
                        "context": "\"Some even thought we fought the Chinese for our independence!\"\n\nHey, maybe they are secretly brilliant people that can see into the future.  Actually, never mind...",
                        "good": "2",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "tinker1949",
                                "time": "23 hours ago",
                                "context": "LOL!",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "InknQuill700",
                "time": "1 day ago",
                "context": "Jay Leno did the same thing... yes, they were edited... but still very revealing.",
                "good": "4",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "teacherinca",
                "time": "1 day ago",
                "context": "Campus Reform videos are good too as they specifically challenge liberal ideology. Ask them about communism and they say it's good. Ask them why Cubans wave American flags and they are stumped.",
                "good": "18",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "daveh.200",
                        "time": "1 day ago",
                        "context": "Ask them about the 1st Amendment and besides those that aren't sure what it is, many of the too few that do would like it eliminated.  (Well, at least for others that they don't agree with.  Guess who the others are?)",
                        "good": "2",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "iwokeup",
                "time": "20 hours ago",
                "context": "History has been removed from the public schools by the democrats in large part because they have, in our past, been the bad guys. They now depend on ignorance of history in order to rewrite it, filling in the blanks with their own narrative, and the current day kiddies don't have a clue. The democrats would never get elected if they were honest. They have to lie and twist the truth to push their con on gullible people.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "triple555",
        "time": "1 day ago",
        "context": "Waste of air",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "randomthoughts575",
        "time": "1 day ago",
        "context": "Over the past few months Weingarten has shown several times that she should consider resigning her position and returning to HS as a freshman.    Perhaps repeating HS will help her to learn some facts about our country and its history.\n\nProviding the teachers in the classroom aren't supporters of hers....lol",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "'OlRooster",
        "time": "1 day ago",
        "context": "Not everyone shares a \"bright\" gene.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ChaosSurfer",
        "time": "1 day ago",
        "context": "Odd educational fiefdoms are everywhere now.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "KingUltraMAGA",
        "time": "1 day ago",
        "context": "Keep in mind that there are NO TEACHERS in America's government schools.  America's government schools will only hire unionized democrat propagandists to brainwash your children.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mkedave",
        "time": "1 day ago",
        "context": "Another lefty who has no idea what the \"3/5\" compromise was about.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "angryfrightenedred",
        "time": "1 day ago",
        "context": "That’s seven, SEVEN fox articles in a matter of hours where a single individual is slammed or ripped. Seriously guys, this isn’t a news organization",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "fantheflame",
        "time": "1 day ago",
        "context": "She knows math. We have found the lowest common denominator!",
        "good": "13",
        "bad": "0",
        "replies": [
            {
                "user_name": "saveenergyguy",
                "time": "1 day ago",
                "context": "and constantly pander to it.",
                "good": "8",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "bentarmbarpracticioner",
                "time": "1 day ago",
                "context": "and she's trying to reduce our children's education to a fraction of what's required.\na little math pun there - enjoy.",
                "good": "5",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "fantheflame",
                        "time": "1 day ago",
                        "context": "🤪",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "they-them",
        "time": "1 day ago",
        "context": "Slavery has been over and done with for 150 yrs.  Move on.  This narrative is just so BORING.",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "californiamojo",
        "time": "1 day ago",
        "context": "That should surprise me, but it doesn’t",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "smartthink",
        "time": "1 day ago",
        "context": "She knew it was something like that.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "grazer",
        "time": "1 day ago",
        "context": "Vote Republican one time and clean house.   Take your kids out of public schools for a year and clean house.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bentarmbarpracticioner",
        "time": "1 day ago",
        "context": "I'm confused. Is it liberalism that makes women look hideous, or are only hideous looking women liberals? It's a conundrum.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "likefrieswiththat",
        "time": "1 day ago",
        "context": "She speaks to her base at their level. The same base teaching our kids...",
        "good": "43",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bigislandhawaiian580",
        "time": "1 day ago",
        "context": "I wonder what the ratio was for the Blacks in Africa who were sold into slavery by other Blacks there?\n\n0/5 sounds about right.\n\nI'll be this woman NEVER talks about that though.",
        "good": "11",
        "bad": "0",
        "replies": [
            {
                "user_name": "mistercarl",
                "time": "1 day ago",
                "context": "I think you mean 1/1",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "jimc5499",
        "time": "1 day ago",
        "context": "Those that can do, do.\nThose that can't do, teach.\nThose who haven't a clue.  Union rep?",
        "good": "11",
        "bad": "0",
        "replies": [
            {
                "user_name": "NondeGuerre",
                "time": "1 day ago",
                "context": "Those who can’t do, teach, and those who can’t teach, administer.  Unsurprisingly, here she is, administering the teacher’s union.",
                "good": "9",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "bobobobo9",
                "time": "1 day ago",
                "context": "The great pundit Woody Allen put it well:\n\"Those who can, teach. And those who cannot teach, teach Phys Ed.\"",
                "good": "2",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "mamas061",
        "time": "1 day ago",
        "context": "In defense of Randi. She recently said the shutdowns in NYC aren’t the reason the kids are falling apart. She is clearly right. It’s got more to do with the idiocy of the teachers.",
        "good": "11",
        "bad": "0",
        "replies": [
            {
                "user_name": "grazer",
                "time": "1 day ago",
                "context": "There's no defense for Weingarten.  She has to go.",
                "good": "7",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "mamas061",
                        "time": "1 day ago",
                        "context": "Agreed. I was being sarcastic.",
                        "good": "3",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "grazer",
                                "time": "1 day ago",
                                "context": "Good to know.  It will not change until she is gone.",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "liberaser",
        "time": "1 day ago",
        "context": "My highly educated young supervisor thinks that Austria and Australia are the same country that is located somewhere in South America! Wow and I only have a trade school education.",
        "good": "20",
        "bad": "1",
        "replies": [
            {
                "user_name": "they-them",
                "time": "1 day ago",
                "context": "So sad.  In Europe, students know world geography.  It's embarrassing.",
                "good": "11",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "😆UncleBrandonIsStillYourPresident😆",
                        "time": "1 day ago",
                        "context": "Somehow, I doubt Europeans can point out all 50 states.",
                        "good": "3",
                        "bad": "1",
                        "replies": [
                            {
                                "user_name": "they-them",
                                "time": "1 day ago",
                                "context": "You have the mentality that the world revolves around what you know.  They know world geography.  I'm sure you don't.",
                                "good": "0",
                                "bad": "1",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "user_name": "scottpm953",
                        "time": "1 day ago",
                        "context": "Problem is when they come to visit the US, they plan to see the Statue of Liberty in the morning and the Grand Canyon in the afternoon.",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "cmwyo",
        "time": "1 day ago",
        "context": "I was going to write something about \"how someone, so ignorant, could've risen to such a high level of politics and position?\"  Then I looked around at state and federal government people, and it became self-evident.  It really is amazing just how unknowing of basics, this person is!?!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "laraza4u",
        "time": "1 day ago",
        "context": "teach the kids that if it weren't for the black tribal kings imprisoning black prisoners there would be NO slavery... black tribal kings sold blacks into slavery...",
        "good": "6",
        "bad": "3",
        "replies": [
            {
                "user_name": "shockedcanuck",
                "time": "1 day ago",
                "context": "I get it.  So the plantation owners were FORCED to accept slaves.  They had no choice because they couldn't stand up to the \"black tribal kings\".   It all makes sense now.  The poor Southern states were victims, not those \"black prisoners\" that they owned.",
                "good": "3",
                "bad": "5",
                "replies": [
                    {
                        "user_name": "bobobobo9",
                        "time": "1 day ago",
                        "context": "Yeah sure. Don't even try and understand the subject/issues.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "adwhatnow",
                        "time": "1 day ago",
                        "context": "The point is that slavery has existed throughout known history and not just in the U.S.  Oddly, it still exists now, though not in the U.S.",
                        "good": "2",
                        "bad": "1",
                        "replies": []
                    },
                    {
                        "user_name": "laraza4u",
                        "time": "1 day ago",
                        "context": "the black tribal kings were 'forced' to sell them????",
                        "good": "1",
                        "bad": "1",
                        "replies": []
                    },
                    {
                        "user_name": "mistercarl",
                        "time": "1 day ago",
                        "context": "it pretty much worked the same as in your mother land...",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "bobobobo9",
                "time": "1 day ago",
                "context": "True and awful.",
                "good": "0",
                "bad": "1",
                "replies": []
            },
            {
                "user_name": "analytical_reasoning",
                "time": "1 day ago",
                "context": "LIES OF OMISSION ARE STILL LIES.    IF there was no one buying slaves, then there wouldn't have been any blacks sold into slavery.   Half truths are full lies.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "americaisnumberone",
        "time": "1 day ago",
        "context": "There will be massive protests on Nov2, in parks across the country.  Conservatives need to band together and tell the world what we stand for.  Casting a ballot is NOT the way to do that because if you use a voting machine, it will flip your R vote to D.  Same with mail in ballots, they go into the machines.  Watch 2000 mules.  The machines NEED your ballot, otherwise they cannot flip it.  Don't give it to them.  Protest on social media and in the parks on Nov2, don't contribute your ballot to a democrat landslide-- they will shove it in your face!",
        "good": "1",
        "bad": "3",
        "replies": [
            {
                "user_name": "gojimdandy441",
                "time": "1 day ago",
                "context": "Go away, Chairman Kim.",
                "good": "1",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "americaisnumberone",
                        "time": "1 day ago",
                        "context": "Do you really want to help the democrats?  I certainly don't.  BTW, the trolls here are foreign trolls, who generally support us.  Make us think we are more than we are.  Im not one of those, just a fan of 2000 mules.  Have you seen it?  Do you really not know what Im talking about?",
                        "good": "0",
                        "bad": "1",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "Marine-82-35",
        "time": "1 day ago",
        "context": "It was questioned before the Revolution too. See: abolishionist Benjamin Franklin. ",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tripacer123",
        "time": "1 day ago",
        "context": "Wait til someone tells her the first black slaves did not arrive in what later became america in 1619!!! The basis for the whole 1619 narrative is WRONG!      A person calling themselves a school teacher should know better.  As for slavery in america, that subject has been beaten to death, nobody cares, if they did they would know more people are enslaved now than in the entire history of america.   Being black is nothing special, time to grow up!",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "SheikYaboody",
        "time": "1 day ago",
        "context": "At the time of the American Revolution, Jefferson was actively involved in legislation that he hoped would result in slavery’s abolition. In 1778, he drafted a Virginia law that prohibited the importation of enslaved Africans. In 1784, he proposed an ordinance that would ban slavery in the Northwest territories.",
        "good": "41",
        "bad": "0",
        "replies": [
            {
                "user_name": "1964libertarian",
                "time": "1 day ago",
                "context": "Don't confuse these democrat reprobates with facts; that's not how they \"feel\" history was.",
                "good": "32",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "Mack",
        "time": "1 day ago",
        "context": "Nearly all of the greatest thinkers in history came from a non union education system.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "deminsanity",
        "time": "1 day ago",
        "context": "This lady shouldn't be in charge of a 7 Eleven..disband the NEA",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "beyondrhetoric",
        "time": "1 day ago",
        "context": "I'm with the teacher on this. If the Founding Fathers believed slavery was inherently evil they would not have participated in it.",
        "good": "3",
        "bad": "9",
        "replies": [
            {
                "user_name": "adwhatnow",
                "time": "1 day ago",
                "context": "We are products of our times.  Expecting that everybody in the past should have acted through the filter of your current political correctness is inane.",
                "good": "3",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "beyondrhetoric",
                        "time": "1 day ago",
                        "context": "Calling out human trafficking as political correctness corrupt. I'm saying slavery was evil in the past, present and future. If it was acceptable in the past simply means an inherent evil was tolerated and even supported in the past. There were people in the past that recognized it.  Sadly it took hundreds of thousands of death in a Civil War to do away with it.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "supremeranter805",
                "time": "1 day ago",
                "context": "I disagree. Without a comprise there would have been no United States, just two or more smaller countries that would have been taken over by England or France.\nThe south would still have had slavery and would probably have had it longer.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "beyondrhetoric",
                        "time": "21 hours ago",
                        "context": "It was an inherent evil. It was inherently evil for it to be recognized in the Constitution.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "supremeranter805",
                                "time": "17 hours ago",
                                "context": "Realistically, it had little effect on slavery at the time. Had the Constirution not included something the southern states would have formed their own Country with slavery even more codified.\nHad africans not kidnapped their countryman to be sold into slavery and had the whole world not been addicted to cheap southern cotton and tobacco slavery would have quickly died out. So I guess by your ‘logic’ the whole modern world was founded on evil.",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "realist1398",
        "time": "1 day ago",
        "context": "(((Randi Weingarten)))\nThat is all that needs to be known about (((Randi))).",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "joser14",
        "time": "1 day ago",
        "context": "\"Conservative radio host Joe Cunningham tweeted, \"Okay, students. Who would like to read to the class what Thomas Jefferson wrote about slavery in 1774 in his ‘A Summary View of the Rights of British America’?\"\n\nWho cares, it was ignored and Jefferson didn't push the issue and kept his slaves.",
        "good": "2",
        "bad": "3",
        "replies": [
            {
                "user_name": "Twister660",
                "time": "1 day ago",
                "context": "Hey donkey, democrats were the keepers of slaves, fought to keep slaves, let's abolish the word democrat woke crowd!",
                "good": "1",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "NotReally147",
                "time": "1 day ago",
                "context": "He contributed greatly to the documents that form the basis of the liberties that we ALL enjoy today. Slavery was not a US institution, it was a worldwide institution, as old as humanity and still exists today in some areas of the world. There was a bloody war fought in this country to abolish slavery and the vast majority of combatants and casualties were White. The history of every country in the world is complicated, ours is no different with the exception being that ours has evolved and corrected course thanks to those documents and system of government inherited from our forefathers.",
                "good": "5",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "InknQuill700",
                "time": "1 day ago",
                "context": "Wow, skipping over the big picture, gleaming bits that fit into an agenda!\nSound a poorly researched term paper at best.",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "darkness@noon",
        "time": "1 day ago",
        "context": "With all due respect, perhaps she should spend some time in a kibbutz and learn something.  Anything.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "txbart",
        "time": "1 day ago",
        "context": "Weingarten has always had a public school teacher's view of everything. That literally means the view of someone very poorly educated, and a slightly less than Luke warm IQ. How else do you explain their understandings and opinions? An Education Degree is a degree in Pedagogy,  not Math or Science. Not even History or English. The Education Colleges are the academic slums of every University in America. It shows in their speaking, teaching, and work. Why else do you think our public  schools are failing?",
        "good": "11",
        "bad": "1",
        "replies": [
            {
                "user_name": "amerfirst970",
                "time": "1 day ago",
                "context": "Also, because the Democrat national agenda has education by indoctrination as its foundation.",
                "good": "4",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "txbart",
                        "time": "1 day ago",
                        "context": "Great point!",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "flowerlover",
                "time": "1 day ago",
                "context": "All true. But what are we going to do about it?",
                "good": "2",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "txbart",
                        "time": "23 hours ago",
                        "context": "We can start with taking the school boards away from the education shills and giving them to parents. Then school choice and unencumbered vouchers.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "lotz160",
        "time": "1 day ago",
        "context": "slavery was all over the world it wasnt right but those were the times irish were slaves so i was told on and on and on under her leadership  and out of reality comments students are going to private school to learn the basics and then they will decide on their own what to think there leaving in droves shell be gone and get offered a job in social work ina sanctuary city that pleases biden",
        "good": "4",
        "bad": "0",
        "replies": [
            {
                "user_name": "bobobobo9",
                "time": "1 day ago",
                "context": "Yup. And, alas, slavery still thrives in a few 'successful' countries.",
                "good": "1",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "Dr.A.J.",
                "time": "1 day ago",
                "context": "Slavery has always existed. Slavery exists today. Slavery will always exist.\n\nRemember, people, we're all just fancy monkeys.",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "independenceavenue",
        "time": "1 day ago",
        "context": "Just another reason to vote straight red in November. It's the only way.",
        "good": "9",
        "bad": "1",
        "replies": [
            {
                "user_name": "shockedcanuck",
                "time": "1 day ago",
                "context": "...the only way to white-wash America's history of slavery?",
                "good": "1",
                "bad": "12",
                "replies": [
                    {
                        "user_name": "entertainmentrus",
                        "time": "1 day ago",
                        "context": "Mind your own business.",
                        "good": "2",
                        "bad": "1",
                        "replies": []
                    },
                    {
                        "user_name": "porkandbeans940",
                        "time": "1 day ago",
                        "context": "The way Canadians pretend they never enslaved Indians or Africans?",
                        "good": "4",
                        "bad": "1",
                        "replies": []
                    },
                    {
                        "user_name": "mistercarl",
                        "time": "1 day ago",
                        "context": "It's always the canadian who thinks they know something when they know nothing, ay?",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "genegausman",
        "time": "1 day ago",
        "context": "What a lot of people forget is it was blacks in Africa that captured and sold their own kind into slavery.  Plus people always act like slavery was unique to antebellum America.  It wasn't.  It existed for thousands of years.",
        "good": "8",
        "bad": "1",
        "replies": [
            {
                "user_name": "bobobobo9",
                "time": "1 day ago",
                "context": "And still does exist in parts of the world we do business with daily.  Like china and india, just to name 2.",
                "good": "6",
                "bad": "1",
                "replies": []
            },
            {
                "user_name": "rustbucket",
                "time": "1 day ago",
                "context": "How about the approximate 80% , of slaves, who died crossing the Sahara Desert on foot, bought by the Muslims ",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "shockedcanuck",
        "time": "1 day ago",
        "context": "Not sure what she tweeted that was wrong.  The 3/5ths compromise was enacted in 1787, long after the 1776.  You can try to put all the lipstick on the pig that you want, but slavery was alive and well before and after the founding of the country.  No sure why the excuse of \"it was for taxation purposes only\" is valid, but nevertheless, blacks (not African-Americans at the time) were officially considered 3/5 of a human.",
        "good": "3",
        "bad": "6",
        "replies": [
            {
                "user_name": "porkandbeans940",
                "time": "1 day ago",
                "context": "It is too complicated for you to understand.",
                "good": "5",
                "bad": "1",
                "replies": []
            },
            {
                "user_name": "mistercarl",
                "time": "1 day ago",
                "context": "what were they called in your country?  Do you somehow think you are insulting someone here?  You are not.  You are just showing your disdain for the country whos protection you live under...you are welcome to it because ware Americans and that's what we do.",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "InknQuill700",
        "time": "1 day ago",
        "context": "Love that photo of Hoey worshipping and staring down on her.  Two of a kind.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "hukre",
        "time": "1 day ago",
        "context": "Weingarten had too many lunches with Kamala.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Ted.Kennedy's.Scuba.Academy",
        "time": "1 day ago",
        "context": "Logic has been trying to chase down libs for decades, but they've always been faster.",
        "good": "13",
        "bad": "0",
        "replies": [
            {
                "user_name": "InknQuill700",
                "time": "1 day ago",
                "context": "Not faster, but they know how to hide in the low places where mold grows.",
                "good": "3",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "CyanBus",
        "time": "1 day ago",
        "context": "Imagine if she had the publishing company of school history books change intros that say slavery in the Americas to just slavery in the US? Wouldn't work so well for their agenda when it shows the US being the country with one of least amount of slaves, just behind the 2% in UK and -1% brought into other European nations. Most slaves were in countries run by what we call now, minorities.",
        "good": "9",
        "bad": "0",
        "replies": [
            {
                "user_name": "shockedcanuck",
                "time": "1 day ago",
                "context": "So your defense of American slavery is that America was not the worst?  Wow.  Just wow.",
                "good": "0",
                "bad": "10",
                "replies": [
                    {
                        "user_name": "porkandbeans940",
                        "time": "1 day ago",
                        "context": "Canada had slavery until 1833 or so. You somehow think you're superior because Canada outlawed slavery a few years before the US? Weird.",
                        "good": "3",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "mistercarl",
                                "time": "1 day ago",
                                "context": "The canadians like this one love all the benefits of security and economy that they gain by their geographic nature, but they are so jealous of the U.S. that this is their outlet for it.",
                                "good": "1",
                                "bad": "0",
                                "replies": []
                            },
                            {
                                "user_name": "analytical_reasoning",
                                "time": "1 day ago",
                                "context": "FYI, outlawing something doesn't make it go away.   There are slaves in almost every country today.",
                                "good": "2",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "user_name": "rustbucket",
                        "time": "1 day ago",
                        "context": "Slavery still exists ",
                        "good": "3",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "kidneybean",
        "time": "1 day ago",
        "context": "And the sad part is she will remain ignorant by choice. She will spew this misinformation again next week.",
        "good": "4",
        "bad": "2",
        "replies": [
            {
                "user_name": "shockedcanuck",
                "time": "1 day ago",
                "context": "Like Trump?",
                "good": "1",
                "bad": "5",
                "replies": [
                    {
                        "user_name": "kidneybean",
                        "time": "1 day ago",
                        "context": "I bet Trump knows why the 2/5 came to be. He can learn.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "shockedcanuck",
                                "time": "1 day ago",
                                "context": "You're right...most of Trump's properties are worth 2/5 of the value he declared for them.",
                                "good": "1",
                                "bad": "3",
                                "replies": [
                                    {
                                        "user_name": "kidneybean",
                                        "time": "1 day ago",
                                        "context": "Trumps not even a part of this story. You injected 45 into it. TDS",
                                        "good": "3",
                                        "bad": "1",
                                        "replies": []
                                    },
                                    {
                                        "user_name": "mistercarl",
                                        "time": "1 day ago",
                                        "context": "You live in the country that elected the man-boy Justin...there's really no where for you to take the conversation after that!",
                                        "good": "1",
                                        "bad": "0",
                                        "replies": []
                                    },
                                    {
                                        "user_name": "mistercarl",
                                        "time": "1 day ago",
                                        "context": "declared where?",
                                        "good": "1",
                                        "bad": "0",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "user_name": "adwhatnow",
                        "time": "1 day ago",
                        "context": "No, like those that accuse Trump.",
                        "good": "1",
                        "bad": "1",
                        "replies": []
                    },
                    {
                        "user_name": "mistercarl",
                        "time": "1 day ago",
                        "context": "Do you really want to talk country leaders???  Coming from canada????",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "mistercarl",
                        "time": "1 day ago",
                        "context": "Welcome to the club, glad you are in...I like Trump also!",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "22889964",
        "time": "1 day ago",
        "context": "Disband these clown 🤡 unions",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "johngreat1409",
        "time": "1 day ago",
        "context": "3/5. Was very generous considering what we have today.  Im thinking 1/10 might be more accurate.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "doclr11",
        "time": "1 day ago",
        "context": "Randi Weingarten promoting herself as an expert on history is like Vladimir Putin promoting himself as an expert on peace on earth.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "skylines",
        "time": "1 day ago",
        "context": "Randi Weingarten is a typical Liberal, she doesn't know jack about the history of slavery or how long it's been around before the US Constitution was made. Plus if she hates America so much why doesn't she pack her bags and leave.",
        "good": "2",
        "bad": "1",
        "replies": [
            {
                "user_name": "iamfemale712",
                "time": "1 day ago",
                "context": "Because she knows if she leaves, she loses her status.",
                "good": "1",
                "bad": "1",
                "replies": []
            },
            {
                "user_name": "fwelton045",
                "time": "1 day ago",
                "context": "She definitely does not understand the root of slavery, African tribe A defeats tribe B and sells all males at or above the age of puberty and unruly women (reduces the chances of a revenge attack and provides revenue) to Muslim traders who then deliver to the coast for transport.  It wasn't a bunch of white guys wandering around the jungle looking for peaceful natives.  It was the aftermath of war.",
                "good": "4",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "chasrad1",
        "time": "1 day ago",
        "context": "What is she talking about? She certainly read different history texts than I did when I was in college. Oh yeah, I forgot. Today you get to make up anything in history that you want to fit your narrative.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "patriot1976",
        "time": "1 day ago",
        "context": "I have to hand it to her.  More controversy means extending that paycheck.  If you keep muddling the waters, makes it hard to get fired",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "notwithoutreason967",
        "time": "1 day ago",
        "context": "When are people going to understand tha government-run education is just a bad idea? When are they going to understand that union-run education is just a bad idea?",
        "good": "6",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "majorityrule?",
        "time": "1 day ago",
        "context": "i see the picture of the vice-president smiling at randi. maybe kamala could tell us about  the slaves her ancestors had.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "righton999",
        "time": "1 day ago",
        "context": "These are the people who are indoctrinating your children.",
        "good": "2",
        "bad": "1",
        "replies": [
            {
                "user_name": "iamfemale712",
                "time": "1 day ago",
                "context": "Hoping one day they will become their own American Nazi's.\n\nWe will fight back for our children.",
                "good": "2",
                "bad": "2",
                "replies": []
            }
        ]
    },
    {
        "user_name": "DrNick-RetiredUSA1SG",
        "time": "1 day ago",
        "context": "Slavery's origin goes back thousands of years.   Racism, by all races, has been around for thousands of years.   Even today, some native Japanese want nothing to do with blacks or whites having relations with their race.  In the USA, we focus on the black issues, but not the native Indian issues, or the Asian issues, or some  of the other issues created by the past.  Evolution has been curing this situation.  I am 70 .. and my generation can faintly recall the \"blacks only\" water fountains of the 50s.  Give it another generation or two - and those \"fighting points\" of the 50-60-70s will be gone - replaced by something else to argue about (hopefully it will be a time when we are fighting over people who put catsup on eggs).   In school, let's talk about it ... in history class ...  but tell the truth.  Let the truth be judged by the student - and not the teacher.   Please.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rt1959",
        "time": "1 day ago",
        "context": "She is a threat to democracy.",
        "good": "10",
        "bad": "1",
        "replies": [
            {
                "user_name": "dyndoeth",
                "time": "1 day ago",
                "context": "and children",
                "good": "3",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "commonsensechickie",
        "time": "1 day ago",
        "context": "How are these students supposed to learn about slavery, when they have trouble locating the Berlin Wall or whom was buried in Grant’s Tomb?",
        "good": "5",
        "bad": "1",
        "replies": [
            {
                "user_name": "flowerlover",
                "time": "1 day ago",
                "context": "Who was buried . . .",
                "good": "0",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "DependsOnJoe",
        "time": "1 day ago",
        "context": "Kamala stares at this mutt like it has been hit by a car. \nWhy is this?",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "louietagooey",
        "time": "1 day ago",
        "context": "At one time unions were important in America for the workers sake. Now they are more of the problem than the solution. All unions should go the way of Jimmy Hoffa. ASAP!",
        "good": "5",
        "bad": "1",
        "replies": [
            {
                "user_name": "dyndoeth",
                "time": "1 day ago",
                "context": "Point taken...but my belief is that there should be no Unions for Public and Government Workers. I support the crafts...... not the bureau-rats",
                "good": "7",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "iamfemale712",
                        "time": "1 day ago",
                        "context": "Excellent, both of you. I said that 46 years ago when the first real job I had were thinking about a Union. I was dead set against it. They decided that they didn't want one. Guess I got my point out.",
                        "good": "4",
                        "bad": "1",
                        "replies": [
                            {
                                "user_name": "dyndoeth",
                                "time": "1 day ago",
                                "context": "Roger that ma'am",
                                "good": "1",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "amerfirst970",
                "time": "1 day ago",
                "context": "As long as unions can make political campaign contributions, they will serve the Democrat Party.   That is a big influence on elections.   There is no rational reason that it should be allowed.   Only individual citizens should be allowed to contribute.",
                "good": "3",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "redisyourfriend",
        "time": "1 day ago",
        "context": "wasn't she the wheres the beef lady on the old Wendy's commercials? You would think the leader of a children's education union should have birthed children of her own to be fully qualified. just saying. ",
        "good": "1",
        "bad": "1",
        "replies": [
            {
                "user_name": "iamfemale712",
                "time": "1 day ago",
                "context": "Maybe we should feel blessed she never did have kids. Like most of the Dims these days, either they are lesbians, or use abortions as a way to control . Maybe the latter is their way of getting a thrill of being able to legally murder.",
                "good": "1",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "chartard",
        "time": "1 day ago",
        "context": "Slavery is over, make it a chapter and move forward.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "foxisgreatamericannews",
        "time": "1 day ago",
        "context": "She got her talking points from the VP",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "lookyloo",
        "time": "1 day ago",
        "context": "My take from the Covid pandemic. \nTeachers aren’t to be admired. \nThey are union hacks who take take take. \nThey call themselves essential but were the ONLY ones who refused to DO THEIR JOB! \nAnd now they’ve become PROPAGANDISTS.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Lessron",
        "time": "1 day ago",
        "context": "While you're at it, Randi, would you change constants like Pi and Epsilon to integers? It would make math a bit easier...",
        "good": "1",
        "bad": "1",
        "replies": [
            {
                "user_name": "flowerlover",
                "time": "1 day ago",
                "context": "well I think that's funny",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "lookyloo",
        "time": "1 day ago",
        "context": "From the woman who held the Ukraine flag upside down.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mikecarter",
        "time": "1 day ago",
        "context": "George Mason worked tirelessly on our constitution...in fact, he's known as the Father of the Bill of Rights. He refused to sign our constitution. Why? Because there was no clause forbidding slavery.",
        "good": "3",
        "bad": "0",
        "replies": [
            {
                "user_name": "iamfemale712",
                "time": "1 day ago",
                "context": "Always loved truth found in History. Thank you for sharing something important.",
                "good": "2",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "ttimest",
        "time": "1 day ago",
        "context": "Weingarten then went on to defend slavery by saying America was founded on Abortion in 1973.  I mean treating children in the womb as property with no rights is the very definition of slavery.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "justrg",
        "time": "1 day ago",
        "context": "The dimness of these people is unfortunately not surprising.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "foxisgreatamericannews",
        "time": "1 day ago",
        "context": "She’s woke so she’s not expected to be intelligent",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "emilia123575",
        "time": "1 day ago",
        "context": "The teachers union is not there for teachers or to improve teaching in America. They are a political action committee funded by captured members of the union who seem to have no say what is done with their money and what they politically support. If there is no problem WHY IS THEIR SUCH AN ACUTE SHORTAGE OF TEACHERS? AND WHY DO STUDENTS ACADEMIC SCORES KEEP DECLINING SUCH THAT \"THE GREATEST COUNTRY IN THE WORLD\" IS NOT EVEN RANKED IN THE TOP 25 IN THE WORLD ANYMORE. THAT IS COMPLETE AND UTTER INCOMPETENCE TO THE NTH DEGREE, BECAUSE THEY ARE FOCUSED ON WOKE IDEOLOGY AND ONLY SEE STUDENTS AS FUTURE SOCIAL JUSTICE WARRIORS. SCHOOLS ARE NO LONGER LEARNING INSTITUTIONS....THEY ARE INDOCTRINATION CENTERS.",
        "good": "11",
        "bad": "1",
        "replies": [
            {
                "user_name": "steve_in_penna",
                "time": "1 day ago",
                "context": "sorry, didnt read this. learn to type wwithout your caps-lock",
                "good": "0",
                "bad": "3",
                "replies": []
            }
        ]
    },
    {
        "user_name": "SuwanneeTim",
        "time": "1 day ago",
        "context": "All these folks calling Weingarten out seem to think the truth is relevant to her.  The truth is not relevant to Randi Weingarten ya'll.  Just The Narrative.  That is all that matters.",
        "good": "4",
        "bad": "1",
        "replies": [
            {
                "user_name": "commonsensechickie",
                "time": "1 day ago",
                "context": "Bingo!",
                "good": "2",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "adwhatnow",
        "time": "1 day ago",
        "context": "Them that can, do.  Them that can't, teach.  Them that be historically illiterate run Teachers' Unions.",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "lookyloo",
        "time": "1 day ago",
        "context": "There’s a reason it’s a famous saying.\n“ Those who can, do; those who can't, teach.”",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "helldawgydlux632",
        "time": "1 day ago",
        "context": "Conservative author Jim Hanson blasted Weingarten’s logic, tweeting, \"If America's leaders didn't question the idea of slavery, wouldn’t it have just been a 5/5 agreement?\n\nactually if they didn't question slavery, it would have been 0/5",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "pilgrim1620818",
        "time": "1 day ago",
        "context": "If history doesn't fit your narrative, change history! Randi is a power driven leader of a huge number of votes and a political powerhouse. Teacher's unions exist for the benefit of the teachers, NOT the students. They are the best example of the danger of public unions to our form of governance. Even FDR opposed public unions. Outlaw them!",
        "good": "44",
        "bad": "0",
        "replies": [
            {
                "user_name": "koreshwasright",
                "time": "1 day ago",
                "context": "Especially the UAW.",
                "good": "4",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "quitfreakingout",
                "time": "23 hours ago",
                "context": "She's a TYPICAL LIB that does/says EXACTLY as she has been COMMANDED \n\nUp Next:\nShe'll SWEAR that Lincoln was black",
                "good": "2",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "quitfreakingout",
                "time": "23 hours ago",
                "context": "These Libs are STILL really, really upset that slavery was abolished",
                "good": "1",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "tigerbythetail625",
                "time": "21 hours ago",
                "context": "100% Agree.",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "reasonabilityisdead",
                "time": "15 hours ago",
                "context": "Unions exist for the benefits of the unions.  Any benefits for the workers is a transactional cost.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "mountainrose74",
        "time": "1 day ago",
        "context": "The 3/5 rule was actually an anti slavery compromise.  The south did not want slaves to have the rights of citizens (especially the vote) but they did want to count them when they determined population numbers for determining the number of representatives each state would get to the House of Representatives.  The 3/5 compromise was a way of keeping the southern states from having enough votes to impose their values (including slavery) on the rest of the country.   It was assumed at the  time that slavery would soon fade away for economic reasons. Then Eli Whitney invented the cotton gin and made slavery more profitable.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "notademocrap",
        "time": "1 day ago",
        "context": "But she’s an expert on:\n1. Oyster shucking \n2. Clam diving \n3. Canyon yodeling",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "μολωνλαβε",
        "time": "1 day ago",
        "context": "If America’s founders questioned slavery there would not have been the heinous ‘3/5 compromise’ in the US Constitution.\n \n...and which political party fought for slavery?  Yup... Democrats.",
        "good": "10",
        "bad": "1",
        "replies": [
            {
                "user_name": "cks260",
                "time": "1 day ago",
                "context": "And which party tried to torpedo LBJ's 'civil rights act'....Yup...Democrats....Republicans had to vote in force...in both the house and senate to pass the act....democrats were still holding out for the ol' south....aka...wallace and byrd....",
                "good": "9",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "smooth-1",
        "time": "1 day ago",
        "context": "Whoopi- reaching brand new lows every single day.",
        "good": "2",
        "bad": "0",
        "replies": [
            {
                "user_name": "alphabet_people_burn_for_an_eternity",
                "time": "1 day ago",
                "context": "Look like shes gaining even more weight",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "smooth-1",
                        "time": "1 day ago",
                        "context": "She has never been so full of it so, yeah...not surprising she looks to be gaining.",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "cks260",
                        "time": "1 day ago",
                        "context": "Hope she dies of a massive stroke....slowly....in much pain....suffering day in and day out...",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "alphabet_people_burn_for_an_eternity",
                                "time": "1 day ago",
                                "context": "Eternities flames are not worth it",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "sczcepaniec",
        "time": "1 day ago",
        "context": "And there's Kamala smiling with progressive pride. Shut the Union down. There has to be another way!",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cks260",
        "time": "1 day ago",
        "context": "I was in the 'educational field' for 22 years.  I saw firsthand, the terrible effects of the nea on our educational system....It does not surprise me that she is so illiterate....I witnessed it firsthand within our staff...",
        "good": "7",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "likefrieswiththat",
        "time": "1 day ago",
        "context": "'Heroes Work Here' posters, 98% off (if you can do the math).",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "gojimdandy441",
        "time": "1 day ago",
        "context": "Randi, did you get the plate number of that truck?",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "cks260",
                "time": "1 day ago",
                "context": "It was a truck????.....well, that explains a lot....🙄..whew....",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "Bajfa",
        "time": "1 day ago",
        "context": "The 3/5 compromise was because , for the census, Democrats wanted to count all of their slaves for purpose of apportionment.  Had that been allowed to happen, the democrats would have had the power to prevent slavery from being outlawed.  The compromise was that non-free persons would only be counted as 3/5th a person.\n\nIt's amazing that Democrats try to castigate the GOP for devaluing the person hood of slaves, but don't bother to explain why.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "notimpressed654",
        "time": "1 day ago",
        "context": "Where are all of our CRT and 1619 defenders? The race hustlers seem to be missing from this conversation which is a pity, they'd be forced to reason with actual history.",
        "good": "3",
        "bad": "1",
        "replies": [
            {
                "user_name": "cks260",
                "time": "1 day ago",
                "context": "Reason???......sorry, they only deal in hysteria, fear and lies...",
                "good": "2",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "notimpressed654",
                        "time": "22 hours ago",
                        "context": "Too true",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "jakthezipper600",
        "time": "1 day ago",
        "context": "Fully paid for and pensioned baby sitteres are now going hard to protect their little kingdoms. forget the children; this is war.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "conebred",
        "time": "1 day ago",
        "context": "She's homely enough, was Randi once Randy?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "upurs!",
        "time": "1 day ago",
        "context": "She needs to be put down.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jethro04121",
        "time": "1 day ago",
        "context": "Why do Democrats exclude the history of the African Supply Chain???\n\nI guess it doesn't matter because it was Black-on-Black crime, just like we have in Democrat cities.",
        "good": "7",
        "bad": "0",
        "replies": [
            {
                "user_name": "analytical_reasoning",
                "time": "1 day ago",
                "context": "LIES OF OMISSION ARE LIES.    If no one was buying slaves the tribes who captured other tribes, wouldn't have been able to sell them to anyone.",
                "good": "0",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "LeskoBrandin",
        "time": "1 day ago",
        "context": "Abolishing teacher’s unions is a top priority.",
        "good": "13",
        "bad": "0",
        "replies": [
            {
                "user_name": "cks260",
                "time": "1 day ago",
                "context": "Correct, if we want to save our educational system...",
                "good": "3",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "alphabet_people_burn_for_an_eternity",
        "time": "1 day ago",
        "context": "Teach real history, like dems fighting a civil war to keep their slaves, and creating Jim crowe laws and the Klan after they lost said war",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "don’tmatter",
        "time": "1 day ago",
        "context": "It’s official: Randi Weingarten supports critical race theory.\n\n…And, she earns 5 1/2 times more than the average American. That’s how much she cares about children.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "noobmaster13",
        "time": "1 day ago",
        "context": "We all know by now they're all about children. From their mentality and wanting them as partners, pedos!",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "winnersnotwhiners",
        "time": "1 day ago",
        "context": "Yes, it's too bad all those Africans that were enslaving their own people and selling them down the river weren't thinking about the morality of it either, eh?   Can't buy what's not for sale.  \n\nMaybe this sus needs to head on over to Africa and give them a talking to since they're STILL enslaving their own to this day.  Then go talk to India.  And the ME.  They still engage in slavery to this day as well.",
        "good": "3",
        "bad": "1",
        "replies": [
            {
                "user_name": "analytical_reasoning",
                "time": "1 day ago",
                "context": "That is very close to a LIE.     LIES of omission are LIES.     You can't sell your own people as slaves if there is no buyers and they didn't sell their own people.   They sold people from other tribes that they captured!!!",
                "good": "0",
                "bad": "2",
                "replies": [
                    {
                        "user_name": "supremeranter805",
                        "time": "1 day ago",
                        "context": "So you’re saying it’s all right to enslave people as long as they are not part of your tribe?\nThat makes it Ok?",
                        "good": "2",
                        "bad": "1",
                        "replies": []
                    },
                    {
                        "user_name": "supremeranter805",
                        "time": "22 hours ago",
                        "context": "It appears our public school system did you the disservice of an indoctrination rather than the service of an education. Feel sorry for your largely mal-educated generation.",
                        "good": "0",
                        "bad": "1",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "usa726",
        "time": "1 day ago",
        "context": "Here's the problem with America's public schools,the teachers union......Wana be commies.........",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "righttime23",
        "time": "1 day ago",
        "context": "It's not hard to find a bunch of conservative cowards Who hide behind their own fears.",
        "good": "0",
        "bad": "9",
        "replies": [
            {
                "user_name": "righttime23",
                "time": "1 day ago",
                "context": "It's fun to hear them try to come up with excuses for their own lunacy",
                "good": "0",
                "bad": "2",
                "replies": []
            },
            {
                "error": "error"
            },
            {
                "user_name": "likefrieswiththat",
                "time": "1 day ago",
                "context": "A product, ladies & gentlemen. Nasty?, Check. Semi-literate? Check. Ill equipped to argue? Check.\nWell done, you found you.",
                "good": "5",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "righttime23",
                        "time": "1 day ago",
                        "context": "Why thank you it's nice to see you finally wake up",
                        "good": "0",
                        "bad": "2",
                        "replies": []
                    },
                    {
                        "user_name": "righttime23",
                        "time": "1 day ago",
                        "context": "If you can support their arguments please have at it they can't do it",
                        "good": "0",
                        "bad": "2",
                        "replies": [
                            {
                                "user_name": "righttime23",
                                "time": "1 day ago",
                                "context": "You know the funny part about historic facts\n they're facts even if you don't like them",
                                "good": "0",
                                "bad": "1",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "redintexas",
                "time": "1 day ago",
                "context": "Sure it is. Name one and why you think so.",
                "good": "4",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "righttime23",
                        "time": "1 day ago",
                        "context": "Okay let's start with Ron DeSantis\nHis assertion that the revolution somehow sparked disdained with slavery is ridiculous both in America and abroad abolitionists were already strongly petitioning against it. \nThe three fifth amendment wasn't a fight over slavery it was a fight over who was going to control the power in the federal government and how that shaped the southern states alliances with the North. \nWhether you were pro or anti was immaterial. the Constitutional compromise on slavery was designed to protect it",
                        "good": "0",
                        "bad": "4",
                        "replies": [
                            {
                                "user_name": "redintexas",
                                "time": "1 day ago",
                                "context": "I think you missed the mark by a country mile. That was a spandex stretch.",
                                "good": "2",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "righttime23",
                                        "time": "1 day ago",
                                        "context": "well at least it's not as slimey a story as how texas became a state",
                                        "good": "0",
                                        "bad": "3",
                                        "replies": [
                                            {
                                                "user_name": "redintexas",
                                                "time": "1 day ago",
                                                "context": "Texas fought for their independence., something you liberals abhor.",
                                                "good": "3",
                                                "bad": "0",
                                                "replies": []
                                            },
                                            {
                                                "user_name": "likefrieswiththat",
                                                "time": "1 day ago",
                                                "context": "ooh, justice gurl to da rescue! We gots sum fax!",
                                                "good": "1",
                                                "bad": "0",
                                                "replies": []
                                            }
                                        ]
                                    }
                                ]
                            },
                            {
                                "user_name": "righttime23",
                                "time": "1 day ago",
                                "context": "Hello! Hello!\nAnyone out there",
                                "good": "1",
                                "bad": "1",
                                "replies": []
                            },
                            {
                                "user_name": "likefrieswiththat",
                                "time": "1 day ago",
                                "context": "Try again without frothing at the mouth.",
                                "good": "1",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "jethro04121",
        "time": "1 day ago",
        "context": "When will people finally realize that Randi Weingarten is actually Anthony Fauci, in drag?",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "thinkingissoimportant",
        "time": "1 day ago",
        "context": "\"They want to teach our kids that the [American] Revolution was fought to protect slavery and that’s false.\"\n\nOkay - that was the Civil War.  Trick question.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "cfboink",
        "time": "1 day ago",
        "context": "I have three teachers in my neighborhood that I come in regular neighborly contact with. They are younger folks. While I’m always pleasant with them all, it doesn’t take a long conversation to understand they dumber than a box of rocks. After every short conversation I thank the good Lord I could send my children to a private school. It’s a shame, especially for the parents that see the problem but can’t afford private school. This all is fault of the insipid teachers unions. I remember when I was young being told A students became scientists,  B students became business leaders and C students became teachers. I didn’t believe it in my youth. I do now",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ProudAmericanMarky",
        "time": "1 day ago",
        "context": "The teachers union is all about protecting teachers, good ones, mediocre ones and bad ones.  That’s all they are for.  The firebrands rise to the top because regular folks teachers just want to do their jobs and stay out of politics.  That’s why you get nut jobs running the show.",
        "good": "12",
        "bad": "2",
        "replies": [
            {
                "user_name": "analytical_reasoning",
                "time": "1 day ago",
                "context": "Good employees don't need any union to protect them.   Only the lazy poor employees NEED a union.",
                "good": "5",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "shhsgirl041",
        "time": "1 day ago",
        "context": "Randi has never been the brightest bulb. ",
        "good": "7",
        "bad": "0",
        "replies": [
            {
                "user_name": "farfromlib710",
                "time": "1 day ago",
                "context": "She's running on solar and has not seen daylight in weeks!!!!!",
                "good": "4",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "hansenwt",
        "time": "1 day ago",
        "context": "Well this is what happens when you sign on to a narrative...you have to keep bending and getting more ridiculous on things that should not even be debatable.  She probably knows the history quite well...but this was the best way she could think of to spin another reason to support her agenda.  She didn't get it by many of you on here....but how many did she get it by on MSNBC and CNN etc....?",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "samuelwhittemore-1775",
        "time": "1 day ago",
        "context": "FDR said \"NO\" to public unions for a reason.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "lacyc",
        "time": "1 day ago",
        "context": "School vouchers.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "follownosheep",
        "time": "1 day ago",
        "context": "beware of any union that says it is for the kids",
        "good": "10",
        "bad": "0",
        "replies": [
            {
                "user_name": "incatnito727",
                "time": "1 day ago",
                "context": "Or politician.",
                "good": "2",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "46isanidiot821",
        "time": "1 day ago",
        "context": "She’s just trying to steal power that belongs with the parents.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ponder21",
        "time": "1 day ago",
        "context": "No one is alive today that owned slaves. Education might just be what educators need.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "doubldamyankee",
        "time": "1 day ago",
        "context": "The irony of the union leader with the word salad queen.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "venturagirl",
        "time": "1 day ago",
        "context": "I am somewhat astounded that after all the outrageous statements this Weingarten has made over the last couple of years that she is still employed.  She is nothing but a communist shill who sees the world through a Marxist/lesbian lens.  And she's in charge of one of the largest teachers' unions?  She should have been canned a long time ago.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "hidden",
        "time": "1 day ago",
        "context": "The sad reality is people who can't cut it in college often end up with teaching degrees because they are the easiest degree to get.",
        "good": "12",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "bobby408",
        "time": "1 day ago",
        "context": "Republicans need the suburban womans vote if they want to win anything in the midterm elections. Teachers live in the suburbs, so continuously trashing teachers is counterproductive to Republicans. Why do they do it, I will never understand.",
        "good": "0",
        "bad": "6",
        "replies": [
            {
                "user_name": "likefrieswiththat",
                "time": "1 day ago",
                "context": "Yeh, your understanding is a teeny tiny part of the issues of the day. Don't fret, better men & women got this.",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "incatnito727",
                "time": "1 day ago",
                "context": "Republicans are trashing the teachers' union leadership. There's a big difference. Weingarten's ignorance is only surpassed by her dishonesty.",
                "good": "5",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "bobby408",
                        "time": "1 day ago",
                        "context": "Is there anyone Republicans like.",
                        "good": "0",
                        "bad": "3",
                        "replies": [
                            {
                                "user_name": "mymothersdaughter048",
                                "time": "1 day ago",
                                "context": "The better question is:  Why do the Democrats hate America and Americans?",
                                "good": "1",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "jerico1173094",
                "time": "1 day ago",
                "context": "MANY YOUNG TEACHERS STILL LIVE WITH MOMMY AND DADDY!!!",
                "good": "3",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "ney",
                "time": "1 day ago",
                "context": "He's not trashing teachers but their union. Teachers build futures for our kids. Teacher unions build worthless politicians. I think suburban women are bright enough to understand the difference. ",
                "good": "4",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "supremeranter805",
                "time": "1 day ago",
                "context": "People don’t trash teachers as a group, they trash the teacher’s unions and their leadership. Rightfully so. The teacher’s unions are the single biggest detriment to a quality education.",
                "good": "1",
                "bad": "1",
                "replies": []
            },
            {
                "user_name": "daneau290387",
                "time": "1 day ago",
                "context": "Republicans tell the truth. Sorry that you find that hard to understand.",
                "good": "2",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "LuvinMyTrump",
        "time": "1 day ago",
        "context": "If you love your children, never let them step foot in a public school.",
        "good": "11",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "federalrepublic",
        "time": "1 day ago",
        "context": "Nate Madden, the communications director for Rep. Chip Roy, R-Texas, tweeted, \"...The teachers unions are not sending us their best and brightest...\"\n\nNate, unfortunately you may be incorrect...I think they are sending their best and brightest. We are just in that bad of shape.",
        "good": "18",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ArchenlandKnight",
        "time": "1 day ago",
        "context": "This is the state of our public education system today.\n\nIt makes shake my head in dismay when The Left refers to \"uneducated\" people on the Right. If you went through a school run by Leftists, even if you have a Master's degree, you did not get an education.\n\nThis was shown by the fact that Barack Obama knew literally nothing about the U.S. Constitution despite having a degree in Constitutional Law. This is shown by the fact that AOC had a degree in economics, yet knows nothing whatsoever about economics.\n\nThe Left's \"education\" is completely worthless.",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bbb88",
        "time": "1 day ago",
        "context": "That woman is the worst thing that ever happened to our kids. She will become omnipotent if Democrats maintain the majority. Kids can't vote, so they need yours.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "daeljuma210",
        "time": "1 day ago",
        "context": "I'm a high school teacher. I'm very embarrassed by some of the people in my profession.",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "*deplorableme*",
        "time": "1 day ago",
        "context": "The woman that dragged a whole profession into the cesspool with her.  Teaching used to be an honorable profession.  Sadly, no longer.",
        "good": "10",
        "bad": "0",
        "replies": [
            {
                "user_name": "daneau290387",
                "time": "1 day ago",
                "context": "Teaching?",
                "good": "0",
                "bad": "2",
                "replies": [
                    {
                        "user_name": "*deplorableme*",
                        "time": "19 hours ago",
                        "context": "Yeah, my bad.  Fixed it.",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "StarFox058",
        "time": "1 day ago",
        "context": "isn't this the same ugly broad that didn't know how to spell Ukraine, and held their flag upside down?\n\n\n\n\nyep",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "eileenbenedetto376",
        "time": "1 day ago",
        "context": "Teachers should have the right not to pay dues…end of the union and the democrat party",
        "good": "16",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "liberalism_is_the_mental_disorder",
        "time": "1 day ago",
        "context": "One guess what she chows . . . .",
        "good": "2",
        "bad": "0",
        "replies": [
            {
                "user_name": "daneau290387",
                "time": "1 day ago",
                "context": "Carpet?",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "veryoldcop202",
        "time": "1 day ago",
        "context": "Sounds like she also missed Lemon's education last week about who actually gathered slaves and sold them to the traders .",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "davidhburns",
        "time": "1 day ago",
        "context": "There was a lot of contention at the founding of our nation over slavery. It was such a problem that many gave up the quest of granting freedom to the slaves until they got the United States up and running which was quite enough to obtain at the time as that accomplishment was replete with immense problems and differences as well. The idea was to first get the nation going and then at a future date free the slaves. As usual it took many years before that hope bore fruit in 1865 after a vicious, violent civil war.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "farfromlib710",
        "time": "1 day ago",
        "context": "Whininggarbage needs to go and retire! Better yet plan a trip to Iran! The teachers union also needs to go! Give parents vouchers so they can choose other education choices for their children!",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mk19gunner",
        "time": "1 day ago",
        "context": "This Randi Weingarten dude makes my fence posts look like Rhodes Scholars.",
        "good": "12",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jershon",
        "time": "1 day ago",
        "context": "Defund and abolish the DEA and repeal all Title legislation. No more Federal funding of communist education systems. Dismantle the Administrative State.",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "BCFTHMLG",
                "time": "1 day ago",
                "context": "The DEA is the \"Drug Enforcement Agency\".",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "congosquare",
        "time": "1 day ago",
        "context": "It was the New England states that were responsible for slaves being counted as only 3/5 of a person.\n\nThe Southern states wanted them fully counted.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "kswck",
        "time": "1 day ago",
        "context": "Not really surprising that there is history and history that is being taught to children is completely different when Liberals disagree with some of it. The Constitution is being interpreted differently by every political party, every day.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "doriengrey58399",
        "time": "1 day ago",
        "context": "The first two drafts of the Declaration of Independence included abolishing slavery in both farms and indentured home or workers! But alas New York, Massachusetts, Georgia and Carolina did not like that language so it was compromised out!  ",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mikeiscool",
        "time": "1 day ago",
        "context": "Constantly speaking about the past does nothing to prepare us for the future.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "puterdude",
        "time": "1 day ago",
        "context": "What can we do about racism?  STOP TALKING ABOUT IT",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "KamalaToe340",
        "time": "1 day ago",
        "context": "RW is a lawyer by trade.  Her bio briefly mentions a teaching stint for a year or two in the 70’s.  Other than that she is a union HACK plain and simple.  She knows basically zero about teaching kids.  All she knows how to do is twist arms.  The scary thing are her members…they vote for her.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Amaripino",
        "time": "1 day ago",
        "context": "The real threat to democracy is the left re writing history to justify the need for total control of Americans",
        "good": "5",
        "bad": "0",
        "replies": [
            {
                "user_name": "BCFTHMLG",
                "time": "1 day ago",
                "context": "Do you work for Vladimir Putin or Xi Jinping?",
                "good": "0",
                "bad": "2",
                "replies": []
            }
        ]
    },
    {
        "user_name": "suffusionofyellow",
        "time": "1 day ago",
        "context": "She represents teachers????",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "trumpboy792",
        "time": "1 day ago",
        "context": "Democrats use Slavery to attack our constitution an founding fathers because  the democrat party today is MARXIST.     End of story.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "HomerHomer641",
        "time": "1 day ago",
        "context": "The reason why some Democrats, like Weingarten, deliberately misinterpret (lie) about American history is because they loathe America. They are not interested in helping to make America better. They are only interested in destroying America in order to \"transform\" it to their \"liberal world order\", i.e., socialism/communism. Their ideal of what America should be is the antithesis of the Constitution's purpose of freedom and liberty. Unfortunately, more and more Democrats are following this path because people like Weingarten have taken over the public education system and are indoctrinating children by dumbing them down.\n\nMeanwhile, these \"educators\" will deliberatedly omit the history of the Democrat Party which was founded on perpretuating and expanding slavery.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "trumpboy792",
        "time": "1 day ago",
        "context": "Democrats were the author of slavery in America.",
        "good": "4",
        "bad": "0",
        "replies": [
            {
                "user_name": "BCFTHMLG",
                "time": "1 day ago",
                "context": "Back then the Democrats were the conservative party. The Republicans were the liberal/progressive party. Conservatives \"authored\" slavery in America.",
                "good": "1",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "brassman",
        "time": "1 day ago",
        "context": "\"THOSE THAT IGNORE HISTORY ARE DOOMED TO REPEAT IT\"",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "always5theright139",
        "time": "1 day ago",
        "context": "No one is paid more to do less than a teacher.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "liberty1776-wethepeople",
        "time": "1 day ago",
        "context": "This is cringeworthy.  Thomas Jefferson and others had major debates about the slavery.  Southern states would have immediately faced economic disaster if slavery was made illegal.  Therefore they would not join the union if slavery was made illegal.  It was a compromise to get Southern states into the union. \n\nAnother historical note.  Slavery was common practice in many if not most parts of the world until the late 1700's / early 1800's.  Slaves built the pyramids.  Black tribes in Africa sold defeated enemies as slaves.  Forced labor (slaves) built the Great Wall of China.  And many of the Soviet Unions 'Hero' projects used forced unpaid labor in the 1900's.  North Korea still has forced unpaid labor camps for government projects.  \n\nMandatory School Choice should be the law.\nFunds follow the students and are not locked to Public Schools.\nThis includes schools that have ties to a religion.\n\nAll curriculums to be posted online for all to see before a class is taught.\nWeb cams in all classrooms with the videos easily available to within 2 business days to parents and the public\n\nUnion dues that are mandatory may not be used for any political lobbying.",
        "good": "3",
        "bad": "0",
        "replies": [
            {
                "user_name": "daneau290387",
                "time": "1 day ago",
                "context": "Yes to all except, absolutely no unions for publicly (taxpayer) funded employees.",
                "good": "2",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "sidiyahia",
        "time": "1 day ago",
        "context": "Even the socialist FDR was not in favor of public employee unions.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Barnes41",
        "time": "1 day ago",
        "context": "As a teacher, who is now retired, I dropped my NEA membership in 1978.  They were going too far left even back then.  Their boss now doesn’t realize the 1700s and early, middle 1800’s we’re of a different time with different values.  I wonder how people a hundred and fifty years from now are going to view liberal fanatics of today.",
        "good": "7",
        "bad": "0",
        "replies": [
            {
                "user_name": "hope7677",
                "time": "1 day ago",
                "context": "The people who think they know best, and knew America could only fall within, by destroying God, family, country, facts, and history... to declare our founding a lie, to reverse what our founders gave us and the world. Christianity and our constitution brought forward a new world, a better world. Those on the left have been working to tear it apart from the day this country was formed and the slaves were freed and declared free. If people don't wake up, it is ALL gone!",
                "good": "2",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "pcohee",
        "time": "1 day ago",
        "context": "\"It was the American Revolution that caused people to question slavery. No one had questioned it before we decided as Americans that we are endowed by our creator with unalienable rights.\" Even Gov. DeSantis gets it wrong. Quakers in Pennsylvania issued the Germantown Petition Against Slavery in 1688. In the colony of Georgia, founder James Oglethorpe banned slavery in the 1730s. There are many similar precedents.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "libzrfunny",
        "time": "1 day ago",
        "context": "Unions are about political power, nothing more, nothing less.\nThey DO NOT belong in your educational system in any form.\nGET YOUR KIDS OUT of public schools.  Defund public schools until they discard unions\nand return to teaching basic life skills.",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "coralreefer",
        "time": "1 day ago",
        "context": "...Weingarten  is   one   \"Twisted  Sister\"......",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "klnkat",
        "time": "1 day ago",
        "context": "There is a very cheap cure for this (Randi Weingarten) why hasn't it been done?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "koreshwasright",
        "time": "1 day ago",
        "context": "They lived in a different time, when blacks sold their own people.",
        "good": "10",
        "bad": "0",
        "replies": [
            {
                "user_name": "righttime23",
                "time": "1 day ago",
                "context": "Soooo that changes the facts?",
                "good": "0",
                "bad": "5",
                "replies": [
                    {
                        "user_name": "happyrep88",
                        "time": "1 day ago",
                        "context": "African Tribal leaders attacked and rounded up weaker African tribes and sold them. \n\nWhat’s your thoughts on that in regards to who was responsible for slaves being shipped all over the world, not just the US?",
                        "good": "4",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "righttime23",
                                "time": "1 day ago",
                                "context": "and that applies to this discussion how?\nbut to answer your question.\nSlavery is a lot like drugs.\nBoth the suppliers and consumers are to blame\none cannot exist without the other. In any market there is a faction that will exploit it if people will pay",
                                "good": "0",
                                "bad": "3",
                                "replies": []
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "Einsvonuno",
        "time": "1 day ago",
        "context": "History today has become pulp fiction.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "DJ76",
        "time": "1 day ago",
        "context": "I respect most teachers.  I loathe the teacher's union.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "swamie290",
        "time": "23 hours ago",
        "context": "Because of the Union, you can't fire bad teachers. How is this Union any good for kids",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bob41971",
        "time": "23 hours ago",
        "context": "Our Nation wasn’t created to preserve slavery but the Democratic Party most certainly was. ",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "whyisthisdifficult",
        "time": "1 day ago",
        "context": "deflect deflect deflect. is that all you have. no one made you a social justice warrior. in your quest for more power, you took that on yourself. if you don't stop, we the people will take kids out of public schools. then take tax money back, then there will not be a need for teachers or unions",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "godzilla054",
        "time": "1 day ago",
        "context": "Ban the Marxist NEA",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "grsheets",
        "time": "1 day ago",
        "context": "To quote Joseph Goebbles \" Repeat a lie often enough, and the people will believe it, and you will even come to believe it yourself \".",
        "good": "9",
        "bad": "0",
        "replies": [
            {
                "user_name": "infinitetime",
                "time": "1 day ago",
                "context": "Exactly why leftist politicians lie.",
                "good": "4",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "socalbuckeye",
                        "time": "22 hours ago",
                        "context": "...and their cohorts in crime the MSM.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "voteoutthedems",
        "time": "1 day ago",
        "context": "Brandi needs to hide in its basement and just collect its 10 percent.  Talking leads to democrat gaffes,  again. ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "liberalsarementallyill686",
        "time": "1 day ago",
        "context": "She is the face of elitist Marxism and the epitome of what’s wrong with education.",
        "good": "10",
        "bad": "0",
        "replies": [
            {
                "user_name": "truthbetold2you784",
                "time": "1 day ago",
                "context": "No such thing as elitist Marxism.  That's what billionaires think they are.  But they are just rich thugs demanding to impoverish the rest of us and force us into servitude.    Randi is more Bolshevik with mic instead of rifle.  Was Randi raised a red diaper baby?",
                "good": "0",
                "bad": "2",
                "replies": []
            }
        ]
    },
    {
        "user_name": "andyowen",
        "time": "1 day ago",
        "context": "Silly?  In Constitution importation of slaves banned after 1800....Founders aware and did their best....unfortunately this made things much worse for those already here until 1863......?????",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "math_addict",
        "time": "1 day ago",
        "context": "Thank God that KY is a right to work state.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Joe’sDogHatesHim",
        "time": "1 day ago",
        "context": "Democrats will forever be the party of slavery",
        "good": "16",
        "bad": "0",
        "replies": [
            {
                "user_name": "dionne248",
                "time": "1 day ago",
                "context": "Conservatives were the party of oppression. Things change and  others.. …The Dems were a Conservative party in those horrible days. Now they’re liberal. Reps were the liberal party during CW. Liberals have historically stood for freedom and rights.",
                "good": "1",
                "bad": "11",
                "replies": [
                    {
                        "user_name": "chas00",
                        "time": "1 day ago",
                        "context": "It's in the Democrat/ Jim Crow/ Fascist/ Utopia Party's DNA.",
                        "good": "2",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "dionne248",
                                "time": "1 day ago",
                                "context": "You do realize Democrats aren’t fascists. We know it’s been repeated a million times here but Dems have not installed an autocratic leader, as the reps did. \nyes, the Conservative party at that time = the Dems, did employ Jim Crow laws.",
                                "good": "0",
                                "bad": "2",
                                "replies": [
                                    {
                                        "user_name": "prodigal2",
                                        "time": "1 day ago",
                                        "context": "\"Not installed an autocratic leader\"?  Please, explain to me Woodrow Wilson's actions such as confiscating and nationalizing the railroads.  Explain to me FDR's interning American citizens of Japanese descent, threatening to pack the Supreme Court when he didn't get his way.  And of course Biden's misuse of the FBI to attack his political enemies.",
                                        "good": "1",
                                        "bad": "0",
                                        "replies": [
                                            {
                                                "user_name": "dionne248",
                                                "time": "1 day ago",
                                                "context": "As president he took possession of the railroads and nationalized them, would you prefer he had not?\nCongress passed the Army Appropriations Act of 1916, which granted the president the power to take over the nation’s transportation systems.",
                                                "good": "0",
                                                "bad": "1",
                                                "replies": [
                                                    {
                                                        "error": "error"
                                                    }
                                                ]
                                            },
                                            {
                                                "user_name": "dionne248",
                                                "time": "1 day ago",
                                                "context": "Fear — not evidence — drove the U.S. to place over 127,000 Japanese-Americans in concentration camps for the duration of WWII.",
                                                "good": "0",
                                                "bad": "1",
                                                "replies": [
                                                    {
                                                        "user_name": "Joe’sDogHatesHim",
                                                        "time": "1 day ago",
                                                        "context": "FDR did that. Oops Democrat",
                                                        "good": "1",
                                                        "bad": "0",
                                                        "replies": [
                                                            {
                                                                "user_name": "dionne248",
                                                                "time": "1 day ago",
                                                                "context": "True but that wouldn’t define him as an autocrat. \nOne day we’ll look at definitions of autocrats, Marxists and fascists and discover who falls more snugly in those categories.",
                                                                "good": "0",
                                                                "bad": "1",
                                                                "replies": [
                                                                    {
                                                                        "user_name": "Joe’sDogHatesHim",
                                                                        "time": "23 hours ago",
                                                                        "context": "Mayor Pete likes it snugly",
                                                                        "good": "1",
                                                                        "bad": "0",
                                                                        "replies": []
                                                                    }
                                                                ]
                                                            }
                                                        ]
                                                    }
                                                ]
                                            },
                                            {
                                                "user_name": "dionne248",
                                                "time": "1 day ago",
                                                "context": "Bill Barr was Donald Trump‘s operative in the judiciary, and punished his enemies, everyone knew that because Trump said that Barr was handling it. \n Joe Biden and Garland/Wray have not teamed up unethically and illegally.",
                                                "good": "0",
                                                "bad": "2",
                                                "replies": []
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "user_name": "onfulldisplay",
                        "time": "1 day ago",
                        "context": "Your eyeballs are floating in Kool-aid.",
                        "good": "3",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "triggeredmob",
                        "time": "1 day ago",
                        "context": "Yeah, sure, good grief ... Democrats are authoritarians ... forcing people to get medical procedures or lose their jobs, encouraging boys and men to use women's bathrooms if they want to, killing the unborn up to the moment of birth, limiting free speech ...",
                        "good": "2",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "dionne248",
                                "time": "23 hours ago",
                                "context": "When people are forced to vaccinate that was for particular jobs. If the nation had collectively been forced to Vax everyone would be vaxed. \nI have a daughter and I’m not comfortable with boys using girls restrooms, esp men so…\nI think everyone has personal preferences about abortion but in enforcing abortion laws, Republican leaning scotus made that ruling not Dems.\nHow have Dems limited free speech?",
                                "good": "0",
                                "bad": "1",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "user_name": "just_facts",
                        "time": "1 day ago",
                        "context": "It sounds like you learned history from Randi.",
                        "good": "2",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "dionne248",
                                "time": "1 day ago",
                                "context": "oh she may have gotten carried away, but she has made many valid points in  her discussions. I think what she meant - it was interpreted as a way of determining a persons value  ( the 3/5 compromise)\nThe southern Dems had a strategy in doing so. They gained more representation in Congress by counting slaves that way, though slaves weren’t allowed a vote nor did they own land etc",
                                "good": "0",
                                "bad": "1",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "user_name": "Rc5.Roxx",
                        "time": "1 day ago",
                        "context": "Your interpretation of the facts is 100% wrong. You’ve been indoctrinated and are spreading falsehoods.  Editorial opinions are not facts ",
                        "good": "2",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "dionne248",
                                "time": "23 hours ago",
                                "context": "Check out the process of party platforms changing - and why the parties began changing - under FDR and continued during  the civil rights era.",
                                "good": "0",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "Rc5.Roxx",
                                        "time": "14 hours ago",
                                        "context": "WRONG.  FDR tried to pack the courts to ram his Democratic agenda down everyone's throat.   How about FDR's friends: Strom Thurmond?  George Wallace?  Robert Byrd?    The 1964 Civil Rights Bill was supported by 64% of Democrat lawmakers & by 80% of Republicans.  Democrats filibustered for 74 days straight, trying to derail the 1964 Civil Rights bill.  Republicans didn't cave in and made sure that this bill passed.",
                                        "good": "1",
                                        "bad": "0",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "user_name": "crewchief71",
                        "time": "22 hours ago",
                        "context": "democrats are not liberals. Republicans are closer to liberal ideology than the current democrat party. Here’s the classic definition of a liberal. See much democrat in here?\n“ Liberals espouse a wide array of views depending on their understanding of these principles, but they generally support free markets, free trade, limited government, individual rights, (including civil rights and human rights), capitalism, democracy, secularism, freedom of speech , freedom of the press and freedom of religion.”\nNotice any cancel culture, doxing, socialism?  Me either.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "righttime23",
        "time": "1 day ago",
        "context": "Why does the rights history sound like 1960 westerns\nTheir textbooks will be reruns of Wagon Train",
        "good": "0",
        "bad": "3",
        "replies": [
            {
                "user_name": "nobitnobridle",
                "time": "1 day ago",
                "context": "I suspect Wagon Train was more historically accurate than Weingarten and; unfortunately many of those today who claim to be teaching the history of this Nation.\n\n1960's westerns?  Are you trying to say that the ever moral and completely honest Matt Dillon of Gunsmoke fame was not an accurate depiction of a wild west US Marshall?\n\nOh come on now.  Say it ain't so.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "righttime23",
                        "time": "1 day ago",
                        "context": "Well\nyou answered my question so I guess I owe you a thank you",
                        "good": "0",
                        "bad": "1",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "triggeredmob",
        "time": "1 day ago",
        "context": "It's ironic that Democrats still approve of slavery. Human trafficking is celebrated in the Black culture ( p i m p s ) and Democrats are supporting the drug cartels, human trafficking on the southern border",
        "good": "7",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Anony_Mouse",
        "time": "1 day ago",
        "context": "DeSantis claims: \"It was the American Revolution that caused people to question slavery. No one had questioned it before we decided as Americans that we are endowed by our creator with unalienable rights.\"\n\nReally Ron? The 3/5th compromise (each slve equals 3/5th's of a man) was made because Property rights were held as more important than human lives.",
        "good": "1",
        "bad": "11",
        "replies": [
            {
                "user_name": "aocisadipshit",
                "time": "1 day ago",
                "context": "Look deeper \"lil mouse. . the North knew that the south would use their forced labor\nto give forced votes to further their slavery agenda. that's why slaves were not given\na full vote.",
                "good": "4",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "Anony_Mouse",
                        "time": "1 day ago",
                        "context": "Slaves were never given the vote. The compromise came because the Northern States said representation should be based on the # of Free men in a state. That put the South at a great disadvantage, & they said slaves would count, or they would leave. In order to save the convention, the compromise was made. Southern states were over-represented, but also had to pay taxes on those 3/5th's of a man.",
                        "good": "1",
                        "bad": "1",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "Rc5.Roxx",
                "time": "1 day ago",
                "context": "In your opinion.  Your interpretation, your ideology.",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "nobitnobridle",
                "time": "1 day ago",
                "context": "Just read the Federalist Papers.\n\nEveryone needs to do that.\n\nIt's the only way to understand; for yourself .. each one of us ... what the forefathers intended and .. very importantly ... what their concerns and disagreements were about.\n\nThere is so much speculation, people forming their own ideas without the facts ... teachers who are supposed to be teaching American history who really don't know what was going on at the time ...\n\nthat leads to inaccuracy, arguments, disagreements.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "rozie325",
        "time": "1 day ago",
        "context": "Did teachers purposely pick the most ignorant contestant for the position of union head on purpose?",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mabbam980",
        "time": "1 day ago",
        "context": "What she says is something that could be discussed in high school and college and elsewhere but she wants this to be the sum total of what is taught about the founding fathers and the beginning of the United States!\nInstead of being a teacher she has become a AFT SOCIAL ACTIVIST. \nTake your children out of public school if this is what is going on in your community.\nMaybe your taxes will go down.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "lamontcranstonthethird",
        "time": "1 day ago",
        "context": "The simple fact that an \"educator\" could get something so basic so wrong is frightening. Just imagine what other inaccuracies are being taught to children.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "nobitnobridle",
        "time": "1 day ago",
        "context": "Why is it that every single Dem individual who has access to a mic is just incapable of knowing when not to show their abject stupidity?\n\nKamala doesn't know whether we support North or South Korea ..\n\nJoe is looking for dead people and shaking hands with ghosts ..\n\nthe \"leader\" of the Teacher's Unions doesn't know squat about our history ..\n\nand Don Lemon is getting schooled so often he now has a permanent \"deer in the headlights\" game face ...\n\nThey try; constantly, to bend every single issue to fit their agenda when there is no reasonable, even semi-intelligent way to connect the dots ...\n\n... and that's just to name a few ...\n\nThey are all a national embarrassment but worse; they are a national threat.",
        "good": "15",
        "bad": "0",
        "replies": [
            {
                "user_name": "jmcintyre10",
                "time": "23 hours ago",
                "context": "Well-spotted.",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "HA!669",
                "time": "23 hours ago",
                "context": "That's what compels them to teach lies.",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "itsmymonee",
        "time": "1 day ago",
        "context": "What woman goes to the beauty shop and requests the James Spader look?",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "vic_rattlehead",
        "time": "1 day ago",
        "context": "I'm confused. Are Conservatives for freedom of speech or not?",
        "good": "0",
        "bad": "8",
        "replies": [
            {
                "user_name": "HA!669",
                "time": "23 hours ago",
                "context": "Sure, just understand that conservatives will use their freedom of speech to contest obvious lies, ok?",
                "good": "4",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "cannonfodder741",
                "time": "23 hours ago",
                "context": "This is not a first amendment issue.  Pointing out that someone is factually incorrect is not a violation of their rights.  Knowledge is a qualification for any job.  It shouldn't surprise you that people think she should move on to something else.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "armydad123",
        "time": "1 day ago",
        "context": "If you one wants a nice history lesson look at the Classic version of  the movie 1776 .  one part  is about how a rather large compromise was made to get a unanimous approval which was needed to get the Declaration of Independence passed. The language to end slavery had to be removed in order to get several of the southern states to sign on.",
        "good": "5",
        "bad": "0",
        "replies": [
            {
                "user_name": "HA!669",
                "time": "23 hours ago",
                "context": "So what? The declaration of independence was the beginning of the end of slavery.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "vic7",
        "time": "1 day ago",
        "context": "Union Boss. Enough said.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Rc5.Roxx",
        "time": "1 day ago",
        "context": "All lies and organized crime. That Randi’s legacy. She is no better than Hoffa was.",
        "good": "7",
        "bad": "0",
        "replies": [
            {
                "user_name": "flowerlover",
                "time": "1 day ago",
                "context": "She's much worse because she has permanently damaged the lives of millions of children.",
                "good": "10",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "truthbetold2you784",
                        "time": "1 day ago",
                        "context": "Up to 100 million.  Randi has owned that \"title\" for at least 30 years.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "buzzard10264",
        "time": "1 day ago",
        "context": "Another liberal woman???? who is so ugly that even the tide won't take her out.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "zappacostta",
        "time": "1 day ago",
        "context": "Those who cannot do teach. Those who cannot teach head a union.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bidensux23",
        "time": "1 day ago",
        "context": "I thought this union failed and collapsed? ",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Who,me?316",
        "time": "23 hours ago",
        "context": "Learn from history. Leopards don't change their spots. Teaching the history of the Democratic political party would help get the country back on track.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "avoiceinthewoods",
        "time": "22 hours ago",
        "context": "I would point out many non-profits risk losing their tax exemption if they cross into political advocacy (churches are threatened regularly).  Employee unions should be restricted to only collective bargaining and employee representation with their employers - if we are going to allow them at all.  We do not allow corporations (which are ultimately comprised of human beings who are sharing resources and working towards a common goal to better all of them) to  coordinate what the price for goods and services will be.  Why is it OK for unions to coordinate and set the price and conditions of their members to provide services?  All political donations should be direct from individuals and those individuals need to live in the congressional district, state or nation to donate.  The money raised by politicians should only be buying advertising and services for their district, state or nation (if it is president or vice president).  New York money shouldn't be going to Idaho to influence  who will be elected as a senator from Idaho.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sheikdefremil",
        "time": "22 hours ago",
        "context": "FREE THE PUBLIC SCHOOL KIDS.  Give the money to parents instead of directly to the schools.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "debisright178",
        "time": "22 hours ago",
        "context": "We haven't had slaves for over 150 years, but the teachers' unions are doing everything they can to keep the thought alive and well in the minds of impressionable children. They want to teach Critical Race Theory and \"The 1619 Project\" in the classrooms, instead of the academic curriculum they are there for. It's no wonder that so many kids can't read, write or do a math problem. Teaching the horrors of slavery is one thing, but to tell kids that blacks are destined to fail and to tell them that the reasons for founding America are lies is unacceptable and does nothing but cause further division.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "LookItUp609",
        "time": "23 hours ago",
        "context": "How can this woman be in charge of educating our youth? If ignorance were money, Bill Gates would be calling her for a loan.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "metheoneandonly",
        "time": "23 hours ago",
        "context": "\"Was it over when the Germans bombed Pearl Harbor?\" (Animal House)",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "stelmo984",
        "time": "23 hours ago",
        "context": "\"The teachers unions are not sending us their best and brightest...\"\nI think maybe they are sending us their best and brightest.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "stromberg7",
        "time": "22 hours ago",
        "context": "Wow, Randy Weingarten got American History wrong ... but why would we expect anything else? She's an indoctrinator, not an educator.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "7gus",
                "time": "22 hours ago",
                "context": "She's a GOOOOOONION BOSS.  period",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "blaino15825",
        "time": "22 hours ago",
        "context": "' A child's understanding\"\n-Perfect description for this entire administration and 9 put of 10 Democrats.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "billybobbadboy",
        "time": "22 hours ago",
        "context": "th of learning.  This horrible woman is directly responsible for denying our kids of about a decades worth of learning with her greedy mindset of locking down the schools.  All she cares about is the money in her bank account.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "drobama",
        "time": "22 hours ago",
        "context": "Randi never had children of her own, I believe she resents families with children.",
        "good": "2",
        "bad": "0",
        "replies": [
            {
                "user_name": "willthorsson012",
                "time": "17 hours ago",
                "context": "Thats pretty bad. Out of 3.5 billion human males on earth not one stepped up to the plate. Lol!",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "socalbuckeye",
        "time": "22 hours ago",
        "context": "I thought Randi Weingarten was a dude until I saw it.  Now I feel like a SC justice in that I do not know what a woman is.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "IllinoisRefugee329",
        "time": "22 hours ago",
        "context": "I had the good fortune to have had my schooling long before the woke took over. I even paid off my loans and supported conservative policies. Now I feel increasingly like I must be the oddball with twisted beliefs. But I'm hanging on to reality by my fingernails and I won't let go. God bless America!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "OldGreyWolf763",
        "time": "22 hours ago",
        "context": "I have often said that we have our worst teaching our best. Enough said!!!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "3eyedhuman",
        "time": "22 hours ago",
        "context": "With the sun glasses she could easily pass for Mick Jagger’s twin brother.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "inequalityrules",
        "time": "23 hours ago",
        "context": "Poor Randi, there is more history that she should know.  Abraham Lincoln once said: \"Better to remain silent and be thought a fool than to speak up and remove all doubt.\"  Good advice for Randi to follow.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jmacs71961",
        "time": "23 hours ago",
        "context": "Indoctrination 101",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "duby390",
        "time": "23 hours ago",
        "context": "The head of the teacher's union knows all these facts, she is simply pushing the democrats revised version of history most people have never taken the time to read the Constitution or the Declaration of Independence. There both free Online just look them up.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jmacs71961",
        "time": "23 hours ago",
        "context": "The teachers union is the \"social police\" arm of the democrats socialist party",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bart-105",
        "time": "22 hours ago",
        "context": "Jackie, Jackie, come up here girl….",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "esteban51",
        "time": "22 hours ago",
        "context": "Why does Ms. Weingarten hate children so virulently?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sheikdefremil",
        "time": "22 hours ago",
        "context": "Public schools are inferior and are the last monopoly.  Give the money to parents instead of directly to the school.  FREE THE PUBLIC SCHOOL KIDS.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "johnnychang",
        "time": "23 hours ago",
        "context": "I hate cotton!",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "inequalityrules",
                "time": "23 hours ago",
                "context": "I don't mind cotton, it's the pickin' I hate.  My great-great granddaddy said he was done, he wasn't going to pick no more cotton.  He died because he wouldn't pick the cotton out of the top of his medicine bottle to get to the medicine.",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "jakemcblake",
        "time": "22 hours ago",
        "context": "There's a joke in a YouTube series I watched a while ago that sums up Party sycophants perfectly:\n\n\"STOP derailing my arguments with FACTS!\"",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "magnetsa",
        "time": "22 hours ago",
        "context": "Democrats are just liars.  They will make up any story to justify whatever point they are arguing at the moment.\n\nDemocrat voters, do the right thing and throw out all these lying Democrats - that means all of them.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "patrickhenrycomeback",
        "time": "20 hours ago",
        "context": "Randi is a mob boss, not an educator.  She isn't the sharpest pencil in the box.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "quietbear_001",
        "time": "22 hours ago",
        "context": "And that is a perfect example of why our education system is falling further and further behind compared to many other countries.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "harryballsjr.",
        "time": "20 hours ago",
        "context": "If you actually think government employee Unions are a good idea, well, you're a member of one.\n\nGovernment employee Unions negotiate with other government employees to obtain benefits and salary.   Private Union employees have to negotiate with the business owner.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "*deplorableme*",
        "time": "19 hours ago",
        "context": "Why aren't teachers recalling Randi?  Do teachers really support the politics of this, er, woman?  They just voted to keep her a leader of their union.  What the hell?",
        "good": "2",
        "bad": "0",
        "replies": [
            {
                "user_name": "owenmarshall976",
                "time": "17 hours ago",
                "context": "A majority Woke Teachers is just more overwhelming evidence of our SHATTERED EDUCATION SYSTEM! This country is doomed with that in place.",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "8ba11",
        "time": "20 hours ago",
        "context": "Brought to you by the same party that want to convince you that somehow Democrat and Republican parties swapped stances on blacks at some point after the Civil War.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "flagman51",
        "time": "21 hours ago",
        "context": "When any organization is run by such godless and immoral people they will attempt to force their godless immoral beliefs on those to whom they  control",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "prezpuddinpantz",
        "time": "20 hours ago",
        "context": "It’s Pat!!!",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "montegobay",
        "time": "18 hours ago",
        "context": "SHe believes men can get pregnant and kids should cut off theire body parts, so there you go.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "flagman51",
        "time": "21 hours ago",
        "context": "My dad taught me that it is always best to tell the truth because truth never changes, as it is always truth, however lies are needed to cover lies and it becomes impossible to keep track of all the lies.  What a tangled web we weave when we practice to deceive.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mike99960",
        "time": "19 hours ago",
        "context": "Randi Whinegarten is an attorney with less than 7 years classroom experience.  She cares nothing about your children, folks.",
        "good": "6",
        "bad": "0",
        "replies": [
            {
                "user_name": "Butchcassidy969",
                "time": "17 hours ago",
                "context": "She's in it for the money.",
                "good": "3",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "spooker",
        "time": "20 hours ago",
        "context": "Gotta keep working that \"white guilt\".",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "americanmexican141",
        "time": "20 hours ago",
        "context": "Any time you have one group of people that is trying to exercise their supposed power over another group of people, you get what we are witnessing today. The liberals and ultra liberals are attempting to rewrite American history to fit the way they think that it should read. The good thing about that is, most of us read history for ourselves. It’s housed and protected in The of Congress, as well as other places. Those that will protect our history will facts and had a way of communicating it to the rest of us, are to be commended. Mark Levin comes to mind.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "1ruth1689",
        "time": "21 hours ago",
        "context": "Americans should be proud not shocked. You turned the education of your own children over to the State and are now awe struck at what they have done with the power you gave them!?! Grow up, own your decisions and for the sake of your children, be a responsible parent. So tired of Americans accepting the \"easy\" path, who then complain about where that path led them.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cassandracomplex",
        "time": "21 hours ago",
        "context": "The American Revolution occurred because The East India Trading Company was getting sweetheart deals from Britain to counter and nullify the harm being committed by pirates and privateers.\n\nOur Founding Fathers were said pirates / profiteers.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cloneprone",
        "time": "22 hours ago",
        "context": "You have a right to speak your mind because you are not a conservative, but you\nalso have a responsibility and a duty.\nYou are not 'just' a citizen, you are directing and impacting the teaching of our kids.\nWhy not focus on doing that well, and then we can discuss what more we may need from you.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "lazrbeam133",
        "time": "21 hours ago",
        "context": "The teachers unions don’t give a rip about the children.  They only care about protecting sub-par teachers and collecting their dues.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "retrorock",
        "time": "22 hours ago",
        "context": "She's Not a Teacher... She's Just Another 2 Bit Politician on the Take for the $500K+ salary she pulls in per year.\nShe'll Rewrite History anyway the White House wants just to keep her job...",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Dales1st",
        "time": "20 hours ago",
        "context": "R.W. singing:\nDon't know much about history, Don't know much biology, Don't know much about a science book, Don't know much about the French I took...but I do know that I hate you!,and if I can brainwash your kids too, what a wonderful world this will be! (mic drop)",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "81ISU00",
        "time": "21 hours ago",
        "context": "Like all progressive leftists they should be given as much on air time as possible to prove how intelligent they really are.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "nj2fla",
        "time": "21 hours ago",
        "context": "A much more news worthy story would have been that a LYING liberal actually used a fact and spoke the truth....A realistic impossibility if there ever was one.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "clutterdeal772",
        "time": "21 hours ago",
        "context": "Eliminate the department of education.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "prezpuddinpantz",
        "time": "20 hours ago",
        "context": "Bet she’s wearing comfortable shoes…🤔",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "selfrespect",
        "time": "21 hours ago",
        "context": "Then why are there so VERY few public high school students that can tell me my change if I buy an item for $7.38 using a $20 bill? \nI'm 82 and can still recite my times table up to 12x12. I've yet to find a public high schooler that can do it!",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "kcut1797",
                "time": "21 hours ago",
                "context": "Kids have not even learned cursive - so they can't even read the US Constitution, Bill of Rights, etc.",
                "good": "3",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "SmokeySmokerson",
                        "time": "21 hours ago",
                        "context": "Their extent of cursive writing is to be able to sign their names in cursive.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "willthorsson012",
                "time": "17 hours ago",
                "context": "Im 50 and recall having to memorize our times tables and the endless cursive letter practice. Essays and book reports had to be handwritten in cursive with proper punctuation and spelling. A book report in history or science still had to be grammatically correct and legible or they took points off. Young people today are illiterate in comparison.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "comeonman46",
        "time": "17 hours ago",
        "context": "weingarten and the teachers union   HAS GOT TO GO NOW!!!!",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Garbanzo202",
        "time": "19 hours ago",
        "context": "Apparently she forgot that there was a provision to prevent the importation of slaves after 1808.  The 3/5ths provision was a 'Compromise' because the Northern States that were against slavery, dis not want the South to get additional representative in Congress based on the number of slaves in the south who could not vote. She also has no clue that a compromise was necessary as many colonist were still loyal to England and a battle over slaves would have resulted in 13 separate states versus one country",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "boone5811",
        "time": "16 hours ago",
        "context": "Anyone still have questions on how public school kids can still be so ignorant after all the money we sink into them?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "reasonabilityisdead",
        "time": "16 hours ago",
        "context": "Hate to break it to you guys but Fox apparently has no clue about the 3/5 compromise either.  Wow stunning fail on the part of the intern that wrote this solely based on researching twitter.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "kateinpgh",
        "time": "16 hours ago",
        "context": "keep her out of the classroom unless she's a student",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "papalouie",
        "time": "15 hours ago",
        "context": "Our founders could do fractions with a pencil. Two-thirds ⛄️",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "azbill014",
        "time": "15 hours ago",
        "context": "Who says the crème doesn't rises to the top even if it's spoiled.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "HalJaleikacik",
        "time": "12 hours ago",
        "context": "I’ll admit that I didn’t know this. \n\nBut I don’t teach kids.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "honestbroker1776",
        "time": "15 hours ago",
        "context": "This shows how the 20-30 past years have affected those who came through the Educational system and now teach. She should be arrested and Charged for Conspiracy once the Republicans take over. She knowingly robbed the Country of Money and cleaned it through the union.",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "papalouie",
                "time": "15 hours ago",
                "context": "Revenge isn’t a political platform son.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "honestbroker1776",
                        "time": "11 hours ago",
                        "context": "Justice for ALL is...Pops",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "alexander111",
        "time": "17 hours ago",
        "context": "Africa actually enslaved the Israelites for four hundred years under the Egyptian pharoah to be fair and balanced! The internal combustion engine, and electricity have done a lot to lessen the work load. If only they had been discovered earlier in the 17th century, rather than in the 19th century by brilliant inventors like Karl Benz, maybe there wouldn’t have been any slavery in America!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "typicalsituation85",
        "time": "14 hours ago",
        "context": "I share this is John Kerry in drag….",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "agrenadeforeveryliberal",
        "time": "57 minutes ago",
        "context": "600k a year and doesn't understand simple historical facts.\n\nUseless.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tull122",
        "time": "16 hours ago",
        "context": "Someone needs to take her out to the woodshed and teach her some basic history.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "owenmarshall976",
        "time": "17 hours ago",
        "context": "What a convoluted and polluted mind this woman has! Polluted with a crackpot Woke ideology that was passed down to her, from some other radical far left Liberal, unqualified to be teaching, college professor!",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "owenmarshall976",
        "time": "17 hours ago",
        "context": "If Woke Ideology prevails in the majority of schools, this country is doomed. There's no intelligent argument to that!",
        "good": "2",
        "bad": "0",
        "replies": []
    }
]