[
    {
        "user_name": "nothingbuta",
        "time": "1 September, 2022",
        "context": "I met an Army captain who served two tours in Afghanistan!  I asked him what he thought of the war! He answered by asking me what I think!  I said Afghanistan will always be Afghanistan, and we are wasting lives and money for a futile cause!  He leaned intO me and whispered in my ear, “You’re right”!",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Johnson19420",
        "time": "1 September, 2022",
        "context": "I hate to be the first one to say it but Afghanistan was a total and complete failure.  The worst in US military history.  20 years and trillions later, Afghanistan is worse than before and we lost some great Americans fighting a futile war.",
        "good": "10",
        "bad": "2",
        "replies": [
            {
                "user_name": "4fun",
                "time": "1 September, 2022",
                "context": "Another war on drugs.....",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "prussianblue",
                "time": "1 September, 2022",
                "context": "nam is worser and ww2 installed communism in ussr",
                "good": "1",
                "bad": "1",
                "replies": []
            },
            {
                "user_name": "charliecgdn",
                "time": "2 September, 2022",
                "context": "We fought a limited war, with no intention of winning.  We had the tools and chose not to use them.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "RodneyDPerkins",
        "time": "1 September, 2022",
        "context": "Biden caused the deaths of thousands and doomed a whole generation of girls and women that grew up free, educated, and happy to a miserable future.\n\nHad we maintained our base, it would not be long before the old guard of monsters died and the new generation would be in charge.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "prussianblue",
        "time": "1 September, 2022",
        "context": "I dont believe in swamp wars or the strategy used in getting our boys wasted for nothing.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "hanknwalt",
        "time": "1 September, 2022",
        "context": "An Army of Occupation is bound to fizzle out. The anti-Taliban  Afghans weren't willing to pitch in and help.",
        "good": "5",
        "bad": "0",
        "replies": [
            {
                "user_name": "nfinityman2",
                "time": "1 September, 2022",
                "context": "Who is \"anti-Taliban\" is based on ethnicity and time of day.",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "KAG928",
        "time": "1 September, 2022",
        "context": "Let’s Go Brandon.",
        "good": "5",
        "bad": "0",
        "replies": [
            {
                "user_name": "hanknwalt",
                "time": "1 September, 2022",
                "context": "And Bush, Barack Hussein times two, and Trump. No real Will to Win.",
                "good": "1",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "LoneStarRanger",
        "time": "1 September, 2022",
        "context": "The Afghanistan debacle will be the crowning jewel in Brandon's failed world policies.\n\nWhat happens to this great country after his speech tonight, will be attributed to him for all time.",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "usedtobeademocrat515",
                "time": "1 September, 2022",
                "context": "Yeah Trump really tried to get us out.....",
                "good": "1",
                "bad": "2",
                "replies": [
                    {
                        "user_name": "LoneStarRanger",
                        "time": "1 September, 2022",
                        "context": "You need to get out of your parent's basement, the wifi reception is bad down there and you're only getting the CNN live feed",
                        "good": "1",
                        "bad": "1",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "mikeybell",
                "time": "1 September, 2022",
                "context": "Trump killed 70 in Afghanistan - - - clearly the winner.",
                "good": "0",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "1pingyes2pingsno",
        "time": "1 September, 2022",
        "context": "Unscrupulous politicians and big industry use brave and noble young men and women as pawns in their money-making political schemes. Those demons are sacrificing America's heroes to bolster their own bank accounts.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "wesg19",
        "time": "1 September, 2022",
        "context": "The teams were doing their thing, doing what they do best.  The slide began when Rumsfeld came to the full realization that it was just young Captains, Warrant Officers and NCOs and their indigenous partners taking back a country.  \"Oh, No!  Must micro-manage!\" Once the generals started showing up things started going to hell.\n\nA better book of this specific period is the recent \"Swords of Lightning\" by Mark Knutsch and Bob Pennington, team leader & assistant on ODA-595, the actual and original \"horse soldiers.\"  Separates a lot of chaff from grain caused by some previous works.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "CroMagnonMan",
        "time": "1 September, 2022",
        "context": "Let us milk the fallout of our forever war together",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tomiron",
        "time": "1 September, 2022",
        "context": "\"War is a Racket,\" writtenby Marine Maj. Gen., Smedley Butler (no rear echelon pogue - recipient of two medals of honor) about how all our wars are about money. He said when he served in the Caribbean and Central America, he fought for United Fruit and when he served in China, he fought for Standard Oil. Nothing changes. same type of thing for the guys who fought in Iraq and Afghanistan.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "charliecgdn",
        "time": "2 September, 2022",
        "context": "\"Some of the first troops into Afghanistan celebrate victories, lament failures\" \nRead that: \"Some of the first troops into Afghanistan celebrate victories, lament Biden\"",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "randy4usa",
        "time": "1 September, 2022",
        "context": "\"There was no reason to leave Afghanistan… just like I don't believe there was any reason to leave Iraq at that time,\" Perry Blackburn, the founder of AFG Free and a former commander with 5th Special Forces group during the 2001 invasion of Afghanistan, told Fox News Digital.\n\nI agree 100% and don't care one iota over those who disagree.  Up until the Biden debacle, Afghanistan was a success.  It provided stability to the area.  We have already paid dearly for leaving, all will pay much more in the future.",
        "good": "3",
        "bad": "1",
        "replies": [
            {
                "user_name": "elite!",
                "time": "1 September, 2022",
                "context": "What years did you serve in Afghanistan, Rambo?",
                "good": "0",
                "bad": "2",
                "replies": [
                    {
                        "user_name": "randy4usa",
                        "time": "1 September, 2022",
                        "context": "Funny thing, I didn't serve in Afghanistan, but as an American, I have exactly the same right as you to express my opinion.\nSide note: I served six years in the Navy, four of those on an attack submarine, going places I can't discuss, and I worked in Iraq for two years, with plenty of close calls from mortars and rockets.",
                        "good": "1",
                        "bad": "1",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "sbrickman",
        "time": "1 September, 2022",
        "context": "Bush's goal when he invaded Afghanistan, like in Iraq, was to enrich defense contractors without any regard for Americans being killed or maimed",
        "good": "4",
        "bad": "8",
        "replies": [
            {
                "user_name": "newconservoutlook",
                "time": "2 September, 2022",
                "context": "You must have slept through 9/11.  2,996 people, Americans and foreign visitors, were murdered that day.  But that wasn't the end of the suffering; a large percentage of  those who were involved in projects that replaced the Twin Towers suffered a wide variety of medical issues.\n\nBush did what any real American would have done; he sent our military out to put terrorists like that into early graves.  And they were extremely successful in carrying out their assignment.\n\nThen, a year ago, along comes the \"BUILD BACK BROKEN BOY\", accompanied by his \"Destroy America\" team of communists.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "jdfromfla684",
        "time": "1 September, 2022",
        "context": "de oppresso libre",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "biden'shidin'",
        "time": "1 September, 2022",
        "context": "All these articles about Afghanistan are to accomplish what, exactly? We left a smidge beyond a year ago.  Articles like this should have been relentless back then when Brandon abruptly left and donated billions to the Taliban.  \nAfghanistan and a number of those middle eastern countries are all receptacles for bowel movements -- cesspools of deplorables with scattered blobs of goodness trying desperately to survive.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "american12186",
        "time": "1 September, 2022",
        "context": "What victory?  We didn't win that war!",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "sufferbus",
                "time": "2 September, 2022",
                "context": "true enough ",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "newconservoutlook",
                "time": "2 September, 2022",
                "context": "We have \"NO STONES JOEY\" to thank for that.  His middle name should be \"disaster & destruction\".",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "Peter_Safety",
        "time": "1 September, 2022",
        "context": "Ah yes … the job was completed at Tora Bora but was halted for being “too soon.” Then “democratic nation building” phase took effect, where Mr. retired Green Beret profiteered from …  he’s not saddened but sold his soul. 👿 ",
        "good": "0",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "sipius22",
        "time": "1 September, 2022",
        "context": "Tell me about it.....we are lamenting Biden's failures on an hourly basis!",
        "good": "4",
        "bad": "2",
        "replies": [
            {
                "user_name": "sbrickman",
                "time": "1 September, 2022",
                "context": "Maybe, you might be happier if you had a job to keep your mind off of Biden",
                "good": "2",
                "bad": "3",
                "replies": [
                    {
                        "user_name": "liberalclownz",
                        "time": "1 September, 2022",
                        "context": "Do you pay taxes? Are you invested in the financial markets? Are you a consumer? Do you want to walk the streets of your community in safety? Most Americans answer yes to all of those questions. Thus impossible to \"keep your mind off of Biden\". The guy is a disaster, and numbers do not lie.",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "zemmer",
        "time": "1 September, 2022",
        "context": "These tribes have been fighting among themselves for years.  We were wrong to ever get involved.  America needs to learn to mind their own business.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "quinncorsa",
        "time": "1 September, 2022",
        "context": "Smart man, Thank you for your service, Mr. Blackburn and company!🇺🇲",
        "good": "5",
        "bad": "0",
        "replies": [
            {
                "user_name": "elite!",
                "time": "1 September, 2022",
                "context": "Q: What's a Lt. Colonel?\nA: Someone who couldn't make General.",
                "good": "0",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "Nov2271",
        "time": "1 September, 2022",
        "context": "The zealots have always run the country. Everyone else just wants to be left alone. They want to remain 15th century and poor. Let them be.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "dcjj143540",
        "time": "1 September, 2022",
        "context": "\"lament failures\"...You spelled 'Biden' wrong.",
        "good": "6",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "patriot9999",
        "time": "1 September, 2022",
        "context": "Our troops are amazing and the best in the world, but the politicians misused them in Iraq and Afghanistan.\nWe can have a strong national defense without engaging in unconstitutional nation building strategies.",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cook79",
        "time": "1 September, 2022",
        "context": "We will never understand the Middle East.  We know how to take a country.  We can't figure out what to do with it once we get it.  Afghanistan doesn't know what to do with freedom.  Its people are tribal not national.  Their tribe is more important to them than their nation for the most part. They have also never known peace and many only know power through war.  We don't understand nation building.  We should have went in. Killed Al Qaida and the Taliban that were supporting them then let the Afghanis decide their future. Same with Iraq. We can't choose leadership for other countries.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tigereye983",
        "time": "1 September, 2022",
        "context": "Our government  didn't give the world the callous and heartless thought that we'd abandon our citizens and ideals of democracy. No it was Biden alone who did this. This is what happens when a Marxist Socialist is installed as President.",
        "good": "2",
        "bad": "0",
        "replies": [
            {
                "user_name": "sbrickman",
                "time": "1 September, 2022",
                "context": "You are delusional. Biden actually followed the withdrawal plans drawn up by Trump and set in motion by Trump.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "NWOequalsFail_2022",
        "time": "1 September, 2022",
        "context": "thank you for your service to our Constitutional Republic 🇺🇸 \nI had friends that gave all, GOD bless.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sufferbus",
        "time": "2 September, 2022",
        "context": "🇺🇸",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "benjo62",
        "time": "1 September, 2022",
        "context": "I remember John Rambo and Colonel Troutman giving their all for the people of Afghanistan while those Russians committed atrocities at that prison stronghold. Thank goodness for Rambo’s bow and arrow.",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "sc1014",
        "time": "1 September, 2022",
        "context": "Biden did that!",
        "good": "4",
        "bad": "0",
        "replies": [
            {
                "user_name": "mikeybell",
                "time": "1 September, 2022",
                "context": "Trump killed 70 US troops in Afghanistan.\n\nTrump is clearly the winner with the higher number.",
                "good": "0",
                "bad": "5",
                "replies": [
                    {
                        "user_name": "jdfromfla684",
                        "time": "1 September, 2022",
                        "context": "Really how many did Trump leave behind?",
                        "good": "2",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "mikeybell",
                                "time": "1 September, 2022",
                                "context": "The ones left behind deserve their fate - - - all had MONTHS to evacuate that region.",
                                "good": "1",
                                "bad": "3",
                                "replies": [
                                    {
                                        "user_name": "sc1014",
                                        "time": "1 September, 2022",
                                        "context": "Just like illegals crossing our southern border. They’ve had years to come and do it illegally. OR go to other countries!",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": [
                                            {
                                                "user_name": "sc1014",
                                                "time": "1 September, 2022",
                                                "context": "LOL And…if you know you’re coming and crossing a river(which is vast and most often the path)…why not teach yourself/children to swim? See…dumb argument like yours on Afghanistan. Get a history book(and not a current liberal one).",
                                                "good": "0",
                                                "bad": "0",
                                                "replies": []
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "user_name": "sc1014",
                        "time": "1 September, 2022",
                        "context": "So, you count Trump as putting them in Afghanistan? And only count those Americans…not the many that were killed afterwards that aren’t US people? See where your priorities are.",
                        "good": "2",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "sc1014",
                        "time": "1 September, 2022",
                        "context": "Or get a geography book. Doubt the Rio Grande River has moved much in the decades.\nThis with Afghanistan(if you cared to read the article) is about leaving the equipment, not even about the US Americans…except it seems you’re ok with wasting money. Betcha took a rent/mortgage/payout Covid check/break too, right? Bottom feeders are killing the American society while the elites dance in DC.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "sc1014",
                        "time": "1 September, 2022",
                        "context": "BTW, Obama wins…over 1900 Americans killed in Afghanistan years of his. Try again, sweetheart!",
                        "good": "2",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    }
]