[
    {
        "user_name": "Trumplicious",
        "time": "31 August, 2022",
        "context": "Law enforcement  is only as good as the judges who hear the cases police bring into court. If you have bad judges you will have bad law enforcement. This goes for the DOJ and FBI, all the way down to every town and municipal court in America.",
        "good": "4",
        "bad": "0",
        "replies": [
            {
                "user_name": "blackkingg",
                "time": "31 August, 2022",
                "context": "If you have bad cops bring your bad charges then what?",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "avatarofpan",
                        "time": "31 August, 2022",
                        "context": "The whole system is corrupt to the core.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "Trumplicious",
                        "time": "31 August, 2022",
                        "context": "The good judge will throw the cases out and let the police know not to try to pull that in his court. This makes law enforcement better. The only way law enforcement will do it by the book 100 percent of the time is if judges force it by how they run their courts.",
                        "good": "1",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "avatarofpan",
                                "time": "31 August, 2022",
                                "context": "On a completely different note I have a bridge for sale that is perfect for you…. Cheap!",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "avatarofpan",
                "time": "31 August, 2022",
                "context": "It is not just the judges. The prosecutors hold great power. DuckDuckGo “Kamala Harris is a cop who wants to be president “\nNot a single conservative media outlet reported this story to keep up The Big Lie that “It is only a few bad apples.”\nIt involves a girl.",
                "good": "3",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "suzon",
                "time": "31 August, 2022",
                "context": "Obama packed the courts with liberal judges in 2014.  ",
                "good": "2",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "danojr.",
        "time": "31 August, 2022",
        "context": "everybody's an expert ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ourcountryisdone",
        "time": "31 August, 2022",
        "context": "We do not have equal justice in the US. The FBI and DOJ are using their power to harm the conservatives. They care nothing for justice, only hurting us. We have no freedom. We have no country",
        "good": "12",
        "bad": "0",
        "replies": [
            {
                "user_name": "suzon",
                "time": "31 August, 2022",
                "context": "They’ve been “weaponized” by the left. But this falls into line with the left’s goal of bringing down our country.   ",
                "good": "2",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "avatarofpan",
                "time": "31 August, 2022",
                "context": "Yes!\nBut YOU did this by not holding law enforcement accountable for their actions!",
                "good": "0",
                "bad": "2",
                "replies": []
            }
        ]
    },
    {
        "user_name": "john_baron",
        "time": "31 August, 2022",
        "context": "Fox hates cops.",
        "good": "1",
        "bad": "3",
        "replies": [
            {
                "user_name": "aberj3",
                "time": "31 August, 2022",
                "context": "If John Baron said it, it must be true.",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "peadigger",
        "time": "31 August, 2022",
        "context": "I trust law enforcement. You have some bad people in every type of business that there is. Overall people in law enforcement who are serving and protecting the people are good.",
        "good": "13",
        "bad": "2",
        "replies": [
            {
                "user_name": "avatarofpan",
                "time": "31 August, 2022",
                "context": "No, the majority are corrupt, the few good ones are outnumbered.\nOver three hundred cops hanging out in Texas as children died.\nParents being arrested at school board meetings for trying to protect their children from grooming.\nPastors arrested for holding service.\nDuckDuckGo “A Cop Rear-Ended a Car, Sending a Toddler to the Hospital. The Car's Driver Was Breathalyzed. The Cop Wasn't.”For how they protect each other no matter how horrific the actions.",
                "good": "0",
                "bad": "6",
                "replies": []
            }
        ]
    },
    {
        "user_name": "tiredofbs1",
        "time": "31 August, 2022",
        "context": "We trust law enforcement, We DO NOT trust the District Attorneys office in most cities to keep us safe and keep the criminals behind bars!",
        "good": "4",
        "bad": "0",
        "replies": [
            {
                "user_name": "avatarofpan",
                "time": "31 August, 2022",
                "context": "Three hundred cops hanging out in Texas as children died!\nThe Parkland cop got his job back with full back pay!",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "avatarofpan",
        "time": "31 August, 2022",
        "context": "What you are seeing is the natural outcome of blindly backing law enforcement. This is nothing new, law enforcement and the system have been corrupted for decades. The only change is that now Republicans are the target. If you had held law enforcement accountable for their actions then the nation would not be in the trouble we are in now. You are reaping what you have sown. The only path forward is to admit your mistakes and start demanding Equal Justice under Rational laws.",
        "good": "2",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "clerk",
        "time": "31 August, 2022",
        "context": "FBI is not law enforcement! They are a political arm of the federal government. ",
        "good": "6",
        "bad": "1",
        "replies": [
            {
                "user_name": "avatarofpan",
                "time": "31 August, 2022",
                "context": "They do not enforce laws?\nThis is nothing new.\nYou did not care when they did it to others.\nRepublicans are reaping what they have sown.",
                "good": "0",
                "bad": "3",
                "replies": []
            }
        ]
    },
    {
        "user_name": "isles72",
        "time": "31 August, 2022",
        "context": "You need a \"expert\" to tell us this???????????????????",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "thatsfunnyrightthere",
        "time": "31 August, 2022",
        "context": "Sorry, but the \"vast majority of good\" ones is really dwindling and so weaponized by politics, there may be no fixing it. Until people start seeing justice applied fairly again, trust will continue to erode.",
        "good": "8",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "oldtimer22227",
        "time": "31 August, 2022",
        "context": "get rid of the DC Group of FBI and DOJ  and we will talk about trust.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "ellobo999",
        "time": "31 August, 2022",
        "context": "ANY LEO......Local, State, or Federal......SWORN to uphold the Constitution.....who knowingly foregoing said OATH for ANY reason is, in fact untrustworthy, a liability to his/her agency, and should immediately be be TERMINATED for cause! That being said, the Federal System is awash in Political yes men! No Federal Officer will ever be trusted again, by Civilians until such time that ALL weaponized agencies are purged of Political Appointees.......that is how I see it!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "avatarofpan",
        "time": "31 August, 2022",
        "context": "How can we keep the public believing The Big Lie that “It is only a few bad apples “ with stories like this, the over three hundred cops hanging out in Texas as children died, the unjust raid on Trump’s home, the parents being arrested at school board meetings for trying to protect their children from grooming. The pastors being arrested for holding service. The unjust prosecution of those in DC on January sixth and all the other stories of the abuses of law enforcement.  People are learning the truth and it must stop!",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "See_the_difference?",
        "time": "31 August, 2022",
        "context": "So... defund the police? Republicans are so bizarre.",
        "good": "1",
        "bad": "3",
        "replies": [
            {
                "user_name": "sharp_shooter",
                "time": "31 August, 2022",
                "context": "We just want to hold rogue FBI agents accountable. The problem is that they have become an enforcement arm of the democrat party to be used as a tool to attack political adversaries. That starts at the top...",
                "good": "0",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "avatarofpan",
                        "time": "31 August, 2022",
                        "context": "Why do you not want to hold all corrupt law enforcement accountable for their actions?\n Oh, I know because it is others that they are abusing.\nHow did that policy work out for you with pastors being arrested for holding service?",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "cegg",
        "time": "31 August, 2022",
        "context": "Law enforcement yes, Democrat Party no.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Trumplicious",
        "time": "31 August, 2022",
        "context": "As soon as Comey Testified under oath that he, the FBI and DOJ had no idea the IF dossier was true when they used it to obtain warrants, the judge, if a good judge, would have issued bench warrants for the arrest of everyone who turned the dossier into the judge swearing by signature it was true information.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "mdnamvet",
        "time": "31 August, 2022",
        "context": "With the revolving door created by liberal prosecutors and judges, I am amazed the police even try to enforce the laws risking their own health and safety only to watch the perps walk out the jail door as soon as they get them there.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "kayley",
        "time": "31 August, 2022",
        "context": "It all depends on where you live.  I have very high confidence in my local town police and county deputies.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "millabout",
        "time": "31 August, 2022",
        "context": "I have all the confidence in the world for law enforcement. It's the politicians and media I don't trust.",
        "good": "2",
        "bad": "1",
        "replies": [
            {
                "user_name": "avatarofpan",
                "time": "31 August, 2022",
                "context": "Law enforcement have proven themselves to be so corrupt that only a person with an extremely low IQ would trust them.\nLook at the unjust prosecution of those in DC on January sixth.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "recorddeathsbodybagbiden",
                        "time": "31 August, 2022",
                        "context": "Been arrested many timer haven't you.. typical liberal",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "avatarofpan",
                                "time": "31 August, 2022",
                                "context": "Even now with the irrefutable evidence of how corrupt law enforcement is you continue to deny the truth. You are as bad as the Democrats who continue to support failed policies no matter how they destroy the country!\nIf you love parents being arrested at school board meetings for trying to protect their children from grooming and the unjust prosecution of those in DC on January sixth keep blindly backing law enforcement.",
                                "good": "0",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "recorddeathsbodybagbiden",
                                        "time": "31 August, 2022",
                                        "context": "I know many many cops, they actually support those parents and it is their bosses that instruct them and order them.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": [
                                            {
                                                "user_name": "avatarofpan",
                                                "time": "31 August, 2022",
                                                "context": "Only a punk would use the excuse “I was just following orders.”!\nI know good people in law enforcement but they are outnumbered by sadistic monsters.",
                                                "good": "0",
                                                "bad": "0",
                                                "replies": []
                                            },
                                            {
                                                "user_name": "avatarofpan",
                                                "time": "31 August, 2022",
                                                "context": "They S.B. Your post.\nCan not read your reply.",
                                                "good": "0",
                                                "bad": "0",
                                                "replies": []
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "sharp_shooter",
        "time": "31 August, 2022",
        "context": "We have confidence in our local law enforcement. Our prosecutors actually hold criminals accountable, and our officers work hard to keep our towns safe.",
        "good": "0",
        "bad": "1",
        "replies": [
            {
                "user_name": "ftp_ftp",
                "time": "31 August, 2022",
                "context": "back the blue until it happens to you",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "MarxistDemonicRATs",
        "time": "31 August, 2022",
        "context": "I trust police…I do not trust government legislators \n\nIMPEACH46",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "joe1077",
        "time": "31 August, 2022",
        "context": "I have confidence in law enforcement.\n\nI do not have confidence in politicians.\n\nPoliticians tie the hands of law enforcement making nearly impossible for them to do their jobs. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "avatarofpan",
        "time": "31 August, 2022",
        "context": "Even now with the irrefutable evidence of how corrupt law enforcement is you continue to deny the truth. You are as bad as the Democrats who continue to support failed policies no matter how they destroy the country!\nIf you love parents being arrested at school board meetings for trying to protect their children from grooming and the unjust prosecution of those in DC on January sixth keep blindly backing law enforcement.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "robb521556",
        "time": "31 August, 2022",
        "context": "It’s not necessarily the boots on the ground that people have a problem with it’s the leadership and policies that have handcuffed and led to inferior officers and problems at ground level.",
        "good": "3",
        "bad": "1",
        "replies": [
            {
                "user_name": "josull",
                "time": "31 August, 2022",
                "context": "It's never the criminal's fault, especially the ones released by socialist DAs and judges.",
                "good": "1",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "lesfender",
        "time": "31 August, 2022",
        "context": "It’s more DA’s and judges that I don’t have confidence in.  Like….I don’t have confidence they want to keep criminals locked up.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "josull",
        "time": "31 August, 2022",
        "context": "You want confidence? Learn how to handle a firearm and carry it with you.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "jtmojave",
        "time": "31 August, 2022",
        "context": "I have confidence in law enforcement I don’t have confidence in evil people ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "gradeightbolt",
        "time": "31 August, 2022",
        "context": "DOJ management,  remember the school boards.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "robertprice07",
        "time": "31 August, 2022",
        "context": "Growing up, the FBI was my idol.  The ultimate Americans. Now, they've become politically weaponized, along with the DOJ.  Sad and disillusioned now. Never trust either again.",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "juniormudd723",
        "time": "31 August, 2022",
        "context": "correction!!... we have no confidence in FEDERAL law enforcement!!",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "freenbean_i_fonebone",
        "time": "31 August, 2022",
        "context": "Yes, there is a small percentage of bad cops, just like you will find bad actors in every demographic in the world.\n\nHowever, I'm not sure it's \"law enforcement\" per se that people don't trust as much as it is a politicized justice system where we see murderers released without bail; where we see criminals with decades-long records being treated as the victims rather than the real victims; where there's no real deterrent to crime because criminals don't fear punishment.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "ftp_ftp",
                "time": "31 August, 2022",
                "context": "problem is that bad cops are protected by all the other police",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "comeonnn",
        "time": "31 August, 2022",
        "context": "This all really started when the housing market crashed because of shoddy loans. Law enforcement was being vilified by wanna be politicians because they had stable jobs with stable paychecks and stable retirements.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "padraig931",
        "time": "31 August, 2022",
        "context": "What?  You would have to be a completely brain dead communist to even slightly think that the FBI hasn’t been completely weaponized against conservative minded American citizens. They had the “insurance policy “ against Trump, Hillary just made a mistake, Russian collusion , lied to a FISA court, buried Hunter Biden’s laptop and 30 heavily armed traitors raided a former Presidents home on a warrant signed by an avowed Trump hater and Democrat supporter over a non criminal document disagreement.  Really?  Trust them ?  Why?  ",
        "good": "3",
        "bad": "0",
        "replies": [
            {
                "user_name": "avatarofpan",
                "time": "31 August, 2022",
                "context": "Most law enforcement is corrupt.",
                "good": "1",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "gray054",
        "time": "31 August, 2022",
        "context": "It’s not all police. Just a few select bad apples. The real problem is the District Attorneys not doling out proper charges, low bail or no bail and worrying more about pleading criminals out than making sure the punishment fits the crime. \nPolice officers are repeatedly arresting the same people for the same crimes only to see them back on the street the next day. \nLet’s hire more officers. Train them properly and hold them and their superiors accountable.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "thinkinghmmm",
        "time": "31 August, 2022",
        "context": "The police don’t enforce the laws. Political justice department’s are to blame for NOT enforcing the laws. It’s not the police’s fault.",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "avatarofpan",
                "time": "31 August, 2022",
                "context": "They definitely don’t enforce the laws when it is one of their own. They even have medallions on their personal cars that place them above even simple traffic laws.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "sapinva",
        "time": "31 August, 2022",
        "context": "The feds are corrupt, full stop.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "avatarofpan",
                "time": "31 August, 2022",
                "context": "Most law enforcement is corrupt.\nHow is that policy of not holding them accountable for their actions working out for you now?",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "Mayhew984",
        "time": "31 August, 2022",
        "context": "I believe most law abiding citizens trust the police, sheriff deputies, and the highway patrol that they would possibly encounter on a daily basis. It is the federal agencies that have lost our trust by being used as political pawns.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "avatarofpan",
                "time": "31 August, 2022",
                "context": "Read Republican Senator Rand Paul’s book Government Bullies.",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "ftp_ftp",
                "time": "31 August, 2022",
                "context": "police aren’t your friends",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "Mayhew984",
                        "time": "31 August, 2022",
                        "context": "Police aren’t your enemies either unless you are doing wrong.",
                        "good": "0",
                        "bad": "1",
                        "replies": [
                            {
                                "user_name": "ftp_ftp",
                                "time": "31 August, 2022",
                                "context": "police have been complicit in jailing many, many innocent people. so you are factually wrong",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "CMAG🇺🇸",
        "time": "31 August, 2022",
        "context": "The Democrats are purging the good Police out of Departments around the country and turning them into Woke Police!  ",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "ftp_ftp",
                "time": "31 August, 2022",
                "context": "how exactly is that happening?",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "gonegonegone287",
        "time": "31 August, 2022",
        "context": "I'm of the opinion that in it's current form the FBI is not an allie of the American people. It all changed post 2008 when they along with other federal agencies were weaponized against our citizens. Unfortunately the driving force behind that weaponization has be re empowered by a patsy president and again the people are under attack by the government they represent.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "picircle7",
        "time": "31 August, 2022",
        "context": "Not sure what Ted William's is talking about..  Neither does he...  Law-abiding citizens always supported law enforcement... It's law enforcement that lost support of their leaders...  The same leaders who pass the laws they expect law enforcement to enforce....  It's the Democrats that endorsed and supported the defund police and anti-police rhetoric that created this contempt for law and order...",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "avatarofpan",
        "time": "31 August, 2022",
        "context": "Law enforcement is corrupt to the core across the country!\n\n“Alabama Cops Arrested Man Watering His Neighbor's Plants Because He Wouldn't Give Them His Full Name”\n\n“Denver Police Hurt 6 Bystanders in a Shooting. So the City Cracked Down on Food Trucks.”\n\n“A Mom Let Her 7-Year-Old Play in the Park. Arizona Arrested Her and Banned Her From Working With Kids.”",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ftp_ftp",
        "time": "31 August, 2022",
        "context": "yes, law abiding citizens don’t have confidence in police",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "chuckt746",
        "time": "31 August, 2022",
        "context": "Hiring more officers don't mean much when the powers that be refuse to fight and support them, why arrest them when the DA's won't prosecute, and judges that release them.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Pinball-Wizard",
        "time": "31 August, 2022",
        "context": "I have plenty of confidence in Law Enforcement (not every cop is a good one but overwhelmingly they do a great job overall) but not for government agencies that can affect our elections...",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "chentallymallenged1",
        "time": "31 August, 2022",
        "context": "I have full confidence in law enforcement. I have Zero confidence in the people that have power over them.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "artycayne",
        "time": "31 August, 2022",
        "context": "I believe that the  majority of law enforcement are good people. These people are just normal citizens trying to survive and support their families. They are in a “corporate” situation which places them in a situation where if you go against the grain- question leadership or “ don’t go with the flow”- you’ll lose your job and become ostracized. Place yourself in this situation! You can lose you livelihood and put your family in jeopardy if you don’t follow the status quo. Look what happened to the Marine officer that spoke out. against the administration. He lost his position and his retirement. People on here said “good for him” for speaking out. Yet- months later- no one cares and his family suffers. It did no good. Most of you talk a good game but when it comes to feeding your family I’d bet you’d go along with the leadership’s politics and do whatever it took to keep providing for your family although it went against what you truly believed.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "exleftcoast536",
        "time": "31 August, 2022",
        "context": "Not sure what he's trying to say here. First of all, I've never in my life, through family, friends or business associates, had any interface with the FBI. Using the term \"law enforcement \" and including the FBI, I think is misleading. The FBI is an entirely different can of worms when discussing \"law-abiding \" Americans. I have full confidence in local and state law enforcement.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "avatarofpan",
        "time": "31 August, 2022",
        "context": "DuckDuckGo “Kamala Harris is a cop who wants to be president “\nNot a single conservative media outlet reported this story to keep up The Big Lie that “It is only a few bad apples.”\nIt involves a girl.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "avatarofpan",
        "time": "31 August, 2022",
        "context": "You trust law enforcement?\nHa-ha!\nRead Republican Senator Rand Paul’s book Government Bullies.\nUnless you are under the delusion Paul is an undercover lib!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bobloblaw731",
        "time": "31 August, 2022",
        "context": "I just don’t trust liberal DA’s",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "avatarofpan",
                "time": "31 August, 2022",
                "context": "DuckDuckGo “A Houston Drug Cop's Lies Sent This Man to Prison for 25 Years”Law enforcement is corrupt to the core.",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "sanity-escapes-me",
        "time": "31 August, 2022",
        "context": "\"The law-abiding citizens in this country have no confidence, unfortunately, in law enforcement.\"\nThat statement is a false premise. How many of you have a problem with state and local law enforcement? How many have a problem with Federal law enforcement? His statement should not read, \"law enforcement\" only. It needs to be qualified.",
        "good": "0",
        "bad": "0",
        "replies": []
    }
]