[
    {
        "user_name": "Ghostofreagan81",
        "time": "20 April, 2020",
        "context": "Maybe works for the light African rural population,, 2 tons of supplies wouldn't even dent the amount needed by one US City Hospital in one week.  Ridiculous article.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "kag2020andalways",
        "time": "20 April, 2020",
        "context": "Great story.  Hope this makes it to America.",
        "good": "3",
        "bad": "0",
        "replies": [
            {
                "user_name": "JoeFox1",
                "time": "20 April, 2020",
                "context": "Then they can get rid of all those pesky u.p.s.,Fed Ex and U.S.P.S. trucks and workers earning a good living here and replace them with these. Yeayyyy!",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "kag2020andalways",
                        "time": "20 April, 2020",
                        "context": "Well some loads will be to big or heavy.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "kinkam",
        "time": "20 April, 2020",
        "context": "This makes zero sense. All of Africa comprising of 54 countries have much fewer cases than in the US. Use these drones in America.",
        "good": "3",
        "bad": "2",
        "replies": [
            {
                "user_name": "JoeFox1",
                "time": "20 April, 2020",
                "context": "Just using it as a zero liability test bed where they can use cheap labor and keep it secret to boot. They were already there pre virus running these tests. Here they would be under scrutiny.",
                "good": "2",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "JVanCleef",
                "time": "20 April, 2020",
                "context": "They've been using drones for healthcare in Africa for a few years now.  In the US we have a good transportation system so usually we don't need drones to reach remote areas.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "JoeFox1",
        "time": "20 April, 2020",
        "context": "Use Africa as a test bed....zero chance anyone sues if anything goes wrong. They must have been secretly doing this before the virus outbreak all along to get by liability restrictions here. No doubt driverless cars are probably zipping around there too. No matter what they say, these are all just trying to eliminate jobs. In the end only the company building it makes out....the workers lose jobs and a living...and nothing gets any cheaper.",
        "good": "1",
        "bad": "1",
        "replies": [
            {
                "user_name": "JVanCleef",
                "time": "20 April, 2020",
                "context": "Are Dr. Mengele's great grandson?",
                "good": "0",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "longgame",
        "time": "20 April, 2020",
        "context": "They have too operate like that...  The \" Nigerians\"  will steal the truck and kill all the white people if they show up in person...",
        "good": "16",
        "bad": "0",
        "replies": [
            {
                "user_name": "JVanCleef",
                "time": "20 April, 2020",
                "context": "Wow.  The racism here is so thick it's disgusting.\n\nAnd not ONE so-called \"conservative\" ever calls it out.",
                "good": "0",
                "bad": "3",
                "replies": [
                    {
                        "user_name": "llortretsam",
                        "time": "20 April, 2020",
                        "context": "Stop choosing to be offended, Karen.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "error": "error"
    },
    {
        "error": "error"
    },
    {
        "user_name": "Robincole",
        "time": "20 April, 2020",
        "context": "It could  be used to  track those who might have the virus, then call in for pickup.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "flyover53",
        "time": "20 April, 2020",
        "context": "The next tool for de Blasio, Murphy, Whitmer, Newsom's in the fight to control the sheep- surveillance drones to seek out violators of their draconian orders.",
        "good": "8",
        "bad": "0",
        "replies": [
            {
                "user_name": "JoeFox1",
                "time": "20 April, 2020",
                "context": "Absolutely no doubt....and the stupid Democratic liberals will think it’s great.",
                "good": "8",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "scatpack70",
        "time": "20 April, 2020",
        "context": "NOTHING good has ever come from Africa   why bother ???    Follow the money  to Pelosi  investments",
        "good": "6",
        "bad": "0",
        "replies": [
            {
                "user_name": "JVanCleef",
                "time": "20 April, 2020",
                "context": "Well, Moses did lead the Israelites out of Egypt.",
                "good": "0",
                "bad": "1",
                "replies": []
            },
            {
                "user_name": "citizenusaone",
                "time": "20 April, 2020",
                "context": "All humans came out of Africa. By your logic you are something that is not good.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "scatpack70",
                        "time": "20 April, 2020",
                        "context": "Middle east Tigres and Euphraties river valley  genius",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "PurpleHat",
        "time": "20 April, 2020",
        "context": "That's okay we don't need any drones over here you just keep them over there",
        "good": "4",
        "bad": "0",
        "replies": [
            {
                "user_name": "supernat14211",
                "time": "20 April, 2020",
                "context": "They're already here, being used to spy on our own people in several counties.  At least these folks are using them for a beneficial reason.",
                "good": "3",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "error": "error"
    },
    {
        "user_name": "HarryT.Bagger",
        "time": "21 April, 2020",
        "context": "Drones in America? The Trump crowd would go bat-ship crazy and shoot up the governor's house.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Bedford66",
        "time": "20 April, 2020",
        "context": "Maybe drop some birth control while you're at it",
        "good": "13",
        "bad": "1",
        "replies": [
            {
                "user_name": "vette6266",
                "time": "20 April, 2020",
                "context": "Not to worry, the Liberals will provide it free of charge. Just send the abortionist bill to the American taxpayer. You know us middle class have plenty of money to give to others, Just ask a Liberal.",
                "good": "3",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "2BUKU4U",
        "time": "20 April, 2020",
        "context": "Hmmm...we are using American drones in Africa, but we are using Chinese spy drones here...hmmm...",
        "good": "13",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "lexylee",
        "time": "20 April, 2020",
        "context": "Why not use this on the Mexican border? Except it won't be dropping test kits",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Rublicon",
        "time": "20 April, 2020",
        "context": "The Gods Must Be Crazy!",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "JerryShip",
        "time": "20 April, 2020",
        "context": "Been a Fox news viewer for a very long time.  I'm very close to changing my news source since they consistently remove posts that are absolutely not racist, profane nor vile in nature.  HEAVY CENSORSHIP is taking hold and I've begun to notice they've been sensationalizing many of their headlines lately.",
        "good": "1",
        "bad": "1",
        "replies": [
            {
                "user_name": "Farmingnomore",
                "time": "20 April, 2020",
                "context": "New ownership............",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "error": "error"
                    }
                ]
            },
            {
                "user_name": "bytemaker",
                "time": "20 April, 2020",
                "context": "Some may be flagging your posts.",
                "good": "1",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "JVanCleef",
                "time": "20 April, 2020",
                "context": "I'm sure Fox News will pay close attention to your complaint.",
                "good": "0",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "JerryShip",
                        "time": "21 April, 2020",
                        "context": "Just voicing my opinion, just like you Einstein.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "MISSISSIPPIPROUD",
                "time": "20 April, 2020",
                "context": "Fox is owned by Disney.  They're all in bed together.",
                "good": "3",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "notcalifornia",
        "time": "20 April, 2020",
        "context": "Africa has lowest coronavirus death toll. Probably cause its hot there and the virus doesn’t do well in heat",
        "good": "2",
        "bad": "2",
        "replies": [
            {
                "error": "error"
            },
            {
                "user_name": "macss",
                "time": "20 April, 2020",
                "context": "Several countries in Africa has been hit harder than many other countries, in Africa and around the world.\n\nContinent wise they are on par with Australia I think.",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "JVanCleef",
                "time": "20 April, 2020",
                "context": "Yeah, because they're all over testing there.\n\nI saw some video of a market in Lagos yesterday.  Everybody has to eat every day.  The death toll is going to be huge.",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "bytemaker",
                "time": "20 April, 2020",
                "context": "Perhaps that's part.  Relatively low long distance travel rates in regions of it may be another.",
                "good": "0",
                "bad": "1",
                "replies": []
            },
            {
                "user_name": "citizenusaone",
                "time": "20 April, 2020",
                "context": "It has not spread as far and as fast. Africa may have more deaths than any other continent. Travel is not widespread as other areas and the distances can be farther and it will take more time. But more important most African countries don't have a robust medical care system.",
                "good": "3",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "supernat14211",
                        "time": "20 April, 2020",
                        "context": "Their healthcare is so abysmal that their leaders often fly to other countries for even basic needs, instead of fixing their own healthcare system.  Unfortunate that they can't fly anywhere right now...",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "vette6266",
        "time": "20 April, 2020",
        "context": "We do need more surveillance since the Liberals still don't have full control of the USA. But not to worry, they are using the crisis, can't let it go to waste, to get more and more controls on We the People. Like so many restrictions on the 2A that only the criminals will be armed and the Liberals are just loving it. All law abiding citizens need insurance and a license and extensive training and the their criminal army will not have to abide by any of the new 2A \"rules\"",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "supernat14211",
        "time": "20 April, 2020",
        "context": "Now that's a proper usage of drones.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "NavK",
        "time": "21 April, 2020",
        "context": "I am amazed at how happy people these days are to give up their rights and liberties for fake sense of security and a (welfare) nanny state. no i don't want drones on me... everyone applauding this doesn't understand the slippery slope of governmental tyranny. soon you will have no rights you are basically signing off on 4A (...against unreasonable searches and seizures...) by cheering this on. 2A is already withering away steadily...\nThe greatest constitution given to us by greatest founding fathers who allowed the citizenry every protection against themselves (executive and legislature) did not do all this so you can put these on a platter and give to back ANY government. Keeping ther rights is your duty to yourself and your generations to come. Make no mistake...",
        "good": "0",
        "bad": "1",
        "replies": []
    }
]