[
    {
        "user_name": "MoreMajorum",
        "time": "20 September, 2022",
        "context": "They're trying to pin it on the white guy.  Can you say Richard Jewell?  $1,000 down personnel were smoking in an area containing improperly disposed of hazardous material.  Read about the USS George Washington.  The woke Navy is a joke.",
        "good": "4",
        "bad": "0",
        "replies": [
            {
                "user_name": "ivanyakinov048",
                "time": "20 September, 2022",
                "context": "Why no picture of Kenji?",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "peopleschamp",
                "time": "20 September, 2022",
                "context": "Oppressed and persecuted white guy makes and appearance. LOL",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "chicagophil",
        "time": "19 September, 2022",
        "context": "At least he took out his anger and damaged the ship, rather then possibly vent by becoming a Mass shooter",
        "good": "0",
        "bad": "1",
        "replies": [
            {
                "user_name": "CPO(SW)ret690",
                "time": "19 September, 2022",
                "context": "The risk to lives was great. The loss of the ship will have an adverse effect on readiness for years to come.",
                "good": "2",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "chicagophil",
                        "time": "19 September, 2022",
                        "context": "Too bad we don't have Yardarms anymore",
                        "good": "0",
                        "bad": "1",
                        "replies": [
                            {
                                "user_name": "CPO(SW)ret690",
                                "time": "19 September, 2022",
                                "context": "We do",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "user_name": "ArchenlandKnight",
                        "time": "20 September, 2022",
                        "context": "True. But what you don't have is any solid proof that the accused is responsible.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "CPO(SW)ret690",
                                "time": "20 September, 2022",
                                "context": "You can read any of my posts on this and find I NEVER made any claim toward guilt or innocence. Yard periods are dangerous in these regards and the evidence is not physical it is only testimony in general terms. Does sabotage happen, yes on occasion it has, not so much from Sailors that just hate the choices they made, usually it is a Woman the Sailor doesn't want to leave for months on end. FACT",
                                "good": "0",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "ArchenlandKnight",
                                        "time": "21 September, 2022",
                                        "context": "You are correct. I should have phrased it more neutrally, like \"What we don't have,\" or \"What the Navy doesn't have\". I apologize for the accusatory phrasing.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "ArchenlandKnight",
                "time": "20 September, 2022",
                "context": "But ... did he? You've got one guys testimony. That's not proof of anything.",
                "good": "1",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "🍊🤡Donald\"IDeclassifedIt\"Trump🍊🤡",
                "time": "21 September, 2022",
                "context": "Followed by Pub \"thoughts and prayers.\"",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "mbee1",
        "time": "20 September, 2022",
        "context": "You cannot light a pile of cardboard on fire and sink a ship unless the officers in charge have allowed the fire suppression system to be turned off and allowed a bunch of flammable objects to be piled up in the huge pile.  The ships officers were rotten to the core.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "bone_head",
                "time": "20 September, 2022",
                "context": "How about reading the report on the fire before making some unjustified comments.  You will see exactly why the fireman was secured in parts of the ship.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "ivanyakinov048",
        "time": "20 September, 2022",
        "context": "No picture of Kenji?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sirarthur2012",
        "time": "20 September, 2022",
        "context": "He won't be found guilty, but his navy career is over.",
        "good": "1",
        "bad": "2",
        "replies": [
            {
                "user_name": "🍊🤡Donald\"IDeclassifedIt\"Trump🍊🤡",
                "time": "21 September, 2022",
                "context": "Stand by for a \"Big Chicken Dinner!\"",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "wilkinak",
                "time": "21 September, 2022",
                "context": "He didn't have a navy career before this.  He was just in the Navy.",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "unclefess923",
        "time": "20 September, 2022",
        "context": "If there is no evidence they may as well not charge him. Even if they railroad him through his first trial he will still be acquitted by appeal.",
        "good": "3",
        "bad": "0",
        "replies": [
            {
                "user_name": "yankeedogg",
                "time": "20 September, 2022",
                "context": "And if he did do it but they fail to prove it, they can't go back after him later on of new evidence becomes available.",
                "good": "4",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "unclefess923",
                        "time": "20 September, 2022",
                        "context": "A good point. They may very well have good reasons for their suspicions, I'm not questioning that.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "yankeedogg",
        "time": "20 September, 2022",
        "context": "The navy better have this one right. The military as a whole, has a bad record for trying to pin charges on people to avoid the chain of command from looking bad.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "ryarios373",
                "time": "20 September, 2022",
                "context": "That works better when the person they pin it on is killed in the mishap...",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "stevel573",
                "time": "20 September, 2022",
                "context": "You're right, and this isn't something that's an internal Navy matter it was a worldwide story and the result of a court martial will be worldwide news.   If they're wrong and just trying to find a scapegoat it'll make them look pretty awful.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "wilkinak",
        "time": "19 September, 2022",
        "context": "The Navy has a long history of blaming junior enlisted for the failings of senior officers.  Good Luck, kid.",
        "good": "25",
        "bad": "2",
        "replies": [
            {
                "user_name": "CPO(SW)ret690",
                "time": "19 September, 2022",
                "context": "Several Officers careers came to a end over this.",
                "good": "1",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "mbee1",
                        "time": "20 September, 2022",
                        "context": "Yes they did but none got thrown in the brig, they all retired with a pension. Nobody went to the other bases and ships and looked for the same behavior which from other incidents is most likely epidemic in the brass most likely from the top down.",
                        "good": "4",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "bone_head",
                                "time": "20 September, 2022",
                                "context": "Some remaining issues from your time in the service?",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            },
                            {
                                "user_name": "CPO(SW)ret690",
                                "time": "20 September, 2022",
                                "context": "All of the sudden the is an epidemic of sabotage?  And I an not even saying this is that. Having spent time during EDSRA's there is risk for small events to become large as happened in this case.  Apathy and lower moral during these periods is not uncommon at all.  Stay in you lane landlubber",
                                "good": "3",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "wilkinak",
                                        "time": "20 September, 2022",
                                        "context": "He's not wrong about the treatment of the brass.  He is wrong about not looking at other bases - The Major Fire Report showed that no one in the surface fleet was following the shipyard instruction.  I haven't heard about any heads actually rolling over that.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": [
                                            {
                                                "user_name": "CPO(SW)ret690",
                                                "time": "20 September, 2022",
                                                "context": "How was I wrong?  The treatment of \"Brass\" was a result of not adequately taking measures that could have mitigated the loss.  When a ship goes into an SRA or an EDSRA the keys are essentially handed over to the shipyard at some point early in the availability.  Shipyard workers augmented by ships company do a variety of things to this end.  I was a duty section leader for a couple of ships during my career. As such internal rovers were given specific instructions on points to check in addition to the routine security checks, I am talking ships security not Engineering in port watches.  The reason was that in these yard periods numerous automatic detection systems may be tagged out, Critical through holes/stuffing tubes and doors/hatches are removed/blocked or otherwise rendered not secure. \n My initial thoughts when the fire occurred, all from actual experience, was that there was \"Hot Work\" going on and the assigned Fire watch failed to do the job properly.  Also. being that this took place on a weekend when the crew manning was duty section only meant initial response was slow and ineffective. \n Please provide a link to this major fire report you speak of. I would be happy to review and then put it in terms that may help you understand it better.",
                                                "good": "1",
                                                "bad": "0",
                                                "replies": []
                                            }
                                        ]
                                    }
                                ]
                            },
                            {
                                "user_name": "🍊🤡Donald\"IDeclassifedIt\"Trump🍊🤡",
                                "time": "21 September, 2022",
                                "context": "I don't believe SN Mays is in the brig yet.  Innocent until proven guilty.  Non-judicial punishment......",
                                "good": "0",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "drknslr",
                                        "time": "21 September, 2022",
                                        "context": "The red badge he is wearing is for restricted personnel. He is on restriction, awaiting trial. While living in the restriction barracks isn't the brig, it may as well be its ugly cousin as he is restricted to the base and escorted everywhere he goes.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": []
                                    },
                                    {
                                        "user_name": "CPO(SW)ret690",
                                        "time": "21 September, 2022",
                                        "context": "Pictured walking without an MA at his side, wearing red badge. he is on legal hold.  Sort of like a halfway house",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": []
                                    },
                                    {
                                        "user_name": "CPO(SW)ret690",
                                        "time": "21 September, 2022",
                                        "context": "Believe me when I tell you the words might say that but in NJP your guilty until you prove innocence",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "bone_head",
                "time": "20 September, 2022",
                "context": "Plenty said there with no evidence to back it up.  Plenty of officers careers ruined over this also.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "yankeedogg",
                        "time": "20 September, 2022",
                        "context": "USS Iowa explosion",
                        "good": "1",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "bone_head",
                                "time": "21 September, 2022",
                                "context": "something that happened over 20 years ago.",
                                "good": "0",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "yankeedogg",
                                        "time": "21 September, 2022",
                                        "context": "But it happened....",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": []
                                    }
                                ]
                            },
                            {
                                "user_name": "CPO(SW)ret690",
                                "time": "21 September, 2022",
                                "context": "We will never really know what happened in Iowa. I lean toward a Breech over ram of the charge.",
                                "good": "0",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "yankeedogg",
                                        "time": "21 September, 2022",
                                        "context": "Coincidently, my dad retired off of the Iowa about ten months before this happened.  He thought it was an over ram or they were \"experimenting\" again. He did not believe the story of the sailor did it on purpose report...",
                                        "good": "1",
                                        "bad": "0",
                                        "replies": [
                                            {
                                                "user_name": "CPO(SW)ret690",
                                                "time": "21 September, 2022",
                                                "context": "I was an a destroyer that had transited the Panama Canal. Sun was about to set and what do we see?   Iowa under tow heading to LA.  Captain ordered the helm to get a closer look. Perhaps the last time a US battle ship was seen at sea.",
                                                "good": "1",
                                                "bad": "0",
                                                "replies": [
                                                    {
                                                        "user_name": "yankeedogg",
                                                        "time": "21 September, 2022",
                                                        "context": "That had to be when the Iowa was sent to L.A. to become a museum ship. After the explosion she sailed back into Norfolk under her own power.",
                                                        "good": "0",
                                                        "bad": "0",
                                                        "replies": [
                                                            {
                                                                "user_name": "CPO(SW)ret690",
                                                                "time": "21 September, 2022",
                                                                "context": "Yup. Prior to that I saw Mighty Mo and  Wisconsin up in the NAG during desert storm. Those ships just send a chill up you spine when you see them on the horizon.  Later I was part of a project while stationed at Pearl when they parked Mo in front of Arizona. So I got to spend a little time aboard one. Oh, the project?\nThe Movie Pearl Harbor.",
                                                                "good": "0",
                                                                "bad": "0",
                                                                "replies": [
                                                                    {
                                                                        "user_name": "yankeedogg",
                                                                        "time": "21 September, 2022",
                                                                        "context": "They are impressive ships. I was 16, my dad was able to arrange for me to stay on board about five days, Three days at sea for a training exercise. I saw the big guns fire from the bridge deck. They were amazing....",
                                                                        "good": "0",
                                                                        "bad": "0",
                                                                        "replies": [
                                                                            {
                                                                                "user_name": "CPO(SW)ret690",
                                                                                "time": "2 days ago",
                                                                                "context": "Tiger cruise",
                                                                                "good": "0",
                                                                                "bad": "0",
                                                                                "replies": [
                                                                                    {
                                                                                        "user_name": "yankeedogg",
                                                                                        "time": "2 days ago",
                                                                                        "context": "No, it wasn't a traditional Tiger Cruise. As a matter of fact I didn't see any other civilians on the ship except me and I was there five days and four nights. My dad had me bunk in the chief's quarters.  I was a good time.",
                                                                                        "good": "0",
                                                                                        "bad": "0",
                                                                                        "replies": []
                                                                                    }
                                                                                ]
                                                                            }
                                                                        ]
                                                                    }
                                                                ]
                                                            }
                                                        ]
                                                    },
                                                    {
                                                        "user_name": "yankeedogg",
                                                        "time": "21 September, 2022",
                                                        "context": "Battle Ship Texas was just towed to Galveston a few weeks ago. There is some cool video on Youtube.",
                                                        "good": "0",
                                                        "bad": "0",
                                                        "replies": []
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "user_name": "drknslr",
                        "time": "21 September, 2022",
                        "context": "careers ruined does not equate prison time.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "stuii",
                "time": "20 September, 2022",
                "context": "They Do! Look back at the IOWA.......",
                "good": "2",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "🍊🤡Donald\"IDeclassifedIt\"Trump🍊🤡",
                "time": "21 September, 2022",
                "context": "I guess someone didn't read the manual.....\n\n\"Navy leaders disciplined more than 20 senior officers and sailors in connection with what it described as widespread leadership failures that contributed to the disaster. The Navy spread blame across a wide range of ranks and responsibilities and directly faulted the ship’s three top officers.\"",
                "good": "2",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "wilkinak",
                        "time": "21 September, 2022",
                        "context": "Which of those 20 senior officers are looking at the possibility of life in prison?",
                        "good": "4",
                        "bad": "1",
                        "replies": []
                    },
                    {
                        "user_name": "d'artagnan0962",
                        "time": "21 September, 2022",
                        "context": "And yet they still need to wreak vengance on some body so they found an enlised man to  blame.",
                        "good": "2",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "danew",
                "time": "21 September, 2022",
                "context": "Or maybe the Biden Defense Department 'WOKE' a sailor.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "wilkinak",
                        "time": "21 September, 2022",
                        "context": "The Navy & JAG corps have done this for decades, long before they got woke.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "peopleschamp",
        "time": "20 September, 2022",
        "context": "Pat, I would like to solve the puzzle. 🙋",
        "good": "1",
        "bad": "2",
        "replies": [
            {
                "user_name": "🍊🤡Donald\"IDeclassifedIt\"Trump🍊🤡",
                "time": "21 September, 2022",
                "context": "Well are you going to solve it or what?",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "murica572",
        "time": "19 September, 2022",
        "context": "I think it was the sailor who was the witness.",
        "good": "2",
        "bad": "1",
        "replies": [
            {
                "user_name": "ArchenlandKnight",
                "time": "20 September, 2022",
                "context": "An interesting theory.  Certainly plausible given no more information than we were in this article.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "wilkinak",
                        "time": "20 September, 2022",
                        "context": "From what reporting I've seen from those closer to the Navy, they don't  have much more than is presented here.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "ArchenlandKnight",
                                "time": "20 September, 2022",
                                "context": "If that's the case, it would be wrong to have a conviction based on what we've got here.",
                                "good": "0",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "wilkinak",
                                        "time": "20 September, 2022",
                                        "context": "The prevailing opinion is that this is a typical Navy scapegoating exercise.  Judicial malpractice isn't new for the JAG corps.",
                                        "good": "1",
                                        "bad": "0",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "mrtibbs406",
                "time": "20 September, 2022",
                "context": "That is one thing you probably shouldn't do.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "Keep_it_Real444",
        "time": "20 September, 2022",
        "context": "Lithium batteries? Was this an electric ship? Maybe they just forgot to lubricate the windmill bearings.",
        "good": "15",
        "bad": "0",
        "replies": [
            {
                "user_name": "marines4life013",
                "time": "20 September, 2022",
                "context": "That's funny!!",
                "good": "1",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "wilkinak",
                "time": "21 September, 2022",
                "context": "Forklifts most likely.",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "d'artagnan0962",
                "time": "21 September, 2022",
                "context": "Very funny. You don't think they would store spare batteries for all things aboard ship that run on battery power?",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "drknslr",
                "time": "21 September, 2022",
                "context": "The belief is that it *may* have been lithium batteries. The fire report couldn't identify the accelerant used to start the fire. The fire also started in an area storing pallets of tri-walls, or tri ply cardboard boxes used to paletize practically everything brought on or sent off a ship.",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "Lilmsrich1963",
                "time": "1 day ago",
                "context": "🤣🤣🤣",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "Slava_Ukraini",
        "time": "21 September, 2022",
        "context": "I work at Portsmouth Naval Shipyard, where the USS Miami burned due to arson. The story given by the convicted arsonist didn't really make sense. He claimed he wanted to leave early to see his girlfriend, but any one knows, if there was a fire, everyone would be mustered to ensure nobody was lost in the fire. Nobody could leave early then. It still doesn't add up.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "MrIGotNews4U",
        "time": "20 September, 2022",
        "context": "Sounds like pretty shaky evidence...",
        "good": "9",
        "bad": "1",
        "replies": [
            {
                "user_name": "drknslr",
                "time": "21 September, 2022",
                "context": "As much as I don't like the idea of an intentional fire's culprit escaping judgement, they can't even prove it was intentional, and that is a problem.",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "barn",
        "time": "21 September, 2022",
        "context": "Waste of time, if this one sailor could burn an entire aircraft carrier something else is really wrong with the Navy.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "🍊🤡Donald\"IDeclassifedIt\"Trump🍊🤡",
                "time": "21 September, 2022",
                "context": "I think you meant sailor....",
                "good": "1",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "redlindholm",
                "time": "21 September, 2022",
                "context": "Not an aircraft carrier. Try again",
                "good": "1",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "barn",
                        "time": "21 September, 2022",
                        "context": "you are not very bright are you",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "conebred",
        "time": "20 September, 2022",
        "context": "I recall how the Navy tried to pin the Iowa turret explosion on one guy. There's a reason why the Navy's mascot is a scapegoat.",
        "good": "15",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jackedbydems",
        "time": "20 September, 2022",
        "context": "Disabling nearby fire stations and equipment near the onboard fire site fits the unstable mental picture of this suspect in question. Boo-hoo, sniff, sniff, you can't make SEAL training. \nGrow up! I wonder what NCIS found at the loser's onshore residence...? Where is Gibbs?",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "🍊🤡Donald\"IDeclassifedIt\"Trump🍊🤡",
                "time": "21 September, 2022",
                "context": "Gibbs and Very Special Agent Denozo ran away.  It is all up to \"probie!\"",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "ryarios373",
        "time": "20 September, 2022",
        "context": "\"Gary Barthel, a civilian lawyer who represented Mays at a preliminary hearing to determine if there was probable cause to send the case to trial, said the Navy judge overseeing that process recommended the case not go to court-martial. However, Vice Adm. Steve Koehler, the former commander of the San Diego-based U.S. 3rd Fleet, who had the final say, ordered the court-martial.\"\nWhen a Navy judge says don't prosecute but they do anyway, something is probably wrong.  That's going to be a huge sticking point for the prosecution to overcome.  I guess it's a good thing for the military that the jurors are all ranking officers and not your run of the mill jurors...",
        "good": "6",
        "bad": "0",
        "replies": [
            {
                "user_name": "wilkinak",
                "time": "21 September, 2022",
                "context": "This is likely why the kid chose a bench trial and not a jury trial.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "shipmatemcm8",
        "time": "21 September, 2022",
        "context": "I guess they should spend less time gender training and more time battle station training.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cgn-40",
        "time": "21 September, 2022",
        "context": "How about you give them a job, saddle your community with the tax burden they bring, and allow them to live in your home. They broke the law and you want them rewarded for it. You're as big a part of the problem as the illegals",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "PiperFlyer349",
        "time": "20 September, 2022",
        "context": "Turret explosion USS Iowa.  Tried to blame a young sailor for that one as well.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "usmc1985926",
        "time": "20 September, 2022",
        "context": "Military law is different guys. It's covered under the UCMJ. Uniform Code of Military Justice. \nThe defendant has no right to remain silent.  Reasonable doubt is not the same as state or federal law. Regardless of his guilt or innocence the careers of the the entire command staff and senior NCO's are finished. Its a different world in the military.",
        "good": "5",
        "bad": "1",
        "replies": [
            {
                "user_name": "barn",
                "time": "21 September, 2022",
                "context": "you always have the right to remain silent.",
                "good": "3",
                "bad": "1",
                "replies": []
            },
            {
                "user_name": "redlindholm",
                "time": "21 September, 2022",
                "context": "Exactly. People that have never been in the military do not understand what you are saying. It's a whole different set of laws and punishments  that absolutely don't exists in the civilian side",
                "good": "0",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "drknslr",
                        "time": "21 September, 2022",
                        "context": "You absolutely have a right to remain silent AND request court martial. At that point, NJP is meaningless and the burden of proof is on the investigators as a normal judicial process.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "ironranger281",
                "time": "21 September, 2022",
                "context": "Bud ... Defendants have the right to remain silent ...  \nThe UCMJ does not over rule the bill of rights ...",
                "good": "3",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "danew",
                "time": "21 September, 2022",
                "context": "Not to mention a thousand more 'crimes' - 'Unbecoming Conduct' - I remember a career Air Force Staff Sergeant (1962) lost a stripe (Article 15) because his wife bounced a $3 check for gas. Check stub math error? Immediately repaid,,, Didn't matter! That was the day I decided against an Air Force career.",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "Lilmsrich1963",
                "time": "1 day ago",
                "context": "It most certainly is different",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "ironranger281",
        "time": "21 September, 2022",
        "context": "Said it once i will say it again .. \n\nMilitary Court Martials have to be taken away from the Military !",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "redlindholm",
        "time": "21 September, 2022",
        "context": "Sham trial",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "antihotair054",
        "time": "20 September, 2022",
        "context": "Navy brass using Mays as a convenient scapegoat for the consequences of something which ultimately was their responsibility - Admirals, etc. don't want to have their pay and pensions docked to help pay for the cost of the ship?",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "conebred",
        "time": "20 September, 2022",
        "context": "The ship is being scrapped not scuttled. Words have meaning, choose them wisely.",
        "good": "16",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "nevoigt",
        "time": "20 September, 2022",
        "context": "I spent four years in deck department on LHD-3, a Wasp class just like the B. Richards and from what I can read between the lines, I wouldn't doubt at all that the navy will try to make him a scape goat with no evidence. \nI have seen too many junior enlisted punished for little or zero reason. The navy tends to eat its' own unfortunately.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "usmc1811m48m60",
        "time": "20 September, 2022",
        "context": "Yep, a LIBBY...",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ryarios373",
        "time": "20 September, 2022",
        "context": "If guilty, is high treason still punishable by death?...",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "Hamiltonblue",
                "time": "20 September, 2022",
                "context": "Probably not. Otherwise half of the Dem politicians would no longer be alive.",
                "good": "2",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "jackedbydems",
                        "time": "20 September, 2022",
                        "context": "Thinking the same.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "🍊🤡Donald\"IDeclassifedIt\"Trump🍊🤡",
                                "time": "21 September, 2022",
                                "context": "Lemming.",
                                "good": "0",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "ryarios373",
                                        "time": "21 September, 2022",
                                        "context": "Wow.  Pot, meet kettle.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "user_name": "🍊🤡Donald\"IDeclassifedIt\"Trump🍊🤡",
                        "time": "21 September, 2022",
                        "context": "Only in a time of war and if they were currently serving.  Man you Cons just don't know anything do you?",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "Hamiltonblue",
                                "time": "21 September, 2022",
                                "context": "Wow. Finally a leftist that admits that the Dems are committing treason.  Your only defense is that it isn't a time of war so it's ok?",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "🍊🤡Donald\"IDeclassifedIt\"Trump🍊🤡",
                "time": "21 September, 2022",
                "context": "Only during war time.  Read your NJP manual.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "yankeedogg",
        "time": "20 September, 2022",
        "context": "Jethro Gibbs from NCIS would have solved this in one episode....",
        "good": "9",
        "bad": "0",
        "replies": [
            {
                "user_name": "🍊🤡Donald\"IDeclassifedIt\"Trump🍊🤡",
                "time": "21 September, 2022",
                "context": "No....he ran away! It would now be \"probie!\"",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "yankeedogg",
                        "time": "21 September, 2022",
                        "context": "Oh... he's not on the show anymore? I stopped watching a few years ago.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "klnkat",
        "time": "20 September, 2022",
        "context": "If he did do it, he deserves life without parole!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "chiefsbrat",
        "time": "20 September, 2022",
        "context": "Can't believe they are going forward on charges with nothing more than someone is pretty sure they saw him in an area and he is upset having failed BUDS selection. The number of people that have washed out of that program would leave hundreds of suspects. \nHow did they get past an Article 32 hearing with a case that weak?",
        "good": "12",
        "bad": "1",
        "replies": [
            {
                "user_name": "mrtibbs406",
                "time": "20 September, 2022",
                "context": "But how many BUDs drop outs were on that particular ship?",
                "good": "1",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "chiefsbrat",
                        "time": "20 September, 2022",
                        "context": "They probably had a handful. The Navy has done a huge production of recruiting using the SEALS and fill a lot of jobs no one will enlist for with people cut from selection.",
                        "good": "2",
                        "bad": "1",
                        "replies": [
                            {
                                "user_name": "mrtibbs406",
                                "time": "20 September, 2022",
                                "context": "Pure supposition on your part.  \"Probably\" doesn't add much to your position.",
                                "good": "0",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "chiefsbrat",
                                        "time": "1 day ago",
                                        "context": "Outside of knowing the drop rate for BUDS, knowing that the Navy recruiting command pushes the SW fields heavily, and knowing people in the Navy at various levels- classmates and their kids.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": []
                                    }
                                ]
                            },
                            {
                                "user_name": "CPO(SW)ret690",
                                "time": "20 September, 2022",
                                "context": "Not how it works. But there is a risk when you sign a contract of service.",
                                "good": "1",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "chiefsbrat",
                                        "time": "21 September, 2022",
                                        "context": "Okay Chief, what are they doing with the sailors that go in trying for SW, and don't make the cut?",
                                        "good": "1",
                                        "bad": "0",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "kingofpop",
                "time": "21 September, 2022",
                "context": "He's a Quitter. That's good enough for me. Lock him up.",
                "good": "1",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "wilkinak",
                "time": "21 September, 2022",
                "context": "Did they even see him?  One sailor in coveralls, a ball cap & face mask looks a lot like another sailor in coveralls, a ball cap and a face mask.",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "patriotbiker016",
        "time": "20 September, 2022",
        "context": "I think the sailor started the fire. I also think he is probably a democrat. I don't need proof because this is the Fox News comment section.",
        "good": "2",
        "bad": "2",
        "replies": [
            {
                "user_name": "inthefields",
                "time": "20 September, 2022",
                "context": "Using the democrat \"guilty by accusation\" legal technique we see.",
                "good": "2",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "patriotbiker016",
                        "time": "20 September, 2022",
                        "context": "yes. seems legitimate here",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "endymio",
                "time": "20 September, 2022",
                "context": "Always hilarious to see a Leftist pretending to be a patriot...",
                "good": "3",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "mojavegreenn",
        "time": "20 September, 2022",
        "context": "The military's does love their scape goats. If they can fault blame on someone for their screwup, they will do it in a hot second.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mrtibbs406",
        "time": "20 September, 2022",
        "context": "I see the patch on his left arm but don't recognize it.  Any active Navy who can fill me in?",
        "good": "2",
        "bad": "0",
        "replies": [
            {
                "user_name": "nevoigt",
                "time": "20 September, 2022",
                "context": "undesignated E-1 seaman recruit. he's the lowest on the totem pole and an easy target.",
                "good": "6",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "mrtibbs406",
                        "time": "20 September, 2022",
                        "context": "Thanks.  When I was in the Navy, A seaman recruit was a two stripper.",
                        "good": "1",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "nevoigt",
                                "time": "20 September, 2022",
                                "context": "that's a seaman apprentice today and a seaman E-3 is three stripes.",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            },
                            {
                                "user_name": "barn",
                                "time": "21 September, 2022",
                                "context": "recruit had one, seaman duce had 2, seaman had 3",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "user_name": "🍊🤡Donald\"IDeclassifedIt\"Trump🍊🤡",
                        "time": "21 September, 2022",
                        "context": "Which is why he is in Deck Division!  Probably hates it there so he in a pyro rage started the fire.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "nevoigt",
                                "time": "21 September, 2022",
                                "context": "everyone hates deck department. There would be like 60 suspects according to that reasoning alone.",
                                "good": "1",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "barn",
        "time": "21 September, 2022",
        "context": "this kid is going to Hollywood",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "PetetheAussie432",
        "time": "2 days ago",
        "context": "Considering there are more and more lithium battery fires being reported starting spontaneously in a growing number of instances and EV's are becoming a great concern with this, so it is surely not impossible that if there were lithium batteries involved in this fire and they weren't stored safely in the ship, with their known propensity to burst into flames and once that happens, it can be almost impossible to extinguish the fire, who was responsible for the correct stowage of batteries, lithium or not? Was it this sailor?\nIt will be interesting to see the final outcome becasue during my naval service, admittedly not in the USN, I saw first hand how senior navy officers, to protect lax Government/Navy decisions, will turn attention on the easiest targets and sadly, that target is always, or most often, seems to be junior sailors.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "hartnavy",
        "time": "21 September, 2022",
        "context": "Ship's company is 1200 Sailors, why where there 115 Sailors onboard?  There should have been at least 250 in four-section duty, counting those on leave or TAD.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "wilkinak",
                "time": "21 September, 2022",
                "context": "COVID",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "flightrisk",
                "time": "2 days ago",
                "context": "Overhaul. There was no duty section. It was out of commission.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "minus8pialpha",
        "time": "2 days ago",
        "context": "I am a Navy vet, but I do not recognize the insignia this young man is wearing on his left upper arm ... anybody enlighten me?",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "wdrumm56401",
                "time": "1 day ago",
                "context": "Boson mate posable. In the 70s I was on a ship with a warrant officer Boson with a similar insignia of an anchor similar to that, but things have changed so much it's hard to say. Also his problem he caught deck watch and that was done by Boson mates.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "ilikecottagecheese",
        "time": "21 September, 2022",
        "context": "Lithium batteries caught on fire and burned for days.  Ah, this sounds familiar.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sotiredofsnowflakes!",
        "time": "2 days ago",
        "context": "I get requests to do business in the Caribbean annually and when I tell them that we demand payment in advance, the conversation ends.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "wdrumm56401",
        "time": "1 day ago",
        "context": "Join the Navy, cause it's an adventure. From bow to stern.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "navypatriot20!",
        "time": "2 days ago",
        "context": "As much as I hate to say this, if there is no physical evidence and the prosecution is relying on the testimony of someone that have changed their story several times, then this so called former Admiral should have no say in it at all!  If a Judge says that the case shouldn't go to courts-martial, then why is some flipping former admiral allowing it?  That's the real question that needs to be asked and answered.  Why is that admiral forcing the issue?  What does he know that needs to be covered up?  All questions that need to be asked on a news forum directly to the former admiral!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "d'artagnan0962",
        "time": "21 September, 2022",
        "context": "What happened to the captain being responsible for what happens aboard his ship? It seems clear that that there was a series of problems that contributed to the catastrophic fire aboard the Bonhome Richard. Navy safety rules are designed to eliminate conditions that can start fires while fire suppression and damage control training is supposed to let crews deal with them quickly before they can get out of control. I wouldn't trust that captain, or his executive officer, with a rowboat.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "DBassman2000",
                "time": "2 days ago",
                "context": "This is 2022 you don't take responsibility anymore you ether hide in your basement and say nothing or just blame someone else.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "LastFirst",
        "time": "21 September, 2022",
        "context": "If this is the state of todays navy damage control expect a lot of sunken US ships when China invades Taiwan. When I was in we had it drilled into our heads repeatedly.",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "flightrisk",
                "time": "2 days ago",
                "context": "It was in overhaul. Didn't even have a full duty section on board. Mostly civilians were on it.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "shipmatemcm8",
        "time": "21 September, 2022",
        "context": "Drink to the foam shipmate.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "anindependentthoughtagain",
        "time": "2 days ago",
        "context": "It’s time to stand tall before the man swabbie",
        "good": "0",
        "bad": "0",
        "replies": []
    }
]