[
    {
        "user_name": "megaprogrammer",
        "time": "2 May, 2022",
        "context": "It would be interesting to know what substance this process result in.\n\"Yay, we got rid of 400 million tons of plastic.\nUmmm, what do we do with 40 millions gallons of toxic sludge?\"\n\nStill.  Hoping this one works!",
        "good": "10",
        "bad": "0",
        "replies": [
            {
                "user_name": "rubiks6",
                "time": "2 May, 2022",
                "context": "“… 40 millions gallons [trillions of tons] of toxic sludge“\n\nJust what I was thinking.",
                "good": "1",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "lycopine",
                        "time": "3 May, 2022",
                        "context": "maybe your god will solve the problem, look for writing in the clouds...",
                        "good": "0",
                        "bad": "3",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "black-wives-fatter",
                "time": "2 May, 2022",
                "context": "That's what New Jersey is for.  Send it there.",
                "good": "7",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "megaprogrammer",
                        "time": "3 May, 2022",
                        "context": "New Jersey is already pretty full.\nPlenty of room in California.\n\nMaybe create a moat between us and Mexico and fill it with the stuff.",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "101stParatrooper",
                "time": "2 May, 2022",
                "context": "What do we do with it?  Load up 1million illegals, each with a 40-pound backpack, and march them back across the Southern border.",
                "good": "3",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "bftsplk81",
        "time": "2 May, 2022",
        "context": "Yeah, it's all fun and games until the enzymes start eating the plastic in your Tesla or the plastic stuff in nuclear power plants or the plastic in Maxine's wig hat. Or the make up caked on AOC's pony face or the rag on Ilhan's head. Careful what you wish for.",
        "good": "8",
        "bad": "1",
        "replies": [
            {
                "user_name": "another_nc_guy156",
                "time": "2 May, 2022",
                "context": "There was a Rand Corporation study in the early 1990s of what could happen if buggies developed an appetite for the rubber used in laboratory gaskets and door seals at the National Center for Toxicological Research.",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "moderationisthekey",
        "time": "2 May, 2022",
        "context": "If it actually works, this group is about to make a lot of money.",
        "good": "4",
        "bad": "0",
        "replies": [
            {
                "user_name": "cleanundies",
                "time": "10 May, 2022",
                "context": "Not unless Biden hands it to them. There is no market for this - it's just a good idea right now.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "humpty..dumpty",
        "time": "2 May, 2022",
        "context": "Great, once this is released into the environment even plastic will rust away",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "vernacularcause",
        "time": "2 May, 2022",
        "context": "Also sounds like a great biological weapon to take out power and communication grids....",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "masterdodsen",
        "time": "2 May, 2022",
        "context": "This is nice.  That'll definitely help the garbage situation out.",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "grasshoppa'",
                "time": "2 May, 2022",
                "context": "Not the garbage situation in the Capitol.",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "lance716",
        "time": "2 May, 2022",
        "context": "Well, since this is only the sixth enzyme or bacteria created to 'eat plastic', hopefully this one can work well enough to actually do the job. It's already clear that those 'green treehuggers' are going to keep ignoring the giant continent-sized 'plastic trash gyres' in the oceans, until someone hands them the answer and makes fun of them not using just a LITTLE BIT of that vast liberal money they have, IMPLEMENTING IT!\nWell worth the time to ask them, the next time they want to preach 'green', why they haven't put one ounce of effort into cleaning up the oceans...like they do steaming up 'hot microphones' any chance they have!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "gymschuuz",
        "time": "2 May, 2022",
        "context": "This would be at least the third known enzyme that breaks down PET plastics.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jeffhere",
        "time": "2 May, 2022",
        "context": "i knew this could eventually happen and someone will make big bucks on it.\n\nnow we need a creation to fix the mental illness called \"dems\".",
        "good": "10",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "hairygoat",
        "time": "2 May, 2022",
        "context": "Any downsides?",
        "good": "2",
        "bad": "0",
        "replies": [
            {
                "user_name": "gymschuuz",
                "time": "2 May, 2022",
                "context": "Yes, global warming is a byproduct.  The process by which enzymes break down waste, whether artificial or organic, gives off plenty of heat energy.\n\nIf it were up to me, I would just burn it and release as much carbon-based gas into the atmosphere as possible and use the heat generated from that to run electricity-generating turbines.  There is less heat retained at ground level from greenhouse gases than is generated by enzymatic digestion at the levels needed to eliminate all the plastic waste presently out there.  Plus, carbon gases eventually all fall back to earth due to their weight, where they turn back into other organics, like fossil fuels.",
                "good": "2",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "hairygoat",
                        "time": "2 May, 2022",
                        "context": "Thank you.",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "foxgood",
        "time": "2 May, 2022",
        "context": "Don't get the Kardashian's anywhere near that stuff .",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "SEWI68",
        "time": "2 May, 2022",
        "context": "Don't let that loose in Hollywood! Think of all the carnage.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "yankeedogg",
        "time": "2 May, 2022",
        "context": "If this works, it could be a game changer.\nOn the other hand, it could back fire and unleash zombies on us...",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "papacap",
        "time": "3 May, 2022",
        "context": "Anything that can be used for the \"better good\" can also be used against us.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "lynntx",
        "time": "3 May, 2022",
        "context": "The information about cigarette butts is something I would never have thought about.  I'm glad I quit decades ago.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "northseatiger",
        "time": "2 May, 2022",
        "context": "So, if you are on a plane and the seats start to disintegrate, should you be concerned..........?",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "abraham12",
        "time": "2 May, 2022",
        "context": "\"a natural enzyme called PETase that allows bacteria to degrade PET plastics.\"\nHELP.  Somebody sprayed PETase on and in my car and the whole thing is falling apart.  I left my computer in there and the plastic is dissolving.  Everything in the car is coming apart, the whole dashboard.  HELP!",
        "good": "2",
        "bad": "0",
        "replies": [
            {
                "user_name": "lynntx",
                "time": "2 May, 2022",
                "context": "A new terrorist tool?",
                "good": "1",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "WendelRichards",
                "time": "3 May, 2022",
                "context": "Reminds me of \"The Andromeda Strain\" scene where the pilot radios his oxygen mask is dissolving!",
                "good": "3",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "86Z28",
        "time": "2 May, 2022",
        "context": "Just throw some BBQ sauce all over it, and let Stacy Abrams loose...",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "nitro_u-235",
        "time": "2 May, 2022",
        "context": "I'm all for a better way to keep the environment cleaner, but what are the by products that these enzymes produce? How are they applied and can they have a negative effect on plastics we don't want to break down?",
        "good": "17",
        "bad": "0",
        "replies": [
            {
                "user_name": "calrep21",
                "time": "2 May, 2022",
                "context": "The same can be said for by-products of electric car batteries.  What negative effects will be produced with millions of expired batteries on the environment?",
                "good": "13",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "phyton",
                "time": "2 May, 2022",
                "context": "Think about it....What is PET? You should learn what it is made of, then you can discern what it will turn into once the enzyme does its job. Maybe then you won't be so \"chicken-little\".",
                "good": "0",
                "bad": "5",
                "replies": [
                    {
                        "user_name": "vet1260",
                        "time": "3 May, 2022",
                        "context": "I think they were simply asking a question as part of the comments to this story. Kind of like thinking out loud. Don't be so \"paranoid\".",
                        "good": "2",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "phyton",
                                "time": "4 May, 2022",
                                "context": "I wasn't responding to a \"they\". I was responding to one individual, a nitro isotope, who seemed to be of the \"paranoid\" type that you mentioned. I'm not the paranoid one in this thread.",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "Brylcream_Boomer",
                "time": "3 May, 2022",
                "context": "Seems to me that the enzymes eat plastic which is a derivative of petroleum, so would these critters be able to eat oil too?\n\nMakes a heck of an economic weapon if you destroyed somebody's oil reserves.",
                "good": "6",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "nwmalamo",
                        "time": "18 May, 2022",
                        "context": "It would probably be a very short jump/mutation that would allow this enzyme to attack and degrade oil.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "bentarmbarpracticioner",
                "time": "5 May, 2022",
                "context": "It's the same enzyme they put in the Covid vaccine. Everyone make sure to get triple vaxxed and quadruple boosted! The microplastics in  your blood-stream won't have a chance! All this upside, and zero negative health consequences, according to Lord Fauci.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "foxgood",
        "time": "2 May, 2022",
        "context": "Sounds like the making of a good Science Fiction movie , The Blob Two Global meltdown .",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jeffhere",
        "time": "2 May, 2022",
        "context": "exactly, we all knew this would happen.\n\nwait a few more years and someone will invent \"oil eating\" technology for spills, air scrubbing to cleanse the air, etc.\n\nwe don't need more regulations, we need less for the inventors and manufacturers to create and build it.\n\ninvention and technology.",
        "good": "7",
        "bad": "0",
        "replies": [
            {
                "user_name": "abraham12",
                "time": "2 May, 2022",
                "context": "There is already an \"oil eating bacteria\" that has been used to help clean up ocean spills.",
                "good": "6",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "quietsmith",
                "time": "3 May, 2022",
                "context": "The problem with air scrubbing, it already exists, is that current technology just can't support it. You take a pound of CO2 out, but the energy you use produces a pound and a half.",
                "good": "3",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "wakeupamerica!194",
                        "time": "3 May, 2022",
                        "context": "We already have organic CO2 scrubbers all around us. We just need a lot more.",
                        "good": "2",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "quietsmith",
                                "time": "3 May, 2022",
                                "context": "We can't plant that many trees.",
                                "good": "1",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "wakeupamerica!194",
                                        "time": "3 May, 2022",
                                        "context": "It's not really just about trees. Give \" “Global mycorrhizal plant distribution linked to terrestrial carbon stocks” a read. It's pretty interesting.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": [
                                            {
                                                "user_name": "quietsmith",
                                                "time": "3 May, 2022",
                                                "context": "There does not currently exist a viable solution to remove CO2 from the air, I'm aware of the thing you're talking about. \n\nAll current solutions are either taking a garden hose to a forest fire or produce more than they consume, pesky conservation of energy and all that, but maybe technology will improve.",
                                                "good": "0",
                                                "bad": "0",
                                                "replies": []
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "user_name": "Brylcream_Boomer",
                        "time": "3 May, 2022",
                        "context": "PLANT TREES",
                        "good": "2",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "quietsmith",
                                "time": "3 May, 2022",
                                "context": "In much the same way that taking your garden hose to a forest fire might seem like a solution when it isn't.",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "user_name": "gideon425",
                        "time": "5 May, 2022",
                        "context": "Simple longer term solution, plant more tree's.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "quietsmith",
                                "time": "5 May, 2022",
                                "context": "You can't plant that many trees.",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "profilepicsofthedead",
                "time": "3 May, 2022",
                "context": "There are already microbes that eat oil in nature. I read about them quite a bit after the Deep horizon leak, not much since.  I obviously have no way of knowing how common or how much they can eat.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "🇺🇸rangeduster",
        "time": "2 May, 2022",
        "context": "generate mutations to a natural enzyme called PETase that allows bacteria to degrade PET plastics.\n\nThe university stated, that the only problem now, is the researchers are missing without a trace.",
        "good": "10",
        "bad": "0",
        "replies": [
            {
                "user_name": "LostLenore",
                "time": "2 May, 2022",
                "context": "Lol",
                "good": "2",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "biglou15",
        "time": "2 May, 2022",
        "context": "Does it work on progressives?",
        "good": "4",
        "bad": "0",
        "replies": [
            {
                "user_name": "lycopine",
                "time": "3 May, 2022",
                "context": "no, only CANCER-vatives. It's dual use to rid the world of toxic pollution...",
                "good": "0",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "nonotrush",
        "time": "2 May, 2022",
        "context": "There are NO ISLANDS in anything. Once created, it will spread. How good, or how bad that is for humankind is going to be the question that needs to be answered before most any world changing event takes place. You see, this is way we have a problem with plastic... It was invented by man to serve man. It does, but at what costs?",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "commonsensewhereareyou?",
        "time": "2 May, 2022",
        "context": "And what happens after that if it's still hungry? Hope I'm not on a plane....",
        "good": "5",
        "bad": "0",
        "replies": [
            {
                "user_name": "GoldCandy",
                "time": "2 May, 2022",
                "context": "Or a cruise ship.",
                "good": "3",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "ar_mike340",
                "time": "5 May, 2022",
                "context": "it is not a living thing your thinking is lilke what happens if the vacuum cleaner is still hungry after sweeping the carpet",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "commonsensewhereareyou?",
                        "time": "5 May, 2022",
                        "context": "no... my thinking is,  what tells it that this is a piece of \"bad plastic\" go ahead and eat it... but this is a piece of \"good plastic\" that it's not supposed to deconstruct this.... how does it know?\n...let the cat out of the bag and it's hard to get it back in....",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "unclefess923",
        "time": "2 May, 2022",
        "context": "I am apprehensive about releasing this enzyme into the 'wild'. There is a book about an oil eating microbe, designed to clean oil spills, that finds its way into the oil pockets in the earth and destroys petroleum worldwide.\nWhat if this enzyme found it's way into our homes and ate all the plumbing and insulation from wiring. This is scary stuff.",
        "good": "5",
        "bad": "0",
        "replies": [
            {
                "user_name": "mtwallet526",
                "time": "3 May, 2022",
                "context": "Want a hanky ? Get over it. Life is not fair or equal. Besides, it saves your yard from being the next dump site.",
                "good": "0",
                "bad": "2",
                "replies": []
            },
            {
                "user_name": "profilepicsofthedead",
                "time": "3 May, 2022",
                "context": "The oil eating microbe already exists in nature, man didn't need to create it.",
                "good": "1",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "cleanundies",
                "time": "10 May, 2022",
                "context": "Perfect example of believing something without a clue about the science behind it.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "sjmaus",
        "time": "2 May, 2022",
        "context": "spray it over california from crop dusters. lets see how it works on plastic people.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "101stParatrooper",
        "time": "2 May, 2022",
        "context": "Isn't science and technology wonderful?  The Dem Socialists should try it sometime.",
        "good": "2",
        "bad": "0",
        "replies": [
            {
                "user_name": "lycopine",
                "time": "3 May, 2022",
                "context": "so should the sky faery believing CANCEr-vatives, where the Earth is 6000 years old and biblical creationism is REAL science fit for public education..",
                "good": "0",
                "bad": "2",
                "replies": [
                    {
                        "user_name": "quietsmith",
                        "time": "3 May, 2022",
                        "context": "I had somebody suggest that fossils can \"mutate\" in another thread.",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "wisegranny",
        "time": "2 May, 2022",
        "context": "Well...hopefully this works, but humans don't 'create' these things, they discover and manipulate though. There is also a 'critter' that apparently eats oil in the oceans as well. We have yet to uncover all of God's creations, like what will cure cancer.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "MarkBinder716",
        "time": "2 May, 2022",
        "context": "I am a responsible liberal who believes in recycling plastic, so it can be put on a barge, transported to China, then dumped into the ocean.",
        "good": "11",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "stevywonder690",
        "time": "2 May, 2022",
        "context": "5 years later they find that the microbes also don't stop at garbage and eat small kids too.",
        "good": "5",
        "bad": "0",
        "replies": [
            {
                "user_name": "unclefess923",
                "time": "2 May, 2022",
                "context": "I was thinking plumbing and wire insulation.",
                "good": "2",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "rattle924",
        "time": "2 May, 2022",
        "context": "Can I use straws in my soda again?",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mrmacktitties",
        "time": "2 May, 2022",
        "context": "cant turn plastic into gas????",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "EnglishAmerican",
        "time": "2 May, 2022",
        "context": "Plastic pollution Worries me more than climate change",
        "good": "11",
        "bad": "1",
        "replies": [
            {
                "user_name": "hobbznme",
                "time": "2 May, 2022",
                "context": "All you need to do is find the right beach in some of the tropical paradises to see how bad the situation is.",
                "good": "2",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "jsmith338",
        "time": "2 May, 2022",
        "context": "Releasing a lab-created enzyme into the environment...\n\nNOTHING CAN GO WRONG THERE!!!!!!!!!!!!",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Feb14,1859",
        "time": "3 May, 2022",
        "context": "This stuff will get out into the wild and all the plastic people will cease to exist... I like it.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "randy4usa",
        "time": "3 May, 2022",
        "context": "I sense a new disaster movie in the works.",
        "good": "3",
        "bad": "0",
        "replies": [
            {
                "user_name": "robert338",
                "time": "3 May, 2022",
                "context": "\"The enzyme that muted and destroyed all plastics.\"",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "history53",
        "time": "3 May, 2022",
        "context": "Sounds good but then how do you get rid of the enzymes?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jvgman216",
        "time": "3 May, 2022",
        "context": "I thought curbside recycling was going to eliminate this problem?",
        "good": "2",
        "bad": "0",
        "replies": [
            {
                "user_name": "ryarios373",
                "time": "3 May, 2022",
                "context": "No.  It just made it so it now takes two separate trucks to take your garbage to the landfill...",
                "good": "4",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "display_name",
                        "time": "3 May, 2022",
                        "context": "liberal job creation.",
                        "good": "2",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "ryarios373",
                                "time": "3 May, 2022",
                                "context": "While municipalities have gotten better, I remember a news story where they were showing the recycling trucks coming into the landfill and unloading in the same pile as the garbage trucks were.  No recycling was being done.  The story upset a lot of residents since they had to pay an increase in garbage collection for 'recycling' that wasn't being done.",
                                "good": "1",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "lycopine",
                                        "time": "3 May, 2022",
                                        "context": "obviously the \"news\" story missed the part where the recycle truck loads were first sorted with UNrecycables reloaded and sent to the dump. And you missed it too...",
                                        "good": "1",
                                        "bad": "0",
                                        "replies": [
                                            {
                                                "user_name": "jvgman216",
                                                "time": "4 May, 2022",
                                                "context": "It's not likely YOU were standing there when the R/C trucks were 'reloaded.' The problem your retort faces is that there's an exceptionally limited market for R/C glass and plastics. R/C collections of those materials far exceeds the market for their re-use in other products. All over the country loads of plastic and glass go directly into disposal because there's NO market for them. But, no worry. Taxpayers pay 'put-or-pay' service fees for a service that continues to be pointless to anyone (and to the environment) if they're not making $$ from providing the service.",
                                                "good": "0",
                                                "bad": "0",
                                                "replies": [
                                                    {
                                                        "user_name": "lycopine",
                                                        "time": "4 May, 2022",
                                                        "context": "the problem with your retort is that generalizations aren't facts.\nThe REAL and primary issue with home recycling is the consumers do such a poor job of sorting, tossing non recyclables with recyclable and causing contamination at the sort facility. It is widely known that plastic recycling is miniscule, so the first principle, ignored by a consumer society and industry, is to REDUCE and REUSE. But why do that when the cost of doing such can be socialized. Glass and metal do indeed have decent markets, it is plastics that are the worst, though there are some programs, like Ridwell, that are making a difference locally and companies like Driscolls taking back their plastic clamshells for reuse.\nTaxpayers and all of humanity pay one way or the other. The underlying issue is economic. Everyone on Earth is free to pollute the air, land and ocean foisting the cost to the planet.\nThe true cost of any human activity rarely includes the cost of waste as externalizing that cost increases the profit.",
                                                        "good": "0",
                                                        "bad": "0",
                                                        "replies": [
                                                            {
                                                                "user_name": "jvgman216",
                                                                "time": "7 May, 2022",
                                                                "context": "And so, Lycopine, you complain that \"generalizations aren't facts\" and then proceed to generalize using unsupported claims blaming the public's selection of alternative processes. The reason \"plastic recycling is miniscule\" is that the cost of recycling plastic waste (and some other commonly collected materials) for use in many products is as high, or greater, than producing new plastics for them. Please don't try to re-hash \"Tragedy of the Commons\" for me. The underlying reason R/C hasn't made substantial gains over its status quo in the ~40years its been institutionalized is it's NEVER paid for itself (as was advertised it would when the policies were adopted). Without major waste haulers benefitting from 'put-or-pay' fees for collection & sorting (taking BILLIONS out of the pockets of the public; who NEVER benefit from their purchase of the service) only the materials that had well developed markets for them back before R/C's start-up would be getting collected. The entire R/C policy is effectively a social cult activity that continues because it makes $$$ for the major waste haulers who effect the policy.",
                                                                "good": "0",
                                                                "bad": "0",
                                                                "replies": []
                                                            }
                                                        ]
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            },
                            {
                                "user_name": "lycopine",
                                "time": "3 May, 2022",
                                "context": "while CANCER-vative job creation is to dump all toxic waste in the ocean at the lowest possible cost to maximize profits and socialize expenses...",
                                "good": "0",
                                "bad": "1",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "user_name": "SpiritOfAmerica961",
                        "time": "3 May, 2022",
                        "context": "A city I used to live in started a 3 bin recycling program.  All 3 were picked up at the same time with the same truck.  No telling what that cost the taxpayers.",
                        "good": "1",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "ryarios373",
                                "time": "3 May, 2022",
                                "context": "Mines easy now.  You put your recyclables in blue plastic bags and throw them in with your regular trash.  The only extra is the city giving away trash bags. \nBut I used to live in a city where you put your trash and recyclables at the curb at the same time and two different trucks came by to pick them up.",
                                "good": "1",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "lookyloo",
        "time": "3 May, 2022",
        "context": "So what happens when it reaches the water table? Does it give off toxic gases as the plastic is dissolved? What happens if it enters our water supply to people that have had plastics surgically placed in their bodies?",
        "good": "2",
        "bad": "0",
        "replies": [
            {
                "user_name": "gideon425",
                "time": "5 May, 2022",
                "context": "What happens if that mutation they created, to eat plastics, evolves into a airborne mutation?\n\nSo it starts to also eat everything else that's oil based. \n\nCar tires. The rubber on electrical wires, from town to town. There goes the energy grid. \nHow many computers use plastics? I know motherboards do, so that will all go poof. There goes your cellphones too. They will literally fall apart. Washing machines do. Dryers do. There goes all your credit / debit cards. Every plastic container at drug stores, for pills, soaps, creams, even make up, gone. Security systems use plastic as well. We will effectively be back in the stone age. There won't be any supply chains. There won't be any energy except fire and maybe steam.\n\nWon't be any nukes either, or most conventional weapons. Say good bye to everything conventional. Basically every vehicle ever created won't ever drive again.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "mark0563",
        "time": "3 May, 2022",
        "context": "What are we going to have to create to eat the plastic-eating enzyme when its effects become deleterious?",
        "good": "4",
        "bad": "0",
        "replies": [
            {
                "user_name": "ryarios373",
                "time": "3 May, 2022",
                "context": "Just tell people it's good eating...",
                "good": "1",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "quietbear_001",
                        "time": "3 May, 2022",
                        "context": "Better than Soylent Green?",
                        "good": "1",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "ryarios373",
                                "time": "3 May, 2022",
                                "context": "Spicier...",
                                "good": "1",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "quietbear_001",
                                        "time": "3 May, 2022",
                                        "context": "🤣🤣🤣🤣🤣",
                                        "good": "1",
                                        "bad": "0",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "lookyloo",
                "time": "3 May, 2022",
                "context": "Fauci is already working on it overseas I’m sure.",
                "good": "3",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "theeagerbeaver418",
        "time": "3 May, 2022",
        "context": "If it was created with the assistance of a government grant, the patent should be a free use patent for the entire nation.  The only reason for the patent at that point would be to prevent anyone else from patenting the same enzyme.  I am so tired of our tax dollars funding research only to have the team which performed that research then charge tax payers for the results of that research.  If you're going to get mad at drug companies for using government grants to discover drugs, and then charge the public to use those drugs, you damned well better be mad at academics who do the same thing at universities.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dbforever",
        "time": "3 May, 2022",
        "context": "I can only imagine what would happen if that enzyme got on one of the Kardashians or Pelosi.",
        "good": "3",
        "bad": "0",
        "replies": [
            {
                "user_name": "robert338",
                "time": "3 May, 2022",
                "context": "Their rear ends and their faces would become unrecognizable.",
                "good": "4",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "ryarios373",
                "time": "3 May, 2022",
                "context": "Nothing bad...",
                "good": "2",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "amaddog",
        "time": "3 May, 2022",
        "context": "And in a few years they'll be wondering about the toxic waste left behind by the enzymes.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "robert338",
        "time": "3 May, 2022",
        "context": "Gee nothing bad could happen from re-engineering an enzyme, could it? If released, structures that have plastic as a weather barrier to the steel or concrete could be wasted away, weakening the structures. Rubber on tires could also be eaten by these enzymes after they are let loose by mistake and evolve to eat the rubber on tires and other things.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "theoldfart",
        "time": "3 May, 2022",
        "context": "Aren't Tesla batteries enclosed in plastic.",
        "good": "2",
        "bad": "0",
        "replies": [
            {
                "user_name": "1971c10",
                "time": "3 May, 2022",
                "context": "Most cars are too.",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "thomaswinslow009",
        "time": "3 May, 2022",
        "context": "Now we need a liberal eating enzyme to further clean up America!",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "commoncents69",
        "time": "3 May, 2022",
        "context": "Guess what else UNEP said in 2005 - \nUNEP warned that imminent sea-level rises in the Pacific Islands and Caribbean by 2010, Would cause some 50 million “climate refugees” to be frantically fleeing from those regions of the globe.",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "lycopine",
                "time": "3 May, 2022",
                "context": "Doomsday statements don't negate the data, observations and evidence of climate, geological, glacial,oceanic, and atmospheric studies going back decades...",
                "good": "0",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "🐟Deliciousbass🐟",
        "time": "3 May, 2022",
        "context": "'The Blob' 2022.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "🙄ooohhhhpleazzz🙄",
        "time": "3 May, 2022",
        "context": "Sounds great in theory ~ but....  what happens next 🤔",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "whatname?081",
        "time": "3 May, 2022",
        "context": "Will keep the 40 plus year olds off the beach. Wouldnt want fake body parts to get eaten.",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "error": "error"
            }
        ]
    },
    {
        "user_name": "theoldfart",
        "time": "3 May, 2022",
        "context": "If you own a plastic car like a Saturn, it might just disappear tomorrow.  LOL",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "lastoftheredhotboomers",
        "time": "3 May, 2022",
        "context": "c'mon, give us the dirt. How can this be weaponized? We all know that's the million dollar question!",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "woozymarigold",
        "time": "3 May, 2022",
        "context": "This is NOT a good idea without having a counteragent developed beforehand to stop it.  Fool scientists need to start thinking about ALL the consequences of what they do before they go do it.",
        "good": "4",
        "bad": "1",
        "replies": [
            {
                "user_name": "redlindholm",
                "time": "3 May, 2022",
                "context": "I was thinking along those lines too. Good point",
                "good": "2",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "ryarios373",
        "time": "3 May, 2022",
        "context": "Oh, no!  The earth is going to be reduced to gray goo!...",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ClimatechangeIzaTAX380",
        "time": "3 May, 2022",
        "context": "Oh I heard of this...it's called JOY REID !!!   bwahahaha",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "hartnavy",
        "time": "3 May, 2022",
        "context": "Who will buy out the patent to keep the global warming hoax alive and well?",
        "good": "4",
        "bad": "0",
        "replies": [
            {
                "user_name": "lycopine",
                "time": "3 May, 2022",
                "context": "who will pay off the ignorants that believe in world wide, decades long conspiracies to perpetuate a hoax?\nOh, that was the gzus cult and their sky faery....",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "Brylcream_Boomer",
        "time": "3 May, 2022",
        "context": "Many fine expensive homes built on old landfills in Palos Verdes will sink into the ground if you melt away all the buried plastic in those landfills.  They wanted a view and got tires popping up in their yards for years! Now you want to fix the ecology and destroy the foundations.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Libertarian1957",
        "time": "3 May, 2022",
        "context": "Everyone should realize that this will convert the waste into evil carbon dioxide. Expect the poorly-educated Greens to go nuts when they realize this.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ph1776558",
        "time": "4 May, 2022",
        "context": "Mutant 59: The Plastic Eaters - read this 50 years ago. Don't recall how it ended but needless to say the unintended consequences caused havoc.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "OnionBurger",
        "time": "3 May, 2022",
        "context": "Do they have an enzyme to eat away @ democratic party?",
        "good": "7",
        "bad": "0",
        "replies": [
            {
                "user_name": "display_name",
                "time": "3 May, 2022",
                "context": "It;s called 'LOGIC' = totally destroys liberal's brains.",
                "good": "9",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "lycopine",
                        "time": "3 May, 2022",
                        "context": "well, there is no cure for CANCER-vatism and it spreads destruction and death around the Earth too. It needs to be contained and isolated from humanity then will ultimately destroy itself,,,",
                        "good": "0",
                        "bad": "1",
                        "replies": [
                            {
                                "user_name": "davekintexas885",
                                "time": "4 May, 2022",
                                "context": "Nice try but a swing and a miss!",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "jacob531",
        "time": "4 May, 2022",
        "context": "Fire is much faster.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sickobidenlies",
        "time": "5 May, 2022",
        "context": "When they produce Democrat eating enzyme that could quickly reduce anti-patriotism and woke politics, I'll invest everything that I can.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "MBK20991",
        "time": "5 May, 2022",
        "context": "If it'll eat plastic, it'll eat a whole lot more.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "herbivore678",
        "time": "5 May, 2022",
        "context": "If liberals continue to attack petroleum production and petroleum companies in the United States, we will not need a plastic eating enzyme. We will be mining these dumps looking for plastic to recycle into new plastic and we will need every scrap of that plastic. I'm guessing they will attempt to make nylon and rayon thread for clothes out of it too.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "g0disdead",
                "time": "5 May, 2022",
                "context": "They didn't invent this enzyme, evolution did.  They used an AI to develop a better version of the one that nature already created.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "M80inthemailbox",
        "time": "4 May, 2022",
        "context": "Cher is freaking out right about now.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dan5047628",
        "time": "5 May, 2022",
        "context": "We used to burn everything. Now we bury it and poison the Earth.",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "g0disdead",
                "time": "5 May, 2022",
                "context": "As opposed to poisoning the air...",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "JandyA",
        "time": "4 May, 2022",
        "context": "I can see it now. The bacteria escape the lab and start eating the plastic in our cars, housesm etc.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "demsr4shiff",
        "time": "5 May, 2022",
        "context": "when this escapes, a lot of women (and men), will lose their enhancements.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "kielbasa362",
        "time": "4 May, 2022",
        "context": "When will the Kardashians have a walk thru?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "nomorelaws468",
        "time": "5 May, 2022",
        "context": "Caution: side effect can also including eating flesh. Do not use near children under 6",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "fda106",
        "time": "4 May, 2022",
        "context": "I don't have an issue with \"Scientists\" creating a Enzyme that eats waste, but did they create a way to stop it when it finishes cleaning up the city dump?  Example:  the Covid Pandemic, \"Scientist\" created the virus in the WuHon Lab, but they didn't create a cure.",
        "good": "3",
        "bad": "0",
        "replies": [
            {
                "user_name": "quietsmith",
                "time": "4 May, 2022",
                "context": "It wasn't created in a lab, that's an established fact and no there's been no cover up of that or anything of the sort. \n\nNow was some natural variant of it being kept in a lab that got out? That's entirely possible.",
                "good": "0",
                "bad": "6",
                "replies": [
                    {
                        "user_name": "fda106",
                        "time": "4 May, 2022",
                        "context": "Yeah, I see your point, even though China refused to allow investigators to gather needed data to validate your conclusion.  After the first known man was scientifically recorded 2.4 million to 1.4 million years ago the Covid Virus just suddenly evolved to become lethal.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "quietsmith",
                                "time": "5 May, 2022",
                                "context": "We don't need to gather more data because we've had the virus itself to look at, and that's how we know it wasn't made in one.",
                                "good": "0",
                                "bad": "1",
                                "replies": [
                                    {
                                        "user_name": "dan5047628",
                                        "time": "5 May, 2022",
                                        "context": "So Covid just coincidentally started in the town that has a Lab that creates viruses for biological warfare.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": [
                                            {
                                                "user_name": "quietsmith",
                                                "time": "5 May, 2022",
                                                "context": "\"It wasn't created in a lab\" \"...was some natural variant being kept in a lab that got out? That's entirely possible\"\n\nTry to keep up, you're a creationist, so I know that's hard for you to do.",
                                                "good": "0",
                                                "bad": "0",
                                                "replies": []
                                            }
                                        ]
                                    }
                                ]
                            },
                            {
                                "user_name": "g0disdead",
                                "time": "5 May, 2022",
                                "context": "COVID is the disease caused by a specific variant of a family of viruses known as Corona viruses.  Most are harmless, some cause colds, some are deadly.",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "user_name": "beltrann",
                        "time": "5 May, 2022",
                        "context": "You are right and you are wrong.  It wasn't created in a lab it was modified in a lab.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "quietsmith",
                                "time": "5 May, 2022",
                                "context": "No, it wasn't :D",
                                "good": "0",
                                "bad": "1",
                                "replies": [
                                    {
                                        "user_name": "beltrann",
                                        "time": "5 May, 2022",
                                        "context": "Troll or bot?",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "kick@sstexan",
        "time": "4 May, 2022",
        "context": "Don’t get that stuff near my credit cards. With inflation, that’s what we are living on.",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "CHITTYB",
                "time": "5 May, 2022",
                "context": "The correct term is Bidenflation.",
                "good": "3",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "nypatriot556",
        "time": "5 May, 2022",
        "context": "Drop it over China so our West Coast Beaches can have a break",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "23golf.",
        "time": "4 May, 2022",
        "context": "if the enzyme ever gets lose, American women will be going back to B & C cups.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Thalvor",
        "time": "3 May, 2022",
        "context": "One step closer to a grey goo scenario",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "debisright178",
        "time": "5 May, 2022",
        "context": "I hope this enzyme does the trick because going back to glass will be a pain.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "carsickus",
        "time": "4 May, 2022",
        "context": "I think people may have watched a little too much TV.\nAnyone remember \"Big Movie Shocker\" hosted by Bestoink Dooley?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "draconisvidi",
        "time": "5 May, 2022",
        "context": "I read a novel series years ago where a product like this was invented, great idea at the time, then it got out into the wild, mutated, and ate all plastics and rubbers in the world.  You can imagine how that worked out.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "trinity6145779",
        "time": "4 May, 2022",
        "context": "Sad part is plastic waste are recyclable but we have to come up with another way to get rid of plastics since we are so wasteful.",
        "good": "2",
        "bad": "0",
        "replies": [
            {
                "user_name": "g0disdead",
                "time": "5 May, 2022",
                "context": "Most plastics aren't really recyclable.  And its very costly to recycle those that are.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "trinity6145779",
                        "time": "6 May, 2022",
                        "context": "Sorry sir but you are incorrect, several countries have great recycling programs for plastics, and at the current price of oil it is not that costly to recycle them, the world just has a throw away mentality.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "g0disdead",
                                "time": "6 May, 2022",
                                "context": "I am not incorrect.  Most of the plastic we send to other countries to be recycled is put into landfills or burned.",
                                "good": "0",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "trinity6145779",
                                        "time": "6 May, 2022",
                                        "context": "Again you are incorrect but you think what you want, I work in the environmental field, and deal with recycling all the time.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": [
                                            {
                                                "user_name": "g0disdead",
                                                "time": "6 May, 2022",
                                                "context": "Sure, ok.  I mean it's not like I haven't researched this or anything.",
                                                "good": "0",
                                                "bad": "0",
                                                "replies": []
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "tbear82nd",
        "time": "5 May, 2022",
        "context": "Long ago the grocery store I went to had benches in front of it, they looked like they were made of wood, but it was plastic, it was recycled plastic. I checked and come to find out it was very costly to do this, and now we have an ocean full of plastic. In the long run, I wonder what that will cost?",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "quietbear_001",
        "time": "3 May, 2022",
        "context": "I once read a book about some enzyme that would extract the aluminum from anything and excrete it as pure aluminum. In the end the enzyme got loose and destroyed everything that contained any amount of aluminum. Concrete roads and buildings being the worst hit. \n\nI wonder if they have a mitigation plan.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "IndependentTroll",
        "time": "4 May, 2022",
        "context": "This could go horribly wrong…\n🤣🤣🤣",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "carm571",
        "time": "4 May, 2022",
        "context": "Even with the enzyme that equals increased co2 emissions doesn’t it? Why isn’t gasification of plastic trash being used to recycles and reclaim fossil fuels? It’s cheaper than digging for raw resources and healthier for the lying ceos who catapulted the earth and oceans into destruction. You have the technology and you have the resources clean it up and stop sending it to China and other regions so when you dump it in the oceans you can pass the blame because it technically is under ownership of a nation(s) you are also exploiting .",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "carm571",
                "time": "4 May, 2022",
                "context": "It’s why god is allowing the USA to be put to death by means of drugs…you are being conquered with out a fight because god is giving attention to other nations who have the mindset they are helping poor among you because you are negligent and allowing them to freeze to death on streets etc.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "carm571",
                        "time": "4 May, 2022",
                        "context": "Combine your activities, use plastic pyrolysis or gasification to reclaim the original product which is diesel, give truckers a break and when they have to drive back empty have them fill up with a cargo of plastic and deliver it to a pyrolysis /gasification plant that also generates other forms of power such as electricity .",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "mrmacktitties",
        "time": "21 July, 2022",
        "context": "ADVISNG EVRYONE TO BUILD UNDER GROUND FACILITIES BECAUSE IN 50 YEARS IT WILL BE 135 DEGREES WITH THE LAST GOVERNMENTS FIGHTING OVER THE LAST 200 MILLION BARRELS OF OIL",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "redjeep3s",
        "time": "7 May, 2022",
        "context": "So what will we do with the bi- product resulting from this process?  ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "spiritualrevolution720",
        "time": "14 May, 2022",
        "context": "Oh, this just doesn't sound like a good idea.  What stops it from \"eating?\"  Let's look at a parallel:  A manufactured virus called Covid 19 escaped (so-claimed) and moved across the globe.  What if this enzyme escapes?  If it's picked up by birds, for example, and is transferred to water supplies or deposited into crops.  Water and foods come into contact with all kinds of plastics - containers, plumbing parts, fillings, dentures...  And what if this enzyme mutates?\n\nHumanity really needs to leave nature alone.  God is God, not scientists.  Every time meddlers mess with nature, really bad side-effects occur.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "redav143",
        "time": "17 May, 2022",
        "context": "If it’s in a landfill, and if the landfill is sealed from the environment, then I don’t care how long it takes to break down. It’s sequestered. End of story.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mrmacktitties",
        "time": "7 May, 2022",
        "context": "my plan to clean up space trash is a big fold out kevlar or spectra fiber glue trap after its all stuck with trash we burn it up in the atmosphere or a big electromagnet like we clean up nails and stuff with in the garage",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mrmacktitties",
        "time": "7 May, 2022",
        "context": "to bad cant turn it into gasoline 3 .79 a galloon man",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ambiguous",
        "time": "12 May, 2022",
        "context": "Fox needs to actually research articles like this. PET is very common, but most wrappers and soda straws are made of other types. Does  FAST-PET work on them? Also what are the by products?",
        "good": "0",
        "bad": "0",
        "replies": []
    }
]