[
    {
        "error": "error"
    },
    {
        "user_name": "gremlis",
        "time": "12 September, 2021",
        "context": "This is just the beginning of what happens when we have a weak president. These attacks will continue till we are in a war, or our weak president abandons our allies. If it involves china, Beijing Biden will give up the ship to secure more money from Xi. This administration is as corrupt as it gets.",
        "good": "294",
        "bad": "7",
        "replies": []
    },
    {
        "user_name": "Pepper_210",
        "time": "12 September, 2021",
        "context": "Or so we think. Because of the administration we’re talking about, it could’ve been an Afghanistan American evacuation plane. Or they could’ve let them fly by but changed the world’s “perspective” whether true or not. We can’t trust this administration anymore. Read the wise words of Thomas Jefferson: “We hold these truths to be self-evident, that all men are created equal, that they are endowed by their Creator with certain unalienable Rights, that among these are Life, Liberty and the pursuit of Happiness.--That to secure these rights, Governments are instituted among Men, deriving their just powers from the consent of the governed, --That whenever any Form of Government becomes destructive of these ends, it is the Right of the People to alter or to abolish it, and to institute new Government, laying its foundation on such principles and organizing its powers in such form, as to them shall seem most likely to effect their Safety and Happiness.”",
        "good": "863",
        "bad": "22",
        "replies": []
    },
    {
        "user_name": "reddgreenn",
        "time": "12 September, 2021",
        "context": "How will Biden farqup this?",
        "good": "18",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "hillbilly54",
        "time": "12 September, 2021",
        "context": "Guess where they got their technology for drones?",
        "good": "69",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "dbean48",
        "time": "12 September, 2021",
        "context": "Looks the Iranian militant army is still pushing Americans out of the Middle East, trying to make a statement about 9/11 attacks..The next round of drones will be most likely duplicates of what America left behind in Afghanistan..Biden is making this a more dangerous world not only for allies but Americans..",
        "good": "327",
        "bad": "8",
        "replies": []
    },
    {
        "user_name": "IamDBCooper.",
        "time": "12 September, 2021",
        "context": "Are these Predator drones paid by Obama giving back $150 billion dollars of frozen Iran assets during the dead of night ?",
        "good": "72",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "rockriverlar15761",
        "time": "12 September, 2021",
        "context": "They should have done a counter strike to their launch facilities or military installations.",
        "good": "173",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "approved",
        "time": "12 September, 2021",
        "context": "Tomorrow the truth will be, Joe killed more children flying a kite.",
        "good": "15",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Trumplicious",
        "time": "12 September, 2021",
        "context": "Biden can try to look like a tough guy all he wants. We would not even be hearing about this if he did not have to try to get us off what he did in Afghanistan. But the whole thing is backfiring against Biden. Iran is going to step up attacks on us as long as Biden is president. Shooting down a couple of drones is nothing really. They came from Iran? Bomb the palace in Iran, sink their navy, blow up a refinery, do something.",
        "good": "681",
        "bad": "14",
        "replies": []
    },
    {
        "user_name": "tedi",
        "time": "12 September, 2021",
        "context": "Would not believe any drone stories out of the US since they lied about the last one.  HUGE lie about the last one that killed American aid and 7 children.......not reported on main stream media in the US......British news reported it honestly.............go figure right?",
        "good": "12",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "negolien335",
        "time": "12 September, 2021",
        "context": "weak Biden does nothing shocker",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "OneNationUnderFraud",
        "time": "12 September, 2021",
        "context": "US shoots down Iranian drones attacking airport in Iraq:\nCorrection \nUS shoots down American  drones attacking airport in Iraq left in Afghanistan :\nWon't be long till all sorts of false flags and mayhem takes place with All the Equipment Biden left",
        "good": "29",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tadbittipsy",
        "time": "12 September, 2021",
        "context": "Joe is Amazing.",
        "good": "1",
        "bad": "6",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "constitutionalways",
        "time": "12 September, 2021",
        "context": "Did the drones say,thank you Barak Obama on them?",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "thehappydem",
        "time": "12 September, 2021",
        "context": "Thanks Joe for keeping us safe. ",
        "good": "3",
        "bad": "7",
        "replies": []
    },
    {
        "user_name": "BlueCoathanger",
        "time": "12 September, 2021",
        "context": "The Iranian drone prototype courtesy of B H O !!!!",
        "good": "8",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Archangeljack",
        "time": "12 September, 2021",
        "context": "And now there are four terrorist states, Afghanistan, Iran, North Korea, and Pakistan.\nTwo have the bomb, one wants it more than anything, and the other is the staging area for all future terrorist attacks globally.\nOur response Joe Biden...\nGod help us all!",
        "good": "40",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "noneyer",
        "time": "12 September, 2021",
        "context": "Literally the first thing the US did after Sec. of State Blinken was confirmed was to abandon Saudi and refuse data cooperation and arms thru Saudi to half the Yemeni civli war.\n\nToday eight months later Iran has effectively won the Yemeni civil war.",
        "good": "16",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "atoz29",
        "time": "12 September, 2021",
        "context": "Probably laden with water containers…like the “target” they blew up in Kabul to appear to be tough guys…",
        "good": "19",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "horace",
        "time": "12 September, 2021",
        "context": "Probably more lies from the clowns in the Biden circus show administration…drones probably took down kites being flown by children. ",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "LHS72",
        "time": "12 September, 2021",
        "context": "They are testing us (Biden) to see how we would react.",
        "good": "115",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "B-Man74",
        "time": "12 September, 2021",
        "context": "To be clear, most of our forces in Syria are guarding oil fields. Correction: as of Feb of this year, the Pentagon says that their mission switched to keeping ISIS contained. Hmmm.",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "wiseacres",
        "time": "12 September, 2021",
        "context": "Because Biden is a toothless old goat and no one is afraid of him or his communist administration..... Not the Iranians, not the NK's, not the Russians or the Chinese... No one...",
        "good": "14",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "interventor",
        "time": "12 September, 2021",
        "context": "There is a new three nation Axis power forming -- Iran, China and Russia.  Afghanistan's the new Austria.  Instead of a Winston Churchill, we're stuck with a addlepated Neville Chamberlain.",
        "good": "8",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "CyanChilli",
        "time": "12 September, 2021",
        "context": "Drone?  More like a school bus full of kids with the Joementia administration...",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "anyDimisathreattotherepublic",
        "time": "12 September, 2021",
        "context": "Once again avoiding the source of the problem",
        "good": "17",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "idiotsavant001",
        "time": "12 September, 2021",
        "context": "Probably shot down two resupply cargo planes loaded with water.",
        "good": "7",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "dpsocialservice",
        "time": "12 September, 2021",
        "context": "When you know the source of evil  why not cut the head of the snake off. Strike Irans nuclear facilities with cruise missile no need to send soldiers in then maybe they will think twice befor they attack our allies. Try it it works!",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "captbob642",
        "time": "12 September, 2021",
        "context": "That entire part of the planet should be turned into glass.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ohhfudge",
        "time": "12 September, 2021",
        "context": "Are we sure it was a drone and not a kid flying a kite.. Biden administration kills and lies..",
        "good": "9",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "thundervalleys",
        "time": "12 September, 2021",
        "context": "So glad  !  They are doing a GREAT JOB PROTECTING THE IRAQI BORDER, anyone see some two faced behavior here ?  Protect Iraqi while our country is invaded !  Just think about it !",
        "good": "100",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "noneyer",
        "time": "12 September, 2021",
        "context": "Note who spoke for the \"coalition\"?  A nobody!  Not Biden not Blinken.\n\nThose two are hard on the trail of aiding Iran in any way they can.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "StrandedinLaos+FJB",
        "time": "12 September, 2021",
        "context": "This is only the beginning, they're just getting warmed up...Dementia Joe has gifted them all they need to strike the US on home soil. I hope everyone that voted democrat is proud of this.",
        "good": "20",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "drwds",
        "time": "12 September, 2021",
        "context": "Who knows if this is true.  With Biden it charge it could have been a bunch of school children in a Cessna.",
        "good": "15",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "scottiedog58",
        "time": "12 September, 2021",
        "context": "Tired of being the laughing stock of the world 🌎?    \nStop Voting for Democrats!  \nTheir \"wokeness\" is destroying this country and ruining relationships with our trusted allies!   This administration is worse than Carter back in the '70's!  \nIn just 8 months!\nVote the Left OUT ...",
        "good": "36",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "scottishdecent",
        "time": "12 September, 2021",
        "context": "No pictures, Nothing concrete, Just hear-Say!",
        "good": "8",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "follownosheep",
        "time": "12 September, 2021",
        "context": "thanks worst pres ever for embolding our enemies",
        "good": "11",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "dannyeboy",
        "time": "12 September, 2021",
        "context": "All our enemies are laughing and testing the senile old weak crook",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "BR549",
        "time": "12 September, 2021",
        "context": "Are we going to find out later the drones were really commercial aircraft with civilians on board? Biden & his admin have made it hard to believe anything they say.",
        "good": "31",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "hh65abc",
        "time": "12 September, 2021",
        "context": "Thanks Barack and Joe! Thanks for actually giving aid and comfort to Iran so they could use that aid to build drones of their own. Let's see that money you gave them was used to supply munitions to the Taliban to kill servicemen. I'll bet money the last suicide bombers received their munitions from Iran along with the directions on how to build a bomb vest. Oh and remember the drone the Iranians captured from us and Barack did nothing to retrieve it or destroy it.",
        "good": "63",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "conssenior",
        "time": "12 September, 2021",
        "context": "We can't even protect our own border yet we are out there protecting Iraq?",
        "good": "31",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "kilobravo556",
        "time": "12 September, 2021",
        "context": "Here's another chance for joey to get American troops out of the middle east. Just order them home by tomorrow. Or better yet, make them find their own transportation home.",
        "good": "13",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "mark740",
        "time": "12 September, 2021",
        "context": "“We hold these truths to be self-evident, that all men are created equal, that they are endowed by their Creator with certain unalienable Rights, that among these are Life, Liberty and the pursuit of Happiness.--That to secure these rights, Governments are instituted among Men, deriving their just powers from the consent of the governed, --That whenever any Form of Government becomes destructive of these ends, it is the Right of the People to alter or to abolish it, and to institute new Government, laying its foundation on such principles and organizing its powers in such form, as to them shall seem most likely to effect their Safety and Happiness.” Awesome! Now lets put it to work. When is enough, enough? Mister Trump, please tell us  you are running again, give the American people something to look forward too and our enemies something to fear.",
        "good": "317",
        "bad": "13",
        "replies": []
    },
    {
        "user_name": "lumpster",
        "time": "12 September, 2021",
        "context": "The Federal Government, the mainstream media outlets, always leery of anything coming from these sources!",
        "good": "17",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "NotReally147",
        "time": "12 September, 2021",
        "context": "The Iranians know that we have a weak, senile fool in the White House manipulated by a bunch of incompetent idiots so they will take advantage and act up while the going is good.",
        "good": "15",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "CULater",
        "time": "12 September, 2021",
        "context": "Afghanistan Joe is trying the Pelosi two step but it’s not working it was an insult to have him at the ceremonies yesterday. He bungled Afghanistan and voted against going after Bin Laden",
        "good": "55",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "scottishdecent",
        "time": "12 September, 2021",
        "context": "war drums are Beating!",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Let's🇺🇸Go🇺🇸Brandon!",
        "time": "12 September, 2021",
        "context": "\"I forgot about September 11th\"\n\n-Joe Biden, September 12th, 2021",
        "good": "9",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "lionelney",
        "time": "12 September, 2021",
        "context": "in case anybody forgot. Muslim terrorist Barak Obama allowed one of our stealth drones to go down in Iran years back. the drone didn't self destruct. this was done on purpose. another example of the democrats giving away our military technology to terrorists.",
        "good": "12",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "Logflogger086",
        "time": "12 September, 2021",
        "context": "The drones used by the Iranians are the ones left by the U.S. forces during the evacuation to provide Joe his optics for 9/11.",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "luvdjt",
        "time": "12 September, 2021",
        "context": "Why did the drone WAIT until 9/11?  Just for show?",
        "good": "7",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "tsudonymn",
        "time": "12 September, 2021",
        "context": "Now that Biden has given Afghanistan to the Taliban terrorists, he will surrender Iraq to the Iranian terrorists, then start the longer process of surrendering America to the Chinese.",
        "good": "16",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Biden=moron733",
        "time": "12 September, 2021",
        "context": "humm. this didnt happen under the last president Biden... why now ????",
        "good": "7",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "OliveGrapes",
        "time": "12 September, 2021",
        "context": "The next time... they'll be using American Drone's sold to them by the Taliban~~~",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "america!364",
        "time": "12 September, 2021",
        "context": "We need to leave all other nations and concentrate on our own...\n\nIraq, South Korea, Japan, Philippines, Germany etc...let them pay for themselves no more American freebee",
        "good": "10",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "fixgovnow",
        "time": "12 September, 2021",
        "context": "Every American overseas is now less safe with the Biden/Harris administration and the incompetent flag officers in charge of our military.  Not a good time to be working under the leadership of this administration.",
        "good": "59",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "freddy6969",
        "time": "12 September, 2021",
        "context": "Biden was probably asleep so ordered that takedown Dr. Jill?",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "(ret)nco",
        "time": "12 September, 2021",
        "context": "Again Iran committing acts of war!",
        "good": "10",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "CyanScissors",
        "time": "12 September, 2021",
        "context": "Look out Iran, Joe Biden is likely to lean into a microphone, smell someone’s hair, whisper in a psycho voice that he is giving you a warning and a plane full of cash is on the way so you won’t do it again. Wink, wink.",
        "good": "9",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "disturbation",
        "time": "12 September, 2021",
        "context": "Joe gave them American dollars to purchase the drones.",
        "good": "23",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "s.tex.bears",
        "time": "12 September, 2021",
        "context": "In case you're wonder why we up and surrendered billions of equipment and friends in Afghanistan in 9 days on the anniversary of 9/11 while we leave troops in Iraq I'll spell it out for you:\nOIL OIL OIL\nClass dismissed",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "josephteague",
        "time": "12 September, 2021",
        "context": "Why? ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Rockhead,Esq.",
        "time": "12 September, 2021",
        "context": "Obama freed up over 30 billion dollars for our arch enemy Iran.",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "MassaMassa",
        "time": "12 September, 2021",
        "context": "Thank you Biden.  The horrors of pre-Trump world wide terrorist attacks, begin again.",
        "good": "9",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "smartest_person_in_the_room",
        "time": "12 September, 2021",
        "context": "Am I suppose to believe this story? It's hard to believe an administration of liars.",
        "good": "19",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "libsrnuts201",
        "time": "12 September, 2021",
        "context": "Peace through strength. Weakness through biden.",
        "good": "177",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "CrazyCapitalist",
        "time": "12 September, 2021",
        "context": "And yet Biden is still trying to crawl back to the table to beg for the nuke deal. It is so dead, they have been exceeding enrichment for 2 years now. Iran is months away from having enough material to make a bomb.",
        "good": "7",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "antònia",
        "time": "12 September, 2021",
        "context": "I don’t believe a word.",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "realamerican7613",
        "time": "12 September, 2021",
        "context": "Just send 1 ICBM to tehran and done ...call them 1 minute before and yell Youve been Hiroshima'd!",
        "good": "11",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "dachamp323",
        "time": "12 September, 2021",
        "context": "Are they sure they didn't shoot down drones that some kids just got for their birthday and were playing with?  I don't exactly trust anything coming out of this administration.",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jqpublicus",
        "time": "12 September, 2021",
        "context": "Too much playing defense. Get the offense on the field and run up the score.",
        "good": "20",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "dogininit",
        "time": "12 September, 2021",
        "context": "Earth to Biden and the administration, your foolishness has consequences. What have you started?",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "*cynic*",
        "time": "12 September, 2021",
        "context": "And where's Kamala & Nancy?  Taking POTUS & VPOTUS 101.",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "themilkhasgonebad",
        "time": "12 September, 2021",
        "context": "Boy, the Biden administration is really taking it to Iran. They shot down drones.",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "travelon82",
        "time": "12 September, 2021",
        "context": "\"Roughly 2,500 U.S. troops remain in Iraq, with an additional 900 troops in neighboring Syria to make sure the remnants of ISIS stay underground.\"\n\nWhen will Biden take it upon himself to turn these countries into worse disasters also?",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "LightFighter7292",
        "time": "12 September, 2021",
        "context": "I'm shocked!  Did they warn the Iranians?  Did they get permission from Joey?  Did they try Diplomacy first?  Are they going to send more pallets of money to compensate the loss of their drones?  No worries I guess...this won't end here...unfortunately.",
        "good": "20",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "2bhntn",
        "time": "12 September, 2021",
        "context": "Meanwhile biden and his advisors are jumping to get back in the iran nuclear deal asap! As usual wrong at every turn!",
        "good": "12",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "stag2tl",
        "time": "12 September, 2021",
        "context": "If I remember correctly, \"Little boy\" took care of Japan quite nicely...lets try it on Iran and erase this problem.",
        "good": "7",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "K8thePatriot",
        "time": "12 September, 2021",
        "context": "God bless our troops there.  Especially our chinook and black hawk soldiers from my town.  We are praying for you 🙏 ",
        "good": "15",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "soldierphd",
        "time": "12 September, 2021",
        "context": "Successful strike -because we still have troops in Iraq!",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "MotherNH",
        "time": "12 September, 2021",
        "context": "This is an act of war requiring a full and devastating response.  And there would have been one under Trump, Biden will send them money and apologize.",
        "good": "66",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "YoungGayInsurrectionist🇺🇸",
        "time": "12 September, 2021",
        "context": "Biden is a warmonger. President Trump did everything he could to create peace throughout our country and the world while maintaining military strength.",
        "good": "355",
        "bad": "7",
        "replies": []
    },
    {
        "user_name": "godandcountry2021",
        "time": "12 September, 2021",
        "context": "If one truly wishes to eliminate a problem, one must address the source. OR you could fund the source, like our president has done.  Odd how rocket attacks on Israel, terrorism, and drones loaded with bombs has increased 10 fold in the last 7 months. Weird",
        "good": "13",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "baddog611",
        "time": "12 September, 2021",
        "context": "When is Joey going to sneak those 2500 soldiers out in the middle of the night?",
        "good": "17",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "jimstory2",
        "time": "12 September, 2021",
        "context": "What I'm sure of  the Iranians were just tired of Waiting for Joe's Just Hand over American assets on a Silver platter Foreign policy to fully kick in. \nI'm amazed the self defence protocol allowed our forces to defend themselves. ",
        "good": "12",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "loyalnine",
        "time": "12 September, 2021",
        "context": "The religion of peace at war again",
        "good": "12",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "disturbation",
        "time": "12 September, 2021",
        "context": "The squat will blame America and joe will take their side. Traitors!",
        "good": "12",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tbruce18",
        "time": "12 September, 2021",
        "context": "This is the point where President Trump would have leveled a large portion of Iran.",
        "good": "21",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "elizabbr",
        "time": "12 September, 2021",
        "context": "Next week we'll hear how many families Joey killed, oops.",
        "good": "9",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "MassaMassa",
        "time": "12 September, 2021",
        "context": "Looks like they need some more pallets of cash to settle down again.",
        "good": "8",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Rufust.Firefly2018",
        "time": "12 September, 2021",
        "context": "This is why President Trump took out the Iranian  revolutionary guard top General Soleimani.  But feckless Dementia Joe just sits back and allows our troops to be attacked.",
        "good": "14",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "2ndAmericanRevolution957",
        "time": "12 September, 2021",
        "context": "Don't you love where we're at. Turn over Billions of dollars worth of military equipment in Afghanistan. Strand U.S. citizens. Tolerate drone attacks without swift and powerful retribution. Something that would probably make them think twice about another attempt.",
        "good": "74",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "makes_sense",
        "time": "12 September, 2021",
        "context": "Ha.  An Iranian drone designed from the us drone captured by Iran.   Another stellar performance.",
        "good": "12",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "MotherNH",
        "time": "12 September, 2021",
        "context": "A businesslike and professional drone attack.",
        "good": "7",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "finlandbob",
        "time": "12 September, 2021",
        "context": "You can thank Obamy.",
        "good": "7",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "coolhandluke603",
        "time": "12 September, 2021",
        "context": "this is what happens when the worst president in history gives iran 150billion dollars. IDIOTS.",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dannyeboy",
        "time": "12 September, 2021",
        "context": "Plugs will send them billions of tax dollars to stop",
        "good": "13",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "dahkala",
        "time": "12 September, 2021",
        "context": "They all talk about 9/11, but none state the reason why 9/11 happened. One Word---ISRAEL.",
        "good": "1",
        "bad": "16",
        "replies": []
    },
    {
        "user_name": "anamericancorrespondent",
        "time": "12 September, 2021",
        "context": "Now, a real president would either order a cyber attack upon the installation that supervised that attempted attack or just a few cruise missiles. But the Iranians have nothing to fear as there in not a real president to be found in the White House today.",
        "good": "34",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "AFoxIsSlyAndClever",
        "time": "12 September, 2021",
        "context": "Okay, retaliate with the \"Soleimani solution.\" Give the \"Iranian backed militia\" a dose of what they believe in: \"an eye for an eye.\" However, even though that's what should be done, I don't believe the Biden regime has the guts to do it.",
        "good": "35",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "hilairebelloc",
        "time": "12 September, 2021",
        "context": "Knowing Biden, the drone will turn out to be a Disney Cruise ship.",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "nolibsrequired",
        "time": "12 September, 2021",
        "context": "Seems to me the airport these drones flew out of should be rubble by now.",
        "good": "19",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "stopthemadness60738",
        "time": "12 September, 2021",
        "context": "It didn't take long for a member of the AXIS of EVIL to test America under the weakness of Joe TaliBiden ... stay vigilant folks, our enemies are looking to strike us again.",
        "good": "14",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "race-american",
        "time": "12 September, 2021",
        "context": "It's time , if we had  some one in office with brains for a tit for tap . We could hit then hard and never send in men on the ground . If they send one bomb we send a hundred  thats seems fair",
        "good": "7",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "fortheobservations",
        "time": "12 September, 2021",
        "context": "Almost all future wars are drone wars.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "durpees553",
        "time": "12 September, 2021",
        "context": "What's really missing from this story.  🤔 The role Obama has played in the rise of Iran. His boatload of cash dropped in the middle of the night, is still being felt today.",
        "good": "56",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "mikesr15",
        "time": "12 September, 2021",
        "context": "\"Roughly 2,500 U.S. troops remain in Iraq, with an additional 900 troops in neighboring Syria to make sure the remnants of ISIS stay underground.\"\n\nWhy?  So 3,400 troops to remain to keep ISIS underground, why not man up a little and hunt down the remnants before they relocate to the haven of Afghanistan Joey just built back better for them?",
        "good": "19",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "RalphtheBusDriver",
        "time": "12 September, 2021",
        "context": "Drones are the best. Kaboom!",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "badshemp149",
        "time": "12 September, 2021",
        "context": "that is a good start!!",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "TL352",
        "time": "12 September, 2021",
        "context": "Good thing Joe was sleeping. He would have ordered them to run.",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "snaggletooth",
        "time": "12 September, 2021",
        "context": "Korn Pop tried to warn us...",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "flapjack",
        "time": "12 September, 2021",
        "context": "This is the Village Idiot’s Administration, so we really don’t know much of anything. Just like the drone attack in Kabul for what was though to be an ISIS bomb . . . that wasn’t at all. Just an attempt for biden to save some face and claim he actually did something right.\nGAD\nThis guy is OTL!",
        "good": "10",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "chester_bobb__and_73_others_liked_your_comment",
        "time": "12 September, 2021",
        "context": "\"The U.S. counter-rocket, artillery and mortar system (C-RAM) engaged the two bomb-laden drones which were made in Iran, a separate U.S. official told Fox News. \"\n\n Wait til the drones that start doing this are our own drones that dipshoi Biden  left in Afghanistan..",
        "good": "25",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "patrioticvet1957872",
        "time": "12 September, 2021",
        "context": "suppose Sleepy Joe will want to remove our forces from IRAQ now. \"Attacks have become more sophisticated\", just wait till the Taliban give the Iran militia a few good helicopters....",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "America’sBattalion",
        "time": "12 September, 2021",
        "context": "Biden administration, send Iran a message. I’m not talking about a card. ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "nato762",
        "time": "12 September, 2021",
        "context": "Nice to know the Taliban, with their newly aquired C-RAM systems, will have the same option if needed..\n***extreme sarcasm***",
        "good": "17",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "richardd378",
        "time": "12 September, 2021",
        "context": "They were just testing  the new toys Obama bought them silly humans",
        "good": "11",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "dachshundsrule",
        "time": "12 September, 2021",
        "context": "\"Roughly 2,500 U.S. troops remain in Iraq, with an additional 900 troops in neighboring Syria to make sure the remnants of ISIS stay underground.\" Why couldn't we have done the same in Afghanistan?",
        "good": "29",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "longtime",
        "time": "12 September, 2021",
        "context": "Yea yea sure sure. The administration desperately trying to look like they are even slightly competent. Juggling woke and joke.. good luck..",
        "good": "20",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "liberaser",
        "time": "12 September, 2021",
        "context": "Under our empty Jos. A. Banks leader, our future is abysmal! Trump / 2024",
        "good": "14",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "YoungGayInsurrectionist🇺🇸",
        "time": "12 September, 2021",
        "context": "Biden is doing a terrible job. If you think we’re doing better than we were under President Trump’s leadership, you are mistaken.",
        "good": "516",
        "bad": "9",
        "replies": []
    },
    {
        "user_name": "nikitawarnedus",
        "time": "12 September, 2021",
        "context": "Drones that may have been financed with the money Obama/Biden gave them. And now we have Biden paying graft to the Taliban in the form of US weapons to allow him to evacuate some of our people without interference. Seems graft and corruption is well understood by this president and administration.",
        "good": "16",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "commonsense588",
        "time": "12 September, 2021",
        "context": "Was probably one of the several that the Obama admin allowed to go down in Iran. \nFunny how that happened.",
        "good": "10",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "gumby123",
        "time": "12 September, 2021",
        "context": "One thing for Certain we can BLAME Obama for gifting IRAN the DRONE and the related technology. Exactly the same purpose behind BIDEN gifting the TALIBAN with BILLIONS of our WEAPONS, VEHICLES both land and air as well as the countless documents left behind!\n\nThese were purposeful acts and \"DON\"T FORGET IT\"!",
        "good": "25",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "tigerrag330",
        "time": "12 September, 2021",
        "context": "Thanks Biden ",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "amandaviv",
        "time": "12 September, 2021",
        "context": "It won't be long before Biden pulls troops out of Iraq, leaving the Kurds to fend for themselves.  They've proven they can do well, but we can't abandon our commitment to them.  (Get that, Joe?).  What you should be doing is reinstating the sanctions your predecessor implemented.  But of course, you'll need permission from your handlers to do that.",
        "good": "796",
        "bad": "24",
        "replies": []
    },
    {
        "user_name": "YoungGayInsurrectionist🇺🇸",
        "time": "12 September, 2021",
        "context": "We all need to vote Republican in 2022. #OhioForTrump 🇺🇸",
        "good": "16",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "don2947",
        "time": "12 September, 2021",
        "context": "Now that everybody knows how weak Joe is there will be more of this.",
        "good": "22",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "👌DemusStultus",
        "time": "12 September, 2021",
        "context": "True or not? You decide.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "security1",
        "time": "12 September, 2021",
        "context": "Knowing the enemy source,  support, and an Allie willingness for protection is good to stand by.  No ghost camels and no ghost soldiers in Iraq and not in in Kurdistan.   They appreciate our support. ",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "doptule",
        "time": "12 September, 2021",
        "context": "Another US drone story we are told to believe. Shut up and believe!!",
        "good": "10",
        "bad": "2",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "goprocks",
        "time": "12 September, 2021",
        "context": "When America is perceived as Weak, the Bad Guys will test the waters. Biden emboldened them with the Afghanistan Disaster. China and Russia are ready to test us along with the Terrorist Groups.",
        "good": "8",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "fibs-da-luck",
        "time": "12 September, 2021",
        "context": "iran, another one of ohbummer fup ducks... ",
        "good": "10",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "hoffmaga906",
        "time": "12 September, 2021",
        "context": "nothing a few 5000lb bombs dropped over the Iranian airport wouldn't stop. That's all these cockroaches understand...",
        "good": "12",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "kick@sstexan",
        "time": "12 September, 2021",
        "context": "Muslim thugs are taking advantage of the empty suit currently occupying the Oval Office. Attacks will increase in the Middle East, with Israel in Iran’s crosshairs. And as Mr. Biden restricts petroleum production, gasoline and heating oil prices will rise. Prepare now for a miserable winter.",
        "good": "18",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "ketch22ss",
        "time": "12 September, 2021",
        "context": "And in other news from Iraq...two boys were out flying kites when to their surprise both kites blew up...no one was hurt and they were able to salvage their string....wtg Biden",
        "good": "11",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "hianxiety",
        "time": "12 September, 2021",
        "context": "Biden will stomp his foot then go back to bed..",
        "good": "7",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "damyankie",
        "time": "12 September, 2021",
        "context": "Let's not forget that it was during the Obama / Biden administration that Iran took control and brought down a U.S. Drone. Seems the Democrats love giving away our military equipment.",
        "good": "26",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "Aldenric",
        "time": "12 September, 2021",
        "context": "Expect more terrorist related incidents overseas and sadly in the US because of the spineless dementia addled old man installed as a puppet. ",
        "good": "12",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "wrongful1",
        "time": "12 September, 2021",
        "context": "I now have trouble believing any news reports out of the Middle East since the administration will obviously say anything to make itself look good.",
        "good": "20",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jimic",
        "time": "12 September, 2021",
        "context": "You can thank Obama and Biden, they funded the development of the drone program in Iran.",
        "good": "18",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ray__haney",
        "time": "12 September, 2021",
        "context": "They probably shot down a flock of geese. This administration is a buncha liars.",
        "good": "15",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "elalamein",
        "time": "12 September, 2021",
        "context": "Waiting for Little Fat Man Kimmy to start rattling sabers again. \nHe likes to test new presidents to see if he can extort money and this president has already shown to be a pushover for America's enemies.",
        "good": "12",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "jumpin-jack-flash",
        "time": "12 September, 2021",
        "context": "God bless President Biden for keeping America safe...",
        "good": "1",
        "bad": "10",
        "replies": []
    },
    {
        "user_name": "pinkoslasher096",
        "time": "12 September, 2021",
        "context": "All cash payments made to America's bitter enemies will be made by Joey, via drone.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bubbasan",
        "time": "12 September, 2021",
        "context": "Now we have to figure out if we believe this story or not. I’m skeptical. Even if some drones were shot down, how do we know where they really came from? Our government and it’s supporting media lie.",
        "good": "23",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "kent228",
        "time": "12 September, 2021",
        "context": "Likely one of Biden's gifted US drones being used against American troops.",
        "good": "17",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "texasisnotforliberals",
        "time": "12 September, 2021",
        "context": "In this episode of “Biden tries to deflect the narrative…”",
        "good": "18",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "i❤orangebadman",
        "time": "12 September, 2021",
        "context": "Did they get the drones on loan from the new Taliban weapons dump?",
        "good": "14",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Ramblinche81",
        "time": "12 September, 2021",
        "context": "will usa treat this as act of war ?",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "GreenFlower",
        "time": "12 September, 2021",
        "context": "Sounds like an act of war.  If on us, take out nuclear project.  But then I am not senile and caring only for my family's payoffs.",
        "good": "14",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "granite1899",
        "time": "12 September, 2021",
        "context": "Hummm I thought the war was \"over\".",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "r.w.b!!also460",
        "time": "12 September, 2021",
        "context": "Drones made in Iran and flown into Iraq,.. by  Iranian MILITA?  So that clears the Iranian Government and  Revolutionary Guard?  That Biden wants to finance under the guise of nuclear disarmament  ??",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "FairAndBalanced46",
        "time": "12 September, 2021",
        "context": "“Roughly 2,500 U.S. troops remain in Iraq, with an additional 900 troops in neighboring Syria to make sure the remnants of ISIS stay underground.”  So why is this not the case with Afghanistan?",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "nuuser",
        "time": "12 September, 2021",
        "context": "\"president' Bungle-Mumble's Middle East Besties, Iran... up to those silly shenanigans, again.",
        "good": "11",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "mrdeplorabletoyou4",
        "time": "12 September, 2021",
        "context": "The Kurds in Erbil are U.S. allies.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "areaman103",
        "time": "12 September, 2021",
        "context": "More Biden lies, I suspect.\nThey probably killed an interpreter who had almost managed to escape.\nEven if it's true, it seems prematurely aggressive and combative.\nDid they even try sending a strongly worded letter first - you know, diplomacy?",
        "good": "11",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "BlueFlask",
        "time": "12 September, 2021",
        "context": "Anyone have any clues?  Who’s constantly looking over their shoulder on Standby?  Thanks to Biden’s unkind, one man act of blunder -  WE ARE!  We can refer to this as “Sloppy Joe Mode”!\nInflation/Deflation and consistent dilemma’s!!!  Next?!",
        "good": "18",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "ohmitysmiter",
        "time": "12 September, 2021",
        "context": "Those C-RAM systems sound excellent.  I understand the Taliban just inherited several of them…",
        "good": "23",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Guy/Man/Dude",
        "time": "12 September, 2021",
        "context": "I don’t trust any news from this administration.",
        "good": "19",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "#1deplorable",
        "time": "12 September, 2021",
        "context": "\"US shoots down Iranian drones attacking airport in Iraq...\"\n\nQUESTION:\nWhy did the U.S. handle this task instead of the Iraqi Military?\nDid we not leave a \"trained\" military in that country when we left as was purportedly done in Afghanistan?",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "totallysirius",
        "time": "12 September, 2021",
        "context": "Aren't you glad Obama gave Iran those intact drones?",
        "good": "10",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "OliveSword",
        "time": "12 September, 2021",
        "context": "Check the Serial Numbers in the wreckage... These are the first US Drones that Joe gave to the Terrorists in Talibanistan....",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bugmeto635",
        "time": "12 September, 2021",
        "context": "Looks like they didn't quite duplicate the drone Obama gifted to Iran.",
        "good": "13",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "OliveGrapes",
        "time": "12 September, 2021",
        "context": "Did these \"Iranian Drones\" look like the RQ-170 that obama gave them?!!!\n\nOr did they design and build their own with the $100,000,000,000 that obama gave them?!!",
        "good": "13",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "caucasian_lives_matter",
        "time": "12 September, 2021",
        "context": "The safest thing we can do for America is to arm Iraq to fight Iran.  Keep Muslims killing Muslims.  Islam is pure evil when practiced as it is in the Middle-East and Africa.",
        "good": "3",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "toughoncrime",
        "time": "12 September, 2021",
        "context": "Maybe it’s time to wipe out Iran  once and for all. They attack us with two drones then we should send 200 drones to them",
        "good": "10",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "steski",
        "time": "12 September, 2021",
        "context": "Biden and dems spreading peace as always.  Maybe they will give iran a few more billion",
        "good": "11",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Aldenric",
        "time": "12 September, 2021",
        "context": "So same scenario but different modes of attack? Car - drones - civilians dead. Has to be trumps fault - right libbies? ",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "lmao749",
        "time": "12 September, 2021",
        "context": "Roughly 2,500 U.S. troops remain in Iraq, with an additional 900 troops in neighboring Syria to make sure the remnants of ISIS stay underground. \n\nWe could of done this in Afghanistan for the the same reason,, to keep Taliban and ISIS under ground!!  Guess it will take and other REP. to fix Afghanistan in 2024!",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "tomx2",
        "time": "12 September, 2021",
        "context": "I don't TRUST anything anymore that is being reported out of this current White House.  And the PRAVDA US Media that follows it be reporting every night at 0500 PM.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "flowpa",
        "time": "12 September, 2021",
        "context": "Muslim mentality: Death to all non-believers   - when non-believers are not around Death to all people I don't like! -  when people I don't like aren't around, death to all that look at me funny.",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "OliveSword",
        "time": "12 September, 2021",
        "context": "Didn't take Iran long to Reprogram Our Own Drones they got from the Kabul Debacle did it?",
        "good": "28",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Nanrob",
        "time": "12 September, 2021",
        "context": "Why should we believe anything that comes out from this administration.  Isn’t Killer Biden still hell bent on getting back in to the Iran deal?   What travesty will happen next for our country/military under this incompetent idiot ",
        "good": "15",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "switched2red",
        "time": "12 September, 2021",
        "context": "Reagan knew what to do. It's all they understand and it has to hurt not just symbolic. Operation Praying Mantis.",
        "good": "13",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mwillytaylor",
        "time": "12 September, 2021",
        "context": "“Roughly 2,500 U.S. troops remain in Iraq, with an additional 900 troops in neighboring Syria to make sure the remnants of ISIS stay underground.“\nSo why didn’t we follow the same logic in Afghanistan?",
        "good": "179",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "klingonthecat923",
        "time": "12 September, 2021",
        "context": "When China and Iran reverse engineer the drones left behind in Afghanistan it won't be long before the U.S. will be shooting down their own drones.",
        "good": "21",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "tomx2",
        "time": "12 September, 2021",
        "context": ".....or so 70 percent of 150+ MILLION of legitimate Americans are being TOLD!  Told by this Biden White House and the Mainstream Media.   The other 30 percent would follow Grandpa Joe's Propoganda Machine over the cliffside regardless!    Overall an obvious attempt to dissuade from the whole AFGHANISTAN debacle!",
        "good": "19",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "error": "error"
    },
    {
        "user_name": "lostincalif",
        "time": "12 September, 2021",
        "context": "Part of the Iranian ‘mostly peaceful’ return to the world stage funded by the Obama/Biden administration. Just give it a few weeks, we’ll see the results of the ‘mostly peaceful’ return of the Taliban.",
        "good": "20",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "GreenRadio",
        "time": "12 September, 2021",
        "context": "The two month lull is an interesting detail.   Good to hear that the C-RAM system is effective and that there were no injuries and no damage inflicted.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "johnlockelives",
        "time": "12 September, 2021",
        "context": "Give Biden a minute, and he will surrender.",
        "good": "23",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dahkala",
        "time": "12 September, 2021",
        "context": "You Cons and Israel are getting pretty Nervous, Iran is close to Nukes, thanks to Trump.",
        "good": "0",
        "bad": "15",
        "replies": []
    },
    {
        "user_name": "tokenandthejoe",
        "time": "12 September, 2021",
        "context": "Biden is lying again. He shot down our own drones in a show of fake force.",
        "good": "22",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "nelliefox663",
        "time": "12 September, 2021",
        "context": "Roughly 2,500 U.S. troops remain in Iraq, with an additional 900 troops in neighboring Syria to make sure the remnants of ISIS stay underground. \nInteresting ?",
        "good": "12",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Butchcassidy969",
        "time": "12 September, 2021",
        "context": "So Iran has drone technology???",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "coolhandluke603",
        "time": "12 September, 2021",
        "context": "what else do you think a terrorist country will do when you give them 150billion dollars? HELLO! how could anyone be that stupid?",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bill511",
        "time": "12 September, 2021",
        "context": "Were these drones carrying water for humanitarian purposes? \nBelieve nothing coming out of our government.",
        "good": "36",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "luvofcountry107",
        "time": "12 September, 2021",
        "context": "Well, Biden will pull them out and abandon more Americans.  It's the Biden way.",
        "good": "22",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "ichorous",
        "time": "12 September, 2021",
        "context": "I am sorry... taking a Corrupt, Wooden Puppet made in China seriously... I just can not do it !",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "give-me-liberty",
        "time": "12 September, 2021",
        "context": "Is this a Biden missile?  More likely a family flying in a small aircraft loaded with water!  But what the hey - spin!",
        "good": "11",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "sunwind",
        "time": "12 September, 2021",
        "context": "Biden and his cronies, or maybe he is the crony, will do anything to make us forget Afghanistan and remember he wants us all vaccinated.",
        "good": "39",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "laowai",
        "time": "12 September, 2021",
        "context": "Hey! Didn't Barack O'Biden withdraw all troops from the Middle East? What is that demented idiot doing waging war, again?",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "OrangeBug",
        "time": "12 September, 2021",
        "context": "Great job, President Tru... oh, I forgot he lost by over SEVEN MILLION VOTES. \n\nI'm sure some sheep will cry about it being \"stolen\", but they won't be able to provide even one piece of proof.\n\nLike always. 🐑",
        "good": "0",
        "bad": "18",
        "replies": []
    },
    {
        "user_name": "edandm",
        "time": "12 September, 2021",
        "context": "let's invade iran.  what could go wrong?",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "shipping",
        "time": "12 September, 2021",
        "context": "Probably a lie!    That is how you have to approach everything this unjustified admin. says or does.\nSad, but true.   Nothing they say or do is without an evil intent.   We are being led by EVIL people. \n# New Elections Now.\n# Better Dead then Red.",
        "good": "9",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "liberaser",
        "time": "12 September, 2021",
        "context": "In retrospect, our sad Country would probably be far better off, if the South had won! As I think my ancestors fought for the wrong side!",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "where'sbiden",
        "time": "12 September, 2021",
        "context": "The ayatollah refused to buy Hunter's paintings.",
        "good": "19",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ichorous",
        "time": "12 September, 2021",
        "context": "United we stand... so why are the Communist Democrats trying to divide us every way they can think of ?",
        "good": "30",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "daveed970",
        "time": "12 September, 2021",
        "context": "Is this like the drone strike that supposedly killed an ISIS-K member but turned out to be an Afghan civilian who actually helped the US previously. ",
        "good": "21",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "SethBullock",
        "time": "12 September, 2021",
        "context": "These \"Middle Eastern\" folks cannot seem to live in peace with anyone. 2021 and they still practice uncivilized barbarism! Last I heard the Liberals and Leftists want to air drop millions of copies of \"Imagine\", by John Lennon, over Iran. Yea, that should do it!",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tokenandthejoe",
        "time": "12 September, 2021",
        "context": "I don’t believe one word that the Biden Administration says.",
        "good": "44",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "timetomanup",
        "time": "12 September, 2021",
        "context": "Did Biden run to the basement?",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mcmasterman",
        "time": "12 September, 2021",
        "context": "The Biden administration is disgrace and dishonor. Resignations and impeachments.",
        "good": "24",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "boomer767",
        "time": "12 September, 2021",
        "context": "They are enriching uranium as we speak.",
        "good": "20",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "kielbasa362",
        "time": "12 September, 2021",
        "context": "HERE WE GO ! Now watch SAUDI ARABIA open it's purse strings to the US government for Protection .",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tokenandthejoe",
        "time": "12 September, 2021",
        "context": "Hey Joe, what’s the names of those ISIS terrorists you blew up.",
        "good": "22",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "¥?#*!",
        "time": "12 September, 2021",
        "context": "Us led coalition😂 that’s a scary thought.",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "JohnAO",
        "time": "12 September, 2021",
        "context": "Biden is doing a great job bringing peace to the Middle East, doncha think? \nAnyone?  Anyone?",
        "good": "22",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ThePort",
        "time": "12 September, 2021",
        "context": "Until we give Iran a good spanking they will continue to harass our troops.   Doesn't anyone in DC understand this???",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "andynighttrain",
        "time": "12 September, 2021",
        "context": "Just the beginning!",
        "good": "16",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Freedom!667",
        "time": "12 September, 2021",
        "context": "Don’t believe a word of it …. Who are we protecting ? The Taliban now??",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "tokenandthejoe",
        "time": "12 September, 2021",
        "context": "Hey Joe, don’t upset the postal workers making them get vaccinated. After all, they bring in those mail in ballots.",
        "good": "51",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "noneyer",
        "time": "12 September, 2021",
        "context": "This event will be completely ignored by our blow Iranians under the desk Sec. of State Blinken.",
        "good": "17",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ShallNotBeInfringed571",
        "time": "12 September, 2021",
        "context": "Guess what, Biden is still YOUR president.",
        "good": "1",
        "bad": "11",
        "replies": []
    },
    {
        "user_name": "usvet/patriot",
        "time": "12 September, 2021",
        "context": "It was treasonous that Obama Allowed the Iranians to have our Drone Technology!  I recall the Obama Administration allowing Iran to steal our high tech US military Drone and then sent them Plane loads of billions in USD and EU Currency shortly after that at the expense the USA.  \n\n\"Who Pays Billions out in cash to a Terrorist Thief Nation?  Obama was supposed to be a public servant not a public \"Terrorist Enabler\".",
        "good": "18",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "madeinchinajoe",
        "time": "12 September, 2021",
        "context": "Why only pay defense?  Offense is the other half of the game.   I say, if they send 2- we send back 20.",
        "good": "7",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "stugots1",
        "time": "12 September, 2021",
        "context": "wonder if those were our drones the Iranian's were using?",
        "good": "13",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "ichorous",
        "time": "12 September, 2021",
        "context": "Honesty... What are the Communist Democrats lacking !",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "obx",
        "time": "12 September, 2021",
        "context": "More recently, the attacks have become more sophisticated, with militants using drones instead of Katyusha rockets.  The Blackhawk helicopters will be used next. Thanks Joe.",
        "good": "23",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "usafmsgt",
        "time": "12 September, 2021",
        "context": "The proper response would mirror what Israel does after a rocket attack.",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "carlislej",
        "time": "12 September, 2021",
        "context": "time for israel to end this scourge.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "chester_bobb__and_73_others_liked_your_comment",
        "time": "12 September, 2021",
        "context": "You cannot trust this admin with anything it says....\n In 2 weeks the real facts will come out that it was our own drones they shot down that Biden surrendered to the enemy in Afghanistan just a couple weeks ago.. ...",
        "good": "16",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "armysully479122",
        "time": "12 September, 2021",
        "context": "Iran is testing the waters too...because EVERYBODY sees that a feckless moron is sitting as the figurehead President of the United States.",
        "good": "12",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "liberaser",
        "time": "12 September, 2021",
        "context": "I don't have any political party affiliation, as I always vote for whichever candidate that seems to be the most intelligent and the most qualified. This current complete waste of precious o2 , that's currently occupying Oval Office, is the most abysmal excuse for U.S. president in my entire 76 years! Now I feel much better!",
        "good": "641",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "Minderaser",
        "time": "12 September, 2021",
        "context": "Once again, does anybody really believe this?",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "OrangeFan",
        "time": "12 September, 2021",
        "context": "Ally to this President and his master Obama.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "catfandu",
        "time": "12 September, 2021",
        "context": "The next drone might be US made donated to Iran via Afghanistan by Slo Joe.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "johnlockelives",
        "time": "12 September, 2021",
        "context": "The military lies all the time. Read between the lines. The drones were \"engaged\" by our weapon, yet both made contact. \nThey were not shot down, they both exploded as intended, one inside the parameter, one outside. \nTruth be known, which with this administration lies to us even when they don't have to, these drones were probably ours taken from Afghanistan.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Zebulon1776",
        "time": "12 September, 2021",
        "context": "Some of those new U. S. military “Christmas” weapons left behind by Ole Biden in Afghanistan for the Taliban?? ",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "seatogalaxies",
        "time": "12 September, 2021",
        "context": "I suspect terrorist attacks will start happening in the next couple yrs. As long as the Democrats are running the show our enemies know we are weak and vulnerable. Even within our own country Biden and the Democrats give the criminals the upper hand (defunding the police, bail reform) and crime is surging. Illegals flooding here with no fear of being returned, getting government subsidies and the freedom of choice of being vaccinated. It feels like America has been hijacked.",
        "good": "42",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "drewmeister870",
        "time": "12 September, 2021",
        "context": "Roughly 2,500 U.S. troops remain in Iraq, with an additional 900 troops in neighboring Syria to make sure the remnants of ISIS stay underground. That seems to be a workable plan. Wonder why this administration didn’t see the wisdom of a similar operation in Afghanistan?",
        "good": "863",
        "bad": "30",
        "replies": []
    },
    {
        "user_name": "thesaint921",
        "time": "12 September, 2021",
        "context": "how many false flag operations are we going to fall for?",
        "good": "3",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "mk101mk693",
        "time": "12 September, 2021",
        "context": "Our politicians and military keep playing the same game. Ignoring the guilty party, Iran. Instead of sending few guided missiles on one of Iran airports they are all proud and full of pride by shooting the Iran drones. Next time the Iran drone will hit their target. We train them \"nothing will happen to them\"",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "carm571",
        "time": "12 September, 2021",
        "context": "True forms of justice is religion ...the nation or nations upholding higher standards even if it means reforming areas , like outside business dealings, or who receives death penalties for wicked crimes domestically , when you do have to fight wars there will be little or no casualties and god will be with you to fight against individuals who misuse their authority in satanic forms...the wars when fighting terrorism will be reduced from hundreds of years or decades to possibly a few months if that...when moves are made to not except gods from nations who exploit their people , etc god is well pleased....god is also pleased with people who have a willing spirit to help others even if it puts them in danger ....police , soldiers, first responders and others including individuals who just build up the courage to speak against wrongs committed and it puts their lives in danger are all individuals working in line with gods standards...the Bible indicates they will receive their lives back in a resurrection even though they lost them . These individuals are why god may have turned back destructive decisions...because what they did and are doing is approved...if there are areas that people need to work on improving or moving forward in practices, teachings etc ...which we all need to do whether it’s something that is our fault or we were handed to figure out to fix these too are things god will consider and remove threats that still might exist like world war.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "thesaint921",
        "time": "12 September, 2021",
        "context": "i wouldn't bet the were from Iran. You better check Israel or even us if you don't want another false flag war.",
        "good": "0",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "end_of_daze",
        "time": "12 September, 2021",
        "context": "lol... a feeble attempt by a feeble President to \"Wag the Dog\". Pathetic",
        "good": "14",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "azbitesback",
        "time": "12 September, 2021",
        "context": "Iranian drones attack U.S. Troops? 71 miles to Iran Border. Biden response is? What gift will he give to Iran?",
        "good": "17",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "pappy1958",
        "time": "12 September, 2021",
        "context": "Hey Joe, It's already started.....",
        "good": "17",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "SamBrown",
        "time": "12 September, 2021",
        "context": "biden gave billions of dollars to Iran.  then they have money to make drones.  IMPEACH BIDEN!!!  WHAT THEY WAITING FOR?",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jimsbeam",
        "time": "12 September, 2021",
        "context": "Oh, Iran is still ticked about our great President Trump “offing” that Iranian General WhatsHisFace.  Boo hoo.",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "hapshog",
        "time": "12 September, 2021",
        "context": "Paid for by Obama and Biden ",
        "good": "15",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Disgusted936",
        "time": "12 September, 2021",
        "context": "Great, talaban using the drones that our screwed up president left behind for them.  Biden should be tried for treasonous act along with all his administration.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "purelovebaby",
        "time": "12 September, 2021",
        "context": "AND this is why we don't drop billions $$$$$ into the laps of worthless TERRORISTS, not long after turning the world's supply of URANIUM over to Russia - who then runs over to build the terror power of WORTHLESS TERRORISTS in Iran.\nDemocrats are THE WORST PLAGUE the United States has ever known.",
        "good": "10",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "tophiel",
        "time": "12 September, 2021",
        "context": "Paid for by the $$$$$ the Islamic sympathizer ex-president Obama sent them on pallets in the middle of the night.",
        "good": "15",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "foxstar",
        "time": "12 September, 2021",
        "context": "Hopefully, with Biden's recently announced commitment to stop using American Troops, along with trillions of tax dollars spent in the America's extremely unproductive  practice of nation building Middle East countries for the past 20 years, Troops will be removed from Iraq in due coarse as well. At least I hope that is the case. Because Russia and China are far bigger threats to American Democracy than any Middle East county is. And as whacky as it sounds, why not use that money spent on rebuilding Afghanistan and Iraq ... on America's own infrastructure.",
        "good": "1",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "thesaint921",
        "time": "12 September, 2021",
        "context": "how about Israel?",
        "good": "0",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "LeftCAforTX",
        "time": "12 September, 2021",
        "context": "“Roughly 2,500 U.S. troops remain in Iraq, with an additional 900 troops in neighboring Syria to make sure the remnants of ISIS stay underground.”   Or, they could come above ground in Afghanistan.",
        "good": "14",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "clarity466",
        "time": "12 September, 2021",
        "context": "Coming from Biden?  I don't believe a word he says.  Democrats fake everything from drone strikes to hate crimes.  Hell, even their president is a phony.",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "puggi",
        "time": "12 September, 2021",
        "context": "Iraq was lost to usa and allies when we left and the iraqi people did not fight off iran. We go to war, spend trillions and die for other peoples countries and after billions in training those people of their own countries wont die and defend their country. The usa should not be in the middle east and we have our own oil here. The MIC and politicians want usa overseas just to make money and kill our soldiers for themselves. We can't afford to save the world.",
        "good": "7",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "error": "error"
    },
    {
        "user_name": "politicalhawk410",
        "time": "12 September, 2021",
        "context": "And Biden wants to restore the ridiculous nuclear deal with Iran? How stupid and naïve does one have to be.  These losers who didn't like the way Trump tweeted and voted for Biden could find themselves forced listening to something light years worse.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ryguy101",
        "time": "12 September, 2021",
        "context": "Are we sure these drones weren't delivering water to kids ?",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "KaosRex",
        "time": "12 September, 2021",
        "context": "Iran will definitely build the nuke bomb with Biden in office with impunity. Would not be surprised if they ask Biden for some more pallets of cash to support their nuclear endeavors.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "old,beat-up",
        "time": "12 September, 2021",
        "context": "thank old maid, senile Biddie.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "stealpenny",
        "time": "12 September, 2021",
        "context": "I remember when Iran captured one of our drones. They reversed engineered and now they have a fleet of them. Wait till China gets a hold of $85,000,000,000 of state of the art equipment joe left in Afghanistan.",
        "good": "52",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "DV2U909",
        "time": "12 September, 2021",
        "context": "Uh oh, China Joe just soiled himself again!",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "thesaint921",
        "time": "12 September, 2021",
        "context": "are you people still trusting what the military says?",
        "good": "3",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "whoson1st",
        "time": "12 September, 2021",
        "context": "Yeah like The ISIS they claim they took out in Afghanistan, except it wasn't ISIS , But Children.  If this is true it is a 100% reason why the IRAN Nuclear Agreement must never restart.",
        "good": "7",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "liberalsarekillingamerica",
        "time": "12 September, 2021",
        "context": "Real President Trump would have shot them down and sent back a few of our own to Tehran.",
        "good": "13",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "starstreams",
        "time": "12 September, 2021",
        "context": "Iran has a new supply of drones from the Afghani Taliban. Xi-Biden left our equipment behind. We have no idea how much of the arms are operational or serviceable. Xi-Biden has already lied.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "willy23",
        "time": "12 September, 2021",
        "context": "yeah sure.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Johnpei",
        "time": "12 September, 2021",
        "context": "Unfortunately the White House didn’t have the same attitude when it was American troops being killed",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "whb103",
        "time": "12 September, 2021",
        "context": "Thank you Joey.  How long do you think it will be before the Taliban uses the drones you gave to them on the USA???",
        "good": "13",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "thesaint921",
        "time": "12 September, 2021",
        "context": "how many can I remember from the history books. the fake attack on the Main at the beginning of the Spanish-American war, the fake attack and the Gulf of Tonkin incident that started or escalated Vietnam, the fake Bush weapons of mass destruction. how many times are we going to do this?",
        "good": "0",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "jershon",
        "time": "12 September, 2021",
        "context": "Those drones only got shot down because the Biden Administration didn't know anything about the attack and wise commanders with standing orders took them out.",
        "good": "15",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "thesaint921",
        "time": "12 September, 2021",
        "context": "false flag operation again",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "amdillow",
        "time": "12 September, 2021",
        "context": "\"U.S. forces shot down a pair of Iranian drones that attacked the Irbil airport in Kurdish-held northern Iraq late on 20th anniversary of Sept. 11.\"\n\nDrones that, then, President Barak Obama gave Iran. Iran got their drone technology from the United States while President Barak Obama was in office. Shortly after the Obama administration secretly arranged plane deliveries of $400 million in cash to Iran, an American stealth drone with the capability to be weaponized landed, without a scratch, on an Iranian airstrip. Obama then went on to pay Iran an additional 1.3 billion dollars in US tax money. While Obama claims it was money the US owed Iran, a claim no one had been able to substantiate, the $400 million dollars was delivered just after 4 American hostages were freed by the Iranian government.",
        "good": "15",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Honeybun1$",
        "time": "12 September, 2021",
        "context": "How many pushups can he do??",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "john1038154",
        "time": "12 September, 2021",
        "context": "So when are we going to strike targets in Iran in retaliation?  Sleepy Joe says not gonna happen.",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "dichotomy653",
        "time": "12 September, 2021",
        "context": "After Biden's cowardly surrender and catastrophic retreat from Afghanistan, every pimple on the butt of the world is going to try us on for size.",
        "good": "12",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cailmaga",
        "time": "12 September, 2021",
        "context": "I’m sorry.  I have trouble believing any information that is released from the Biden Administration! ",
        "good": "21",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "thesaint921",
        "time": "12 September, 2021",
        "context": "my money's on Israel, they've been trying to get us to go to war with Iran for years",
        "good": "1",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "durpees553",
        "time": "12 September, 2021",
        "context": "Hmmmmmm, trying to rehab that weakness image? Looking for any small victory after such a huge loss? That over the horizon capable narrative they keep pushing. \nPredictable, watch the small little victories keep coming.",
        "good": "27",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "almostlibertarian",
        "time": "12 September, 2021",
        "context": "The source of the drones will soon disintegrate.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Shitzandgiggles",
        "time": "12 September, 2021",
        "context": "“Roughly 2,500 U.S. troops remain in Iraq, with an additional 900 troops in neighboring Syria to make sure the remnants of ISIS stay underground. “. Why couldn’t we have left a similar force in Afghanistan to keep Taliban underground? Or at least keep them from over taking Kabul. ",
        "good": "13",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "redryder996",
        "time": "12 September, 2021",
        "context": "A drone attack in Iraq makes news. Wait until the new, undocumented Islamic fanatics start flying their drones in the USA. We will look back on this point in history with great regret.",
        "good": "14",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Donlewis444",
        "time": "12 September, 2021",
        "context": "So what will our response be?    Crickets?",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tuffngruff",
        "time": "12 September, 2021",
        "context": "The only good mullah is a dead mullah",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tracersnet",
        "time": "12 September, 2021",
        "context": "Why didn't they  use the weapons against the billions of dollars that were left for the Taliban",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "joejbrown556",
        "time": "12 September, 2021",
        "context": "More likely Babbling Biden killed two kids flying kites 🪁",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "libertyboy",
        "time": "12 September, 2021",
        "context": "Iranians... Aren't they Obama's friends? Hmmm.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ChooseLight",
        "time": "12 September, 2021",
        "context": "Let's hope Biden doesn't suddenly pull all the troops out of Iraq and leave behind all the equipment, US citizens, and Allies.",
        "good": "174",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tomc844",
        "time": "12 September, 2021",
        "context": "Act of war? What will Biden do? Nothing. Will the Democratic Media cover the story? No.",
        "good": "22",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mr0",
        "time": "12 September, 2021",
        "context": "Drone attack and Biden says nothing",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mr.moderate",
        "time": "12 September, 2021",
        "context": "Trump would have threatened Iran with NO response..",
        "good": "0",
        "bad": "11",
        "replies": []
    },
    {
        "user_name": "1108",
        "time": "12 September, 2021",
        "context": "Biden, \"we have troops in Iraq?\"",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bohannon394",
        "time": "12 September, 2021",
        "context": "\"Each attack against the GoI, KRI and the Coalition undermines the authority of Iraqi institutions, the rule of law and Iraqi National sovereignty,\" Operation Inherent Resolve spokesman Col. Wayne Marotto said in a statement posted to Twitter. \"These attacks endanger the lives of civilians and the partner forces from the ISF, Peshmerga and Coalition.\" \n\nThank you Colonel for the soft talk. May we see you use the big stick ?",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Biden=FakePresident",
        "time": "12 September, 2021",
        "context": "They will be trying harder than ever with Sleepy Joe at the wheel...",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "PonyDogFace",
        "time": "12 September, 2021",
        "context": "The open borders are totally unacceptable. Biden's withdrawal from Afghanistan it is totally unacceptable.",
        "good": "13",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "jammy1955110",
        "time": "12 September, 2021",
        "context": "Iranian Bombs courtesy of Obama funding.  Obama was, is and always will be Pro-Iran.  And Biden is controlled by Obama.  The DESTRUCTIVE DUO.",
        "good": "15",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "666god999",
        "time": "12 September, 2021",
        "context": "Real soon Iran will be using American drones.",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "OrangeFan",
        "time": "12 September, 2021",
        "context": "Thank you President Joe Biden for keeping America safe at night so the children can sleep peacefully in their beds at night. If trump were still around this mission would have succeeded!",
        "good": "1",
        "bad": "16",
        "replies": []
    },
    {
        "user_name": "clarity466",
        "time": "12 September, 2021",
        "context": "\"Why does a dog wag its tail? Because a dog is smarter than its tail. If the tail was smarter, the tail would wag the dog.\"",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "medalist1595",
        "time": "12 September, 2021",
        "context": "Since nobody believes a word coming outta any segment of the administration, it’s best to take another  wait and see, until the British newspapers confirm it, cause that’s just where we’re at in Biden times.",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "thesaint921",
        "time": "12 September, 2021",
        "context": "stop the military industrial complex",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "RandyRhoadsPilot",
        "time": "12 September, 2021",
        "context": "Joe Biden once piloted a drone ….",
        "good": "12",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "presidentpotatohead249",
        "time": "12 September, 2021",
        "context": "Turns out....they were just flying carpet hydration stations 🤦‍♂️",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "triv",
        "time": "12 September, 2021",
        "context": "You may wanna wait until another country confirms this....this administration is short on truth.",
        "good": "15",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "presidentpotatohead249",
        "time": "12 September, 2021",
        "context": "Omar    \"Daddy...shouldn't we bring more water?\"\n\nSahib    \"You're killing me, son\" 😯",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "OliveSword",
        "time": "12 September, 2021",
        "context": "Iranian Drones with US Serial Numbers \"Captured\", er \"Given to Iran\" by joey...",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "winkmartindale351",
        "time": "12 September, 2021",
        "context": "Biden is a wimp. Reality.",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rich49119",
        "time": "12 September, 2021",
        "context": "We have a good idea where Iran’s nuclear refining facilities are, well we should make them gone!  They strike us we strik them 100 times more, that’s the only thing they under stand!",
        "good": "13",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "gatedfox",
        "time": "12 September, 2021",
        "context": "Trump would have sunk their entire \"navy\", as pathetic as it is. Biden will probably pay them and apologize for the loss of their drone.",
        "good": "21",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "shipmatemcm8",
        "time": "12 September, 2021",
        "context": "Where is Tehran John?",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mydog'shumandaddy",
        "time": "12 September, 2021",
        "context": "I seriously doubt OUR MILITARY left any drones in Afghanistan since they can be operated by remote and can fly into and out of just about anywhere.....a lot of the more dangerous equipment in Afghanistan was rendered useless anyway....and anything that can be used the Taliban will want to keep for the internal wars soon to follow and they wouldn't give them to Iran anyway since Iran will probably back people who will be fighting against the Taliban.........and NO I AM NOT DEFENDING BIDEN.......",
        "good": "3",
        "bad": "8",
        "replies": []
    },
    {
        "user_name": "ozyalaha",
        "time": "12 September, 2021",
        "context": "How will obaiden explain this to his anti-american handlers who assured the iranian terrorists that their drone attack would not be defended.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "thesaint921",
        "time": "12 September, 2021",
        "context": "stop funding Israel and we might have some peace in the Middle East",
        "good": "1",
        "bad": "16",
        "replies": []
    },
    {
        "user_name": "taggert",
        "time": "12 September, 2021",
        "context": "The military industrial complex needs a new war now that they lost their cash cow in Afghanistan. You'll see more news stories of Iranian aggression over the next couple months.",
        "good": "7",
        "bad": "2",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "wakeupamerica2020975",
        "time": "12 September, 2021",
        "context": "The administration is embarrassing… they send drones, we bomb the sheet out of them, that’s how it works.  Quit showing weakness!  This hands off approach is going to snowball.  We have lost all respect with our NATO allies!",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "OliveSword",
        "time": "12 September, 2021",
        "context": "So I wonder if Joey got our Drone tech scientists and engineers to Work With Iran to Reprogram our own drones for these Strikes?",
        "good": "13",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "freddy6969",
        "time": "12 September, 2021",
        "context": "Too bad nobody has figured out how to reprogram in flight and send them back to launch site. Somebody work on that,  thanks,",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "web0623",
        "time": "12 September, 2021",
        "context": "Biden's retaliation is to say, \"Don't do that or I will say don't do that again!\"",
        "good": "18",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rustyreel",
        "time": "12 September, 2021",
        "context": "Testing the incompetence of our weak government. Going to be a lot more testing.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "AmericanConstitutionalist",
        "time": "12 September, 2021",
        "context": "“We must get all military vaccinated so that we can protect the vaccinated from the un vaccinated” - drooling joe zero",
        "good": "12",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "fua786",
        "time": "12 September, 2021",
        "context": "I’m surprised because China Joe and his communist Democrats love Iran! ",
        "good": "16",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Eaglesnest13",
        "time": "12 September, 2021",
        "context": "Well… I guess it started from this point on you will see more of this if the news media doesn’t cover it up!",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "1776jgt",
        "time": "12 September, 2021",
        "context": "I don't believe anything they report.",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "MuchachoNextDoor",
        "time": "12 September, 2021",
        "context": "You mean we left troops in Iraq and Syria to help maintain some semblance of peace? Huh, that's an interesting concept...",
        "good": "14",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cactuspete977",
        "time": "12 September, 2021",
        "context": "Cut and run Taliban Joe!",
        "good": "9",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "mjua350",
        "time": "12 September, 2021",
        "context": "More and more, this country is turning into Hogans Heroes\nBiden is Col Klink, Kamala is the secretary for Klink, Garland is the Gestapo Hockstetter, \nblinken is Schults, and stalag 13 is the white house...\nCannot wait for them to cancel this show.",
        "good": "12",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ivotedforkamala",
        "time": "12 September, 2021",
        "context": "Barack's brothers in deity acting up again.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "thesaint921",
        "time": "12 September, 2021",
        "context": "dismantle the thousand bases we had scattered all over the world and we might have some peace",
        "good": "0",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "robstew500",
        "time": "12 September, 2021",
        "context": "I thought ISIS was destroyed?",
        "good": "1",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "factu-al",
        "time": "12 September, 2021",
        "context": "Will the final analysis of this one result in the same sort of conclusions reached when the Biden Administration claimed to kill a terrorist headed for the airport in Kabul?  Can no longer believe a word that comes out of the White House or the completely incompetent \"leadership\" of the DOD.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mikek111",
        "time": "12 September, 2021",
        "context": "2 things:  1.  They feel the cowardice/weakness, they're trying different things/dry runs for the upcoming \"biden9/11\" that will shade the original.  2.  biteme killed innocent people in his stunningly weak response to murdered Americans, what is the true story of what happened here?",
        "good": "15",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "thesaint921",
        "time": "12 September, 2021",
        "context": "start funding alternative energy and we might have some peace in the Middle East",
        "good": "1",
        "bad": "10",
        "replies": []
    },
    {
        "user_name": "rob..w",
        "time": "12 September, 2021",
        "context": "Joe Clearly didn’t appease them enough.",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "buckaroobob142",
        "time": "12 September, 2021",
        "context": "Nobody trusts this administration...whatever they do or say.  Pack of liars.",
        "good": "12",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "enollava",
        "time": "12 September, 2021",
        "context": "Time to back out of those countries too.  Make sure it is done quickly under the cover of darkness.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "chester_bobb__and_73_others_liked_your_comment",
        "time": "12 September, 2021",
        "context": "American drones that were left in Afghanistan.. OOPSIE OOPSIE.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jsr56569",
        "time": "12 September, 2021",
        "context": "Joe Biden will never recover from 9 months of failed Leadership, Lie after Lie, Broken Promise after Broken Promise, no one will ever believe anything that comes out of Washington. The Biden Administration is a complete Disgrace.",
        "good": "56",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "linsan",
        "time": "12 September, 2021",
        "context": "Wait 'til they buy reliable (US) drones from jojo's taliban....",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "deebuck092",
        "time": "12 September, 2021",
        "context": "If Trump was president the Iranians would not try this. They know The demented coward Josef Talibiden will do nothing.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jimmiejoebobby",
        "time": "12 September, 2021",
        "context": "If Iran runs out of drones maybe they can borrow some of the ones Byedumb gave to the Taliban.",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tb2020",
        "time": "12 September, 2021",
        "context": "and it begins",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bronco100",
        "time": "12 September, 2021",
        "context": "And why is biden not attacking Iran to send a message this is not okay?",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ocso",
        "time": "12 September, 2021",
        "context": "Brought to you by the democrats, the friend to religion of hate",
        "good": "18",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Boneman71",
        "time": "12 September, 2021",
        "context": "I guess Obama's pallets of cash probably funded these weapons",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "matt_koh",
        "time": "12 September, 2021",
        "context": "I wonder is the Iranian drone looked anything like the one they captured from the US.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "AL.Lopez",
        "time": "12 September, 2021",
        "context": "I missed that one. We were told that the U.S. was out of Iraq but it turns out as not true.  Don't know who to believe anymore.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "13thjuror",
        "time": "12 September, 2021",
        "context": "It’s all good in the eyes of Biden’s illegitimate administration, as long as Iranians operated the attack and conducted themselves in professional and business like manner.  ",
        "good": "12",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "thesaint921",
        "time": "12 September, 2021",
        "context": "stop the satanic 666 devil worshiping war machine! ",
        "good": "0",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "breathebeforeposting",
        "time": "12 September, 2021",
        "context": "How much longer do we keep our troops in these ungrateful countries?  I say withdraw and let them fight it out as they have been doing for centuries.  We don't need mideast oil. We have our own resources.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "RecessionsAreConsequential",
        "time": "12 September, 2021",
        "context": "Joe Biden and John Kerry want the US to buy oil from Iran and the Taliban.",
        "good": "12",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "armandofitz",
        "time": "12 September, 2021",
        "context": "Iran wouldn't have those DRONES if it wasn't for Obummer's Stupidity and giving the Terrorists $1.5BILLION Dollars! Imbecile!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "justdotherighting750",
        "time": "12 September, 2021",
        "context": "\"Roughly 2,500 U.S. troops remain in Iraq, with an additional 900 troops in neighboring Syria to make sure the remnants of ISIS stay underground. \"\n\nISIS doesn't need to stay \"underground\" any more.  They have Afghanistan...",
        "good": "41",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "amgc43",
        "time": "12 September, 2021",
        "context": "Thank you George Bush - republicans own this mess.",
        "good": "3",
        "bad": "16",
        "replies": []
    },
    {
        "user_name": "morpheus2000",
        "time": "12 September, 2021",
        "context": "How many innocent children did they get?collateral damage is the term used",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "thomasthepaine769",
        "time": "12 September, 2021",
        "context": "What, no video of Osama Bin Laden ordering the attack?",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "bettertimes973",
        "time": "12 September, 2021",
        "context": "This is why we are there. Fight in their back yard, not ours.",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Flyover734",
        "time": "12 September, 2021",
        "context": "Where the drones a copy of the US drones that Iran got ahold of?",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "yossarian1951690",
        "time": "12 September, 2021",
        "context": "Rumor has it that drug Cartels are no longer selling Drugs ......Drug Cartels are selling their kids finger paintings and throwing in tons of Drugs as a gift ......sounds legal to me",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "FranklyScarlet888",
        "time": "12 September, 2021",
        "context": "FOX & CULT can smell a new war approaching... Conservatives love war... guns.. and killing.",
        "good": "2",
        "bad": "15",
        "replies": []
    },
    {
        "user_name": "FranklyScarlet888",
        "time": "12 September, 2021",
        "context": "Too Bad Biden is president.. if it were a Republican we would be bombing Iran right NOW!!!",
        "good": "13",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "texas_bluebonnet",
        "time": "12 September, 2021",
        "context": "There will be many more like this. Now that Biden has proven how weak, spineless and stupid he is the Iranians and many others are going to start pushing buttons. Biden has already flinched. I fear for Israel.",
        "good": "16",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "hunterlovescrack",
        "time": "12 September, 2021",
        "context": "I think attacks across the world , including the United States is something we have to except . I hope Biden doesn't retaliate and drone attack a school or hospital",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "arkie72015",
        "time": "12 September, 2021",
        "context": "Probably some drones Bidaddy left in Afghanistan ",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "daveburns67",
        "time": "12 September, 2021",
        "context": "After killing an innocent family is Afghanistan less than two weeks ago, I wait for more evidence.  Could have been some school children playing with paper airplanes for all we know.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "thesaint921",
        "time": "12 September, 2021",
        "context": "there is nothing Christian about our government, our military, capitalism or imperialism.",
        "good": "3",
        "bad": "9",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "PurpleTree",
        "time": "12 September, 2021",
        "context": "wouldn't have happened if Trump was still President....",
        "good": "7",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "ondarightside77",
        "time": "12 September, 2021",
        "context": "Remember dims, nothing is free. I'm talking about those stimulus checks.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "yoshi17",
        "time": "12 September, 2021",
        "context": "Just Iran testing out some of the new equipment xiden left for them.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jzs296",
        "time": "12 September, 2021",
        "context": "So why are WE protecting Iraq from Iran?",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "frogman321",
        "time": "12 September, 2021",
        "context": "The Iranian drones were funded by the money Obama gave them.",
        "good": "17",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "yossarian1951690",
        "time": "12 September, 2021",
        "context": "will Iraq be the next to fall?  .......-----Hint----- have Iranian's been buying Hunter Biden's finger paintings?",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dontturnaroundcommissaraocintown",
        "time": "12 September, 2021",
        "context": "When Joe wakes up he will surrender.",
        "good": "12",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "5anddimer",
        "time": "12 September, 2021",
        "context": "I was going to pile on but I see you all have it covered very well, great comments.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "edcurrents",
        "time": "12 September, 2021",
        "context": "Not to be obvious but: Personally I'd avoid flying ANYwhere (Iraq, Iran) on 9/11!  Duh ....",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "en0ughn0w",
        "time": "12 September, 2021",
        "context": "Terrorists can afford drones, bombs, and automatic guns,, and Biden still wants to send them money that will be used to further their nuclear program",
        "good": "16",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "gore'sinternet",
        "time": "12 September, 2021",
        "context": "Back in Nam I used to love the smell of Napalm in the morning.",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "thesaint921",
        "time": "12 September, 2021",
        "context": "why do we have a thousand military bases scattered around the world???",
        "good": "0",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "jimmyd2402",
        "time": "12 September, 2021",
        "context": "Biden's ineptitude and cowardice has emboldened terrorist across the globe. More to come, because you voted for it.",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "JCT208",
        "time": "12 September, 2021",
        "context": "Can anybody explain to me why it's okay that we're still out in Iraq after what 20 years but why we just had to get out of Afghanistan?",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "whoknows?",
        "time": "12 September, 2021",
        "context": "Soon it is going to be our own weapons used against our troops.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "lovin'usa721",
        "time": "12 September, 2021",
        "context": "You can thank your incompetent President for this MESS!\n\nGas, groceries, the open border, Afghanistan American deaths,  reverse racism, lack of respect for the law, dismantling of history, destruction of our cities, crime, lack of respect across the world stage, drugs, unemployment, the economy, influx of disease & crime to this country, mishandling of Covid, chaos in our schools.  \n\nOH YEAH, JOE, WE'RE JUST FINE.\nBUILDING BACK WEAKER.",
        "good": "11",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "bettertimes973",
        "time": "12 September, 2021",
        "context": "How long before drone bomb attacks start here at home? They've been given the entire southern border to come through. Now it's just buy the drones and build their bombs. ",
        "good": "13",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rambolives",
        "time": "12 September, 2021",
        "context": "When are we gonna start protecting our own country from the terrorists in the White House?",
        "good": "21",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "doug10",
        "time": "12 September, 2021",
        "context": "Biden pulls out 2500 troops from Afghanistan that haven't been attacked in over 18 months leaves 2500 troops in Iraq that get attacked regularly do you think it may be so China can have the iron ore in Afghanistan he is so compromised",
        "good": "15",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "SilverWolf441",
        "time": "12 September, 2021",
        "context": "Any Drone launched by Iran or its militia approaches the border it should be immediatly shot down!  Why wait for it to enter another countries airspace???",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "no-way",
        "time": "12 September, 2021",
        "context": "With the flood gates open.......hoping the USA is not on enemies short list......",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "marcus82",
        "time": "12 September, 2021",
        "context": "wonder how many of the drones were the ones we left in afghanistan ",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "capt.zoom",
        "time": "12 September, 2021",
        "context": "Biden has emboldened every enemy of the U.S. He was correct once in his life when he said our darkest days were ahead of us, but what he didn't say was it was because of his administration, not COVID.",
        "good": "22",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "thesaint921",
        "time": "12 September, 2021",
        "context": "there is nothing Christian about our government, our military, capitalism or imperialism.",
        "good": "2",
        "bad": "11",
        "replies": []
    },
    {
        "user_name": "yossarian1951690",
        "time": "12 September, 2021",
        "context": "The Taliban are businessmen as are the Russians, Chinese, Iranians and North Koreans ......The Real Enemies of America are the majority of Legitimate American voters who didn't vote for me .......Joe Biden",
        "good": "6",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "FranklyScarlet888",
        "time": "12 September, 2021",
        "context": "Remember McCain... Bomb, Bomb, Bomb, Bomb Bomb Iran.\nThe Republicans have been itching for a war with Iran for decades...\n\nwell, Republicans want a war with everyone .. even their own government.",
        "good": "2",
        "bad": "9",
        "replies": []
    },
    {
        "user_name": "Jasmine101",
        "time": "12 September, 2021",
        "context": "Tomorrow, we don't want to hear that they shot down a camel caravan by mistake instead of drones with bombs. \nThe soldiers in the US military have to get permission to act from Generals who are more concerned about CRT. Get rid of General Mark Milley.",
        "good": "12",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dallasamemail",
        "time": "12 September, 2021",
        "context": "If this occurred under Trump, we would be sending a strong message to Iran, with bombs against key targets.  I don't want Iranian people killed, their leaders and military, yes.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ncjoe781",
        "time": "12 September, 2021",
        "context": "Payback time.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "lovin'usa721",
        "time": "12 September, 2021",
        "context": "BUILDING BACK WEAKER.",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "FranklyScarlet888",
        "time": "12 September, 2021",
        "context": "Remember McCain... Bomb, Bomb, Bomb, Bomb Bomb Iran.\nThe Republicans have been itching for a war with Iran for decades...\n\nwell, Republicans want a war with everyone .. even their own government.\n\nTrump wanted out of Afghanistan to start a war with Iran...\nWhen your base worships GUNS ... what can go wrong?",
        "good": "3",
        "bad": "14",
        "replies": []
    },
    {
        "user_name": "?cares",
        "time": "12 September, 2021",
        "context": "Testing Biden's resolve and he continues to fail.  Before long we will see front on three different area's, unless Biden and his cronies man up. China will begin taking more aggressive actions against Taiwan, Russia Ukraine, and Iran will hit targets in Iraq and Syria. Someone in this incompetent administration needs to stand up and say enough is enough and hit Iran where it hurts, and start ratcheting up our presence in the Black and South China Seas.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "CommonSense61",
        "time": "12 September, 2021",
        "context": "Let’s stop with the loose accusations and click baiting.  The headline is suspect Iranian-backed militia with Iranian made drones attack airport in Iraq.  If the Iran government or military attacked Americans we would be headed to war.  Oh wait, when senile Joe and the liberal milk toast politicians are out of the majority we’ll stand up for ourselves and go to war. ",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "xan222",
        "time": "12 September, 2021",
        "context": "If the narrative is from the Government, the drones were probably carrying water",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "lovin'usa721",
        "time": "12 September, 2021",
        "context": "Will someone please make this bumper sticker:  BIDEN:  BUILDING BACK WEAKER",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "yoohoo684",
        "time": "12 September, 2021",
        "context": "They got Afghanistan, now working on Iraq.",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "watchoutforspam",
        "time": "12 September, 2021",
        "context": "Hmmmm……2,500 troops remain in Iraq. Well Joey what are you waiting for? Certainly a small contingency of 2,500 troops in Afghanistan (ground zero for terror) would have been a tactical advantage but you left. Why on earth do we have any in Iraq. Come on man.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "fnkneeonmyneck",
        "time": "12 September, 2021",
        "context": "Were they copies of the drone that 0bama gave them?",
        "good": "16",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "keithintexas",
        "time": "12 September, 2021",
        "context": "Would somebody be kind enough to wake Biden up and tell him that Iran is attacking U.S. soldiers...thanks.",
        "good": "23",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "TraitorJoeBiden",
        "time": "12 September, 2021",
        "context": "What did you expect from Joe Biden's Iranian terrorist buddies on 9/11?",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "retiredgunny",
        "time": "12 September, 2021",
        "context": "I thought we abandoned the Kurds….",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Justlisten2016",
        "time": "12 September, 2021",
        "context": "TRUMP 2024!!",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Justlisten2016",
        "time": "12 September, 2021",
        "context": "Iran is a country attacking another county.  Retaliation is warranted.   Biden will retaliate by offering another 1.5 billion if they stop",
        "good": "13",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "mtwallet526",
        "time": "12 September, 2021",
        "context": "So what ? Biden will never respond to the attacks. There may be a paycheck in it for him.",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "qpwoeiruty",
        "time": "12 September, 2021",
        "context": "We will find later they shot down a couple paragliders. And the gliders landed on a family on a picnic.",
        "good": "2",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "meatman884",
        "time": "12 September, 2021",
        "context": "Amazing what pallets of cash can buy these days. Thanks Barrack and Joe!!!",
        "good": "21",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bogeyfree",
        "time": "12 September, 2021",
        "context": "No surprises here, more to follow as the terrorist world has come alive again.  Thank you President Biden, you've convinced them we will do nothing to stop them.",
        "good": "13",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "nevski",
        "time": "12 September, 2021",
        "context": "Seems like the Pentagon war hawks and the Israeli lobby is priming the foolish American up for another war - this time against Iran.",
        "good": "2",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "FranklyScarlet888",
        "time": "12 September, 2021",
        "context": "Don't fret Republicans... you might get a new war to get behind.. because we know how much you care for the Iranian people... just like how much you loved the Afghans.",
        "good": "1",
        "bad": "9",
        "replies": []
    },
    {
        "user_name": "quicksilver337",
        "time": "12 September, 2021",
        "context": "There had to of been a reason to get out of Afghanistan, we are already finding an excuse to attack Iran.",
        "good": "2",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "zerkar",
        "time": "12 September, 2021",
        "context": "Guys as I mentioned before, this is    the beginning of a WAR.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "lovin'usa721",
        "time": "12 September, 2021",
        "context": "He is just difficult to watch anymore.  I DON'T LIKE FAKE, SCRIPTED, COACHED.\nDJT may have shot from the hip at times but he is real and speaks from the heart.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "OliveTooth",
        "time": "12 September, 2021",
        "context": "Thanks for the info i believe everything in digital ink",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "thesaint921",
        "time": "12 September, 2021",
        "context": "there is nothing Christian about our government, our military, capitalism or imperialism. The military industrial complex is Satan's tool 🔥. 666",
        "good": "2",
        "bad": "13",
        "replies": []
    },
    {
        "user_name": "whoknowswho",
        "time": "12 September, 2021",
        "context": "Wait for it..... Next week we’ll find out that what the gov thought were drones were actually civilian planes filled with women and children",
        "good": "7",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "right,always",
        "time": "12 September, 2021",
        "context": "Obviously 2500 troops could have kept the Taliban at bay.\n\nGood job Biden...",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sorossuxs353",
        "time": "12 September, 2021",
        "context": "And to think Obama and Biden paid for those drones.",
        "good": "9",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "whiskeytangofoxtrot1",
        "time": "12 September, 2021",
        "context": "Wow.  2500+.  Wouldn’t that make Iraq the longest US war since troops are still there?",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "overmoon",
        "time": "12 September, 2021",
        "context": "Amazing that Biden wants a agreement with these nuts.  They are trying to kill Americans and our allies.  We shoot down their drones , what if we miss?  It’s not just drones, it’s their whole army and we are sending a message that’s patting them on their backs like they are our friends, amazing.  When they get nukes and it’s soon they will use them treaty or no treaty.  Then it’s to late.  Government by stupid is the Biden plan.  This is only one item , like the rest he has no answers.  ",
        "good": "16",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "darthmaul",
        "time": "12 September, 2021",
        "context": "We need a republican government more than ever...",
        "good": "16",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bigjohnk",
        "time": "12 September, 2021",
        "context": "Attaboy Joe. Keep the middle east screwed up.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Proud2BVirginian",
        "time": "12 September, 2021",
        "context": "So, Joe, what do you think of that? I cannot wait to hear what mealy-mouthed, weaselly and cowardly response to the attack you come up with. I wonder what the over/under is for the number of days before you run away from Iraq with your tail between your legs. I am guessing 10.",
        "good": "15",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "penn43",
        "time": "12 September, 2021",
        "context": "Wait until they start attacking targets with all of the equipment useful idiot Biden left behind in Afghanistan",
        "good": "16",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Middleman236",
        "time": "12 September, 2021",
        "context": "Novel Idea, keeping a small contingency of troops there to thwart terror groups and protect the fledgling govt.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "jo48",
        "time": "12 September, 2021",
        "context": "Hey, Joe, here's another opportunity to cut and run, leaving people and weapons abandoned. I think I hear Obama advising you to do that now.",
        "good": "16",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "TomTaylor3306",
        "time": "12 September, 2021",
        "context": "The only argument or thesis on the Democrats disastrous pull out was that somehow Trump was to blame. No one with an ounce of honesty believes that but it’s the only defense they can muster, pathetic!",
        "good": "15",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "davetoyou",
        "time": "12 September, 2021",
        "context": "I don’t believe ANYTHING this feckless lying admin. says about anything… 🤬.   They’re caught in lies EVERYTIME they open their mouths !  RESIGN FOOL !🙄",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "farm1",
        "time": "12 September, 2021",
        "context": "In response, the Whitehouse promptly informed the Iranians that another load of palletized cash has been dispatched to Iran.",
        "good": "12",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "moe.bandy",
        "time": "12 September, 2021",
        "context": "Barry gave Iran our drone technology and BIDEN fully armed the Taliban.  Improving The Democrat legacy continues.",
        "good": "18",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "__JOHN__",
        "time": "12 September, 2021",
        "context": "The Iranian airport in Tehran should be taken down, they may think twice if their runways are full of holes for a few months.",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "historian326",
        "time": "12 September, 2021",
        "context": "Time for an Iranian Rubber Ducky Small Boat Squadron vs U. S. Navy Water Festival!",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "oldmanmac",
        "time": "12 September, 2021",
        "context": "How could any administration be so inept, so incapable of rational decisions, so anxious to arm the people who want to destroy us...using our own weapons that we happily gave them to use...Trump is impeached for a phone call? This administration has made the worst move in the history of the United States. Suppose we had politically tired of WW2, left the Mariana Islands and left behind our brand new atomic bomb. Do you think Japan would have turned over a new leaf and become the good guys, like the Taliban claims? Thank God Biden and his band of fools wasn't president in 1945.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "PurpleTooth",
        "time": "12 September, 2021",
        "context": "For claiming to be a Godly man,  Biden has obviously never picked up a Bible in his life.  He is playing right into the end days scenario. America is not mentioned in the end days. Only Muslim nations and Israel. Don't worry for Israel. She still and forever has God's blessings and will be victorious in the end.  America has lost God's blessing and protection. God is a gentle man. Where He is not wanted, He quietly leaves, taking His blessings, love,, and protection with Him..  This admin needs to stop the stupidity. They will be our undoing.\nAnd for you haters...save it....you cannot touch us who believe with your hateful words",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "FranklyScarlet888",
        "time": "12 September, 2021",
        "context": "Does Biden have to clean up another Republican mess?",
        "good": "0",
        "bad": "22",
        "replies": []
    },
    {
        "user_name": "FranklyScarlet888",
        "time": "12 September, 2021",
        "context": "Hasbara.. the voice of the republican party on FOX... is gonna love this",
        "good": "0",
        "bad": "8",
        "replies": []
    },
    {
        "user_name": "CountK",
        "time": "12 September, 2021",
        "context": "Joey TaliBiden will apologize to Iran immediately and then ship billions of dollars to them in private jets in the middle of the night.",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "FranklyScarlet888",
        "time": "12 September, 2021",
        "context": "Does Biden have to clean up another Republican mess?",
        "good": "0",
        "bad": "15",
        "replies": []
    },
    {
        "user_name": "EGH",
        "time": "12 September, 2021",
        "context": "What do U expect-this is Islam. Islam is pure evil. Iran is an Islamic country.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "FranklyScarlet888",
        "time": "12 September, 2021",
        "context": "Bone Spur 2024!!!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "quicksilver337",
        "time": "12 September, 2021",
        "context": "The Simple Minded calling for another war is good, for China and Russia. When we go completely broke China and Russia can take our spot as World Leaders.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "BetweenTheEars",
        "time": "12 September, 2021",
        "context": "Comes courtesy of Obama and his funding of a terrorist state",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "IQ168-plus",
        "time": "12 September, 2021",
        "context": "And urkel, using American taxpayer dollars, gave iran BILLIONS OF US DOLLARS to build those drones.  Thanks, urkel and the dims!  Working 24/7 to destroy the USA.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "johndoeii085",
        "time": "12 September, 2021",
        "context": "Hit Iran, in Iran. End their proxy wars. Destroy every IRGC base, oil refinery, pipeline,  well, fighter jet, all known Nuclear facilities and their reactors as well. Make Iranians regret they ever welcomed their grade school educated Ayatollahs. That's the war Iran deserves!",
        "good": "13",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "thesaint921",
        "time": "12 September, 2021",
        "context": "90% of fox news commenters have the devils stamp behind their ears.  Everyone look and see! 666",
        "good": "0",
        "bad": "13",
        "replies": []
    },
    {
        "user_name": "stromberg7",
        "time": "12 September, 2021",
        "context": "... and we did what about this?",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "HurleyHayekSandwich",
        "time": "12 September, 2021",
        "context": "Is this more wag the dog after the droning murder of an aid worker delivering water in Afghanistan?",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "EFG84",
        "time": "12 September, 2021",
        "context": "I bet Obama is not too happy that Iran wasn't successful. ",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "quicksilver337",
        "time": "12 September, 2021",
        "context": "Simple Minded, any country that goes into a war and let's that war last 20 years should never ever start another war ever again. We have basically lost every war we have been in since the Corporate Rules for War started, Corporate needs wars to last for many, many years in order to make the big money. If you really want more wars then have real wars.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "thinkitbuildit",
        "time": "12 September, 2021",
        "context": "Biden is the Devil In Disguise, maybe the Anti-Christ,\n   so many terrorist have been waiting to unite for. \n       Single handed he will bring down the democracies of the World\n    if allowed to keep up this rampage against World Democracy.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "quicksilver337",
        "time": "12 September, 2021",
        "context": "Here is what we should do, take a poll and see who wants a war with Iran and who doesn't. The ones who do, we can ship over there to save those poor people from their evil leaders.",
        "good": "1",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "stevola",
        "time": "12 September, 2021",
        "context": "The American soldiers who shot down the drones come from the video game generation, it has real world applications in this case and paid off.  And to think Xi banned kids from playing video games in china, except for a couple hours on weekends.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "liberaser",
        "time": "12 September, 2021",
        "context": "\"Most Republicans want Trump back as GOP leader\" source Credibility Never News! Right now, any warm and still breathing Conservative Works! Trump / 2024",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "missmoxie",
        "time": "12 September, 2021",
        "context": "Lives don't Matter in that part of the world.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "IjuzFahted",
        "time": "12 September, 2021",
        "context": "Really?  Or did it kill innocent people like the last drone strike this administration bragged about?",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "GoldBulb",
        "time": "12 September, 2021",
        "context": "Biden!  You were told this was coming.  Iran see Biden and America's Liberal Democrats and Military leadership as week.  Even scared to defend or attack enemies attacking us.  It's going to get worse and you can trace it all back to the weakness of the American puppet president Biden.  I said this back in January, Iran will move on the Middle Eastern Countries, China will move on Asian countries, Hong Kong, Taiwan, will go first, North Korean will move on Japan and South Korea, and Russia will move on Ukraine and Europe.  Like it or not America is here to fight evil in the world.  So far we aren't doing so.  You don't always have to send troops.  If you show strong leadership and unity people respect and fear you.  Biden is not feared or respected.  You voted for Biden and Liberal Democrats because you had your feeling hurt when Trump put Americans First.  WOW!  How are your feelings?",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tiffne",
        "time": "12 September, 2021",
        "context": "AND BIDEN WONT DO A DAMN THING ABOUT IT ! !\n\nWell, he might use a drone attack to kill some nobody so the leftwing media can hype up \"Biden's strong response.\"\n\nSimilar to the nobody isis member he killed in Afghanistan. You know \"the isis planner,\" a guy who wasn't on a single US military, Intelligence agency or government kill list.\n\nLuckily the left elected a \"strong, competent & adult president.\" LOLOLOLOLOLOLOLOLOLOL",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "thesaint921",
        "time": "12 September, 2021",
        "context": "Satan runs the US military and has for a long time.  Wake up people!",
        "good": "0",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "MotoJoe470",
        "time": "12 September, 2021",
        "context": "U.S. shoots down Iranian drones? \nU.S. is more likely now shooting down US made drones launched from Iran.\nI'm sure Psaki can be trusted to give us an accurate update on this.",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "briansmith502",
        "time": "12 September, 2021",
        "context": "Dont worry obiden will send Iran a plane load of cash to behave again",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "oldmanb78",
        "time": "12 September, 2021",
        "context": "Biden loves Iran, hell he gave them $150 billion in cash to be nice. They wouldn't do that...",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bringbackjfk",
        "time": "12 September, 2021",
        "context": "We ALL know that Trump would respond with missile strikes inside Iran or maybe take out another top Iranian General. Should I hold my breath waiting for the Biden response??? Will he fly in more pallets of cash so that they will play nice?",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "FranklyScarlet888",
        "time": "12 September, 2021",
        "context": "Hasbara.. the demonic voice of the republican party on FOX... is gonna love this",
        "good": "0",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "mysticdon844",
        "time": "12 September, 2021",
        "context": "Time to drone Iran",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Patriotparty2024",
        "time": "12 September, 2021",
        "context": "I want Trump back!  He'd have taken care of the Talibans in about 10 seconds as soon as he walks in the office.  He'd have ordered attack which I am for.   As long as these people vote Biden, Obamas, and the Clintons, you may as well kiss our country good bye.",
        "good": "13",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "charterboatrow",
        "time": "12 September, 2021",
        "context": "Bumbles will be giving a speech about this. All of his speeches remind me of Reverend Jim of \"Taxi\" when he took his drivers test. \"What......does......the .......yellow......light......mean......?\"",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "coupe1942",
        "time": "12 September, 2021",
        "context": "Under a less cowardly Commander In Chief, Iran would be held fully accountable for this act & not be given any free pass. It would be done immediately and with full force, too. Don't expect such to happen with Biden in charge of our military as Commander In Chief though. He is too deep into the pocket of Iran in trying to bargain and broker a deal to keep them from gaining a nuclear armament. His failed leadership is too ingrained to be changed at this point & we will indeed be lucky if he is not the cause of the loss of more lives of Americans & of our allies by his cowardly actions. They all know our weakness with Biden in charge, so expect them to exploit it rapidly and with full force as an opportunity for themselves. America deserve better from a president than what Biden has done. God bless our troops and those of our allies who defend life, liberty and freedom in the world. God bless America & God bless Texas!",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "poohpeebritches",
        "time": "12 September, 2021",
        "context": "looks like the United States gave everyone freedom with 90 billion dollars worth of weaponry... God help us all",
        "good": "10",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "pinktacolover469",
        "time": "12 September, 2021",
        "context": "Just a matter of time before we start getting attacked here in the US.\nThe wide open border poilicies that Creey Joe has provided for terrorists to enter our country will be the root cause of them I'm sure",
        "good": "15",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "GreenCloud",
        "time": "12 September, 2021",
        "context": "This board is so much more fun with the CRAMPS playing in the foreground.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "smithwesson565",
        "time": "12 September, 2021",
        "context": "Drones bought with Obam’s money from the palets.",
        "good": "14",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ndayebanya9",
        "time": "12 September, 2021",
        "context": "What is glaringly missing from this report is what steps the US plans to take that will discourage Iran from repeating these attacks.  Dim Joey plans to write a strongly worded letter.",
        "good": "21",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mitmouse",
        "time": "12 September, 2021",
        "context": "The world is scoffing at the US … it is clear to everyone (except for the ones who voted for this imbecile and his MSM “flying monkeys”) that this administration will do nothing other than throw out some garbled platitudes and “no-answer” answers",
        "good": "9",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "IQ168-plus",
        "time": "12 September, 2021",
        "context": "The dims regard the military as social workers.  It is no wonder that the military performs like social workers when dims are in power.  \"The gang that can't shoot straight.\"",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mrhearsay",
        "time": "12 September, 2021",
        "context": "Does anyone really believe that Biden, Harris, Austen and Milley are an effective deterrent for our enemies?  Deep down even Democrats question whether those people will be able to protect the US.",
        "good": "46",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "GreenCloud",
        "time": "12 September, 2021",
        "context": "I`d like to hear the Russian`s take.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "hppyhippi574",
        "time": "12 September, 2021",
        "context": "Here is a toast to Charles the Hammer Martel",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Ironic",
        "time": "12 September, 2021",
        "context": "In the worst defeat since the Civil War, Biden hands the Taliban another victory by treating Americans like criminals while giving out foreign aid to the Taliban.",
        "good": "24",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "FranklyScarlet888",
        "time": "12 September, 2021",
        "context": "What will the Israeli insider Mark Levin say about this!!!!!!!!\n\nDon't tell me... send in the troops!!!",
        "good": "0",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "mazchaz",
        "time": "12 September, 2021",
        "context": "So why are we worried about ISIS but not worried about the Taliban and Al Quida ?  Could it be because Iraq has oil wells and Afghanistan does not.",
        "good": "2",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "Veritas/Aequitas",
        "time": "12 September, 2021",
        "context": "So Weak, Impotent, Illegitimate Joe Biden….. an attempt was made to kill US troops at Erbil. What are you going to do about it?",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "GreenBug",
        "time": "12 September, 2021",
        "context": "This is a direct challenge to our resolve as a Nation. The world knows we have been criticized for bailing on the Kurds before. What will Joe & the Boys do. After they have a good cry & group hug that is.",
        "good": "28",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "hunterslaptop007",
        "time": "12 September, 2021",
        "context": "Speaking of which…has Joseph Robinette Biden resumed nuclear talks with his buddies in Tehran yet?",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "kelder",
        "time": "12 September, 2021",
        "context": "Biden may not notice. He's too busy trying to figure out how to turn American citizens into American serfs.",
        "good": "12",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "OH4Trump",
        "time": "12 September, 2021",
        "context": "Yeah, the Muslim fight will be in the United States once again.",
        "good": "12",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "doug10",
        "time": "12 September, 2021",
        "context": "took the trolls long enough to warm up",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "quicksilver337",
        "time": "12 September, 2021",
        "context": "I bet all of these people calling for another war, would change their minds quickly if they were the only ones sent to fight it. If you feel the need to help and protect Muslim Countries, then you should move over there and do so, that will be a big win for America too.",
        "good": "2",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "mikeoscar",
        "time": "12 September, 2021",
        "context": "Iran was able to build there drones from money and info supplied by the Obama admin",
        "good": "16",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sydney335",
        "time": "12 September, 2021",
        "context": "Throw fat donny behind BARS for releasing 5,000 Taliban terrorists!!!",
        "good": "1",
        "bad": "21",
        "replies": []
    },
    {
        "user_name": "grafelfing799",
        "time": "12 September, 2021",
        "context": "Speaking of airports I'm amazed no Generals or Admirals resigned when Biden and the State Dept insisted Bagram Air Base be prematurely abandoned. I can understand the Chairman General Milley not resigning he's says he's 'woke', but what about the rest?",
        "good": "8",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "FranklyScarlet888",
        "time": "12 September, 2021",
        "context": "Hasbara.. the demonic voice of the republican party on FOX... is gonna love this",
        "good": "0",
        "bad": "10",
        "replies": []
    },
    {
        "user_name": "FranklyScarlet888",
        "time": "12 September, 2021",
        "context": "Biden does not have time to clean up another Republican blunder",
        "good": "0",
        "bad": "21",
        "replies": []
    },
    {
        "user_name": "Gunbuyerme",
        "time": "12 September, 2021",
        "context": "So, standby for the next set of attacks coming from U.S. drones and U.S. rockets. Biden, building back terrorists better.",
        "good": "12",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "thesaint921",
        "time": "12 September, 2021",
        "context": "defund the military industrial complex",
        "good": "2",
        "bad": "12",
        "replies": []
    },
    {
        "user_name": "oif_cav_doc",
        "time": "12 September, 2021",
        "context": "If Iran is attacking American forces, why is there no retaliation??  Hmmm are the drones really from Iran??  Need that boogeyman",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "artsong",
        "time": "12 September, 2021",
        "context": "Time to \"Drone\" out Iran. Of course the puppeteers wouldn't let the \"Wizard of DC\" ever do such a thing.",
        "good": "14",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "boydsharp",
        "time": "12 September, 2021",
        "context": "Hey Iran how about a little appreciation? We left you a few thousands targets to practice on didn't we?",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "thesaint921",
        "time": "12 September, 2021",
        "context": "how about stop driving gas guzzling jacked up pickup trucks and we won't be dependent upon Middle East oil?",
        "good": "1",
        "bad": "18",
        "replies": []
    },
    {
        "user_name": "speedlover99",
        "time": "12 September, 2021",
        "context": "there are rumors joe is still with us...\n\nbut he proves that a lie every time he speaks!",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "alexjonesisright",
        "time": "12 September, 2021",
        "context": "these guys shoot down their own drones to make them self's look good to distract from 13 dead 100's missing",
        "good": "6",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "thesaint921",
        "time": "12 September, 2021",
        "context": "Jesus wouldn't support a thousand military bases.",
        "good": "0",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "Chupacabra15",
        "time": "12 September, 2021",
        "context": "Why didn’t we keep the military base in Afghanistan?  ",
        "good": "11",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "OrangeBoomerang",
        "time": "12 September, 2021",
        "context": "Why would they stop that? The savages are doing the world a favor and taking themselves out. Don’t stop that encourage it. Offer a reward for any savage that kills other savages.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "right,always",
        "time": "12 September, 2021",
        "context": "Once again our enemies see how weak and stupid Biden is, so they are pushing the envelope. ",
        "good": "16",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "-adam",
        "time": "12 September, 2021",
        "context": "What are you waiting for Biden!? Iranian regime is attacking you.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "TalErickson",
        "time": "12 September, 2021",
        "context": "Iran probably used one of our drones left behind in Afghanistan by. Joe Biden. ",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "thesaint921",
        "time": "12 September, 2021",
        "context": "defund Israel!",
        "good": "0",
        "bad": "12",
        "replies": []
    },
    {
        "user_name": "thesaint921",
        "time": "12 September, 2021",
        "context": "when will Christians admit they truly are fascists?",
        "good": "0",
        "bad": "16",
        "replies": []
    },
    {
        "user_name": "thesaint921",
        "time": "12 September, 2021",
        "context": "there is nothing Christian about our government, our military, capitalism or imperialism.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "curtisb1776",
        "time": "12 September, 2021",
        "context": "A tactical small nuclear weapon would end the Iranian attacks. Big stick, not kid gloves.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "beachbumct",
        "time": "12 September, 2021",
        "context": "Like Israel.. when they send 2 drones, you send 5 cruise missiles into their military airport bases",
        "good": "8",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "FranklyScarlet888",
        "time": "12 September, 2021",
        "context": "What will the Israeli insider Mark Levin say about this!!!!!!!!\n\nDon't tell me... send in the troops!!!",
        "good": "2",
        "bad": "11",
        "replies": []
    },
    {
        "user_name": "thesaint921",
        "time": "12 September, 2021",
        "context": "how about stop funding Israel? hell they have free healthcare and we don't which we pay for! makes sense to me",
        "good": "1",
        "bad": "11",
        "replies": []
    },
    {
        "user_name": "GoldPumpkin",
        "time": "12 September, 2021",
        "context": "“C-RAM” isn’t that what Biden just gave to the Taliban alongside hundreds of thousands of other US Military items?",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "commoncents69",
        "time": "12 September, 2021",
        "context": "Come on Man, Iran is just JV.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Gunfighter",
        "time": "12 September, 2021",
        "context": "I saw this coming. With Biden's disastrous withdrawal from Afghanistan, and his senility apparent, America's adversaries smell blood in the water. Look for them to attack or take advantage of Biden's weakness. Iran, North Korea, China, Russia, they will all be more aggressive because they know that the cowardly Biden won't do anything. Bet on the Chinese retaking Taiwan soon, and despite security agreements, Joe will sit back and do nothing.",
        "good": "7",
        "bad": "1",
        "replies": []
    }
]