[
    {
        "user_name": "bonespur322",
        "time": "7 September, 2022",
        "context": "So did Trump's boy Billy Barr, his attorney general.\n Just another Trump stall tactic.",
        "good": "3",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "ProudMAGAsupporter,proudAmerican.",
        "time": "7 September, 2022",
        "context": "Yes, Republicans are a serious threat to the Democrats, alright.",
        "good": "24",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "blewsea",
        "time": "7 September, 2022",
        "context": "Whiners came forward big time after the ruling. It's funny!",
        "good": "22",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Mr.Comment",
        "time": "7 September, 2022",
        "context": "\"Trump Trump Trump Trump Trump and Trump and then Trump\"\n-Liberal media. ",
        "good": "10",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Theinfidel",
        "time": "7 September, 2022",
        "context": "Let them cry .... Tds is wonderful . ",
        "good": "55",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "divid",
        "time": "7 September, 2022",
        "context": "Why is it that Democrats hate the thought of Making America Great Again? It’s very bizarre indeed ",
        "good": "48",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "NASCARFlagEagleDana60Raptor",
        "time": "7 September, 2022",
        "context": "Mar A Lago is the most secure compound in the world. Only a rando with $200K can enter.",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "catan",
        "time": "7 September, 2022",
        "context": "The left wing media just hates Trump but yet without him nobody would be watching their shows. ",
        "good": "44",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "bedrqqmiii",
        "time": "7 September, 2022",
        "context": "Why do all of todays liberal politicians look like they’re out of the alien Cantina from the original Star Wars movie?",
        "good": "10",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "EverythingisaHoax",
        "time": "7 September, 2022",
        "context": "Trump paid for a recount of the Arizona election and lost by even more. Similar will happen here. He won't be able to call it a cover up even though there's photos. ",
        "good": "0",
        "bad": "14",
        "replies": []
    },
    {
        "user_name": "flyintheointment808",
        "time": "7 September, 2022",
        "context": "It's hilarious that Fox doesn't realize there are other countries on Earth with news organizations saying EXACTLY the same thing. I guess if you try to smear the entire world at the same time it gets a little tricky and unbelievable, more unbelievable.",
        "good": "3",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "flyintheointment808",
        "time": "7 September, 2022",
        "context": "Someone's going to jail for stealing national secrets and it ain't Biden lol",
        "good": "1",
        "bad": "11",
        "replies": []
    },
    {
        "user_name": "yesiamincaseurinterested",
        "time": "7 September, 2022",
        "context": "FPOTUS knows if he whines loud enough and insinuantes violence, he'll get special treatment just like he got here.",
        "good": "4",
        "bad": "8",
        "replies": []
    },
    {
        "user_name": "yashar",
        "time": "7 September, 2022",
        "context": "Oh no, something didn't go as democrats wanted again? ",
        "good": "115",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "Gforce1965",
        "time": "7 September, 2022",
        "context": "The real question is - Why is the DOJ, FBI, and Democrats so afraid of having a 3rd party (Special Master) be in the same room as documents are reviewed? Although, by now any documents they wanted have already been reviewed, photos taken, documents falsified, and the evidence has been planted much like the Russian dossier.",
        "good": "218",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "districttwelve",
        "time": "7 September, 2022",
        "context": "They are like RABID !!!",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "PATRIOTGAMES77777",
        "time": "7 September, 2022",
        "context": "The appointment of the Special Master is clearly a Win for the Trump Team. That is to be applauded. But we really need to look at what the DIMS are doing. They are attempting to divert our attn away from Creepy Joe's failures as President and the ruination of the US Economy happening right before our eyes. Record High inflation still stands at 8.5%, PPI at 12%, gas prices still double of that when Trump was President and food costs up 25%. America is suffering and Creepy Joe is trying to hide it. DO NOT ALLOW THIS. All GOP candidates need to sync-up with one voice to point out the : 1. Bad Economy 2. Skyrocketing energy costs coming with Europe plummeting into depression and 3. The Mexican border crisis letting in 20 Million Illegals bringing crime, drugs, disease and clogging up our healthcare, healthcare that we pay for. Let's get a single message going GOP and kick out these fools at MID TERMS.\nTRUMP 2024",
        "good": "18",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "drob551",
        "time": "7 September, 2022",
        "context": "The judge probably got paid off by your master trump. He'll still go to jail though. Wonder what his prisoner number will be.",
        "good": "1",
        "bad": "8",
        "replies": []
    },
    {
        "user_name": "leppaludi",
        "time": "7 September, 2022",
        "context": "They played their racism card to death. Now they've done the same with their Trump/MAGA/democracy destroying card. At this point I couldn't care less what he is guilty of, the alternative is worse. ",
        "good": "75",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "mack79",
        "time": "7 September, 2022",
        "context": "Fox News, you did the same. You had Bill Barr posts earlier. You’re just as guilty for this then other orgs. ",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "tomjoyce815",
        "time": "7 September, 2022",
        "context": "Joy D Reid is not qualified to assess a single thing. ",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "john.lee.pettimore",
        "time": "7 September, 2022",
        "context": "The DOJ and the FBI just lost their fraudulent case.",
        "good": "8",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "BrentTheMiller",
        "time": "7 September, 2022",
        "context": "The truth about this matter will come out soon enough, whatever that may be.\nHopefully not the classified truth that Trump took home with him though.",
        "good": "3",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "clearview",
        "time": "7 September, 2022",
        "context": "Why does the left fear an independent review so much???\nWhat are they hiding this time???",
        "good": "35",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "imhereforthelulz440",
        "time": "7 September, 2022",
        "context": "So we're just ignoring the current top story on the Google News feed tonight?  Cool, cool.  LOL.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "simple-icare",
        "time": "7 September, 2022",
        "context": "Well, now what?  ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "I❤️Liberty941",
        "time": "7 September, 2022",
        "context": "It’s hilarious that NONE of these pundits can see the hypocrisy with Hillary, Bill, Joe, Hunter, and countless others. I’m good with accountability and transparency…it MUST go both ways.",
        "good": "20",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "wise-man-said",
        "time": "7 September, 2022",
        "context": "And? Legal analysts appear to be appalled by the poor quality of the opinion. Former U.S. acting solicitor general Neal Katyal called it “so bad it’s hard to know where to begin.” Law professor Stephen Vladeck told Charlie Savage of the New York Times that it was “an unprecedented intervention…into the middle of an ongoing federal criminal and national security investigation.” Paul Rosenzweig, a prosecutor in the independent counsel investigation of Bill Clinton, told Savage it was “a genuinely unprecedented decision” and said stopping the criminal investigation was “simply untenable.” Duke University law professor Samuel Buell added: “To any lawyer with serious federal criminal court experience…, this ruling is laughably bad…. Trump is getting something no one else ever gets in federal court, he’s getting it for no good reason, and it will not in the slightest reduce the ongoing howls that he’s being persecuted, when he is being privileged.\"",
        "good": "1",
        "bad": "11",
        "replies": []
    },
    {
        "user_name": "AlmostlastRepublicaninSeattle",
        "time": "7 September, 2022",
        "context": "And where’s Hillary’s judge?  Corruption?  Where’s Hunters’s judge already?  Who will be Fauci’s judge? \nIf you want to talk about equal justice for all, let’s start with those 3.  ",
        "good": "12",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "nothingbuta",
        "time": "7 September, 2022",
        "context": "Some guests on Fox News also questioned the ruling!  Barr and McCarthy come to mind! ",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "digby57",
        "time": "7 September, 2022",
        "context": "If there's nothing to hide or underhanded , what's one more set of eyes gonna change.  My two cents.",
        "good": "37",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "flyintheointment808",
        "time": "7 September, 2022",
        "context": "Must be very lonely knowing everyone else hates you",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "freedomwins00",
        "time": "7 September, 2022",
        "context": "Trump is the master. Blacks need to accept that and start shining.",
        "good": "1",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "bobwolfe",
        "time": "7 September, 2022",
        "context": "Considering the quality of their journalism, watching an ice cube melt would be more informative. ",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ProudMAGAsupporter,proudAmerican.",
        "time": "7 September, 2022",
        "context": "The Biden-voting TDS cult is a threat to Democracy and to the Democrat Party inself.",
        "good": "11",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "dvnc.",
        "time": "7 September, 2022",
        "context": "The ones that are terrified of an outsider reviewing the facts are clearly the corrupt ones. The FBI just had a TOP official resign for covering up the Hunter Biden Laptop because TWENTY of his fellow agents had to expose him. The Russian Collusion Hoax ended with an FBI agent serving time in jail for falsifying evidence to initiate the entire investigation.  We do NOT trust these agencies anymore. A 3rd party is 100% needed.",
        "good": "37",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "flyintheointment808",
        "time": "7 September, 2022",
        "context": "Hopefully Trump's lawsuits all converge at the same time and he gets done for tax fraud, national secret stealing, election tampering and kiddie fiddling. Let us pray.",
        "good": "5",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "static76",
        "time": "7 September, 2022",
        "context": "why don't these wonderful journalists probe Hunter Biden..  Inquiring minds want to know..",
        "good": "14",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "tallrightguy",
        "time": "7 September, 2022",
        "context": "Unless or until even one Democrat is raided or  spends even one day in prison this outrageous hypocrisy will not stop. Democrats honestly believe that since Republicans are always charged and convicted they’re obviously all guilty while Democrats are obviously innocent!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "UrbanMyth",
        "time": "7 September, 2022",
        "context": "“Trump judges do not believe in the rule of law, they do not believe in precedent, they do not believe in facts, they do not believe in logic—they just believe in whatever’s going to help Donald Trump, and they’ve proven it again and again and again.\"     And we don’t believe ANYTHING reported by the MSM or their mouthpiece clowns on air.🤡",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "C4BangaloreSapper",
        "time": "7 September, 2022",
        "context": "If Trump wiggles his way out of this one, just remember, it’s okay for the opposing party to do the same. \n\nLet’s not pretend that if he were a Democrat favored President that you’d all be calling for his head, okay?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Oldandfedup1308",
        "time": "7 September, 2022",
        "context": "The soon to be vanquished libs are literally running around with their hair on fire screaming at the sky! It just warms my heart although I don’t think that their hearts will withstand seeing the constitution actually applied correctly. ",
        "good": "85",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "flyintheointment808",
        "time": "7 September, 2022",
        "context": "Dear lord, please strike down the orange antichrist with fast and painful disease.",
        "good": "1",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "Tigerwal586",
        "time": "7 September, 2022",
        "context": "The Democratic Party and the MSM are one and the same!",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "riobeachcasa1641",
        "time": "7 September, 2022",
        "context": "Joe Biden complains about MAGA Republicans. Then says nothing about the media who are the ones fanning the fire!",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "llightwine613",
        "time": "7 September, 2022",
        "context": "So how many blacks have blond hair?  Isn't Joy culture appropriating?  She should be ashamed of herself and removed from her job this very minute.  Was that woke enough for everyone?  He He He  TDS is very much alive and well on the left.  They are afraid of Trump and the right ideas they will do nothing to stop it.",
        "good": "13",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "trumpisaloser241",
        "time": "7 September, 2022",
        "context": "trump just prolonging the inevitable ",
        "good": "2",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "whitesoxfan",
        "time": "7 September, 2022",
        "context": "where's Hunter 😂😂😂😂😂 November 8th is coming after you!!!! who is that cotton head on MSDNC",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Gullible_Gomer,MAGA",
        "time": "7 September, 2022",
        "context": "Anyone see the fake electors in Georgia?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "KKK4TRUMP",
        "time": "7 September, 2022",
        "context": "Trump here. Trump there. Trump everywhere.\nLiberals wish is talking about Trump until November.",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "donniedouchebag713",
        "time": "7 September, 2022",
        "context": "According to repigTV.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "kolv91",
        "time": "7 September, 2022",
        "context": "6 Corporations Control 90% Of The Media In America. They have big businesses in China. And they know the Trump' position toward China. ",
        "good": "12",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "straightwhitechristianmale",
        "time": "7 September, 2022",
        "context": "They're scared!!!!!! 😆 🤣 😂 ",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "CanadianElite691",
        "time": "7 September, 2022",
        "context": "How does it feel realizing the \"man\" you made your master and personal savior is a proven traitor and spy? No one can deny this straight up fact. Do yo feel gullible? Intellectually vulnerable? Like you can be fooled by just about everyone?",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "sisterknowitall",
        "time": "7 September, 2022",
        "context": "They are worried about ethics with the likes of Biden his son Hunter, Hillary, the list for her is too long.. her trustworthy husband, Nancy and her husband that get special info on markets that have made them ultra rich.  These people run our country.  ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "handyman12",
        "time": "7 September, 2022",
        "context": "So, a judge ruling to have a neutral special master to review the documents seized in a raid with a general warrant (possible Forth Amendment violation) is considered corrupt by liberals.  However, liberals don't see the failure to prosecute Hillary Clinton or Hunter Biden as corrupt.",
        "good": "21",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "KKK4TRUMP",
        "time": "7 September, 2022",
        "context": "Big news??????? Republicans were attacking the judge who issued the search warrant.\nPolitics and more politics.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "aleaf",
        "time": "7 September, 2022",
        "context": "is that you? Bc God is on Trump side always .",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "aerionflux",
        "time": "7 September, 2022",
        "context": "61 days libs, then it's all over but the sky screamin'.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "noninja2",
        "time": "7 September, 2022",
        "context": "Dim libs will never reach adolescence; they've yet to outgrow the terrible twos. Maybe if they stopped throwing tantrums it might help them mature, though that may be too much to hope for. ",
        "good": "17",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "marlboroman1872",
        "time": "7 September, 2022",
        "context": "Looks like the corrupt DOJ & corrupt FBI are about to get their fake criminal investigation exposed, just like the fake Russian Collusion Investigation and the fake Jan 6th investigation and the 2 fake impeachment attempts. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "trmpdrnkspee",
        "time": "7 September, 2022",
        "context": "So you all think it's cool for TFG to sell nuclear secrets to the highest bidder?",
        "good": "0",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "AccessDenied343",
        "time": "7 September, 2022",
        "context": "Is it possible that since Billy Bob Clinton not a single democrat has ever, NEVER done anything illegal? And when they do get caught red handed they get no more than a harmless slap on the wrist. Yeah, nothing biased there.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jmejrs",
        "time": "7 September, 2022",
        "context": "They can blame their own beloved FBI and DOJ for failing to assemble and employ a taint team on the day of the raid.  If they had don that, there would have been no need for a Special Master.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "johnn707",
        "time": "7 September, 2022",
        "context": "CNN and MSNBC are filled with hate for Trump. plus Reid is one of the many reporters America could do without. Her lies, false accusations, vitreous rhetoric and hate  for everything Republican is THE cause for the ever widening division of our nation. Their “news reports” are vicious, unAmerican and extremely dangerous causing parties on both sides to arm themselves and attack those on the other side. Divisive news reporters should be expunged off the networks and in some case jailed for inciting violenc",
        "good": "13",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Nunyabizness556",
        "time": "7 September, 2022",
        "context": "Back in the 2014, Atty General of the United State Eric Holder was found in contempt of Congress by refusing to hand over documents related to Operation Fast and Furious. A federal judge, Amy Berman Jackson, who was promoted by Barack Obama, declined to have Holder held in contempt and jailed. Folks this is always going to be a you scratch my back and I’ll scratch yours system. The panel hosts can complain all they want but the Democrats have had their cake in the past as well.",
        "good": "13",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "brian420",
        "time": "7 September, 2022",
        "context": "Get used to it LIBS, Trump is going to walk on this ridiculous invasion of his privacy...but the tables turn in November and the Biden criminal family is going to get its comeuppance!",
        "good": "19",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cquagmire625",
        "time": "7 September, 2022",
        "context": "\"Trump—he always looks at things as my or mine. My generals, my Kevin, my classified documents, my judges.\"\n\nReally Joy?\n\nKinda like Obama. \n\nMy cabinet, my plan, my son, my....\n\nThe hypocrisy ",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bareshelvesbiden",
        "time": "7 September, 2022",
        "context": "Democrats saying Trump is getting special treatment. Now that's hilarious. ",
        "good": "19",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "notdrinkingthecoolaid308",
        "time": "7 September, 2022",
        "context": "If someone gave me a job for life, I would be grateful.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "StutkaAce",
        "time": "7 September, 2022",
        "context": "As POTUS he had the power to \"De-Classify\" documents, nothing to see here! ",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "johnn707",
        "time": "7 September, 2022",
        "context": "there does not appear to be any policy to end record inflation. Most polls say that we’re worse off than we were two years ago, and going in the wrong direction.",
        "good": "549",
        "bad": "23",
        "replies": []
    },
    {
        "user_name": "prescientone",
        "time": "7 September, 2022",
        "context": "Were you expecting something different from the controlled media? ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "RandallPatrick655",
        "time": "7 September, 2022",
        "context": "Even FOX will have to acknowledge the ultimate, nuclear, betrayal that Trump has inflicted upon the USA and our NATO allies. Tomorrow, I suppose. Then the whining about how \"the death penalty can't be used on a former President\" will begin. ALL AMERICANS SHOULD BE OUTRAGED!!!",
        "good": "1",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "NASCARFlagEagleDana60Raptor",
        "time": "7 September, 2022",
        "context": "Reminder that Foxnews is owned by Australians and MBS’s Saudi Sovereign Investment Fund.  They don’t care about the United States.  Those Ozzies do know how to manipulate sheep though",
        "good": "2",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "marlboroman1872",
        "time": "7 September, 2022",
        "context": "Looks like the corrupt DOJ & corrupt FBI are about to get their fake criminal investigation exposed, just like the fake Russian Collusion Investigation and the fake Jan 6th investigation and the 2 fake impeachment attempts. ",
        "good": "12",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "artorious1187",
        "time": "7 September, 2022",
        "context": "So let me get this correct.....the democrats think a review is a bad idea...just like 2020 election....seems they don't want their corruption exposed......typical Washington swamp creatures",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "shirtslookingalittlebrownlib",
        "time": "7 September, 2022",
        "context": "Trump judges, how about Biden judges like the one who signed the warrant and was a public criticizer of Trump?",
        "good": "19",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ripintime",
        "time": "7 September, 2022",
        "context": "socialism  and Marxism want to control US . the constitution is disbanded under their control of terror and LIEs after LIES .... they have a lot of media and like trump called it it is Fake News .",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "aerionflux",
        "time": "7 September, 2022",
        "context": "Whole lot of lib meltdown goin' on here . Here's a sky you can scream at until the sun comes up 👉☁️",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ymelord",
        "time": "7 September, 2022",
        "context": "\"Like, I don’t know what to tell everybody anymore.  Like, I’ve been saying this since he took office\".\nLike, you sure have, Dems.  The Democrat party like feels entitled to do anything and everything to Trump...to laugh and mock him...to find a crime to pin on him...to punish and destroy him.  WHY WON'T HE LIKE STAND STILL? ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "donniedouchebag713",
        "time": "7 September, 2022",
        "context": "So did your hero BILLY BARR, y'all remember him don't ya? ",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "donniedouchebag713",
        "time": "7 September, 2022",
        "context": "Another  MAGA Fascist Sentenced to NINE Months in Jail, why doesn't Fox report any of the GOOD Things that are happening in America? ",
        "good": "2",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "ashketchum",
        "time": "7 September, 2022",
        "context": "Bill Barr attacked her too. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "murmuration",
        "time": "7 September, 2022",
        "context": "“But I was going to put the foreign nuclear readiness intel in my library.”",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "hilife010",
        "time": "7 September, 2022",
        "context": "Their hopes have been shattered. All is lost.  Oh well.  Trump 2024!!!",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "MaxRockatansky",
        "time": "7 September, 2022",
        "context": "fair game is not a liberal trait... ",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "MAGA_Buttplugs_Hate_America🇺🇸",
        "time": "7 September, 2022",
        "context": "The judge was bought and paid for. ",
        "good": "1",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "aerionflux",
        "time": "7 September, 2022",
        "context": "Just remember libs, I was Deplorable, before Deplorable was cool.😎",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Where'sAmerica?",
        "time": "7 September, 2022",
        "context": "liberal propaganda will be the death of the USA",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "RisingsonTwo",
        "time": "7 September, 2022",
        "context": "Joy Reid does not like herself, neither does anyone I know.  Look how she changed her physical appearance to deceive others.  Her appearance is as fake as her rhetoric.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ceeferjay6",
        "time": "7 September, 2022",
        "context": "This is what happens when your Jan 6th hearings fail dismally in the television ratings....",
        "good": "20",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "PunkyBrewster667",
        "time": "7 September, 2022",
        "context": "What are they so afraid of??? 🤨",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "peterparker123",
        "time": "7 September, 2022",
        "context": "so does that mean the decision was stolen? thats terroristic talk there dems!!!",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Buh_bye_Democrat",
        "time": "7 September, 2022",
        "context": "I'm curious why those medias still supporting dementia President? Define it guys. He carried card often, he fell, he used teleprompter too much. He have very serious health problems. You all should request impeachment against Biden and Harris too. Harris lost herself. Why you guys so focus on getting rid of 1.4% inflation, $2.39 gas? Seems medias love America get destroyed. Bad medias. Should be destroyed ",
        "good": "3",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "hilife010",
        "time": "7 September, 2022",
        "context": "Democratic Socialism is a cyanide 💊!",
        "good": "7",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "RandallPatrick655",
        "time": "7 September, 2022",
        "context": "So sad tomorrow when Trump's little fun-toy judge in Florida gets annihilated by EVERY LEGITIMATE NEWS ORGANIZATION ON EARTH for running interference on behalf of the biggest American traitor since Julius Rosenberg.",
        "good": "1",
        "bad": "8",
        "replies": []
    },
    {
        "user_name": "bigtitsrfun69",
        "time": "7 September, 2022",
        "context": "That talking Qtip on MSNBC always makes me laugh when he starts talking about the rule of law and bias. He never discusses it when it comes to his side. ",
        "good": "16",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "wise-man-said",
        "time": "7 September, 2022",
        "context": "Trump the autocrat can try to delay the Mar-a-Lago verdict as much as he wants. The same goes for his criminal actions related to January 6 2021. It will not help him in the end. The insurrectionist is done. Donald Trump will forever be a one term president. There is no way he will win in 2024. If he’s allowed to stand. Most likely he’ll be behind bars.",
        "good": "0",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "Stopthebs55",
        "time": "7 September, 2022",
        "context": "I think joy reid should spend some of her time on the hunter biden laptop story. Shouldn’t a former president have the benefit of the doubt about what papers/documents he took?? It’s not like it’s cut and dry, like what hunter and the big guy did. Please Joy’s of the world, (behar and reid) do us all a favor and shut your traps!! ",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "MarchoftheS.O.D",
        "time": "7 September, 2022",
        "context": "How about that committee?🤣",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "ProudMAGAsupporter,proudAmerican.",
        "time": "7 September, 2022",
        "context": "The last time CNN and MSNBC acted this dangerously negligent, hateful and irresponsible, someone tried to assassinate Brett Kavanaugh.",
        "good": "11",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Casper_",
        "time": "7 September, 2022",
        "context": "Apparently her ruling was deeply flawed and inconsistent with the law.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "ging",
        "time": "7 September, 2022",
        "context": "Cnn and Msnbc are NOT news media/journalists; they are leftist propaganda mouths!!",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "katforusconstitution",
        "time": "7 September, 2022",
        "context": "Let’s keep this simple (although it is getting old)\nWhat are you afraid of Garland? \nTransparency? The story of how you went fishing and didn’t catch a thing? \nAnd Trump with the evidence proving corruption in your department was the one that got away? Crossfire hurricane? ",
        "good": "267",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "themaddog292",
        "time": "7 September, 2022",
        "context": "We don’t see CNN, MSNBC as news anymore. They are rhetorical propaganda outlets…",
        "good": "7",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "formerlycaptspaulding306",
        "time": "7 September, 2022",
        "context": "Yeah, yeah. We get it, MSM.  The Dems/Libs are as pure as undriven snow.  (sarc).",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "kelleylv928",
        "time": "7 September, 2022",
        "context": "Liberal judges release felons back to the streets to commit more crime/murder against the citizens constantly…does the liberal media have anything to say then? ",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "LibAggravator",
        "time": "7 September, 2022",
        "context": "Sound like semi fascists attacking our country’s institutions. ",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "meanmachine",
        "time": "7 September, 2022",
        "context": "Same old Clowns, with the same old routine.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "donniedouchebag713",
        "time": "7 September, 2022",
        "context": "Still wondering why OJ moved to Florida? ",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "demwitsarejerks",
        "time": "7 September, 2022",
        "context": "Typical of the lying propaganda English majors making false narratives just like roe.  Just lies corruption and fraud",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "hopeforthefuture&lt;3&lt;3&lt;3",
        "time": "7 September, 2022",
        "context": "CNN and MSNBC have not been elected to run this country.  So whatever they say opposing those who have been elected or appointed to decision making seats of authority holds no weight.  Of course these two organizations lie so much they’ve lost all credibility anyway.",
        "good": "128",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "NChGeorgalis",
        "time": "7 September, 2022",
        "context": "If Fox didn’t showcase these low IQ clowns nobody would know what they said and nobody would care.  Then they would crawl back under the rock from whence they came.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "markjeanmccord",
        "time": "7 September, 2022",
        "context": "I regret having listened to three of the fake news reporters.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "MAGA_Buttplugs_Hate_America🇺🇸",
        "time": "7 September, 2022",
        "context": "Trump is afraid. His lawyers told him to zip it. The special master decision has only increased Garland’s determination. ",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "aerionflux",
        "time": "7 September, 2022",
        "context": "Oooh, look libs...a sky!! ☁️. Now, don't all you go screamin' at it at once, take turns!",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "f.foo",
        "time": "7 September, 2022",
        "context": "The Trumpaholic Trolls are Triggered Today. They can't quit their unhealthy obsession with the Donald. They are consumed with thoughts about The Donald. He's in their heads 24/7/365. ",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "annoyedreader439",
        "time": "7 September, 2022",
        "context": "It will be fun to watch them melt down again when this turns out to be a lot of nothing...there will be liberals everywhere sky screaming.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "donniedouchebag713",
        "time": "7 September, 2022",
        "context": "So I guess the MAGA Fascit won't be sending her Death Threats",
        "good": "1",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "acates12@yahoo.com",
        "time": "7 September, 2022",
        "context": "The Democrats are a threat to our Republic. ",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "senilejoe46",
        "time": "7 September, 2022",
        "context": "and yet no one is asking about Hillary and her server. ",
        "good": "13",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "america-1st-always",
        "time": "7 September, 2022",
        "context": "Funny how the left uses Soros appointed judges to their advantage literally all time and the MSM says nothing. The liberal MSM is propaganda my friends, and I do not trust ANYTHING they say! ",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Stewed",
        "time": "7 September, 2022",
        "context": "The Democrats NEVER used a sympathetic judge to rule against Trump while he was in office? They don't like it when they are on the receiving end! ",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "trueblue123424",
        "time": "7 September, 2022",
        "context": "FBI found document on foreign nuclear defenses at Mar-a-Lago. Recovered records include material even senior Biden officials were not authorized to view. ",
        "good": "1",
        "bad": "6",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "brian420",
        "time": "7 September, 2022",
        "context": "Joy Reid et al are mere props for the Global Elitists working overtime to destroy western civilization.....",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "frankthetank1964",
        "time": "7 September, 2022",
        "context": "Yup no bias or Democrat propaganda there....what a joke!",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "roni65",
        "time": "7 September, 2022",
        "context": "Liberal meltdown = Good for the Country.",
        "good": "12",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "kramartini496",
        "time": "7 September, 2022",
        "context": "This means there will be no serious action in the case until after the elections--which defeats the whole purpose of the raid, which was to affect the midterms...",
        "good": "30",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "megaton",
        "time": "7 September, 2022",
        "context": "Oh but it’s ok for them to question law and order. 🙄\nOf course she’s corrupt, she has to be. Everyone else is wrong and the libs are never are.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "antifano",
        "time": "7 September, 2022",
        "context": "i agree, the corrupt DOJ shouldnt be the judge of what is acceptable or not for an ex president to have or not have",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "poet2",
        "time": "7 September, 2022",
        "context": "Wah wah wah, but they were okay with Trump hating judge signing the warrant. Hippocrates they are.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "file13",
        "time": "7 September, 2022",
        "context": "Wow. They found secret nuclear documents about another country. So secret that only a handful of The Biden Admin and FBI had the security clearance to view.....but not too secure for The Washington Post. We've got some really gullible 🐑 sheep on here this morning.",
        "good": "7",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "donniedouchebag713",
        "time": "7 September, 2022",
        "context": "There's ONLY ONE REASON a Russian Collaborator would have THOSE Papers.. ",
        "good": "0",
        "bad": "7",
        "replies": []
    },
    {
        "user_name": "brian420",
        "time": "7 September, 2022",
        "context": "I am getting the feeling that all LIBS were bullied in High School.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Taxpayingcitizen143",
        "time": "7 September, 2022",
        "context": "Just like all the other failed attempts to frame Trump for crimes he didn’t commit, this too will backfire on the communist democrats. Trump 2024 ! ",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "baltred",
        "time": "7 September, 2022",
        "context": "Who sets their watch by what talking heads haveto say on infotainment \"news\" shows?\nThe question is, will the DOJ appeal.\nJudge Cannon took several steps that legal specialists said were vulnerable to being overturned if the government files an appeal, as most agreed was likely.\nPaul Rosenzweig, a former homeland security official in the George W. Bush administration and prosecutor in the independent counsel investigation of Bill Clinton, said it was egregious to block the Justice Department from steps like asking witnesses about government files, many marked as classified, that agents had already reviewed.\n“This would seem to me to be a genuinely unprecedented decision by a judge,” Mr. Rosenzweig said. “Enjoining the ongoing criminal investigation is simply untenable.”",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "DogOnPorch",
        "time": "7 September, 2022",
        "context": "TRUMP FTW",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "brian420",
        "time": "7 September, 2022",
        "context": "The Democratic Party, funded by China, Russia, North Korea & Iran are intent on destroying your way of life...\nWinston Churchill:\n\"We shall fight on the beaches, we shall fight on the landing grounds, we shall fight in the fields and in the streets, we shall fight in the hills; we shall never surrender\"",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bfmn",
        "time": "7 September, 2022",
        "context": "Yes the dim support teams, aka national media, once again showing their support for anything that meets the standard of just and fair.  \nWonder how many of their friends and family have to actually take medication in order to maintain any relationship with such lunatics....???  \nWe know the lunatics don't take any, they just hate America, the US Constitution and anyone with an opinion or view different than theirs.",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Basabalib",
        "time": "7 September, 2022",
        "context": "Calling a judge corrupt without proof is a crime. Serious one. ",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "gemmasays",
        "time": "7 September, 2022",
        "context": "I could almost understand all this if Trump had been a bad President like Biden is. But he was the best President for this country in modern day history. So this is all about power. That’s all this is. It’s like we’ve gone back to the Roman Empire. ",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Lennox955",
        "time": "7 September, 2022",
        "context": "Why does the ex-president need to keep classified documents, or any documents - for that matter,  at his Florida golf resort?   Think about it....  Don't you think that those documents are better off in the possession of the current President at the White House?   Shouldn't sensitive Top Secret  information be on the desk of the President in case of a national emergency, rather than in some dusty cardboard box in some closet at Mar-a-Lago?    \nConservatives have spent way too much time complaining about the \"illegal\" raid,   but no one,  especially Donald Trump, himself,  has explained why he has been sitting on those docs for a year and a half.",
        "good": "0",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "donniedouchebag713",
        "time": "7 September, 2022",
        "context": "Daddy,why are you hiding those papers in MY Room?\nI don't want all your friends coming in my room. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bigbird539",
        "time": "7 September, 2022",
        "context": "The simple question…WHAT IS THE DOJ AND THE MARXIST AUTHORITARIAN DEMOCRATIC’S HIDING?",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "AmericanSailor8707",
        "time": "7 September, 2022",
        "context": "The hacks from MSMBC, CNN, and CBS are political propaganda con artists. They are told what to say by the Grand Wizards of Chaos. Some of these folks should be fined or jailed for instigating riots in the streets, supporting groups that do nothing like they were originally intended and steal from the supporters. You want to know about corruption? All the previous folks I just mentioned, look in the mirror. Your contributors of the corruption. Let their be an unbiased third party and sit quietly or discuss The Bidens dealings with China, the insider trading that happens in congress, or Hillary Clinton white washing he computer and smashing Blackberries. Get to the bottom of those stories. ",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "aleaf",
        "time": "7 September, 2022",
        "context": "I had hot fudge sunday at lunch delicious. lol! ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "donniedouchebag713",
        "time": "7 September, 2022",
        "context": "And yet NOBODY is asking the Fascist MAGA Queen why she was HIDING this stuff in Barrons''s room and why she even has these Documents. ",
        "good": "1",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "86benz",
        "time": "7 September, 2022",
        "context": "please don't cry, Trump will come out of this smelling like a rose",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "DERBY401",
        "time": "7 September, 2022",
        "context": "DOES MSNBC EVEN HAVE AN AUDIENCE? ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tom_servo",
        "time": "7 September, 2022",
        "context": "Trump had classified documents in his home.\nWhy isn't he under arrest yet? ",
        "good": "1",
        "bad": "11",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "soothsayer_warns_caesar",
        "time": "7 September, 2022",
        "context": "Why the dems so scared of Trump? ",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sirwhompy",
        "time": "7 September, 2022",
        "context": "Obviously,  these people want a kangaroo court in the morning and a hanging for lunch. Having a 3rd party look over documents seized in a raid authorized by a magistrate who had bias issues themself is just fine. There will of course be an appeal, let this all be adjudicated all the way through and give the former president the due process all American citizens are promised by the Constitution. ",
        "good": "296",
        "bad": "8",
        "replies": []
    },
    {
        "user_name": "demented46",
        "time": "7 September, 2022",
        "context": "Wow!  Why are they so scared?",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "freesouthafrica",
        "time": "7 September, 2022",
        "context": "TRUMP PRESIDENT🇺🇸 ",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "spockisback",
        "time": "7 September, 2022",
        "context": "Democrats lie all the time.  My neighbor said he bought an electric car only to see it's rigged with solar panels on the sunroof.   ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "HacksawD308",
        "time": "7 September, 2022",
        "context": "Trump stole Russian nuclear defense secrets ",
        "good": "2",
        "bad": "7",
        "replies": []
    },
    {
        "user_name": "donniedouchebag713",
        "time": "7 September, 2022",
        "context": "Daddy why are all papers under my mattress?\nI don't like your creepy friends coming in looking for papers all the time.  ",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "DogOnPorch",
        "time": "7 September, 2022",
        "context": "We have an investigation and we found lots of evidence.\nCan we see what you've found??\nNo.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "DarthBordius",
        "time": "7 September, 2022",
        "context": "The conservative judge protecting traitor Trump. I call that white privilege. Trump should be locked up by now awaiting criminal charges for theft of highly sensitive and classified government documents.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "mk101mk693",
        "time": "7 September, 2022",
        "context": "CNN and MSNBC are departments of the Democratic Party. They do and say as ordered.",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "JohnnyBBadd",
        "time": "7 September, 2022",
        "context": "Just another liberal media crybaby meltdown. Can’t wait for post Election Day!",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "donniedouchebag713",
        "time": "7 September, 2022",
        "context": "Whose Nuke Papers does the MAGA Fascist Queen have?\nWe KNOW WHY she tired to hide them in with her sleazy lawyer and Fake Magazine Covers. ",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "gemmasays",
        "time": "7 September, 2022",
        "context": "These liberal media types are like paid actor’s and actresses.  It’s like the movie The Stepford Wives.  They can’t think on their own. They have to be spoon fed a thought process. ",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "llee98",
        "time": "7 September, 2022",
        "context": "Dems hate Trump because he reveals them for who they really are & can't be bribed cause he doesn't need the money. He tells it like it is with little filter. I'd much rather have him as President than Biden who has proven over & over that he is unfit to lead.",
        "good": "16",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "HacksawD308",
        "time": "7 September, 2022",
        "context": "TRE45ON ",
        "good": "1",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "robertfalls57",
        "time": "7 September, 2022",
        "context": "I find it hilarious that the \"Liberal\" media jumps all over this Judge for apointing a \"Master\" to look over the many papers that the FBI scooped up.  If this was Clinton or Obama they would be wanting to handpick the the \"Master\" themselves and try to scream to shut down the FBI and DOJ.  Hillary gave a good product endorsement for BleachBit today the \"FBI and DOJ didn't find any classified documents on her server!\" so no paper trails.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "HacksawD308",
        "time": "7 September, 2022",
        "context": "NEW: FBI agents who searched Mar-a-Lago found a document describing a foreign government's military defenses — including its “nuclear capabilities.” There it is. Trump stole classified nuclear information & lied to the DOJ about having it. He is guilty of Obstruction & Espionage.",
        "good": "1",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "pensatore",
        "time": "7 September, 2022",
        "context": "One thing can't be denied, Trump is getting special treatment. For normal people there is no special master, and your attorney gets to see the evidence at discovery and not a moment before. Then he can plea to exclude evidence for some reason. Trump wants to exclude evidence even before the case goes to the grand jury. No normal person gets this treatment, in fact this is the first time I've heard of it in a case regarding national security. Ridiculous. ",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "HacksawD308",
        "time": "7 September, 2022",
        "context": "BREAKING: Yes, Trump stole nuclear secrets. And US defense intel so sensitive that the president was one of the only people to know about it.\nIndict him. Try him. Convict him. Lock him up.",
        "good": "1",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "HacksawD308",
        "time": "7 September, 2022",
        "context": "MAGA = FAKE PATRIOTS ",
        "good": "2",
        "bad": "13",
        "replies": []
    },
    {
        "user_name": "america1776545",
        "time": "7 September, 2022",
        "context": "Oh, it is music to my ears when leftists start their crying.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "🇺🇸joedirt🇺🇸826",
        "time": "7 September, 2022",
        "context": "Democrats don't want rule of LAW.  ",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "freesouthafrica",
        "time": "7 September, 2022",
        "context": " PROSECUTE OBAMA'S PUPPET ",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "johnhull",
        "time": "7 September, 2022",
        "context": "Yup.  Immediately after losing the 2020 elections This judge was PLACED here by guess who.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Mrmagoo62",
        "time": "7 September, 2022",
        "context": "Mystal and Reid are both smart , talented people, but unfortunately they let there “ feelings” control there mouths. Both so toxic and non journalistic.   I realize she is not really a news person but a leftist commentator.   Mystal is a joke. I know every  toxic, devisive  thing he is going to say.  Msnbc promotes people like this.   Worse news channel on cable.  All the other channels have at least a few people on the other side.  Msnbc is an echo chamber.   They have contempt for anyone who is not leftist.  ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "IndependentTN63",
        "time": "7 September, 2022",
        "context": "This proves once again there are two legal systems in our country, one for normal people and one for billionaire elites like Trump. NO NORMAL PERSON WOULD HAVE BEEN GRANTED THIS! The judge (who Trump appointed!) publicly stated she would side with Trump BEFORE SHE EVEN HEARD THE DOJ’s CASE! This is corruption at the highest level and could delay this case for months or years! Wasting millions in tax dollars. ",
        "good": "1",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "OpinionRadio730",
        "time": "7 September, 2022",
        "context": "It is YOUR right to ask for a special master! Are the libs afraid it will be found out they didn’t have enough to go on in the first place? Are they worried the special master will take away 2/3 and what is left won’t be enough to indict? Conservatives are fed up with the Biden admin! This is political attacks gone amuck! Where are insider trading charges for Nancy??? Who are standing up to have a conservative at voting areas to help count ballots? And not have stand 20 ft back?",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "donniedouchebag713",
        "time": "7 September, 2022",
        "context": "Russia Collaborator with STOLEN Nuke Papers?\nHaven't we seen this before? \n ",
        "good": "0",
        "bad": "5",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "HacksawD308",
        "time": "7 September, 2022",
        "context": "Penalty: Under U.S. Code Title 18, the penalty is death, or not less than five years' imprisonment (with a minimum fine of $10,000, if not sentenced to death). Any person convicted of treason against the United States also forfeits the right to hold public office in the USA!",
        "good": "0",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "Cascoregion",
        "time": "7 September, 2022",
        "context": "Who even watches these ridiculous, low intellect news programs except the low intellect.  I just roll my eyes at them.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Clavell-RiveraP.R.(USA)",
        "time": "7 September, 2022",
        "context": "Democrats should be BANNED from USA!! so real Americans can live PEACEFULLY!!....and don't forget your Democrat leftist Socialist Propaganda!! HIT THE ROAD, JACK!!!!",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "donniedouchebag713",
        "time": "7 September, 2022",
        "context": "We can't have Trump's KGB Lawyers looking at this stuff.",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "kqt",
        "time": "7 September, 2022",
        "context": "As the former Soviet Communist leader Nikita Khrushchev said time and again, “The press is our chief ideological weapon.”",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "HacksawD308",
        "time": "7 September, 2022",
        "context": "That’s where everything relating to our national security should be stored! At The swamp known as Mar a lago",
        "good": "0",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "americanbuilder",
        "time": "7 September, 2022",
        "context": "I don’t know much about the law involving this type stuff but here is what I do know.\n1 The democrats and fbi have investigated him for everything under the sun over the last few years.\n2 He always came out on top.\nSo I figure he’ll win this also.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tuckerstvdinner",
        "time": "7 September, 2022",
        "context": "This decision will be struck down quickly by SCOTUS.\nYes I know the score, they have to uphold laws before friends",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "tripp572",
        "time": "7 September, 2022",
        "context": "So why isn't the judge who signed off on the raid not being called bias. That judge had already refused himself from other Trump cases. Since he refused himself once then he should have refused himself again. That judge has shown complete bias by not recusing himself again.",
        "good": "22",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "allfather",
        "time": "7 September, 2022",
        "context": "Ex-AG William Barr also bashed on the judges ruling.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "zzmonty",
        "time": "7 September, 2022",
        "context": "\"his claim will be, well the Biden Department of Justice is going after me because I am his opponent.\" -- that is already being said.  And why do the Dems oppose Trump's defense being able to look at what was confiscated?  What are they trying to hide?  Maybe the fact that the documents in question may not even have Trump's DNA on them?  Or that all currently living previous Presidents have legal access to those documents, which means that this is a political game?  Or the so called \"knowing the defense capabilities of a foreign country\" is nothing more than what is already public knowledge?",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "atomic855",
        "time": "7 September, 2022",
        "context": "This finding will be appealed, stayed and, ultimately, overturned.\nEnjoy the fleeting 'victory', it won't last.",
        "good": "1",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "FormerlyTwistedPenny",
        "time": "7 September, 2022",
        "context": "\"Special privileges\" ... that's rich, coming from the media traitors who ignored the Hunter laptop.",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "areyouok014",
        "time": "7 September, 2022",
        "context": "Government globalist media (all owned by same handful of trillionaires who keep to their agenda) ..... MASS FORMATION PSYCHOSIS.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "4thof6",
        "time": "7 September, 2022",
        "context": "I see the MSM children are having another Trump Tantrum!!!!!",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "kw4maga",
        "time": "7 September, 2022",
        "context": "😂🤗😂🤗😂 Remember a vote for a Democrat and I mean any Democrat is a vote against America‼️🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rodehawg97",
        "time": "7 September, 2022",
        "context": "Soros has got his drones out of bed early, I see.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "HacksawD308",
        "time": "7 September, 2022",
        "context": "This was not just extreme carelessness with classified material… This is calculated, deliberate, premeditated misconduct",
        "good": "1",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "badcougar",
        "time": "7 September, 2022",
        "context": "These people can actually say this with a straight face?If Trump did do wrong then so be it..But how can they say these judges are corrupt when all u have is every single democratic judge ruling for everything the Dems ask or fight for..No 0ne is correct 100% so these are corrupt judges just like the FBI and DOJ..Who are they working for..The Democratic party!!",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "RHB1",
        "time": "7 September, 2022",
        "context": "Let them cry. They lost RvWade and did the same to the SCOTUS judges. What these snowflakes don't understand is..... this can flow both ways. -ULTRA MAGA",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "whatever66666",
        "time": "7 September, 2022",
        "context": "I MISS TRUMP! ",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "HacksawD308",
        "time": "7 September, 2022",
        "context": "Trump basically served up our sources and methods to our adversaries on a silver platter. \nMAGA = FAKE PATRIOTS ",
        "good": "0",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "rodehawg97",
        "time": "7 September, 2022",
        "context": "The panic in the lib's posts today is delightful!",
        "good": "42",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "mickiem",
        "time": "7 September, 2022",
        "context": "If there is nothing to hide then having a Special Master shouldn't matter. ",
        "good": "24",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "usaunderattack",
        "time": "7 September, 2022",
        "context": "ALL conservatives in America must unite and claim sovereignty from this corrupt rule of law because they are twisting the laws and prosecutors are coming after conservatives with false accusations and trying to put them in prison. It’s happening in every district court in the USA \nReply",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "trump'sgirl",
        "time": "7 September, 2022",
        "context": "😂 🤣 ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "noggled",
        "time": "7 September, 2022",
        "context": "Trump’s man A-G BARR says the ruling from the Trump judge is “deeply flawed”. Seems fair, it’s like Trump.",
        "good": "0",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "nevertheless",
        "time": "7 September, 2022",
        "context": "Trump said no nuke documents at his house , liar , they found what he refused to give up voluntarily.  ",
        "good": "0",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "Diehl70",
        "time": "7 September, 2022",
        "context": "Man these people really believe in fairness don’t they . We all know, well except the socialist that the FBI and DOJ are corrupt and this is year 6 of a witch hunt. It’s has to stop",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jaquas",
        "time": "7 September, 2022",
        "context": "But I thought it was the Republicans who were violent and threatening?  HYPOCRITES!   ",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "clivee",
        "time": "7 September, 2022",
        "context": "Dont worry - They have some of his passports so he cannot just slip away. Hut maybe he has more passports?\nMelanie may be happy though to let him go!",
        "good": "0",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "flyintheointment808",
        "time": "7 September, 2022",
        "context": "This is beyond delicious. Whilst employment rates go through the roof under Biden, the GOP desperately tries to smooth over ANOTHER treasonous act by mediocre reality TV personality, Dear Leader. ",
        "good": "0",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "rodehawg97",
        "time": "7 September, 2022",
        "context": "The first act by Britain's new PM will be to remove the ban on fracking.  The Left's narrative is being discarded all around the world.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "TrumpLovesPutinPutinLovesHimBack",
        "time": "7 September, 2022",
        "context": "That so-called Trump-appointed judge is corrupt to the core.",
        "good": "2",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "luvamericia678",
        "time": "7 September, 2022",
        "context": "A good example of what the persecution will be like going forward for all conservatives. Guilty without a trial, jail or worse. And it won’t be for just MAGA, Biden has made it clear how much he hates all republicans. ",
        "good": "14",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "zzmonty",
        "time": "7 September, 2022",
        "context": "If there was any truth (a real crime) involving the documents, Trump would already be in handcuffs.",
        "good": "15",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "nhound",
        "time": "7 September, 2022",
        "context": "If liberals only had a brain, or the reading skills to understand the constitution",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Ogre663",
        "time": "7 September, 2022",
        "context": "\"do not believe in the rule of law, they do not believe in precedent, they do not believe in facts, they do not believe in logic, they just believe in whatever’s going to help, and they’ve proven it again and again and again.\"  Accuse others of what you do.  Dems have this down to a science.",
        "good": "36",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jetjock400",
        "time": "7 September, 2022",
        "context": "Joe and the Ho gotta go",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "rodehawg97",
        "time": "7 September, 2022",
        "context": "Making a ruling based on the Constitution instead of the media's narrative is far from 'corrupt', it's refreshing.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "baaa",
        "time": "7 September, 2022",
        "context": "The 5hit I read here is hilarious…a week ago 99% of you had never even heard of a Special Master.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rhonaar1",
        "time": "7 September, 2022",
        "context": "The perfect Brown Shirts",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Thinking253",
        "time": "7 September, 2022",
        "context": "Corruption you better look in the mirror CNN, MSNBC take a short look what is going on in my country under this administration. LET IT BE SAID LET IT BE WRITTEN",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "klaatubarada",
        "time": "7 September, 2022",
        "context": "I can't tell if these people are sick, evil, misled or all three.   And why is Fox not reporting on the fact that the empty folders are empty because the contents were sent to and collected by the National Archives and Records Administration which they reported in Jan and June? \nOr the fact the contents of least some were the tax returns and correspondence with his attorney discovered in the possession of the DOJ?  Or the fact that the locks on the storage room and closet doors were placed there by NARA,  again reported by NARA in June. \nAnd no correction on the bogus nuclear code documents?  This is becoming some kind of biblical prophesy.  Pure evil at work.",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "goatroper074",
        "time": "7 September, 2022",
        "context": "Trump = Winning!🇺🇸MAGA!",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Enlightened1378",
        "time": "7 September, 2022",
        "context": "What is the FBI so afraid of ??   Justice is inevitable. All starts with a red wave in November ",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cc0974",
        "time": "7 September, 2022",
        "context": "Midterm election interference. Plain and simple. Crying because he won’t be charged before elections like they hoped ",
        "good": "31",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "FLAP576",
        "time": "7 September, 2022",
        "context": "TDS strikes again.  ",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dudg",
        "time": "7 September, 2022",
        "context": "It takes a couple of months to investigate Trump ,again, and everybody on the left has him guilty ,again, anther witch hunt, how many years have they had the laptop, and nothing?",
        "good": "22",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "trobb863",
        "time": "7 September, 2022",
        "context": "Civil War 2.0",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Lilpiggy",
        "time": "7 September, 2022",
        "context": "If leftwing media is melting down, then that means the judge  i doing something good.\nWho in their right mind trusts the FBI or DOJ?",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rodehawg97",
        "time": "7 September, 2022",
        "context": "I eagerly anticipate the Left's sky screaming when Trump is re-elected.  ",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "RightyRoo",
        "time": "7 September, 2022",
        "context": "Joy who ?",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "👼‍SuperFlyJesusFreak👼‍",
        "time": "7 September, 2022",
        "context": "Special master isn't going to save Trump.   It's going to come back and bite him when the SM allows the majority of the evidence to move forward without exclusion under executive privilege. ",
        "good": "1",
        "bad": "7",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "miles2go851",
        "time": "7 September, 2022",
        "context": "aren’t these the same clowns that praised mr potato heads speech last week in philadelphia?   like i care what their opinion is.  i’d trust a drug addicted homeless persons opinion before i listened to theirs ",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tresmal",
        "time": "7 September, 2022",
        "context": "Trump's former personal AG Bill Barr said on Fox News :\n\" The opinion, I think, was wrong, and I think the government should appeal it, \"It's deeply flawed in a number of ways. I don't think the appointment of a special master is going to hold up.\"\n\"The law here, I think, is pretty clear that the Justice Department should be able to review these documents,\"\n\"People say this was unprecedented, well, it’s also unprecedented for a president to take all this classified information and put them in a country club.”",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "schweisshund215",
        "time": "7 September, 2022",
        "context": "See? They don't really care about the documents. They just don't want Trump to be President.  ",
        "good": "31",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "nwgeorgia300",
        "time": "7 September, 2022",
        "context": "They will do anything to keep Trump out of the white house. ",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Ouigee",
        "time": "7 September, 2022",
        "context": "Why do these people have a problem with judge Cannon but not have a problem with judge Reinhart who should have recused himself as he did in a prior case involving President Trump?  It seems they only have a problem when they don’t get their way. ",
        "good": "664",
        "bad": "13",
        "replies": []
    },
    {
        "user_name": "canyonoflight",
        "time": "7 September, 2022",
        "context": "But CNN and MSNBC are not being Seditious, right!  ",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "SeekHim",
        "time": "7 September, 2022",
        "context": "If these so called media talking heads really, really wanted to go off on judges there are dozens in democratic cities that are letting criminals walk around continuing to commit crimes. Maybe start there. Everyone agrees that this whole procedure about Trump is unprecedented and that being the case I think they should go over and beyond just like they did with the Jan 6 committee meeting - go over everything with a fine tooth comb by an impartial group seeings everyone knows Biden signed off on the warrant and these days the FBI isn't so trustworthy. So let it all unfold and we'll see what we'll see. Of course if it proves to be in favor for Trump the left will have the biggest meltdown of all time - the only way the left will accept it is valid is if it goes the way they want it to go regardless of the truth or facts.",
        "good": "21",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "2024trumper063",
        "time": "7 September, 2022",
        "context": "Trump is always right !\nDemocrats always lie cheat steal rob etc.. \nI have never “hated “ ! I do now ! ",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "baaa",
        "time": "7 September, 2022",
        "context": "Joy Reid thinks the Special Master is the guy that owns the plantation.",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "foodbroker",
        "time": "7 September, 2022",
        "context": "POTUS #47 Trump will be taking revenge on the following and I honestly cannot wait\nCNN & MSNBC - declaring them terrorist organizations\nGOOGLE & FACEBOOK - declaring them terrorist organizations\nRAIDING THE FOLLOWING HOMES\nBIDEN - PELOSI - SCHIFF - HARRIS - WATERS - SCHUMER - FAUCI - NEWSOME - STACY ADAMS - AOC - TALIB - OMAR - SWEENEY - \nThen build the southern border wall = fill moats with alligators on the American side \nYEAH !!!",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "gus653",
        "time": "7 September, 2022",
        "context": "Not a meltdown. The judge is just a political hack. The opinion is laughable, especially the executive privilege part. She's just part of the delay-tactics team. I believe anyone posting around these FN forums doing 10% of what he did with government documents would be in Gitmo, being interrogated 24/7.",
        "good": "1",
        "bad": "7",
        "replies": []
    },
    {
        "user_name": "Mr.Comment",
        "time": "7 September, 2022",
        "context": "So apparently Trump had nuclear documents so secret, so important and so super critical duper magnificent that he was able to take them to FedEx Office and make some copies. And then the situation became so dire the democrats had to wait 2 years to raid his home.\nIt has nothing to do with politics at all. The fate of the known universe was / is at stake.",
        "good": "205",
        "bad": "11",
        "replies": []
    },
    {
        "user_name": "hat.meister",
        "time": "7 September, 2022",
        "context": "Qrange is so freaked out about the American people discovering that he stole nuclear secrets that he bribed a judge to appoint this special deal to help him avoid charges. Ever heard of the Rosenburg's? If you're curious about what's going to happen to Qrange, look up their fate.",
        "good": "3",
        "bad": "11",
        "replies": []
    },
    {
        "user_name": "isthisreal?",
        "time": "7 September, 2022",
        "context": "Let's discuss a sitting president who clearly has cut deals everywhere with anyone to keep his son from going to prison. If that would have been Donald and Jr. they would have been in prison by now.",
        "good": "28",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "captaindano728",
        "time": "7 September, 2022",
        "context": "Knock knock,\nWho's there,\nOwen,\nOwen who?,\n0 and 3...\n😃 😀 😄 😁 🤣 😂 😃 ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "podtrek202",
        "time": "7 September, 2022",
        "context": "I do not know whether Trump is guilty or not but it is clear that democrats reaction to Trump is an obvious attempt to distract from democrats clear cut abysmal record of the past 20 months. ",
        "good": "203",
        "bad": "7",
        "replies": []
    },
    {
        "user_name": "bemusedbefuddled085",
        "time": "7 September, 2022",
        "context": "I'm a leftie however I don't agree all Trump appointed judges are corrupt or don't follow the law. This has been demonstrated again and again - the 65 cases Trump filed following the election went nowhere and many of those judges were appointed by Trump.\n\nThe opinion of the  judge in this case is blatantly biased.  Politics and the judiciary should be polar opposites, but not in this case.",
        "good": "2",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "echogl",
        "time": "7 September, 2022",
        "context": "I don't know who is worse, the Democrats and their lies or the lying liberal media. They are all the REAL \"Basket of Deploreables\".",
        "good": "12",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "nwgeorgia300",
        "time": "7 September, 2022",
        "context": "Democrats always say that cutting taxes don't help the working class. \nBut what Reagan and Trump did to help the working class was to cut regulations. \nIf you notice when Biden went in regulations were back, supplies couldn't get through and prices jumped.",
        "good": "82",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "4d4e",
        "time": "7 September, 2022",
        "context": "FOX already ran its own article attacking this judge with Bill Barr.  ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "death-to-democrats",
        "time": "7 September, 2022",
        "context": "Joe Biden HATES America. ",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "AnotherSky",
        "time": "7 September, 2022",
        "context": "And the bias continues..AndFoxwhatsupwithnospaces.....\n ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rodehawg97",
        "time": "7 September, 2022",
        "context": "I sincerely hope there is no Civil war but if the Dems insist on having one, let's make it a good one and decimate the Leftists in our country.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "RightyRoo",
        "time": "7 September, 2022",
        "context": "and the The ReidOut viewership continues to drop, month over month.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "griffin",
        "time": "7 September, 2022",
        "context": "Get a grip. You aren’t running squat. More proof they are nothing more than dem lapdogs",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "pokerfaced154",
        "time": "7 September, 2022",
        "context": "the left does not fair representation. They want to spew their lies and be able to convict someone on their imaginary misinformation. No equal treatment under the law - just their way-this is not Burger King.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "pensatore",
        "time": "7 September, 2022",
        "context": "In 2024 we must elect Donald Trump, and then he should immediately suspend the Constitution, to be able to round up his enemies and put them in camps. After about 10 years of dictatorship, the ruler (Trump or Trump Jr. as the case may be) may wish to write and adopt a new constitution, this time based on Christianity and eternal white rule. ",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "HacksawD308",
        "time": "7 September, 2022",
        "context": "I like presidents that keep the nation's top secrets secret ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Grnross",
        "time": "7 September, 2022",
        "context": "The FBI tried to put shade on their actions, the more light the better",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "donniedouchebag713",
        "time": "7 September, 2022",
        "context": "What's the Orange KGB Tool so afraid of?",
        "good": "0",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "JL99380",
        "time": "7 September, 2022",
        "context": "i'm so old i remember $1.98 gas ",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "alwaysamericanfirst",
        "time": "7 September, 2022",
        "context": "If it weren’t for Trump, the left would have nothing else to say, they would be mute!",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "cal2177",
        "time": "7 September, 2022",
        "context": "To borrow a line the libs love to use: if the FBI is right, then what are you afraid of?",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rodehawg97",
        "time": "7 September, 2022",
        "context": "Dragging Cankles lifeless body through the streets by her heels would be a spectacle I'd pay to see.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "airbornedf",
        "time": "7 September, 2022",
        "context": "where were these people when a judge that heavily donated to obama signed the warrant?",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Grnross",
        "time": "7 September, 2022",
        "context": "When good people fight back and it becomes a movement, Democrats will be sorry",
        "good": "15",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "macmurray",
        "time": "7 September, 2022",
        "context": "Every stone of the Trump Criminal Enterprise is being turned over.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "macmurray",
        "time": "7 September, 2022",
        "context": "Trump is a joke. \nQ: Why did Trump want Sarah Palin to be head of the Space Program?\nA: She could see the moon from her house.",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "mr.rogersghost",
        "time": "7 September, 2022",
        "context": "So the argument is still \"orange man bad.\" Like a neglected dog chained up in a back yard gnawing on the end of what's left of an old bone.  ",
        "good": "2",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "westmich253",
        "time": "7 September, 2022",
        "context": "You left off Bill Barr on Fox 'News' also slamming the decision along with an amicus brief from Republican Attorneys General.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "avatar777",
        "time": "8 September, 2022",
        "context": "you can summarize the lamestream media in 3 words: trump is wrong.",
        "good": "0",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "anonymous_punk951",
        "time": "7 September, 2022",
        "context": "According to Republicans any judge that disagrees with them is a deep state operative",
        "good": "2",
        "bad": "4",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "yak703",
        "time": "8 September, 2022",
        "context": "Hmmmn, for a minute there, it almost sounded like none of these communists didn't like President Trump.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "yak703",
        "time": "7 September, 2022",
        "context": "Joy is a racist. Bush baby? Maybe.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mbkrc",
        "time": "8 September, 2022",
        "context": "Legal \"experts\" questioning the judge's decision on a special master are \"deeply flawed\".",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "bidensniffedme745",
        "time": "7 September, 2022",
        "context": "The only way the warrant should have been approved is if there was 100% no doubt of evidence there that would lead to charges being brought, otherwise it was nothing but political prosecution ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "just1guyxx",
        "time": "7 September, 2022",
        "context": "Since when does a just announce her intentions before a plaintiff even files their motion?  Worse yet, she sent it back and told them to re-write it, then repeated her intentions before DOJ had a chance to respond.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "HiHo",
        "time": "7 September, 2022",
        "context": " Republicans under oath will put Donald Trump in jail, he doesn't have to worry about Democrats.",
        "good": "3",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "simpleman57",
        "time": "7 September, 2022",
        "context": "Once again it’s conservatives against the blacks er I mean the media",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sbignewski",
        "time": "8 September, 2022",
        "context": "Itseemstheproblemwithnotrecognizing<space>charactersfromtheFirefoxbrowserstillhasnotbeenfixed.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "2l84all933",
        "time": "7 September, 2022",
        "context": "The personalities in the montage are equivalent to Hannity, Carlson and Ingraham. They are not news reporters. They feed the base much as Fox does.  ",
        "good": "0",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "PaidToPlay",
        "time": "7 September, 2022",
        "context": "DOJ doesn't mind delays.   They still haven't investigated the Biden Crime Family  and they've had the Biden family laptop since 2019.   Multiple felonies were committed and the \"Big Guy\" is compromised. ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "alohahi63mpd*",
        "time": "7 September, 2022",
        "context": " Bill Barr concurs.  He said it on Fox.  Therefore, Trumpers must believe.  ",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "magadied-cultie",
        "time": "7 September, 2022",
        "context": "Michelle Obama just launched her 2024 presidential campaign. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "logicalmoderate095",
        "time": "7 September, 2022",
        "context": "Not just left leaning--it's a pretty bi-partisan opinion,  with even Trump's former AG Bill Barr called the judge's ruling “wrong” and “deeply flawed” and saying the Justice Department must appeal it.",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "macmurray",
        "time": "7 September, 2022",
        "context": "Wait a second, I missed something here. Why did Trump steal Top Secret nuclear documents and then hide them in the basement at Mar-a-lago?",
        "good": "2",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "iconoclast60",
        "time": "7 September, 2022",
        "context": "Is she corrupt?  There's no proof, so no, she isn't.  Biased?  Well, legal experts who don't have a political ax to grind (including conservatives) seem to think that the ruling was based on extremely flawed legal reasoning, so yeah, she probably is.  Got a plum job courtesy of the man who's in her court.  Conflict of interest?  Absolutely.  Should she have recused herself?  Absolutely.",
        "good": "3",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "albedammed",
        "time": "8 September, 2022",
        "context": "The FBI had no choice in visiting Maralago after they found nuclear secrets being auctioned on EBay from somewhere in Palm Beach",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "Humbug303",
        "time": "7 September, 2022",
        "context": "Is anybody interested in talking about the real big story of the last 24 hours (and which Fox News is not covering)I which is that Trump was holding on to documents that were an assessment of some other country's nuclear capabilities?",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "macmurray",
        "time": "7 September, 2022",
        "context": "Trump is lookin’ like a squealing piglet these days. WHEEEE! WHEEEE!",
        "good": "1",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "criticalthinker2426",
        "time": "7 September, 2022",
        "context": "When there is no legal basis for the ruling... it can only be loyalty to the man who appointed her.",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "macmurray",
        "time": "7 September, 2022",
        "context": "Trump is a joke.\nQ: What’s the only thing progressive about Trump? \nA: His dementia.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "reedmore",
        "time": "7 September, 2022",
        "context": "When you have to use the word \"special circumstances\" that many times in your opinion, there is a distinct possibility that you aren't following the letter of the law. ",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "macmurray",
        "time": "7 September, 2022",
        "context": "Trump is a joke. \nQ: What’s the name of Trump’s new airplane?\nA: Hair Farce Won.",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "bidensniffedme745",
        "time": "7 September, 2022",
        "context": "Hey if Trump is guilty, charge him, prosecute him and lock him up,  I don't like him and don't want any chance of him being the Republican candidate for 2024, but I see nothing wrong with a 3rd party review, this whole thing reeks of political prosecution, like they darn well better have gotten evidence to convict him or everyone involved should be out of jobs and maybe even facing charges ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "d4m4c4",
        "time": "7 September, 2022",
        "context": "Why are these news outlets or anyone for that matter afraid of transparency. I think she made the right decision. After the Proven attempted coup against the Trump administration the American people deserve the truth.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "shinbits",
        "time": "7 September, 2022",
        "context": "A Trump-appointed judge approves a measure delaying investigation into Trump.  Yup, no corruption here.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Tman1776",
        "time": "7 September, 2022",
        "context": "Well, if anyone knows about corruption, it would be the know-nothings at MSNBC and CNN.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Fortem",
        "time": "7 September, 2022",
        "context": "It is only OK to criticize judges and extend the courtesy of MAGA death threat if they rule against Trump. Judge Reinhold will concur.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "gladileftwa",
        "time": "7 September, 2022",
        "context": "What are the DemocRATS so afraid of? If they have nothing to hide, let the special master do their job and we'll move on. ",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "suriv9",
        "time": "7 September, 2022",
        "context": "CNN calling someone biased is a bit like Jeffrey Dahmer making fun of serial killers.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "carlyrose",
        "time": "7 September, 2022",
        "context": "It's not only that the ignorant Democrats can't stand losing.  It's also that they won't tolerate it, as will be evident when they riot and burn, after the November election. ",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "macmurray",
        "time": "7 September, 2022",
        "context": "Trump is a joke.\nQ: What does Trump’s “Art of the Deal” have in common with his other books? \nA: They all end at Chapter 11.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "macmurray",
        "time": "7 September, 2022",
        "context": "Trump is a joke.\nQ: What’s the difference between Trump and Greenland?\nA: Greenland is not for sale.",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "elrodswagger",
        "time": "7 September, 2022",
        "context": "Has anyone ever accused Fox of being factual? Or its rabid readers of fact checking anything? No ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "macmurray",
        "time": "7 September, 2022",
        "context": "Trump is a joke.\nQ: When did Trump invent the “no-fly zone?” \nA: When he put his pants on backwards.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "phillycsteak",
        "time": "7 September, 2022",
        "context": "She says:\n\"When you allow Republicans to control the courts you get nothing. Trump judges do not believe in the rule of law, they do not believe in precedent, they do not believe in facts, they do not believe in logic—they just believe in whatever’s going to help Donald Trump, and they’ve proven it again and again and again.\"\nThey can't really believe what they're saying, can they? It has to be mental illness.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "togobeyond1",
        "time": "7 September, 2022",
        "context": "LoL Democrats have been trying to get Trump for 6 years and he's set Trump trap after Trump trap for them if they lose this time they can kiss 2024 goodbye to Trump and Desantis",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Budwizer",
        "time": "7 September, 2022",
        "context": "The DOJ has stepped on Trumps rights as a citizen. And if you think it's correct you could be next.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "donniesmeltdown",
        "time": "7 September, 2022",
        "context": "Mar-a-Lago documents kept in Trump's home were so secret that even the highest-ranking national security officials in the Biden administration weren't allowed to look at them, report says\nWOW...fry him",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "alejandropena",
        "time": "7 September, 2022",
        "context": "Did you ever see Joy Reid and Elie Mystal live in the same place / same time?  No, because they are the same person.  ",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "macmurray",
        "time": "7 September, 2022",
        "context": "Trump is a joke. \nQ: Why didn’t the GOP Senate remove Trump after his impeachment? \nA: Because they believed in taking a baby to full term.",
        "good": "3",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "billburn11",
        "time": "7 September, 2022",
        "context": "The real corruption are the Democrats and fake media.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "magadied-cultie",
        "time": "7 September, 2022",
        "context": "Had trump complied with the subpoena he never would have been searched. Personal responsibility is key to being an executive. ",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "macmurray",
        "time": "7 September, 2022",
        "context": "Trump is a joke. \nQ: Where has Trump invested most of his assets?\nA: The Laughing Stock Market.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "donniesmeltdown",
        "time": "7 September, 2022",
        "context": "Donnie's BFF Steve Bannon indicted again on the same charges Donnie's pardoned him for: Stealing from MAGA",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "EDDY99",
        "time": "7 September, 2022",
        "context": "In the USA judges are all partisan.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "I'mtherealKing",
        "time": "7 September, 2022",
        "context": "An ultra right wing, Trump appointed, Federalist Society member judge makes a ridiculous decision in favor of Trump. One would have to be crazy to suggest she's biased.",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "donniesmeltdown",
        "time": "7 September, 2022",
        "context": "The State of NY will make Bannon pay for stealing from MAGAS...SOMEONE has to stick up for y'all....",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "randomguy",
        "time": "7 September, 2022",
        "context": "The man is a criminal. I have heard about \"law and order\" but I sure don't see any support for that sort of thing around here.\nThe problem with America is MAGA. You all see it on this web site every day. It is beyond debate.",
        "good": "0",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "Firstgarden7",
        "time": "7 September, 2022",
        "context": "I'll bet this judge knows what a woman is.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sagebrush4",
        "time": "7 September, 2022",
        "context": "democrats just can't allow a fair trial. \nthe judge didn't say he was not guilty. she just agreed to a fair audit. remember innocent until proven guilty. ",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "russrichards986",
        "time": "7 September, 2022",
        "context": "I love it when liberal heads explode...",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Bobcat007",
        "time": "7 September, 2022",
        "context": "Funny how only trolls and radicalized left-wing talk show hosts are going nuts while Democrats in Congress keep their mouths shut.  That's because the politicians know what a massive blunder Brandon and his handler's attack on his biggest rival was.  It's going to be very interesting to hear what the FBI whistleblowers have to say at Brandon's first impeachment trial next January.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sal049",
        "time": "7 September, 2022",
        "context": "There are too many influencers out there especially with internet.  Human beings will listen to anything.  Seems not too many people have minds of their own any more. Everyone wants to be in control of everyone else when their own lives are a wreck.  Stay focused people.  Do your own thinking.  Vote for the person that will do the best for our Country.  Do your research and stop complaining.  If Trump runs again. He runs again.  You may not like him but  he did good for us!  You don't have to like him.   ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "areyoume",
        "time": "7 September, 2022",
        "context": "Proves liberals are a virus.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dockane",
        "time": "7 September, 2022",
        "context": "Trump:  I could leave the WH and steal the nation's top secrets, lie about having them, and make the FBI come down and confiscate them out of my closet and desk... and I still wouldn't lose any support!\nThe new 5th avenue cult. ",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "macmurray",
        "time": "7 September, 2022",
        "context": "Trump is a joke. \nQ: What’s the difference between Russia and reality? \nA: Trump has connections with Russia.",
        "good": "1",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "DependsOnJoe",
        "time": "7 September, 2022",
        "context": "Always look at the FACTS! \nEvery accusation in the last 7 years against President Trump was manufactured by the DNC, Pushed by the Lame Stream State Propaganda, and resulted in THEM being exposed for their treachery. \nGarland said that the DOJ would not leak the details of this case, then immediately after an objective, constitutional based decision is made by a federal judge... LEAKS to distract! \nThey have not changed, they will never change. Still waiting for Schiff's undeniable, irrefutable evidence. \nIt is this sort of criminal behavior by those in power that ends in Civil War. It always has. ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "larjam123",
        "time": "7 September, 2022",
        "context": "FBI told Trump's Security team to turn off all the cameras at Mar a Lago...why? What didn't they want people to see? Hopefully the Special Master can find out. ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "macmurray",
        "time": "7 September, 2022",
        "context": "Trump’s incompetence and corruption poses a clear and present danger to the safety and security of the country.",
        "good": "0",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "Corona-45",
        "time": "7 September, 2022",
        "context": "If Trump has a video of the search of his property like he said that proves that he did nothing wrong and that the FBI/DOJ acted inappropriate, then why doesn't he just show it to the American people? He's claiming that the election was stolen, though he has no proof. Now he has proof to show that he did nothing wrong but won't show it.",
        "good": "1",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "eraser",
        "time": "7 September, 2022",
        "context": "left-leaning media figures on MSNBC and CNN cried foul, and slammed the judge for her decision. ..........If any one should be slammed it is CNN, MSNBC, Joy Reid and a lot of other left leaning socialists , communist pigs.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "macmurray",
        "time": "7 September, 2022",
        "context": "Trump and MAGA have become a joke. \nQ: What’s 25 feet long and has 8 teeth?\nA: The front row at a Trump rally.",
        "good": "2",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "nursles",
        "time": "7 September, 2022",
        "context": "Here’s what I would like to see and hear….change the name from Trump to Clinton!  Then we can talk ",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "donniesmeltdown",
        "time": "7 September, 2022",
        "context": "Mr. Bannon, working with a wounded Air Force veteran and a Florida venture capitalist, conspired to cheat hundreds of thousands of donors by falsely promising that their money had been set aside for new sections of wall, according to a federal indictment unsealed in Manhattan. Mr. Bannon used nearly $1 million of it for personal expenses.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "grumpymel",
        "time": "7 September, 2022",
        "context": "So basically the leftists here (and on CNN, MSNBC) just want to hang Trump because they hate him politically. The facts don't matter.\nI don't know whether Trump is actually guilty of any crimes here. Neither do any of you. However, even if we were to assume the worst, that he was actually guilty..... even guilty parties in criminal cases are supposed to be entitled to the Courts protection of their Constitutional Rights.\nEnsuring that prosecutors/investigators can NOT obtain access to documents covered by attorney-client privilege is a pretty basic right. Even by the FBI's own \"Taint Team's\" own admission they seized over 500 pages of documents covered by \"attorney-client\" privilege as well as medical records....... and they accidentally missed material that should have been privileged and passed it on to the investigative team before catching the error, that is by their own admission in writing to the Judge. ",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "macmurray",
        "time": "7 September, 2022",
        "context": "Trump is a joke.\nQ: Why did Melania vote for Obama?\nA: Because Trump’s proposed stimulus package was too small.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "maryschneider",
        "time": "7 September, 2022",
        "context": "Boy,what parallel universe do they live in?!!! ",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "donniesmeltdown",
        "time": "7 September, 2022",
        "context": "Bannon promised that 100% of funds raised from magas would go to the wall. Then he created phony invoices to skim $1.35M from them.....LOL",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "omg2012",
        "time": "7 September, 2022",
        "context": "We now know that the FBI is biased, corrupt and has told many lies to get subpoenas to spy on Trump.  ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "macmurray",
        "time": "7 September, 2022",
        "context": "REPENT FAT DONNIE!\nTHE END IS NEAR.",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "Pizzadragon",
        "time": "7 September, 2022",
        "context": "bill clinton will lead the cigar division",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "macmurray",
        "time": "7 September, 2022",
        "context": "You can see the fear and panic in Trump's eyes. And the flop sweat on his forehead and upper lip shows that he knows he’s guilty.",
        "good": "1",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "henrythecat",
        "time": "7 September, 2022",
        "context": "there's nothing controversial about the judges decision.  they do it all the time.  dems forget Trump has the right to due process just like everybody else.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bwaldorf333",
        "time": "7 September, 2022",
        "context": "Fox News has always been obsessed wit h MSNBC and CNN.",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "dockane",
        "time": "7 September, 2022",
        "context": "Run the tape on all of the GOP congressmen and Trump appointees who think it's ok for Trump to store US nuclear secrets or Human Source Intelligence at Mar a Lago.   ",
        "good": "3",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "endliberalfascismnow",
        "time": "7 September, 2022",
        "context": "Say anything Dims at their worst. They never questioned a compromised Garland for being denied a lifetime appointment by Trump. They never questioned a magistrate judge who approved the warrant despite recusing himself from Trump/ Hillary Rico case only weeks earlier. They never questioned the FBI agent who was involved in the corrupt crossfire hurricane case and was walked out of the FBI building last week. These ideologues at MSNBC scoff at the law and care not about precedent. They just want political results. Biden's Mein Kampf speech was a perfect example. ",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "magadied-cultie",
        "time": "7 September, 2022",
        "context": "Reason for having government property in your possession? ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "JSue041",
        "time": "7 September, 2022",
        "context": "And they say Republicans don’t believe in the rule of law!!!!",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "macmurray",
        "time": "7 September, 2022",
        "context": "THE END IS NEAR\nFor Fat Donnie.",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "billyjohnson242",
        "time": "7 September, 2022",
        "context": "Shielding and protecting a known criminal and traitor to our great nation is not a good look for a judge.",
        "good": "3",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "nanhawthorn4452",
        "time": "7 September, 2022",
        "context": "Lauren Boebert: “The FBI can’t come after me. I don’t have any intelligence.”",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "youdon’tsay...",
        "time": "7 September, 2022",
        "context": "Justice oversight. Yeah, I can see why the lefties are terrified. You will all have something else shiny to chase and forget all about this come November.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "There'sHope990",
        "time": "7 September, 2022",
        "context": "Who's fault is it that personal medical records and tax records got mixed in with U.S. confidential and top secret documents?\n\nPerson responsible would be fired in my company.",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "macmurray",
        "time": "7 September, 2022",
        "context": "The FBI needs to tear down Mara-lago board by board, and brick by brick. What else is Fat Donnie hiding? And where?",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "PaidToPlay",
        "time": "7 September, 2022",
        "context": "A third party review is certainly justified considering the political activism in the FBI and DOJ.   Besides that, delaying investigations isn't uncommon.  They still haven't investigated the Biden crime family and they had the Biden family laptop for years.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "wjs70",
        "time": "7 September, 2022",
        "context": "Who got copies of these top secret classified documents?",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "rsal",
        "time": "7 September, 2022",
        "context": "But not a word about biden taking showers with his daughter. ",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "politiguru",
        "time": "7 September, 2022",
        "context": "Kind of looks like a good idea to get a special master.  Now that we see the fbi took medical records.  Which is actually a big no no.  Amongst other things they shouldn't have.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "WarPig552",
        "time": "7 September, 2022",
        "context": "Anyone know why Saudis gave Kushner $2 Billion? What did they get in return?",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "macmurray",
        "time": "7 September, 2022",
        "context": "THE END IS NEAR\nFor Fat Donnie.",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "There'sHope990",
        "time": "7 September, 2022",
        "context": "What about news of nuke information of other countries?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "any1wannapeanut",
        "time": "7 September, 2022",
        "context": "I believe we have seen a proven bias amongst members of the FBI, even proven attempts to remove a sitting president. I do not think the appointing of a special master is out of line in this scenario. It is the past actions of the FBI itself that warranty it.\nWithout past actions I find it unwarranted.\nJust my thoughts.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ellobo999",
        "time": "7 September, 2022",
        "context": "And the TWO viewers of either Propaganda station..... heartily agree! ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "seeitthrough",
        "time": "7 September, 2022",
        "context": "Imagine a nation where you cannot confront your accuser in a court of law to defend yourself.  This is it and a Special Master is as close as you're going to get to a defense.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "TX_Polander",
        "time": "7 September, 2022",
        "context": "More left wing psychodrama 🙄",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "coco1980",
        "time": "7 September, 2022",
        "context": "Let's be clear, the highest confidential restrictions were found at former President Donald Trump's Mar-a-Lago home, some of which included details on a foreign nation's military and nuclear capabilities. That is treasonous and no other president has ever done this Republican or Democratic. ",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "WillBeWild!",
        "time": "7 September, 2022",
        "context": "Remember when they caught the chinese spy Yujing Zhang, with a purse full of electronics, at Mar A Lago? She claimed she was invited, and no one has proved otherwise.\nOf course you don't.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ChetJr",
        "time": "7 September, 2022",
        "context": "George Soros is the money behind many if not all the DA elections causing criminals to return to the streets in high crime areas.  He is the cause of so much return to violence in America he supplies the money to get these prosecutors elected!  Why would liberals vote for these people backed by Soros? Do they want death and destruction in there Cities? Do they enjoy living in fear? I would say yes they do!  Think before you vote it’s your life at risk and your family, catch and release works for the criminals not the residents!!!!",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "facts_not_conspiracy",
        "time": "7 September, 2022",
        "context": "The funny things is traitor Trump's delay tactics will backfire...  since the truth can't come out, people will continue to imagine the worst...  if fat Donnie were truly innocent, he'd want to get the court case going as soon as possible ",
        "good": "6",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "timelord",
        "time": "7 September, 2022",
        "context": "Make an independent-thinking individual wonder what MSNBC and CNN are coving up this time. They have been out of the news business, and in the cover-up business for so long that what else could someone think?  ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "underbelly568",
        "time": "7 September, 2022",
        "context": "And Trump wanted to build the FBI a brand new building in Washington DC!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "gig73",
        "time": "7 September, 2022",
        "context": "\"See it\"?  I think we've seen enough!!!",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "allancraig21",
        "time": "7 September, 2022",
        "context": "CNN and MSNBC is what is wrong with America right now. \nCleotha Abston is the poster child for the left.\nTypical of everything they do.\nJoy Reid will worship that inhumane individual \nand call him a victim of racism.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Encana`",
        "time": "7 September, 2022",
        "context": "FBI will only work with CNN, MSNBC, ABC< and other liberal outlets to leak politicized information.   ",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "wjs70",
        "time": "7 September, 2022",
        "context": "If this DT appointed judge stole top secret documents she would be in jail!",
        "good": "0",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "gabriel07070",
        "time": "7 September, 2022",
        "context": "BEWARE OF BIDEN & HIS SOCIALIST ENABLERS OF THE PRESS! Many years ago, the world suffered through another Biden ego type called Adolf. His (\"anti\") speeches ending up sending over 6 million Europeans to barbed-wire camps and what was called \"a final solution\"...! ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "air.biscuits.and.gravy.",
        "time": "7 September, 2022",
        "context": "Where does MSNBC find these hideous, hate-filled creatures?",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "nanhawthorn4452",
        "time": "7 September, 2022",
        "context": "FBI agents who searched Mar-a-Lago found a document describing a foreign government's military defenses — including its “nuclear capabilities.” There it is. Trump stole classifiednuclear information & lied to the DOJ about having it. He is guilty of Obstruction & Espionage.”",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dockane",
        "time": "7 September, 2022",
        "context": "The BIG Question is why Trump felt compelled to remove top secret information from a secure location, take it to Mar a Lago, and then not return it when asked?   Any speculation from the right or left? ",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "annihilator129",
        "time": "7 September, 2022",
        "context": "no commenting allowed by Fox on Trump bashing the FBI for taking his personal records.  ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cfsd",
        "time": "7 September, 2022",
        "context": "With new management at CNN, NY Times' commentators, all of which are leftists, will be slowly disinvited.  CNN has already terminated 3 of their top left-wing people.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "macmurray",
        "time": "7 September, 2022",
        "context": "Everybody should just relax. Trump will get his day in court, and he can Plead the Fifth 500 times.",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "nanhawthorn4452",
        "time": "7 September, 2022",
        "context": "In July (weeks after the OC sent Kushner a letter re the investigation into the 2 billion he received from Saudi) NY started showing new nuclear survival ads. Trump took S/FRD docs (nuclear weapons/atomic energy docs).\nThis should concern everyone.“\nIn other words, trumps son in law, Jared, got $2 billion for selling US intelligence about the nuclear capability of Israel to Saudi Arabian \nThis is TREASONOUS ",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "oldgold",
        "time": "7 September, 2022",
        "context": "The MSM.  Epitome of corruption and bias.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "nanhawthorn4452",
        "time": "7 September, 2022",
        "context": "FBI agents who searched Mar-a-Lago found a document describing a foreign government's military defenses — including its “nuclear capabilities.” There it is. Trump stole classified nuclear information & lied to the DOJ about having it. He is guilty of Obstruction & Espionage.”",
        "good": "2",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "macmurray",
        "time": "7 September, 2022",
        "context": "So when did MAGA Alpha Dog turn into Beta Chipmunk?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "YouALLGOTWHATYOUVOTEDFOR!",
        "time": "7 September, 2022",
        "context": "If we could only hold journalists accountable for crimes when they “misrepresent” the news would then be factual ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "purpleoutlook",
        "time": "7 September, 2022",
        "context": "Why did he STEAL the classified documents.....he is a traitor and needs to meet the same fate as the Rosenberg's..fair is fair.....imagine that load of lard frying....we could be making pancakes forever with the grease....",
        "good": "3",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "I-identify-as-a-male-Lesbian",
        "time": "7 September, 2022",
        "context": "Why should Trump or anyone trust the FBI because of  Hunters cover up. Good to have an unbiased source over see what’s happening ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "trythinking7067",
        "time": "7 September, 2022",
        "context": "I almost thought this would be a good thing\nAn independent review that would shut the MAGAS up with the truth.\nThen I read some of the MAGA posts showing the almost total lack of smarts they have.\n I realized truth doesn't matter to them so the law just needs to do its job and ignore them.",
        "good": "1",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "dems-r-useless-bs-artists539",
        "time": "7 September, 2022",
        "context": "Msnbc... home of the race hustling crime cheerleaders",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "FranklyScarlet888",
        "time": "7 September, 2022",
        "context": "Trump has been guilty of lying since Stormy and Mexico paying for the wall",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "dbodine",
        "time": "7 September, 2022",
        "context": "Amazing that we have a media that is so biased it cannot see the forest through the trees that are pulling America apart. Trump exposed ALL (both sides of the political fence) and the how complicit the media was and still is, that they are willing to do ANYTHING to get rid of him. Yet Hilary w e-mails and destruction of e-mails and Pelosi's riches obtained how? Or even Biden and his family dealings nary a word, nothing but crickets, silence in these areas speaks volumes. ",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "CharlemagneTheElder",
        "time": "7 September, 2022",
        "context": "When the facts are against you, argue the law.\nWhen the law is against you, argue the facts.\nWhen the facts and the law are against you, delay, delay, delay.\nTeam Trump is in full delay mode.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "TrueAntifascist",
        "time": "7 September, 2022",
        "context": "These Democrats championed the massive pre-election DISINFORMATION that the Hunter laptop story was “Russian disinformation” to win an election. They have no conscience and ZERO INTEGRITY. ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Downrange553",
        "time": "7 September, 2022",
        "context": "Trump and his supporters are needed to stop our country from becoming like the once oil rich nation, Venezuela. This is the ole coot in the White House greatest fear.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tuckerstvdinner",
        "time": "7 September, 2022",
        "context": "And in a lonely glass window in Club45 Manhattan, sits a poor forgotten Top Secret file folder, it's contents lost to the world ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "macmurray",
        "time": "7 September, 2022",
        "context": "Trump lookin’ scared. Maybe Melania will let him hold her hand. If it’s in the prenup.",
        "good": "5",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "patrioticsoutherner",
        "time": "7 September, 2022",
        "context": "I wish those media clowns were as interested in talking about Hunter Biden and Joe’s China connections and Hillary and others lies regarding the Russian hoax prior to the presidential election as they are about a judge’s decision on a Special Master…",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ChetJr",
        "time": "7 September, 2022",
        "context": "Why not look for Justice and what happened or what is happening? Let’s get the truth, we can’t depend on the upper management of FBI or the DOJ they are biased for sure! Just look at past events and how they were handled by both!  Why people may not feel safe with either agency look to past practice’s. Look at Russia Gate, Hunter Biden lap top where is the justice! Operation Fast and Furious Eric Holder many dead with his gun deal and nothing ever happened he was found in contempt of Congress what ever happened?  Nothing!!!",
        "good": "3",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "kabarmike777",
        "time": "7 September, 2022",
        "context": "Here we see the extremely common and dangerous race baiter species, they use victim hood as their defense. But as in nature way, they are losing their abilities to deflect criticism, depending more on their shrill screams to ward off any gains on their territories! Scientists estimate that they will soon be extinct! Except for those kept in captivity and stuffed in museums!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "MrNatural291",
        "time": "7 September, 2022",
        "context": "Bill Barr on Fox also stated that the judge was wrong and without basis for her decision.",
        "good": "1",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "wooly28",
        "time": "7 September, 2022",
        "context": "November.\nJust.................................NOVEMBER.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "harve",
        "time": "7 September, 2022",
        "context": "Of course, democrats always support nonpartisan courts, but ONLY if they agree with the decisions and  democrats hate independent reviews that THEY cannot control.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bigfootakadarryl",
        "time": "7 September, 2022",
        "context": "They took new paper articles that were printed out, passports, privileged client attorney documents, none of which is covered by the warrant.  And people are against some oversight, why?  Clearly they care more about getting Trump then the rule of law. ",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "blaino15825",
        "time": "7 September, 2022",
        "context": "Simple question - Why are the DOJ and liberals so opposed to an independent special master to review the documents? I think we all know the answer to that don't we.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "WillBeWild!",
        "time": "7 September, 2022",
        "context": "Imagine if a lame duck Obama appointee stopped one the 50 plus Clinton investigations. Conservatives would not handle that well.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rational_republican",
        "time": "7 September, 2022",
        "context": "Come on People - FOX NEWS \"ATTACKED\" the Judge - at least their top legal guest analyst did.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tuckerstvdinner",
        "time": "7 September, 2022",
        "context": "Tough question...who do you get?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "macmurray",
        "time": "7 September, 2022",
        "context": "Trump hasn’t been this scared since he was slapped by Mommy.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "insidecen",
        "time": "7 September, 2022",
        "context": "I never heard once the word \"corruption\" used  by mainstream press with regard to judge's opinion.\nThere indeed maybe a cry that she overstepped the powers of her bench, in the orders she issued...and there are truly grounds for appeal....but is it worth it to the DOJ...for more stalling..probably not.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ronlandau",
        "time": "7 September, 2022",
        "context": "Mystal's comment that the judge is biased and corrupt is slanderous. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "wooly28",
        "time": "7 September, 2022",
        "context": "Trump wins again.\nIt drives them crazy...SO MUCH WINNING!",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "dajowi474",
        "time": "7 September, 2022",
        "context": "For CNN and MSNBC Trump Derangement Syndrome is a chronic condition.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "smellLikefriedrussiantoday",
        "time": "7 September, 2022",
        "context": "“People said this was unprecedented,” Barr told to Fox News. “But it’s also unprecedented for a president to take all this classified information and put them in a country club, okay?”\nHe is right. ",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "FranklyScarlet888",
        "time": "7 September, 2022",
        "context": "Its official… everything in the world is corrupt but The Donald.",
        "good": "2",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "davetruthteller",
        "time": "7 September, 2022",
        "context": "It wasn’t the networks that blasted the ruling.  It was every legal expert they talked to including Trump’s own Attorney General.  ",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Politicomask",
        "time": "7 September, 2022",
        "context": "Why wouldnt liberals from cnn and msnbc want a truly independent review? \nIm guessing this is because in seven years of accusing and attacking Trump they have presented no concrete evidence of any of the claims they have made.\nIm sure this is the same case. They have no evidence of any wrong doing but they are still going to defamate him.\nSurely an Independent review benefits everyone.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "AllNavy200",
        "time": "7 September, 2022",
        "context": "Regardless the subject; cnn and msnbc would make a good fire….",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "lock’emnu",
        "time": "7 September, 2022",
        "context": "Does anyone else worry about WHY these woke impersonators of journalism are so worried about President Trump having a small slice of fairness. WHY does it worry them so much? Their posturing & blubbering is becoming ridiculous....hummmmm....why?!?!?!\nWhat a bunch of ridiculous people. Fairness is not in their repertoire  ",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "midwestfoxhound",
        "time": "7 September, 2022",
        "context": "Bill Barr said it ought to be appealed too.  Fox put him on.  Are they just like MSNBC and CNN?",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "trythinking7067",
        "time": "7 September, 2022",
        "context": "It is so obvious trump is guilty here. The MAGAS can't handle it\nSo dim",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "purpleoutlook",
        "time": "7 September, 2022",
        "context": "The promise of a place on the Supreme Court can be very tempting, eh Aileen?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "vietvet66",
        "time": "7 September, 2022",
        "context": "Looks like libs are a threat to our democracy, not accepting a judges decision again.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "gunsnguitars",
        "time": "7 September, 2022",
        "context": "Haters don’t accept anything other than hate.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ProudLegalAmerican",
        "time": "7 September, 2022",
        "context": "Reid has a big loud mouth and she doesn't know what she's talking about most of the time!  She never went to a law school to get her ID nor she got PhD in Criminal Justice to understand how the US judicial System works!  There are things that are 100% legal and reasonable!  How about H. Clinton's classified files on her unclassified server in her house?  Only way anyone can get to Trump's kept classified files and documents in the locked vaults with security cameras monitoring 24x7 and security guards around at his Mar-a-Largo residence, even Tom Cruise of the \"Mission Impossible Force\" or James Bonnd 007 of MI5/MI6 can't even get pass through without being detected or caught!  Also, hackers from China, N. Korea, Russia, Iran, UK MI6, and Israel Mosad can't even get to these file only because they only exist in paper copies only!  Gotcha!",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "geraldcrumley",
        "time": "7 September, 2022",
        "context": "OUR LIVING GOD WHO IS OUR CREATOR AND HEAVENLY FATHER CONTINUES TO EXPOSE THE EVIL HEART'S OF OUR ENEMIES!!\nWHILE PROTECTING OUR LEADER \nPRESIDENT TRUMP. \nGOD'S PLAN IS PERFECT. \nPRAISE GOD. \nTO GOD BE ALL THE GLORY  , AMEN. ",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "guidoswb",
        "time": "7 September, 2022",
        "context": "I guess the 14 people that watch these shows will be as enraged as the hacks on the shows are.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "trythinking7067",
        "time": "7 September, 2022",
        "context": "\"The opinion, I think, was wrong, and I think the government should appeal it,\"... \"It's deeply flawed in a number of ways. I don't think the appointment of a special master is going to hold up.\"\nBill Barr",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "I-identify-as-a-male-Lesbian",
        "time": "7 September, 2022",
        "context": "The FBI whistle blowers make the FBI look totally corrupt, they need the oversight. I wouldn’t trust them to dog sit, they’re an arm of the DNC, the Hunter cover up proves it, and 63% of Americans believe it.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "FranklyScarlet888",
        "time": "7 September, 2022",
        "context": "Red States will soon be demanding records of women's menstrual cycles",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "grandpasnowflake",
        "time": "7 September, 2022",
        "context": "I’ve seen a lot of legal analysis of the ruling, including that of the former president’s Attorney General, and none of it was attacking the judge personally. We’ll see how well her ruling stands up to appeal in District Court. The fact that she included “executive privilege“ is a problem. A special master usually only deals with attorney-client privilege. There’s no clear definition of what “executive privilege” is and it opens the door to more delays as Trump’s team is going to challenge every document on that basis. None of the classified documents should be included in the special master’s review IMO. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Downrange553",
        "time": "7 September, 2022",
        "context": "The Biden Administration is under a curse. Expect the misery index under this corrupt administration to continue to rise. Our only hope is for the people to have the good sense to vote out all Dems who are seeking reelection in 2022.",
        "good": "4",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "commentoftheday",
        "time": "7 September, 2022",
        "context": "So, what exactly is wrong with shining more light on a situation that millions of Americans question? If the truth is damaging or exculpatory - what is wrong with the actual facts coming out?",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Downrange553",
        "time": "7 September, 2022",
        "context": "Dems, socialists and Marxists are one and the same. They have a stammering child that leads them. ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "geo25825",
        "time": "7 September, 2022",
        "context": "The judge should issue cease and desist order against CNN, MSNBC and all MSM making a mockery of our justice system.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Steven45",
        "time": "7 September, 2022",
        "context": "The Biden administration actually stole private things from Trump's home. This demands an Impeachment Investigation.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "FranklyScarlet888",
        "time": "7 September, 2022",
        "context": "MAGA is doing GOD's work... I guess they think HE's an underachiever ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Steven45",
        "time": "7 September, 2022",
        "context": "Only people who watch CNN or MSNBC are the Biden zombie cultists.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "botno.1621.4546",
        "time": "7 September, 2022",
        "context": "trump's company admits to tax evasion and fraud, but MAGA don't care, must be a badge of honor for MAGA, maybe that's why the are afraid of the IRS, just add the IRS to the MAGA list of enemies of the state.",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "trythinking7067",
        "time": "7 September, 2022",
        "context": "no more truth from CNN and MSNBC\nIt really messes up the MAGA Republicans",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "tym2trn",
        "time": "7 September, 2022",
        "context": "Shut CNN and MSNBC down! ",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "stnmca",
        "time": "7 September, 2022",
        "context": "Wow it must be bash Trump day here. I see very familiar scabs here today.\n ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "merelyamused385",
        "time": "7 September, 2022",
        "context": "The left already went after police...Soros is buying D.A.s...now it's the judges' turn.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "CharlemagneTheElder",
        "time": "7 September, 2022",
        "context": "\" Reid said as she smirked.\"\nThis, from the channel of Tucker Carlson and Sean Hannity. \nIrony is not yet dead. ",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Fly130’s",
        "time": "7 September, 2022",
        "context": "The whole world knows Biden and the liberal socialist Democrats are totally corrupt.  The news media is no longer the news media.  Look at China’s News Media. \n\nType\nState-owned enterprise\nIndustry\nState media\nPredecessors\nChina Central Television\nChina National Radio\nChina Radio International\nFounded\n21 March 2018; 4 years ago\nHeadquarters\nChina Media Group Headquarters, Beijing, China\nArea served\nWorldwide\nKey people\nShen Haixiong\n(President)\nOwner\nChinese Communist Party\nGovernment of the People's Republic of China\nParent\nPublicity Department of the Chinese Communist Party\nState Council of the People's Republic of China",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "displacedbearfan",
        "time": "7 September, 2022",
        "context": "Hey dummy, by Trump saying \"my, mine\", he's doing something the left can't understand.  He's taking ownership, not in the sense of possession, but in the act of accountability.  When he says, \"my generals\", he is taking the burden of command, and placing it on his own shoulders as commander in chief.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "uknownance",
        "time": "7 September, 2022",
        "context": "Dem racists be maddd",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "nowwhat?186",
        "time": "7 September, 2022",
        "context": "DIFFERENTtalkingHEADzombieSAMEnarrative",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tuffngruff",
        "time": "7 September, 2022",
        "context": "So all of a sudden the goons on CNBC and CNN are legal experts?  And the Trump haters buy into it?  This is hilarious!!!",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Stablegeniuswiththebestwords",
        "time": "7 September, 2022",
        "context": "Doesn't make it right, but no different from what Fox does.  ",
        "good": "1",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "Steven45",
        "time": "7 September, 2022",
        "context": "There are foreigners on here trying to sell pictures of their own countries military installations on Facebook. ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "nanhawthorn4452",
        "time": "7 September, 2022",
        "context": "Yesterday we learned Dr Oz thinks having kids with your own cousin isn’t a big deal and we also found out Trump kept nuclear secrets at his hotel — and no Republican has said a thing about either. The party of family values and law and order.",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "Steven45",
        "time": "7 September, 2022",
        "context": "CNN and MSNBC are Democrat propaganda machines and not much else.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "45tojail",
        "time": "7 September, 2022",
        "context": "The Question is how much $$$$ did she want to protect DumpF 🐷",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "bigdufusinc",
        "time": "7 September, 2022",
        "context": "They finally got their hands on his medical & tax records. Illegally though, if not specifically within the scope of the search warrant. That alone would warrant a Special Master.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "nanhawthorn4452",
        "time": "7 September, 2022",
        "context": "NEW: FBI agents who searched Mar-a-Lago found a document describing a foreign government's military defenses — including its “nuclear capabilities.” There it is. Trump stole classifiednuclear information & lied to the DOJ about having it. He is guilty of Obstruction & Espionage.”",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "Steven45",
        "time": "7 September, 2022",
        "context": "Defund and Abolish CNN and MSNBC. Boycott their sponsors and shut down their propaganda machines.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "316",
        "time": "7 September, 2022",
        "context": "The American Pravda",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ChetJr",
        "time": "7 September, 2022",
        "context": "I guess the liberal news MSNBC aren’t interested in true justice!  Funny convicted murders get appeals after appears but and EX president is guilty as charged without jury trial or court proceedings.\n   America knows the FBI and DOJ have been against Trump for 5 yrs. and I might say against conservatives since Obama took office!  Why not let someone from outside both agencies look at what was recovered at Mar a Logo?  Is there a problem with both FBI and DOJ? yes there has been in the past issues with both, especially with Democrats in charge, look at past events! Clinton, Comey, Page, Strzok, Wray and the latest Thibault.  All worked against Trump at the direction of who? Garland? Wray? Obama? Clinton?  Let’s get to the truth you can’t seem to trust those in charge they may be dirty, bring in the outsiders!!!",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "trythinking7067",
        "time": "7 September, 2022",
        "context": "The government has very strong evidence of what it really needs to determine whether charges are appropriate,\nBill Barr",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "DatabaseAdmin",
        "time": "7 September, 2022",
        "context": "Of course they don't like it. They want this to be as biased as possible against Trump.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "nanhawthorn4452",
        "time": "7 September, 2022",
        "context": "BREAKING: Former U.S. Secretary of Defense William Cohen calls Trump a “clear and present threat to democracy,” and says he should be “subject to criminal prosecution.”",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "FranklyScarlet888",
        "time": "7 September, 2022",
        "context": "When you look at how Trump operates... it's Fascism 101",
        "good": "2",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "dembs",
        "time": "7 September, 2022",
        "context": "Never forget - EVERYTHING,and I mean EVERYTHING - democrats accuse republicans of, democrats have already done it or are in the process of doing it. Democrats say they want democracy, but their actions say they want to shove their agenda down YOUR throat so they can dictate what YOU can think, do and say. ",
        "good": "3",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "AtoryaA/E",
        "time": "7 September, 2022",
        "context": "This is why Nickelodeon is beating CNN in ratings. Biden is trying to insure that the American people will not vote for president Trump in 2024, but little does he know that we will vote for president Trump again come 2024. \nBecause he is the only person that can help us get out of all Biden’s policies and let Biden rest in an old peoples house!!",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "ArthurCurry",
        "time": "7 September, 2022",
        "context": "Do you know who isn’t literally attacking the Donnie appointed judge?  Democrats.   Unlike the MAGA cult republicans who made death threats to the judge who issued the warrant on the search at mar a lago and the death threats they make to the FBI.  Gee and they call themselves the party of law and order.  ",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "gubble",
        "time": "7 September, 2022",
        "context": "This is hysterical.  Must be nice to think one’s so perfect like the dems do.  FUNNY ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "thishateispathetic",
        "time": "7 September, 2022",
        "context": "As they should. Hold the man responsible. ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "americanmercurial",
        "time": "7 September, 2022",
        "context": "Gee, things didn’t turn out the way CNN wanted them to. Again.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cloneprone",
        "time": "7 September, 2022",
        "context": "Joy Reid supported the FBI when they tampered with evidence in the Black Panther trials.\nShe especially praised the job they tried to do on Martin Luther King so, at least she's fair.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "markforte",
        "time": "7 September, 2022",
        "context": "What is wrong with FOX??  My God, they can’t even use verbs properly!!  As in,\n“She then past on the baton to frequent MSNBC guest…”\nSERIOUSLY???????\nUmm,  I think you mean “She then PASSED on the baton…”  NOT past!!!!!\nWOW, 4th graders in the FOX Newsroom, and probably the EXECUTIVE OFFICES!!!\nHAHAHAHA! ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "macmurray",
        "time": "7 September, 2022",
        "context": "BREAKING NEWS! Latest study shows that people who call MAGA \"patriots\" are the same people who call roadkill a \"banquet.\"",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "shallew",
        "time": "7 September, 2022",
        "context": "Liberal heads exploding is quite entertaining. ",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cranefrompa",
        "time": "7 September, 2022",
        "context": "It's just an old fashion Trump court delay.  Won't change the facts.  Eventually he'll have to explain what he was doing with those documents and why he thought he didn't have to return them.  It's a big waste of everyone's time.  No reason to take that stuff in the first place.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "RedRaindrop",
        "time": "7 September, 2022",
        "context": "FBI & DOJ should have co-ordinated raids on the dumps Mar-a-Lago, Bedminister,Trump Tower and other properties for a protracted search for other documents.. You know FDJT is a seditious, treasonous insurrectionist who has sold out America for financial gain.. Also lets arrest everyone in the FDJT family and lock them up as well as they are all pariah's and stains on America ",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "I-identify-as-a-male-Lesbian",
        "time": "7 September, 2022",
        "context": "If you young people ever want to own a house and have a retirement account, you better get as many democrats out of office as possible in November, or plan on being poor your whole life.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mistabone771",
        "time": "7 September, 2022",
        "context": "I just love it when libbies clutch their pearls and hyperventilate. It makes me all warm and fuzzy inside.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "gulfcoaster438",
        "time": "7 September, 2022",
        "context": "the democratic liberal socialist have unlimited resources for lawyers, and since trump is no longer president they want him to pay out of pocket, to push him to a point to quit, and leave, and plant evidence on him, to keep him from running for office, he is a outsider, does not follow their rules of agenda of being a carrear politician, trump will fight them forever, and then someone else will pick up the fight, if something happens to him, he will be a marter for freedom, against the democratic socialist machine, he is for the people, ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "macmurray",
        "time": "7 September, 2022",
        "context": "I trust Presidents that don't Plead the Fifth more than 440 times.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "trythinking7067",
        "time": "7 September, 2022",
        "context": "See CNN, MSNBC slam Trump-appointed judge, accuse her of corruption after special master appointment\nSee Bill Barr call this ruling deeply flawed and wrong.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bigmaple37",
        "time": "7 September, 2022",
        "context": "\"The opinion, I think, was wrong, and I think the government should appeal it. It's deeply flawed in a number of ways,\" Barr said on Fox on Tuesday.  For those Trumpers who cannot remember who Barr is, he was Trumps Attorney General who ran the DOJ.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "RedRaindrop",
        "time": "7 September, 2022",
        "context": "FDJT should be taken to Death Valley and left without any provisions and he can show the world his survival skills.. If he does not return then America would truly start to be great again. ",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "smitty3131488",
        "time": "7 September, 2022",
        "context": "So the grifters that pushed the Russia hoax relentlessly are against a neutral party overseeing the corruption rampant in the DOJ and FBI. Just more proof the judge got it right. ",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "FranklyScarlet888",
        "time": "7 September, 2022",
        "context": "FBI AGENTS:\n“Hey look… Melania’s panties!!!\n..and check this out… MADE IN CHINA\"",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dcstewart8162",
        "time": "7 September, 2022",
        "context": "Trump judge shopped for Judge Cannon whose court was out the jurisdiction. She should have referred the case back to Judge Reinhart and she said as much in her initial response.\n\"Media figures accused the judge of being biased and giving Trump special privileges\"",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "FranklyScarlet888",
        "time": "7 September, 2022",
        "context": "Trump will never be held responsible ... and since Lindsey knows MAGA will turn violent  (SHE was there on Jan 6th) ... MAGA will keep the Orange Caligula MAGA King from wearing the orange jumpsuit.",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "Mr.Truth907",
        "time": "7 September, 2022",
        "context": "Here you go again Fox, talking about Joy Reid. What a waste of time and thought.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "charlesulysses13",
        "time": "7 September, 2022",
        "context": "I'll give him this, Trump is the de facto grand master of three things; shameless self-aggrandizement, shuffling massive debt, and avoiding accountability via protracted exhaustion of our legal system.",
        "good": "6",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "macmurray",
        "time": "7 September, 2022",
        "context": "Everybody should just relax. Trump will get his day in court. And if he wants to, he can Plead the Fifth 500 times.",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "woofer5",
        "time": "7 September, 2022",
        "context": "“Forget it, Jake, it’s Mar a Lago.”",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "levergunner889",
        "time": "7 September, 2022",
        "context": "Even they know that the FBI is in trouble that the neo-leftist media can't cover up.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "alain252",
        "time": "7 September, 2022",
        "context": "Don't forget to add ex-Trumper William Barr to those who feel the judge is biased and wrong.",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "FranklyScarlet888",
        "time": "7 September, 2022",
        "context": "Everyone knows the FBI planted the documents at Mar-a-Lago\nand Trump never knew about them!\nOh what?  I’ve been on vacation for 2 weeks…\nReally????   \nLet’s get to the REAL crime … Hunter’s Laptop!!!",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "macmurray",
        "time": "7 September, 2022",
        "context": "Fat Donnie sure got lots of ‘splainin’ to do.",
        "good": "2",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "consrvusa",
        "time": "7 September, 2022",
        "context": "Again, the left accusing everyone else of doing what they have done all along. It's only wrong if it's not how they want it to be. The biggest hypocrites of our time.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Itsfullofidiots!?!",
        "time": "7 September, 2022",
        "context": "\"MSNBC’s \"The ReidOut\" host Joy Reid hosted an entire panel of disgruntled interviewees on Monday, with guests claiming that the judge’s decision was wrong and \"corrupt,\" among other things.\", quote\nTHIS IS SLANDER.\n\"She’s biased and corrupt. Like, I don’t know what to tell everybody anymore,\" Mystal said.\", quote\nTHIS IS SLANDER.\nThe judge should sue both the speakers and the networks for which they work as the accusations of corruption against a judge is a serious charge.\n\"Slander; the action or crime of making a false spoken statement damaging to a person's reputation.\n\"he is suing the TV network for slander\"",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "grumpymel",
        "time": "7 September, 2022",
        "context": "There is nothing abnormal about a Court appointing a Special Master when there is a decent chance that records obtained by a prosecutor as part of a search may contain attorney-client privilege. Complaining about this shows just how biased these talking heads really are. \nThis is a bog standard thing that happens all the time with regular people in regular cases. It's an assurance from the Court that the prosecutor isn't accessing material they are not legally entitled to access and can assure a defendant that they will receive a fair trial if it comes to that.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "donnerparty1",
        "time": "7 September, 2022",
        "context": "The experts overheard lawyers chatting in a bar during happy hour.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "texaswatching641",
        "time": "7 September, 2022",
        "context": "Democrats, the 2016, the election was stolen, decertify the electoral college.  \nRussian collusion based on clinton fabricate hit pieces.  Used the fabricated documents to verify the same fabricated documents.  Democrats, no need to validate the documents, how could they not be true.\n2020, the big lie.  One would think if the democrats believed it to be a big lie, they would have no problem supporting instead doing everything they can to prevent audits.\n2022, democrats insist that Trump left the white house with uber secret documents that could spell the doom of the country.  Judge shopped for an individual that openly hated Trump to raid Trump's residence with 25 armed individuals where individuals with suits and clipboards would have been sufficient.  \nThere is an obvious pattern pattern on display.  Democrats do something incredibly  sighted and in their idiotic narcissism fail to see how  exposed they have placed themselves in.   By denying the need for impartial audits, it makes their overt corrupt practices even more obvious.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "want2believe_ts-13",
        "time": "7 September, 2022",
        "context": "Meanwhile Bill Barr was on Fox saying the exact same thing, because it's true.  The trump team failed to justify the need for a special master and this is merely judicial activism. ",
        "good": "2",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "Youvotedforthis994",
        "time": "7 September, 2022",
        "context": "Justice for all? Not if the Democrats are ruling.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "justacoguy",
        "time": "7 September, 2022",
        "context": "It's funny how someone who has never spent one day in law school are, all of a sudden, legal experts. ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bklynb173",
        "time": "7 September, 2022",
        "context": "You know something is right when the liberal fascists lose their minds. ",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "azdude57",
        "time": "7 September, 2022",
        "context": "I guess only liberal judges can give you a fair ruling!!! Not",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "WTFReally?!",
        "time": "7 September, 2022",
        "context": "How did this happen? I thought they were defunding the FBI! ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "I-identify-as-a-male-Lesbian",
        "time": "7 September, 2022",
        "context": "Blacks complaining about being treated ‘special’, what a joke. The democrats treat them like the chosen ones.  ",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "FranklyScarlet888",
        "time": "7 September, 2022",
        "context": "Everything is corrupt in America...but Trump?!\nhow did MAGA get so lost?",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "beareroflight446",
        "time": "7 September, 2022",
        "context": "It doesn't matter what Trump does. The cult will defend him every time no matter what. ",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "0331Leatherneck",
        "time": "7 September, 2022",
        "context": "Keep on watching your 401k, investments, and any chance of young people wanting to be able to buy their first home! Apparently, the Democrats enjoy paying more for everything and want their retirement dwindle away! We’re doing just fine, but there are millions of Americans that are really struggling! Great job, Democrats this is what you voted for over a few tweets. SMH",
        "good": "4",
        "bad": "0",
        "replies": []
    }
]