[
    {
        "user_name": "twobitswerth",
        "time": "2 days ago",
        "context": "black woman James, affirmative action AG with job security.    progressives still afflicted with TDS",
        "good": "5",
        "bad": "1",
        "replies": [
            {
                "user_name": "abide842",
                "time": "2 days ago",
                "context": "You're still alive Archie Bunker?",
                "good": "0",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "carsickus",
        "time": "2 days ago",
        "context": "I bet within 5-8 years she will be indicted for taking bribes or embezzlement.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "fair&amp;balanced678",
        "time": "2 days ago",
        "context": "This is only the beginning.  Indictments coming from Georgia and Arizona, as well as DOJ and the January 6th Congressional Committee.  Until what he did on Jan 6, I had a little sympathy for old Trump.  After Jan 6, zero.  The ONUS is now on Donald Trump. ",
        "good": "1",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "BenFox49882",
        "time": "2 days ago",
        "context": "The New York branch of the Swamp is apparently as afraid of Trump and as deranged as the Wash. DC main hub.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "stronglight",
        "time": "2 days ago",
        "context": "A) Trump doesn't appraise his own property, a professional appraiser does or a county clerk that's trying to get more $$$ in taxes by over valuing\nB) litita james is not a professional appraiser & has no clue",
        "good": "7",
        "bad": "1",
        "replies": [
            {
                "user_name": "levergunner889",
                "time": "2 days ago",
                "context": "And a bank doesn't rely on the borrower's opinion, they have their own people that do the appraising.\nThat's why all his proposals have the disclaimer that warns \"don't rely on our opinion, use your own appraiser\".",
                "good": "4",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "5klumens",
                        "time": "2 days ago",
                        "context": "Interesting that the NY State Attorney General's \"investigation\" found Trump was the ONLY perpetrator of this kind of alleged fraud. She may have had a limited focus as she examined the many bank records.",
                        "good": "1",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "comeagain",
                                "time": "2 days ago",
                                "context": "Yeah, it should be like speeding.  They aren’t allowed to give ANY speeders a ticket unless they give ALL speeders a ticket.",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "user_name": "comeagain",
                        "time": "2 days ago",
                        "context": "The bank depends information from the owner. Cushman and wakesfield did the appraisals for trump.  They fought for a while, but have submitted documents that were subpoenaed.  Looks like they had some strange rules when working for trump.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "comeagain",
                "time": "2 days ago",
                "context": "Trump paid a firm called Cushman and Wakefield to appraise the property. It appears they had some questionable practices when doing work for trump.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "goodbyeusa1776",
        "time": "2 days ago",
        "context": "Imagine a police officer continuously investigating somebody just because they had differing political views? The officer would be fired immediately.",
        "good": "3",
        "bad": "1",
        "replies": [
            {
                "user_name": "comeagain",
                "time": "2 days ago",
                "context": "True. But that’s not what’s happening here.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "amerfirst970",
                        "time": "2 days ago",
                        "context": "What's happening here is an investigation looking for a cause.  If a lender or insurer had any issue with Trump, then THEY would have sued.   No need for a state Attorney General.   So, WHY is she suing?",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "doloreshaze",
                "time": "2 days ago",
                "context": "Y’all investigated Hillary Clinton for 30 years. Never came up with a single indictable offense.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "goodbyeusa1776",
        "time": "2 days ago",
        "context": "If you can’t defend Biden, attack Trump.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Bumblebee7",
        "time": "2 days ago",
        "context": "Its Soros who is running our country. The liberals think its them.  The media think they are saving themselves.  Joke is on Democrats and liberal media.  Soros won't stop until we are under communist rule.",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "abide842",
                "time": "2 days ago",
                "context": "It would be awesome to have Thanksgiving dinner with you and provide you with drinks.\nPure comedy gold you would be.",
                "good": "0",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "TruthDetector4All",
        "time": "2 days ago",
        "context": "What a waste of time. Nothing will come of this except for the egg on Letitia's face.\n ",
        "good": "4",
        "bad": "1",
        "replies": [
            {
                "user_name": "levergunner889",
                "time": "2 days ago",
                "context": "And a little position in the White House when she loses this November.",
                "good": "2",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "newusa",
        "time": "2 days ago",
        "context": "Trump the worst president in the history!",
        "good": "2",
        "bad": "2",
        "replies": [
            {
                "user_name": "rickand7",
                "time": "2 days ago",
                "context": "the current president is the worst by far. unfortunately for your mental disposition it's terrible for me to tell you this but Trump was actually one of the best.",
                "good": "1",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "fair&amp;balanced678",
                        "time": "2 days ago",
                        "context": "You are both WRONG and DELUSIONAL if you still believe that.  Doubt you really do and more likely a paid PAC BOT.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "benof67",
                "time": "2 days ago",
                "context": "President Trump was the best and most accomplished President America has ever had.",
                "good": "2",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "fair&amp;balanced678",
                        "time": "2 days ago",
                        "context": "Sure he was and Benito Mussolini was the best and accomplished Presidents Italy ever had.",
                        "good": "1",
                        "bad": "1",
                        "replies": [
                            {
                                "user_name": "benof67",
                                "time": "2 days ago",
                                "context": "If you knew one thing about world history, you'd understand that Biden's Presidency mirrors Mussolini's Fascist model.  Mussolini once said the Ideal fascist state requires a strong marriage between the State and Corop oration.  Biden has that perfect marriage with American Corporations.  Facebook, Twitter, and nearly every Media corporation in America are arms of Bidens Totalitarian Neo Fascist Democrat party.  Bottom line Biden is a Totalitarian Neo Fascist President.",
                                "good": "1",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "oldmarinetoo",
        "time": "2 days ago",
        "context": "Trump is laughing about how far he is in this twits half empty head....she ain't never coming out.....love her misery....you see thousands a day here just like her.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "allprogressivesarepsychotic",
        "time": "2 days ago",
        "context": "Say it as it is, Lunatics, Psychotics, Crazies, no grasp of or footing on our plane of existence but definitely not progressive, as for those who post on Twitter 99.9% are psychotic.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "cueball222",
                "time": "2 days ago",
                "context": "Rush Limbaugh always refered to Twitter as a sewer. As usual, he was correct.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "nashmetal018",
        "time": "1 day ago",
        "context": "TDS plain and simple. She should be prosecuted for harassment and pay restitution.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "vietnamvet65.66",
        "time": "2 days ago",
        "context": "Her suit is full of lies.  For example: if you Google the size of Trump's apartment... it says 33000 square feet.  The building is 58 stories and has almost 1,000,000 square feet.  That works out to 17,000 square feet per story.  As he had the top three floors it is a certainty that he had at least the 30,000 square feet that he claims.\n\nI predict this case will be thrown out... just like the Russian collusion case was thrown out.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "missouririchard",
        "time": "2 days ago",
        "context": "Political vengence runs deep on Twitter, and of course is a one-way bias street.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "comeagain",
        "time": "2 days ago",
        "context": "Fox should get over the “he said she said”.\nThe real news is judge cannons verdict just got overturned.  DOJ is now allowed to review the classified documents taken from Maralago 😊",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "bobbysuds219",
        "time": "2 days ago",
        "context": "Miss thing doesn’t know anything about business and how valuations are done. \n\nClearly, she doesn’t know anything about the law either. There has to be a complaint first. Is it found in the Steele dossier?  Oh, wait. Crooked Hillary is drafting the complaint right now. Stay tuned for a playbook repeat. \n\nShe’s a fascist. She said Trump was an illegitimate president. That is precisely what Biden defines as a fascist. \n\nWhat nonsense. She should be disbarred immediately. \n\nAnd now, America, back to our focus on the open Biden border.  \n\nStay frosty and focused. Vote her and other ridiculous deep staters out of office. They are a disgrace. ",
        "good": "2",
        "bad": "0",
        "replies": [
            {
                "user_name": "cueball222",
                "time": "2 days ago",
                "context": "We all know that politicians never exagerate. Ask Biden about Cornpop.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "zd1",
        "time": "2 days ago",
        "context": "This was one of the significant cases against Trump, with a threat of criminal charges - but the prosecutor doesn't seem to have enough evidence for the AG to support a criminal case.  The Civil case is a huge break for Trump - because it shows that the NY case will not be a criminal charge - and as a Billionaire - it should be no problem to negotiate a settlement with the state.  A civil case like this would cost each party millions or tens of millions and last over a year.   But the Civil case is also a deadly blow to Trump - threatening ALL his business and properties in NY - so he MUST settle.  It's within his means financially - and the RISK, moreso than the cost, demands he settle.  Word is the Trump team already made an offer.  Trump will really suffer to buy out of this - he may opt to fight.  In any case, it puts more pressure on Trump at the moment.",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "granee",
        "time": "2 days ago",
        "context": "when are the libs going to grow up and do what is right and not because of their hate and jealousy",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "txcnsrvtv",
        "time": "2 days ago",
        "context": "She filed it civilly because the burden of proof is much less than in a criminal case.  She has nothing but feelings.  It is how libs govern, feelings.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "lizg01",
        "time": "2 days ago",
        "context": "No evidence of a crime? No problem we'll just file a bogus civil suit in NY for some reason",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "doloreshaze",
        "time": "2 days ago",
        "context": "Lol. The crooked kids signed off on the shady dealings too.\n\nLock them all up.",
        "good": "0",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "allprogressivesarepsychotic",
        "time": "2 days ago",
        "context": "Letitia James is your typical loyal Globalist marionette they make laws that fulfill the desires of their Globalist masters.",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "abide842",
                "time": "2 days ago",
                "context": "What do you mean by \"Globalist\"?",
                "good": "0",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "waclaw501848",
                        "time": "2 days ago",
                        "context": "Didn't you know? This whole Letitia James and Nadler clown show is subsidized\nby the Globalist George Soros and his covert PACs. It is a sewer.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "seabee1982",
        "time": "2 days ago",
        "context": "To have standing to file a civil suit you must have sustained a loss or injury. Please AG explain how you have standing to file suit against Trump?",
        "good": "5",
        "bad": "0",
        "replies": [
            {
                "user_name": "zd1",
                "time": "2 days ago",
                "context": "Loss of taxes due.",
                "good": "0",
                "bad": "2",
                "replies": [
                    {
                        "user_name": "lizg01",
                        "time": "2 days ago",
                        "context": "She doesn't know better than the banks who worked with Trumps companies.",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "amerfirst970",
        "time": "2 days ago",
        "context": "Other than Letitia James who are the complainants in this lawsuit?   And Letitia doesn't have standing.   So, Letitia is apparently claiming that when Trump applies for loans or insurance, he puts incorrect values on the properties.   Whatever values Trump claims for properties, the lender or insurer will do their own valuation.   I think Letitia is creating a fake case to throw mud right before the midterms.   Disgusting and unethical.",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "doloreshaze",
                "time": "2 days ago",
                "context": "She’s got the receipts.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "333maxwell",
        "time": "2 days ago",
        "context": "It does not take a 'progressive' to realize Mr Trump has been 'most likely' involved in a LOT of bad bad business that would have locked any of us up a long long time ago.",
        "good": "1",
        "bad": "4",
        "replies": [
            {
                "user_name": "lizg01",
                "time": "2 days ago",
                "context": "It does take a brain to realize there is no evidence or Trump would have been in jail a long time ago. When will you people pay attention to what Bidens doing to bring us down instead of focusing on Trump who had this economy going wonderfully?",
                "good": "2",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "mtwallet526",
        "time": "2 days ago",
        "context": "\"Eternally grateful\" that James kept the one promise she made running for office. The only issue she focused on and made her primary purpose. She stood aside on issues when she should have stepped in. Spoke about issues she knew little about. And it showed. Now she anounces to voters, that she has gained her objective. Suing Trump. But in doing so, she mentions no victims, no crime, and imposes sentence without even a trial. Just to show voters that she came thru on a promise. \n The DoJ perused the same agenda. Even the IRS was involved. And none could find a CRIME stemming from Any Trump organization or person. What James brings is 'civil suit',, not criminal. Which does not disqualify Trump or any of his Kids , from running for office.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "abide842",
        "time": "2 days ago",
        "context": "Time for another Trump rally. MAGA's, get your wallets out.",
        "good": "1",
        "bad": "1",
        "replies": [
            {
                "user_name": "waclaw501848",
                "time": "2 days ago",
                "context": "We will -- to your disappointment.\nLOL.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "hillvee",
        "time": "2 days ago",
        "context": "What planet does Trump live on where he thinks he can behave criminally and not be treated like a criminal? That \"Wealthy White Privilege\" card you carry has it's limits... Yours expired when you chose to let your followers beat cops at the Capital while you sat and didn't say a word.",
        "good": "0",
        "bad": "3",
        "replies": [
            {
                "user_name": "lizg01",
                "time": "2 days ago",
                "context": "Do you not know what \"civil \" means? NOT CRIMINAL because they have no evidence. They know a liberal jury in NY will probably convict with her hearsay and then it will be appealed for ten years until she's out of office",
                "good": "2",
                "bad": "1",
                "replies": []
            },
            {
                "user_name": "cueball222",
                "time": "2 days ago",
                "context": "what color are you, white, brown, black, yellow or green? Just curious.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    }
]