[
    {
        "user_name": "Simpleman85",
        "time": "21 hours ago",
        "context": "Well, add them to the list…. Might be easier to keep track of anyone who’s freedoms were not violated by Facebook",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "IH8TPPL",
        "time": "1 day ago",
        "context": "And?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jasonthegood",
        "time": "1 day ago",
        "context": "Let's see how many Anti-Semitic Talkbackers start spewing this nonsense about Israel being an Apartheid state, and such nonsense that false and rotten at the core.  Let's see if we get Talkbackers who say the Jews control the world, etc.  (If Jews really controlled the world, then you probably would not be able to post here, LOL.  The Jews are not a monolithic group.  There is a Jewish joke that if you have 2 Jews, then you have 3 opinions. ) Those of you who LOVE TRUTH AND JUSTICE please call  out such evil comments.  I have a job, and do not have the time to do much of that today.\n\nNow, with respect to Facebook, I think Facebook should stop being the thought police.  Let people post whatever they want (and I am NOT talking about speech that most reasonable people would regard as incitement, advocating suicide, etc.).  People should be responsible for the awesome privilege and responsibility of using their God-given minds to do their own research.  I think the schools should require a class in critical thinking and logic works.",
        "good": "9",
        "bad": "3",
        "replies": [
            {
                "user_name": "aslapforfools",
                "time": "23 hours ago",
                "context": "Israel is an Aparheid state I appreciate you keeping this in the forefront for the Americans who had this information blocked to them",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "lieberalshateamerica",
        "time": "22 hours ago",
        "context": "Palestinians have freedom?",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "rtrim",
                "time": "19 hours ago",
                "context": "Yes, but their \"freedom\" is defined differently.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "livehistory",
        "time": "22 hours ago",
        "context": "Why METE, why.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "doclr11",
        "time": "1 day ago",
        "context": "At least Facebook is even-handed. They also banned Trump.",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "jmcgowan5571",
        "time": "23 hours ago",
        "context": "So the company violated the so called rights of palestinians. They do realize that palestinians do not have the right to self expression or freedom of speech. lso the company violated the rights of these people not the people that were censoring content? How is that? I guess the consultants thought it was okay to call for violence against others that belueve differently.",
        "good": "2",
        "bad": "1",
        "replies": [
            {
                "user_name": "aslapforfools",
                "time": "23 hours ago",
                "context": "read the article it's not confusing.",
                "good": "0",
                "bad": "3",
                "replies": []
            }
        ]
    },
    {
        "user_name": "recon_sgm",
        "time": "1 day ago",
        "context": "Facebook violated Palestinian users' freedoms (yeah that's my number one concern this month)",
        "good": "3",
        "bad": "2",
        "replies": [
            {
                "user_name": "aslapforfools",
                "time": "23 hours ago",
                "context": "It never is the US concern yet when Israel is retaliated against somehow Americans are all of a sudden concerned ignoring the triggering factors that was blocked for many to see,",
                "good": "0",
                "bad": "3",
                "replies": [
                    {
                        "user_name": "sicario252",
                        "time": "21 hours ago",
                        "context": "One counts the other doesn`t exist.",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "kstron",
        "time": "1 day ago",
        "context": "Can anyone really believe what any news organization or social media company prints anymore? Why does any country trust these organizations in their space?",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "isitafact",
        "time": "1 day ago",
        "context": "Any one familiar with that group? Is it another pretend human rights group? L",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rtrim",
        "time": "18 hours ago",
        "context": "I thought Facebook was a private company and could censor whoever and whatever they wanted.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "archieamerican",
        "time": "20 hours ago",
        "context": "Zuckerberg is a Jew. What side do you suppose that he is on ?",
        "good": "0",
        "bad": "1",
        "replies": []
    }
]