[
    {
        "user_name": "ImbecileBiden",
        "time": "1 day ago",
        "context": "If it goes against lefty talking points, it's coming down.",
        "good": "13",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "IAmObama",
        "time": "1 day ago",
        "context": "He literally pointed out how MSNBC has a lower standard of fact checking than his own channel.",
        "good": "41",
        "bad": "0",
        "replies": [
            {
                "user_name": "merit4goodlife",
                "time": "1 day ago",
                "context": "This is a liberal complaining about liberal and progressive censorship by most sovcial media and video websites.\n\nLive by the liberal sword, die by the liberal sword.  The liberal and progressive despots are winning--",
                "good": "1",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "politicansareliars",
                "time": "1 day ago",
                "context": "Funny you think MSNBC has lower standard, while they have NO standard at all.",
                "good": "2",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "bamalogic939",
        "time": "1 day ago",
        "context": "I'll be leaving YouTube and joining Rumble to watch Brand. He has really surprised me lately with his views. He's really a very well educated person that has some spot on reporting of the news.",
        "good": "37",
        "bad": "2",
        "replies": [
            {
                "user_name": "weekending",
                "time": "1 day ago",
                "context": "Also worth checking out Odysee. A lot of good Right-of-center voices on there, Morgoth, Computing Forever, etc.",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "Wandering_Vagabond",
                "time": "1 day ago",
                "context": "Check out JP sears, he’s funnier, and on point.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "randpaulsneighbor",
        "time": "1 day ago",
        "context": "Russell Brand trying to be relevant.",
        "good": "0",
        "bad": "5",
        "replies": [
            {
                "user_name": "smashpotato",
                "time": "23 hours ago",
                "context": "I think his podcast has about 4 million regular listeners . . .  Which is more, or way more than anyone on Fox, CNN, MSNBC, etc.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "Godhelpusall.",
        "time": "1 day ago",
        "context": "I’ve been listening to RB for a while now and all I can say is “he’s the guy”. He is a voice in the wilderness .i hope this wakes up the world to the extreme power you tube has over conservative thought.",
        "good": "9",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "bam87",
        "time": "1 day ago",
        "context": "Wow this guy fell off the face of the planet.  He was in literally everything for a minute, I forgot about him.. I wonder what he could have done to get canceled",
        "good": "2",
        "bad": "1",
        "replies": [
            {
                "user_name": "redbeard690",
                "time": "1 day ago",
                "context": "I think people just got tired of him really fast. Looks like he found a brand new gig though.",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "smashpotato",
                "time": "23 hours ago",
                "context": "He has been around, but just not in the limelight. His podcast has been enormously popular, as has his book.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "duckduckduckduck870",
        "time": "1 day ago",
        "context": "Google is the least trust worthy of all the big tech. they love to track you're activities and save them for later.  not at all surprised they are sensoring free speech. ",
        "good": "25",
        "bad": "0",
        "replies": [
            {
                "user_name": "politicansareliars",
                "time": "1 day ago",
                "context": "When you look at headlines of 'Google News' it is all what CNN, MSNBC. ABC, NBC, ... are reporting. The only headlines that they report from Fox are about unimportant stuff like what to eat to stay fit.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "budweiser",
        "time": "1 day ago",
        "context": "Used to dislike this guy and then one day someone or something changed him (I think it was COVID scare) it sure turned around his way of thinking. Smart dude that does not mind stirring it up.",
        "good": "11",
        "bad": "0",
        "replies": [
            {
                "error": "error"
            }
        ]
    },
    {
        "user_name": "treetrolly989",
        "time": "1 day ago",
        "context": "The tolerant liberals once again showing their fascist roots and their Socialist foundation of censorship of opposing views and “bad words”. They are a train wreck of destructive policies and childish finger pointing and are bent on the destruction of America.\n\nI know it’s off topic, but our country is losing it’s freedoms. We have free speech not allowed on PUBLIC campuses or social media etc. We have expensive health insurance forced on all of us. Even auto insurance is forced on us (thank god for $25/month Insurance Panda coverage). What’s next? Mandatory phone insurance? We have taxes on top of taxes and our freedoms are slowly disappearing. Thomas Jefferson and George Washington would be rolling in their graves.\n\nLiberals are all bullies. They are non tolerant and don't want any opposition.",
        "good": "18",
        "bad": "0",
        "replies": [
            {
                "user_name": "JLMCC05",
                "time": "1 day ago",
                "context": "panda...thanks for the tip!",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "capkjk",
        "time": "1 day ago",
        "context": "Who in their right mind would get COVID information from Russell Brand?",
        "good": "2",
        "bad": "9",
        "replies": [
            {
                "user_name": "eradam",
                "time": "1 day ago",
                "context": "or dr.fauci?",
                "good": "10",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "Proud-Pure-Blood-No-Vax",
                "time": "1 day ago",
                "context": "Or the CDC",
                "good": "7",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "eddiefast4321",
        "time": "1 day ago",
        "context": "It is interesting and refreshing that Russell is finally seeing the light. Trump has been 100% correct all along!",
        "good": "29",
        "bad": "4",
        "replies": [
            {
                "user_name": "chetman",
                "time": "1 day ago",
                "context": "About what?",
                "good": "2",
                "bad": "5",
                "replies": [
                    {
                        "user_name": "kimmysbrats254",
                        "time": "1 day ago",
                        "context": "Read the article.",
                        "good": "3",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "macwatts",
                                "time": "1 day ago",
                                "context": "That Troll only saw \"Trump has been 100% correct all along!\" and posted a facile denial. Trolls can barely read or think: they never read articles, they just post what they are asked to post  for money.",
                                "good": "4",
                                "bad": "2",
                                "replies": [
                                    {
                                        "user_name": "lovefreedomhatelibs",
                                        "time": "1 day ago",
                                        "context": "There's lots of liberals that fit that description.",
                                        "good": "1",
                                        "bad": "0",
                                        "replies": []
                                    },
                                    {
                                        "user_name": "eddiefast4321",
                                        "time": "1 day ago",
                                        "context": "Ha!  :-)",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "user_name": "mmmmmmbad",
                        "time": "1 day ago",
                        "context": "About you Liberal, Socialist, Dem.....Leeches.... :-)",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "zappacostta",
        "time": "1 day ago",
        "context": "Mainstream misinformation should never be taken down. We can't let them bury their mistakes, and we need to be able to judge their bias and trustworthiness against past statements. It does no one a favor but the network to remove such content.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "fest3er1",
        "time": "1 day ago",
        "context": "The antidote for misinformation is information, not censorship.  Of course, the lefts positions are based on “feelings”, not logic, so they can’t defend their stance without misinformation.",
        "good": "36",
        "bad": "1",
        "replies": [
            {
                "user_name": "Godhelpusall.",
                "time": "1 day ago",
                "context": "The left is in panic mode because he used to be one of there’s and now he’s not and he has 5.9 million really wonderful subscribers.",
                "good": "10",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "CrispyCritter379",
                "time": "1 day ago",
                "context": "First sentence makes sense, second one is stereotyping and deflection.",
                "good": "0",
                "bad": "2",
                "replies": [
                    {
                        "user_name": "muffinman1228",
                        "time": "19 hours ago",
                        "context": "First sentence makes sense, second one speaks truth which is difficult to hear",
                        "good": "1",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "CrispyCritter379",
                                "time": "17 hours ago",
                                "context": "Given that the \"left\"  tend to be more educated, less religious and support science and facts- they are the most logical as a group.  Sure there are leftist nut cases just like on the right, but current events show you have it backwards in regards to the average left leaning person.",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "Abergstrom",
        "time": "1 day ago",
        "context": "You Tube, Facebook, Twitter and the mainstream media have too much power. They must be reigned in!",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "t1t2t3",
        "time": "1 day ago",
        "context": "BOTTOM LINE---- DON'T PUT OUT MISINFORMATION! HOW BOIT THEM APPLES!",
        "good": "0",
        "bad": "2",
        "replies": [
            {
                "user_name": "lousydemocrat",
                "time": "1 day ago",
                "context": "And the ones that censor it are the ones that judge misinformation. That seems fair 🙄🙄🙄🙄🙄🙄",
                "good": "2",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "no-biden895",
                "time": "1 day ago",
                "context": "You mean like Joe Biden stating on CNN (only a few months ago) that getting the Covid vaccine stops Covid?  \nBan Joe Biden!",
                "good": "1",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "smashpotato",
                        "time": "23 hours ago",
                        "context": "He also said the pandemic is over, so how come people are still testing positive and having symptoms",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "trumpybear219",
                "time": "1 day ago",
                "context": "Bottom line, don't just censor conservative views or views you don't like. Mainstream media is the biggest source if misinformation. Misinformation is one sided. Just look at the lack of any fact checkers on Biden when he makes obvious false statements.",
                "good": "0",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "slippin'jimmy",
        "time": "1 day ago",
        "context": "Looks like?\nIt IS !!",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "gap101",
                "time": "1 day ago",
                "context": "Some people refer to moderation decisions that affect them as “censorship” because they feel they’ve been censored. Maybe they think a platform punished them for holding certain political views. Maybe they think a platform punished them for bigoted reasons. Whatever the reason, those people feel that losing their spot on the platform is censorship. But they’re not angry about losing their right to speak. (Twitter, Facebook, etc. can’t take that away from them, anyway.)A platform the size of Twitter or Facebook comes with a built-in potential audience of millions. Anyone banned from Twitter loses the ability to reach that audience. For some people, such a loss can feel like censorship???even though it isn’t. No one has the right to an audience. No one has the right to make someone listen. But entitled people think they do have those rights, and any “violation” of those “rights” is “censorship”.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "mockingbird1040",
        "time": "1 day ago",
        "context": "Russell, is not only looks like censorship, IT IS CENSORSHIP!",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "speakingtoyou",
        "time": "1 day ago",
        "context": "Red Flags were there all along.\nSince the very beginning all dissenting opinions and therapeutics were ridiculed and silenced.\nThat was enough for many of us to know something was very wrong with this shot.",
        "good": "20",
        "bad": "2",
        "replies": [
            {
                "user_name": "Wandering_Vagabond",
                "time": "1 day ago",
                "context": "Thank goodness too, because a lot of people who ignored warnings are now paying the price heavily, for those “safe & effective” vaccines…",
                "good": "3",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "vancouverken",
                        "time": "1 day ago",
                        "context": "Sudden death syndrome.  Easy enough, let’s look at their vax and booster schedule.  Depopulation is working as intended.",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "wekdds775",
        "time": "1 day ago",
        "context": "There was a lot of misinformation from the CDC who seemed to be running around in circles. It seemed as if only the mainstream media was infallible when truly they were not. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Deathstalker187",
        "time": "1 day ago",
        "context": "You are the man Russell keep telling them how it is. Keep fighting the good fight so few people out there calling it like it is. We need more like you but we will take what we can get. Thank you for your service. IMO Russell for congress!",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "libsarepedos22",
        "time": "1 day ago",
        "context": "No one put out more misinformation than the government and MSM.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "usernamenotavai",
        "time": "1 day ago",
        "context": "It don’t look like it Russell….it is censorship. We’re all the scientists correct about covid from the beginning? Clearly not.  The MSM and big tech decided for us what they wanted to be spread and allowed for zero deviation from that to this day. Today it’s covid, tomorrow it’s religion, 10 years from now its, what you cannot say against the government…..sadly that 10 years from now seems more like today…..",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "N41075",
        "time": "1 day ago",
        "context": "I mean.... He has a valid point ",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bob77777",
        "time": "1 day ago",
        "context": "Free speech is about the right to speak your mind - right or wrong - and face the consequences of open debate. If someone is wrong, point it out and win the argument.",
        "good": "66",
        "bad": "1",
        "replies": [
            {
                "user_name": "slippin'jimmy",
                "time": "1 day ago",
                "context": "There you go with using logic when the lefties are all about feelings and their(?) truth . . .",
                "good": "21",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "Acreage-Vehicles-Property.",
                "time": "1 day ago",
                "context": "Liberty of conscience.\nThomas Jefferson knew.\n\nYet...interestingly he raised this issue so many times that I wonder whether his conscience that held slaves was making him feel guilt about it.  He enjoyed liberty of conscience while his slaves did not.   His guilt caused him write wonderful things about what he may have secretly wanted for his slaves to enjoy too - but the intense political peer pressure of his fellows prevented him from courageously acting it out.",
                "good": "1",
                "bad": "2",
                "replies": []
            },
            {
                "user_name": "marshee970",
                "time": "1 day ago",
                "context": "Unfortunately, no matter how supported by facts your argument is, you'll never win an argument with an ignoramus.",
                "good": "1",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "politicansareliars",
                "time": "1 day ago",
                "context": "You just described the Conservative's and Independent's description of free speech, since you did not add liberal's description I will add it here. \nFree speech is about the right to agree with what liberals say -right or wrong- otherwise face the consequences.",
                "good": "16",
                "bad": "3",
                "replies": [
                    {
                        "user_name": "CrispyCritter379",
                        "time": "1 day ago",
                        "context": "Speaking as a liberal, I agree about FAR LEFT liberals, this also applies to FAR RIGHT people, because no one goes to the extreme if they have any ability to listen to others.",
                        "good": "1",
                        "bad": "2",
                        "replies": [
                            {
                                "user_name": "1moa",
                                "time": "1 day ago",
                                "context": "Democrats do not listen at all. They ridicule other points of view and use the hecklers veto as well as the Ad Hominem logical fallacies. As far as Democrats are concerned if they cant control the narrative, they destroy it or at least destroy all choices but the one they want.",
                                "good": "2",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "joestecco736",
                "time": "1 day ago",
                "context": "Do you really think you can debate a liberal child that puts their fingers in their ears and refuses to listen to anything other than what their communist leaders tell them to believe?",
                "good": "3",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "bob77777",
                        "time": "1 day ago",
                        "context": "Yes. And it must be done. Remaining silent gives them the impression they are right.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "CrispyCritter379",
                        "time": "1 day ago",
                        "context": "Same thing happens with the far right, only they refuse to listen to anything their authoritarian and anti-science leaders tell them to ignore.",
                        "good": "0",
                        "bad": "2",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "NathanBedford",
                "time": "1 day ago",
                "context": "He is Anti-American but even those have a right to say what they think. Unfortunately.",
                "good": "1",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "Godhelpusall.",
                "time": "1 day ago",
                "context": "He always says…if you disagree, say so. You might be right…he might be right…but you have to have the conversation to figure it out.",
                "good": "3",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "realthugqueen69",
                "time": "23 hours ago",
                "context": "Youtube is a private company.  They are not beholden to the first amendment.",
                "good": "0",
                "bad": "1",
                "replies": []
            },
            {
                "user_name": "mental.r00t.kit",
                "time": "21 hours ago",
                "context": "If you tell kids that abusing drugs is safe and fun, or if you shout “shooter” in a crowded theater, you will soon discover there are limits.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "cigarman98000",
        "time": "1 day ago",
        "context": "Brand is much better since he got sober!!",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dvankeuren",
        "time": "1 day ago",
        "context": "YouTube has no business whatsoever declaring anything as misinformation.  That IS censorship, and ALL the social media outlets need to be taken down for this.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Trumpliedover30,000xin4years",
        "time": "1 day ago",
        "context": "so take it to truth,grift,social where anything but the truth is promoted",
        "good": "0",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "libsarepedos22",
        "time": "1 day ago",
        "context": "Looks like a duck quacks like a duck....",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "norvillerogers",
        "time": "1 day ago",
        "context": "What kind of weirdo is getting information on anything from Russell Brand?",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "jumpynina",
                "time": "1 day ago",
                "context": "Maybe you should watch one of his videos.",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "lousydemocrat",
                "time": "1 day ago",
                "context": "That is so typical of the left. Brand a certain type of person to be incapable of telling the truth. And those that do the branding are The Chronic Liars",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "saynotobidumb",
                "time": "1 day ago",
                "context": "Kids, 20 year old group, which is important, because these kids look up to these people.  I'd rather have them listen to Russell telling the truth rather than Rachel Madcow telling lies.",
                "good": "1",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "kimmysbrats254",
                "time": "1 day ago",
                "context": "Educate yourself.",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "norvillerogers",
                "time": "1 day ago",
                "context": "Thanks everyone for answering that question.  LOL",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "truthfountain",
        "time": "1 day ago",
        "context": "I already watch Russel Brand on Rumble. I hope this move, and others like it, take youtube down a peg or two. They need to be. Rumble is now publicly traded, so I hope their stock goes up.",
        "good": "33",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "CMAG🇺🇸",
        "time": "1 day ago",
        "context": "Not a big fan of Russell Brand or Kyrie Irving but their voice against the machine is encouraging! ",
        "good": "28",
        "bad": "0",
        "replies": [
            {
                "user_name": "candace666",
                "time": "1 day ago",
                "context": "I did not watch his videos what is his opinion?",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "jumpynina",
                        "time": "1 day ago",
                        "context": "He is probably considered a little left of center but his stance is mostly center. He will trash the left and the right but it seems lately that it's mostly the left. He doesn't think much of Biden.",
                        "good": "3",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "PresentlyInTheFuture",
                        "time": "1 day ago",
                        "context": "Watch his video and make your own judgment.",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "joey_e",
                        "time": "23 hours ago",
                        "context": "He's definitely on the Left when it comes to the financial order (more socialistic), but he engages extremely well with people that he talks to and doesn't talk over people... to the point he can have honest conversations even where there are potential disagreements. This includes interviews with people like Ben Shapiro, Candace Owens, Jordan Peterson. Some very good discussions in there. Even if his political stance is Left, he's someone who can identify good things about the Trump administration and identify problems with Biden.",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "PurpleTree",
        "time": "1 day ago",
        "context": "A tad late to the party, isn't he?",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Acreage-Vehicles-Property.",
        "time": "1 day ago",
        "context": "I had more liberty in the 70s to say what I wanted to say and that problem is not caused by just the DNC. Both extremist groups are trying to quash the speech of those that sometimes disagree with them to force the public to extremism because face it - these folks want civil war.\n\nMy view - remain undeclared, stop discussing politics and religion so much in public.  Accept the other as you find them.  Stop intensely trying to exploit your fellow civilians to gain celebrity status on Instagram, Twitter, and TickTock because not everything y'all say is that important and not everyone will be famous.\n\nI will never be famous.\nThere.\nI took your power away.",
        "good": "3",
        "bad": "3",
        "replies": [
            {
                "user_name": "claytonbixby",
                "time": "1 day ago",
                "context": "I agree with keeping religion and politics private. It's just wise.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "algorerhythm070",
        "time": "1 day ago",
        "context": "Stop censoring anything except calls for violence.",
        "good": "0",
        "bad": "1",
        "replies": [
            {
                "user_name": "Vae_Victus",
                "time": "1 day ago",
                "context": "So just censor what you want to censor?  ",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "betterredneckthanliberal",
                "time": "1 day ago",
                "context": "Who interprets what is a call for violence?",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "randpaulsneighbor",
        "time": "1 day ago",
        "context": "The article doesn’t mention what misinformation he said.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "norvillerogers",
        "time": "1 day ago",
        "context": "Brand:  Sure our video was full of misinformation, but we apologized for it.  😂",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ObeseIllegitimo676",
        "time": "1 day ago",
        "context": "Maybe actors and comedians ought to be imprisoned for giving medical advice?",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "epictetus2022",
                "time": "1 day ago",
                "context": "And doctors for telling jokes?",
                "good": "3",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "ObeseIllegitimo676",
                        "time": "22 hours ago",
                        "context": "I consider everything Fauxi says to be either a joke or more likely a lie.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "ohnooo11",
                "time": "1 day ago",
                "context": "Where do you draw the line from giving advice to having an opinion?",
                "good": "2",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "smashpotato",
                "time": "23 hours ago",
                "context": "And especially politicians.  To be honest, I’d trust Russell Brands opinion before the residents of congress",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "ObeseIllegitimo676",
                        "time": "23 hours ago",
                        "context": "I like Russell Brand, it's not that I'm trying to censor either side; however, if you're giving medical, legal, engineering, etc. advice (things that require professional licenses) outside your expertise, perhaps you should qualify your statement just so somebody doesn't sue you.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "smashpotato",
                                "time": "23 hours ago",
                                "context": "I completely agree.   At one time, politicians and presidents used to say, “the advice of doctors . . . “.  Now, they have a tendency to miss that and just say, “you must . . .l",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "demobrat",
        "time": "1 day ago",
        "context": "misinformation is a direct attack on god..he has 10 you are going to hades rules...lying is number 9..it's appalling to read the lies of the lost souls on this site.",
        "good": "0",
        "bad": "1",
        "replies": [
            {
                "user_name": "kimmysbrats254",
                "time": "1 day ago",
                "context": "You seem hysterical.",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "Focused711",
                "time": "1 day ago",
                "context": "You're welcome to your own religion or lack there of but to attack someone else's is pretty low, even for you.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "nothingbuta",
        "time": "1 day ago",
        "context": "I get all my medical advice from Russell Brand!",
        "good": "0",
        "bad": "3",
        "replies": [
            {
                "user_name": "ghetto_investor",
                "time": "1 day ago",
                "context": "Glad you appreciate liberty and freedom ",
                "good": "2",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "biglou15",
                "time": "1 day ago",
                "context": "Better than the liar Dr. Fraud_ci, the CCP apologist and Wuhan Lab funder.",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "number5of6",
                "time": "1 day ago",
                "context": "Better than getting it from Biden or Maddow, who both said people who get the vaccine will not get the virus. Of, course, Joe has had Covid repeatedly AFTER getting vaxxed AND boosted. (And don't waste time arguing the vaccine protects against more serious infections, because THAT was NOT what they said.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "biglou15",
        "time": "1 day ago",
        "context": "Keep it up, Russell.  Keep hammering the WOKE and the Covid liars.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Vae_Victus",
        "time": "1 day ago",
        "context": "Dr Fraudi would need a month long video to apologize for everything he got wrong.😄",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Focused711",
        "time": "1 day ago",
        "context": "Wait, who?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "EnderWiggin",
        "time": "1 day ago",
        "context": "If the misinformation pushes the lefts agenda it is not only allowed but encouraged.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ya_dont_say",
        "time": "1 day ago",
        "context": "A hard-core Democrat falling victim to his own party",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Coldheat016",
        "time": "1 day ago",
        "context": "\"Looks\" like Censorship?    That's exactly what it is.  And since the Democrats have BigTech and the mainstream media in their \"Cabal\", you're seeing how much more emboldened and ridiculous the Democrats are getting.  \n\nThey don't even try to hide their hypocrisy anymore; they are literally untethered and untouchable by the media.   \n\nAbsolute power corrupts Absolutely.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "arcke",
        "time": "1 day ago",
        "context": "If what you say doesn’t fit the narrative of the lyin Biden cartel then you will be censored. Kinda like in Russia. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "covvboy",
        "time": "1 day ago",
        "context": "Note to Brand:  Try Truth Social........",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "michaelrups339",
        "time": "1 day ago",
        "context": "Love Russell Brand.  His videos are great.  He should know, however, that by now telling truth is against the Ministry of Truth's rules.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "andythelawyer",
        "time": "1 day ago",
        "context": "So what?  YouTube isn't the government and the first amendment doesn't apply.",
        "good": "0",
        "bad": "3",
        "replies": [
            {
                "user_name": "Coldheat016",
                "time": "1 day ago",
                "context": "LOL, if they were taking down liberal content you'd be filling another pair of pampers right now. \n\nSo much for a \"community\" of free thinking ideas, eh?",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "tajf662",
                "time": "1 day ago",
                "context": "The government is precluded from controlling speech because our founders believed that free speech was very important and that civil right needed to be protected from powerful interests .  It is no less important now and protecting that right from all enemies of free speech is urgently needed to keep us a free society.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "biscuitcrux",
        "time": "1 day ago",
        "context": "I've tried several times, but I simply cannnot stand listening to this guy talk. I really don't know what his stances are because of that. Maybe I should seek out his words in text - at least I could understand what he's saying. I do, however, agree with him on this.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "demobrat",
                "time": "1 day ago",
                "context": "yeah he should be able to lie all he wants until he gets to the lake of fire.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "kimmysbrats254",
                        "time": "1 day ago",
                        "context": "You need more jabs. And you know you want more.",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "biscuitcrux",
                        "time": "1 day ago",
                        "context": "You think he's lying about censorship?",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "Focused711",
                                "time": "1 day ago",
                                "context": "The real problem is that he doesn't \"think\".",
                                "good": "1",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "milio",
        "time": "1 day ago",
        "context": "where was he when potus was banned?! if potus can be banned, who are you?",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "gap101",
        "time": "1 day ago",
        "context": "Some people refer to moderation decisions that affect them as “censorship” because they feel they’ve been censored. Maybe they think a platform punished them for holding certain political views. Maybe they think a platform punished them for bigoted reasons. Whatever the reason, those people feel that losing their spot on the platform is censorship. But they’re not angry about losing their right to speak. (Twitter, Facebook, etc. can’t take that away from them, anyway.)A platform the size of Twitter or Facebook comes with a built-in potential audience of millions. Anyone banned from Twitter loses the ability to reach that audience. For some people, such a loss can feel like censorship???even though it isn’t. No one has the right to an audience. No one has the right to make someone listen. But entitled people think they do have those rights, and any “violation” of those “rights” is “censorship”.",
        "good": "1",
        "bad": "1",
        "replies": [
            {
                "user_name": "milio",
                "time": "1 day ago",
                "context": "the point is, it should be the audiences decision whom they want to hear, or not hear. it's not someone else's to make that decision for them. so yes, people do have right to speak to any audience,  and the audience has the right not to listen and walk away/change channel......",
                "good": "3",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "gripoflush",
                        "time": "1 day ago",
                        "context": "Then simply walk away.  This is not rocket science.\n\nI hear Truth Social may have a forum that you might enjoy.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "Focused711",
                "time": "1 day ago",
                "context": "The problem is that the platform itself has the power to determine what content reaches its audience. For example Facebook could influence an election by censoring a truthful story that it deems damaging to a candidate it supports. The power wielded by the platform should not override a users right to free speech for example.",
                "good": "3",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "gripoflush",
                        "time": "1 day ago",
                        "context": "Fox wields the same power.  As have publishers for around two centuries.  The only difference is that you disagree with what YouTube chooses to present to it's audience.\n\nJust curious, why didn't you use this as an example: For example, Fox rarely ran any stories that criticized President Trump in any way, allowing it's loyal readers to suffer the delusion that Trump was an effective leader.",
                        "good": "0",
                        "bad": "1",
                        "replies": []
                    },
                    {
                        "user_name": "gap101",
                        "time": "1 day ago",
                        "context": "They pay Russel Brand! He made 4 million dollars from YouTube last year. It’s a business. They get to control who has access to their audience and for what purpose. It’s their audience and their business.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "hmm!941",
                "time": "1 day ago",
                "context": "No. It is cenorship. 1. the suppression or prohibition of any parts of books, films, news, etc. that are considered obscene, politically unacceptable, or a threat to security. “the regulation imposes censorship on all media\" It’s just not censorship by the federal government.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "gap101",
                        "time": "1 day ago",
                        "context": "Once again, censorship requires limiting someone’s speech. Russel Brands speech hasn’t been limited. The fact that he found another platform for his show proves that. \nThere is no right to use my soapbox for your ideas as part of free speech. \nThis situation in no way resembles the definition you quote.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "saynotobidumb",
        "time": "1 day ago",
        "context": "Wow, I didn't know Russell Brand has common sense and see the truth!  There's hope.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Thepeople'sJD",
        "time": "1 day ago",
        "context": "Fox doesn't report stories that don't support it's conservative agenda ALL THE TIME...Fox is the king of censorship",
        "good": "2",
        "bad": "3",
        "replies": [
            {
                "user_name": "Coldheat016",
                "time": "1 day ago",
                "context": "Really, who's information do they take down?",
                "good": "1",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "kimmysbrats254",
                "time": "1 day ago",
                "context": "Stating the obvious.. why are you on Fox then?",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "keepinitreal032",
        "time": "1 day ago",
        "context": "Vaccines are what have made us a first world country. Thanks to misinformation about Covid  more parents are choosing to not  vaccinate their children from typical childhood diseases. These are upper/ middle class white folk in general. And thanks to them we will see a resurgence of potentially deadly diseases which will then be blamed on immigrants. Immigrants btw are one of the first to jump on board with vaccines if given a chance. ",
        "good": "0",
        "bad": "3",
        "replies": [
            {
                "user_name": "arcke",
                "time": "1 day ago",
                "context": "Are the illegals getting their Covid shot??",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "kimmysbrats254",
                "time": "1 day ago",
                "context": "Um. No",
                "good": "1",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "silencedogood212",
                "time": "1 day ago",
                "context": "Thank you for this brave and accurate warning.  You will get flamed by the anti-science folks but you are in good historical company.  Remember what happened to Galileo and Hypatia.",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "79isfine",
                "time": "1 day ago",
                "context": "You’re struggling to keep it real!  What about all of the illegals at the border?  By the way, I’m upper / middle class white folk, and my children have had all of the usual vaccinations.  Those are needed, and most of them prevent life threatening diseases.  They will not be getting the Covid shot.  The administration was way too creepy about it (forcing, lying, etc.).  It could potentially be unsafe, it does nothing to prevent or fight that for which it was allegedly created, and there’s just no reason for them to get it.",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "PresentlyInTheFuture",
        "time": "1 day ago",
        "context": "He's just now finding this out?!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "epictetus2022",
        "time": "1 day ago",
        "context": "I think Brand is wrong if he thinks the bias is along the lines of mainstream/big guys (MSNBC) vs. independents/little guys (Brand).  The bias is completely ideological.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "12tribunal",
        "time": "1 day ago",
        "context": "Liberals don't like it when it happens to them.  This was so predictable.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "demobrat",
                "time": "1 day ago",
                "context": "name some liberal lies backed up by court worthy evidence",
                "good": "0",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "jocado",
        "time": "1 day ago",
        "context": "Welcome to the club",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "Thepeople'sJD",
                "time": "1 day ago",
                "context": "I know right? Fox is always doing this",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "slj761",
        "time": "1 day ago",
        "context": "Ok",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Mitchapalooza33",
        "time": "1 day ago",
        "context": "Get em boy, that's right we all have known it for a while, it's just nice to hear someone in Hollywood complain about it.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "angryfrightenedred",
        "time": "1 day ago",
        "context": "I’ve seen 5 fox headlines today and they’re all meaningless angry culture war nonsense. How bout some actual news today huh?",
        "good": "0",
        "bad": "2",
        "replies": [
            {
                "user_name": "Reimagining",
                "time": "1 day ago",
                "context": "That’s becuse FOX is 2 years ahead of the news just coming out of CNN and MSNBC… They are still trying to figure out if Hunter’s laptop is real.. ",
                "good": "2",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "gap101",
                        "time": "1 day ago",
                        "context": "Nice whatabout but it doesn’t change or answer the relevant question does it?",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "waclaw501848",
                                "time": "1 day ago",
                                "context": "Replying to \"gap101.\"\nThe answer is: More than likely; you don't have to invert what Fox reports to see what is true. The opposite is a rule of thumb with the Media and the White House. Any more questions?",
                                "good": "1",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "ifixrecks",
                "time": "1 day ago",
                "context": "So what is your definition of “culture war nonsense” and “actual news”? Serious question",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "angryfrightenedred",
                        "time": "1 day ago",
                        "context": "This article about one guy who isn’t allowed to do or say certain things on a privately owned platform that he’s allowed to use for free. Fox lies to its audience about what capitalism is and what is at fault here. Meaningless angry culture war nonsense.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "ifixrecks",
                                "time": "1 day ago",
                                "context": "It sounds like you’re triggered. People have valid reasons to question censorship. Why do you have a problem with people voicing their opinions?",
                                "good": "0",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "angryfrightenedred",
                                        "time": "1 day ago",
                                        "context": "Nothing at all, it’s just that this is the world conservatives want, because this is the world you get if you don’t regulate corporations",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "Focused711",
        "time": "1 day ago",
        "context": "If these platforms are censoring users and selectively filtering what content reaches an audience then what prevents that platform from say starting a war, fueling hatred, racism, genocide or even influencing an election? Perhaps by censoring truthful stories that may damage a candidate supported by that platform...",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "eddiefast4321",
                "time": "1 day ago",
                "context": "Without lies, suppression of free speech, censorship and media manipulation, Democrats have Nothing!",
                "good": "4",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "speakingtoyou",
        "time": "1 day ago",
        "context": "The MSM/Big Tech and the Democrat party are one and the same.\nBias, agenda driven platforms presenting lies, half truths and censorship.\nYou would be hard pressed to find anywhere in the world that spews out more propaganda than the MSM right here in the USA.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "quisp65",
        "time": "1 day ago",
        "context": "The MSM are again trying to falsify the lab leak with garbage science papers.   They have zero evidence of natural zoonosis but they keep reporting most scientist think it's natural.   I think scientists align with the public on this and think a lab leak as most likely.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "robert338",
        "time": "1 day ago",
        "context": "But he thinks it's alright to take the video down of anyone he doesn't like.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "polcat",
        "time": "1 day ago",
        "context": "Russell, it doesn't look like censorship.  It is censorship!",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "trinity6145779",
        "time": "1 day ago",
        "context": "Welcome to the club Russel, big tech censor anyone who does not agree with them and their agenda.",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "c.a.g.",
                "time": "1 day ago",
                "context": "Research what Russell was saying and find out if what he was saying was the truth or a lie before you blatantly criticize YouTube. ",
                "good": "1",
                "bad": "3",
                "replies": [
                    {
                        "user_name": "ifixrecks",
                        "time": "1 day ago",
                        "context": "but you’re missing the point. the MSNBC video containing vaccine lies is still up and running. He is questioning the hypocrisy. He’s a liberal mouthpiece but hes right",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "-EH-",
        "time": "1 day ago",
        "context": "Give it 12 hours and Twitter will take the video down, then block him for \"mis- and dis-information.\" He's so annoying as an actor and comedian, but he's on it as a social commentator. Who would have thought!?",
        "good": "2",
        "bad": "1",
        "replies": [
            {
                "user_name": "cks260",
                "time": "1 day ago",
                "context": "He's a flippin' raging communist!!!!",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "cloneprone",
        "time": "1 day ago",
        "context": "How in the world does a private company get away with violating our constitutional rights?\nThe Boy Scouts, a private company, now has to take girls but Twitter can silence dissent?",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "cks260",
                "time": "1 day ago",
                "context": "I do not support 'boy or girl scouts' anymore....not after what they now stand for...",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "gripoflush",
                "time": "1 day ago",
                "context": "Which Constitutional right do you believe YouTube is violating?",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "gap101",
                "time": "1 day ago",
                "context": "Because they pay Russel Brand. He made 4 million dollars last year alone from YouTube. \nThat’s the difference. They decide who has access to their audience and for what purpose. It’s their audience.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "reasonablenrational",
        "time": "1 day ago",
        "context": "too late",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ItCanBeDone",
        "time": "1 day ago",
        "context": "He’s not wrong…the media has and continues to share misleading information or even flat out lies; the threat to democracy claims or effectiveness with vaccinations for example. And yet, they are still able to avoid being shut down by social media platforms. Things that make you go hmm…",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "archieamerican",
        "time": "1 day ago",
        "context": "Leftists are all for censorship, until it happens to them.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "IckiTicki295",
        "time": "1 day ago",
        "context": "I have already left YouTube AND Twitter AND FaceBook AND.......",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "cks260",
                "time": "1 day ago",
                "context": "and amazon and ebay....and never was on tictok or twitter or facebook...or any other so-called 'social media' site.....They should all be banned....",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "gunsnguitars",
        "time": "1 day ago",
        "context": "Once the sane adults retake Congress the first order of business should be anti-propaganda laws and anti-censorship laws to bring integrity back to journalism.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "radman00",
        "time": "1 day ago",
        "context": "The 'Fake News\" revolution started on June 16, 2015, the day Trump announced his plans to run for president.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Reimagining",
        "time": "1 day ago",
        "context": "Maybe instead of all these lawyers tripping over camp lejeune we can get a class action suite on YouTube and MSNBC mis-information and eveybody who got a COVID shot when they were lied too!  I’ll be the lead plaintiff 💉🤥",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "justwonderingoutloud",
        "time": "1 day ago",
        "context": "Ok, I get it, big tech can not be held to task over pulling one video over what they deem to be \"misinformation\" because of current law. But as I read this article I wonder about suing them for discrimination?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "c.a.g.",
        "time": "1 day ago",
        "context": "If Russell's information was a lie, then it should be taken down. ",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "thomasthree",
                "time": "1 day ago",
                "context": "And Madows?",
                "good": "3",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "eddiefast4321",
                "time": "1 day ago",
                "context": "Democrats and the Fake News Media have painted themselves into a corner with all their lies. So they have to keep on lying!  \nImagine being so incredibly naïve and gullible that you fell for the Russian Collusion Hoax in the first place",
                "good": "4",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "ifixrecks",
                        "time": "1 day ago",
                        "context": "First rule of crime is to never admit the racket",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "ifixrecks",
                "time": "1 day ago",
                "context": "but you’re missing the point. the MSNBC video containing vaccine lies is still up and running. He is questioning the hypocrisy. He’s a liberal mouthpiece but hes right",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "smashpotato",
                "time": "23 hours ago",
                "context": "I disagree with deleting history.  Leave the original video and the later retraction.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "wickedgame686",
        "time": "1 day ago",
        "context": "When is the house ever going to crumble for the government narrative pushing MSM? All it is, is like another arm of this corrupted Left wing government. We need more influential people to prove the censorship and control it is doing to hurt this country.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "you'llneverwalkalone",
        "time": "1 day ago",
        "context": "Well, that's the woke world he promotes. He just doesn't like it when HE is on the receiving end of his \"philosophy\"",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "-EH-",
                "time": "1 day ago",
                "context": "He doesn't promote woke. He's been on the right side of covid and free speech. Weird coming from an annoying Brit.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "cks260",
                        "time": "1 day ago",
                        "context": "He's a raging communist....where have you been????",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "702dano",
        "time": "1 day ago",
        "context": "No clue who this guy is, but he's 100% right\nThe hypocrisy is really unbelievable.",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "jicarillo",
                "time": "1 day ago",
                "context": "In a Democratic free society, both censorship and bias by any media (public or private) should be completely against the law and punishable by solid penalties. No one should be able to suppress anyone else's point of view...like it or not.  The terms misinformation or \"hate speech\" can both be subjective and inaccurate depending on one's point of view.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "mandors",
        "time": "1 day ago",
        "context": "You can't even say the truth about the vaccines now. The vaccines do not stop the spread or acquisition of Covid. That's not what they were designed to do. They were designed to protect people from extreme cases of Covid. It's the truth, but you can't say it. Whether or not they work at all is another matter, but you can't discuss that either.",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "Breumeister",
                "time": "1 day ago",
                "context": "Wrong. They fully indicated that it was to STOP the virus which it does not do. They continue to call it a vaccine which it is not. It's a therapeutic at best and completely worthless against COVID and causes potential harm in some cases at worst. You continue to spew propaganda about it so YOU are part of the problem.",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "waclaw501848",
                "time": "1 day ago",
                "context": "The Covid and \"vaccine\" experience prove that Jussie Smollett is more credible than our government. Disgusting!",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "clownyfish",
        "time": "1 day ago",
        "context": "Getting censored on these Leftist sites are almost like a badge of honor today.... \nThey have no arguments... They're just lazy...",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "gazgl1",
        "time": "1 day ago",
        "context": "\"While COVID vaccines have been effective in preventing severe outcomes from the virus, they have not prevented people from getting or transmitting the virus. \"\n\nThat's just as much a lie as saying they have stopped the spread completely.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "texas_bluebonnet",
        "time": "1 day ago",
        "context": "This is why the government should not and constitutionally is not allowed to impede free speech. What has been done here is a serious violation of the first amendment. It needs to be corrected quickly, or we will lose free speech all together.",
        "good": "2",
        "bad": "0",
        "replies": [
            {
                "user_name": "lookyloo",
                "time": "1 day ago",
                "context": "Look at what has happened to conservative voices on college campuses or in classrooms preschool on up.",
                "good": "1",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "smashpotato",
                "time": "1 day ago",
                "context": "The first amendment only applies to the government, not companies like Google or YouTube",
                "good": "0",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "irefusetowearamask",
        "time": "1 day ago",
        "context": "I'm not a know it all, I'm just clarifying here: scientists present scientific evidence to support their conclusions,  and explain how they arrived at those conclusions using the scientific evidence being presented.  Authoritarians issue dictates.  I'm not saying Russell Brand is right or wrong,  I'm just making the point that scientific minds look at and verify scientific evidence,  and come to their own conclusions.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "waclaw501848",
                "time": "1 day ago",
                "context": "Thank you, \"irefusetowearamask.\"\nThe Scientific Method never stops questioning and openly verifying. That didn't get a chance of happening. Who issued orders to block the Scientific Method, and WHY?",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "MJ58",
        "time": "1 day ago",
        "context": "It does not look like...IT IS!!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "animosque",
        "time": "1 day ago",
        "context": "He's a comedian. No one goes to them for information.",
        "good": "0",
        "bad": "3",
        "replies": [
            {
                "user_name": "irefusetowearamask",
                "time": "1 day ago",
                "context": "And you're a nobody.  Nobody goes to you for information. ",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "animosque",
                        "time": "1 day ago",
                        "context": "Ditto.",
                        "good": "0",
                        "bad": "1",
                        "replies": [
                            {
                                "user_name": "irefusetowearamask",
                                "time": "1 day ago",
                                "context": "Ditto. ",
                                "good": "0",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "animosque",
                                        "time": "1 day ago",
                                        "context": "Ditto infinity!",
                                        "good": "0",
                                        "bad": "1",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "texas_bluebonnet",
                "time": "1 day ago",
                "context": "That's not the point. He has the right to speak.",
                "good": "2",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "animosque",
                        "time": "1 day ago",
                        "context": "It was my point though. Of course he has the right to speak, just like I do.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "texas_bluebonnet",
                                "time": "1 day ago",
                                "context": "Sometimes it is hard to tell the meaning of someone's post.",
                                "good": "1",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "animosque",
                                        "time": "1 day ago",
                                        "context": "You can start by not reading something into comments that isn't there.",
                                        "good": "0",
                                        "bad": "2",
                                        "replies": [
                                            {
                                                "user_name": "texas_bluebonnet",
                                                "time": "1 day ago",
                                                "context": "Oh wow... I'm out.",
                                                "good": "2",
                                                "bad": "0",
                                                "replies": []
                                            }
                                        ]
                                    },
                                    {
                                        "user_name": "lookyloo",
                                        "time": "1 day ago",
                                        "context": "No I think you read this guy right the first time.",
                                        "good": "1",
                                        "bad": "0",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "MJ58",
                "time": "1 day ago",
                "context": "A large number of our fellow Americans look to comedians and celebs for their political information....where have you been?",
                "good": "1",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "animosque",
                        "time": "1 day ago",
                        "context": "Laughing at anybody who goes to comedians and celebrities for information.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "lookyloo",
                                "time": "1 day ago",
                                "context": "See “anyone under 25”.",
                                "good": "0",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "animosque",
                                        "time": "1 day ago",
                                        "context": "I've seen them. They know next to nothing.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": [
                                            {
                                                "user_name": "lookyloo",
                                                "time": "1 day ago",
                                                "context": "Agreed. Which is why they vote democrat.",
                                                "good": "0",
                                                "bad": "0",
                                                "replies": []
                                            },
                                            {
                                                "user_name": "lookyloo",
                                                "time": "1 day ago",
                                                "context": "And why they use the Khardashians and Taylor Swift as their political gurus.",
                                                "good": "0",
                                                "bad": "0",
                                                "replies": []
                                            }
                                        ]
                                    }
                                ]
                            },
                            {
                                "user_name": "lookyloo",
                                "time": "1 day ago",
                                "context": "Republicans are losing it because they aren’t tapping that group.",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            },
                            {
                                "user_name": "lookyloo",
                                "time": "1 day ago",
                                "context": "We can laugh at them all we want, the problem is anyone 18+ gets a vote just like you.",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "smashpotato",
                "time": "23 hours ago",
                "context": "If you listen to his podcasts or read his books, you will see he is a comedian and a very well educated man who spends a lot of time thinking before speaking",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "animosque",
                        "time": "23 hours ago",
                        "context": "Hard pass.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "historyguy99",
        "time": "1 day ago",
        "context": "Irony is Brand complaining about censorship as he explains it on Twitter.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "JoeyHairPlugs",
        "time": "1 day ago",
        "context": "YouTube's political bent is certainly liberal no doubt. They are owned by Google and we know how far to the left they swing.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "just2sly",
        "time": "1 day ago",
        "context": "Must have to many people agreeing with his philosophy on government controls. \nYOUTUBE ✌ GOVERNMENT.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "yellowmattercustard",
        "time": "1 day ago",
        "context": "Brand is being red-pilled, albeit in small doses.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "saltdispenser",
                "time": "1 day ago",
                "context": "I guess he's \"micro-dosing\"",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "JoeBidumb",
        "time": "1 day ago",
        "context": "Ive watched several of his videos.  He's surprisingly analytical, and well versed.  His demeanor, and presentation of facts really impressed me.  I did not expect that from him.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "johnny,ofcourse!",
        "time": "1 day ago",
        "context": "Vote accordingly to possibly put and end to this madness",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "MarciaMarciaMarcia",
        "time": "1 day ago",
        "context": "\"While COVID vaccines have been effective in preventing severe outcomes from the virus...\"\n\nWhere is the proof for this statement? Care to cite any scientific studies/sources? Because there is just no way to know this for a fact, for since the beginning of COVID, symptoms and severity has been all over the board. Many people claimed to be completely asymptomatic while others ended up on ventilators and died no matter the strain.\n\nVaccines have done squat, except make Big Pharma and the politicians richer than their wildest dreams. Stop with the misinformation, Fox.",
        "good": "9",
        "bad": "0",
        "replies": [
            {
                "user_name": "waclaw501848",
                "time": "1 day ago",
                "context": "Excellent post \"Marcia.\" Thank you!\nHow naive for the fearful sheep to take the purely speculative statement as the gospel truth? Shouldn't we be informed that there is no proof one way or the other? It wasn't\njust Fox spreading this manure. It started higher up. Why did all of the media fall into\na lock-step wave of deceit? Chaos and fear are the tools of totalitarians.",
                "good": "2",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "bgates",
                        "time": "1 day ago",
                        "context": "Political media labeling , this is one of the basics of the Science  of Marketing. Just like they’ve kept repeating and hammering the idea that the January 6 marches are to be called an “insurrection” in everybody’s mind to the extent that now nobody is even allowed to say that it was just a political stand that progressed into a riot and not an insurrection !!!!! .",
                        "good": "4",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "justanothercomment830",
                "time": "23 hours ago",
                "context": "\"While COVID vaccines have been effective in preventing severe outcomes from the virus...\"\n\nWith what magical antibodies? Study in BMJ shows antibody response is fleeting within weeks post shots and the vaccines cause negative efficacy to Omicron. Further vaxed are at high risk of OAS/ADE viral imprinting with the wrong directions which leads to infection enhancements. \n\nDeaths in the Australian state of Victoria, where 95% of adults have received Covid vaccines and most are boosted with mRNA shots, soared to their highest level in at least 13 years in August – far above the five-year average. Their hospitals are overwhelmed. \n\nVictoria offers almost unique data: near-real-time reporting on death trends in millions of people who are heavily vaccinated but had little exposure to Covid before being jabbed.\nThe picture is increasingly grim.",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "greatmummu",
        "time": "1 day ago",
        "context": "The left doesn’t want speakers of truth. We need a federal law against any and all censorship especially social media site’s.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "smashpotato",
                "time": "23 hours ago",
                "context": "I’m against censorship in any form. But, the downside is having to accept no censorship means there will be people will be allowed to publish anything, no matter how sick or vile I think it might be.  And that’s the problem with a blanket ban on censorship. Within hours there would be horrendous videos streaming into a screen near you.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "bebesttrump19",
        "time": "1 day ago",
        "context": "Too many people repeat only what they agree with, right or wrong. And it appears the general public has no interest in digging deeper to get at the real facts. So anyone who gets their \"information\" from a questionable source and runs with it as fact should put a disclaimer on their post that it is opinion only.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "irefusetowearamask",
                "time": "1 day ago",
                "context": "Your post is opinion only. ",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "bebesttrump19",
                        "time": "1 day ago",
                        "context": "So you won't fact check your favorites, is that what you are saying?",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "ifixrecks",
                "time": "1 day ago",
                "context": "who decides what it’s true and what a questionable source is? Cnn and msnbc lie all the time. Do they have disclaimers? The only solution is to allow full free speech",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "bebesttrump19",
                        "time": "1 day ago",
                        "context": "They ALL lie, both the right and the left. That is why the burden of finding the truth is on us, not who we listen to.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "ifixrecks",
                                "time": "1 day ago",
                                "context": "Exactly! 💯 \n\nIn order to find the truth, we must be allowed to hear ALL view points.",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "lichtenstein072",
        "time": "1 day ago",
        "context": "Bill Maher, now this guy. Even staunch liberals are concerned about the progressive deep state turning America into China. With Chairman Obama pulling Bidens string, it won't be long now!",
        "good": "3",
        "bad": "0",
        "replies": [
            {
                "user_name": "gazgl1",
                "time": "1 day ago",
                "context": "Progressive liberal - like Bill Maher?   That's rich.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "gig73",
        "time": "1 day ago",
        "context": "He just noticed this because it has affected him.  It's been going on for almost three years and possibly longer.  You're really late to the game, Russ.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "highlander7ret",
        "time": "1 day ago",
        "context": "The liberals eat their own also. Brand is far left and will admit so. However, he does have aright to free speech unless you go against the left. Hopefully all Democrats take a look at this and learn something, they aren't safe either! If they want you they will come for you no matter what!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cancelthis!!!!!",
        "time": "1 day ago",
        "context": "Google censors period. If you are trying to find the truth, stay away from Google and Wikipedia. They are politically biased. One of the founders of Wikipedia, who is no longer involved with the company, said he is ashamed at what Wiki has become. They have strayed away from what their original plan was.  You have to fact check the fact checkers these days.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rinac.",
        "time": "1 day ago",
        "context": "It IS censorship. Period.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "PKTeamMember",
        "time": "1 day ago",
        "context": "What is his alleged talent again ?",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "777XvsA350",
                "time": "1 day ago",
                "context": "Exposing liars.....",
                "good": "0",
                "bad": "1",
                "replies": []
            },
            {
                "user_name": "irefusetowearamask",
                "time": "1 day ago",
                "context": "You wouldn't know talent.",
                "good": "0",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "reddy11",
        "time": "1 day ago",
        "context": "I guess YouTube will not feel the consequences of their actions until they start to feel it in their wallets.",
        "good": "2",
        "bad": "0",
        "replies": [
            {
                "user_name": "eddiefast4321",
                "time": "1 day ago",
                "context": "Just like Americans are feeling it in their Wallets Now!\nRed Wave Coming!",
                "good": "1",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "saltdispenser",
                "time": "1 day ago",
                "context": "That's the problem. If they were legit and not funded by the FIAT printing press they wouldn't have started down this slippery slope. All these DARPA programs like Google, FaKebook and Youslesstube aren't real \"capital\" driven companies and it shows in their policies.",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "eneres_fonaed",
        "time": "1 day ago",
        "context": "Calling something \"mis-information\" IS censorship !!!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Truthstillmatters227",
        "time": "1 day ago",
        "context": "Sometimes I fear giving my honest opinion and thoughts here on this board in the event the FBI is monitoring content.  Will the FBI show up at my door because I believe Trump won the 2020 election and Biden is president only because of fraud?  Do I have a right to believe that in a world run by Joe Biden, Christopher Wray and Merrick Garland or is thought against the Democrat official line a crime?",
        "good": "2",
        "bad": "0",
        "replies": [
            {
                "user_name": "saltdispenser",
                "time": "1 day ago",
                "context": "Only time will tell, but you will be in good company if it happens.",
                "good": "2",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "macwatts",
        "time": "1 day ago",
        "context": "The computerization of mass communication has eliminated the effectiveness of the street-corner soap box and it's replacements in social media have been compromised and biased. Rumble and others are the way out to freedom of speech again. Good move, Russell Brand.",
        "good": "1",
        "bad": "1",
        "replies": [
            {
                "user_name": "historyguy99",
                "time": "1 day ago",
                "context": "But you can still go on the corner and shout all you want right?",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "lookyloo",
        "time": "1 day ago",
        "context": "Glad to see you’ve taken the red pill Russell. Welcome to reality.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "whatanevilcountry",
        "time": "1 day ago",
        "context": "Our country and its institutions are rotten to the core. If someone kicks the door in, the whole decaying structure will come crashing down. That kick will come from within.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dinn",
        "time": "1 day ago",
        "context": "No one said there's no censorship.  Look at public school libraries, for example.  Naturally, if the public can agree to censorship in schools, I'm not surprised that a private company will feel embolden to take it a step further, and there's nothing we can do to stop it.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "gordo999781",
        "time": "1 day ago",
        "context": "Top scientific experts get banned all the time for speaking out against covid propaganda.\n\nDr. Michael Yeadon, who worked for Pfizer and has intimate knowledge of viruses has been censored globally by the fake news media. Dr. Robert Malone, an expert on the mRNA used in the vaccines is also banned for reporting obvious problems with the vaccines. One of his points is that the vaccines don't kill the virus and that allows fully vaccinated people to spread it.\n\nPerhaps the most egregious example of banning a scientist is Dr. Stefan Lanka, who has proved in a German court that the measles virus has never been physically isolated. He has not claimed there is no such thing as a measles virus, or that measles does not exist, he has merely proved any scientific literature on measles virus isolation is wrong.\n\nLanka is offering 100,000 Euros to anyone who can supply scientific information to prove the measles virus exists. He is now claiming there is no scientific proof that any major virus exists and that includes HIV and covid. Dr. Luc Montagnier who discovered HIV is on record as admitting he has never seen the virus, he inferred it. Same for covid. No one has ever seen the virus on an electron microscope, it too is inferred.",
        "good": "2",
        "bad": "0",
        "replies": [
            {
                "user_name": "gap101",
                "time": "1 day ago",
                "context": "Lol. Except a German court just ordered him to pay out! The challenge was taken up by David Bardens, a German doctor who compiled evidence from medical journals proving the disease’s viral cause. When Lanka rejected the evidence, Bardens sued. Last week a German court found Bardens’ evidence persuasive and ordered Lanka to pay. \nYou shouldn’t quote two bit charlatans on subjects on which you have know personal expertise.",
                "good": "0",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "ms308",
        "time": "1 day ago",
        "context": "No it doesn’t look like censorship.  It IS censorship.",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "redcan651",
        "time": "1 day ago",
        "context": "I saw the mistake when the clip aired. It wasn’t a big deal. I was impressed a few days later when he offered the correction and apology. There’s nothing like that in the MSM. Brands is one of the new independent minds on social media. Well intentioned. Worth checking out on Rumble. (He’s entertaining even when he says something you disagree with and has caused me to think about positions I hold in the most positive way). Thank you, Russell ",
        "good": "4",
        "bad": "0",
        "replies": [
            {
                "user_name": "JoeJoeTheIdiotCircusBoy",
                "time": "1 day ago",
                "context": "He's great! I love his videos - very much spot-on point!!!",
                "good": "2",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "jdubs860",
        "time": "1 day ago",
        "context": "what exactly did he say?",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "californiamojo",
                "time": "1 day ago",
                "context": "Can’t tell. Twitter censored it",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "Crotchety_Old_Dude",
        "time": "1 day ago",
        "context": "Unless you buy into the Democrat claptrap regarding COVID, you're a target for big tech censors.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rick7008",
        "time": "1 day ago",
        "context": "Warning!!  Anything you read or see, on youtube,  facebook, Twitter, etc.  should not be taken as Absolute Truth.  Check it out and verify on your own first.  If you do this then misinformation or disinformation does not matter.   ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rhodeisland",
        "time": "1 day ago",
        "context": "Do schools still have a debate club.  I bet only liberals are allowed to participate if they do.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "patriotfezzy",
        "time": "1 day ago",
        "context": "IT'S NOT A VACCINE",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rick459",
        "time": "1 day ago",
        "context": "\"So we’re asking: Is there one standard for independent news \nbroadcasters like us on our channel, and a different standard for what \nwe would call the ‘mainstream media?’\" \n\nYes.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tommyisatexan094",
        "time": "1 day ago",
        "context": "will youtube be taking down the videos of all the government people claiming the shot work and are safe? if not, then they shouldn't be taking down any video for misinformation. the government has been lying about covid since day one.",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "phneutral",
        "time": "1 day ago",
        "context": "Oh no, the current administration doesn't ever lean on anybody to get their way. Not old,confused Joe. Just ask the oil companies.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "thyvoiceofreason",
        "time": "1 day ago",
        "context": "Just got my new Rumble page up.\nWill be watching him tomorrow.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "survivanbiden211",
        "time": "1 day ago",
        "context": "Russell Brand is part of the Joe Biden entourage. Nobody really pays any attention to him. He’s gone off the edge so many times he’s about as productive as Joe Biden is I think they run in the same circle, around and around and around.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "DemocratsAreAllLiars",
        "time": "1 day ago",
        "context": "Oh, so you libs don't LIKE being censored???  Gee, who would have thought?",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "JoeJoeTheIdiotCircusBoy",
                "time": "1 day ago",
                "context": "He's not a \"lib\".",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "John-316",
        "time": "1 day ago",
        "context": "Will Fake Book join CNN & MSNBC in the race to the bottom???",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "kill_blinton",
        "time": "1 day ago",
        "context": "Rumble is way superior video streaming service anyway and it's gaining on popularity every day.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "justsayin'010",
        "time": "1 day ago",
        "context": "The government stepped in and broke up Ma Bell making telephone service 10X better and I feel it's time the same thing happened to these social media companies. They have a monopoly and not only control the narrative but the information highway and that's a dangerous thing. Trying to shut down free speech just because you disagree with the subject matter is Un-American.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rapidfalls4466",
        "time": "1 day ago",
        "context": "Guess I will migrate to Rumble. Too many commercials on YouTube anyway.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "roler100",
        "time": "1 day ago",
        "context": "Russel is well worth a view. Usually enlightens and hits the nail on the head ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "isthisreal481",
        "time": "1 day ago",
        "context": "They are fine with misinformation as long as it’s their misinformation.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tokenposter",
        "time": "1 day ago",
        "context": "A world of unacceptable views will not be tolerated......",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "MickeyScheister21",
        "time": "1 day ago",
        "context": "Brand is on brand.  He’s entertaining and fun.  The MSM is all manure all the time.  Being censored means you’re CORRECT.  Like Alex’s, Jones and Bernstein.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Sillybob",
        "time": "1 day ago",
        "context": "That's exactly what it was!!!",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "royrsramirez",
        "time": "20 hours ago",
        "context": "YouTube is Democrat megaphone.  Break up Big Tech!!!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jollyroger418",
        "time": "18 hours ago",
        "context": "This has been ongoing for several years now where have you been?",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "loverschild",
                "time": "17 hours ago",
                "context": "he was one of them before this!!!",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "jackieo",
        "time": "16 hours ago",
        "context": "Careful…or the will give all of your email, phone records, books read, movies watched. Purchases to the FBI. they’ll think you’re a conservative if some kind and left wing nose picking hayseed will shoot you or run you over with his car.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mental.r00t.kit",
        "time": "22 hours ago",
        "context": "Who cares what a professional clown, either a real one like a comedian, or a political demagogue) says? \n\nIgnore them and learn from the data instead.\nData tells us that  Ivermectin provides  very questionable benefit as a treatment for Covid, while vaccination remains the most effective preventative measure.",
        "good": "1",
        "bad": "5",
        "replies": [
            {
                "user_name": "7gus",
                "time": "19 hours ago",
                "context": "NONSENSE.",
                "good": "2",
                "bad": "2",
                "replies": [
                    {
                        "user_name": "mental.r00t.kit",
                        "time": "19 hours ago",
                        "context": "Yeah I bet you say that about every scientist.",
                        "good": "0",
                        "bad": "1",
                        "replies": [
                            {
                                "user_name": "YoSemite652",
                                "time": "10 hours ago",
                                "context": "He's an old radicalized hippy. Ignore him.",
                                "good": "0",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "mental.r00t.kit",
                                        "time": "10 hours ago",
                                        "context": "OK. Thank goodness for the mute button.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "j_dubs",
        "time": "1 day ago",
        "context": "MSNBC justified that comment by saying it was what was believed at the time.  I'll agree with that, sure.  But there are examples of misinformation about Covid and the vaccine even today and YouTube, Facebook, or Twitter won't take them down.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "KTOWN",
        "time": "22 hours ago",
        "context": "I think Main Stream Media (MSM) should be renamed Monopoly Media (MM) or Censorship Media (CM) since they don't want anyone else's opinions but their own to have audience with people.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "anotherbadidea",
        "time": "1 hour ago",
        "context": "Weird they didn't say what was actually censored.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jack12410",
        "time": "23 hours ago",
        "context": "YouTube is wrong. Yes Virginia, there is right and wrong. I don't care what they taughtyou in school",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "BeeGee76",
        "time": "21 hours ago",
        "context": "Cant stand Brand but all big tech firms have been pushing censorship against their chosen narrative for years now in a way which would make Stalin blush.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mikeveryhighnumber",
        "time": "1 day ago",
        "context": "It is amazing that the will leave up Madcow and other CNN and MSDNC mission and go after others.  Didn’t they cancel Trump for saying he’s 6’3”, when it’s obvious he’s really 6’2”, after all!",
        "good": "2",
        "bad": "0",
        "replies": [
            {
                "user_name": "gsb470",
                "time": "1 day ago",
                "context": "He is 6\"3 when he stands Russal Craw toe. ya, it a joke.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "stromberg7",
        "time": "36 minutes ago",
        "context": "Russell, get over to Rumble.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bentarmbarpracticioner",
        "time": "1 day ago",
        "context": "The proper internet apology always ends with \"...and the horse you rode in on.\"",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Truthseek197",
        "time": "20 hours ago",
        "context": "Guaranteed they are liberal leftists doing all the cancelling behind the curtain of the internet. Who knows it could be antifa or BLM too. It is without a doubt censorship.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "72boogaloo",
        "time": "23 hours ago",
        "context": "Just about everything the Gov and main stream media put out on COVID has been completely wrong. How about that vaccine that was promised to be 98% effective... They don't like it when people post things that contradict the information they are making up as they go... I have a hard time believing people that yell \"science!\" but say there are more than two sexes....",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Tanndog",
        "time": "1 day ago",
        "context": "Ricky Madcow,he gets a free pass on Russian hoax and anything on Trump. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "foxlols",
        "time": "1 day ago",
        "context": "Property ownership rights really confuse some of the people who are allowed to use that property for free.  Lol",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "smashpotato",
                "time": "23 hours ago",
                "context": "People also quickly forget the lengthy terms & conditions they agree to abide by when they sign up for a social media account.",
                "good": "0",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "jonjinglehimmer",
                        "time": "23 hours ago",
                        "context": "LOL.....LOL....LOL",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "jonjinglehimmer",
                "time": "23 hours ago",
                "context": "People forget that these tech companies are protected from lawsuit under section 230 and are therefor being protected by the government and ARE required to abide by the the First Amendment of the Constitution ! They are not private companies until their protection from suit is removed and they can be held liable in court like any other company.",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "lordgarth746",
        "time": "1 day ago",
        "context": "Welcome to the world you helped create.",
        "good": "1",
        "bad": "0",
        "replies": []
    }
]