[
    {
        "user_name": "dr.-t",
        "time": "16 July, 2021",
        "context": "Some less than others… ",
        "good": "8",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "DanS.",
        "time": "16 July, 2021",
        "context": "Awaiting the story on the evolution of Democrats.",
        "good": "105",
        "bad": "14",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "the_gop_are_modern_confederates",
        "time": "16 July, 2021",
        "context": "8% of our DNA was passed to us through viruses infecting our ancestor's reproductive organs, but don't tell the Evangelicals that, they believe a Middle-Eastern god conjured us from thin air. 🤣🤣🤣",
        "good": "12",
        "bad": "36",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "montanisemperliberi472",
        "time": "16 July, 2021",
        "context": "So what percent is same as apes? Is that DNA percent similar to horses or elephants?",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "rogee54",
        "time": "16 July, 2021",
        "context": "Some humans DNA is still are aligned with Apes and Monkeys.",
        "good": "21",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "gauner828",
        "time": "16 July, 2021",
        "context": "They can't state what they know to be truth: those \"ancestors\" were humans, too.",
        "good": "8",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "demorat_repellent",
        "time": "16 July, 2021",
        "context": "Klingon DNA is the best....",
        "good": "51",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "kevinmichael",
        "time": "16 July, 2021",
        "context": "What would you expect when the sample population is made up of democrats.",
        "good": "93",
        "bad": "17",
        "replies": []
    },
    {
        "user_name": "ilovetacos516",
        "time": "16 July, 2021",
        "context": "What I think is interesting is that I was told in college that the principle difference in skin pigmentation was ancestral location to the equator. That “colored” people are no different in their dna from any other person. I believe this to be true. Why then do so may of them seek to destroy everything “different” than them. Must just be a massive personality flaw and self inflicted desire to prove themselves. I was a lazy POS in my youth to, maybe try giving a dam for a bit and work towards success instead of telling everyone owes you something.",
        "good": "10",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "denniskaegi",
        "time": "16 July, 2021",
        "context": "The experts can't agree on what matters in DNA. This study says less than 10% of the DNA defines humans. About 90% we don't know it's purpose. Maybe it is just something to hold the important stuff. Like paper is something for printed text to sit on. A page of the Bible and of a movie script are 90% alike (the paper) and only 10% different (the words). All parts are functional, but only that 10% carries any relevant information.",
        "good": "187",
        "bad": "33",
        "replies": []
    },
    {
        "user_name": "Ballistx",
        "time": "16 July, 2021",
        "context": "A little premature, since we ACTUALLY know about 0.002% of the complete DNA. That DNA takes a tiny sperm and egg and makes a living, breathing Human and we have the audacity to think we have any true understanding of its complexity. How vain and (still) stupid we are. :)",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "thecheetoquake",
        "time": "16 July, 2021",
        "context": "The number is skewed down by the troglodyte MAGAs who barely have the intelligence of a baboon. Heck, Trump can't even read.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "error": "error"
    },
    {
        "user_name": "dalo78",
        "time": "16 July, 2021",
        "context": "Where do morals come into play w dna?",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "SethBullock",
        "time": "16 July, 2021",
        "context": "Actually, it was left out of this piece for PC purposes, but they found that Libbies, Lefties, and Commies share only 1% of their DNA with modern humans.",
        "good": "83",
        "bad": "15",
        "replies": []
    },
    {
        "user_name": "RedBoomerang",
        "time": "16 July, 2021",
        "context": "What?",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "sdclear",
        "time": "16 July, 2021",
        "context": "I'm surprised the Biden administration didn't ax this story for misinformation. There must be something in it that they don't like or may be offensive. They are monitoring everything.",
        "good": "135",
        "bad": "26",
        "replies": []
    },
    {
        "user_name": "JPower",
        "time": "16 July, 2021",
        "context": "Evolution is reality... Your god never existed... Get over it, and if you don’t fine, but when you die there won’t be any magical fairyland waiting for you... Better to accept it now",
        "good": "7",
        "bad": "14",
        "replies": []
    },
    {
        "user_name": "sciencerocks",
        "time": "16 July, 2021",
        "context": "That is not surprising at all. We share 89.5% of our genes with cows.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Go_Navy!",
        "time": "16 July, 2021",
        "context": "I think I liked Neanderthals better than modern day humans.",
        "good": "13",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "suicidallionsfan",
        "time": "16 July, 2021",
        "context": "In Congress it's <1%.",
        "good": "98",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "EFBrock",
        "time": "16 July, 2021",
        "context": "It’s called Evolution folks! Adapt or die!",
        "good": "6",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "sherrysmith",
        "time": "16 July, 2021",
        "context": "Evolution certainly seems to unfold VERY slowly.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Cap3",
        "time": "16 July, 2021",
        "context": "So why did the human race stop evolving?",
        "good": "3",
        "bad": "11",
        "replies": []
    },
    {
        "user_name": "madmax777",
        "time": "16 July, 2021",
        "context": "We all came from Adam and Eve, not from gorilla.",
        "good": "10",
        "bad": "17",
        "replies": []
    },
    {
        "user_name": "pinkprolapse",
        "time": "16 July, 2021",
        "context": "I know a number of people where I think the number is closer to zero.",
        "good": "176",
        "bad": "10",
        "replies": []
    },
    {
        "user_name": "wolfj",
        "time": "16 July, 2021",
        "context": "Great! Look around. If we're the epitome of human evolution then Darwin must have been wrong.\nThey were partying too hard on The Beagle.",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "jp853",
        "time": "16 July, 2021",
        "context": "Ah... 7% is huge. Look at the difference between us and other apes.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "suicidallionsfan",
        "time": "16 July, 2021",
        "context": "Evolution is a lie. We're actually devolving.",
        "good": "6",
        "bad": "8",
        "replies": []
    },
    {
        "user_name": "xidenloveschina",
        "time": "16 July, 2021",
        "context": "The close proximity to Neanderthal man would explain all the 'supposed' Biden voters",
        "good": "18",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "DekeUS",
        "time": "16 July, 2021",
        "context": "“Not long ago we shared our planet with other human lineages”. You mean the ones we killed and ate?",
        "good": "6",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "william2017",
        "time": "16 July, 2021",
        "context": "I don't see how anyone in their right mind could believe we are so related to the past.  It's pretty obvious that we are unlike many of those early primates and especially apes, so there for we did not evolve upon this planet so much as we traveled here and perhaps interbred.  Something definitely happened say 10,000/12,000 years ago and ancient cultures definitely hint at that. Maybe we're livestock but Darwin was wrong.  There is some base of truth in religion.  You don't have to believe it all,  maybe Jesus knew where the rocks were when he walked on water,  maybe Moses just happened to cross at low tide.  Where is the actual physical evolution since ancient times?  Because we fly planes around and nonsensically tweet our every move isn't exactly evolution. Have you seen the democratic party?  If anything humans as we call ourselves are de-evolving. We're definitely in the decline of civilization.  It may very well turn out to be a cookbook but bottom line is there is more to this story and there is no way we are alone in this universe and quite likely our dna or part of in some way shape or form came here from far far away.  Now beam me up Scotty.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "likefrieswiththat",
        "time": "16 July, 2021",
        "context": "Is this cleared by the Bidme administration? Can't be confused by opinion, I require the USDNC certain approved science",
        "good": "3",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "homeschoolmafia",
        "time": "16 July, 2021",
        "context": "Who are all these twisted weirdos out digging up dead things? Have you seen a science library? It’s full of years and years of wasted efforts on the mundane conditions of nothing important. Books and books on the color of dirt, doo doo, and pine straw… interviews with bug hoarders, tree leaf enthusiasts, and bone collectors. If I were an insurance commissioner, I’d recommend a good fire just to improve the air quality.",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "belikewater114",
        "time": "16 July, 2021",
        "context": "This is white only people history, right?",
        "good": "2",
        "bad": "5",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "SniffySleepyCreepyBeijingJoeBiden🚴🏽‍♂️💨💩",
        "time": "16 July, 2021",
        "context": "What evil alien race deposited democrats here?",
        "good": "19",
        "bad": "5",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "OrangeCupcake",
        "time": "16 July, 2021",
        "context": "Yes /// Can we not all see that we evolved just as Darwin said? Forget the mumbo-Jumbo fed through religion. 50k years from now its possible another branch will spawn off the tree and we as we know us, will be on the way to becoming fossils. \n\nI hope the next branch is smarter and less violent.",
        "good": "7",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "cas66300",
        "time": "16 July, 2021",
        "context": "What did Charles Darwin wrote in his second book?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "southernstray",
        "time": "16 July, 2021",
        "context": "Fortunately, these scientists didn't supply deeper information and so prevented the anti-racist riots.",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "clarity466",
        "time": "16 July, 2021",
        "context": "Judging from the all violence and crime in our large cities, Democrat voters stopped evolving long ago.",
        "good": "13",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "PresidentBIDEN!!!",
        "time": "16 July, 2021",
        "context": "What?!? I thought we were the modern humans...",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bfishing",
        "time": "16 July, 2021",
        "context": "There are humans and then there are primates. Usually the looters and criminals are the primates.",
        "good": "17",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "thx1140",
        "time": "16 July, 2021",
        "context": "And the DNA of the 12.6% is???",
        "good": "6",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "crushthelies",
        "time": "16 July, 2021",
        "context": "Fox News got the predictable responses from the audience.  Racists, this is your article to rant about.  Fox News takes care of you.",
        "good": "5",
        "bad": "9",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "thedon348",
        "time": "16 July, 2021",
        "context": "We are nothing more than animals with the ability to think at a higher level.  And for some that ability is limited.  Just watch your local news every day.",
        "good": "146",
        "bad": "21",
        "replies": []
    },
    {
        "user_name": "taxpayer45",
        "time": "16 July, 2021",
        "context": "Only 2% difference between Humans and Chipanese",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "biden-is-senile",
        "time": "16 July, 2021",
        "context": "Yet less than 1% is unique to blacks",
        "good": "1",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "FranNC471",
        "time": "16 July, 2021",
        "context": "The apple don't fall far from the tree.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "SigurdtheViking",
        "time": "16 July, 2021",
        "context": "So, when does the next class of apes graduate to human beings?",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Joemomma033",
        "time": "16 July, 2021",
        "context": "At some point we’ll be reading about what percentage reptoid anunaki dna  that we used to think was “junk dna”  we all have",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "GoldElephant",
        "time": "16 July, 2021",
        "context": "Try looking at it from outside the box. Maybe every human was originally white and the darker races were once an ancient white race.",
        "good": "0",
        "bad": "5",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "Hangout1967",
        "time": "16 July, 2021",
        "context": "Another explanation is Democrats are in reverse evolution returning to their Neanderthal DNA.",
        "good": "10",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "lemons",
        "time": "16 July, 2021",
        "context": "Scientists all agreed on one thing, Trump  really is brainless,",
        "good": "2",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "theconchrepublic",
        "time": "16 July, 2021",
        "context": "Is this an excuse for bad behavior?... and racial trouble/..........not in a million years...science is not having a good year or two..",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "IQ168-plus",
        "time": "16 July, 2021",
        "context": "\"\"Not that long ago, we shared the planet with other human lineages.\"  Is this the point where they \"discover' that Caucasians and blacks have different genomes?  So much for CRT.",
        "good": "5",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "Fbt34",
        "time": "16 July, 2021",
        "context": "Related topic, the way I see it:  Religion (when used for benevolent purposes) is useful for generating optimism/hope/strength where there logically shouldn't be any. Science, on the other hand, is better for studying/predicting physical phenomena. Just use the right one for the right problem and the two can peacefully/simultaneously co-exist. It's when you use one to do the other's job that things tend to get stupid.",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "Democrats_Win_Darwin_Award",
        "time": "16 July, 2021",
        "context": "It took intelligent humans to conclude that?",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "crunchyhippo",
        "time": "16 July, 2021",
        "context": "We share 50% of our DNA with bananas. Did we descend from them, too? According to the theory, the universe was once nothing but hydrogen gas. So, given enough time, hydrogen gas turns into people? Has anyone ever seen this happen? These are the absurdities people will believe when they try to erase God.",
        "good": "15",
        "bad": "11",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "Christian97",
        "time": "16 July, 2021",
        "context": "\"279 modern people from around the world\", lol. Totally ridiculous. SubSaharans are not the same specie as Eurasians. Evolution left them behind ~ 100,000 years ago.",
        "good": "2",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "maxinestaxadermist",
        "time": "16 July, 2021",
        "context": "The Biden crime family are all neanderthals. So much for science.",
        "good": "4",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "nibiru860",
        "time": "16 July, 2021",
        "context": "God created everything in 7 days. He made us 7% similar as a reminder to us that he created everything in 7 days. Liberals will disagree with me but this is what’s happening here.",
        "good": "3",
        "bad": "7",
        "replies": []
    },
    {
        "user_name": "Bruce_Beat_Michelle_Mens_Decathlon",
        "time": "16 July, 2021",
        "context": "And 13% of the population is susceptible to Democrat welfare programs that cause generational poverty.",
        "good": "16",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "harathra",
        "time": "16 July, 2021",
        "context": "\"That's a pretty small percentage,\" said Nathan Schaefer, a University of California computational biologist and co-author of the new paper. \"This kind of finding is why scientists are turning away from thinking that we humans are so vastly different from Neanderthals.\"\n\nWell, we have Neanderthals today, they are called Democrats.\nIt may also explain why certain cultures are more progressive than others.",
        "good": "5",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "theconchrepublic",
        "time": "16 July, 2021",
        "context": "... 7%... dna...California  Professor... crt... it all adds up..",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "rjgar1791214",
        "time": "16 July, 2021",
        "context": "would like to know what they consider \"modern humans\" to be and how\nmuch of \"their\" DNA is shared with Neanderthals\narticle did not explain in detail how they were isolating the primary\nDNA that was being used to gather the comparative samples/data",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "eadams1",
        "time": "16 July, 2021",
        "context": "Acts 17: 26\n\nWe all come from a common ancestor.",
        "good": "5",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "theconchrepublic",
        "time": "16 July, 2021",
        "context": "CRT  takes over  the evolutionary theory......makes sense for some..",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "HelpIliveinCalifornia",
        "time": "16 July, 2021",
        "context": "I wonder what it was like to be a transgender neanderthal ",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "nhwolf",
        "time": "16 July, 2021",
        "context": "That explains liberals, they're missing that 7%.",
        "good": "8",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "Keepingitreal732",
        "time": "16 July, 2021",
        "context": "Take some blood from Demonrats and you’ll find they have more in common with the Neanderthals and the Dodo than normal(Republicans & Libertarians)people",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "justpassenthru",
        "time": "16 July, 2021",
        "context": "I want to inject Albert Einstein's DNA ... anyone know where I can score some?",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "alexxx888",
        "time": "16 July, 2021",
        "context": "What makes humans unique? The Original from which we were created.",
        "good": "7",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "deplorablebrian",
        "time": "16 July, 2021",
        "context": "Focus on increasing human intelligence and eliminating disease.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Texascherokee",
        "time": "16 July, 2021",
        "context": "Many today retain their Subhuman Traits and Dwell in Big Democrat Controlled Cities!",
        "good": "10",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "bigd55",
        "time": "16 July, 2021",
        "context": "Still a mystery about Clintons.",
        "good": "5",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "Redcars",
        "time": "16 July, 2021",
        "context": "13% have 0%",
        "good": "6",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "ssbn632873",
        "time": "16 July, 2021",
        "context": "A hummingbird's heart beats at 1,200bpm. A hummingbird that flies at sea level can also fly at 35,000 feet. No other critter can do that. When God made us and all the creatures of the earth, he certainly knew what he was doing. Except for the Avocado, the seed is too big.",
        "good": "15",
        "bad": "8",
        "replies": []
    },
    {
        "user_name": "AR15_Man",
        "time": "16 July, 2021",
        "context": "Anyone want to guess what group kept the genes for violence?",
        "good": "8",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "Brostheghost",
        "time": "16 July, 2021",
        "context": "Well, I guess this explains the major majority of Fox News racist commentors",
        "good": "5",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "taxpayer45",
        "time": "16 July, 2021",
        "context": "The jelly fish has lived for 400 milion years without a brain  so theres still hope for Democrats",
        "good": "23",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "thoraxhammersmith",
        "time": "16 July, 2021",
        "context": "Mitch McConnell is part amphibian.",
        "good": "4",
        "bad": "7",
        "replies": []
    },
    {
        "user_name": "Femadurkadur",
        "time": "16 July, 2021",
        "context": "I’ve posted about this before. Only European and East Asian lineages carry 4-7% neanderthal DNA. The neanderthals were actually more advanced than H Sapiens. This result mirrors the IQ results found in The Bell Curve. The book was dismissed as racist but the critics could never actually discredit their scientific methods.",
        "good": "12",
        "bad": "4",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "archaeologist55",
        "time": "16 July, 2021",
        "context": "This is all a lie. There has been only one human race and no such thing as neanderthals or alternative ancient races.",
        "good": "5",
        "bad": "17",
        "replies": []
    },
    {
        "user_name": "alf777",
        "time": "16 July, 2021",
        "context": "So, 1. We are not all alike, 2. Racism is natural, and 3. Smoking Marlborough reds are good for you?",
        "good": "0",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "elofugarit",
        "time": "16 July, 2021",
        "context": "What percentage of DNA do Americans share with Democrats?",
        "good": "9",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "GoldRadio",
        "time": "16 July, 2021",
        "context": "Even more intriguing is that liberals all demonstrate 100% of their DNA contributes to Amoeba.",
        "good": "8",
        "bad": "3",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "deplorablebrian",
        "time": "16 July, 2021",
        "context": "In 100-200 years they’ll probably find stuff like this as humorous as we do the people from the 1800s that measured skulls.",
        "good": "4",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "TheIlluminatus",
        "time": "16 July, 2021",
        "context": "7% is a lot more than I'd have expected.\n\nThose must be mostly the genes for being immoral.",
        "good": "3",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "constitutionalvalues",
        "time": "16 July, 2021",
        "context": "The Alien Factor.",
        "good": "4",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "civilwar2020",
        "time": "16 July, 2021",
        "context": "13% of Americans are 99% the same as their ancient ancestors. The one little thing that evolved was their ability to somewhat speak.",
        "good": "6",
        "bad": "7",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "rc135crew870",
        "time": "16 July, 2021",
        "context": "Well that certainly explains a lot.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "robertowallace",
        "time": "16 July, 2021",
        "context": "Michelle Obama is barely 5%.",
        "good": "2",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "hillary’s_cankles_speak",
        "time": "16 July, 2021",
        "context": "I guess there is a certain race that only got 5 or 6%…….",
        "good": "6",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "fakei4prison",
        "time": "16 July, 2021",
        "context": "Just when you thought that Evolution was the biggest lie, then comes the \"legitimate\" installment of the Buydem regime.",
        "good": "5",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "jus14daroad",
        "time": "16 July, 2021",
        "context": "My mother-in-law always swore her daughter married a sub-human species.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "roaringwarrior",
        "time": "16 July, 2021",
        "context": "Seeing these comments we know who carries the power over humanity. The obsession is mind boggling.",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "shishaldin760",
        "time": "16 July, 2021",
        "context": "Democrats share 100% of the Neanderthal genome 🧬",
        "good": "8",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "medtech68",
        "time": "16 July, 2021",
        "context": "Willing to bet that there are some “modern” humans that share a whole lot more DNA with the 40,000+ year old ancient humanoids than 7%!  ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "hogpilot69",
        "time": "16 July, 2021",
        "context": "Bet modern day African DNA match 87% of Neanderthal man.",
        "good": "4",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "robertowallace",
        "time": "16 July, 2021",
        "context": "Stolen elections have consequences.",
        "good": "8",
        "bad": "7",
        "replies": []
    },
    {
        "user_name": "solareclipse168",
        "time": "16 July, 2021",
        "context": "But but what about Adam and Eve? Oh man, does that mean they weren't 100% human?",
        "good": "0",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "jcarmi462",
        "time": "16 July, 2021",
        "context": "Nonsense.... it was just two years ago they traced our DNA back to one man and one woman... so it sounds like they don't really know they are doing... as usual",
        "good": "1",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "robertowallace",
        "time": "16 July, 2021",
        "context": "Joe Biden is more confused now than Michelle Obama’s DNA Test Results from “22 And Me”.",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "GoldSnow",
        "time": "16 July, 2021",
        "context": "There is no such thing as a 'Modern Human' since he didn't evolve, he was created.  Man has had the same DNA since the day God created Adam in the garden of Eden.",
        "good": "3",
        "bad": "7",
        "replies": []
    },
    {
        "user_name": "atlatl",
        "time": "16 July, 2021",
        "context": "The misconception is that Neanderthals are the barbaric, cavemen looking ones. It was a way for us to reference archaic humans. The same time as Neanderthals, were early homosapiens, who looked even more barbaric, like gorillas. Neanderthals were often pale, and some young ones looked blondish. White people have MORE Neanderthal DNA than black people- Africans have no Neanderthal. Neanderthals are the ones who ventured away from Africa and could adapt in cold climates. Neanderthal DNA is found the most in the whitest countries, like Nordic people. To help you wrap your mind around it, contrary to what we knew 30 years ago… a blonde Swedish woman has more Neanderthal than anyone, the black African has none. If it weren’t for Neanderthals, we would probably still be in Africa and yet to invent the wheel.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "robertowallace",
        "time": "16 July, 2021",
        "context": "Michelle Obama is missing more DNA than Monica Lewinsky with Bill Clinton in the Oval Office toilet.",
        "good": "2",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "SniffySleepyCreepyBeijingJoeBiden🚴🏽‍♂️💨💩",
        "time": "16 July, 2021",
        "context": "What of the DNA of abnormal specimens with heightened global warming, racism, and virus fear genomes?",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "greatnation1741",
        "time": "16 July, 2021",
        "context": "There are no fossil remains older than approximately 6000 years",
        "good": "1",
        "bad": "13",
        "replies": []
    },
    {
        "user_name": "gabe_the_goober",
        "time": "16 July, 2021",
        "context": "That's kinda how this evolution thing works. Small changes over time and all.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "robertowallace",
        "time": "16 July, 2021",
        "context": "Melania Trump makes Michelle Obama look like a Transgender subspecies.",
        "good": "6",
        "bad": "7",
        "replies": []
    },
    {
        "user_name": "robertowallace",
        "time": "16 July, 2021",
        "context": "Jill Biden is as much of a Doctor as Dr.  Dre’.",
        "good": "6",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "needstobesaidnow",
        "time": "16 July, 2021",
        "context": "Does this info fit in with the unproven THEORY of evolution?",
        "good": "1",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "roaringwarrior",
        "time": "16 July, 2021",
        "context": "The most dangerous are those who think they are smarter then rest of society. The most dangerous are those who ruined other society which has caused more imbalance of nature.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "notme152",
        "time": "16 July, 2021",
        "context": "WELL WITH ALL THE IN BREEDING A FEW MORE YEARS YOU WON'T FIND ANY",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "robertowallace",
        "time": "16 July, 2021",
        "context": "Melania Trump makes Michelle Obama look like a Transgender Australopithecus.",
        "good": "2",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "gunvald",
        "time": "16 July, 2021",
        "context": "Maybe we are all aliens and on a prison planet.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "robertowallace",
        "time": "16 July, 2021",
        "context": "Speaking of fossils, Joe Biden is more confused now than LeBron James in an English Composition class.",
        "good": "5",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "robertowallace",
        "time": "16 July, 2021",
        "context": "In high school, Mayor Pete started as a tight end, but, by the end of high school he was just another wide receiver.",
        "good": "5",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "robertowallace",
        "time": "16 July, 2021",
        "context": "If Jill Biden is a Doctor, Bill Cosby is a respected gynecologist/pharmacist.",
        "good": "7",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "Landshark818",
        "time": "16 July, 2021",
        "context": "Required a presupposition that dna is like some sort of lock combination. Different dna is just that, different dna.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Oldwhiteguy262",
        "time": "16 July, 2021",
        "context": "Evolutionists are in that same category with Dr. Fraudi.",
        "good": "4",
        "bad": "9",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "imperialpresence",
        "time": "16 July, 2021",
        "context": "prior to 8.000 years ago...every mammal on earth had a positive RH factor in there blood...negative rh is exclusive to the genetic offspring of white people",
        "good": "4",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "taxpayer45",
        "time": "16 July, 2021",
        "context": "Why do humans have a bone at the end of their spine made to attach a tail  Did God have left over tail bones he wanted to get rid of",
        "good": "2",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "Goliathrex",
        "time": "16 July, 2021",
        "context": "Just curious… is the dumb as dirt gene  dominant in Democrats? Or is it the “I can’t understand simple logic” gene? In either case, it’s obviously a genetic defect that has been exacerbated by warning labels which has interrupted the natural selection process.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "imaosudad",
        "time": "16 July, 2021",
        "context": "Well I would suspect looking at democrat cities some of us might be more human than others.",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "rocksoff",
        "time": "16 July, 2021",
        "context": "Another nail for the Adam and Eve myth, unless earlier humans were just practice.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Isandlwana",
        "time": "16 July, 2021",
        "context": "My white genes are racist.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "GoldBattery",
        "time": "16 July, 2021",
        "context": "In a related story, LeBrown James was identified as the 'missing link'.",
        "good": "14",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "PurpleWheel",
        "time": "16 July, 2021",
        "context": "Simple: we are made in image of God. We did not descend from animals. No evidence for macro evolution. Zero. Nada,. Nothing",
        "good": "2",
        "bad": "7",
        "replies": []
    },
    {
        "user_name": "rick70423",
        "time": "16 July, 2021",
        "context": "I await the day when brave scientists announce which parts of our global community share the most DNA with ancient Neanderthals. ",
        "good": "8",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "peach46282",
        "time": "16 July, 2021",
        "context": "If the science on climate change is settled, why isn’t the science on evolution settled?",
        "good": "3",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "imperialpresence",
        "time": "16 July, 2021",
        "context": "aliens",
        "good": "4",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "wldflr878",
        "time": "16 July, 2021",
        "context": "Obvious differences in this Photo was the frontal lobe of the present day vs. Neanderthal..IMO",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "imperialpresence",
        "time": "16 July, 2021",
        "context": "since white people are the only mammal on earth with a negative RH factor...and the negative rh factor has only existed for  8,ooo years...that would suggest our ancestor are not from this world...seems we have colonizer in our DNA",
        "good": "4",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "utahhatesmitt",
        "time": "16 July, 2021",
        "context": "Dr. Akey said a mouthful.  “Not that long ago, we shared the planet with other human lineages.”  I’d say he was off by a little bit.  He should have “We currently share the planet with other human lineages.",
        "good": "47",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "doodybutt",
        "time": "16 July, 2021",
        "context": "In hog jowls boys and girls it's 1%.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tvtaerum",
        "time": "16 July, 2021",
        "context": "Interesting analysis but in the world of genomics, 7% is a HUGE difference and much larger than I would have anticipated.",
        "good": "62",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "ThomasFoolery",
        "time": "16 July, 2021",
        "context": "You mean the Adam & Eve thing isn't TRUE!?!?!?",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Itiswhatitis405",
        "time": "16 July, 2021",
        "context": "Are we still allowed to say Neanderthal?",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "mercenary76",
        "time": "16 July, 2021",
        "context": "wonder if bill has left enough dna around the world to breed a sub set ? the clinton crime family strain .",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "1aa301",
        "time": "16 July, 2021",
        "context": "The one time, that I agree with blacks, is that Jesus, wasn't exactly white, however he wasn't exactly black. More mideastern, if you will. And they have that evidence from veronicas veil, so you should believe in Jesus, in any case. Peace.",
        "good": "1",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "kaycharles",
        "time": "16 July, 2021",
        "context": "I’ve said for years the “missing link” walks among us.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "CyanPopcorn",
        "time": "16 July, 2021",
        "context": "Wow, the DNA that wrote \"War and Peace\" and the plays of Shakespeare must really be something...",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "taxpayer45",
        "time": "16 July, 2021",
        "context": "The bible said the earth was the center of the universe. Galileo Galilei said thats a bunch of non sense  The Pope ordered him murdered but instead he was locked away till he died  The church erased that part of bible\nSo did God forget how he made the universe",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "geocho",
        "time": "16 July, 2021",
        "context": "Of course we share DNA with the Neanderthals and the Denisovans (+ whatever others group(s))... everybody was boinking everybody back then, and we still are.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "another_sam",
        "time": "16 July, 2021",
        "context": "There is a fun dichotomy that happens in these forums on fox. On one hand they will deny evolution to the extreme. But also make fun of black folks for being less evolved. You all are both ignorant and racist and it’s not surprising in the least.",
        "good": "5",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "libturdsaywha",
        "time": "16 July, 2021",
        "context": "Pat, I’d like to solve the puzzle!",
        "good": "16",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "GoldBullhorn",
        "time": "16 July, 2021",
        "context": "Closer to .07% if you are in the 13%.",
        "good": "8",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "drheywood",
        "time": "16 July, 2021",
        "context": "In some segments of the population it's not even close to 3% let alone 7.",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "bribing-Bidens",
        "time": "16 July, 2021",
        "context": "and 93% of Dems/Libs genome is still share with now-extinct Neanderthals. And, they're starting to re-evolve into ones",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "retireddist1b",
        "time": "16 July, 2021",
        "context": "Evolution is a big scientific lie that ignores the reality of this planet and species.",
        "good": "1",
        "bad": "10",
        "replies": []
    },
    {
        "user_name": "rfloyd399",
        "time": "16 July, 2021",
        "context": "\"scientists are turning away from thinking that we humans are so vastly different from Neanderthals.\".....so Neanderthals are basically humans? Seems I've heard that before.",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "Martus_Abdias_",
        "time": "16 July, 2021",
        "context": "In every cell, normal women have 2 copies of the X chromosome,\nalthough usually only one copy is active within an individual cell.\nThis gives them a genetic stability since if one copy is 'bad' then the other is still present to manufacture the required proteins, etc.\n\nBut men have only one copy of the X chromosome. That means men have no redundancy and if the one X chromosome is abnormal, then it is more likely to produce an abnormal effect. This is why more male babies are born with genetic disorders. \n\nHowever, men also have a Y chromosome which is additional information that women do not have. It is like additional circuitry for a computer or more extensive and special programming.",
        "good": "30",
        "bad": "8",
        "replies": []
    },
    {
        "user_name": "grumpers",
        "time": "16 July, 2021",
        "context": "so that explains why Jane Goodall has been looking for Stacey Abrams...",
        "good": "4",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "SleepyJoe2020",
        "time": "16 July, 2021",
        "context": "Do trumpers beleive science now?",
        "good": "3",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "danofromhouston",
        "time": "16 July, 2021",
        "context": "Not really. A lot of our DNA is concerned with basic physiological and metabolic structure. The part that separates us from other life forms is very small but uniquely essential to US",
        "good": "16",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "ardee2x",
        "time": "16 July, 2021",
        "context": "I'm sorry to burst your bubble but we have counted over 3 Billion base pairs (and counting) in modern humans. Do the Math. We are as much \"related\" to any other human species as we are to tulips. EVERY \"Living\" thing shares certain gnome combinations, that's what makes it \"Living\". A 7% difference is a huge world apart.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "foxisgreatforus786",
        "time": "16 July, 2021",
        "context": "There has been some evolving in the last 6000 years for sure. Some more than others.",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "herbnsurff",
        "time": "16 July, 2021",
        "context": "I guess we can eliminate bright , high IQ individuals sharing any DNA with dark-skinned males .",
        "good": "0",
        "bad": "7",
        "replies": []
    },
    {
        "user_name": "Joe_sucks",
        "time": "16 July, 2021",
        "context": "Aliens.  Duh!",
        "good": "3",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "GoldBattery",
        "time": "16 July, 2021",
        "context": "God: \"Ugh, I should have started resting on the 6th day\".",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "53085",
        "time": "16 July, 2021",
        "context": "I don't care.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "GoldCloud",
        "time": "16 July, 2021",
        "context": "Studies also show that Micheal Obamas great great great great great great great grandfather was Cornielus. Get you're hands off me you damb dirty ape?",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "taxpayer45",
        "time": "16 July, 2021",
        "context": "Anyone who didn't believe the bible was murdered and now bible nutcases want to blend facts with that nonsense  Sorry no you've been proven wrong",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Isandlwana",
        "time": "16 July, 2021",
        "context": "Look up Rising Star Cave. Its interesting",
        "good": "3",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "CROMAG",
        "time": "16 July, 2021",
        "context": "Neural Brain Function. Something that is missing among Afrikaners.",
        "good": "1",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "VonStroheim",
        "time": "16 July, 2021",
        "context": "7% seems to be enough... so where's this going?",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "taxpayer45",
        "time": "16 July, 2021",
        "context": "The museum of natural history has all the fossils of humans for 4 million years  \nDoes any religion have even 1 fact or just of bunch of made up stories",
        "good": "5",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "ObeseIllegitimo676",
        "time": "16 July, 2021",
        "context": "So what's the big news? We share 98% of our DNA with modern chimps.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dorachester",
        "time": "17 July, 2021",
        "context": "Humans have souls.",
        "good": "6",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "elmerwallace",
        "time": "17 July, 2021",
        "context": "Just 7% of our DNA is unique to modern humans, study shows\nAnd it leaked from a Chinese lab.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "PurpleWheel",
        "time": "17 July, 2021",
        "context": "DNA points to a designer. Man is designed by God and created in His image. We exist for a purpose\nJohn 3:16-19\n16 For God so loved the world that he gave his one and only Son, that whoever believes in him shall not perish but have eternal life. 17 For God did not send his Son into the world to condemn the world, but to save the world through him. 18 Whoever believes in him is not condemned, but whoever does not believe stands condemned already because they have not believed in the name of God’s one and only Son. 19 This is the verdict: Light has come into the world, but people loved darkness instead of light because their deeds were evil.",
        "good": "11",
        "bad": "6",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "rfloyd399",
        "time": "16 July, 2021",
        "context": "Three monkeys sat in a coconut tree\nDiscussing the things that are said to be—\nSaid one to another: “Now listen you two\nThere’s a certain rumor, but it can’t be true,\nThat man descended from our noble race—\nWhy, the very idea; it’s a disgrace!\n“No monkey ever deserted his wife,\nStarved her babies and ruined her life.\nNor did ever a mother-monkey\nLeave her babies with others to bunk,\nOr pass them on from one to another\n‘Till they scarcely knew who was their mother.\n“And another thing you’ll never see\nA monkey building a nest around a coconut tree,\nAnd let the coconuts go to waste,\nForbidding all other monkeys to have a taste.\nWhy, if I build a fence around a coconut tree,\nStarvation would cause me to distribute to you.\n“Here’s another thing that a monkey won’t do:\nGo out at night and get on a stew;\nOr use a gun, a club, or a knife\nTo take another monkey’s life.\nYes, Man descended, the ornery cuss!\nBut Brother, he didn’t descend from us.”...and all the people said \"Amen\"",
        "good": "4",
        "bad": "2",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "tp322",
        "time": "16 July, 2021",
        "context": "That 1.5% is the stupid democrats and their socialism ..",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "theconchrepublic",
        "time": "17 July, 2021",
        "context": "all this pseudo fake science is to appease the less cerebrally gifted, and the dregs of society..",
        "good": "2",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "lagerfeld1",
        "time": "17 July, 2021",
        "context": "When I saw the skull photo, I thought that Lebron James had stuck his head in an airport security X-ray machine.",
        "good": "8",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "tenbags",
        "time": "17 July, 2021",
        "context": "i thought the article was about maxine waters when i saw the skull photo",
        "good": "6",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "yancy1929",
        "time": "16 July, 2021",
        "context": "Wait till they find bones on Mars and find a connection. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "MyMIstake4Coffins",
        "time": "17 July, 2021",
        "context": "same people that believe life comes from non-life...not much trust in what they say",
        "good": "1",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "taggert",
        "time": "17 July, 2021",
        "context": "4٪ for democrats",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Ufilthyliberal",
        "time": "17 July, 2021",
        "context": "If you remove the inner city animals, does that number jump way up?",
        "good": "8",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "shackles-and-chains",
        "time": "17 July, 2021",
        "context": "Why did they use a head shot of Biden for this story?",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "burger-king",
        "time": "16 July, 2021",
        "context": "That skull resembles Nancy Pelosi without makeup",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cravenmoorhead164",
        "time": "17 July, 2021",
        "context": "We’re all descended from CHARNIA during the CAMBRIAN EXPLOSION, look it up",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "aag",
        "time": "17 July, 2021",
        "context": "More and more,  Darwin's Out Of Africa Theory is getting debunked. \n\nResearchers are finding out that the reverse happened. Primitive ancestors did not branch out and evolve. But that more modern humans like the Neanderthals and Denisovans intermingled with some earlier species.\n\nThey discovered that not all modern Europeans,  and Asians shared Sub-Saharan DNA ...but some Africans (ie, Egyptians, East Africans) have modern Neanderthal and Denisovan DNA.\n\nIt was Reverse Darwinian  - Europeans and Asians migrated to (North and East Africa), not the other way around  - thanks to DNA technology.",
        "good": "3",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "valannín",
        "time": "17 July, 2021",
        "context": "Why does Fox even have a science section?\n\nNearly half the comments are from people making bad political jokes, and nearly the other half from religious fanatics who think the devil is trying to trick us with fossils.",
        "good": "7",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "ilovebede",
        "time": "17 July, 2021",
        "context": "Very few people meet that 7% that separates us from the ancients. Most probably would have a problem coming up with 1 or 2%.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "foxisgreatforus786",
        "time": "17 July, 2021",
        "context": "Libpukes are all about science until you tell them science has proven there is no gay gene, just bad choices.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "falconhunter",
        "time": "17 July, 2021",
        "context": "So,, does that mean the Maxipad Waters is SubHuman !! We are all in agreement,, Right ???",
        "good": "8",
        "bad": "7",
        "replies": []
    },
    {
        "user_name": "Isandlwana",
        "time": "16 July, 2021",
        "context": "The original planet of the apes came out before I was born but its still better than that walberg remake.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "benelefant",
        "time": "17 July, 2021",
        "context": "We share 2/3 of our dimensions with Charlie Brown. Think about that.  ",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "revolution20",
        "time": "17 July, 2021",
        "context": "Scientists take another step toward figuring out what makes humans unique\n\nAnswer:  Humans have souls.",
        "good": "8",
        "bad": "6",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "capnpele",
        "time": "17 July, 2021",
        "context": "Wait a minute,,,I'm 7% gnome??? Oh, misread genome. Dang it.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "Thelittleguynobodyknows",
        "time": "17 July, 2021",
        "context": "Looks like the Sharpton blood line to me.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "foxisgreatforus786",
        "time": "17 July, 2021",
        "context": "Just by luck and slavery, Obama was kept off the plains of Africa with a chicken bone in his nose. That the environmental impact.",
        "good": "3",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "the.morning.after",
        "time": "17 July, 2021",
        "context": "SO, did the all the samples come from white folks, black flocks, asian folks, native americans?\nYou only say 279 people from around the world, that's vague",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "LauraPalmer086",
        "time": "17 July, 2021",
        "context": "Sipping on a Mai Tai tonight while grilling a nice filet of wild caught King salmon to be served with a fresh vegetable medley and an Asian inspired cole slaw. Wine is a crisply chilled California Chardonnay. Served outside on our patio by the pool. Life is good. 🇺🇸",
        "good": "3",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "lieberalshateamerica",
        "time": "17 July, 2021",
        "context": "\"This kind of finding is why scientists are turning away from thinking that we humans are so vastly different from Neanderthals.\"\n\nWe aren't all that different from Neanderthals. Just ask Biden. Then look at him. You know why alien civilizations have never landed on Earth and introduced themselves to us? It's because they've been here and they know that no intelligent life exists on this planet.",
        "good": "9",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "Mr.Jotato.Head",
        "time": "17 July, 2021",
        "context": "What about the DNA of non-modern humans, like Afghans that still live in the 7th century?",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "conquistador642",
        "time": "17 July, 2021",
        "context": "Except democrats, they are much closer to apes than humans.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "truthhound",
        "time": "17 July, 2021",
        "context": "We are not much different now than when God created us, just run down a little.",
        "good": "3",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "waltherppk",
        "time": "17 July, 2021",
        "context": "Neanderthals with loads of monkey dna are running the US government ",
        "good": "5",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "conebred",
        "time": "17 July, 2021",
        "context": "Even less for liberals.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "theconchrepublic",
        "time": "17 July, 2021",
        "context": "this \"scientific  Story \" was about nothing , as usual... no relations , no dna, just California dreaming.. or acid..",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Reverend306",
        "time": "17 July, 2021",
        "context": "At least they didn't find any simian dna....so we didn't come from apes",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Misfit",
        "time": "17 July, 2021",
        "context": "I guess that leaves the 13% out!",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "libertariansfolife",
        "time": "17 July, 2021",
        "context": "This test needs to be done on the 13%.",
        "good": "8",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "goa✟lips",
        "time": "17 July, 2021",
        "context": "Just in case it isn't clear from the article, all humans are animals.\n\nKingdom: Animalia\nPhylum: Chordata\nClass: Mammalia\nOrder: Primates\nSuborder: Haplorhini\nInfraorder: Simiiformes\nFamily: Hominidae\nSubfamily: Homininae\nTribe: Hominini",
        "good": "7",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Mr.Jotato.Head",
        "time": "17 July, 2021",
        "context": "Genetics is interesting.\n\nWhat genes changed that turned wolves into dogs that could live with humans?  Not many.\n\nWhat genes were different in Einstein and the kid who can't understand 7th grade math?  Not many.",
        "good": "13",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jnreese",
        "time": "17 July, 2021",
        "context": "Humans and chimps share a surprising 98.8 percent of their DNA.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "goa✟lips",
        "time": "17 July, 2021",
        "context": "Well I'll be a monkey's uncle.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Johnnysmashum",
        "time": "17 July, 2021",
        "context": "Wow foxnews is finally admitting that their base comes from cave dweller neanderthal DNA! No wonder they can't believe the 2020 election results!",
        "good": "2",
        "bad": "7",
        "replies": []
    },
    {
        "user_name": "jmwestward",
        "time": "17 July, 2021",
        "context": "7% is quite a lot. It takes very little change of a species genome to make a new species.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "commonsense45",
        "time": "17 July, 2021",
        "context": "totally misleading article...these percentages relate to the protein coding part of DNA which is less than 2% of our genome...proteins are only building blocks...it's the purposeful arrangement of parts and entailed regulatory and control systems that primarily differentiate species...non-coding DNA plus epigenetic information like the sugar code and interactome are massively varied across species....",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "error": "error"
    },
    {
        "user_name": "todosantosbay",
        "time": "17 July, 2021",
        "context": "There's only one Race.",
        "good": "3",
        "bad": "2",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "Schweinhund",
        "time": "17 July, 2021",
        "context": "How do you get DNA from a fossil?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Scatter081",
        "time": "17 July, 2021",
        "context": "I did my DNA testing out of curiosity.  My parents said there was a lot of America Indian in our family.  Supposedly, my great grandmothers were full blooded Indian.  Well, blew that family lie right out of the water, not a drop of American Indian.  I almost felt badly for Warren  who thought as I did based on my grandparents stories that she was part Indian.   I was English and Irish which wasn't a surprise.  The big surprise was that I had 365 Neandertal markers which was 65 percent more than the general population that had been tested at that time.  So this cave woman comes by her survival issues naturally, genetically speaking.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "amgc43",
        "time": "17 July, 2021",
        "context": "Todays conservatives have about 90% Neanderthal DNA.",
        "good": "0",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "goa✟lips",
        "time": "17 July, 2021",
        "context": "Calvin: Isn’t it strange that evolution would give us a sense of humour? When you think about it, it’s weird that we have a physiological response to absurdity. We laugh at nonsense. We like it. We think it’s funny. Don’t you think it’s odd that we appreciate absurdity? Why would we develop that way? How does it benefit us?\n\nHobbes: I suppose if we couldn’t laugh at things that don’t make sense, we couldn’t react to a lot of life.\n\nCalvin: (after a long pause) I can’t tell if that’s funny or really scary.",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Johnnysmashum",
        "time": "17 July, 2021",
        "context": "Neanderthals were not human beings! They were a sub species of humanoid creatures! The European is an offshoot of that inferior species that mated with original people DNA out of Africa.",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "goa✟lips",
        "time": "17 July, 2021",
        "context": "“I love all science… Except science that doesn’t agree with my Bible.”  --Ned Flanders",
        "good": "10",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "MAGA_2024465",
        "time": "17 July, 2021",
        "context": "We still have Neanderthals.....just look at the Democrats",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "rfloyd399",
        "time": "17 July, 2021",
        "context": "My 23andMe DNA test showed I have just under 2% Neanderthal DNA. My wife said she expected it to be higher. I wasn't quite sure how to take that.",
        "good": "23",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "error": "error"
    },
    {
        "user_name": "yepbookertdied",
        "time": "17 July, 2021",
        "context": "Good to know. Not even giving up my DNA for a Covid test without a written and signed chain of custody for each person in possession and only for life and death situations. My wife understands this and it is in writing inside my wallet",
        "good": "2",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "foxisgreatforus786",
        "time": "17 July, 2021",
        "context": "Is it a coincidence that the countries that have put man in space are all Caucasian?",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "a1anda2",
        "time": "17 July, 2021",
        "context": "I like the updated photo of Pelosi, too bad it can still talk.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "ardee2x",
        "time": "17 July, 2021",
        "context": "\"Science\" like every other discipline, has no desire to make you feel \"uncomfortable\". There is a LOT they are not telling you. In this case, we, \"Modern Humans\" are not related to any other human species on Earth to a significant degree that we can justify evolution. But, why would they tell you that? They play with percentages, small numbers, but a percentage of a number so gigantic that if they were to say it, you would not be able to comprehend. Sometimes people are \"smarter\" than you because they hide certain facts from you, you're not ready to understand.",
        "good": "2",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "goa✟lips",
        "time": "17 July, 2021",
        "context": "Breaking News: Scientists say that Earth is endangered by a new strain of fact-resistant humans.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "GodblesstheUSA🇺🇸",
        "time": "17 July, 2021",
        "context": "7% is a huge  difference the Abyssinian house cat shares 90 percent of its DNA with humans. Mice and humans share about 85 percent of their DNA, which is the reason why mice are  useful for medical research",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "smuckhunter",
        "time": "17 July, 2021",
        "context": "Certainly that brings many questions. As a surgeon  who treated me stated, we are all alike inside. Shows in general how alike we all are.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "rexdragon",
        "time": "17 July, 2021",
        "context": "So Biden is 7% modern human? And the other 93% I suspect is quartz.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "georgemu",
        "time": "17 July, 2021",
        "context": "7% of DNA, and 1.5% of unique DNA is huge.  The human form is highly malleable and it doesn't take much difference in DNA to be reflected in the human body.  There are numerous gene changes that made huge differences,  About 30,000 years ago(by memory) a gene change dropped the larynx down to about halfway between the jaw and collarbones.  This allowed a MUCH wider range of noises humans could make, and a much wider frequency range.  This allowed the development of powerful languages, instead of mostly grunts.  Around 15,000-8000 years ago there was a mutation in the brain that allowed people sense pitch and other characteristics, and also much better sense of rhythm.  The change allowed the development of singing and dancing and greatly increased the amount of information that could be spoken.",
        "good": "26",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "Isandlwana",
        "time": "17 July, 2021",
        "context": "I'm still a dude.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "freedom'spatriot",
        "time": "17 July, 2021",
        "context": "Ancient Alien DNA",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "emma406",
        "time": "17 July, 2021",
        "context": "Antifa, BLM:  vandalism- looting- fighting From what I witnessed they share 0.  They be closer to the ape on the chart.  ",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "arkansastraveler",
        "time": "17 July, 2021",
        "context": "I wonder what part of the gnome being examined shows moral decay, moronic thinking, inability to distinguish right from wrong and cold, calculating self-interest?  In other words, what gene makes a poltician?",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "OBidenPonySoldier",
        "time": "17 July, 2021",
        "context": "Stacey Abrams 100% non-human, 100% un-human, 100% inhuman, 10000000000000% worthless ",
        "good": "4",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "Razorc195",
        "time": "17 July, 2021",
        "context": "Umm… yeah, but that’s the 7% that makes the difference between Homo-sapiens(humans) and Sapiens(apes) people keep looking for the missing link. It’s missing because their isn’t a link! God created Humans separately, get it! You can’t science away your responsibilities or accountability! ",
        "good": "4",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "goa✟lips",
        "time": "17 July, 2021",
        "context": "Monkey man\nD.N.A. and evolution\nSlide on down\nSay goodbye civilization\n\nMonkey man\nLet's get back to where we started\nSlide on down\nEvolution's goin' backwards\n\n--David Byrne, \"Monkey Man\"",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "goa✟lips",
        "time": "17 July, 2021",
        "context": "Humans have this odd and conceited idea that we are at the top of the pyramid of life, that their DNA is somehow better than animal or plant DNA. Surprise! Humans aren't at the top of any evolutionary pyramid. \n\nThere is no pyramid.",
        "good": "3",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "DefenderfromtheWolves",
        "time": "17 July, 2021",
        "context": "Everyone who watches \"Cops\" or \"Live PD\" already knew this.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "lexi",
        "time": "17 July, 2021",
        "context": "If you want to go back to Neanderthal times, give more money to African-American men. That way they’ll reproduce with white women (women love money). Pick some hairy ones and it will speed up the process.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "chagrin",
        "time": "17 July, 2021",
        "context": "Apparently, that’s all it takes. What’s your point?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "goa✟lips",
        "time": "17 July, 2021",
        "context": "Ivanka to Melania: \"These human skins are so itchy.\"",
        "good": "0",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "MatchGame75",
        "time": "17 July, 2021",
        "context": "Democrats DNA similar to Neanderthal ",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "snaplock",
        "time": "17 July, 2021",
        "context": "Guess the other 93%, is in Chicago.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "JoesephStivick",
        "time": "17 July, 2021",
        "context": "So Joe is right! We do think like Neanderthal’s .",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "RINOKILLER525",
        "time": "17 July, 2021",
        "context": "You mean humans are related to each other?  Whodathunkit.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Hunter'sArtDealer",
        "time": "17 July, 2021",
        "context": "Gov Abbot has 99% Neanderthal according to the Biden Administration. I guess being for freedom and prosperity and against lockdowns changes your DNA?",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "IllegitimateJoe891",
        "time": "17 July, 2021",
        "context": "100% of my DNA is unique to me.",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "todosantosbay",
        "time": "17 July, 2021",
        "context": "It's cooler that when you make memories both strands of DNA helix in your brain are deconstructed and modified and stitched back together with a new memory.  Wait till the cancel culture cultists figure out how to analyze that data to hold against you.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Isandlwana",
        "time": "17 July, 2021",
        "context": "Look up the history of Rising Star Cave in South Africa. Its interesting, at least to me. Pretty good Natgeo coverage about it as well.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Joseph_R_Quisling",
        "time": "17 July, 2021",
        "context": "Evolution is a fraud",
        "good": "3",
        "bad": "3",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "MatchGame75",
        "time": "17 July, 2021",
        "context": "7% is actually a LOT in genetics 🧬 ",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "lerenard",
        "time": "17 July, 2021",
        "context": "Scientists also discovered that 7.1% of Joe Biden's DNA is different from a worm's.",
        "good": "6",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "BigBear71",
        "time": "17 July, 2021",
        "context": "Another effort to prove we evolved from monkeys. If so, where are all the “in between” skeletons? So far they’ve found 1 they thing “might” be an in between.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "rhvm",
        "time": "17 July, 2021",
        "context": "How much DNA do we share with a plum?  7% is huge, not small.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "guysmiley154",
        "time": "17 July, 2021",
        "context": "More evidence that we aren't as smart as we think we are.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "iceman357",
        "time": "17 July, 2021",
        "context": "I have a little problem excepting those who believe in evolution us are descended from apes, the rest of us however were created by God.",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "Ray086",
        "time": "17 July, 2021",
        "context": "Neanderthals did survive, they are known today as magats",
        "good": "1",
        "bad": "11",
        "replies": []
    },
    {
        "user_name": "mark1963",
        "time": "17 July, 2021",
        "context": "Could we actually come from space then and only 7% of the DNA was found?  Sounds eery similar from the tv show Battlestar galactica and that would be scary if we were.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "GreenRocket",
        "time": "17 July, 2021",
        "context": "Science can try but the answer lies in the biblical account.  God created man in his own image and breathed life into him and set him above all other creatures.  Similarities indicate the same architect/designer but God's Word makes it clear that God made man unique.",
        "good": "13",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "alphabeing888",
        "time": "17 July, 2021",
        "context": "Well that explains the trashy Animals that drive cars and ruin the planet.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "sandiegoecho",
        "time": "17 July, 2021",
        "context": "That high, surprised.  Still hope thousands of years from now if the apes do not destroy each other.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Alotta.Anger",
        "time": "17 July, 2021",
        "context": "'\nA long time ago GOD made man/woman and all the other creature with the ability to evolve.  Sadly the cannot grasp that.  He forgot to make the trans people.\n\n.",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "cegg",
        "time": "17 July, 2021",
        "context": "For leftists it is less then 2%.",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "waddy56",
        "time": "17 July, 2021",
        "context": "So aliens did drop us off on the way to Al Gore's planet......",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rwrman",
        "time": "17 July, 2021",
        "context": "Why did God make people so stupid.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "HPLwasright",
        "time": "17 July, 2021",
        "context": "And 3.5% of it shows up at Subway.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "7thcav758",
        "time": "17 July, 2021",
        "context": "Did monkey DNA show up in any race of humans? ",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bort22",
        "time": "17 July, 2021",
        "context": "Pfft.  Who needs all this \"science\" and \"learnin'\"?  Looking at the world and examining the evidence?   Ha!  \n\nA bunch of sheep herders figured it all out 2000 years ago.  How could they be wrong - they wrote it down?!",
        "good": "3",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "dollysboy197",
        "time": "17 July, 2021",
        "context": "Soon they will be able to explain why some races have not advanced and are such slow learners...",
        "good": "8",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "flapjackle",
        "time": "17 July, 2021",
        "context": "Fossil DNA ? Crazy Nancy ?",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Scubaszeke",
        "time": "17 July, 2021",
        "context": "That explains why so many people in the United States are primitive enough to believe Biden actually won the election!",
        "good": "14",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "elrod173",
        "time": "17 July, 2021",
        "context": "Wow, that’s interesting. Maybe when Jesus returns, some of us will get to ask why so many people were stupid enough to believe that we were monkey hanging off trees thousands of years ago. \n\nOh wait, the answer is simple. If the believe we were created by God, then they will need to face that we are all guilty of sin. ",
        "good": "5",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "slewis727684",
        "time": "17 July, 2021",
        "context": "What idiots...!  I don't care what the DNA or genes say, People are People, and haven't changed since walking out of the caves... yes, there might be several different species of humans but inside, they are all the same... technology has changed, not people... if so, tell me how... study history, history repeats because People are People, always...",
        "good": "1",
        "bad": "7",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "uspatriot2020",
        "time": "17 July, 2021",
        "context": "Modern humans can have Neanderthal DNA by 2 possible routes: 1. Modern humans and Neanderthals share a common ancestry, but the entire genome of this ancestry did not make it into modern humans; or 2. Modern humans and Neanderthals are the same species.\n\nBut, Neanderthal DNA is only found in Europeans, Asians and some Pacific Islanders.  Neanderthal DNA isn't found in Africans.  This means either that Africans and the rest of humanity don't have the same ancestry, and thus have a different and unequal evolutionary history, and thus cannot be expected to achieve equality in the modern world, or the Darwinian \"out-of-Africa\" theory of human origins is amiss.",
        "good": "8",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "mtrelles",
        "time": "17 July, 2021",
        "context": "Science now states there is a 99.9 chance of intelligent life somewhere in the universe.  The .1 percent chance against is because no evidence of intelligent life has not yet been established.\n\nBut that's not the scary part.   Since the chances are overwhelming intelligent life does exists, the worry is when they get here, if they consider our existence intelligence.",
        "good": "27",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "goa✟lips",
        "time": "17 July, 2021",
        "context": "You have to admit that the data on transitional human fossils is much better than for transitional unicorn fossils.",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "GreenPuzzle",
        "time": "17 July, 2021",
        "context": "What is still missing is a brain... the study and understanding of irreducible cells tell us all we need to know.  There is no such thing as evolution; we are created in God's image.",
        "good": "3",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "FrankLee440",
        "time": "17 July, 2021",
        "context": "I wonder if they could use a vaccine for eugenics? You could vaccinate the entire population with something that will kill certain groups within years, and they'd have no idea until it's too late \n\nFood for thought.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "GreenPuzzle",
        "time": "17 July, 2021",
        "context": "If evolution is true, that would mean some people are more evolved than others... hmmm.",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "donaldthegreat505",
        "time": "17 July, 2021",
        "context": "It just goes to show, we are all just a bunch of Neanderthals.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "pi$$edofftms",
        "time": "17 July, 2021",
        "context": "Some made it out of Africa and some didn’t.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "kaceyhemway",
        "time": "17 July, 2021",
        "context": "50,0000 years of ancestoral genetics and not single one identified as transgender non-binary. Weeeeeird.",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Shipless",
        "time": "17 July, 2021",
        "context": "This may explain why some modern humans have reached the moon while others still live in the 14th century...",
        "good": "8",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "mtrelles",
        "time": "17 July, 2021",
        "context": "If only 7 percent of our DNA is unique to modern humans, I would have to ask the obvious question.  What is the other 93 percent unique to?",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "pi$$edofftms",
        "time": "17 July, 2021",
        "context": "7%? Well, in some it’s probably more like 4%. ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "pi$$edofftms",
        "time": "17 July, 2021",
        "context": "Check the bone structure over the eyes. My wife is a dentist and she will tell you there is a different jaw bone and tooth root structure between races.",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "DavidLee81",
        "time": "17 July, 2021",
        "context": "Everybody should know something very important.  Evolution is not true. See it happening anywhere? The better explanation is that God created us recently with enough diversity to become what you see today.  You cannot take away that Christ was here and established who He is.  We are so wrong!",
        "good": "3",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "pi$$edofftms",
        "time": "17 July, 2021",
        "context": "Some made it to Irish Shepherds Pie, and some kept eating Midge flies.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "pi$$edofftms",
        "time": "17 July, 2021",
        "context": "You can ignore the differences all you want. But the genetic differences between humans is real and apparent from continent to continent. A mere indication that genetic material of a similar composition or combination does exist. Sure. One “human “ race, but not all the same. These differences didn’t occur overnight.",
        "good": "13",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "mtrelles",
        "time": "17 July, 2021",
        "context": "Another chapter for the CRT handbook.\n\nSince Europeans carry most of the Neanderthal genes, and Neanderthals were here first, obviously we not only stole all their land, but ran them off and obliterated them..",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "toosoon?",
        "time": "17 July, 2021",
        "context": "And the coloreds….0.0%.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Olorininmyyouth",
        "time": "17 July, 2021",
        "context": "What makes humans unique???  Other species in the animal kingdom don’t kill each other for no good reason. That’s what!!!",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "antonyandre.artist",
        "time": "17 July, 2021",
        "context": "today's statistics are bogus..why...because liberal professors are doing ineffective research. reporting inaccurate data.\nacademia today has an agenda to not have people know the truth.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "wegaveitallaway",
        "time": "17 July, 2021",
        "context": "As interesting as this is, do you know that it’s never been scientifically proven that one species ever evolved into another species? Ever. \nI challenge anyone to find the scientific evidence that this has happened.",
        "good": "7",
        "bad": "5",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "jmcnatt",
        "time": "17 July, 2021",
        "context": "The 7% is alien genes!",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "pblooney46",
        "time": "17 July, 2021",
        "context": "Members of the Squad, BLM and ANTIFA have less than 1%!",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "goa✟lips",
        "time": "17 July, 2021",
        "context": "ATTENTION \nAliens are coming to abduct all the sane and well-adjusted people. Fox News readers are not expected to be at risk at this time. Carry on.",
        "good": "0",
        "bad": "10",
        "replies": []
    },
    {
        "user_name": "Texascherokee",
        "time": "17 July, 2021",
        "context": "Can this info  be used on a College Entrance Application?",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "russagrusa825",
        "time": "17 July, 2021",
        "context": "they also found that there is no significant difference between the dna of liberals and rocks. ",
        "good": "20",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "seewaves",
        "time": "17 July, 2021",
        "context": "Trump's orange skin and hair scientifically prove through empirical observation and DNA analysis that he is 93% oran gutan.",
        "good": "3",
        "bad": "16",
        "replies": []
    },
    {
        "user_name": "semperfidelis1776",
        "time": "17 July, 2021",
        "context": "I'd be interested to see how 13% and 55% are correlated.",
        "good": "4",
        "bad": "3",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "josephdirt",
        "time": "17 July, 2021",
        "context": "We share 60% of our DNA with jellyfish, so it isn't surprising at all that 7% of our DNA is unique to us when compared to earlier humans. For crying out loud we share 98% of our DNA with chimpanzees so what it really is saying is that the genetic line between earlier humans and us did not travel through chimps. Those other \"humans\" branched off of some other link well before chimps came along. \n\nThey keep this line of research going and they are going to earn the title \"racist\".",
        "good": "9",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "LordBaltimore",
        "time": "17 July, 2021",
        "context": "I thought we shared more dna with a banana than that.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "alexxx888",
        "time": "17 July, 2021",
        "context": "Who says Neanderthals are extinct? Most of them work in DC.",
        "good": "13",
        "bad": "3",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "BlueTurtle",
        "time": "17 July, 2021",
        "context": "They say humans have between 3 to 7 % Neanderthal and Denisovan DNA, but I \nsecretly suspect that the percentage is probably much higher for people in Congress?",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "OldFart004",
        "time": "17 July, 2021",
        "context": "earth a big zoo with species from everywhere that have been collected ever since 2 legged critters walked on earth.\n\nWho knows it might be true? For sure there is not a living soul that could prove it's not true, and it makes as much sense as a lot of 1/2 baked ideas that float around",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "Demass",
        "time": "17 July, 2021",
        "context": "Then there are some that remain close to the ape linage ",
        "good": "12",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "canadstillknowbest",
        "time": "17 July, 2021",
        "context": "This post is for the racists. It has been proven over and over again that life started in Africa. How does it feel to know we are all derivatives of Africans?",
        "good": "4",
        "bad": "7",
        "replies": []
    },
    {
        "user_name": "stevefielden",
        "time": "17 July, 2021",
        "context": "I’m from another planet. ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "roadapples",
        "time": "17 July, 2021",
        "context": "Meanwhile, Joe claimed to invent fire and Kamalto claimed to invent the mattress....",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "alexxx888",
        "time": "17 July, 2021",
        "context": "What makes us unique is that we're made in the image of God.",
        "good": "9",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "goa✟lips",
        "time": "17 July, 2021",
        "context": "So Trump's family from Northern Europe has neanderthal DNA, but Idi Amin doesn't?",
        "good": "1",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "blaquecon",
        "time": "17 July, 2021",
        "context": "DNA has to be racist.",
        "good": "6",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "thelonestar34",
        "time": "17 July, 2021",
        "context": "That's because everyone is botching it up by taking this useless rona vaccine.",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "PurpleBoomerang",
        "time": "17 July, 2021",
        "context": "We have just 1.5% in common with all other humans.  That explains a lot about the 13%.",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "Jazzman953",
        "time": "17 July, 2021",
        "context": "It would take way, way more than 50,000 years for 7% of unique DNA to evolve. We’re probably talking into the millions of years (see Dr. Stephen Meyers’ work in Signature in the Cell). Proves to me that Homo Sapiens (Modern Man) did not evolve from the apes but rather that we were truly made by God in His image.",
        "good": "9",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "room1o1",
        "time": "17 July, 2021",
        "context": "Two common theories:  Either everything was created by a supernatural deity in six days or by the fortuitous amalgamation of atoms over billions of years.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Tiberius-1",
        "time": "17 July, 2021",
        "context": "And I would venture to say that infamous '13%' of us have even less than 7%.",
        "good": "9",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "NormanBlanton",
        "time": "17 July, 2021",
        "context": "compare the nucleus of large atoms a 7% change in the number of Neutrons makes a big difference.\nthe difference between beer and near beer is around 7%\n\nI bet a torbo-charger makes up less than 7% of an engine.\n\nDecrease the oxygen content in the air from 20% to 13%.\n\nof course it is not the amount but what make up the difference.\n\n7% increase in body mass if fat - bad, if muscle - good?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Salesman111",
        "time": "17 July, 2021",
        "context": "So what??? That’s a stupid stat. We only need 1% to make us unique…just the way that God made us!",
        "good": "8",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "skeff",
        "time": "17 July, 2021",
        "context": "\"The findings underscore \"that we’re actually a very young species,\" said Akey. \"Not that long ago, we shared the planet with other human lineages.\" We already knew that. At one time there was a whole menagerie of proto-humans running around together.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "wastrel",
        "time": "17 July, 2021",
        "context": "\"That's [7%] a pretty small percentage,\" said Nathan Schaefer...\n\nIt's not a small percentage.  I don't know what they are measuring. According to established science, humans share 98% of their DNA with chimpanzees, 90% with mice, 84% with dogs and 65% with chickens. If modern humans have a 7% difference in their DNA compared to Neanderthals or Denisovans, or other primitive humans like Homo habilis, that's huge.\n\nIf they are measuring the genetic difference in genes that are characteristically human (genus Homo), then maybe it makes sense.\n\nI think we have some bad reporting here.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "jonttodd",
        "time": "18 July, 2021",
        "context": "I don't understand how we can share 98% of our DNA with Chimpanzees and at the same time 7% of our DNA is distinct from other hominid species.  Seems an irreconcilable contradiction to me. Perhaps the author can reconcile it for me.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "travis141",
        "time": "17 July, 2021",
        "context": "Curious about the %13 and where that comes from. ",
        "good": "2",
        "bad": "7",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "rdywlf",
        "time": "17 July, 2021",
        "context": "It's an AP story, so take with a ton of salt.",
        "good": "6",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "Clarkadoodledoo",
        "time": "19 July, 2021",
        "context": "Who cares?",
        "good": "1",
        "bad": "8",
        "replies": []
    },
    {
        "user_name": "tomsummer",
        "time": "17 July, 2021",
        "context": "I worked with a Neanderthal in 1987, we didn't need dna to prove it",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "darthpublius",
        "time": "17 July, 2021",
        "context": "- in the  Fox News  viewership the percentage of Neanderthal DNA is much greater than elsewhere.",
        "good": "0",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "Usacitizen199",
        "time": "17 July, 2021",
        "context": "Trump seems to have some Neanderthal dna but he sure knows how to run a country!  And he has a real talent for driving the loony libs nuts, nuts, nuts!  We need his policies to return biggly!",
        "good": "4",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "rubiks6",
        "time": "17 July, 2021",
        "context": "If researchers have acquired DNA from specimens that are 40,000 or 50,000 years old, then they have lied about the ages of the specimens. DNA deteriorates over time. There should be no useful DNA left after 40,000 years. \n\nDenisovans and Neanderthals are just other ethnicities of humans. As a species, we come in many shapes and sizes. \n\nThus the lies are perpetuated. Lies about ages. Lies about ancestry.",
        "good": "0",
        "bad": "10",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "glottis",
        "time": "17 July, 2021",
        "context": "Well it is logical if you think about it from the standpoint of classification. Larger categories divide into increasingly smaller ones. DNA is what kingdom, phylum, and so on are based on.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rhvm",
        "time": "17 July, 2021",
        "context": "We also share 61% with bananas so what?",
        "good": "2",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "Usacitizen199",
        "time": "17 July, 2021",
        "context": "Science is a search for the truth! Does it ever get to actual truth? We can never know because as we learn more information, our definition of truth changes!",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Hondoxp589",
        "time": "17 July, 2021",
        "context": "250,000 years ago the survivors of the original 12 colonies settled on Earth an cross bred with the native hominids. So very sad to see the same events begin to unfold again that caused our ancestors to flee unto the stars.\nIt has all happened before, and it will all happen again.",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "jonathanpi",
        "time": "19 July, 2021",
        "context": "\"other human lineages...\"\n\nThey were all humans, just like all dogs are still dogs and can interbreed.  We just had an event that narrowed down our genetic line.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "billtobin914",
        "time": "20 July, 2021",
        "context": "Damn, Biden was right, we are a bunch of Neanderthals. :(",
        "good": "0",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "castiel691",
        "time": "20 July, 2021",
        "context": "7% is nothing to scoff at... \nwe have around a 1% difference from apes...\n7% is a big deal... \nI would say that a good portion of DNA is common just because we are Earthlings...\nthe Separation of species aside, 7% can be a bigger deal than is thought by this study...\nwe need to look at the whole picture... not just the differences between Neanderthal and Modern Human... remember that mainstream science believes in evolution... \nputting that into the equation bridges the divide between Neanderthal and Modern Human...\nfor each step of evolution has to account for the discrepancies they are seeing... \njust saying... it sounds very narrow minded...",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "dan5047628",
        "time": "19 July, 2021",
        "context": "The biggest problem with science is that a lot of people no longer trust scientist.",
        "good": "2",
        "bad": "8",
        "replies": []
    },
    {
        "user_name": "navyretiredchief923",
        "time": "17 July, 2021",
        "context": "Is this CRT for White folks ?",
        "good": "3",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "markmiewords",
        "time": "29 October, 2021",
        "context": "Fake news, since the earth is only 6,000 years old.  MAGA 2024!",
        "good": "0",
        "bad": "0",
        "replies": []
    }
]