[
    {
        "user_name": "maj465",
        "time": "7 September, 2022",
        "context": "unfortunately it may take a form of fascism and an equivalent to a political stop and frisk, to overcome this vast network of corruption and evil",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "ArtVBob",
        "time": "7 September, 2022",
        "context": "Those that call people semi-fascist are the fascists. That’s been their calling card. ",
        "good": "15",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "forevertrue",
        "time": "7 September, 2022",
        "context": "That tandem is certainly hurting America. High inflation high gas, high rent and delivered to us by bad democrat policy. You can change it with your vote. Vote republican and help yourself.",
        "good": "43",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "prousa4all",
        "time": "7 September, 2022",
        "context": " I have been saying for a long time that the election was stolen by the Swamp the media and big Tech.\nThe fact is the election was stolen before even one vote was cast",
        "good": "68",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "badoggoodog",
        "time": "7 September, 2022",
        "context": "So in this day of Democrat controlled media what do all the former journalists do for a living?",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "aripod1289",
        "time": "7 September, 2022",
        "context": "When is the last time you saw a liberal truly happy; a Liberal smile?\nYou cannot satisfy them. You cannot give them enough no matter how much they want. It is never enough for them.\nThey are perpetual victims, which is why they cannot be happy.\nThese Liberal “elites” do nothing but bleed the middle class dry. My tax rate is 40% and my healthcare is now $700 per month thanks to Obamacare. Only things still affordable are car insurance ($25 per month from Insurance Panda), cell phone ($22/month from T Mobile), and gym ($15/month from Planet Fitness).. but I’m sure those will go up soon. Thanks Bidenflation - Did I mention it now costs over $100 to fill my tank?\nSocial Media is poison, so you have all the Facebook and Twitter scrollers shouting, \"Notice me! Here I am!\" It's a real psychotic problem going on.\nWhen they aren't happy, they bully, riot, hate, and cancel.",
        "good": "56",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "ocnint",
        "time": "7 September, 2022",
        "context": "Wow!!\nA real journalist!!!\nKeep up the good work.",
        "good": "19",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "LoneStarRanger",
        "time": "7 September, 2022",
        "context": "Reminds me of the Axis of evil from WWII",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rookie97700",
        "time": "7 September, 2022",
        "context": "Big tech companies are monopoly’s and should be broken up into smaller independent companies to keep there influence to a minimum!👏👏👏👏",
        "good": "176",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "CMAG🇺🇸",
        "time": "7 September, 2022",
        "context": "At least half of America is against this Fascist Agenda!  The other half doesn’t realize what’s going on!   Wake Up and start speaking out against this Fascist Agenda before it’s too late!  ",
        "good": "24",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mrtaxpayer945",
        "time": "7 September, 2022",
        "context": "Wake up America vote Republican and break up the monopolies. Only way to save your freedom. ",
        "good": "21",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "finklestien810",
        "time": "7 September, 2022",
        "context": "Hey Glenn.  They are all one big group. Together  they are known as Commies!!!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "josephinekay",
        "time": "7 September, 2022",
        "context": "Great article.  I wish everyone would read it (mainly liberals), but they won't because, as he says, facing the truth is hard.",
        "good": "109",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "kamano55",
        "time": "7 September, 2022",
        "context": "Glen Greenwald is one of the most honest journalists, and smartest people out there.  He is not a conservative, he's an old school liberal who tells it like it is.  We need more of them and less msnbc/cnn people.  I'm not talking about the \"opinion\" personalities because everyone needs them on both sides.  Greenwald's on target with his accusations about the leftwing news people really being just \"opinion\" personalities who refuse to admit it.",
        "good": "9",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "mariokiefer",
        "time": "7 September, 2022",
        "context": "Gov't democrats, corporate media, and Big Tech.  There are three.  And the 4th Horseman is big business. ",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tasher",
        "time": "7 September, 2022",
        "context": "Freedom of speech is being taken away. People can decide if they believe it’s misinformation or not,  for themselves.",
        "good": "149",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "ddt305",
        "time": "7 September, 2022",
        "context": "He tells the truth. I hope he has enough money to hire security.",
        "good": "68",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "doolittle",
        "time": "7 September, 2022",
        "context": "We are lucky to have even a few courageous journalists such as Glenn Greenwald who remain unafraid to stand up and expose the Democrats and their liberal media complex for the ominous danger they present to future well-being of our nation.  The Hunter and Joe Biden scandal hoovers and poisons everything it touches as it festers unresolved and legally uncontested.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "SpeakTruth255",
        "time": "7 September, 2022",
        "context": "Good for him. It takes courage to be a real journalist, not a compromised puppet. ",
        "good": "77",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "lookingforwork",
        "time": "7 September, 2022",
        "context": "Wouldn't that be Democrat Fascism?",
        "good": "10",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "burntkrow",
        "time": "7 September, 2022",
        "context": "This is a man who is a leftist, and he is warning people of the tyranny that may come.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "hooterville27",
        "time": "7 September, 2022",
        "context": "Glenn Greenwald telling the truth as usual",
        "good": "23",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "boboventuri",
        "time": "7 September, 2022",
        "context": "The only way out of this deeply-ingrained liberal fascist tyrannical assault on America is to vote for strong conservatives who will do what they promise you they'll do. America really is at a tipping point, we can either be the land of the free or some twisted version of Hunger Games. When you vote you'd better think long and hard about how you want your children and your children's children to live.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "uncommonsenseone190",
        "time": "7 September, 2022",
        "context": "\"Journalist Glenn Greenwald publishes True Facts of unholy alliance of government Democrats, corporate media and Big Tech\"",
        "good": "8",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "busterdog",
        "time": "7 September, 2022",
        "context": "In my opinion, only voters should be allowed to contribute to political campaigns and only for those that will be on one’s own ballot.  Other entities should not be allowed contribute in any manner. Only then would it be a government by the people, for the people, and of the people, and then politicians would represent their true constituents.",
        "good": "24",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "boxcars19",
        "time": "7 September, 2022",
        "context": "Are you over 21? Do YOU want others deciding for you what you can and can’t read about and know about? \nI want to decide for myself.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "timetovotered",
        "time": "7 September, 2022",
        "context": "Americans now have their eyes WIDE open. Never again ",
        "good": "10",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "imaosudad",
        "time": "7 September, 2022",
        "context": "Everyone can see it except the kool-aid drinking minions.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "GoArmy694",
        "time": "7 September, 2022",
        "context": "What we can do is not support with ratings. Not even ESPN or so many others. ",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dastrawboss",
        "time": "7 September, 2022",
        "context": "i dont know if he is a leftist or not, but i do believe i have finally heard truth from a journalist. thank you Mr. Greenwald i wish you much success in your endeavors.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "piperelliott",
        "time": "7 September, 2022",
        "context": "Superbly argued, superbly written. ",
        "good": "88",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "zev529",
        "time": "7 September, 2022",
        "context": "Journalists planted and paid off by Democratic operativez, seduced by subversive ideologies, threats, and easy money have become more cynical and corrupt, and perhaps, as dangerous as a career political hack. MAGAs now characterized as semi-fascists. Soros and his seditious ilk should know you can fool some of the people, even 81 million, some of the time...",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "MostCriticalThinking",
        "time": "7 September, 2022",
        "context": "Where is that old goat Noam Chomsky?  He's always saying that there is this cabal but only when a Republican is in the WH.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "wisconsinconservative751",
        "time": "7 September, 2022",
        "context": "The more we call them out, the closer we get to actual truth.  We need more Glen Greenwald's speaking out.\n Censorship is out of control.\nLet us decide how we fell about an issue, just provide actual facts. \nI am tired of social media censoring facts and negative comments on Democrat candidates. When a comment is made that just expresses legitimate data, social media should not deny the comment. ",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bluecollarcountry",
        "time": "7 September, 2022",
        "context": "Can't be true that would be tantamount to cheating and we know that couldn't happen. (Sarc)",
        "good": "15",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "concernedcitizen1500",
        "time": "7 September, 2022",
        "context": "Truth right here now...",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "MiddleFalls",
        "time": "7 September, 2022",
        "context": "Partisan politics isn't non profit and it shouldn't be protected as free press.\nTaxes and Lawsuits need to start happening.",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "4god&country",
        "time": "7 September, 2022",
        "context": "\"The media want to maintain their intimate relation to state power. They want to get leaks, they want to get invited to the press conferences. They want to rub shoulders with the Secretary of State, all that kind of business. To do that, you've got to play the game, and playing the game means telling their lies, serving as their disinformation apparatus\". \n~ Noam Chomsky",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "crc5151",
        "time": "7 September, 2022",
        "context": "Been saying this for over two years, the print, broadcast and social media have become de facto government agencies and, therefore, subject to the First Amendment.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "whatmeworry1",
        "time": "7 September, 2022",
        "context": "The googs, zucks and twits are intolerant of the diversity of thought, ideas and beliefs.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "SpeechFree480",
        "time": "7 September, 2022",
        "context": "Democrats don’t need to just be beaten in upcoming elections— they need to be CRUSHED.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "acarl007",
        "time": "7 September, 2022",
        "context": "Liberal Media Machine and liberal social media \nIs the most destructive element in American society ",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Rozadiah",
        "time": "7 September, 2022",
        "context": "Sad state of affairs in America. Patriots take heed. Our liberty is being taken away. Don’t listen to media. Just vote to keep our country ",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "wokeadope",
        "time": "7 September, 2022",
        "context": "Thank you, Glenn, you're one of my favorites.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "BigRedFence302",
        "time": "7 September, 2022",
        "context": "He explained this is the mindset of \"would-be tyrants\" who claim that their \"enemies are so dangerous, their views so threatening, that everything we do – lying, repression, censorship – is noble.\" \nA very true statement. It’s hard to watch the evening news anymore, every alphabet news network is guilty as hell. ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "alex50",
        "time": "7 September, 2022",
        "context": "Telling the truth is a dangerous territory.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "charliedog2",
        "time": "7 September, 2022",
        "context": "Facebook needs to be shutdown  and how do you do that?  People STOP going there.  It's tempting to go take a look to see what your friends are doing but you can do it.  (you have a phone give your friends a call)   ",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "NEVERGIVEUP",
        "time": "7 September, 2022",
        "context": "Isn’t Greenwald the one who was crying on TV about the abortion ruling in the Supreme Court?  Seems like a weird guy to me.",
        "good": "0",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "wokeadope",
        "time": "7 September, 2022",
        "context": "Facebook has been busy scrubbing factual news from accounts for a while.  In 2020, I received two alerts about articles from 2013 being removed because they were axed by factcheckers.  My articles were spot on, but leftists can't have traces of truth left up, it harms their brainwashing technique.",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "gradeightbolt",
        "time": "7 September, 2022",
        "context": "Big financials use your money to control these big corporations, they own them.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "clammypollack",
        "time": "7 September, 2022",
        "context": "Ben Collins is evil as are the rest of those 'journalists'.  Let's get his personal info (address) out there so we can keep a close eye on him and let him know we watch him.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "FreeSpeecher",
        "time": "7 September, 2022",
        "context": "The 2022 version of the old military-industrial complex and 100x more dangerous. ",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mrjoe1955782",
        "time": "7 September, 2022",
        "context": "The truth never lies.  Great article.",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rocketball",
        "time": "7 September, 2022",
        "context": "Honest reporting, caught me off guard.",
        "good": "14",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "NeeCee66768",
        "time": "7 September, 2022",
        "context": "I agree with this article.  Liberals are dangerous to our society.  ",
        "good": "11",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "brainless",
        "time": "7 September, 2022",
        "context": "Don't forget about the government agencies that are included, FBI, IRS CDC as part of the unholy alliance.",
        "good": "12",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "iceload",
        "time": "7 September, 2022",
        "context": "\"is dangerously intensifying\" They are really just coordinating. So one group makes a claim the other backs it up no matter how inflammatory or just plain false like democracy being in danger. And they refuse to expose obvious claims about the dems like the Hunter laptop.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "wokeadope",
        "time": "7 September, 2022",
        "context": "Use Google to look up historical fact?  Better use several approaches and bypass the numerous pages of amplified junk because they don't want you to find what you know you read about from the past.  The leftist cabal does not want you to use older material against them.  \nThey are like Hilly, with............ “you said you were in charge of it [the server]. You were the official in charge. Did you wipe the server?”\n“Like with a cloth or something?” responded Clinton.\"",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jojowasaman2",
        "time": "7 September, 2022",
        "context": "Spot on. ",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "derfleiger",
        "time": "7 September, 2022",
        "context": "We all knew this.  It's the elephant in the room.  Us conservatives are just being nice. Glad someone brought it up. Time to stop being nice.  Obama was right when he mentioned that he regretted moving too fast or far after President Trump was elected. Forgot the actual quote. But, Sarah Palin was right, \"we've got to start fighting like girls\" or the gig is up. ",
        "good": "48",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "whtshpnd",
        "time": "7 September, 2022",
        "context": "Excellent. The truth be told. And YES this is how Biden won…..",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "boilerdave",
        "time": "7 September, 2022",
        "context": "long article to say what anyone with half a brain knows ; big tech, most media are just the propaganda wing of the dnc.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "postmate",
        "time": "7 September, 2022",
        "context": "Organized Crime at its most dangerous!",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "JAZZY",
        "time": "7 September, 2022",
        "context": "Well said, Glenn!",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "usafpatriot6771",
        "time": "7 September, 2022",
        "context": "Nice to see  this  coming to light.  The problem is  that nobody who watches or listens to MSM will ever see this story or hear about it at all.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "independent44318",
        "time": "7 September, 2022",
        "context": "Scream it until the libs meltdown.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Left_Middle_Right",
        "time": "7 September, 2022",
        "context": "I remember having read this article on Jul 23, 2021 ghat Fox News published “More journalists admit and embrace bias, dismissing 'fairness' in new era of media - A growing number of prominent journalists have declared once-bedrock press principles like fairness and objectivity to be outdated and unnecessary since the Donald Trump era rocked American politics…” it still holds true, although now some news organizations are beginning to see a viewership decline and is hurting them so they have begun to look into trying to be “balanced” again. We’ll just have to see if this does happen…",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "uncommmonsense",
        "time": "7 September, 2022",
        "context": "Previous generations were taught to look askance at the military-industrial complex. But we should fear the media-political complex far more. The former just wanted to get rich, but the latter wants power and will do or say anything, or approve any and all political tactics to get it.",
        "good": "90",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "origninalist",
        "time": "7 September, 2022",
        "context": "Excellent article! I don't think most really understand how extensive, fascist, and pervasive the collusion of the liberals, liberal donors, the media, the tech giants, the alphabet agencies/deep state, and the DNC really is. Journalists are no longer the defenders of the 1st amendment. When the media is no longer neutral, our Republic is in mortal danger.",
        "good": "14",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "timbiddle",
        "time": "7 September, 2022",
        "context": "The reason the democrats are passing all these bills  For money is to pay everyone off to do their job to back them up",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "WillyJFreedom",
        "time": "7 September, 2022",
        "context": "Greenwald is right on. We have a war on our hands. ",
        "good": "15",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jimmyd2402",
        "time": "7 September, 2022",
        "context": "Follow Glenn Greenwald on Substack!! You will get the unvarnished truth. BTW he is a life long classic free speech liberal, one of only a handful who does the research, uses real sourcing, and still reports the truth! Ultra MAGA will appreciate him. ",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "StephenS896",
        "time": "7 September, 2022",
        "context": "We need more like Greenwald. He is credible, intelligent and articulate. Keep up the good work Glen!",
        "good": "54",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "leftistsworstnightmare",
        "time": "7 September, 2022",
        "context": "The really good news is that Greenwald is showing the rest of us who to target when the civil war comes.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "trainutz",
        "time": "7 September, 2022",
        "context": "Glenn is the best",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Usafirst",
        "time": "7 September, 2022",
        "context": "Need to reform the section of the law that protects these social media sites, think it is section 230.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "waterwellone",
        "time": "7 September, 2022",
        "context": "Too bad Collins did not provide a 'self description' or CV we all could use as a guide when reading his work as a journalist.   \nIt would help to know exactly how these journalist (all Journalists) self identify.   ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mohawkjohnny",
        "time": "7 September, 2022",
        "context": "He's not wrong, but in a nation where \"free speach\" is the cornerstone of democracy, there's little to be done outside of violent revolution.  Personally, I'd advocate for a divorce.  split the country in two, along idiological lines, and let the best country prosper.  When progressives drive their country completely into the ground, we reconcile--with conditions...",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "stone1776",
        "time": "7 September, 2022",
        "context": "A hero for America to show truth and justice for all. The truth will always prevail. Ask Martin Luther king a hero for truth. Trump always told the truth. There is a evil that is beyond anything that has come before it. Democrat party , big tech and media have created a Frankenstein beyond our dreams.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jimmyd2402",
        "time": "7 September, 2022",
        "context": "Big Tech definitely colluding with big government democrats to subvert the first amendment and  to censor all speech they disagree with. Billionaires are financing the crackdown through their sweet sounding volunteer organizations with the headline of \"protecting democracy\" when in reality its the opposite. ITS REAL TEXTBOOK FASCISM.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Bestofluck097",
        "time": "7 September, 2022",
        "context": "Clown Greenwald should be in jail",
        "good": "0",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "EnderWiggin",
        "time": "7 September, 2022",
        "context": "Didnt Andrew Brietbart say this very thing years ago before he died? Like an almost word for word quote. ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Joe535",
        "time": "7 September, 2022",
        "context": "Greenwald is absolutely correct about elected and appointed Democrats colluding with Big Tech to censor all information that contradicts or refuted their agenda or election. It is election interference of the highest order signaling the United States under Democrats and bystander Republican leadership headed toward dictatorship and socialism, economic, educational, judicial failure.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "indy-melissalistens",
        "time": "7 September, 2022",
        "context": "Glenn is my favorite. Free Assange!",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "becro",
        "time": "7 September, 2022",
        "context": "We surely need more journos like Greenwald!!  Americans are only slowly realizing the monster grip Democratic-socialism has on the US!!  We have NEEDED \"independent\" journalists for a long time now, since the Viet Nam War, actually, and they are needed now, more than ever!!  MSM is NOT our \"friend\"!!",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "lifer1",
        "time": "7 September, 2022",
        "context": "There are many dangers to a partisan media being able to craft a uniform message to the exclusion of any rebuttal or alternative. And those dangers cause the greatest harm to the people they claim to serve.\nA nakedly biased leftist media will embolden leftists in government to \"lean in\" to corrupt behavior with full confidence they won't be held accountable for their actions. We've seen this already, represented by the likes of Lois Lerner, the Mueller probe, the Michael Sussmann \"acquittal\", the upcharges of the 1/6 defendants, the indictments of former Trump officials and lawyers, and now the FBI raid on Mar-a-Lago. Armed with 87,000 freshly minted IRS operatives, we will see this department go full Leventriy Beria without any meaningful check on its power.\nIf you're a Democrat supporter, you might feel a combination of relief and schadenfreude. But don't get all giddy. There's a funny thing about pendulums... Republicans have not weaponized the government against progressives, despite all the breathless fear-mongering whenever a Republican is in the White House. As a conservative, I will take no pleasure if the Republicans begin \"paying back\" Democrats for their decades of vile behavior.\nThe solution would be for the left to dial back its propaganda machines and remove awful, lying mouthpieces like Joy Reid, Scarborough/Brzezinski, Lemon, and others, as well as gutting the boards of the NYT/WaPo for starters and restore the journalistic integrity in such short supply.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "roadking29",
        "time": "7 September, 2022",
        "context": "When democrats get what they want, will they like it?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "baldeagle111141",
        "time": "7 September, 2022",
        "context": "Unfortunately we have seen that once the lies become truth there is very little that can change someone's mind.  The soviets perfected this process in psychological studies you can read about.  I still find liberals especiallyyounger ones who think Hunters laptop is not a big issue or still subscribe to the disinformation narrative.  Pretty scary how effective this Government Big Media Social media triad has been.  \nGreat article from one of the few true journalists left...",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "TheRiddler",
        "time": "7 September, 2022",
        "context": "LOL, Professor Snape's brother is irrelevant",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "fubar88",
        "time": "7 September, 2022",
        "context": "A business model that ignores half your potential audience is a pretty bad one and reflected in the ratings.  Sooner or later change or go bankrupt.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "curly4",
        "time": "7 September, 2022",
        "context": "Journalist Glenn Greenwald is by far not a republican but even Greenwald can see now what conservative republicans have been saying for a long time.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mattgaetzsvenmo",
        "time": "7 September, 2022",
        "context": "“Journalist” 😂",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "ProudMAGAsupporter,proudAmerican.",
        "time": "7 September, 2022",
        "context": "\"Fascism is the merging of the State and Corporate power, Corporatism.\"\n~ Benito Mussolini, Fascist",
        "good": "9",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "howaboutthem",
        "time": "7 September, 2022",
        "context": "Praise the Lord,,  we have one journalist",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rolaxride",
        "time": "7 September, 2022",
        "context": "MSM in our country basically operates like Pravda and the Chinese state media.  We must make people of aware of this and do something about it.  Thank you, Glenn Greenwald for sounding the alarm.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "howaboutthem",
        "time": "7 September, 2022",
        "context": "Adam schiff says you can't believe him",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "resistoramps",
        "time": "7 September, 2022",
        "context": "Republicans daddys money shall be redistributed to immigrants crossing the southern border.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "abiel",
        "time": "7 September, 2022",
        "context": "Glen is a liberal that just happens to be right on this topic. ",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "barrybininhalin940",
        "time": "7 September, 2022",
        "context": "Correct.  Thank you, Glenn.\nNow what?\n#letsGoBranden \n##jabDontWork \n#ultraMAGA",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jay096",
        "time": "7 September, 2022",
        "context": "i hope it burns its criminal",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "squigly940",
        "time": "7 September, 2022",
        "context": "He's a big lefty and even he sees the\nOrwellian system emerging right in \nfront of our eyes 👀. \nWhat's next?\nRe-education camps for the\nun-indoctrinated?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ozone647",
        "time": "7 September, 2022",
        "context": "That’s what the fascist Democratic Party does",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "hrpufnstuf",
        "time": "7 September, 2022",
        "context": "They're all in bed together, and apparently, it's a very large bed.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "beautifulman457",
        "time": "7 September, 2022",
        "context": "Aka Mark Zuckerberg.  Of course, he's now blaming the FBI lol.  Supposing the drop off in facebook membership is biting him in his wallet.   ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "resistoramps",
        "time": "7 September, 2022",
        "context": "Republicans and their inherited wealth shall be confiscated for the betterment of society as a whole.",
        "good": "0",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "deserteagle69",
        "time": "7 September, 2022",
        "context": "He sure said a lot of dissenting information on well known liberal platform for someone being censored.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Liberalsarescumbags!",
        "time": "7 September, 2022",
        "context": "For all you uneducated Liberals out there, which are many, this is what fascism looks like. ",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jeannniemac",
        "time": "7 September, 2022",
        "context": "Also Just Out: The Top Department of Justice lawyer was partners with Hunter’s attorney! The whole thing is one giant SCAM!!! Redo the Crooked Election!!! Great work by Charlie Hurt.   Donald J Trump:  \"",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "--theoctopus--",
        "time": "7 September, 2022",
        "context": "\"Big Tech is censoring me!\"   -Glenn Greenwald via Twitter",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "*patriot69",
        "time": "7 September, 2022",
        "context": "Just finished Mattias Desmet's \"The Psychology of Totalitarianism\" and I have to agree with Greenwald on the critical state we are in on a path to real Fascism and a cabal orchestrated by extreme leftist ideologues, not exclusively in the Democrat party, with activist participation from much of the media and elements the administrative state, especially the security apparatus  (the deep state - FBI, CIA, NSA, IRS, etc). The incremental nature of the erosion of our freedoms has accelerated exponentially in the last 6 years, likely as a result of their recognition of the possibility of another populist revolution like we saw in 2016 with Trump's election and their need to ensure that such a revolution cannot recur. This helps to explain Biden's off-the-rail behavior in his unprecedented attacks on any opposition lately. It's going to get a lot worse soon.",
        "good": "53",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "pittstop",
        "time": "7 September, 2022",
        "context": "Jealous because Repoubs can't establish such an \"alliance\". If they could, they would. Drinking that pure Hateraid.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jane94",
        "time": "7 September, 2022",
        "context": "Amen, now if everyone will wake up to the democratic facism takeover of our great country.  what do we say?  \"gig is up\", we all know the truth. i guess we have to thank Covid for all of it.  we were in, we saw what they were doing to our country and our children.  22/24",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "swbatti",
        "time": "7 September, 2022",
        "context": "Sad little magats. Everybody is picking on them.",
        "good": "2",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "ibechuck",
        "time": "7 September, 2022",
        "context": "You didn't list the 4th partner in all this, our federal law enforcement. The FBI and DOJ are fully weaponized and have the back of everything Dems do. This is serious stuff. Corruption on the left is overwhelming our country.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "thoughtfulguy777777",
        "time": "7 September, 2022",
        "context": "Glenn Greenwald is the world's last real journalist. ",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "reconsurgeon",
        "time": "7 September, 2022",
        "context": "...that 'unholy alliance' is called fascism!",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "hectorespada",
        "time": "7 September, 2022",
        "context": "Destroying the American Spirit is the goal of the leftist and their allies in the wrecking of the country.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "proudvetami",
        "time": "7 September, 2022",
        "context": "Why in the world would a sane rational citizen vote democrat.\nDon’t they see their 401s dwindling. crime increasing with high inflation?\nAre they that ignorant??",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "revolutioninusa",
        "time": "7 September, 2022",
        "context": "And Greenwald is a lifelong liberal. An old school\nLiberal if you will, when debate was considered healthy and productive. He’s not saying anything new, it’s just that a few on the left have now decided to open up about the truth. ",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "britstubbs",
        "time": "7 September, 2022",
        "context": " Mr. Greenwald is a democrat speaking the truth you know that is not allowed !",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Jasmine101",
        "time": "7 September, 2022",
        "context": "Greenwald is right on the money, and he's not a Conservative or Republican.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "republicanforever652",
        "time": "7 September, 2022",
        "context": "Disagree with this administration and go to jail. That is the freedom they are offering.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "USNavyTexan77-82",
        "time": "7 September, 2022",
        "context": "this makes the military industrial complex, look like a bridge club",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "the_people",
        "time": "7 September, 2022",
        "context": "I laugh every time Fox \"news\" calls out \"the main stream media\".\nYOU ARE THE MAIN STREAM MEDIA. You brag about being the most watched \"news\" program all the time.",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "BlueScissors",
        "time": "7 September, 2022",
        "context": "Nothing changes until COS is called and/or States leave the Union. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "retairforce",
        "time": "7 September, 2022",
        "context": "It's Snowden's buddy Glenn Greenwald. Trash.",
        "good": "2",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "resistoramps",
        "time": "7 September, 2022",
        "context": "Republicans whom inherited everything claim they could make the money back if it was taken from them. So redistribute it amongst the newly arrived immigrants and let them earn it. ",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "BlueScissors",
        "time": "7 September, 2022",
        "context": "The Party's takeover is complete. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "vermonter4gop",
        "time": "7 September, 2022",
        "context": "They wouldn't censor information that isn't true.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "VeritasDLI",
        "time": "7 September, 2022",
        "context": "Just as under Stalin or Mussolini.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "starstreams",
        "time": "7 September, 2022",
        "context": "This goes even deeper.  The WEF using all tactics imaginable to spy on and blackmail people in politics, business executives, people with political influence.  Picture it.  Someone somewhere is using influence over these people that we would call blackmail because that's what it is.  The information could be from easily trackable sources, like Epstine's Black Book of Naughty People, just enough to destroy someone.  And if they don't have something on you they'll make something up.  And use their control over the media and public personalities to target anyone.  Not just President Trump. \nThis is serious.  These people are actively attempting to overthrow the United States.  And they're busy attempting to make anyone that opposes them criminals or terrorists.  Even Obama wanted to target US citizens with drones, absent any due process.  This wasn't just a passing thought. ",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "thebestpeople908",
        "time": "7 September, 2022",
        "context": "Glenn \"GIMME CLOUT\" Greenwald comes out swinging! ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "starshiptrooper",
        "time": "7 September, 2022",
        "context": "Oh my goodness, this will sting.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "richlandwaindependants",
        "time": "7 September, 2022",
        "context": "Glenn Greenwald is FIERCE!! \nI endorse Glenn.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "turningright",
        "time": "7 September, 2022",
        "context": "Careful Glenn… you just might get the Arkansas flu someday.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cheezyb",
        "time": "7 September, 2022",
        "context": "Big words...and big accusations.\nNow we need the proof",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "maddyhs",
        "time": "7 September, 2022",
        "context": "Glenn needs to be careful. He might get censored.  ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "nononsensetwo",
        "time": "7 September, 2022",
        "context": "The private sector partnering with the Democrat Party is basically the private sector acting as oligarchs like in socialist and Marxist countries.    It's a type of fascist tactic.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "themadpoet505",
        "time": "7 September, 2022",
        "context": "if you trust the mainstream media, any of them CNN, MSNBC, ABC, CBS yes even FOX, then you are brainwashed and likely beyond help or hope. ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jay8clay",
        "time": "7 September, 2022",
        "context": "\"now the government can launder its censorship through institutions\"\nThis, of course, is the very definition of fascism, getting private organizations to enforce the government's tyranny. It won't stand.",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "canadianblackmark",
        "time": "7 September, 2022",
        "context": "I'm banned from FB for the 5th time because Trudeau is well ahead of you in the internet censorship department. You know what the left-wing are censoring. Anything that makes them look negative, which includes your opinion of their party.\nTrudeau tried to pass Bill C-10 but critics rightfully pointed out that Russian hacking wasn't their concern but that their feelings were. So Trudeau came back with Bill C-11 and wouldn't you know it, it's more of the same censorship.\nA lot of high ranking executives are guilty of Coercion and Electioneering. It's about to get ugly and only because you have had enough of Biden's threats",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "WillBeWild!",
        "time": "7 September, 2022",
        "context": "\"Greenwald had a special condemnation for journalists and other experts funded by powerful billionaires who have made careers out of targeting dissenters. \"\nRupert Murdoch has a long history of protecting Republicans by not reporting their bad press.",
        "good": "2",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "blaino15825",
        "time": "7 September, 2022",
        "context": "Glenn Greenwald - The last liberal journalist with integrity.\nYou should see how freaked out the liberal MSM is about Substack and Compact Mag etc.\nJust the notion that readers have access to long form journalism that is not subject to their censorship infuriates them.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "novaracer",
        "time": "7 September, 2022",
        "context": "welcome to the United States of China. China does the same thing to the people there so they don't know exactly what;s going on. ",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "AnnadeRothschild",
        "time": "7 September, 2022",
        "context": "Hey Fox: your opinion talking heads are not journalists.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "kommode",
        "time": "7 September, 2022",
        "context": "Lmao but you’re going to ignore all the oil company and pharmaceutical lobbyist paying politicians good lord",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dontlietome082",
        "time": "7 September, 2022",
        "context": "The unholy trinity lol. And abortion is their God. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "UrbanMyth",
        "time": "7 September, 2022",
        "context": "“...we will live in the closed propaganda system our elites claim The Bad Countries impose. It's no different.”  Many of us have remained in the US, not only because it is our home, but because we’ve long believed our form of government, a Republic, has been the epitome of fair and democratic.  Increasingly that is no longer the case….so why stay?  The world is a big place…with many wonderful countries.😐",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "clivee",
        "time": "7 September, 2022",
        "context": "Donnie is finished - he will never enter the Whitehouse Again and not even for a visit.",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "bingo!232",
        "time": "7 September, 2022",
        "context": "Hmmm - I think Glen might be on to something here.  ",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cateying647",
        "time": "7 September, 2022",
        "context": "Everyone should already be aware of this unholy alliance, I have known about it for at least 3 years.  That is why there are so many independent journalists and why so many new social media companies have popped up.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ictrocks429",
        "time": "7 September, 2022",
        "context": "Hard to deny the truth. To say it, means you are a threat to the establishment. Its why DJT is hated so much.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "AnnadeRothschild",
        "time": "7 September, 2022",
        "context": "Only one US governor has had 2 bills stopped by the courts in the past month for violating first amendment freedom of speech.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Nancy_Pelosi's_Knockers_",
        "time": "7 September, 2022",
        "context": "Glen Greenwald is correct.  This country had dozens of honest journalists decades ago.\n  Now we have the most prominent media leaders licking the boots of the New police state.\nShame on those progressives and nihilists who use their position to make life worse for honest Americans.",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "GoldCandy",
        "time": "7 September, 2022",
        "context": "Take any action necessary to stop the Republicans, and block every white person from holding any position of power.",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "irateclickbait",
        "time": "7 September, 2022",
        "context": "Greenwald is a classic liberal who took an oath to tell the truth as a journalist. Mainstream media can’t handle that fact. ",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "blackjack71",
        "time": "7 September, 2022",
        "context": "who",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "revolutioninusa",
        "time": "7 September, 2022",
        "context": "Big tech will be broken up. It’s for the betterment of the country. They’re simply too powerful and easily corrupted. No different than Standard Oil or Carnegie Steel. Most likely more powerful than those and undoubtedly more corrupt. ",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "WillBeWild!",
        "time": "7 September, 2022",
        "context": "Tell me Glen....what does the right stand for? what messages do they have, that are not getting to the people? \nGlen knows that the First Amendment guarantees free speech, but doesn't guarantee a free platform.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "travestar869",
        "time": "7 September, 2022",
        "context": "The alliances between Big Tech and the Federal government are pure fascism. The DOJ sowed the lie that Hunter's laptop was \"Russian disinformation\" and the media helped cover it up. ",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Jasmine101",
        "time": "7 September, 2022",
        "context": "Distortion by the News Media, and now  Social Media, is nothing new. It is used by global manipulators bigger than the USA and the Biden Administration. By hostile foreign governments influencing our Media. Add to that folks like Soros who have controlling power over many city leaders in Democrat-run cities. ",
        "good": "5",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "userbotno.003",
        "time": "7 September, 2022",
        "context": "[big tech] \"... working around the First Amendment\"\nThat is a problem right there.\nThe 1st amendment ONLY applies to public and government land and/or buildings. It does NOT apply to Web services where the user has to accept their Terms of Services (TOS).\nStifling hate speech does also have its drawbacks: after a person has been banned, they are far more difficult for the FBI to apprehend. ... Hypocritical Fox News removes posts and comments that go against their standards. What gives? If you are going to write an article AGAINST censorship, why do you openly censor your own users?\nObviously, in order for \"Freedom\" to work, HATE must be removed.\nSMDH\nAmerican Proud!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cowboyjoe",
        "time": "7 September, 2022",
        "context": "FBI and Justice been after Trump for 6 years. Obama will do anything to frame him to cover his  treason   ….What treason ? Aiding Iran and erasing Southern Border",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ZRZ2",
        "time": "7 September, 2022",
        "context": "Greenwald is as rare as a unicorn...he's an actual journalist!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "democratsrunderminingtheusa",
        "time": "7 September, 2022",
        "context": "Where have these people been for the last 15 years?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ByeJoe2021",
        "time": "7 September, 2022",
        "context": "Perfect trifecta to fix an election",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "nonswimmer",
        "time": "7 September, 2022",
        "context": "The federal judge that is demanding emails sent between the White House and big tech as well as Fauci will certainly help start the transparency that the American people deserve to see.  The stink in Washington and the major media with their slimy media journalists needs to be removed. ",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jman1955",
        "time": "7 September, 2022",
        "context": "What  he's saying sounds like history repeating itself.\n\"Not every item of news should be published. Rather must those who control news policies endeavor to make every item of news serve a purpose\".\n\"It is the absolute right of the state to supervise the formation of public opinion\".\nQuotes  by Joseph Goebbels",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "medalist1595",
        "time": "7 September, 2022",
        "context": "Just got back from the Walmart, 10# potatoes 9 bucks, Soros’s rein of terror is just beginning ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "werchampions",
        "time": "7 September, 2022",
        "context": "Well said, Mr. Greenwald!  our Founding Fathers expected the \"free press\" to hold government's feet to the fire --- on both sides.  Unfortunately, today's journalists are nothing more than Democrat cheerleaders.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "madd5277",
        "time": "7 September, 2022",
        "context": "Might be because of the Fauci bombshell e-mails or the devastating Durham report that was bigger than Watergate. Nice spin but no.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rhugh",
        "time": "7 September, 2022",
        "context": "Clear and concise. Good editorial. ",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "resistoramps",
        "time": "7 September, 2022",
        "context": "I have a dream that Republicans inherited wealth will be redistributed amongst the newly arrived immigrants. ",
        "good": "0",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "Barneyandthebullet",
        "time": "7 September, 2022",
        "context": "\"The government, media and Big Tech\"? How about all of our agencies and college campuses?The rinos were asleep at the wheel when they were being taken over by the left. Never once made an objection to these agencies human resources unfair and bias hiring.Time to pass the equal hire of both parties act.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "karl_sweetchuck",
        "time": "7 September, 2022",
        "context": "Well, Greenwood is a rabid leftist and was part of the problem for years, so what he is saying now means absolutely nothing. ",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "blaino15825",
        "time": "7 September, 2022",
        "context": "Greenwald was banished from the cathedral for making Obama and the security state look bad when he broke the Snowden story.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "joser14",
        "time": "7 September, 2022",
        "context": "Oh my God, Taylor Lorenz is leading a worldwide censorship cabal!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "modvoice",
        "time": "7 September, 2022",
        "context": "All tied together by Ivy League Attorneys and their legal societies. They are the biggest threat to democracy, By default they automatically control one branch of government and hold top positions throughout the bureaucracy and many are in Congress.  ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "willlandru205",
        "time": "7 September, 2022",
        "context": "And Glenn is not some Conservative mouthpiece. He's a formal free speech liberal who saw the drastic changes taking place in the Dem party. He's credible.",
        "good": "7",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "OliveDucky",
        "time": "7 September, 2022",
        "context": "Does corporate media include AM talk radio? Because the right owns all of that.",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "ButchLapp",
        "time": "7 September, 2022",
        "context": "Spot on (as usual).  Keep up the good work Glenn.",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "nononsensetwo",
        "time": "7 September, 2022",
        "context": "The reason big tech and other major corporations are cozying up to Democrats and Marxists is because they see the handwriting on the wall and it spells socialism and Marxism. They want to be the oligarchs and elites in the New World Order. If they don't buckle under to it, Democrats and Marxists will destroy them with rules, regulations and taxes. Welcome to Marxism, folks!",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Mrmantle7",
        "time": "7 September, 2022",
        "context": "Nice job Glenn . You hit it right on the head !!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Oldcanvasback398",
        "time": "7 September, 2022",
        "context": "Big tech wants to control you. Right seri?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "yerkiddin",
        "time": "7 September, 2022",
        "context": "Sorry to misplace this, but you can't comment on clips. \nI see Karine is making some announcement about the new Monkeypox Coordinator and Deputy Monkeypox Coordinator.  I'll bet the Deputy Monkeypox Coordinator can't wait to show his mom his business card and flash it around the clubs.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "nana32",
        "time": "7 September, 2022",
        "context": "Glen who?",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Sillybob",
        "time": "7 September, 2022",
        "context": "Quite unconstitutional, eh?!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "LetsGoBrandon1776",
        "time": "7 September, 2022",
        "context": "Everything he said is right.",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "legalimmigrant1880",
        "time": "7 September, 2022",
        "context": "To paraphrase Alensky, if you don't have a good answer, use ridicule.  Ben Collins is obviously a disciple of Alensky.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "suffusionofyellow",
        "time": "7 September, 2022",
        "context": "It was very good reporting but the links to China we’re not made strong enough it’s actually worse than he puts it",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "davincievans",
        "time": "7 September, 2022",
        "context": "Y’all got Fox, News Max, Breight Barr, Onn, drudge, etc.  ",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "thetruth1776",
        "time": "7 September, 2022",
        "context": "Ben Collins' small-minded and unfunny, yet thoroughly diversionary, attempt at snark is evidence that Greenwald hit the bullseye.  \nWhen regressives respond with a total lack of substance, they're effectively admitting their guilt.  \nEvery.  Single.  Time.  ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "deepthinkingbrian",
        "time": "7 September, 2022",
        "context": "It sounds like the media freakos, aligned with the cop hating, \"high IQ\" BLMs (code name for Blacks), have been spending too much time in the \"extra holy\" Rev. Al Sharpton chat room.  ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "DanManly",
        "time": "7 September, 2022",
        "context": "What he said. So, now what? A purge? I'm in!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "robespierresneck",
        "time": "7 September, 2022",
        "context": "This guy ISN'T a conservative and he sees it.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "itseasytovote52",
        "time": "7 September, 2022",
        "context": "After the investigations are done their may not be a problem anymore as the censorers will be censored in prison or better yet charged with treason and exiled.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "walterbaker",
        "time": "7 September, 2022",
        "context": "Greenwald checks multiple \"identity\" boxes that the Lefties favor. However, his objective, critical-thinking observations ain't gonna' win him any fans from that crowd.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "art3rd",
        "time": "7 September, 2022",
        "context": "\"Greenwald explained that the game has changed entirely when it comes to Big Tech censorship, because now the government can launder its censorship through institutions, working around the First Amendment, with some in journalism providing an assist.\"\nThis is all too easy. Big Tech and journalists are now State Actors and step into the shoes of government, exposing them to lawsuits for Constitutional violations. It is only a matter of time before the first suit is filed and the snowball starts to roll.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "thinkalittle656",
        "time": "7 September, 2022",
        "context": "Greenwald is one of the few honest liberals out there.  Been following him since his stories with Edward Snowden and his expose of the NSA.  ",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "kenman55",
        "time": "7 September, 2022",
        "context": "Good to hear the truth, it's so rare today!",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "justanothercomment830",
        "time": "7 September, 2022",
        "context": "I like Geenwald. \nHe explained simply why the media sides with the miscreants/swamp creatures in Washington. They live in the same neighborhoods, their kids go to the same schools and they all go to the same parties over the weekend. \nIt's a logical explanation. ",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "--theoctopus--",
        "time": "7 September, 2022",
        "context": "Greenwald on Twitter: \"Big Tech is censoring me!\"",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "bigislandhawaiian580",
        "time": "7 September, 2022",
        "context": "Don't forget the FBI who lied to social media companies about the fake Russian disinformation nonsense concerning the Hunter Biden lap top story so they would ban anyone who even mentioned it.\nWhich is exactly what they did, and that includes the NY Post.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jaykay23752",
        "time": "7 September, 2022",
        "context": "Is truth social going bankrupt?",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Re-normalizing",
        "time": "7 September, 2022",
        "context": "Sorry, but this is what fascists do. They control mass media & they love corporatocracy. Fascists riot and intimidate, focus on race, indoctrinate kids, collect guns, bypass the constitution, centralize government and police and terrorize the opposition party. Oops.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "con_kryptonite",
        "time": "7 September, 2022",
        "context": "Who?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tous197493",
        "time": "7 September, 2022",
        "context": "Like all of trump's bankrupt businesses...",
        "good": "2",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "wjbii",
        "time": "7 September, 2022",
        "context": "Refreshing and honest Journalist! ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bflobob8",
        "time": "7 September, 2022",
        "context": "What an absolute joke. It shows the complete contempt that FOX has for its followers that it can run this article and think it's a serious entity. Not one word on TV, online or in print about the President they propped up for the last 7 years stealing the most secret government inormation that exists. Not one word about what looks like it could be a slam dunk case of espionage and other traitorous acts by an ex president. Trump is in deep, there is no possible legal explanation why he has those documents at his home. Not one. He should be arrested today and made to explain exactly why he had them, how many copies there are and who did he give this nuclear information to. This is a monster story. ",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "🇺🇸saynotodempolicies🇺🇸",
        "time": "7 September, 2022",
        "context": "At least we have evidence now. Thanks Zuckerberg ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "theuglytruth183",
        "time": "7 September, 2022",
        "context": "Big (Tech) Brother is watching you...!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "HawkVeritas",
        "time": "7 September, 2022",
        "context": "'Fascism should right be called corporatism as it is the merger of corporate and government power' -- Benito Mussolini",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "frankrizzo186",
        "time": "7 September, 2022",
        "context": "Oh yea. He “scorched” them real good. 🙄",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "talibiden161",
        "time": "7 September, 2022",
        "context": "Liberalism is a clear and direct threat to our constitution",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "revolutioninusa",
        "time": "7 September, 2022",
        "context": "Big tech oligarchs are conceding a few censorship points right now as the tea leaves are starting to show a Republican senate and impending investigations. Greenwald has a couple of months to speak freely on Twitter until the results come in. He’s on the money as being a lifelong dem he knows all of the players. ",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "teacherinca",
        "time": "7 September, 2022",
        "context": "So many liberals are spoon fed their news from big tech social media. Having a conversation with them is impossible because they just repeat phrases that they've heard and if they sense that you disagree they aren't interested in discussion. They have no idea what a bubble they are in and consider themselves to be knowledgeable even when saying things that are completely wrong.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Mega5090",
        "time": "7 September, 2022",
        "context": "Bravo Mr. Greenwald. Best article I’ve read in a long time. It is so true. We have to breakup big technology companies and local and Federal agencies.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "whosinchargehere",
        "time": "7 September, 2022",
        "context": "Greenwald is correct, and the average American is starting to see it.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "getajobliberal",
        "time": "7 September, 2022",
        "context": ".Too many cowards in the Republican party They are doing nothing to fight this new world order being spread across America. ",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "foxnewsmandatesvaccinations",
        "time": "7 September, 2022",
        "context": "No one is less respected than Greenwald",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "SteveLahaie701",
        "time": "7 September, 2022",
        "context": "CNN: Unfair and unbalanced.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jimijam832",
        "time": "7 September, 2022",
        "context": "Eliminate them, deport them.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "MakeAmericaGratefulAgain",
        "time": "7 September, 2022",
        "context": "The key term here: \"unholy.\"  The sparkly, glitter veneered agenda of the Left is becoming more and more obvious as to its true origins.  It is nothing more than culturally destructive, Godless, \"progressive\" darkness.  There is no redeeming value other than an emotion-based, false sense of \"doing something\" positive. ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "karl_sweetchuck",
        "time": "7 September, 2022",
        "context": "Greenwald is the epitome of a garden-variety, establishment leftist. The gentleman doth protest too much. ",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "mrdna",
        "time": "7 September, 2022",
        "context": "Glenn Greenwald is one of the last journalist out there that you can still trust to tell the truth.   Walking away from The Intercept, which he started, was pure journalistic integrity.  He's maintained his independence, which is huge in the world of Fake News. I check his Substack page every day.  Woodward and Bernstein used to be like this in the 70's, before they sold their souls.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "southofnowhere",
        "time": "7 September, 2022",
        "context": "And Greenwald (at least historically) is a Democrat. ",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "clownyfish",
        "time": "7 September, 2022",
        "context": "Sleeping Republicans have been watching it and getting their own kickbacks for years... They've failed us...\nWhich is why we want fighters like Trump....\nRepublicans currently are an empty shelf when it comes to a fight... ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "makeminefreedom228",
        "time": "7 September, 2022",
        "context": "Democrats coordinating with big tech to bypass free speech. That's exactly what they're doing.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Do4_Con_Lib",
        "time": "7 September, 2022",
        "context": "The most amazing thing to me is, when these Lefties get caught with irrefutable evidence, they just move on. Russia interference and the laptop are just two examples. Never an acknowledgment of the wrongdoing. This is worse than lying, it is intellectual dishonesty. These people LIE to themselves. That is a moral failing",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "nowomennohomos",
        "time": "7 September, 2022",
        "context": "greenwaldisonhiswaytoaburningsulfurouslake",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "boebertspimp",
        "time": "7 September, 2022",
        "context": "Glen Greenwald \n😂. ",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "itzunbelievable",
        "time": "7 September, 2022",
        "context": "Where is the thumbs up button for this guy? Doesn’t matter your political beliefs, no one should want to silence the truth or even dissenting opinions just because you don’t like them. ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "wildhorse2000",
        "time": "7 September, 2022",
        "context": "This guy is right on target!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "👌DemusStultus",
        "time": "7 September, 2022",
        "context": "Look around and see how many republicans have one or more of the social media sites loaded. A lot. You load Facebook or Twitter, you support them. So don’t complain if you use it. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Ahnold",
        "time": "7 September, 2022",
        "context": "Biden and the 4th Reich ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "galoman_returns",
        "time": "7 September, 2022",
        "context": "Glenn who said what, and on which platform?\n🤣🤣🤣",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Democrats_For_Trump__",
        "time": "7 September, 2022",
        "context": "The talking heads are not journalists \"....they serve rather than challenge power, they deceive rather than inform, they demand censorship rather than free and open inquiry.\"",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "minimumtaxforall",
        "time": "7 September, 2022",
        "context": "Let there be truth.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "wolfhowl99",
        "time": "7 September, 2022",
        "context": "I agree completely. We are rapidly regressing to a one-party, censoring country. Liberals know that they control the population by controlling the information. Big Tech has allied with Democrats to ensure they never lose their power.",
        "good": "7",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "bigislandhawaiian580",
        "time": "7 September, 2022",
        "context": "Isn't it amazing how so called journalists don't have a problem with lying as long as it pushes their lib agenda?\nThey don't even try to hide it any more.\nTHIS is what has led to CNN, and other lib media organizations dropping ratings and viewers faster than Joe Biden can fall off his bike.",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "truthbsaid271",
        "time": "7 September, 2022",
        "context": "Glen Greenwald is an actual journalist and he is amongst the few that actually exist,Corporate media is nothing more than left wing propaganda.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Datada0300",
        "time": "7 September, 2022",
        "context": "So, Glenn went on Twitter......Twitter.......to warn about \"Big Tech\"?",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "CptVonTrapp",
        "time": "7 September, 2022",
        "context": "Hopefully Glenn Greenwald has personal security...",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "HumptyTrump183",
        "time": "7 September, 2022",
        "context": "🤣🤣🤣.....yet he uses twitter to get his point across. Why isn't he using Truth Social? Probably because nobody else is either..",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "reefkeeper",
        "time": "7 September, 2022",
        "context": "There are a couple other branches on the censorship tree - unions and higher education. ",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "EngineerRetired",
        "time": "7 September, 2022",
        "context": "\"\"The worst of all - the most repugnant and despicable - are those calling themselves ‘journalists’ while doing the opposite of what that term implies: they serve rather than challenge power, they deceive rather than inform, they demand censorship rather than free and open inquiry,\" he wrote\"\"\nMEGA ULTRA MAGA Truth Right there.\nFAKE NEWS!!!!!!!!!!!!!!!!\nTRUMP RIGHT AGAIN AND AGAIN. ",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "DoctorMonkey",
        "time": "7 September, 2022",
        "context": "I blame the Capitol Riot on Twitter for not banning Trump sooner.",
        "good": "1",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "startagainfree",
        "time": "7 September, 2022",
        "context": "Biden has turned our government into a copy of the Russian communist/socialist state. What is the media doing about it? Snoring. ",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jerimiahii",
        "time": "7 September, 2022",
        "context": "The Sherman (\"Anti Trust\") Act ignored, has resulted in a erosion of free enterprise, and free expression. Whether it be Amazon, Google, Facebook, etc., billionaires with both influence and resources, dominate what you read/hear, resulting in nothing less than deceit. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "DoctorMonkey",
        "time": "7 September, 2022",
        "context": "DeSantis used the government to punish a business for voicing an opposing political view and the Fascist Republicans loved it.",
        "good": "1",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "captpmm",
        "time": "7 September, 2022",
        "context": "Best Fox article in a long time.  Truth. ",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "johnlee966",
        "time": "7 September, 2022",
        "context": "I remember when the lefties railed against the wealthy fat cats, who seemed to have too much control!  Now, all of the liberal tech billionaires are throwing their weight around and trying to silence any opposing viewpoints!  This is the worst group of people that ever existed in America!  They need to be stopped!",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cal2177",
        "time": "7 September, 2022",
        "context": "Spot on.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "captpmm",
        "time": "7 September, 2022",
        "context": "“I’m all powerful,” is what I think the Ben guy said. Watch what happens next ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Saber03",
        "time": "7 September, 2022",
        "context": "They are destroying our country from within, until we are so distorted we can defend from without.  Disgusting and shameful.",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Datada0300",
        "time": "7 September, 2022",
        "context": "\"Greenwald warned about the 'regime of censorship being imposed on the internet' in a Twitter thread\"\nAnyone else see the irony in this headline?",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "truepàtriot513",
        "time": "7 September, 2022",
        "context": "Haha. OMG.  These writers are horrible.  Just put a link to the tweet.  ",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "jerries",
        "time": "7 September, 2022",
        "context": "You are correct Mr. Greenwald.  I can't imagine what they are doing to the little guys.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "fjbmagamofo",
        "time": "7 September, 2022",
        "context": "Their ALL into Drugs and Human Trafficing together...",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "OhWell466",
        "time": "7 September, 2022",
        "context": "Big tech under political pressure? No. They agreed with everything they were handed or helped to create. Which is why it should be possible to prosecute. Silencing conservatives but leaving the accounts of known enemies of US citizens open to express actual hate can be proven.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "NambuccaBarry",
        "time": "19 September, 2022",
        "context": "Any comment about the links between social media companies like Facebook and how they allowed companies like Cambridge Analytica to use their data, to assist Republicans and Trump in particular in the 2016 election?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rog1",
        "time": "19 September, 2022",
        "context": "I fear it’s too late to stem the tide of totalitarianism. Greenwald expressed very articulately the intent of the real fascistic movement. Isn’t it interesting how history seems to consistently point out the old adage that absolute power corrupts absolutely. It’s a very powerful human flaw that has been proven throughout history. Unfortunately, humans have learned little as we’ve watched this process repeated throughout history. ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Kbeck",
        "time": "19 September, 2022",
        "context": "Truth",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "blaino15825",
        "time": "19 September, 2022",
        "context": "Your first indication that Dems were going full fascist with the media and security state:\nThey accused you of doing it.\nEvery time.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Rover?",
        "time": "19 September, 2022",
        "context": "Civl War against the Left is necessary and just. The time is here.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sidehustle88",
        "time": "19 September, 2022",
        "context": "Always appreciate Greenwald's perspective.  One of the last of the true Liberals.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "chuckiechan483",
        "time": "19 September, 2022",
        "context": "If you wonder where the nation is going, in California none of the constitutional officers are debating their opponents. Mose voters don’t even know there is such a thing.  The corrupt media and Silicon Valley have it sewed up.  No publicity = corruption. How can anyone trust such a system?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "CROMAG",
        "time": "19 September, 2022",
        "context": "Alinsky, Stalin and Goebels would be so proud. The problem is that these people who do these things to be the leaders, get to the top and they cannot lead because the skills they have to get there are not the skills required to lead the Country. All they know is how to lie, cheat, twist the truth and extort their way to the top. When they get there they have no clue what to do.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "CROMAG",
        "time": "19 September, 2022",
        "context": "He forgot the Military, the Univeristies and the Catholic Church. Big Brother abounds in the 21st century and the Millenials rejoice in it because it is everything their parents are afraid of.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "headshake737",
        "time": "19 September, 2022",
        "context": "Well, Fox is behind the rise of white nationalist fascist… so I guess it’s fair",
        "good": "2",
        "bad": "7",
        "replies": []
    },
    {
        "user_name": "agentjayz796",
        "time": "19 September, 2022",
        "context": "Why do Republicans want so badly to interfere with the free market?\n\nThis isn't a government censorship issue.  This is a private company censoring what is posted on its private platform that is private (not owned by the government).\n\nWhat's next - are republicans going to pass a law forcing a left-wing coffee shop to serve a red-hat wearing MAGA when they don't want to?",
        "good": "0",
        "bad": "9",
        "replies": []
    },
    {
        "user_name": "Razzmatazz612",
        "time": "19 September, 2022",
        "context": "Imagine how our nation would soar if African Americans got off the Democratic Party plantation.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "freedomandjusticeforall116",
        "time": "19 September, 2022",
        "context": "He explained this is the mindset of \"would-be tyrants\" who claim that their \"enemies are so dangerous, their views so threatening, that everything we do – lying, repression, censorship – is noble.\"\n\nThis is exactly what's happening.  Biden and the Democratic Communist Party of America plus all the thugs carrying out their orders, are out there repeatedly chanting, \"if you want to save our democracy, don't vote republican.\"  The liberal lemmings who are under the mind control of this party don't realize that Republicans are the party of free speech and that if you want to save our democracy, don't vote for dems.  They're so brainwashed it's easy to get them to believe anything.  The dems have them right where they want them.  At this point, they will probably murder people to justify \"saving\" their democracy.  In some respects, they already do.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Tim709",
        "time": "19 September, 2022",
        "context": "Looks like some \"COLLUSION\" was going on here.  I wonder if an \"HONEST\" Justice System would start and follow through with a conspiracy investigation?  We all know this broken down JUST US System won't!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "xyzabcd",
        "time": "19 September, 2022",
        "context": "Internet censorship is like railroads refusing to deliver goods to a democrat controlled state.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Lamo653",
        "time": "19 September, 2022",
        "context": "Yup, it's gotten out of hand. Americans should demand charges against big tech for meddling in controversial government and real true issues that is dividing our country on an almost daily occurrence. Just because one (they) has trillions, does not give them sole ownership of America",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "xyzabcd",
        "time": "19 September, 2022",
        "context": "The government allowing users of common carriers to censor opinions is a violation of the first amendment.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "jnukem06",
        "time": "19 September, 2022",
        "context": "This has been going on for more than 15 years lol. Oooops time to act now huh",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Bass300",
        "time": "19 September, 2022",
        "context": "Glenn the major networks are part of the Democratic Party and have been for over 50 years ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "screwthelibs001908",
        "time": "19 September, 2022",
        "context": "People will probably target their employees.  Maybe they will Follow them when they leave work, get all the info about them they can and make available to those who are willing to make them pay for their bad deeds.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "eastard",
        "time": "19 September, 2022",
        "context": "Extremely accurate article well said...",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "birdwomanmsw",
        "time": "19 September, 2022",
        "context": "The left does not care…pure and simply.  The left is doing what the left does.  Control and cheat",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Richyriches",
        "time": "19 September, 2022",
        "context": "\"Extreme right wing journalist\" scorches left wing party and media... is what it should say. Hmmm wonder if he's unbiased? 🤣 Great source guys.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "areswest",
        "time": "19 September, 2022",
        "context": "As we've been saying all along. The true fascists of this country...\n\nDemocrats",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "taggert",
        "time": "19 September, 2022",
        "context": "Glen's correct....again.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "patmanfox1984",
        "time": "19 September, 2022",
        "context": "Truth social is the best of America right? Sponsored by a formal president that takes the 5th and has 4 open investigations into his criminal behavior.",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "LunacyRules",
        "time": "16 September, 2022",
        "context": "‘scuse me, but since when can private companies arbitrarily violate constitutional rights?  Remember affirmative action and the ERA?  Plain nonsense - a class action civil rights lawsuit will prove that.  See what happens when you allow them to restrict “hate speech”?   Slippery slope indeed - can anyone define precisely what that is and how it can be differentiated from disagreement or disapproval? Once they get their foot in the door, the real agenda emerges - party-line censorship.  Wake up America, our Constitution is under attack by leftists.  McCarthy wasn’t all wrong it seems….",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ForwardThinking",
        "time": "19 September, 2022",
        "context": "There you go FOX!!! I was wondering when the conspiracies would be back!!!!\n\nIt's been Queen for a week...",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rconlan",
        "time": "19 September, 2022",
        "context": "Big Tech/Dems = Big Brother",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "TruthSocialLOL",
        "time": "19 September, 2022",
        "context": "Glen is fake news\nTrump said so",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "TheRepublicMatters🎬",
        "time": "8 September, 2022",
        "context": "The progression of the political discourse and the reality they’re trying to create like the qanonish of the year 2020 is unbelievable. ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Spudnut",
        "time": "19 September, 2022",
        "context": "We love you Glenn…",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "blaino15825",
        "time": "19 September, 2022",
        "context": "Greenwald was kicked out of the leftie clubhouse for telling the truth, starting with his embarrassment of Obama over the Edward Snowden story.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "johnnyknobbe",
        "time": "19 September, 2022",
        "context": "Translation: the alliance of government Democrats, corporate media and Big Tech are interfering with the far right disinformation efforts and exposing the lies from the liars.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "bartholomewmcgillicuddy859",
        "time": "19 September, 2022",
        "context": "Good thing there's no connection between Republicans, big Tech, and the Corporate Media.\n\n\n\n(said on the Fox News website)",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "blaino15825",
        "time": "19 September, 2022",
        "context": "Why did  liberal media outlets throw out their daily POTUS lie counter when Joey got into office?",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "foxx",
        "time": "19 September, 2022",
        "context": "the corrupt msm colluded with the big guy's basement campaign to remove trump",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "freeko",
        "time": "19 September, 2022",
        "context": "Welcome to 1984.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "patmanfox1984",
        "time": "19 September, 2022",
        "context": "How are things going at Truth social? Good ?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jayjjacob",
        "time": "19 September, 2022",
        "context": "We saw emails over at Judicial Watch that prove this is true",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jayjjacob",
        "time": "19 September, 2022",
        "context": "Well someone has to just come right out and say the truth DAH",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "greatlakesgraphics",
        "time": "19 September, 2022",
        "context": "\"Journalist\" Glenn Greenwald that's rich. Very objective \"journalist\".",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "educatedsuburbanwoman",
        "time": "8 September, 2022",
        "context": "This guy is spot on with what he wrote in this thread. ",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "PersonalResponsibility480",
        "time": "19 September, 2022",
        "context": "Thank you Mr Greenwald for doing your part to expose the tyranny",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "williammalinski",
        "time": "19 September, 2022",
        "context": "The term “misinformation” is not a truth determinate. It is often the misinformation itself. No individual has the right to determine truth. If they disagree with someone’s opinion. They should be free to disagree and provide their reasons for disagreement. All speech should be free. True hate speech will be tuned out by decent society. That doesn’t mean that some individuals get to determine what hate speech is. Free speech by all is the best solution.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "fallfasterfool",
        "time": "19 September, 2022",
        "context": "Is there any defense?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "agentjayz796",
        "time": "19 September, 2022",
        "context": "So... far right conspiracy theorists are upset for getting fact checked and called out?\n\nCry me a river.",
        "good": "0",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "Lib-aerator",
        "time": "19 September, 2022",
        "context": "This is the main problem of the modern Republican Party.  Reporting facts and calling out lies and conspiracies is not unholy.   It’s not a major conspiracy among various groups.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "pauleywalnuts",
        "time": "19 September, 2022",
        "context": "Ben Collins is a Communist. Like Taylor Lorenz. Call them for what they are.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "empathetic",
        "time": "19 September, 2022",
        "context": "FOX hitting rock  bottom.  Pulling up old stories from 3 weeks ago.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "waggledancer",
        "time": "7 September, 2022",
        "context": "Thank you, Greenwald. Keep speech free.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "am1st883",
        "time": "7 September, 2022",
        "context": "form the response he is right on point.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "IndieXDem",
        "time": "8 September, 2022",
        "context": "Biden who calls \"MAGA\" Republicans \"fascists\" who hate our Constitution has been openly engaging in fascist state corporate \"partnerships\" to defy the Constitution! \nNot only that Biden has repeatedly issued executive orders he knows are unconstitutional...and have been ruled as such by the courts...\nWhat's amazing is many \"woke\" pundits see nothing wrong with an unpopular P\nresident's totalitarian assualt on US voters who disagree with his policies...Democrats are so used to attacking the voters they can't see how inappropriate that is for the President of the US to act like a tyrannical dictator trying to silence all dissent and literally act as if he has the authority to decide who is \"worthy\" of having a voice in our politics. \nIt's totally OK to be a Republican as long as you agree and vote like a Democrat...and hate Trump of course ",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Culper487",
        "time": "7 September, 2022",
        "context": "Big tech needs to be broken up as they have way too much power.  Even dems we’re for this until they realized big tech could help them spread their lies.  Now both are corrupt sleaze, responsible for America’s downfall.  ",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "camowon",
        "time": "7 September, 2022",
        "context": "Many can't handle the truth. ",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "willmottpa",
        "time": "7 September, 2022",
        "context": "Break up ALL companies worth over 100 billion. There’s no benefit to the common man or woman while these monopolies exist. The People broke up Standard Oil and it produced a juggernaut of economic growth.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "justthink538",
        "time": "7 September, 2022",
        "context": "Since when could you describe Greenwald as a \"journalist \" ???",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "waggledancer",
        "time": "7 September, 2022",
        "context": "You know the Democrat message is all about power if they have to censor issues they fear will topple their grip on power.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "headwaters",
        "time": "7 September, 2022",
        "context": "Norah O'Donnell and CBS News have moved into MSNBC and PBS camps. Another down!",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Drainit",
        "time": "7 September, 2022",
        "context": "The U.S. gov. should not be in the loan business, they are incapable and in competent. \n'Savings and loan scandal' followed by the 'Subprime mortgage scandal'.\nNow its college loans,\nif businesses operated this way, they would all be in jail! The fleecing of the American taxpayer for the last 40 years.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "paultheroman",
        "time": "7 September, 2022",
        "context": "I've been watching a Y**T**e channel called, \"The Memory Hole\" recently that features old interviews from C-span and various book clubs. Guests like Gore Vidal and authors of books about the history and activities of the C.I.A. and other governmental agencies. I find that the warnings and revelations offered by those decades old pundits are becoming eerily true. The decay and rot that occurs within institutions that have outlived their usefulness and betrayed their remits is happening before our eyes. Concepts like the Senior Executive Services, and the elite management levels of the Secret Service, the F.B.I. and many other federal agencies have assumed a life of their own and as a result of the power and influence they've amassed can commit acts of criminality on a level the world has never seen before. Or maybe it has.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ExxWhyXee",
        "time": "7 September, 2022",
        "context": "It's called communist propaganda. That word was in my 4th grade vocabulary list the year JFK was assassinated. ",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "karenrichard",
        "time": "8 September, 2022",
        "context": "The worst thing is that “rank and file” traditional generational democrats are oblivious to how THEY are being duped by their own party.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "krono069",
        "time": "7 September, 2022",
        "context": "Oh look, it's actual fascism.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Spotfox996",
        "time": "7 September, 2022",
        "context": "Really ?? Welcome to the party, pal. No duh 🙄 what took you so long ?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "innnj",
        "time": "7 September, 2022",
        "context": "To the Leftists & lemmings of the Left, there is no greater good, there is only \"our greater good\".\nThey will hasten the fall of America, while your kids will not know a free America ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "deano068",
        "time": "7 September, 2022",
        "context": "Coming from a Democrat, it  says a lot!",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "MarlaSinger",
        "time": "8 September, 2022",
        "context": "We have to starve the bankers, they are our captors. Might take my money out. Get ready for the big boss.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dpowertrip",
        "time": "7 September, 2022",
        "context": "Bravo! Bravo! ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bflo4ever",
        "time": "7 September, 2022",
        "context": "I'd love to see Glenn get a nightly tv show, love when he comes on as a guest.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cmcfl",
        "time": "7 September, 2022",
        "context": " Otice since Biden’s speech the media is trying to out a spin on their previous bashings of Trump and republicans.  some are saying they were wrong (I know it’s a first) for saying what they did.  All of this is no more than a ploy by the left, trying to lower negatives resulting from Biden’s speech.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "amery055",
        "time": "7 September, 2022",
        "context": "This . . . THIS . . . is the unholy Trinity which will destroy the great American experiment unless we the public push back and say \"NO MAS!\"  That so many rank and file Dems can't see this threat and remain so blinded by a personal hatred for Trump is what gives me terrible heartburn every day.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "corman581",
        "time": "7 September, 2022",
        "context": "This is the article that lays out what I've been saying is our biggest threat to our country for years now.... This HAS to be dealt with and remove the corrupt powers that are censoring and controlling all of us.... it's a REAL and powerful Big Brother and eliminating this threat should be our #1 priority!",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "SoonerOrLaterComingForYou",
        "time": "7 September, 2022",
        "context": "Media and big tech companies should all be sued billions for installing an illegitimate biden and Harris.\nOur economy would still be growing instead of what it is now.\nDemocrats should be committing seppuku.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "demsrdirty",
        "time": "7 September, 2022",
        "context": "If things don't change soon, the smell of  gunpowder, will blanket the land. The left has America backed into a corner. Something has to give.",
        "good": "2",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "Sidneyisagirltoo",
        "time": "7 September, 2022",
        "context": "'our enemies are so evil and dangerous, anything is justified to stop them,'\" he tweeted.....sounds like a speech Biden gave just a week or so ago.!",
        "good": "4",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "blaino15825",
        "time": "7 September, 2022",
        "context": "Greenwald cannot be canceled because he is now on Substack, where several of the remaining honest journalists have migrated. He has some great content there (on many topics) and makes his income off of subscriptions. I highly recommend it, if for no other reason than corporate media is absolutely terrified of independent (and excellent) journalism found on the Substack platform.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "aluf",
        "time": "7 September, 2022",
        "context": "When global monopolies collude with state government, there is little room to maneuver unless we have a courageous judiciary. And we don't. There are too many Marxist operatives masquerading as jurists in America thanks to Clinton, Obama and Biden. ",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "onlythebestforus",
        "time": "7 September, 2022",
        "context": "And when the head of one of the big tech companies funds ballot boxes (!!!!) you know something is amiss.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "deserteagle69",
        "time": "7 September, 2022",
        "context": "Maybe TRUTH wouldn't be headed for bankruptcy if all the people crying about Twitter posted on TRUTH.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sb21083",
        "time": "7 September, 2022",
        "context": "This Greenwald guy is a sinner, according to the Bible.  He is literally married to a man.  ",
        "good": "0",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "UltraMagaOne",
        "time": "7 September, 2022",
        "context": "Communism no matter the pretty names they make up is EVIL. Like Socialism, Marxist, Progressive, People's Party, etc.  \"And have no fellowship with the unfruitful works of darkness, but rather expose them.\"  (Ephesians 5:11 NKJV)",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "panavyvet169",
        "time": "7 September, 2022",
        "context": "Government censorship, even through a Proxy, is STILL GOVERNMENT CENSORSHIP! Grounds for impeachment and many terminations! ",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jswjr579",
        "time": "7 September, 2022",
        "context": "the French monarchy never saw 1793 coming....",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "justcurioustoday",
        "time": "7 September, 2022",
        "context": "As my comparative government professor said, Fascism is the marriage of Big Government, Big Business and Big Labor.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "republicansareguilty",
        "time": "7 September, 2022",
        "context": "I was going to outline all the lies, but then I realized there were far too many and that he just basically keeps repeating them over and over in different ways...And some of it is opinion and hypocrisy especially given what Fox and Republicans do.\nAt least he didn't say  GAY.  Where was he when DeSantis was violating the First Amendment rights of people who DARE to exercise their First Amendment rights?\nWhat happened to Glenn Greenwald? The former trans ally now sides with right wing transphobia\nOnce a defender of trans rights and friend of Chelsea Manning, Greenwald has drifted toward the culture-war right\nOh.",
        "good": "0",
        "bad": "8",
        "replies": []
    },
    {
        "user_name": "elgato3",
        "time": "7 September, 2022",
        "context": "The US media is corrupt and is not to be trusted. Glenn has it right. Pay attention to who you vote for and what they really represent. The democrats have been pulling the wool over peoples eyes for a long time. As for Corporate leaders in America their first and only responsibility is to the shareholder to manufacture the best product in the safest manor that adds value and nothing else. If they deviate from  that there is a court system. ",
        "good": "19",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "CyanBottle",
        "time": "7 September, 2022",
        "context": "Greenwald has a good grasp on our current sociopolitical reality.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "FoxyJuan",
        "time": "7 September, 2022",
        "context": "They are private companies they can rule what way they want, right? It’s their company, isn’t it?",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "dave7865909",
        "time": "7 September, 2022",
        "context": "Say anything derogatory about Trump and you will be immediately banned from Breitbart, Truth social, OANN, Newsmax, and Parler. ask me how I know.",
        "good": "1",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "Berserkr",
        "time": "7 September, 2022",
        "context": "By any means necessary and they meant it.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "thezsdad598",
        "time": "7 September, 2022",
        "context": "If you skipped the interview with Greenwald you really should go back listen to it. He sees clearly what is going on. ",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mcnekim",
        "time": "7 September, 2022",
        "context": "Go Glenn!!! Preach! \nGoebbels in Germany said of propaganda,  \"no one can say your propaganda is too rough, too mean; these are not criteria by which it may be characterized. It ought not be decent nor ought it be gentle or soft or humble; it ought to lead to success.\" They INUNDATED people with their messages until the nation was raising their hands to the leader. They didn't care whether their propaganda was tasteful or truthful. Starting to sound familiar.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "gilesl.",
        "time": "7 September, 2022",
        "context": "The Democratic Party controls the media, the DOJ, the FBI. Who can stop them from removing all opposition. If the Democratic Party wins the Senate and the House in November they will surely win the 2024 election. A step short of imposing a dictatorship on Americans. ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ggforpa",
        "time": "7 September, 2022",
        "context": "The big problem is that none of the Republican legislators have the testicular fortitude to fight this in a real way. They sent their spines in exchange for the wealth they all accumulate.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Drainit",
        "time": "7 September, 2022",
        "context": "Zuckerberg thinks pointing the finger at the FBI absolves him of wrongdoing? He needs to post on facebook everyday what he chose to censor was factually correct, and how his $330 million was key to installing the Manchurian Candidate we now have. \nZuckerberg YOU owe America the truth.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "letsthink!",
        "time": "7 September, 2022",
        "context": "True all of that. Way past time to do something about it and so glad it’s finally getting covered in a way that will lead to the culling of this unholy trinity. ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "NJK386",
        "time": "7 September, 2022",
        "context": "I am a trained journalist and I wholeheartedly agree with Greenwood. Now we have Fox News joining this unholy alliance. ",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "UltraMagaOne",
        "time": "7 September, 2022",
        "context": "TRUE!  The Communist Manifesto includes creating unrest in the society, indoctrination of the youth, disarming the civilian population and CONTOLLING THE FLOW AND CONTENT OF THE MEDIA.  Russia and China or smaller communist governments could not survive with a free press.  At one time Russia under Stalin claimed they would take over the United States without firing a shot. It's all been happening right under our noses for decades. People, it's happening and we are being desensitized to it.  The progressive left are American Marxists.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "royerfelix",
        "time": "7 September, 2022",
        "context": "Excellent analysis.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "edwinalmondo",
        "time": "7 September, 2022",
        "context": "Christ spoke clearly about this stuff. Liberals seem to think they know more until they are on their death bed. ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "usaunderattack",
        "time": "7 September, 2022",
        "context": "They have infiltrated every aspect of society! Voting won’t matter anymore. The corrupt governments evil soldier-officers are the prosecutors in every district court in America; prosecuting conservatives on false accusations. They over time silently moved to weaponize courts on a local level against American conservatives. Twisting and manipulating a false and weaponized rule of law. These prosecutors land 6 and 8 year terms and are protected at the highest level of law.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "srirwin",
        "time": "7 September, 2022",
        "context": "I believe what he has reported is the definition of true fascism!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Deltafox07",
        "time": "7 September, 2022",
        "context": "It has been an amazing sight!  Just watching Democrats, the MSM, and the indoctrinated youth of High Tech, all unite as \"the swamp.\"  They are unanimous in disliking Republicans.  But. most of all they hate the outsiders, and love the ruling class career politician.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "repubsagainsttrump",
        "time": "7 September, 2022",
        "context": "Huh - kind of like the massive sinful cabal of government Republicans, Big Pharma and medical insurance companies, and corporate oil companies collude to mislead and outright lie to voters by blaming democrats for everything and calling them socialists and communists as they spread their hate for anything that just might give those that need it most a hand up?",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "wokies2dawoodchippers851",
        "time": "7 September, 2022",
        "context": "Libs are MARXISTS. They seek to enslave the individualist to serve the collective, overseen by a caste of elitist technocrats. Did I mention they have to be destroyed, much like an exterminator removes and infestation?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "verryfunny",
        "time": "7 September, 2022",
        "context": "Glenn is right of course. I also think loss of rights is a forgone conclusion. \n think the left (and their handlers and their minions, in their respective capacities and awarenesses) are already laying the foundations of the next stage. Their actions have been impervious to any controls since some time now.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "brawny",
        "time": "7 September, 2022",
        "context": "Glenn Greenwald is a real journalist! Pay attention ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Zegna140311",
        "time": "7 September, 2022",
        "context": "Brilliant piece. Collins' retort reveals the pipsqueak that he is. I want to see Greenwald on Gutfeld.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mrdna",
        "time": "7 September, 2022",
        "context": "God, I love this guy.  What's the difference between what the social media companies are doing to restrict citizens opinions and them hanging up a sign that says \"Whites Only\"? Separate but Equal has already been ruled unconstitutional.  It's inherently evil to tell someone to go drink from a different fountain... if there is no other fountain.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "newssucks973",
        "time": "7 September, 2022",
        "context": "Our government is so incompetent we got to 1984 ..38 years behind schedule ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mccracker",
        "time": "7 September, 2022",
        "context": "Time to end the civil protections that have allowed them to build fascist monopolies, while censoring free speech for the Democrats.. ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "WillBeWild!",
        "time": "7 September, 2022",
        "context": "If conservatives had better ideas and better candidates, people would listen, and maybe they would win some elections.",
        "good": "2",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "billionaire_pollution",
        "time": "7 September, 2022",
        "context": "We force their cameras off during our raid. We block out the windows while we count votes. Our families own the voting machines. We threaten and bribe the media to tell our story. We mandate experimental_injections. We ignore the border. We ignore fentanyl. We ignore crime. We traffic all those missing kids. We look right at the camera and lie to the people. We profit from your misery. Who are we? ",
        "good": "4",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "commoncents770",
        "time": "7 September, 2022",
        "context": "Hey America, remember when Trump was elected, and you were told it would be the end, war and despair was all we had in store? What we had was the greatest economy ever, peace and prosperity for everyone! Under Biden we have war, despair, inflation, division and the President calling half of America terrorists! Now they are calling for a civil war! Vote republican in the mid-terms and restore sanity to our government!",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "hector25",
        "time": "7 September, 2022",
        "context": "This is what led to Biden winning. They covered most of the crimes committed by Democrats and even their family members. Top example is the Hunter Biden lap top news. ",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "commonsense?016",
        "time": "7 September, 2022",
        "context": "It looks like he doesn't include Fox as corporate media or Peter Theil as big tech.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "koosbotha",
        "time": "7 September, 2022",
        "context": "Stop clutching your pearls in shock and disbelief. Everyone has been repeatedly warned, with examples and facts, for decades all over the western world. Repeatedly.\nAnd the sentinels of sanity were scorned, mocked, vilified and often punished by the system with kangaroo courts, false accusations, and God only knows what.\nYa get the government you deserve. Has anyone learned anything? I hope and pray so. ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "honoramerica",
        "time": "7 September, 2022",
        "context": "Right on!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "catholica424",
        "time": "7 September, 2022",
        "context": "Greenwald gets it. He's a smart and interesting guy.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jswjr579",
        "time": "7 September, 2022",
        "context": "Joseph Goebbels would be sooooo jealous of today's Democrats ",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "americangirl25",
        "time": "7 September, 2022",
        "context": "The thing about censoring speech is, only those not falling in line with the propaganda will be censored.  If you see a fire and they refuse to acknowledge the fire,  it doesn’t mean that there’s not a fire. This is like 1939 Germany. ",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bulldogx79586",
        "time": "7 September, 2022",
        "context": "a thoughtful piece that begins to outline the problem in terms everyone can understand.  the next question is how do we solve it...",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jefferson021782",
        "time": "7 September, 2022",
        "context": "The U.S. as we know it is gone.  Bring on the civil war!  ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "republicansareguilty",
        "time": "7 September, 2022",
        "context": "\"The worst of all - the most repugnant and despicable - are those calling themselves ‘journalists’ while doing the opposite of what that term implies:\nDoesn't Greenwald call himself a journalist?\nAlso, Greg Gutfeld claims he's in \"The News Business\".  He isn't.  He works for a propaganda cable TV network that has \"News\" in its name and is owned by \"News Corp\".",
        "good": "2",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "Wskibnt991",
        "time": "7 September, 2022",
        "context": "Naive, gullible and low information sheep are what liberals depend on",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "chd",
        "time": "7 September, 2022",
        "context": "This has to be fixed or we will be part of the Third World New World Order sooner than they planned.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "nowomennohomos",
        "time": "7 September, 2022",
        "context": "so a man who lies with men as someone lies with a woman is talking about something that is unholy. \nwell.. i guess he ought to know. ",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "stillrightminded",
        "time": "7 September, 2022",
        "context": "\"like 48 hours\"?\nAnd anyone pays attention to that child?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rockrepub",
        "time": "7 September, 2022",
        "context": "Congrats Fox News, best ratings on basic cable which most people under 50 have abandoned. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Tarheel93",
        "time": "7 September, 2022",
        "context": "That is the only true threat to democracy.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "arwald",
        "time": "7 September, 2022",
        "context": "Why does Fox seek the opinions of not only illiterate legal migrants, but gay, Jewish men? ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sausagefingervulgarian",
        "time": "7 September, 2022",
        "context": "Poor, bitter Greenwald.\nHe thinks because he’s not allowed to freely communicate on a particular platform that his free speech rights are being infringed upon.",
        "good": "1",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "fantheflame",
        "time": "7 September, 2022",
        "context": "\"they serve rather than challenge power\" Great statement. The Fourth Estate has melded in with the second Estate, Nobility (money)",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "true-patriot873",
        "time": "7 September, 2022",
        "context": "Amen! The proof is undeniable! Democrats are fascists in word and deed! They use the power of social media, which is run by globalists and leftist, to push their unholy woke ideology. They should be stopped at all costs and by any means necessary!",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ahopfer",
        "time": "7 September, 2022",
        "context": ".There will not be a single non-Democrat sitting at home on election night. The Democrat party alone and after losing the Hispanic vote early last year and many Black voters upset with Liberal lies - will not be able to muster more than 25% of the vote. .",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "miindependent",
        "time": "7 September, 2022",
        "context": "Greenwald makes some interesting arguments and has been critical of both parties. That said he has been banned from most mainstream media outlets so no surprise where he stands. Since Fox already has credibility issues they would be smart to call this an opinion piece. I would urge the right and the left to read his writings and articles but this is not a news article. ",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "ahopfer",
        "time": "7 September, 2022",
        "context": ".The very last thing that the Liberal media wants is to have Republicans in control of Congress and the Investigation committees from Both Houses. However, THAT is what they are going to get. The FBI feared Trump had attorney information of evidence against the Justice system and raided for it .",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Bogey204",
        "time": "7 September, 2022",
        "context": "I've switched from Youtube, FB, and Twitter to Rumble, Mewe, and Parlor. Not a dent in the big three, but I'm doing my part.  ",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cct001",
        "time": "7 September, 2022",
        "context": "He forgot China.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jiminauburn965",
        "time": "7 September, 2022",
        "context": "I dared to say that trans is a medical disorder called gender dysphoria in the DSM-5, on Twitter.  They suspended me until I delete the tweet.  You are not even allowed to post facts.  I will not delete the tweet, and I am done with twitter.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "T-Spoon763",
        "time": "7 September, 2022",
        "context": "**Sigh** If only we had the right and ability in this country to create our own tech startups, amirite? Better break up all the Big Tech monopolies! [Wait, isn't monopolies an oxymoron?]",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jesssayin",
        "time": "7 September, 2022",
        "context": "Greenwald is a true courageous patriot of a kind that closeminded liberal Democrats, who never learned to think for themselves, will never understand!  Leo 2.0 is also in the same category.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Racor",
        "time": "7 September, 2022",
        "context": "Baloney. Project Veritas proved that Twitter employees are \"Communist AF\" in their own words.  The government is not coercing Twitter to do its bidding. ",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "VegasFan46",
        "time": "7 September, 2022",
        "context": "Let the truth be told!!",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "BgFlorida",
        "time": "7 September, 2022",
        "context": "Greenwald lays it all out there.   It’s about time these dishonest “journalists“ were called out for their role in censoring dissenting voices.  The American people need to wake up and refuse to tolerate this blatant attempt to restrict their voice in the public square.  ",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "VegasFan46",
        "time": "7 September, 2022",
        "context": "Let the truth be told!!",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "zebhead47",
        "time": "7 September, 2022",
        "context": "A media that are experts at influencing thoughts and behaviors coupled with a populace that is growing dumber by the day is a dangerous combination for a free society. The country needs a serious reboot before we go blue screen. ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "peekingduck",
        "time": "7 September, 2022",
        "context": "As long as liberals own the television they own the culture. If we are to win this very real Civil War we find ourselves in, we MUST win control over the culture.  \nWhat we are doing now isn't working. My grandkids think there's something wrong with our family because we don't let them go to Disney world or watch shows with liberal themes or visit liberal cities or use Chinese spy apps like Tiktok. Instead of appreciating the fact that we are trying to keep them from indoctrination they instead became resentful and think WE are the wrong ones because they think they are missing out on the things their worldly friends experience. \nThis is a problem.  We can't boycott our way out of this. We need to take the fight to these institutions and FORCE them to give up liberal policies so we can partake once again. Otherwise these media and entertainment conglomerates will surround us so completely with normalized deviance that we will never be able to even let our children out of the house.  I never wanted to raise a family of Amish and if we don't take control of the culture back becoming the new Amish is what Conservatives everywhere will be facing. ",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "docyoung880",
        "time": "7 September, 2022",
        "context": "Like I’ve been saying… This well orchestrated. DNC, media, big tech, then throw in Soros buying local DA campaigns. This amounts to the most divisive environment ever. ",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sidneyriley",
        "time": "7 September, 2022",
        "context": "Glenn Greenwald is a rarity.  A liberal who is also a true civil libertarian.  I would say the same of Jonathan Turley.  Guys like Greenwald and Turley are an endangered species.  ",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "magatastic",
        "time": "7 September, 2022",
        "context": "an over-inflated government conspiring with mega-corporation.  the very definition of FACISM, before webster changed it a few years ago...  ",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jmomma",
        "time": "7 September, 2022",
        "context": "Didn't \nH\nI\nT \nLER do the same thing the dems are doing now???",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "hillsrider",
        "time": "7 September, 2022",
        "context": "Ben Collins would have fit in nicely back in the 30s, would have needed to speak German though. ",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ppt",
        "time": "7 September, 2022",
        "context": "I have been saying this for a while now.  In a communist nation, the government, controls the media, law enforcement, and corporations - this is and has been the dems objective since Obama.  Trump just delayed the progress a few years.  I hopefully will not live long enough to see their communist plans come to fruition.  If you think Russia, China, and Venezuela have good governments - then vote democrat - that is what they are aspiring to.",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "food4thot",
        "time": "7 September, 2022",
        "context": "It's  called state controlled media.  Banana republic!  ",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "kyle2112",
        "time": "7 September, 2022",
        "context": "These 5 corps own over 90% of all media in the USA:\nAT&T =  CNN, Time Warner, HBO and others\nDisney =  ABC, ESPN, Pixar, Lucas Films and others\nNational Amusements =   CBS, Paramount, BET, MTV and others\nNews Corp =  Fox, WSJ, Sky News, NY Post and others\nComcast =  NBC, MSNBC, USA, Universal studios and others",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "xyzabcd",
        "time": "7 September, 2022",
        "context": "The plutocrats are attacking us.\nThey have done it throughout history. \nNow their tactics involve technology.\nBut, our resistance to enslavement can also involve technology.\nThe battle against the plutocrats is not over, not by a huge degree.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "independent-voter-666",
        "time": "7 September, 2022",
        "context": "Mainstream news, government & social media have always been in bed together; it is why they want abortions? To not get caught!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "seaden",
        "time": "7 September, 2022",
        "context": "\"Journalist Glenn Greenwald scorches unholy alliance of government Democrats, corporate media and Big Tech\"\nNice to see an honest liberal journalist speak up in spite of the backlash and harassment he no doubt will be subjected to. ",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "freedomandjusticeforall116",
        "time": "7 September, 2022",
        "context": "The dems knew the red wave was coming and why, so they collaborated with all levels of government, big tech and the media to manufacture events that would take away from the attention that was squarely on how badly they were performing.  Again, very effective when you have this type of control.  They didn't get their Ministry of Truth - turns out they did it anyway. ",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rationality?",
        "time": "7 September, 2022",
        "context": "Oh, the irony of right wingers decrying censorship while banning books.",
        "good": "1",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "Badgeaneer",
        "time": "7 September, 2022",
        "context": "Any nexus that forms between government-pharma, government-media should be highly suspect by an informed electorate. ",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cestmoi024",
        "time": "7 September, 2022",
        "context": "Unfortunately, FOX will squelch any criticism of corporate greed, collusion with political street walkers, or just any question of its \"right\" to poison your brain with their \"facts\", liberal or conservative. Remember: The FOX game is MONEY, not TRUTH.",
        "good": "1",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "jmomma",
        "time": "7 September, 2022",
        "context": "CNN heads are finally rolling  ",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ahopfer",
        "time": "7 September, 2022",
        "context": ".The Democrats strategy. Demand that the media portray Republicans to exactly what the Democrats have been  since 2018.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jelcik",
        "time": "7 September, 2022",
        "context": "Democrats have no heart.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "kyle2112",
        "time": "7 September, 2022",
        "context": "Fox is part of it btw. ",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "gabriel07070",
        "time": "7 September, 2022",
        "context": "BEWARE OF BIDEN & HIS SOCIALIST ENABLERS! Many years ago, the world suffered through another Biden ego type called Adolf. His (\"anti\") speeches ending up sending over 6 million Europeans to barbed-wire camps and what was called \"a final solution\"...! ",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "fixento104",
        "time": "7 September, 2022",
        "context": "He's only scratched the surface of the collusion to direct Americans opinions and thoughts through the media.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "kyle2112",
        "time": "7 September, 2022",
        "context": "“The smart way to keep people passive and obedient is to strictly limit the spectrum of acceptable opinion, but allow very lively debate within that spectrum – even encourage the more critical and dissident views.” ~ Noam Chomsky",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "realitycrasher",
        "time": "7 September, 2022",
        "context": "Uh... don't lie and you'll have no problem ",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "m1419montana",
        "time": "7 September, 2022",
        "context": "We are Americans. We do not believe in a Dictatorship. We are Freedom Born, and we like living free.",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "bmst25",
        "time": "7 September, 2022",
        "context": "Greenwald has been a liberal his entire life. Now, he cannot stand them because liberals lost their way and there is absolutely no hope they are going to find it back. ",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "brockton-by-the-sea",
        "time": "7 September, 2022",
        "context": "As flawed as Fox and Newsmax are, they are two of the very few alternatives to the Official State Media.  Keep them in your prayers. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Once-I-was-blind",
        "time": "7 September, 2022",
        "context": "Glenn is spot on!",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "the_people",
        "time": "7 September, 2022",
        "context": "Rev. Rul. 2007-41, 2007-25 I.R.B. (June 18, 2007)\nOrganizations that are exempt from income tax under section 501(a) of the Internal Revenue Code as organizations described in section 501(c)(3) may not participate in, or intervene in (including the publishing or distributing of statements), any political campaign on behalf of (or in opposition to) any candidate for public office.\nAny church that violates this can be reported to the IRS for audit, lose their tax exemption status, receive a fine, and/or shut down. Separation of church and state is not a joke, it's what our country was founded on. Do not allow religious zealots to dictate law.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "soitbegins393",
        "time": "7 September, 2022",
        "context": "Glen Greenwald is right.  Best offense against them is to Speak Out!",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "stolenelection173",
        "time": "7 September, 2022",
        "context": "Freedom of Speech remains but Freedom of the Press doesn't.  ",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "sherlockhomeless169",
        "time": "7 September, 2022",
        "context": "That unholy alliance has allowed our government to bombard us with nonsense that completely defies observable reality--there's no inflation, the vaccines are safe and effective, etc.  It's called gaslighting.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "oldernotwiser643",
        "time": "7 September, 2022",
        "context": "None of what Greenwald stated is wrong. Fact check THAT!",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "deepsouth70463",
        "time": "7 September, 2022",
        "context": "The flippant attitude of the MSM hack being called out for being a tyrant shows how openly hostile the “ so called journalists” class is. They must be ignored and mocked for who they really are propaganda spreaders for the Democrat machine. ",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ZHerbington",
        "time": "7 September, 2022",
        "context": "Ehh I dunno, I log into Twitter and the algorithm shows me a bunch of conservative content they think I'll rage-engage with. Doesn't seem censored at all actually. ",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jtmojave",
        "time": "7 September, 2022",
        "context": "Thank you Jesus for another beautiful blessed day ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "thetruthwillsetyoufree662",
        "time": "7 September, 2022",
        "context": "cry me a river please, trump use twitter just to lie lie and lie ",
        "good": "0",
        "bad": "7",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "LeskoBrandin",
        "time": "7 September, 2022",
        "context": "Liberals are now calling out the scams. The democrat party is collapsing like a full Biden Depends.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rrconsv22",
        "time": "7 September, 2022",
        "context": "Greenwald is 100% Correct, the Collusion between the Liberal Democrats, people like George Soros, Fake News, Social Media, and Big Tech we will probably never see another Fair Election again.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "mathguy702",
        "time": "7 September, 2022",
        "context": "Deflecting Ben, is the first sign of being a willing tool. Good for Greenwald.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "--theoctopus--",
        "time": "7 September, 2022",
        "context": "MAGAts love the free market except when it reflects the fact that MAGAts don't represent enough business to impact the bottom line of twitter",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jdc64",
        "time": "7 September, 2022",
        "context": "Yes the Dem deep state is dangerous. Multiple CNN lead TV analysts emailing Biden in fear about what was happening Jan 6 and then lying and saying the opposite on Air. Spouse of Liberal SC judge sending emails to state officials to try to influence the election. Those corrupt Dem Deep State doing all this is.  Oh wait that was the GOP Deep State! Are you kidding me?   ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ktheman",
        "time": "7 September, 2022",
        "context": "100% correct. As usual the perversives will argue that bad is good in response.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Gullible_Gomer,MAGA",
        "time": "7 September, 2022",
        "context": "Who is Glenn Greenwald?",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "--theoctopus--",
        "time": "7 September, 2022",
        "context": "MAGAts:\ntwitter isn't The Press\nThe Press isn't obligated to present both sides (Thanks Reagan!)\nIf social media companies don't rank your tribe as worth their investment, then the free market will no longer care about you.  Don't like it?  YOU LOVE IT",
        "good": "2",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "solent802",
        "time": "7 September, 2022",
        "context": "This reminds me of the story \" The emperor has no clothes. \"Glenn Greenwald is boy pointing it out.  Good for you Glenn Greenwald. Speaking truth to power is something Democrats fail to do.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "GoldSubmarine",
        "time": "7 September, 2022",
        "context": "Our government has gotten so big and politicians so rich off mega corporations, is there any room at all left for the citizen, who's small voice has been drown out by media? America is no longer the country of liberty and freedom of the individual that it once was. It has become totalitarian and grid locked by the very people that we voted into office. Term limits, and campaign finance reform are the only way back and unfortunately for that to happen the very people that are abusing the system would have to vote that in. ",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "oldgolffart",
        "time": "7 September, 2022",
        "context": "Glenn.who?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "OMGandy",
        "time": "7 September, 2022",
        "context": "Too little, too late…",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bidenisadegenerate",
        "time": "7 September, 2022",
        "context": "Greenwald(liberal) really sees how nuts the far left is.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Yellowstone296",
        "time": "7 September, 2022",
        "context": "The biggest difference is Fox News has a comment section for its readers to agree, disagree, enlighten, inform, disinform,  misinform, contest, troll, or otherwise. Whereas, the other news outlets want to control the whole narrative and offer no such thing which would challenge and keep them in check.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "citizen_jimserac",
        "time": "7 September, 2022",
        "context": "You will notice, as you try to comment or read this excellent article that Fox news slows down quite a bit and may pause while you are typing y our chara cters....\nDo not be so sure that this is entirely a network overload problem, eh ?\nParticularly with less than 500 people viewing.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "OrangePlane",
        "time": "7 September, 2022",
        "context": "The best pic was Joy Reid looking like White Man was on the dinner plate.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cosmoprutkov",
        "time": "7 September, 2022",
        "context": "incidentally, this is the definition of classic fascism (not to be confused with nazism): when all \"pieces\" work in strict unison and do not tolerate any alternative perspective or views - government, party, media, monetary policies, fiscal policies, free speech control, ideological control of younger generation (i.e. kids), and so on.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Don'tLikeBiden?Leave",
        "time": "7 September, 2022",
        "context": "Who?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "xyzabcd",
        "time": "7 September, 2022",
        "context": "Marxism is a fascist ideology.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "adoration836",
        "time": "7 September, 2022",
        "context": "He writes truth………",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "republicansareguilty",
        "time": "7 September, 2022",
        "context": "Greenwald doesn't understand the First Amendment and Republicans oppose it.",
        "good": "1",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "betterredneckthanliberal",
        "time": "7 September, 2022",
        "context": "Remember when the media actually made a pretense of being independent and balanced?",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "1984picnic",
        "time": "7 September, 2022",
        "context": "That’s the definition of Fascism. ",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "lynnlandes",
        "time": "7 September, 2022",
        "context": "So, what do we do?  Stop feeding the beast.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "UltraMAGADeplorable759",
        "time": "7 September, 2022",
        "context": "Nazi = National Socialist German Workers Party\nFascism is socialism with a capitalist veneer.\nWhere socialism abolished all market relations outright, fascism left the appearance of market relations while planning all economic activities.  Where socialism sought totalitarian control of a society’s economic processes through direct state operation of the means of production, fascism sought that control indirectly, through domination of nominally private owners.\n Where socialism nationalized property explicitly, fascism did so implicitly by requiring owners to use their property in the “national interest”—that is, as the autocratic authority conceived it.\nWhere socialism abolished all market relations outright, fascism left the appearance of market relations while planning all economic activities.  Where socialism abolished money and prices, fascism controlled the monetary system and set all prices and wages politically.  In doing all this, fascism denatured the marketplace.  Entrepreneurship was abolished.  State ministries, rather than consumers, determined what was produced and under what conditions.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Down46",
        "time": "7 September, 2022",
        "context": "Is that pinko at the end of article handing out free money trees\nI’ll take one",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "chas00",
        "time": "7 September, 2022",
        "context": "Ben Collins gives himself too much credit. Being mentioned does not put him at the top of the food chain.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "grogersh",
        "time": "7 September, 2022",
        "context": "When you sensor one group the unaffected say nothing till one day when something they care about is silenced.  Then it's too late.  ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "spooker",
        "time": "7 September, 2022",
        "context": "Thank you Mr. Greenwald.  Keep it up.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "One_Eye",
        "time": "7 September, 2022",
        "context": "Well said, as usual, Glenn! ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "--theoctopus--",
        "time": "7 September, 2022",
        "context": "poor cons.\nstop whining and run to Truth Social.\nbusinesses don't have to take your business",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "EdwardDevotion",
        "time": "7 September, 2022",
        "context": "Greenwald nails it. Too many, too easily succumb to the manipulation.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "pres_monkeyfist",
        "time": "7 September, 2022",
        "context": "No such thing as Journalism anymore.  Only paid propagandists working for companies political cause of the day.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "xyzabcd",
        "time": "7 September, 2022",
        "context": "China is governed by fascists.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jross45",
        "time": "7 September, 2022",
        "context": "I think it's funny that \"big tech\" has to 'de-platform / cancel' offenders of the narrative rather than just publish the narrative whenever someone violates feelings.  That would be TRUE Free Speech. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "daves",
        "time": "7 September, 2022",
        "context": "MAGAs are addicted to Big Tech.  Instead of using Truth Social, they are alllll over Facebook. I thought FaceBook was a \"woke\" platform MAGAs would reject.  Not at all.  They love it.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "PurpleTag",
        "time": "7 September, 2022",
        "context": "We are getting closer to the CCP. Only a matter of time before you can get locked up for saying LGB or talk about the diary, or say anything derogatory about the Fearless Leader. Oh, and since the internet is forever, it won't matter when you said it. Even Winnie the Pooh got banned in China.\n ",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "Proud_Deploreable_Forever",
        "time": "7 September, 2022",
        "context": "Don't forget Hollywood and Academia..",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "frankieisnot",
        "time": "7 September, 2022",
        "context": "Like Fox News isn't part of the 'corporate media' empire, and doesn't censor stories. What a crock of nonsense.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "0tothe0powerplus0tothe0power",
        "time": "7 September, 2022",
        "context": "The people running the Big Tech companies, however, are complicit!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Jimmy~Crack~CornPop!",
        "time": "7 September, 2022",
        "context": "Greenwald is RIGHT.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "scor",
        "time": "7 September, 2022",
        "context": "He’s right ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "frank42",
        "time": "7 September, 2022",
        "context": "Disinformation is whatever the dems don't agree with. Been pretty obvious for a while now. ",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "andythelawyer",
        "time": "7 September, 2022",
        "context": "Who cares what dangerous spy Julian Assange's greatest supporter says?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dr.liberty050",
        "time": "7 September, 2022",
        "context": "\"Fascism should more appropriately be called Corporatism because it is a merger of state and corporate power.\" - \nBenito Mussolini",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Politicomask",
        "time": "7 September, 2022",
        "context": "Mr. Trump certainly pointed this out initially claiming \"fake news\". \nIn the beginning, not everyone was convinced of this as in the past journalism was based on facts. \nAs the years have passed it has become increasingly evident he was absolutely correct.\nIn fact, liberal media doesn't even deny it anymore. The facts now need to align with the narrative being pushed.",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "fathomsix364",
        "time": "7 September, 2022",
        "context": "I admire and applaud Glenn Greenwald for his courage.  How many of us have the\ncourage to face the mob ?  Not many.  \nGreenwald's warning is extremely apropos and absolutely crucial.  Our freedoms, not \nonly of speech, but expression of every kind, are gravely threatened by bullies of the Media.  \n.",
        "good": "18",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "xyzabcd",
        "time": "7 September, 2022",
        "context": "Censorship is fascist.  The more Americans who understand that, the better.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "WillBeWild!",
        "time": "7 September, 2022",
        "context": "Free speech does not mean a free platform. All media, including conservative media, are gatekeepers for the stories and narratives they promote. It is their right as business owners in America to manage themselves as they want, and it is consumer's right to support or not support them. ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "citizen_jimserac",
        "time": "7 September, 2022",
        "context": "After taking back congress next November, legislation putting the schmertz on big tech censorship is essential.\nDuring the Covid-19 epidemic, I posted numerous times mentioning RFK Jr's. then forthcoming book on Fauci, \"The Real Anthony Fauci\".   I also mentioned that Sweden seemed to have made out no worse than other European nations even though Sweden did not have any lockdowns.\nThose two opinions were sufficient to get me PERMANENTLY BANNED FROM THE \"CIVIS\" NEWSGROUP OF ARSTECHNICA.\nSo be it.\nI also posted a pro Ivermectin comment on Twitter and the next day changed my password.  To this day I cannot get back. into Twitter.  Neither the old nor the new password works and I can't succeed in the \"forgot my password\" because it won't accept my u. er name or email.   The account remains there de facto suspended.\nThat is what we must gain the upper hand about and it can only be done through legislation from CONGRESS.\nIf allowed to continue, it's BAD NEWS for every citizen.",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "wildwonderful482",
        "time": "7 September, 2022",
        "context": "Rock on !!!",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "reedmore",
        "time": "7 September, 2022",
        "context": "Why isn't he complaining about the unholy alliance of the:\nConservatives -->Wall Street--> Oil Companies --> Military Industrial Complex ?  Far more corruption, trillions of taxpayer dollars syphoned off by special interests and damage to the US.",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "mirsh327",
        "time": "7 September, 2022",
        "context": "Normal people typically are in  opposition to the government. Those who support government are usually crooks and fascists.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Jayb2020",
        "time": "7 September, 2022",
        "context": "Americans need to wake up quickly. ",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "humble_ragamuffin",
        "time": "7 September, 2022",
        "context": "Two parts inquisition + one part fascism = 21st century liberalism",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "CORNPOP-made-B-my-Bi+ch",
        "time": "7 September, 2022",
        "context": "It's all about the money!  Sooner or later someone will talk about the secret handshake and it will all come crumbling down. ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "patriot4ever081",
        "time": "7 September, 2022",
        "context": "It is obvious that the Free Press no longer reports or even remotely tries to address Truth or Facts. They have become a extension of the Democrat Party and a Mouth Piece for their agenda. The real problem is, too many Americans tune into them and only them to get their news. They sow deceit and lies to their sheep who buy into it all. Citizens will not know what they have lost until it's gone and by then it will bee too late. ",
        "good": "3",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "Think4urselves",
        "time": "7 September, 2022",
        "context": "The trouble with our country is not that we know to little, it is they know so many things that just are not so.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ItsSocko915",
        "time": "7 September, 2022",
        "context": "If Twitter was censoring people, wouldn't they censor this guy posting on Twitter about it?",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "okiegal",
        "time": "7 September, 2022",
        "context": "As \"fascism\" has become a popular insult thrown around by Democrats and their compatriots in the media to discredit political opposition, Greenwald used its actual technical definition to call them out for trying \"to unite state and corporate power to censor their critics and degrade the internet into an increasingly repressive weapon of information control.\"\nThe true meaning of fascism is actually the very thing the DIMS are guilty of,  it is an apolitical philosophy, movement, or regime (such as that of the Fascisti) that exalts nation and often race above the individual and that stands for a centralized autocratic government headed by a dictatorial leader, severe economic and social regimentation, and forcible suppression of opposition. We have a true dictatorial leader in OBiden, who wants to control and force his left socialist agenda on everyone (Climate control anyone!)  and a very forceful suppression of anyone who disagrees with their philosophy (facebook and twitter ringing any bells!. With the truth finally coming out as to just how and who told FB to target conservatives it should scare anyone who stand for our constitution and just how far we have fallen in the last 20 months! ",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "leftbutalwaysright",
        "time": "7 September, 2022",
        "context": "Wait. There are plenty of other alternatives like Truth Social, 8chan, 4 chan, Facebook,  Infowars, Breitbart where misinformation spreads like wildfire and causes a lot of unnecessary social conflict. His argument is that it is less popular. Most people don’t rely on them because they are less credible, but they exist",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tadead",
        "time": "7 September, 2022",
        "context": "Herr Bidenfuhrer supporters are the enemies of America.\nIt really is just that simple.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "callib",
        "time": "7 September, 2022",
        "context": "Criticizing Democrats in the United States while living in Brazil does not hold much sway with me. Especially with his obvious reluctance to do the same with the Big Lie Republicans. So much for middle of the road journalism.",
        "good": "1",
        "bad": "3",
        "replies": []
    }
]