[
    {
        "user_name": "allyourbasearebelongtous",
        "time": "15 September, 2022",
        "context": "Hillary Clinton colluded with Russians and the Obama Administration weaponized US intelligence services and the FBI to interfere with a presidential election. This is a direct violation of the Espionage Act, and is tantamount to treason.",
        "good": "37",
        "bad": "0",
        "replies": [
            {
                "user_name": "scodd",
                "time": "15 September, 2022",
                "context": "I see you are ignoring the Greek Lad, who two months before knew the Russians had hacked the Democratic computers. Turns out he was talking to RUSSIAN SPIES. Why do you ignore this?",
                "good": "0",
                "bad": "8",
                "replies": [
                    {
                        "user_name": "jimmw1",
                        "time": "15 September, 2022",
                        "context": "and the sun has warmed the rock sufficiently from under which the preferred pronoun troll emerges... But, but Trump/MAGA/Republicans!!! 3..2..1 🤣🤣🤣🤣",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "foxisgreatamericannews",
                        "time": "15 September, 2022",
                        "context": "Every teenager in America hacked the DNC the chairman used”password” as his password? I think the democrat controlled FBI said numerous foreign countries and individuals. A better question is who didn’t? Democrat incompetence doesn’t stop at illegally spying and trying to plant fake evidence on Trump",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "Rascal69269",
                        "time": "15 September, 2022",
                        "context": "You seem to be ignoring Hillary Cli ton’s involvement in this entire scheme?  Why?",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "accountability091",
                "time": "15 September, 2022",
                "context": "THE MSM is as guilty!",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "Acloserlook",
        "time": "15 September, 2022",
        "context": "So then, there was no Trump Russia collusion, but there was Clinton FBI Russia collusion.  If true then lock her up and prosecute those FBI deep state colluders.",
        "good": "9",
        "bad": "0",
        "replies": [
            {
                "user_name": "22889964",
                "time": "15 September, 2022",
                "context": "James Comey",
                "good": "2",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "razorback5",
        "time": "15 September, 2022",
        "context": "Now who was obstructing justice from this revaluation it was not trump but Hillary herself after all who had the connections to make this happen?",
        "good": "37",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "whyjoe",
        "time": "15 September, 2022",
        "context": "Our country is horribly broken, Americans have always distrusted  congress, for good reasons but now it has been clear that our government institutions are not what we  all believed them to be. ",
        "good": "49",
        "bad": "1",
        "replies": [
            {
                "user_name": "jimb",
                "time": "15 September, 2022",
                "context": "Don't be so gullible,Republicans are using fear to keep you sheep in line lol",
                "good": "2",
                "bad": "16",
                "replies": [
                    {
                        "user_name": "marko1776",
                        "time": "15 September, 2022",
                        "context": "Great! So everything is just peachy now, no high fuel prices and no inflation. Thank goodness I was concerned for a moment there.",
                        "good": "1",
                        "bad": "1",
                        "replies": [
                            {
                                "user_name": "jimb",
                                "time": "15 September, 2022",
                                "context": "Yes things are good,sorry if you made bad choices and can't afford things,WORK FOR IT.",
                                "good": "0",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "marko1776",
                                        "time": "15 September, 2022",
                                        "context": "Thought you folks on the left were big on sharing the wealth.",
                                        "good": "1",
                                        "bad": "0",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "calife968",
        "time": "15 September, 2022",
        "context": "Sounds like the FBI is working for Russia",
        "good": "31",
        "bad": "0",
        "replies": [
            {
                "user_name": "dosie",
                "time": "15 September, 2022",
                "context": "Worse. The FBI is working for the Democrats and the spread of their propaganda .  We have been taken over by the Democrat elites.  We are no longer the United States of America!",
                "good": "9",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "cccollo",
        "time": "15 September, 2022",
        "context": "The trust is completely broken and I doubt if we can ever get it back. The government has gotten so vast and devious with  manipulation  and stealthy dealings is a matter of norm for them. We knew it existed, but the left has taken into a different realm.",
        "good": "61",
        "bad": "2",
        "replies": [
            {
                "user_name": "chappaquiddickdrinker",
                "time": "15 September, 2022",
                "context": "Only two days after the story broke. Thanks Fox…\n\nYes, fbi is a scary group.",
                "good": "2",
                "bad": "1",
                "replies": []
            },
            {
                "user_name": "brad696",
                "time": "15 September, 2022",
                "context": "How will the election be manipulated come November? The FBI is already trying to bring down the evil \"My Pillow\" guy. Trump is one thing but I thought the \"my Pillow\" probably squeaked when he walked.",
                "good": "15",
                "bad": "1",
                "replies": []
            },
            {
                "user_name": "bknightalwaystriumphs",
                "time": "15 September, 2022",
                "context": "Into a realm where the right's criminality has been exposed.\n\nHow about the 20 year investigations into the Clinton's.   Almost literally a billion dollars in investigations from Ken Starr to John Durham left us with nothing other than an indiscretion with a young intern.   \n\nWhere is Durham's mug?   LOL.   You folks won't be seeing him any longer.   But he did what Trump wanted, got you frothing in outrage.",
                "good": "1",
                "bad": "8",
                "replies": [
                    {
                        "user_name": "getreal319",
                        "time": "15 September, 2022",
                        "context": "Deflection 101",
                        "good": "4",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "22teresa",
        "time": "15 September, 2022",
        "context": "So. Bottom line…when and who is going to jail (for a long time)?",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "CMAG🇺🇸",
        "time": "15 September, 2022",
        "context": "Apparently the only people Not  involved in the Russian Collusion were Trump and the Russians!  ",
        "good": "59",
        "bad": "0",
        "replies": [
            {
                "user_name": "CMAG🇺🇸",
                "time": "15 September, 2022",
                "context": "How Deep is the Swamp? ",
                "good": "9",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "will1174",
                "time": "15 September, 2022",
                "context": "100%",
                "good": "7",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "scodd",
        "time": "15 September, 2022",
        "context": "Once again, people who know better ignore that Anti-Trump Republicans first financed the Steele Dossier. They want to dump the entire affair on the Democrats, but it is a tad unfortunate that FOX itself published this information long ago. Pity Turley does not read FOX, eh?",
        "good": "0",
        "bad": "8",
        "replies": [
            {
                "user_name": "brad696",
                "time": "15 September, 2022",
                "context": "Rinos might have scratched the surface but the FBI and Democrats knocked it out of the park.",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "CIA1980956",
                "time": "15 September, 2022",
                "context": "you are confusing that a couple republicans hired Fussion GPS to research Trump, which is standard fare during political campaigns (primaries). Insider Republicans were in a panic (and still are) about an outsider blowing up what took them decades to build. It wasn't the Republicans who sought out Democrats to take over the funding once they were done. It was Fussion GPS that sought out another buyer for the research already done and continue funding more research, which turned out to be a big scam.",
                "good": "2",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "doogiehowitzer",
                "time": "15 September, 2022",
                "context": "yes anti-Trump Repubs started the process...but dropped it when they saw where it was going (i.e. Russian disinformation) and Clinton and the FBI picked it up and used it to get FISA warrants to spy on American citizens and to allow many millions of taxpayer dollars to be used to investigate Russian Collusion and then impeach Trump...the entire time the FBI and Clinton and most Democrats knew none of it was true",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "notwokeyet776",
                "time": "15 September, 2022",
                "context": "Looking forward to your reply to doogiehowitzer's reply to you ,below,  that totally discounts your statement.",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "Wild_Squirrel",
                "time": "15 September, 2022",
                "context": "🤣😂🤪😂💩💩",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "Suzieq1972",
                "time": "15 September, 2022",
                "context": "And once again, people know that group stopped early on and Clinton took over.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "endymio",
        "time": "15 September, 2022",
        "context": "As we long suspected, Russian disinformation did influence the 2016 election -- but to help Hillary, and hurt Trump.",
        "good": "62",
        "bad": "1",
        "replies": [
            {
                "user_name": "czechster625",
                "time": "15 September, 2022",
                "context": "It was not Russian disinformation, it was made up by Hillary Clinton and her Cabal.  Russia has no part in this.  See the Durham Report.",
                "good": "1",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "22889964",
        "time": "15 September, 2022",
        "context": "So FBI again in the middle of a political attack",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "122bissett$",
        "time": "15 September, 2022",
        "context": "This is all taking way to long ....... and in interim Hillary & Dnc are found not responsible?? They r the core sources",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "prousa4all",
        "time": "15 September, 2022",
        "context": "And we wont see a single truthful word about this growing scandal on CNN, MSNBC, CBS, ABC, NBC, WAPO, NYT, PBS LA TIMES, ETC ETC",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "vulcans",
        "time": "15 September, 2022",
        "context": "How many paid FBI operatives organized Januay 6?",
        "good": "14",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "CIA1980956",
        "time": "15 September, 2022",
        "context": "I have seen reporting that the FBI paid this Russian for over 2 years. The FBI agents need to explain what information they were getting to justify these payments. It seems like the FBI was hiding a witness from Congress and the media - that is what they paid for.\n\nWhere is the DOJ inspector general when you need him?",
        "good": "7",
        "bad": "0",
        "replies": [
            {
                "user_name": "snoopyeee556",
                "time": "17 September, 2022",
                "context": "Somehow his name never appeared during the investigation nor in Muellers report.\nJust an oversite I am sure by DOJ management and FBI investigators working under Mueller.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "Musicmaker673",
        "time": "15 September, 2022",
        "context": "And not one person has gone to jail. Until there is accountability for the fraud and conspiracy, the FBI will not be trusted by at least half the country. If Durham cant come up with meaningful convictions, the FBI is doomed.",
        "good": "41",
        "bad": "0",
        "replies": [
            {
                "user_name": "tomdahl",
                "time": "15 September, 2022",
                "context": "He’ll never get a conviction in DC.",
                "good": "3",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "lj307",
                        "time": "15 September, 2022",
                        "context": "And not because he can;t prove his case, just no one there will vote to convict their fellow crooks.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "WileECoyote86",
                        "time": "15 September, 2022",
                        "context": "The trial should be moved to Montana or Idaho.  A change of venue is warranted.",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "lj307",
                "time": "15 September, 2022",
                "context": "Durham will be able to prove his cases, but no one inside the beltway will ever vote to convict one of their own.",
                "good": "7",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "studlymeganuts2",
                "time": "15 September, 2022",
                "context": "Can’t convict a progressive liberal democrat in DC. Michael Sussmann is proof of that. Even his own defense attorney admitted that Michael lied to the FBI in his closing arguments, but the jury full of Hillary supporters (including Michael’s friend who’s daughters play on the same ball team) refused to convict.",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "ahopfer",
        "time": "15 September, 2022",
        "context": "The entire left hates Trump because he called them on their game - 100% on the nose. Which leads me to suspect the 2020 election  was rigged by the Liberal media, FBI, Twitter, FB and let's throw Obama in there.",
        "good": "14",
        "bad": "0",
        "replies": [
            {
                "user_name": "snoopyeee556",
                "time": "17 September, 2022",
                "context": "He is the source of their headlines and propaganda every day and the brainwashed drones take it all in and hate people based on what they are fed every day.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "Mowerman:",
        "time": "15 September, 2022",
        "context": "It’s looks like the only ones who were not involved in Russian Collusion are Trump and the Russians.",
        "good": "28",
        "bad": "1",
        "replies": [
            {
                "user_name": "ahopfer",
                "time": "15 September, 2022",
                "context": "I believe Trump's first visit with Putin made that very point.",
                "good": "4",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "tigers31",
                        "time": "15 September, 2022",
                        "context": "like Obama licking Putin's ear saying i will have more leeway when I am in my second term? That kind of message?",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "jimb",
                "time": "15 September, 2022",
                "context": "Trump definitely guilty of collusion but was saved by spineless Republicans, sorry but that's a fact",
                "good": "1",
                "bad": "10",
                "replies": [
                    {
                        "user_name": "GMan215",
                        "time": "15 September, 2022",
                        "context": "That’s not a fact but i can understand you feeling sorry for your corrupt DNC MSM & Dem party . Your part of the corruption spewing lies ",
                        "good": "4",
                        "bad": "1",
                        "replies": [
                            {
                                "user_name": "jimb",
                                "time": "15 September, 2022",
                                "context": "Sorry but yes it is a fact,I bet you think O.J is innocent also lol,gullible sheep.",
                                "good": "0",
                                "bad": "1",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "user_name": "ahopfer",
                        "time": "15 September, 2022",
                        "context": "Mueller Report, US Department of Justice, Charges, Section 1, page 9.\n.\n\nSecond, while the investigation identified numerous links between individuals with ties to the Russian government and individuals associated with the Trump\nCampaign, the evidence was not sufficient to support criminal charges.\n\nFurther, the evidence was not sufficient to charge that any member of the Trump Campaign conspired with representatives of the Russian government to interfere with the 2016 election",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "ahopfer",
        "time": "15 September, 2022",
        "context": "If you don't read the news paper, you are uninformed.\nIf you do read the news paper, you are misinformed.",
        "good": "7",
        "bad": "0",
        "replies": [
            {
                "user_name": "1pingyes2pingsno",
                "time": "15 September, 2022",
                "context": "Now I know why my parrot spends so much time on the floor of his cage. He wants to be misinformed.",
                "good": "6",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "Simpleman85",
        "time": "15 September, 2022",
        "context": "So, here is the weird part.  How much are they, those involved in the fabrication of the Russian collusion story, willing to risk?  How far do they feel they can go?  The FBI is a relatively small organization to look to put their boot on the neck of America.  Most LEO’s at state a local level would not partake in “putting the citizenry down”. The same with the military.  Most of these people have family members that they don’t agree with politically, but they are certainly not going to enforce some draconian command from the federal government on others when they don’t want it enforced on their own family.  So what is the end game?  How far does the left think they can go fabricating false narrative to force change on a country few want?",
        "good": "8",
        "bad": "0",
        "replies": [
            {
                "user_name": "97yukon",
                "time": "15 September, 2022",
                "context": "Excellent point. Well stated",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "jimb",
        "time": "15 September, 2022",
        "context": "Turley will say anything fox wants him to,what a hack.",
        "good": "0",
        "bad": "11",
        "replies": [
            {
                "user_name": "notwokeyet776",
                "time": "15 September, 2022",
                "context": "Maybe, but is he wrong?",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "thenonna",
                "time": "15 September, 2022",
                "context": "That’s what you want to believe! You’re so brainwashed you can’t see straight!",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "joser14",
        "time": "15 September, 2022",
        "context": "How do you live with yourself after saying that?  The Durham inquiry is pretty much over with one minor conviction.",
        "good": "0",
        "bad": "7",
        "replies": [
            {
                "user_name": "sappermac72",
                "time": "15 September, 2022",
                "context": "Who said it was over?",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "joser14",
                        "time": "15 September, 2022",
                        "context": "The grand jury has expired and there isn’t any reason to have a new one.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "AOCwantstodateme😬😬😬",
        "time": "15 September, 2022",
        "context": "Sadly our government is the most corrupt criminal family in the history of the world. They make Al Capone look like Mother Theresa. The left is driving the country straight into CWII and the Chinese are sitting back waiting to clean up the scraps.",
        "good": "10",
        "bad": "0",
        "replies": [
            {
                "user_name": "Kennyt488",
                "time": "15 September, 2022",
                "context": "the democrats need to be tried for racketeering when the Republicans take over.",
                "good": "2",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "snoopyeee556",
                "time": "17 September, 2022",
                "context": "They put people in legal jeopardy for the very things they themselves are guilty of.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "gold381",
        "time": "15 September, 2022",
        "context": "When is anyone going to be charged for this debacle?  sad that Americans are now seeing how corrupt Washington is",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jimbatture",
        "time": "15 September, 2022",
        "context": "The FBI is corrupt on this issue what else have they done!",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rrpost",
        "time": "15 September, 2022",
        "context": "How in the world is Christopher Wray NOT in prison!!!",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "1pingyes2pingsno",
        "time": "15 September, 2022",
        "context": "So the FBI and HRC conspired to bring down a serving American President. There are laws against that sort of behavior, however is there no justice to deal swiftly with these subversive miscreants?",
        "good": "7",
        "bad": "0",
        "replies": [
            {
                "user_name": "snoopyeee556",
                "time": "17 September, 2022",
                "context": "Dont leave out the DOJ.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "Clap8",
        "time": "15 September, 2022",
        "context": "Seems like Hillary and the Democrats were the ones colluding with the Russians to rig the 2016 election, no? Clearly they didn't stop with the 2016 election. The \"big lie\" is that there weren't some serious inproprieties by the Democrat Party and conspiring with Big Tech and mainstream media to manipulate the outcome of the 2020 election. Democrats will stop at nothing to cheat our systems and establishments to have power. ",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "NMForFreedom",
        "time": "15 September, 2022",
        "context": "Yet not one of the Crooked wrong doers will ever be brought to justice.  Hillary Clinton, Shifty Schiff, Eric Swalwell aka (swallows well), Nadler, Schumer or Peosi will never see the prison cells they should all be locked up in!",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "OldTimeRepublican",
        "time": "15 September, 2022",
        "context": "Durham investigation ends after three years of searching, $40 million spent, and nothing found",
        "good": "2",
        "bad": "6",
        "replies": [
            {
                "user_name": "tigers31",
                "time": "15 September, 2022",
                "context": "pocket change of the 6 years leftist investigations of trump.",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "sappermac72",
                "time": "15 September, 2022",
                "context": "I must have missed the part that said his investigation ended. Though I expect it will be shut down by the DOJ pretty soon. If he is allowed to continue he'll zero in on certain people who consider themselves above the law.",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "GMan215",
                "time": "15 September, 2022",
                "context": "Yeah I’m sure he’s getting a lot of cooperation from the Doj  & FBI ",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "deminsanity",
        "time": "15 September, 2022",
        "context": "The Durham Investigation needs to be expanded and put on the fast track, to see whom and just how far democratic tentacles reached into these..supposedly fair and neutral agencies",
        "good": "17",
        "bad": "0",
        "replies": [
            {
                "user_name": "brucebruechner369",
                "time": "15 September, 2022",
                "context": "Three years and millions of dollars spent investigating this Trump fantasy  and a big fat nothing.",
                "good": "2",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "canyon12025",
        "time": "15 September, 2022",
        "context": "The FBI and DOJ have been on the Democrat payroll a long time. The sole mission of the FBI and the DOJ is to \"Get Trump.\" Everyone knows this, yet every day in every vile and devious way, the FBI and the DOJ continue their assigned mission to \"Get Trump!\" America is being violated and destroyed right in front of our eyes and no one is doing anything! How can that be in America?",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ahopfer",
        "time": "15 September, 2022",
        "context": "I strongly suspect that Pelosi entrapped the Jan 6th protesters.",
        "good": "10",
        "bad": "0",
        "replies": [
            {
                "user_name": "billyc.",
                "time": "15 September, 2022",
                "context": "Pelosi formed the J6 Committee which is conducting Stalin Show Trials, persecuting innocents.",
                "good": "2",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "lj307",
        "time": "15 September, 2022",
        "context": "And not a single DEM will go to jail, or even lose credibility with their lemming followers...  good thing the FBI and DOJ are non-political.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "spartacus311",
        "time": "15 September, 2022",
        "context": "Wasn’t there 51 FBI agents who swore to the validity of the Russian conspiracy? You now have to question the FBI’s motivation.",
        "good": "39",
        "bad": "1",
        "replies": [
            {
                "user_name": "foxisgreatamericannews",
                "time": "15 September, 2022",
                "context": "Democrats they corrupt everything they touch",
                "good": "2",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "Rascal69269",
                "time": "15 September, 2022",
                "context": "FBI and CIA intelligence personnel.  They should all be summarily charged, indicted and convicted whereupon any benefits they are receiving from the U.S. Government would be immediately terminated….period.",
                "good": "1",
                "bad": "1",
                "replies": []
            },
            {
                "user_name": "jimb",
                "time": "15 September, 2022",
                "context": "Trump was guilty.",
                "good": "0",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "spartacus301754",
                        "time": "15 September, 2022",
                        "context": "Apparently not",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "childs7770",
                        "time": "15 September, 2022",
                        "context": "Nonsense, everything points to the Democrats.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "txgal4ever",
                "time": "17 September, 2022",
                "context": "Don't forget Adam Schiff had .....\"Absolute proof\"",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "silencedogood44",
        "time": "15 September, 2022",
        "context": "The FBI is an arm of the Democratic Party - Not of the US as they are supposed to be.  As soon as the Dems are voted out of control of the House and Senate, the FBI brass need to be fired and tried.  If the Dems stay in power and have their private army to persecute all of their foes, then the country is doomed.  We will be forced to become a socialist province of the One World Government.  We need to find a way to stop the traitors.",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "zeke13",
        "time": "15 September, 2022",
        "context": "The coup of a sitting president is usually considered as treason!",
        "good": "6",
        "bad": "0",
        "replies": [
            {
                "user_name": "truebeliever999",
                "time": "15 September, 2022",
                "context": "Uh... What now? 😂",
                "good": "0",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "googleogle746",
        "time": "15 September, 2022",
        "context": "So what we have here is the FBI involved in election fraud! Plain and simple! Hillary and the FBI were the ones colluding! You see the depth of the deep state here?",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bulldogx79586",
        "time": "15 September, 2022",
        "context": "until someone BIG goes to jail for this or the Hunter Biden activities, weak minded democrats will have plausible deniability and will continue to vote blue",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "fox98.6",
        "time": "15 September, 2022",
        "context": "The Russia probe was a natural occurrence, the Steele Dossier was written by bats and pangolins.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "garysinc",
        "time": "15 September, 2022",
        "context": "The truth will set you free!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Meb",
        "time": "15 September, 2022",
        "context": "Everybody, up and down the chain, needs to fired.  And the government must ask Mueller to refund all money he was paid for his work.  It was a bogus investigation.  They all knew it.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ReadyOnTheRight?-ReadyOnTheLeft?",
        "time": "15 September, 2022",
        "context": "It's been six years.      I don't think  \"anyone\"  wants the whole story told.    Including the investigators.",
        "good": "2",
        "bad": "1",
        "replies": [
            {
                "user_name": "dividedwefall136",
                "time": "15 September, 2022",
                "context": "I am not guilty of anything about this so I would love to see the whole story.",
                "good": "2",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "ReadyOnTheRight?-ReadyOnTheLeft?",
                        "time": "15 September, 2022",
                        "context": "Are you one of the rich and powerful elites?",
                        "good": "1",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "dividedwefall136",
                                "time": "18 September, 2022",
                                "context": "No. Just a member of the Silent Majority who believes in one set of laws and justice for everyone",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "user_name": "dividedwefall136",
                        "time": "18 September, 2022",
                        "context": "^,$^*$^*$?^$?^'",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "yfreddig",
        "time": "15 September, 2022",
        "context": "I'm 75 and extremely disappointed in the FBI.  When I was a kid I watched the Spin & Marty episodes that explored the good things that agency did.  I say did.  Today, instead of going after the drug cartels they're a bunch of partisan hacks interfering with elections.  Sad.  Very sad.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jonnyroy",
        "time": "15 September, 2022",
        "context": "\"What difference, at this point, does it make?\"  [HRC]",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "1bdsnobrdr",
                "time": "15 September, 2022",
                "context": "Establishes lack of integrity/candor of the FBI!",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "backhomesc",
        "time": "15 September, 2022",
        "context": "States run by sane people should sever their dealings with the FBI and announce why. Because it’s corrupt.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "foxisgreatamericannews",
        "time": "15 September, 2022",
        "context": "1000x worse than watergate with basically zero accountability democrats corruption has no limits into how they have corrupted the DOJ and FBI",
        "good": "5",
        "bad": "0",
        "replies": [
            {
                "user_name": "mjp618",
                "time": "15 September, 2022",
                "context": "I'm starting to believe dems & deep state repubs set Nixon up\n??????¿",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "texas_bluebonnet",
        "time": "15 September, 2022",
        "context": "And democrats really have to ask why we are questioning the 2020 election results? They tried, and failed, for fix 2016. They did it successfully in 2020. And if we don't win the midterms, there will not be a 2024. The democrats have all but declared war on this country.",
        "good": "5",
        "bad": "0",
        "replies": [
            {
                "user_name": "jkenwood5",
                "time": "15 September, 2022",
                "context": "How did they try to fix 2016 when no one even knew about the Steele dossier until after the election?",
                "good": "0",
                "bad": "5",
                "replies": [
                    {
                        "user_name": "Lilpiggy",
                        "time": "15 September, 2022",
                        "context": "If that has to be explained to you, you aren’t smart enough to vote.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "jkenwood5",
                                "time": "15 September, 2022",
                                "context": "If there is disinformation to hurt a particular candidate, the disinformation campaign is not particularly effective if no one knows about it.",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "bknightalwaystriumphs",
        "time": "15 September, 2022",
        "context": "Where is John Durham's mug?   I've gotten used to seeing that once a week on Fox.   What happened?\n\nOoh!   That's right, he found nada, nothing, zip, zero.",
        "good": "0",
        "bad": "5",
        "replies": [
            {
                "user_name": "GMan215",
                "time": "15 September, 2022",
                "context": "He had Sussmsn nailed 100.% guilty  but the DC jury said he didn’t lie. Go figure. Think it’s safe to say it’s rigged. That’s why they win 99% of their cases. They not only z judge shop they Jury shop too. Been doing it for years. ",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "bknightalwaystriumphs",
                        "time": "15 September, 2022",
                        "context": "Yet another Republican who doesn't believe in law and order.   Sad!",
                        "good": "0",
                        "bad": "1",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "demsdestroyamerica",
        "time": "15 September, 2022",
        "context": "Corrupt FBI and DOJ\nCriminals in control",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bartolus",
        "time": "15 September, 2022",
        "context": "So why with the millions spent by Mueller did this information remain essentially hidden for the public until Durham’s investigation? Meuller chased rabbits, and the goal was not the truth, but an effort to get Trump. Meuller failed because the evidence wasn’t there. Yes he got some convictions, but not from the “conspiracy.” But the real conspiracy all along was the Clinton campaign concocting a smear campaign with Russian help. This is in truth a huge story, but the liberal press will minimize coverage as compared to the breathless coverage of the Meuller investigation and the fake dossier coverage. Never in American history has a political campaign plotted to manipulate and use the FBI to seek to destroy a candidate based on false allegations, and what makes it worse, the FBI willingly allowed itself to be so used.",
        "good": "10",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "ReadyOnTheRight?-ReadyOnTheLeft?",
        "time": "15 September, 2022",
        "context": "When the investigation is complete, they will probably file it behind the  Warren Report, never to be seen again.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "factsmatter469",
        "time": "15 September, 2022",
        "context": "So Democrats are still crooked?  That's not news, it's long established fact.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Asgard998",
        "time": "15 September, 2022",
        "context": "Let’s be clear all democrats ",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "vshinblind",
        "time": "15 September, 2022",
        "context": "Worse than Watergate.  Where is Carl Bernstein?",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ejanitor944",
        "time": "15 September, 2022",
        "context": "the odor of the clinton mob continues to soil   the country...lock them up......trump was right....again",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "saniac",
        "time": "15 September, 2022",
        "context": "Defund the fbi; it’s a rats nest",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Fhugh484",
        "time": "15 September, 2022",
        "context": "FBI's role should be defined and limited to specific crimes. \nToo loosey goosey. ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "1pingyes2pingsno",
        "time": "15 September, 2022",
        "context": "Sounds more than a bit subversive to me. The FBI?",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "CommieFighter",
        "time": "15 September, 2022",
        "context": "Federal Bureau of Intimidation ",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dalmatiannation267",
        "time": "15 September, 2022",
        "context": "We have a broken ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "WileECoyote86",
        "time": "15 September, 2022",
        "context": "Can we get a comment from Adam Schiff? \n\nBuehler? Buehler?  …… Buehler?",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "whatdatyousay",
        "time": "15 September, 2022",
        "context": "Clinton and her campaign is now widely known to have committed a fraud on the American populous.",
        "good": "1",
        "bad": "1",
        "replies": [
            {
                "user_name": "jinarvada",
                "time": "15 September, 2022",
                "context": "Fake. Untrue.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "Think4urselves",
        "time": "15 September, 2022",
        "context": "We all know James clapper lied to Congress about if the dept was spying on americans. Yes they were, yes they are and no he did not go to jail like any of trumps associates that were supposedly lying about what they had for breakfast 54 days ago.  The search and seizure are pure harassment that violates everybody's rights.",
        "good": "3",
        "bad": "0",
        "replies": [
            {
                "user_name": "jeffofmaine",
                "time": "15 September, 2022",
                "context": "blah blah blah\nAnother story to keep you hopes up.\nMeanwhile....\nFox isn't reporting that the Durham Grand Jury's authority has expired and no effort is being made to renew it.\nTrump's suit against Clinton was thrown out last week., because there's nothing coming from Durham to justify it.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "Think4urselves",
                        "time": "15 September, 2022",
                        "context": "I don't have any hopes up, he did it years ago, \" not wittingly\" I knew right then his verbiage was evasive of the truth, he was, he knew it, no foul, unless your on the other team, then it's criminal. That's the point.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "soreloser433",
        "time": "15 September, 2022",
        "context": "The best way to save America is Locking Trump up",
        "good": "3",
        "bad": "6",
        "replies": [
            {
                "user_name": "foxisgreatforus786",
                "time": "15 September, 2022",
                "context": "You scared bro?",
                "good": "2",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "comeagain",
                        "time": "15 September, 2022",
                        "context": "He lost by 7 million votes.  He has lost the popular vote every time he ran.  He isn’t a good candidate.  Nothing to fear (except the violence of his minions)",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "SadSackIAm972",
        "time": "15 September, 2022",
        "context": "It’s past time for the Chief Executive to wake up and get control of the FBI.  People in charge of this sham should be prosecuted. ",
        "good": "2",
        "bad": "0",
        "replies": [
            {
                "user_name": "SteveMcQueen852",
                "time": "15 September, 2022",
                "context": "President Trump started doing that by firing Comey,  then the deep state went beast-mode",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "comeagain",
        "time": "15 September, 2022",
        "context": "Mueller got over 30 indictments.  How many did Durham get?",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "jeffofmaine",
                "time": "15 September, 2022",
                "context": "3.",
                "good": "1",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "Antiantifa841",
                        "time": "17 September, 2022",
                        "context": "And that covers your counting ability.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "comeagain",
                                "time": "18 September, 2022",
                                "context": "You have real issues if you feel a need to insult someone for simply answering a question.  But you probably know that already.",
                                "good": "0",
                                "bad": "1",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "Antiantifa841",
                "time": "17 September, 2022",
                "context": "Mueller got zero indictments on Russian collusion. He got political indictments on people that were politically motivated.",
                "good": "2",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "comeagain",
                        "time": "17 September, 2022",
                        "context": "He got indictments on people who broke the law.  He found about 10 times the law breakers as Durham.  Spin that into something that doesn’t hurt your feelings.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "Antiantifa841",
                                "time": "18 September, 2022",
                                "context": "He got indictments that were politically motivated. Nobody has been found to violate FARA for decades, yet he goes after that. The process crimes were a joke.",
                                "good": "0",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "comeagain",
                                        "time": "18 September, 2022",
                                        "context": "It’s NOT  political to indict people who broke the law.  It WOULD be political to NOT indict law breakers because of their political affiliations.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": [
                                            {
                                                "user_name": "Antiantifa841",
                                                "time": "18 September, 2022",
                                                "context": "Which is happening right now with Hunter, the Big Guy, and other Democrats.",
                                                "good": "0",
                                                "bad": "0",
                                                "replies": [
                                                    {
                                                        "user_name": "comeagain",
                                                        "time": "18 September, 2022",
                                                        "context": "I’m not a Republican. I trust law enforcement.",
                                                        "good": "0",
                                                        "bad": "1",
                                                        "replies": []
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "Geordie935",
        "time": "17 September, 2022",
        "context": "Blah blah blah - yawn",
        "good": "1",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "jokersdad646",
        "time": "15 September, 2022",
        "context": "Can’t spell FIB without an FBI!! Doesn’t matter because you will never get a conviction of a Democrat in DC. ",
        "good": "2",
        "bad": "0",
        "replies": [
            {
                "user_name": "jeffofmaine",
                "time": "15 September, 2022",
                "context": "Of course, those crafty Dems. \nWhat does that say about the smarts of Republicans if the Dems always get away with stuff and Republicans go to jail... even during the Trump admin??\nBTW...\nFox isn't reporting that the Durham Grand Jury's authority has expired and no effort is being made to renew it.\nTrump's suit against Clinton was thrown out last week., because there's nothing coming from Durham to justify it.\nIt's over. Again. Like EIGHT Benghazi hearings, the Comey, Mueller, Huber and Horowitz investigations... a big nothingburger made from GOP lies.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "dionysus979",
                        "time": "16 September, 2022",
                        "context": "So if Democrats get away with a crime that is good news in your book?   No places for honesty and integrity in your choice of politicians I guess.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "gdtrump2hell",
        "time": "15 September, 2022",
        "context": "Bull Durham throws in the towel. Nothing much, waste of taxpayer money.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "trulyyours",
        "time": "15 September, 2022",
        "context": "all those involved must be brought to the open and their contribution to injustice brought to light. I believe there are still honest, upright, moralistic FBI agents that can clear their reputation by exposing the undesirables, starting with Clinton henchmen.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "allons!",
        "time": "15 September, 2022",
        "context": "Flunked Basic Impartiality...............that's your FBI.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "atom750426",
        "time": "15 September, 2022",
        "context": "Hillary is what she is. Praise God He would not her be President.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "jinarvada",
                "time": "15 September, 2022",
                "context": "He took Trump out.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "jeffofmaine",
        "time": "15 September, 2022",
        "context": "Another story to keep you hopes up.\nMeanwhile....\nFox isn't reporting that the Durham Grand Jury's authority has expired and no effort is being made to renew it.\nTrump's suit against Clinton was thrown out last week., because there's nothing coming from Durham to justify it.\n\nThey are done.",
        "good": "0",
        "bad": "3",
        "replies": [
            {
                "user_name": "nobitnobridle",
                "time": "17 September, 2022",
                "context": "You might be right.  I have no idea.  \n\n... but what I don't understand is why that would seem to make you happy.\n\nThese people committed crimes against our country.  They spent 5 years trying to prevent We the People from having our Right, our Choice and our Vote and I cannot comprehend how anyone would think this was OK.\n\nIt wouldn't matter to me who the president was.  I've been around a long time .. liked some presidents, didn't like others.  So what?  We've never had a perfect president.  Never will.\n\nIt shouldn't matter who the president was.  This was an attack on our system of government .. a violation of the Guarantee Clause of our Constitution and I'm sure multiple laws.  What if it was a president you liked?  Then it would be different wouldn't it?\n\nI realize that all of this is focused on hatred of Trump, Trump, Trump.  I'm so tired of hearing it and that is the wrong focus as far as I'm concerned because ..\n\nwhat really matters is getting lost in all of the propaganda and media swill.",
                "good": "3",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "gandalfmich393",
                "time": "17 September, 2022",
                "context": "Congratulations on winning today's award for the most cut n paste posts.",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "bidenwasteland",
        "time": "15 September, 2022",
        "context": "FBI and the Biden’s new battalion of armed IRS agents are not here to help us.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "travestar869",
        "time": "15 September, 2022",
        "context": "So what we already knew... Dishonest Dims and crooks in the DOJ got busted for doing exactly what they tried to frame President Trump for... colluding with Russia. They should all be prosecuted for treason.",
        "good": "3",
        "bad": "0",
        "replies": [
            {
                "user_name": "jeffofmaine",
                "time": "15 September, 2022",
                "context": "except...\nFox isn't reporting that the Durham Grand Jury's authority has expired and no effort is being made to renew it.\nTrump's suit against Clinton was thrown out last week., because there's nothing coming from Durham to justify it.\nIt's over. Again. Like EIGHT Benghazi hearings, the Comey, Mueller, Huber and Horowitz investigations... a big nothingburger made from GOP lies.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "travestar869",
                        "time": "15 September, 2022",
                        "context": "Nothing is over, Durham's investigation is ongoing. Prosecution of Danchenko isn't even slated to begin till October.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "SineSimulatione",
        "time": "15 September, 2022",
        "context": "Our “government” is composed of individuals.  Our government does not exist separate and apart from these individuals.  There is no way [or perhaps no will] to enforce rules against any biases that these individuals may hold.  As a result, we should not expect our institutions to act differently than how the people that run them act.  We need to come to terms with this truth, and either fight against it or give into it.  Complaining does not serve either of these two courses of action . . .",
        "good": "1",
        "bad": "1",
        "replies": [
            {
                "user_name": "snoopyeee556",
                "time": "17 September, 2022",
                "context": "They swear oaths not to do that and to not have integrity in government assures partisan corruption. But thank you democrat for for excusing the behavior of your comrades.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "icestationzebra",
        "time": "15 September, 2022",
        "context": "Durham pulled the plug it's over 😂",
        "good": "0",
        "bad": "1",
        "replies": [
            {
                "user_name": "oneconserve",
                "time": "15 September, 2022",
                "context": "I wish!",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "pkruse24724",
        "time": "15 September, 2022",
        "context": "Boy, talk about beating a dead horse! When is FOX going to break the news to their poor, uninformed audience that their promises about the Durham investigation being ‘bigger than Watergate’ were total nonsense? The grand jury has gone home and Durham is sending out resumés. Get over it!",
        "good": "0",
        "bad": "1",
        "replies": [
            {
                "user_name": "Antiantifa841",
                "time": "17 September, 2022",
                "context": "Just one more piece of evidence that the deep state exists.",
                "good": "1",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "joe1961",
                "time": "17 September, 2022",
                "context": "just like your mueller report was going to be a bombshell?\nmueller didn't even know who fusion gps was and they were a main player lol\nhe didn't even write his own report lol",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "woody420034",
        "time": "15 September, 2022",
        "context": "Still waiting for a bunch of people to go to jail.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bitkdall",
        "time": "15 September, 2022",
        "context": "Nice to know more of the facts, but there will be no accountability. How about a constitutional amendment that includes election interference in the definition of treason, the only crime defined in the constitution. Election interference by the media, the FBI, or ballot harvesters and paid mules slithering around in the night is surely a serious crime is it not? Actively seeking to thwart the will of the people? Why do we have elections? To me these acts are tantamount to treason and should be punished as such. I’m aware of the very high bar to pass a constitutional amendment, but it was there  for the current 27 amendments. Time for a 28th",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bluebirdky",
        "time": "15 September, 2022",
        "context": "Corruption revealed but it ends there it seems.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "jeffofmaine",
                "time": "15 September, 2022",
                "context": "You can believe what you want.\nHere are the facts about your belief system..\nIt's over. Again. \nLike EIGHT Benghazi hearings, the Comey, Mueller, Huber and Horowitz investigations... a big nothingburger made from GOP lies. \nFox isn't reporting that the Durham Grand Jury's authority has expired and no effort is being made to renew it.\nTrump's suit against Clinton was thrown out last week., because there's nothing coming from Durham to justify it.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "amandaviv",
        "time": "15 September, 2022",
        "context": "Nobody cares any more.  They should as if it happened once, it will definitely happen again.  Hillary lost - yay!  Trump lost - Boo!  But it's the country and the Constitutional conservatives that are bearing the greatest brunt of all of this.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dcamp3635",
        "time": "17 September, 2022",
        "context": "After the excruciation pain they put America through during the past five years, I no longer trust Democrats, liberal media, Big Tech, and the politicized DOJ/FBI.",
        "good": "4",
        "bad": "0",
        "replies": [
            {
                "user_name": "nobitnobridle",
                "time": "17 September, 2022",
                "context": "... and that is my issue.  The damage that has been done to this country can't be calculated.  People have become so invested that it has destroyed families and the primary culprit was the all day, every day, non-stop manipulation of We the People by the media.\n\nThere were hundreds that either were involved or had knowledge of what was happening and never, ever should anyone go unpunished for attempting to rob this country of their Voice, Choice and Vote.  I don't care who was president .. this was an attack on our system of government and no one should be allowed to get away with it but the ones who have done and still are doing the majority of the damage ..\n\nare the media.",
                "good": "2",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "dcamp3635",
                        "time": "17 September, 2022",
                        "context": "Very well put!",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "nobitnobridle",
                                "time": "17 September, 2022",
                                "context": "Thank you!",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "deiterbraun",
        "time": "15 September, 2022",
        "context": "This probe is winding down and the only indictment was a cyber guy was accused of lying to the FBI. That guy was acquitted at trial. That's it. That's all that's come from the Durham probe. Trump handpicked Durham to do this investigation after his own justice dept found nothing. Now Durham has also found nothing. But that wont matter to the MAGA cult will it?",
        "good": "0",
        "bad": "2",
        "replies": [
            {
                "user_name": "dionysus979",
                "time": "16 September, 2022",
                "context": "So the fact that Obama and Hillary used the FBI to pay for a dossier full of lies about their political opponent should just be ignored?",
                "good": "5",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "john894",
        "time": "17 September, 2022",
        "context": "Quote: the FBI not only paid Steele for a period, but then they paid this individual to collect this information \n\nIs anyone surprised? The Democrat's politically weaponized FBI meddling in an election, tried to use fraudulent manufactured evidence to remove a lawfully elected president, and paying a Russian to help them.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "chrisrobin601",
        "time": "17 September, 2022",
        "context": "FBI is used to suppress the minority, opposition party it becomes clear that it is no longer impartial but a tool of a single political party. Fact now. While Biden call them facists and emboldens the weak minded rational people should be looking at the long term consequences of single party rule. There is plenty of history to draw from.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "katzman299668",
                "time": "17 September, 2022",
                "context": "But Obama is not the beginning. Roosevelt did this, Kennedy and Johnson did this. That is the legacy of J Edgar Hoover. Johnson even burglarized his opponents campaign office. Nixon did not have the imagination to do this-he copied Johnsons work against Goldwater.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "chrisrobin601",
                        "time": "17 September, 2022",
                        "context": "Yup, Nixon got a raw deal, wasn't his idea but made the mistake in being complicit in the Watergate break in cover up for which he paid dearly. Actually, liked Nixon because he had the will to end Vietnam even without an honorable withdrawl. For that, we're forever greatful. There is a lot to not like about Nixon.\nThere is a lot to not like about Trump but he won 2016 and kept HillaryClinton from being elected and for that he earns our gratitude in perpetuity. May God bless President Trump and may God bless America.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "pblooney46",
        "time": "17 September, 2022",
        "context": "Most likely a planted/paid FBI informant on staff at Mara Logo or on Trumps Staff. The seems to be their Modus Operandi.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mickeywagner",
        "time": "17 September, 2022",
        "context": "Regardless of political affiliations or preferences, the creep toward police state tactics should alarm everyone and worse, no consequences for bad actors, should alarm everyone.  Obama started the weaponization of government on a broad scale with everything from Lois Lerner IRS harassment of opposition to SWAT raids on conservatives like Gibson guitars and others. Now under Biden it has reached Gestapo like levels with DOJ and FBI actions. Scary.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rtrim",
        "time": "18 September, 2022",
        "context": "And the democrats say the republicans are the threat to our democracy.  That's turning out to be serious projection.  They used this information to impact the 2016 election and failed, so they used it to try to bring down a sitting president, and nobody at the DOJ cares.\n\nThe damage that has been done to this country will take decades to get over if it's even possible.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dno400",
        "time": "17 September, 2022",
        "context": "Welcome to the banana republic...",
        "good": "0",
        "bad": "0",
        "replies": []
    }
]