[
    {
        "user_name": "K.Lepere000",
        "time": "1 September, 2022",
        "context": "G-D BLESS OUR LEGITIMATE PRESIDENT TRUMP 🙏🏼❤",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jh27847",
        "time": "1 September, 2022",
        "context": "Democrats cooked up a story (Steele Dossier) to stop Trump from gaining the Whitehouse.  They then started talking about impeachment even before he took office.  They boycotted his inauguration and tried to impeach him twice.  On national TV the Speaker of the House showed her Trump hatred to the nation.  Yet we are to believe if the Democrats loose the House and Senate our democracy will be at risk?  I think it has been.  Not by Trump but by Democrats.",
        "good": "23",
        "bad": "1",
        "replies": [
            {
                "user_name": "joeyg45",
                "time": "1 September, 2022",
                "context": "Guess you didn't read the Mueller report huh? Too long for you?",
                "good": "0",
                "bad": "8",
                "replies": [
                    {
                        "user_name": "mitch777303",
                        "time": "1 September, 2022",
                        "context": "Nonsense",
                        "good": "3",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "TexitGal341",
                        "time": "1 September, 2022",
                        "context": "You mean the report that found nothing? The report that Mueller absolutely knew nothing about? That report?",
                        "good": "7",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "uncledooky",
        "time": "1 September, 2022",
        "context": "Funny how the left think everything is a threat to democracy or Racist. \nIt has become a well worn phrase that has lost all meaning. \nI believe we should start using these phrases as a barometer. If you are called either of these you know your doing something right",
        "good": "15",
        "bad": "0",
        "replies": [
            {
                "user_name": "darkshade460",
                "time": "1 September, 2022",
                "context": "No, you are not.",
                "good": "0",
                "bad": "3",
                "replies": [
                    {
                        "user_name": "navyvet1990",
                        "time": "1 September, 2022",
                        "context": "Must be, otherwise a liberal would just scream at you for not being a socialist that believes in giving away everything you worked for, to some one that refused to work. You know like paying off college loans they signed contracts for.",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "justoneuncle",
                "time": "1 September, 2022",
                "context": "The third one the left uses is \"people will die\" if x happens/doesn't happen.",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "isisskiller",
        "time": "1 September, 2022",
        "context": "Biden is not my president ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "specialagentzero",
        "time": "1 September, 2022",
        "context": "Everybody already knows the Democrats stole the 2020 through voter fraud. The entire world witnessed it.",
        "good": "19",
        "bad": "0",
        "replies": [
            {
                "user_name": "stratlover",
                "time": "1 September, 2022",
                "context": "Good grief. More of this pernicious nonsense?",
                "good": "2",
                "bad": "10",
                "replies": [
                    {
                        "user_name": "specialagentzero",
                        "time": "1 September, 2022",
                        "context": "Trump told us Biden would be a disaster for America.",
                        "good": "6",
                        "bad": "1",
                        "replies": [
                            {
                                "user_name": "Grappler🤷🏻‍♀️",
                                "time": "1 September, 2022",
                                "context": "And he was wrong",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            },
                            {
                                "user_name": "stratlover",
                                "time": "2 September, 2022",
                                "context": "You and yours are the disaster. The rest of us will get through just fine.",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "patriothere017",
                "time": "1 September, 2022",
                "context": "Mass media manipulation; it wins elections!",
                "good": "3",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "Conny364",
                        "time": "1 September, 2022",
                        "context": "No that wasn't the way they won it guppy.   They stuffed offsite ballot boxes and closed the elections down at 2:30am CST for 3 hours when Trump was winning in 6 of the last 7 states by wide margins.   He was winning in the 7th state by a small margin.   When they came back he had lost all of them.    That was the first time an election result had been stopped.   Gee I wonder why?   Because they misjudged what it would take and then fixed it.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "patriothere017",
                                "time": "1 September, 2022",
                                "context": "Worked for the Germans. 🤔",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "pittbonham",
                "time": "1 September, 2022",
                "context": "\"I respect and believe William Barr. There was no such thing as election fraud.\"\n-Ivanka Trump under oath before God and country.",
                "good": "1",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "error": "error"
    },
    {
        "user_name": "xnoles80",
        "time": "1 September, 2022",
        "context": "Russia Russia meanwhile he and clinton are laughing all the way to the bank",
        "good": "8",
        "bad": "0",
        "replies": [
            {
                "user_name": "deenikol",
                "time": "1 September, 2022",
                "context": "ABSOLUTELY ABSOLUTELY 💯 👌 👍 ",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "softballbatman",
        "time": "1 September, 2022",
        "context": "Axelrod never forgave Hillary for her lousy campaign",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "paultan397",
        "time": "1 September, 2022",
        "context": "\"Threat to democracy\" 2022 Democrats have nothing to sell to Americans so they have to peddle manufactured Fear -quite different than FDR saying there is nothing to fear but Fear itself. FDR, JFK would be disappointed with 2022 Democrats",
        "good": "18",
        "bad": "0",
        "replies": [
            {
                "user_name": "squibman31",
                "time": "1 September, 2022",
                "context": "'threat to democracy' is a marketing phrase that polled well in focus groups. That is why they are all goosestepping with it.",
                "good": "4",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "ghafner",
                        "time": "1 September, 2022",
                        "context": "What do you call a movement that continues to deny the results of a national election...without ONE (0) confirmed successful legal challenge to the actual results...? \"Threat to democracy\" fits the bill without even mentioning all the insane local and national behavior after decades of republican propaganda and projection, grievance politics, victimhood, scapegoating, vile racism and misogyny. We are facing a severe threat when +- 40% don't try to discern the difference between true facts and lies and don't care about the lies and hypocrisy as long as they get what they want. Too many people in that cult view governance as if it's a pro-wresting match (i.e. they don't care if it is fake and rigged as long as their\"guy\" bloodies his opponent) and this whips them further into denial and even some sort of apoplectic frenzy ...to raid the Congress, attack or defund the FBI and follow such an obviously corrupt and unfit \"genius?\"  Whose goosestepping now?",
                        "good": "1",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "squibman31",
                                "time": "1 September, 2022",
                                "context": "Except the United States is not a Democracy. It is a Constitutional Republic. I'll leave you yo look that up. And the election was stolen by Dems and some Republicans changing the rules in various states. Most changes were legal so no legal challenge was warranted. Plus Rudy and his team went after 'fraud' which is notoriously hard to prove, especially in the short time frame there was to put together evidence. The reality is, there was more than enough reasonable doubt to call the results of the election into question. Much more doubt than Al Gore had with his hanging chads. The ones that deny the reasonable doubt are in fact the dishonest ones.",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "pittbonham",
                "time": "1 September, 2022",
                "context": "Lol. when republicans lost by 8 million votes they attacked our capitol and attempted to overthrow democracy.\ncan you imagine what they would have done if they had \"lost\" with 3 million MORE votes like hillary did?\n\nin fact does anyone even remember the last year a republican president got more votes than the dem?",
                "good": "0",
                "bad": "2",
                "replies": [
                    {
                        "user_name": "skyeanne",
                        "time": "1 September, 2022",
                        "context": "and just think what you could post if your brain  wasn't fertile with dem speak.... poor little dude... my sympathy to your loved ones.",
                        "good": "2",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "pittbonham",
                                "time": "1 September, 2022",
                                "context": "why my loved ones didnt terrorist attack our capitol and didnt get sentenced to ten years today like that MAGA did. lol.\n\nby the way you failed to tell us the last year a republican president got more votes.\nwould you like to try again or do you need more homeschooling?",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "wldflr878",
        "time": "1 September, 2022",
        "context": "David Axelrod is acting the FOOL on this one.\n Members of the Democrat Party, ones on the Jan. 6 Committee included, DID the same thing denied the 2016 Election, and did not want it declared Trump the Winner.....\nIs his Memory failing him as well as Joe Biden's?.....IMO",
        "good": "5",
        "bad": "0",
        "replies": [
            {
                "user_name": "seriouslyscarynow",
                "time": "1 September, 2022",
                "context": "Willful ignorance",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "werchampions",
        "time": "1 September, 2022",
        "context": "Hillary whined for months about losing to Trump.  She blamed it on anything and everything except for her truly dislikable personality and lack of political skills.",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "veritaspost1",
                "time": "1 September, 2022",
                "context": "she conceded did Trump?",
                "good": "1",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "Liberalsarescumbags!",
                        "time": "1 September, 2022",
                        "context": "Did Abrams?",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "poxonbothhouses",
                "time": "1 September, 2022",
                "context": "Yes, she whined. So? She conceded the election within hours of the polls closing.",
                "good": "0",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "jimb",
        "time": "1 September, 2022",
        "context": "The trumpers are definitely a threat to democracy, trump and trumpers are the worst thing to happen to America in a long time.",
        "good": "3",
        "bad": "3",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "oldredleg",
        "time": "1 September, 2022",
        "context": "Axelrod?  I thought he died of STD!",
        "good": "1",
        "bad": "1",
        "replies": [
            {
                "user_name": "joeturek",
                "time": "1 September, 2022",
                "context": "he did.  ",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "error": "error"
    },
    {
        "user_name": "colbraddock",
        "time": "1 September, 2022",
        "context": "Apparently David believes that only members of his tribe are allowed to criticize or deny election results like Gore, Hillary and Stacy Abrams did and still do.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cachai56",
        "time": "1 September, 2022",
        "context": "Here’s the good news in all this…the deniers are now able to rest easily and spend their days in a semi-state of “retirement”. Today, former NY police officer Thomas Webster was sentenced for his role in beating a Capitol police officer during the insurrection on January 6th. He received the longest sentence handed out so far- the former 56 year old Marine will serve 10 years in prison for his role in the insurrection. Now…what about those who choose to riot in the streets after Trump is indicted? Will they also serve time for attempting to over throw our Republic and it’s Constitution? Will you heed the call to riot? Are you willing to also serve time? Please…let us know if you’re willing to spend years behind prison bars.",
        "good": "3",
        "bad": "10",
        "replies": [
            {
                "user_name": "DopieDitus",
                "time": "1 September, 2022",
                "context": "Mr. Garland?",
                "good": "2",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "cachai56",
                        "time": "1 September, 2022",
                        "context": "Yes? Please don’t bother me at this moment…we’re busy putting the final touches on indicting Trump on espionage and obstruction charges. Please let us know if you are willing to be one of the future rioters looking to overthrow our Republic and shred our Constitution. We have reserved some special rooms for you and your ilk.",
                        "good": "0",
                        "bad": "1",
                        "replies": [
                            {
                                "user_name": "DopieDitus",
                                "time": "2 September, 2022",
                                "context": "You are mistaken, it would be the D side of the aisle that shreds the Constitution. \nYes I am prepared to fight for it.\nDemocrats lie, twist and obfuscate. That is their MO and yours also.",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "dudg",
        "time": "1 September, 2022",
        "context": "Now they are telling us how to think, I don’t know, but I saw with my own eyes, whenever Biden showed up for a rally , nobody was there,and the peaceful riots were peaceful, I got to get my glasses checked",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rolfbear",
        "time": "1 September, 2022",
        "context": "Why isn't it a threat to Democracy when Liberal Democrats say that the election was stolen from them by Republicans? Like Hillary, a law breaking government official ,or the Fat Cow from Georgia. Just asking. ",
        "good": "13",
        "bad": "0",
        "replies": [
            {
                "user_name": "tonysisson",
                "time": "1 September, 2022",
                "context": "Democrats didn’t storm the Capital. Hope that helps.",
                "good": "1",
                "bad": "2",
                "replies": [
                    {
                        "user_name": "DopieDitus",
                        "time": "1 September, 2022",
                        "context": "They stormed DC and a gaggle of liberal cities for over a year. Remember?",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "cornpop1637",
                        "time": "1 September, 2022",
                        "context": "No, but they did destroy cities all across the nation having a temper tantrum. hope that helps",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "huntercrackpipe159",
                        "time": "1 September, 2022",
                        "context": "so funny when libs start an internet fight, lol",
                        "good": "0",
                        "bad": "1",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "joeturek",
                "time": "1 September, 2022",
                "context": "truth ",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "gus329",
        "time": "1 September, 2022",
        "context": "This guy is nothing more than a Marxist and a FRAUD!!!",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "johnnythewalrus",
        "time": "1 September, 2022",
        "context": "Self-awareness has never been a trait of your typical Democrat mouthbreather.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "yesiamincaseurinterested",
        "time": "1 September, 2022",
        "context": "This a false equivalency. The most significant difference? Dems didn't try to stop the transfer of power. Dems didn't invade the Capitol. Ultra MAGA were the only ones that did that.",
        "good": "2",
        "bad": "5",
        "replies": [
            {
                "user_name": "11mjo11",
                "time": "1 September, 2022",
                "context": "Pelosi organized 2 coup attempts and all congressional democrats supported her.",
                "good": "1",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "yesiamincaseurinterested",
                        "time": "1 September, 2022",
                        "context": "Impeachment is a legal process. An insurrection is not. Basic facts.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "poet2",
                "time": "1 September, 2022",
                "context": "The capital belongs to the people. There was no invasion thereof.",
                "good": "1",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "pittbonham",
                        "time": "1 September, 2022",
                        "context": "you should have defended the cop who got ten years for attacking the capitol today. lol",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "yesiamincaseurinterested",
                        "time": "1 September, 2022",
                        "context": "You don't understand laws do you?",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "navyvet1990",
                "time": "1 September, 2022",
                "context": "No, but liberals did attack Federal Buildings all over the country. Including setting up CHAD in Seattle's city center. You remember the place where no Government employees could go, right? Or trying to burn down Federal buildings with the Government employees barricaded inside. No?  What about the attack on the Capitol in October 2018? Don't remember that one? Figures, because it was Liberals that were doing it.",
                "good": "1",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "yesiamincaseurinterested",
                        "time": "1 September, 2022",
                        "context": "Yes I remember the BLM / Antifa riots well. But in 2016 Dems and/or libs never did what ultra MAGA did. We let DJT assume presidency BECAUSE HE WON THAT ELECTION.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "freedomforever642",
                "time": "1 September, 2022",
                "context": "they just came up with two phony impeachments. hoping to remove trump and overturn 2020. dems had their shock troops, antifa, try to invade the white house. used a phony dossier to lie to the fisa Court so they could spy on the trump campaign. as well as trying to get republican electors to change their votes. ",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "yesiamincaseurinterested",
                        "time": "1 September, 2022",
                        "context": "Impeachments? Legal. Antifa? Not Dem endorsed. FISA warrant? Cater Page true, no others, please don't exaggerate. Trying to pressure Republican electors? Fake news, conspiracy theory. Quit the what aboutism.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "one-more-time",
        "time": "1 September, 2022",
        "context": "Here's truth:\nElections have problems. Elections get investigated.\nYelling about a \"big lie\" and \"the most secure election in history\" to stop investigations raises suspicion. What are you democrats hiding to so strongly resist exposing the records proving right or wrong?",
        "good": "5",
        "bad": "0",
        "replies": [
            {
                "user_name": "pittbonham",
                "time": "1 September, 2022",
                "context": "by all means why doesnt the RNC use their warchest money to investigate all they like? because they know the truth?",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "brucegordon",
        "time": "1 September, 2022",
        "context": "What can biden say tonight that will not be a lie?",
        "good": "2",
        "bad": "0",
        "replies": [
            {
                "user_name": "joeturek",
                "time": "1 September, 2022",
                "context": "nothing ",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "al99689",
                "time": "1 September, 2022",
                "context": "He has a lot to go before he reaches Trump's 30,000 in four years. But that is counting Trump saying the same lie over and over which is his fascist strategy to brainwash MAGA people.",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "joeyg45",
        "time": "1 September, 2022",
        "context": "Which of the 2 groups tried to illegally change the election results and when that failed committed sedition and attacked the state capital?",
        "good": "1",
        "bad": "5",
        "replies": [
            {
                "user_name": "freedomforever642",
                "time": "1 September, 2022",
                "context": "the dems tried to get electors to vote for Hillary verses how their state voted. they challenged the votes in congress. the root at the capital was no distant than what the dems did in Washington that year. attacking the white house. ",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "error": "error"
                    }
                ]
            }
        ]
    },
    {
        "user_name": "Notsenile865",
        "time": "1 September, 2022",
        "context": "Axelrod is a Clinton puppet, and a democratic hack",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "joeturek",
                "time": "1 September, 2022",
                "context": "as a scientist former fighter and vet I loved when my opponent looked like him.  I definitely rearranged its face ",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "mitch777303",
        "time": "1 September, 2022",
        "context": "So sick of the democrats talking point \"they are a threat to democracy.\" Baloney, they are a threat to beating you in a fair and square election run on real issues.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "brucegordon",
        "time": "1 September, 2022",
        "context": "\"Do an online \"Search for (the truth).... Is it out there?  Can it be found?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "OliveDucky",
        "time": "1 September, 2022",
        "context": "He is a twisted & bent axle rod? vote republican, vote ULTRA Maga!",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "JustMe7!",
        "time": "1 September, 2022",
        "context": "Heck Hillary still hasn’t came to grips over the 2016 election. At least Trump has a legitimate reason to be mad over the election. And the rest of us 75 million people! ",
        "good": "3",
        "bad": "1",
        "replies": [
            {
                "user_name": "joeturek",
                "time": "1 September, 2022",
                "context": "truth ",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "craigchamp",
        "time": "1 September, 2022",
        "context": "Does ANYONE believe that bidum got more legal votes then Obama??",
        "good": "10",
        "bad": "0",
        "replies": [
            {
                "user_name": "tonysisson",
                "time": "1 September, 2022",
                "context": "bidum didn’t but Biden did. Hope that helps.",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "justsayin'010",
        "time": "1 September, 2022",
        "context": "Axelrod, no one cares what you think or say unless you're wanting to confess to some of the crimes in the Obama administration",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "PurpleGlasses",
        "time": "1 September, 2022",
        "context": "Russia,Russia,Russia,Breaking News Russia for three years 24 hours a day because Hillary lost. so do me a favor,you get lost.",
        "good": "5",
        "bad": "1",
        "replies": [
            {
                "user_name": "veritaspost1",
                "time": "1 September, 2022",
                "context": "did Hillary concede ? I forget",
                "good": "0",
                "bad": "2",
                "replies": [
                    {
                        "user_name": "whatdatyousay",
                        "time": "1 September, 2022",
                        "context": "She's been whining ever since!\n\nI see you don't pay attention.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "joeturek",
                        "time": "1 September, 2022",
                        "context": "no.  not yet",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "whatdatyousay",
                "time": "1 September, 2022",
                "context": "AMEN BROTHER!👍",
                "good": "2",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "joeamerica",
        "time": "1 September, 2022",
        "context": "C'mon... what is all the outrage on here about. The MAGA cult is a threat. Biden got it right. You can't have it both ways. You can't say you are for Democracy when you can not condemn the siege of the capitol - spurred on by Trump on January 6th. And to those of you who seemed outrage by Biden's recent comments. Where were you on May 29, 2020 — At 12 a.m. Thursday, when President Trump retweeted a video in which a supporter says, “The only good Democrat is a dead Democrat.”",
        "good": "2",
        "bad": "2",
        "replies": [
            {
                "user_name": "joeturek",
                "time": "1 September, 2022",
                "context": "the only good one is never going to move again  ",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "freedomforever642",
                "time": "1 September, 2022",
                "context": "i haven't heard anyone say the riot at the capital wasn't wrong. i do hear dems say conservatives think it was ok. ",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "TexitGal341",
        "time": "1 September, 2022",
        "context": "It's different because we're Democrats.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "mcsearch1",
        "time": "1 September, 2022",
        "context": "Not only did the Demarxists wail against the 2016 election of Trump, they spent the next 4 years actively undermining his presidency.  January 6th rioters damaged a building.  The Demarxists damaged this country.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cornpop1637",
        "time": "1 September, 2022",
        "context": "if liberals didn't have double standards, they wouldn't have any standards at all",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dmack748",
        "time": "1 September, 2022",
        "context": "David axelrod what a joke",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "willteach608",
        "time": "1 September, 2022",
        "context": "seems like all these ruling class cabalists are of a certain persuasion...and it s never christian",
        "good": "2",
        "bad": "0",
        "replies": [
            {
                "user_name": "mojonixon",
                "time": "1 September, 2022",
                "context": "Who are you trying to convince who the real Christian is?",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "wardawg97",
        "time": "1 September, 2022",
        "context": "Democrats have been denying elections at least since the Bush/Gore recount fiasco of 2000",
        "good": "7",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "whatdatyousay",
        "time": "1 September, 2022",
        "context": "Axelrod's comments are derp spin tactics ignoring his party's faults, but narcissist do that.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tortuga6",
        "time": "1 September, 2022",
        "context": "Fox must be really desperate to create a news story if the best that can be done is summarize a series of Twitter exchanges.   Now, some facts:\n\n(a) Clinton conceded the election on Nov 9th, 2016 (within one day of the results).  In contrast, Trump continues to (falsely) dispute the results.\n\n(b) Obama facilitated the presidential transition, met personally with Trump, and attended the inauguration ceremonies.  In contrast, Trump tried to disrupt the counting of electoral votes and ditched the inauguration.\n\n(c) This article provides a great example of “Whataboutism”, a classic Soviet propaganda technique.\n\nWhataboutism: The technique or practice of responding to an accusation or difficult question by making a counteraccusation or raising a different issue.  The tactic was mastered by Soviet Communist propagandists during the Cold War.  Any criticism of the Soviet Union (Afghanistan, martial law in Poland, imprisonment of dissidents, censorship) was met with a 'What about...' (apartheid South Africa, jailed trade-unionists, the Contras in Nicaragua, and so forth).",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "thinkfirst911",
        "time": "1 September, 2022",
        "context": "So disgusting, that the liberals and democrats literally do what they excuse others of with a straight face. They hounded Donald Trump from the second he announced to run, and really turned up the lies and false allegations for the next 6 years...They and the deep state never got over Hillary not winning, so she have overseen what we are seeing today.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "merff",
        "time": "1 September, 2022",
        "context": "Dems stole the election by harvesting non-citizen votes. Does anyone believe that even half of the votes cast in Spanish are from lawful citizens?  If you're born in USA, you must go thru 12 years of English-speaking schools.  Why would you need a ballot in Spanish?  Immigrants who become lawfully naturalized citizens make up a very tiny fraction of the immigrant population.",
        "good": "0",
        "bad": "1",
        "replies": [
            {
                "user_name": "PaPride",
                "time": "1 September, 2022",
                "context": "you should present all that evidence in court, under oath!",
                "good": "1",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "al99689",
                "time": "1 September, 2022",
                "context": "not a shred of evidence to support that claim.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "mhughes56942",
        "time": "1 September, 2022",
        "context": "What could possibly have been wrong with harvesting ballots all on the pretense of covid accommodation and conveniently in Democrat controlled states. Not to mention counting absentee ballots for 7 days after the close of the election....Naaahhh nothing suspect here! But hey, how about Hunter's laptop ,pretty sure Hillary smashed the hard drive!",
        "good": "3",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "gmoney42",
        "time": "1 September, 2022",
        "context": "Election deniers = Sore losers",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "stopthenonsenseplease",
        "time": "1 September, 2022",
        "context": "Coming from the mouth of one of the Chicago Political Machine capos - LOL !!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "fantheflame",
        "time": "1 September, 2022",
        "context": "It all started with the great internet inventor, Al Gore. The same guy who owns a 20 room mansion with a heated pool, pool house, guest house. Talk about credibility, Axelrod has about the same credibility as Gore.",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "PurpleGlasses",
        "time": "1 September, 2022",
        "context": "Threat to Democracy? What Hillary and her lap dogs,the media,celebs,intel community did with Russia,Russia,Russia' was a threat to our Democracy. What 51 former intel members did with the Hunter laptop was a threat. What the FBI did with FB and Twitter was a threat. As usual,whatever they accuse Trump and his supporters of,they are actually guilty of the same thing but ten times worse.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "trevor69er",
        "time": "1 September, 2022",
        "context": "David, your Alzheimers is showing  . . .\n\n😳",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "blah459",
        "time": "1 September, 2022",
        "context": "Add me to the list!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "whatdatyousay",
        "time": "1 September, 2022",
        "context": "Democrats are ruining democracy!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "makersvstakers581",
        "time": "1 September, 2022",
        "context": "Hey, axelrod!\nYour democrat party wants “socialism!”\nThat’s a REAL threat to “democracy.”",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "spyderbiker",
        "time": "1 September, 2022",
        "context": "Like every political hack, he has selective memory and it only goes back 4 years.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "BidenblewupNordStream2pipeline?",
        "time": "1 September, 2022",
        "context": "The Biden Admin and their 81 million Biden supporters are a threat to everyone.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "poet2",
        "time": "1 September, 2022",
        "context": "Axelrod, explain all the irregularities that happened in the 2020 election, all the rule changes because of the pandemic, the observers being told to go home or kept at a distance.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "joeturek",
        "time": "1 September, 2022",
        "context": "rip off its arm and beat it with it",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cdavid",
        "time": "1 September, 2022",
        "context": "So I guess the word 'existential' was dropped. Guess the left figured out what it meant.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "americanway502",
        "time": "1 September, 2022",
        "context": "Check this guys hearing aids. The FBI was complicit in hiding Hunters laptop. The American people were misinformed. I don’t care if the number of votes is accurate. It was a rigged process!",
        "good": "7",
        "bad": "0",
        "replies": [
            {
                "error": "error"
            }
        ]
    },
    {
        "user_name": "@hangar249",
        "time": "1 September, 2022",
        "context": "I thought he was a tour guide at the Obama shine stand.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Golden_Comb_Over",
        "time": "1 September, 2022",
        "context": "and the answer was crickets",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ktheman",
        "time": "1 September, 2022",
        "context": "Impale Axelrod.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "johnn707",
        "time": "1 September, 2022",
        "context": "With 2022 coming to an end.\nIt has made 3 things abundantly clear, you should plant a garden, own a gun & never trust a Democrat. ",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "johnn707",
        "time": "1 September, 2022",
        "context": "Joe Biden told us he was putting his entire soul into unifying America.  I guess this is real proof that Biden has no soul.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "geraghb",
        "time": "1 September, 2022",
        "context": "Dem Libs memory only extends back as far as they need it to.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "OliveCloud",
        "time": "1 September, 2022",
        "context": "The threat to democracy was the FBI suppression of the Hunter Biden laptop to help Biden win. Voters said they wouldn't have voted for Biden if they know about the laptop and his dealings. The big lie was hiding this.",
        "good": "3",
        "bad": "2",
        "replies": [
            {
                "user_name": "advocatus.diaboli",
                "time": "1 September, 2022",
                "context": "And Russia worked to help get Trump elected in 2016.\nAs well, what exactly does the laptop show?",
                "good": "0",
                "bad": "3",
                "replies": []
            }
        ]
    },
    {
        "user_name": "jadeona447",
        "time": "1 September, 2022",
        "context": "Massive election fraud machines stopped in the middle of the night 2000 mules machines changed votes ballot harvesting on and on it was rigged machines connected to Wi-Fi",
        "good": "1",
        "bad": "2",
        "replies": [
            {
                "user_name": "al99689",
                "time": "1 September, 2022",
                "context": "are you serious or being funny?",
                "good": "2",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "tortuga6",
                        "time": "1 September, 2022",
                        "context": "Possibly ignorant",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "mktguy2",
                "time": "1 September, 2022",
                "context": "Aluminum foil is on Aisle 12. You might want to hurry to the store because the rays are definitely seeping through with many of those responding to this story.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "Godzilla323",
                        "time": "3 September, 2022",
                        "context": "Sorry,  because of Biden incompetence ,we are out of aluminum foil, t-p and baby formula!",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "Sludgefoot",
        "time": "1 September, 2022",
        "context": "I'm sure the ballot counters said \"the count will be ceased overnight\" yet, Trump was ahead when they (supposedly) stopped counting in swing states yet was behind when they opened in the morning.",
        "good": "5",
        "bad": "0",
        "replies": [
            {
                "user_name": "surfdog405",
                "time": "1 September, 2022",
                "context": "First time in my entire life of 54 years the guy winning at 10:30 pst was not elected President.  1'st time there was a sudden and complete switch overnight.",
                "good": "2",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "bartholomewmcgillicuddy859",
        "time": "1 September, 2022",
        "context": "Remember in 2016 when Hillary Clinton gave a speech after losing the election, then her followers invaded the Capitol Building?\n\nDo you see why we look down on you?",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "maudie13",
        "time": "1 September, 2022",
        "context": "This dweeb would have trouble getting out of his own way. Always relying on a crooked scheme or lie to get ahead. Glad i don’t have to tell people he is my dad or grandfather.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Bobby45116",
        "time": "1 September, 2022",
        "context": "What are people who entertain Trump by siting that 2020 wasn’t real?  They’re either lying for him or need a prescription for mental illness.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Boomer46",
        "time": "1 September, 2022",
        "context": "The election was stolen. Everyone knows it.",
        "good": "7",
        "bad": "0",
        "replies": [
            {
                "user_name": "advocatus.diaboli",
                "time": "1 September, 2022",
                "context": "Ah... of course.  There is simply no way that the candidate with the lower 4ry running average approval rating of ANY president EVER could lose unless there was fraud.  /s",
                "good": "0",
                "bad": "3",
                "replies": [
                    {
                        "user_name": "surfdog405",
                        "time": "1 September, 2022",
                        "context": "Biden's approval rating got to a lower point than Trumps.  Just saying.  It is not hard to find those figures btw.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "advocatus.diaboli",
                                "time": "1 September, 2022",
                                "context": "And how did Biden's POST-election approval rating play a role in the 2020 election?  As well, I referred to the \"average running approval rating\"... not simply a single poll",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "KapmBob",
        "time": "1 September, 2022",
        "context": "Another has-been, Jew Liberal with an opinion.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "marxismlost",
        "time": "1 September, 2022",
        "context": "When will these liars quit telling us America is a democracy?",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "freedomnm",
        "time": "1 September, 2022",
        "context": "Axlerod, and those of his political ilk, are psychotic.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "givepeaceachance251",
        "time": "1 September, 2022",
        "context": "Mr. Axelrod is correct.  Election deniers, AKA Trumpists, are a threat to our democracy.\nAlso, the people criticizing Axelrod are not Conservatives, they are Trumpists.  There is a huge difference between those groups.",
        "good": "5",
        "bad": "6",
        "replies": [
            {
                "user_name": "jimmyd2402",
                "time": "1 September, 2022",
                "context": "BTW we are a constitutional republic NOT a democracy. Please list specific examples why MAGA and Ultra MAGA is a threat to \"our democracy\" your term. Again be specific. I'll wait.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "givepeaceachance251",
                        "time": "3 September, 2022",
                        "context": "BTW, we are a democratic republic.\nThe maga attack of our Capitol Building and the temporary interruption of a government proceeding is a specific example of why maga is a threat to our democracy.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "jimmyd2402",
                                "time": "3 September, 2022",
                                "context": "BTW WE ARE A CONSTITUTIONAL REPUBLIC!!  Is that protest gone bad on January 6 all you got? If that is true then its also true that the Antifa / BLM of 2020 that burned federal buildings with police still in them, did 50 billion in damages over 100 days, injured 300 cops, killed 12 cops was called what? Was that a threat to the republic? Which of the two examples given did the most damage to people and property? Take your time, I know its difficult for you",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "advocatus.diaboli",
        "time": "1 September, 2022",
        "context": "The new American tradition is to claim fraud when their preferred candidate loses.  This applies to both parties (though MAGAs certaintly took it to an extreme with the Jan 6th attack on the Capital)",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "coloyurtboy",
        "time": "1 September, 2022",
        "context": "70%? I didn’t realize it was that low😳",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "box948",
        "time": "1 September, 2022",
        "context": "The threat to Democracy began with Obama and goes on with Biden, Schumer, Pelosi!  The DNC and Hillary trie to twist a formulated plan to remove a duly elected President!  I am sure David remembers when they all signed off on it?  Obama and his entire Administration was in on it!",
        "good": "2",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "edmurphy23095",
        "time": "1 September, 2022",
        "context": "Anyone paying attention understands there was massive election fraud in 2020.\nYet, those who question that rigged outcome are a threat to democracy, just as anyone critical of sexualizing children is fomenting violence against trans people. Democrats are full of it.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cthebull1",
        "time": "1 September, 2022",
        "context": "Obama was the lead in putting America on a socialist path. It was blocked by Trump but is coming back in full force under Biden. We are going down the same path as the Roman Empire which with circuses and free food provided by the slaves (us)",
        "good": "2",
        "bad": "0",
        "replies": [
            {
                "user_name": "jadeona447",
                "time": "1 September, 2022",
                "context": "He still is he is running the show from behind the curtain",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "johnn707",
        "time": "1 September, 2022",
        "context": "Joe will say 'If you don't vote for the Democrats the boogie man will get you.' He has nothing else. He owns the current mess.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "skyeanne",
        "time": "1 September, 2022",
        "context": "According to who you fact check.  I went for all dem media outlets, even tho omg...I'm republican.  There were 157M according to one media and the 2nd media,  153M registered voters in the USA for 2020.   Biden allegedly got 80+M and Trump 70+M..   Explain that to me.  If those numbers are true,  something is stinky and it's not cheese in Denmark.  Those numbers say that 99% of registered voters voted 2020..  This doesn't discount any who didn't vote or were pushing up dirt.   The norm for our election history was 48% and  52% when Trump won 2016.",
        "good": "1",
        "bad": "1",
        "replies": [
            {
                "user_name": "doriengrey58399",
                "time": "1 September, 2022",
                "context": "That is absolutely true! ",
                "good": "0",
                "bad": "2",
                "replies": []
            },
            {
                "user_name": "advocatus.diaboli",
                "time": "1 September, 2022",
                "context": "155 million votes cast out of 232 million registered voters.  66.8% voter turnout.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "freedomforever642",
                        "time": "1 September, 2022",
                        "context": "230 million is about the total population. last time i checked, kids and illegals can't vote. ",
                        "good": "1",
                        "bad": "1",
                        "replies": [
                            {
                                "user_name": "advocatus.diaboli",
                                "time": "1 September, 2022",
                                "context": "330 million is the population of the USA.  That means 100,000,000 are not registered to vote.",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "tortuga6",
                "time": "1 September, 2022",
                "context": "Your numbers are wildly off.  Go to the Census Bureau.  \n\nIn 2020, the total population was 252.3 million, of which 231.6 million were citizens.  There were 168.31 million people registered to vote in the United States.  The 2020 presidential election had the highest voter turnout of the 21st century, with 66.8% of citizens 18 years and older voting in the election, according to the U.S. Census Bureau. \n\nAs with past elections, a higher share of women (68.4%) than men (65.0%) turned out to vote. Voter turnout also increased as age, educational attainment and income increased. Voter turnout was highest among those ages 65 to 74 at 76.0%, while the percentage was lowest among those ages 18 to 24 at 51.4%. Overall, voter turnout increased as age increased, with the exception of 75-plus which had a turnout rate that was below 65-74 year-olds and not significantly different than the turnout for 55 to 64 year-olds. High school graduate turnout was 55.5%, while turnout for those with a bachelor’s degree was 77.9%. Overall, voter turnout increased as income increased, with the exception of those in the income ranges $10,000-$14,999 and $15,000-$19,999, which had turnouts that were not significantly different. For people whose income was $100,000-$149,999, turnout was 81.0%, while for people whose income was $30,000-$39,999, turnout was 63.6%.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "skyeanne",
                        "time": "1 September, 2022",
                        "context": "I went to the census bureau.  I also went to government statistics. Their numbers were even lower than dem media with all their voter breakdowns.............  and the bottom line was exactly the same.  and the btw numbers you  have given came right from one of the dem media...not the census bureau.  I also saw that article.... WHAT a surprise...",
                        "good": "1",
                        "bad": "1",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "Clap8",
        "time": "1 September, 2022",
        "context": "The threat to democracy was Hillary Clinton and her campaign manufacturing an entire Russian collusion scheme to interfere in the 2016 election to install Trump into Office and then when their scheme didn't work and was exposed for the crime it was, the Democrats adopted a new scheme to conspire with Big Tech and mainstream media to censor information threatening to Biden's campaign by absentia and direct a chosen narrative that would insure Biden occupied the Oval Office in 2021.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "queengoat",
        "time": "1 September, 2022",
        "context": "The Democrats are totally delusional in their thinking. When they do or say something it’s okay but God forbid a Conservative, a libertarian or a Republican says or does the exact same. ",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "BlueWeights",
        "time": "1 September, 2022",
        "context": "Well then go to civil war with us cowards!???? Civil war will solve all our problems!",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "al99689",
                "time": "1 September, 2022",
                "context": "whenever there is violent rhetoric and talk of civil war, etc. it always comes from the right.",
                "good": "0",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "BlueWeights",
        "time": "1 September, 2022",
        "context": "It's impossible for a candidate to win that didn't campaign at all, that alone is enough evidence for me to go to war in order to have fair elections! If you don't have fair elections then you don't have anything! THEY CHEATED, WAR IS INEVITABLE NOW! The wheels are already in motion, no one will ever trust elections again, it will be nothing but stress and bloodshed every election! WAR WILL FIX IT!",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "mktguy2",
                "time": "1 September, 2022",
                "context": "Aluminum foil is on Aisle 12. The rays are definitely seeping through.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "r68",
                        "time": "3 September, 2022",
                        "context": "Ask ZukeFacebook what he did.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "r68",
                "time": "3 September, 2022",
                "context": "FBI & ZukeFaceB now admit they changed the election by stopping stories on Joe/Hunter.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "jimmyd2402",
        "time": "1 September, 2022",
        "context": "Please list from one to ten in very clear specific terms Exactly WHAT THREATS MAGA and Ultra MAGA are to our democracy? Be very specific and clear..I will wait.",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "al99689",
                "time": "1 September, 2022",
                "context": "your leader attempted a coup and instead of making him a pariah for it you support and embrace his behavior.",
                "good": "1",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "r68",
                        "time": "3 September, 2022",
                        "context": "No insurgency. Hilary tried a coup on Trump for 4 years. Blm did insurgency and nothing happened to them.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "Godzilla323",
                        "time": "3 September, 2022",
                        "context": "He did ? And you have proof? Funny , I don't remember hearing or seeing any evidence!",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "Pr0gsr1d10ts",
        "time": "1 September, 2022",
        "context": "How many times did Maxine Waters say Trump was a illegitimate president? How many times did those democrat politicians tell their supporters to push back on republicans and tell them they are not welcome anywhere? Rep Raskin was one of the first dems to demand the election not be certified while the votes were being tallied. He also happens to have been on every impeachment trial and also on the Jan 6th fake commission. I just laugh when dems call republicans a threat to democracy. What country do they live in because this sure is not a democracy. It is a Democratic REPUBLIC.",
        "good": "2",
        "bad": "1",
        "replies": [
            {
                "user_name": "4katydid",
                "time": "1 September, 2022",
                "context": "Real Americans understand that when you say we are a democratic republic it means you wish we were still a country where only rich White men had a voice and a vote.  Sorry but you were born a few centuries too late.",
                "good": "2",
                "bad": "2",
                "replies": [
                    {
                        "user_name": "Muxman",
                        "time": "1 September, 2022",
                        "context": "Real Americans understand it's written in our Constitution and honor it as such. James Madison, the father of the U.S. Constitution and primary author of the Bill of Rights, repeatedly emphasized that the United States is a “republic” and not a “democracy.”",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "travelon82",
        "time": "1 September, 2022",
        "context": "And a former First Lady still claims the election was stolen from her by Trump.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mktguy2",
        "time": "1 September, 2022",
        "context": "Axelrod is absolutely correct. Many Republicans have abandoned democracy and are now pitching full on autocracy with the Dear Leader as Savior.",
        "good": "2",
        "bad": "2",
        "replies": [
            {
                "user_name": "r68",
                "time": "3 September, 2022",
                "context": "FBI & zukeFaceB as well as other Dem media have now admitted to hiding stories about YOUR BrokeBorderJoe/Hunter stories. Election interference. Trump was right.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "jadeona447",
        "time": "1 September, 2022",
        "context": "Where is the wizard of oz Obama",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Conny364",
        "time": "1 September, 2022",
        "context": "Axelrod; another criminal in the Obama Administration.   There were a lot of them weren't there.   Funny how Trump had none.    Oh, none that weren't FBI situated process crimes that is!",
        "good": "2",
        "bad": "1",
        "replies": [
            {
                "user_name": "al99689",
                "time": "1 September, 2022",
                "context": "Trump administration: 82 criminal indictments, 58 convictions in 4 years. Obama in 8 years: 0",
                "good": "1",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "r68",
                        "time": "3 September, 2022",
                        "context": "It is now known Obama used FBI to spy on Trump. Obama/Holder gun runners with cartel. Gun was used to kill border patrol soldier",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "r68",
                        "time": "3 September, 2022",
                        "context": "No convictions",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    }
]