[
    {
        "user_name": "dementianiro",
        "time": "6 hours ago",
        "context": "Iranian drones? The Biden Crime Family wants in.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "abandonsocialmedia",
        "time": "6 hours ago",
        "context": "Since biden likes Iran too will we declare war on Ukraine now?  If we do I wonder how much more of our money uncle Joe will give Ukraine to fight us",
        "good": "5",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "pineisland",
        "time": "6 hours ago",
        "context": "Iran will need all of it's drones to spy on women not covering their face/body properly.  Evil begets evils.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "varoom230",
        "time": "6 hours ago",
        "context": "But Zelenskyy said he’s ok with Europe funding the purchase of the drones by buying Russian gas 🤣",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "knifehands",
        "time": "6 hours ago",
        "context": "I don't know what an evil drone is, but I kind of want one now",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mjdloc157731",
        "time": "6 hours ago",
        "context": "So we are helping a country with ties to Iran?",
        "good": "0",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "perogi007",
        "time": "6 hours ago",
        "context": "Come November Americans are going to strike down a lot of Chinese drones.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jackd2345",
        "time": "6 hours ago",
        "context": "He needs more money",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "varoom230",
        "time": "6 hours ago",
        "context": "Now that’s going to hurt Iran 🤣",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "manfromseptember",
        "time": "6 hours ago",
        "context": "Well it’s 2 sides to that coin!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "seventhreich",
        "time": "6 hours ago",
        "context": "Ukraine military should take over and send Zelenskyy to USA . 👍👍",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "me@18229",
        "time": "6 hours ago",
        "context": "And the comedian continues...with our clown-in-charge sending our money over and over. We have sent more than all the others by far.",
        "good": "8",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "seventhreich",
        "time": "6 hours ago",
        "context": "God has changed its sides now . God is with the east . West is doomed . You I’ll see 🤮💩🐖👺",
        "good": "0",
        "bad": "3",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "ginal",
        "time": "6 hours ago",
        "context": "This guy is wasting our money.  We lise our savings and he gets rich. They are not a member of NATO for a reason.  Show me how much money the Bidens get from her along with China and Russia. This is all a ruse to protect the deadbeat Hunter",
        "good": "11",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "redfoxhuntrr",
        "time": "6 hours ago",
        "context": "The US should not be supporting this evil dictatorship. We are sending tax dollars to a dictator who is nothing more than a money conduit to the Biden crime family. ",
        "good": "5",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "vaffanculo....",
        "time": "6 hours ago",
        "context": "Zelensky is willing to send every Ukrainian to their death. When he losses the war there will be less opposition to his corruption and nazis",
        "good": "8",
        "bad": "5",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "rjahme",
        "time": "6 hours ago",
        "context": "Now Zelensky wants to fight Russia to get Crimea back.  Th more biden gives him, the more Zelensky wants.  It is PAST time for a peace agreement.\nThe problem for Biden is,that would confound his main goal, which has nothing to do with Ukraine.  Biden just wants to pick a new leader for Russia.  Regime change- it has always been So successful…NOT.",
        "good": "15",
        "bad": "20",
        "replies": []
    },
    {
        "user_name": "thebigragu",
        "time": "6 hours ago",
        "context": "Intel said that 15 were delivered to Russia since 8 have been shot down in a week they won’t last\nanother week",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "ScottWheeler",
        "time": "6 hours ago",
        "context": "\"No grain for you!\"",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "C63AMG",
        "time": "6 hours ago",
        "context": "Failure Russia has to buy drones from Iran hahaha",
        "good": "3",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "gallowspoll",
        "time": "6 hours ago",
        "context": "Quick read here. No country on the planet should have any kind of ties with Iran. They've always backstabbed any they've ever had ties with.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "x-150",
        "time": "6 hours ago",
        "context": "40, 50, 60 billion dollars? Joe gave to this guy, and they have taken back 2% of the 25% of the land Russia occupies, at this rate it'll take them over ten years at the cost of trillions of U.S. dollars to get the rest back.",
        "good": "12",
        "bad": "7",
        "replies": []
    },
    {
        "user_name": "rjahme",
        "time": "6 hours ago",
        "context": "Zelensky, your 15 min of fame are up.  Fight your own war.",
        "good": "4",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "mullah_obama",
        "time": "6 hours ago",
        "context": "Zelenski is a Soros' puppet. This is why Pelosi, Biden and the rest of Biden's Socialist cabal are doing everything possible to keep that guy in power.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "👌DemusStultus",
        "time": "6 hours ago",
        "context": "Meanwhile, Zelenskyy gets richer and richer off of US dollars.",
        "good": "6",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "JamesBomb",
        "time": "6 hours ago",
        "context": "The end is near for the collaborator.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "anamericancorrespondent",
        "time": "6 hours ago",
        "context": "Even the Ukraine understands you do not show any respect to a nation ruled by international terrorists. Yet, here in America, we have Coyote Joe still wanting to reestablish the agreement between Obama and the Terrorists to allow them to have a nuclear bomb. At least Coyote Joe can claim dementia, but Obama knows he has no one to blame when this goes south......and south it will go!",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "clownyfish",
        "time": "6 hours ago",
        "context": "Joe Biden and Obama are in love with Iran...\nThey're on the Hunter payroll there... ",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "sendit080",
        "time": "6 hours ago",
        "context": "\" Ukrainian President Volodymyr Zelenksyy said that the Iranian ambassador to Ukraine,  had been stripped of his accreditation  number of Iranian staff  to stay  Iranian embassy significantly\"reduced. \nYeah, that'll learn um. Then Zelenksvy asked for another 30 billion",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "pfe01",
        "time": "6 hours ago",
        "context": "Why any sane country have diplomatic ties with the Iranian fanatics in the first is beyond me. ",
        "good": "32",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "GMac9561",
        "time": "6 hours ago",
        "context": "But we will make a deal with Iran that will absolutely allow them to produce nukes. Thanks Joe Biden.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "peterbuilt",
        "time": "6 hours ago",
        "context": "So does that mean he want be selling Iran any more American weapons 🤔 \nWell atleast China is still buying them",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jc1980157",
        "time": "6 hours ago",
        "context": "You remember when Barack Hussein Obama was president and he had our Military to land that high tech drone in Iran and gave it to the Iranians.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "miles2go851",
        "time": "6 hours ago",
        "context": "and yet mr potato head is begging iran for more oil while sending billions to the ukraine to combat these drones.   does anyone still not see the american public is being played?  folks it not rain this administration is pouring down on us.",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "moldyweed",
        "time": "6 hours ago",
        "context": "It's okay to be White.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "anyonebuttrump982",
        "time": "6 hours ago",
        "context": "If Old Bone Spurs was in charge Ukraine would have invaded Russia",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "nordicsd",
        "time": "6 hours ago",
        "context": "There's going to be a bumper crop in Ukraine next year!  The decomposing bodies of dead Russian soldiers make great fertilizer, and now Russia is sending even more fertilizer!",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "beautifulman457",
        "time": "6 hours ago",
        "context": "Yet John Kerry wants us to partner with Iran on a new arms deal.  Has the administration made a good deal with anyone since taking office?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "SLNTMJRTY",
        "time": "6 hours ago",
        "context": "Wouldn’t it be wonderful if there’s a way for smart Ukrainians to hack these drones in-flight and have them turn back and fire at their point of origin.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "hunterslaptop007",
        "time": "6 hours ago",
        "context": "No worries. Biden had breakfast with them last week and looks forward to tell you all about it.",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "latinosportrump991",
        "time": "6 hours ago",
        "context": "I smell a draft coming in the near future.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "eli56",
        "time": "6 hours ago",
        "context": "So you had ties with Iran the one country that wants to destroy the USA. UKRAINE IS THE EVIL ONE.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "45twice",
        "time": "6 hours ago",
        "context": "Biden likes Iran and will probably give them another sack of money like Obama.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "barneyfiffe",
        "time": "6 hours ago",
        "context": "No more computer chips to Iran!",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "☭macto-cognatus☭",
        "time": "6 hours ago",
        "context": "Russia has inflicted serious damage on Ukrainian forces with the recently introduced Iranian Shahed-136 Kamikaze Drones, in its first wide-scale deployment of a foreign weapons system since the war began, \"Iranian drones carried out several devastating strikes in Ukraine’s Kharkiv region over past week,\" In one brigade in just one week, at least 6 self-propelled howitzers & 4 armored personnel carriers were destroyed by such drones. Ukrainian commanders say.",
        "good": "1",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "tupperhouse",
        "time": "6 hours ago",
        "context": "Who knew that the Iranians used our alphabet??? Enough of the phoney pictures.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Williamdealz",
        "time": "6 hours ago",
        "context": "So Iranian drones are evil, but American switch blades which have one purpose which is to kill are ok. I get it show me the money$$$$ Down with Ukraine...",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "outsiderperspective470",
        "time": "6 hours ago",
        "context": "And the Russian trolls are out in force. You can spot them a mile off, trading on memes they think will resonate and playing the Fox comments algorithms. Fox, OTY as to why you’re ok with this? Cos it’s an easy fix.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "hebrews1024",
        "time": "6 hours ago",
        "context": "Why are the arms we send and Uk uses not evil?? Bloodshed would have ended months ago if Brandon and Co. allowed them to sign a peace agreement..every death past July is on America's and EU hands....",
        "good": "7",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "outsiderperspective470",
        "time": "6 hours ago",
        "context": "Russia down to North Korean and Iranian military equipment suppliers. Good luck with that. Last century that stuff may have been helpful.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Gorgo271",
        "time": "6 hours ago",
        "context": "Says a lot about Zelensky to have diplomatic ties with these terrorist women killers in the first place",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Eirik_Finn",
        "time": "6 hours ago",
        "context": "Support all who reject Putin, Xi, Kim, Ortega, Ali-Khamenei, Orban, Lukashenko, Maduro, ...",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "error": "error"
    },
    {
        "user_name": "ron_tom",
        "time": "6 hours ago",
        "context": "It appears the lubyanka keyboard battalion has all its katusha propaganda guns firing on all chambers today! \nYou should be trying to convince your highly non-willing conscripts to die needlessly. I wouldnt be surprised if many just shoot their commanding officers in the back on the field and run off. They can rot alongside other generals enriching the soil there.\n\nYou've got to love classic old soviet humour, even in the most desperate circumstances:\nCoerced Man: Why should we fight?\nConscripting woman : For your future?\nMan: Future??? We don't have a present!!!\nOther Man: If putin wants to fight for his wealth and mansions, he should go and fight himself.",
        "good": "8",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "just4laughs",
        "time": "6 hours ago",
        "context": "Democrats and Muslims are both the same, claim victim status until you are the oppressor ",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "alex.615",
        "time": "6 hours ago",
        "context": "Clown is unhappy? May be it's time to stop this circus?",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "cowboyjoe",
        "time": "6 hours ago",
        "context": "Zelenskyy sent a note of thanks to Pelosi and Schiff for getting him in on fleecing the American taxpayer…I could wear a nicer shirt but I am trying to be like   Zucky…that dude has some cash and living in Hawaii…",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "TakeResponsibility339",
        "time": "6 hours ago",
        "context": "From people I know in Odessa last night. Сегодня в Одессе летали беспилотники Иранские\nIranian drones flew in Odessa today. Их сбили, были взрывы\nThey were shot down, there were explosions. Also - США поднял в небо сегодня ночью редкий и уникальный самолёт, который следит за радиактивным оружием\nThe United States took to the skies tonight a rare and unique aircraft that monitors radioactive weapons.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "MostCriticalThinking",
        "time": "6 hours ago",
        "context": "This is exactly how we stumble into another world war.  Keeping the lines of communication open is essential.  Posturing only forces people to take sides.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Crusader3421",
        "time": "6 hours ago",
        "context": "A lot of you don’t seem to understand the implications this war will have on the stability of Europe if Russia is able to capture Ukraine. Yes, the down side is we have given them billions of dollars in military hardware to conduct a counter offensive. Ukraine has destroyed a large portion of the outdated Russian military by mostly using small arms which is impressive. If Russia was able to capture Ukraine, they would move on to the next country, and the one after that, and so on. It would destabilize Europe and if you think our economy is bad now, just wait. A bonus is the Ukrainians are fighting a proxy war for NATO and they have destroyed a large portion of our enemies military. Win win",
        "good": "29",
        "bad": "15",
        "replies": []
    },
    {
        "user_name": "AntonChigurh",
        "time": "6 hours ago",
        "context": "\"All mighty russian army\" depends on some turkish drones... imagine what their \"hypersonic \" missiles really are... a total bluff !",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "justmythough",
        "time": "6 hours ago",
        "context": "When this war is over…and it will end with a Russian victory it’ll be interesting to see which politician will have the guts to ask where all the American tax dollars that were given to Ukraine were spent…",
        "good": "2",
        "bad": "8",
        "replies": []
    },
    {
        "user_name": "LIBSUX47",
        "time": "6 hours ago",
        "context": "Brilliant Iranians.....just climbed aboard the sinking \"USS Russia\".🤣",
        "good": "7",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "chickenlittle7",
        "time": "6 hours ago",
        "context": "and brandon can't wait to sign a treaty.......need more proof, or are you a hopeless liberal sheep?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "JamesBomb",
        "time": "6 hours ago",
        "context": "Ask any cab driver in Moscow..\nAmericans are the stinkiest, and need a bath.",
        "good": "0",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "🐧tuxx4570🐧",
        "time": "6 hours ago",
        "context": "Zelensky just bought an 8 million dollar home in Rishpon, Isarael for his parents with US aid $$.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "☭macto-cognatus☭",
        "time": "6 hours ago",
        "context": "Iranian Shahed-136 Kamikaze drone- loitering munitions used by the Russian Armed Forces are causing havoc in the Odessa region. \nDozens of them are being used today to destroy radar, air defense and HIMARS systems.",
        "good": "1",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "LIBSUX47",
        "time": "6 hours ago",
        "context": "Brilliant Iranians.....just climbed aboard the sinking \"USS Russia\".🤣",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "just4laughs",
        "time": "6 hours ago",
        "context": "Look Russia is using the drones Obama gave to Iran.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "saltyvanillabawlz",
        "time": "6 hours ago",
        "context": "Technically... didn't Ukraine interfere in our elections?  Is this the Russia the Dims were speaking of?  Quid Pro Joe... straight up caught on video.   \nNow... somehow someone turned this into our war.   \n$56 billion spent,  so far.  \nGive us the dirt you have on the Bidens,  or not 1 more penny of our money. ",
        "good": "3",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "Eirik_Finn",
        "time": "6 hours ago",
        "context": "MAGA, do not be hoodwinked by anti-freedom Putinists posting here. Any who are promoting Ukraine being bombed out of existence, promoting an appeasement of Putin's invasion is an anti-freedom Putinist. Support Putinists, enable Putinist lies and they add you to their list to subjugate down the road. Simple.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "LIBSUX47",
        "time": "6 hours ago",
        "context": "Brilliant Iranians.....just climbed aboard the sinking \"USS Russia\".🤣",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rjahme",
        "time": "6 hours ago",
        "context": "Biden caught between Iran and Ukraine.  Which corrupt country will Biden choose?",
        "good": "0",
        "bad": "3",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "moldyweed",
        "time": "6 hours ago",
        "context": "Zelensky loves this untracebale American cash.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "klnkat",
        "time": "6 hours ago",
        "context": "The Ukraine sould be mad at this country in reallity!!!\n(TV news sources revealed that the Iranian regime’s successful replication of this drone was not as result of any cyber, and decryption operations, and that in fact the drone was delivered to the Iranian regime under the direct order of President Obama, after secret talks between the Islamic Republic and the United States.)",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "☭macto-cognatus☭",
        "time": "6 hours ago",
        "context": "The time of HIMARS has ended, we're now in the era of Shahed.😎 [but but muh HIMARS O CLOCK? 😭].",
        "good": "1",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "termyt",
        "time": "6 hours ago",
        "context": "Really should not have had relations with Iran to begin with.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "steve977",
        "time": "5 hours ago",
        "context": "Ukraine had no problem with Iran funding and helping to supply terrorism around the world before.",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "jimmyc1965625",
        "time": "5 hours ago",
        "context": "Uh oh! Major Wallace isn't pulling off his \"I am ethick United American States citizen\" act. His superior at the troll farm needs to tell him that he would be more useful at the Front than st the troll farm",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "belikewater114",
        "time": "5 hours ago",
        "context": "All modern day US Presidents should take credit for kicking Russia's ask per request of the Ukraine government except for Donald Trump. Donald Trump is long time certified Russian Beach!\nhttps://www.foxnews.com/politics/trump-vetoes-national-defense-bill",
        "good": "2",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "JamesBomb",
        "time": "5 hours ago",
        "context": "Ukraine surrenders by spring.\nOr global armeggedon caused by Joe.\nTake your pick.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "noahsarkcantsavedemsfromredtsunami",
        "time": "6 hours ago",
        "context": "NUKE IRAN..NUKE IRAN..NUKE IRAN..NUKE IRAN! ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "unbiasedx",
        "time": "6 hours ago",
        "context": "Ukraine claims these drones are against the life and health of Ukrainian citizens, but they are shelling and killing their own civilians every day and they have been doing it officially since 2014.",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "JamesBomb",
        "time": "5 hours ago",
        "context": "Zelenskyy, best comedian ever.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "xxia",
        "time": "6 hours ago",
        "context": "There is one rule that had never been broken: whenever a leader of a powerful country fears that he might lose power, he would desire a war.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "txpride829",
        "time": "6 hours ago",
        "context": "To the great Russian people. it is time to replace this corruption autocratic government. It's not worth sacrificing your youth for a delusional and evil regime. Come join the free world. God made you free. Your children and grandchildren are counting on you. ",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "JamesBomb",
        "time": "6 hours ago",
        "context": "This just in..\nZelenskyy shocked Israel refuses to sell weapons to the Nazi's.",
        "good": "1",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "kenblankenship55",
        "time": "5 hours ago",
        "context": "Russia is saving Russians in the Ukraine from the horrible things they have been subjected to for decades.  The Ukraine IS Russia and has been for hundreds of years.",
        "good": "3",
        "bad": "8",
        "replies": []
    },
    {
        "user_name": "America’sBattalion",
        "time": "6 hours ago",
        "context": "The Iranian regime are all cold blooded murderers. Responsible for the murder of 241 servicemen. Beirut Lebanon October 23, 1983. No accountability or consequences. No deal. ",
        "good": "23",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "justsomethoughts501",
        "time": "5 hours ago",
        "context": "There you go Biden, that is how a patriot and true leader handles Iran.  Stop being a weakling with your subsequent negotiations with Iran because you want something for posterity.  The only legacy you will leave is the hurting of America security and economy.  Worst president ever.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "DaftDims",
        "time": "5 hours ago",
        "context": "Ukraine has so much dirt on corrupt Biden , the flow of hush money  will never end as long as he is president.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "gib0217",
        "time": "5 hours ago",
        "context": "I am surprised so many nations want diplomatic relations with Iran.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "occamsrazornow!",
        "time": "5 hours ago",
        "context": "Zelensky is a c.i.a. puppet leader. Just like kim jung un and his father are and the base of operations of c.i.a. is in north korea.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "davinci_one",
        "time": "5 hours ago",
        "context": "Zelensky is a fraud",
        "good": "8",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "disappearingtruth",
        "time": "5 hours ago",
        "context": "The evil of Iran (mullahs and military, mostly) go well beyond drones to Russia. Anyone doubting that , ask the people, women especially. I was in school with several Iranian students back in the day and they were polite, cordial people away from the corrupting elements that run their country.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "geronimo11",
        "time": "5 hours ago",
        "context": "You are watching History repeat itself. Europe and Asia are starting to find more reasons to kill each other again. This time the United States should stay out of it and let this play out. This is the main reason people from that part of the world are waiting in line to Legally Immigrate to the United States.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "⭐JohnnyStarSpangle⭐",
        "time": "5 hours ago",
        "context": "Always olive drab on Zelensky. I see no scars.",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "error": "error"
    },
    {
        "user_name": "tr34",
        "time": "5 hours ago",
        "context": "Pretty sad & telling when you have to get your drones from  from Iran !",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jimmyc1965625",
        "time": "5 hours ago",
        "context": "Major Wallace is flailing at the troll farm... he'd be more useful to the Motherland serving at the front lines",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "HOa401",
        "time": "5 hours ago",
        "context": "Russia will not stop with Ukraine they want more of europe —-> and the big one,  the Artic . ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "FinalDemocratAdministration791",
        "time": "5 hours ago",
        "context": "Bet Biden ends the aid to Ukraine now.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "johssmith556",
        "time": "5 hours ago",
        "context": "Stop spending tax payer's money in Ukraine. We need our southern border invasion fixed.",
        "good": "14",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "Figmo2001",
        "time": "5 hours ago",
        "context": "So, the country that that threatens to start WWIII is begging Iran to send them cheap Chinese drones to help conquer lil’ ol’ Ukraine?    And their still losing?\n\nMight wanna think twice about your plans for global domination, Vlad",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "natebone",
        "time": "5 hours ago",
        "context": "So using that same logic, Brandon has gotten us into a war with Russia by providing arms and money to Ukraine",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "hope7677",
        "time": "5 hours ago",
        "context": "But I'm sure Biden is still having Putin negotiate his nuclear deal with Iran! This couldn't be more embarrassing for the US. You look at everything President Trump did, to bring peace and stop wars. Not by sending millions in weapons and money, but by standing up to the bullies! They knew he wasn't a push over. You can look at pics of DT with the problem world leaders, and you can see the fear, you can see Trump refuse to lean his arm in or bow to the Saudi Prence..  But Biden, Obama, Clinton, all week and are puppet presidents following an agenda to kill America. ",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "jimmyc1965625",
        "time": "5 hours ago",
        "context": "Sorry Russian troll farms-- your propaganda campaign has been a huge bust. Shut down operations and send the trolls to the front, starting with Major Wallace",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Bidensaputz2020",
        "time": "5 hours ago",
        "context": "I don’t know why you think Iran cares",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "nothingbuta",
        "time": "5 hours ago",
        "context": "Someone tell Tucker that if Russia has to buy drones from Iran, the war is NOT going well for them!",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "yeahthattoo894",
        "time": "5 hours ago",
        "context": "The traitors in the Biden Administration are risking nuclear war to support a corrupt dictator who just happens to be the President of The Ukraine.  This is insanity on steroids.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "blasph",
        "time": "5 hours ago",
        "context": "With all Zman knows he could of ended the war in 2 days. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "vlo14295",
        "time": "5 hours ago",
        "context": "oddly, Biden doesn't care about the sovereignty and territorial integrity of the US, as well as the life and health of US citizens by not securing the border",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "tsingh10",
        "time": "5 hours ago",
        "context": "why did not he break ties with China  India, Africa or other countries who are also suppliers to Russia.  USA is using HIM TO recover from Afghan disaster.",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "LoneStarRanger",
        "time": "5 hours ago",
        "context": "Drones that the US either supplied or paid for....\n\n\"Let's go Brandon!!\"",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "charles73",
        "time": "5 hours ago",
        "context": "Many countries should break diplomatic ies with Iran. This would enhance sanctions.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mantis1972",
        "time": "5 hours ago",
        "context": "Does this mean gas will be rising higher than it has already?",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "kodiak5660",
        "time": "5 hours ago",
        "context": "WHAT A CON-MAN..........WHAT HAPPENS IN UKRAINE IS NONE OF OUR DAM BUSINESS....ITS A NEVER ENDING MONEY LAUNDERING PIT FOR ZELINSKY AND A GROUP OF AMERICAN POLITICIANS.....",
        "good": "4",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "henry012",
        "time": "5 hours ago",
        "context": "Unfortunately for Ukraine, for Iran's rulers, their greatest hatred is for the USA. I think that Iran is happy to sell drones to Russia, because the USA is supporting Ukraine, and of course to gain revenue to circumvent sanctions.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "steve977",
        "time": "5 hours ago",
        "context": "Ukraine got a great ROI on hunter biden. Give hunter a few million and the big guy sends them $40B plus",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "taxpayer1776036",
        "time": "5 hours ago",
        "context": "The Actor Zellensky",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "dsmilitary",
        "time": "5 hours ago",
        "context": "yet Biden and the rest of the socialist are chomping at the bit to get into bed with Iran and make a deal with them, traitors every one of them",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "☭macto-cognatus☭",
        "time": "5 hours ago",
        "context": "In a recent experiment conducted by The California Institute of Technology(Caltech), it was discovered that most American Ukraine fanbois not only could not locate it on a map, but had no idea there was a country named Georgia either.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "platopus",
        "time": "5 hours ago",
        "context": "Hopefully the evil Iranian regime will fall the same time as Putin's.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Papadopoulos810",
        "time": "5 hours ago",
        "context": "Give it up, Z.  You lost.  Russia won.  ",
        "good": "4",
        "bad": "3",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "hikesomeday",
        "time": "5 hours ago",
        "context": "Shocking not so much, but the Biden administration supports Iran,",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "peterbuilt",
        "time": "5 hours ago",
        "context": "American government is buying up all the iodide pills 💊 \nNot sure why, maybe to send to Europe or maybe not",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "noneyer",
        "time": "5 hours ago",
        "context": "Today Ukraine like Russia is a dictatorship.  Zelinski has banned competing political parties.",
        "good": "3",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "C63AMG",
        "time": "5 hours ago",
        "context": "Both Iran and Russia’s failed dictatorships are about to collapse, America wins again.",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "error": "error"
    },
    {
        "user_name": "jv17",
        "time": "5 hours ago",
        "context": "No more money!!! Let Europe pay to protect their own continent,  we have enough to worry about here at home.",
        "good": "2",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "750illegalsdead!",
        "time": "5 hours ago",
        "context": "WW1 and WW2 all had minor Battles and sooner or later things will escalate.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "paralegalatlarge420",
        "time": "5 hours ago",
        "context": "Joey Biden doesn't mind spending 50 billion of our tax dollars defending the Ukrainian border, while refusing to spend a single dollar protecting our own border from the tons of Fentanyl pouring into America that has killed over 120,000 American citizens in the last 18 months.  Apparently Joey believes the lives of the Ukrainian people are far more important than the lives of the American people he is supposed to represent and protect.",
        "good": "4",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "equinox5933",
        "time": "5 hours ago",
        "context": "Our involvement in this war is very suspicious. We sent them over 50 billion, starved our reserve of military weapons, deplete our Strategic Oil Reserve, leave 80 billion worth of the latest tactical equipment in Afganistan, and introduce so-called diversity policies in our military designed to weaken our readiness and spend 50 billion arming our Government offices including the Dept of Education. can anyone justify this insanity?",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ArgyBargy001",
        "time": "5 hours ago",
        "context": "Why is Russia losing the war? Because when have they been in a real war? Their troops know nothing about ground wars. They have relied on the \"Nuclear threat\" while the U.S., Britain, Australia etc have been fighting wars all over the world and know what to do. Now their troops are dropping their riffles and fleeing.  The civilian men are fleeing the country because of the draft that will give them 2 weeks of training before they go to the front line.",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "woodyjones",
        "time": "5 hours ago",
        "context": "This war can end when people remove the crooked and corrupt Zelensky from above ground. He's nothing but a pawn for the Biden crime family and now the Democratic money laundering process back into the pockets of the politicians.",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "Briareus",
        "time": "5 hours ago",
        "context": "lol...you think Iran gives a hoot?",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "yeahthattoo894",
        "time": "5 hours ago",
        "context": "When did Congress declare war with a nuclear armed Russia?  The United States Constitution is clear — the President doesn’t have the power to involve America in any war.  Only Congress can declare war.  The Biden Administration is endangering every American by risking a nuclear war to support an authoritarian dictator who is ruling The Ukraine.  The documentation of Joe Biden’s corruption must be extensive for Beijing Joe Biden to be so reckless.  Congress needs to put a halt to this insanity, and end Biden’s military adventurism before Russian nukes start obliterating our cities.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "vinnys007136",
        "time": "5 hours ago",
        "context": "Major. Wallace is actually Jonathan Polard, the israeli spy that was jailed in America.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "MrdaveMcMarty",
        "time": "5 hours ago",
        "context": "Well Iran is now having domestic trouble Mr. Zelensky so now is the time to hop on that bandwagon.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "blueeyedroofkorean",
        "time": "5 hours ago",
        "context": "Oh? Is the people uprising in Iran stealing the spotlight?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "MrdaveMcMarty",
        "time": "5 hours ago",
        "context": "Now that Iran's Mullahs may be on the ropes, it is time for Zelensky the ACTOR to make his move.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "supernaut869",
        "time": "5 hours ago",
        "context": "Well, at least I know Iran hates us and we don't give them billions like we give vlod. .  ..      oh wait a minute.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "taxpayer1776036",
        "time": "5 hours ago",
        "context": "Zellensky wears more make up and hair color than most actors",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bb2c2",
        "time": "5 hours ago",
        "context": "I'm sure Iran is all choked up about it.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "wagonrd",
        "time": "5 hours ago",
        "context": "DjI clones from China?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "clark44882",
        "time": "5 hours ago",
        "context": "If America only had a leader like Zelenskyy.",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "charger68",
        "time": "5 hours ago",
        "context": "Has Brandon sanctioned Iran or is he still letting Russia set up the new peace agreement with them for the U.S.?",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "hipowerdad112",
        "time": "5 hours ago",
        "context": "\"MUST GET MOOSE AND SQUIRREL!!!!\"\nVladimir Putin",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "richi56",
        "time": "5 hours ago",
        "context": "The sham referendums in occupied territory will only increase the pressure on Putin, since he will be seen as not defending \"Russian\" territory against Ukraine fighting to take it back.  A dangerous situation for Putin and the rest of the world.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "deltron2099",
        "time": "5 hours ago",
        "context": "It’s pretty funny that trump thinks the US would lose in a war against Russia",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "just4laughs",
        "time": "5 hours ago",
        "context": "Awesome, Obama gave the drones to Iran then accused Trump of colluding with Russia, now Russia is using the drones to attack Obama's partners in the Trump lies.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "butlerjim79",
        "time": "5 hours ago",
        "context": "Watch out Prez Z. Uncle Joe might not like you dissing Iran while he is trying to cut a deal with the mullahs.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "NKITSAP",
        "time": "5 hours ago",
        "context": "Ukraine should declare war on Iran and take the trash out there also. ",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Vae_Victus",
        "time": "5 hours ago",
        "context": "Russia, China , Iran , Today's axis of evil. 🇺🇸",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "nosuchthingasfreeride",
        "time": "5 hours ago",
        "context": "Brandon's Iranian Nuke deal would give the Iranians billions of dollars to make more drones and send to Russia.  The way I see it, The Big Guy is probably getting kickbacks from Iran, Russia and the Americans arms manufacturers for the war fighting materials The Big Guy is providing to the Ukrain.  It's a win, win, win, situation for The Big Guy!",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "C63AMG",
        "time": "5 hours ago",
        "context": "Vladdy calling President Xi:\n\n“New phone who dis?”",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "flybywire54",
        "time": "5 hours ago",
        "context": "At least 80,000 Russian dead or wounded , over 3000 square miles just lost , NATO expanding , 300,000 Russians about to be sent to their likely death . Bravo Putin , with such friend as you , Russia doesn’t need enemies. ",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "what1806",
        "time": "5 hours ago",
        "context": "I think there is more than one major wallace. I have muted him twice and he still shows up. I do not think any one take the comments section seriously at Fox. It is purely for entertainment. Or at least I hope so.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "arcke",
        "time": "5 hours ago",
        "context": "Maybe something good will come out of these latest protest in Iran??",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cmdrdm",
        "time": "5 hours ago",
        "context": "Well done, Ukraine.\nChina-Russia-Iran-N Korea are the Axis of Evil.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "just4laughs",
        "time": "5 hours ago",
        "context": "Russia, China, Iran, California.\n\nToday's axis of evil",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "ghost2020769",
        "time": "5 hours ago",
        "context": "Seriously--it took this long to do this?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "just4laughs",
        "time": "5 hours ago",
        "context": "Obama's drones attacking Ukraine who bought security from Hunter Biden Paintings.\n\nperfect ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sherlockhomeless169",
        "time": "5 hours ago",
        "context": "In our next billion dollar shipment of cash to Zelenskyy, let's throw in a suit so he'll have the proper costume to wear as he plays the role of a country's leader.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "tyredcynic",
        "time": "5 hours ago",
        "context": "Who cares?\nThe only info I want out of the Ukraine/Russia kerfuffle is when we're getting paid back.\n...And I don't care which side is paying or who eventually wins.\nMoney.\nIn the hand.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "shanie246",
        "time": "5 hours ago",
        "context": "Zelenksyy is one tired man who has worked hard for freedom and all those he cares about.  Freedom is never free.",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "zarkastic",
        "time": "4 hours ago",
        "context": "Are you sure those drones were not from Biden's military arsenal in Afghanistan.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "chris-x",
        "time": "4 hours ago",
        "context": "2012: Ukraine is the most corrupt government ever…\n\n2022: An illegitimate president sends billions to Ukraine to pay off constituents",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "kuffiryogurt",
        "time": "4 hours ago",
        "context": "We are seeing three anti-American entities forming a new Axis of Evil: Iran, Russia, and the Biden Administration.",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "just4laughs",
        "time": "5 hours ago",
        "context": "People in Russia have more personal freedom than those in California ",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ymu",
        "time": "5 hours ago",
        "context": "Kamikaze drones.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mrultramaga",
        "time": "5 hours ago",
        "context": "WW III will be the Globalists VS the Nationalists.  it's about time to pick a side folks. \n\ni can tell you, the larger our own government has gotten, the worse things have turned out.  so i know which side i am on.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "chris-x",
        "time": "4 hours ago",
        "context": "Shouldn't our President be pushing for more farming here in the United States?\n\nShouldn't our President be pushing for more extracting of fossil fuels here in the United States?\n\nThe actions in Ukraine should push us to become more independent from the rest of the world.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "sonofkahn",
        "time": "5 hours ago",
        "context": "If it was Isreal the Iranians would get Isreali drones back!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "chris-x",
        "time": "4 hours ago",
        "context": "Biden is disarming America under the guise of sending weapons to the Ukraine.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "chris-x",
        "time": "4 hours ago",
        "context": "In a very real sense American citizens are funding both sides of the war.\n\nBillions and billions of our tax dollars are sent to Ukraine.\n\nBiden’s war on energy production raises the price of oil and finances Russia.",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "chris-x",
        "time": "4 hours ago",
        "context": "Why do we have so many bio labs in Ukraine?  It isn't like Ukraine is a hotbed of pharmaceutical research. ",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "chris-x",
        "time": "4 hours ago",
        "context": "Ukraine will fight Russia down to the last American dollar.\n\nAmerica will fight Russia down to the last Ukrainian soldier.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "terencegringgo",
        "time": "5 hours ago",
        "context": "The evils are you and joe.. that ket thousands die for personal agenda",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "debragail804",
        "time": "5 hours ago",
        "context": "QUIT GIVING UKRAINE ANYMORE MONEY AND WEAPONS",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "old69gto",
        "time": "4 hours ago",
        "context": "I would bet Iran is really concerned.  What is little Zelenskyy going to do when the Chinese start selling to the Russians?  That is probably secondary to what we and the rest of the west is going to do.",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "19sdi57019",
        "time": "4 hours ago",
        "context": "I don't see what the Ukraine's complaint is, they are taking in weapons from outside sources also.",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "Katyusha777",
        "time": "4 hours ago",
        "context": "There won't be a \"Ukraine\" when this is all over with.",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "gonemad",
        "time": "5 hours ago",
        "context": "But it’s ok for Ukraine to use the rest of the worlds weapons? What a joke! ",
        "good": "1",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "concerned556",
        "time": "5 hours ago",
        "context": "American taxpayers have foot this Bill long enough...too much money is unaccounted for. Let the other NATO counties step up and pay their fair share..",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "neveragn",
        "time": "5 hours ago",
        "context": "I missed that part where Joe called out Russia’s accomplice countries at the UN speech",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "howaboutthem",
        "time": "5 hours ago",
        "context": "zelensky wants the next 1.4 trillion in unmarked bills",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "just4laughs",
        "time": "5 hours ago",
        "context": "No worries, Putin has just declared a COVID-19 emergency and printed 50 million Mail in ballots.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "🇺🇸USAFRetired👨‍✈️",
        "time": "4 hours ago",
        "context": "Zelenskyy doesn’t look too stressed, probably Russian vodka on the table.  Sorry, but I don’t have any sympathy for Ukraine.",
        "good": "4",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "chris-x",
        "time": "4 hours ago",
        "context": "When Democrats gained total control of Washington in 2021, they inherited energy independence, gasoline at $1.90/gallon, record job growth in all demographic groups, and the ability to supply our European allies with gasoline and natural gas.  Immediately after his inauguration, Biden suppressed domestic energy production and canceled the Keystone pipeline, returning the U.S. to energy dependence.  He eliminated tens of thousands of American jobs and created the present inflationary spiral, with gas now costing more than $5/gallon.  By green-lighting the Nord Stream pipeline from Russia to Germany and stifling our own energy production, Biden made western Europe dependent on Putin for energy.  This provided Putin with the money needed to prosecute the war in Ukraine.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "just4laughs",
        "time": "4 hours ago",
        "context": "Obama and John Kerry are war criminals and will be brought up on charges after America wins this war with democrats",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "ranger231674",
        "time": "4 hours ago",
        "context": "The Russian mobilization system is struggling to execute the task Russian President Vladimir Putin set and will likely fail to produce mobilized reserve forces even of the low quality that Putin’s plans would have generated unless the Kremlin can rapidly fix fundamental and systemic problems. \n\nPutin and Defense Minister Sergey Shoigu announced that the Russian Armed Forces would mobilize combat-ready reservists to quickly stabilize the frontlines and regain the initiative on the battlefield.\n\nMilblogger and social media reports, however, show that Russian military recruitment centers, enlistment officials, and local administrations are mobilizing men who do not meet the Kremlin’s stated criteria, especially Shoigu’s promise that mobilization would prioritize men with “combat experience.”",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "THE💀LEFT=PURE💀EVIL💀vs😃ULTA😃MAGA😃FOREVER!!!",
        "time": "4 hours ago",
        "context": "Why has Putin let the Jewish actor live?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "KSang486",
        "time": "4 hours ago",
        "context": "Thinking NATO is running out of options in Ukraine.  When Putin talks he seems to be the most sane one of the bunch.  Russia has just about had enough of NATO and is going to put the hammer down.  We need regime change in Washington DC.  Both side Republicans and Democrats are crazy.",
        "good": "5",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "chris-x",
        "time": "4 hours ago",
        "context": "Ukraine is at the center of the cult of globalists. It is a center of money laundering for the oligarchs and their allies in the United States. It is at the center of Russia collusion and the whole false narrative.",
        "good": "4",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "chris-x",
        "time": "4 hours ago",
        "context": "Germany is thinking of stopping its support of Ukraine. ",
        "good": "2",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "chris-x",
        "time": "4 hours ago",
        "context": "As soon as the Deep State stole the elections it was clear that their would be wars. ",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Northbynorthwest",
        "time": "4 hours ago",
        "context": "Russians have a plan. 150,000 newly trained young soldiers will flood Ukraine this Christmas. Wake up EU. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "chris-x",
        "time": "4 hours ago",
        "context": "The 2014 Obama/Biden engineered coup in Ukraine thought they could make Ukraine something that it's never been so it could serve as a little playground for the CIA..And we are expected to fall for everything Biden and company say about it.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "JeyEm",
        "time": "4 hours ago",
        "context": "just wipe off this nomadic barbarians and world will be in peace again and this happen soon zelensky days are numbered ",
        "good": "2",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "Katyusha777",
        "time": "4 hours ago",
        "context": "So how did your $50 billion in Ukraine work out? you could have eradicated all poverty in the USA for the same price.",
        "good": "5",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "scottyknows58",
        "time": "4 hours ago",
        "context": "That Putin is scrambling for help just shows how weak Russian military strength is. He had to hire Wagner Group Civilian Murderers to help him. \nHe had to get Backstabber Belarus to help him. Now he needs Iran to help him? Big bad Russia doesn’t look so big and bad now. Russians are panic fleeing the country to avoid being cannon fodder right now. FSB officers are telling their friends the conscripts Putin is gathering to throw up front are as good as dead already. Either killed by Ukrainians or shot in the back by the Wagner Group Murderers if they hesitate going into the meat grinder. Still Dead either way.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "vinnys007136",
        "time": "4 hours ago",
        "context": "Iran is zero threat to America, they're not suicidal. Iran would be a much better ally than the apart-heid israelis. We could have .99 cents per gallon of gas and trade with Iran would have our economy booming.",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "ArrestKlausSchwab",
        "time": "4 hours ago",
        "context": "Clown with a t-shirt. This is all just a sideshow as the Central Banking Cartel destroys the global economy to bring in their \"Great Reset\" plan for global neo-feudalism. Wake up, people. We're all being deceived and enslaved!",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "johng43",
        "time": "4 hours ago",
        "context": "So what. Biden has no intention of letting this \"war' end either. This could be over in a day but is being supported by our tax dollars for a proxy war in support of a corrupt despot Zelensky.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "american_freedom_1955",
        "time": "4 hours ago",
        "context": "The sun is up, what are MAGAs crying about today?",
        "good": "1",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "isitafact",
        "time": "4 hours ago",
        "context": "Anyone else notice the desperation of the Russia trolls posting today? Do you think it is because they are about to be called up and are trying (unsuccessfully) to prove their worth?",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "chris-x",
        "time": "4 hours ago",
        "context": "Americans can not allow this to continue. We need to demand answers from all of our elected officials the likes of Biden, Pelosi, McConnel, Romney, and Graham, as to why the US DOD has been funding bio-labs in Ukraine.",
        "good": "1",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "AwarenessMatters",
        "time": "4 hours ago",
        "context": "Another meanigless headline trying to keep Ukraine relevent while Rome (aka the US) burns. ",
        "good": "2",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "skippy311",
        "time": "4 hours ago",
        "context": "You take away Russia's Nukes and they ain't S H !T.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ranger231674",
        "time": "4 hours ago",
        "context": "Russian opposition outlets and Telegram channels leaked information suggesting that the Kremlin aims to complete this partial mobilization by November 10 and that the Kremlin is seeking to mobilize 1.2 million men instead of the publicly announced 300,000.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "chris-x",
        "time": "4 hours ago",
        "context": "WE are suppose to be defending Democracy in Ukraine??? We are a SHAM BANANA REPUBIC.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "esteban51",
        "time": "4 hours ago",
        "context": "It's evident that Ukraine is the Texas of Europe. You just don't mess with them.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "yogajitsu",
        "time": "3 hours ago",
        "context": "Trump supporters are thinking why dont we send weapons to russia so they can win",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "chris-x",
        "time": "4 hours ago",
        "context": "How about Europe breaking with NATO? Or, more simply put, the break up of NATO. Up to this point Europe has embraced the delusion that Russia cannot function economically without a European market. The last six months of Russia’s Special Military Operation have proven that the opposite is true–without Russia’s key resources Europe is a dead economy walking naked into a frozen winter.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "chris-x",
        "time": "4 hours ago",
        "context": "As soon as the Deep State stole the elections it was clear that their would be wars such as what is happening in Ukraine. ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "THE💀LEFT=PURE💀EVIL💀vs😃ULTA😃MAGA😃FOREVER!!!",
        "time": "4 hours ago",
        "context": "How those \"sanctions\" going, [freezing] Westerners? LOL!!! \n\nPS - And how's the right half of Ukraine going (apart from it laying in smoldering ruins, of course)?",
        "good": "0",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "chris-x",
        "time": "4 hours ago",
        "context": "The United States and Europe are playing a high stakes poker game with Russia. They’ve bet all their chips that Ukraine will either defeat Russia or force Russia to the bargaining table and that Putin, with hat in hand, will crawl on his belly before the western masters and beg for relief. That is insane. But there are many politicians and pundits inhabiting the dark corners of Washington who keenly believe this fantasy.",
        "good": "3",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "yogajitsu",
        "time": "3 hours ago",
        "context": "So now trump supporters support iran",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "chris-x",
        "time": "4 hours ago",
        "context": "The Russia/Ukraine war already has created significant fissures among EU members, with Hungary refusing to impose further sanctions on Russia. Cold, hungry voters will become increasingly outraged at sending millions of dollars to Ukraine while deprivation multiples from Berlin to London.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ranger231674",
        "time": "4 hours ago",
        "context": "Challenges and errors in the first days of executing a large-scale and demanding partial mobilization in the midst of a failing war are not necessarily surprising, although they suggest that the Russian military mobilization infrastructure was not better prepared for a major war than the Russian armed forces themselves. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ranger231674",
        "time": "4 hours ago",
        "context": "The highly nationalist and pro-war milblogger community is calling on the Kremlin to address these mobilization issues rapidly, but the Kremlin is unlikely to be able to meet their demands. \n\nRussian milbloggers express cautious optimism that partial mobilization will reinforce degraded combat units and allow Russian forces to advance in Donetsk Oblast, but are concerned that the Kremlin’s failures to enforce mobilization according to the law and stated policies will create political unrest.\n\nOne milblogger stated that the Kremlin’s poor handling of the partial mobilization is giving rise to “separatist movements” and opposition media.\n\nAnother milblogger noted that the Kremlin’s failure to fix mobilization practices within the military recruitment centers may shatter Russians‘ trust in the military-political leadership.\n\nA failed or badly flawed partial mobilization campaign may risk further alienation of the Russian nationalist crowd that has been supportive of the war and mobilization.\n\nIt's all starting to go horribly wrong for Putin.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "chris-x",
        "time": "4 hours ago",
        "context": "General Winter is on the march.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "ranger231674",
        "time": "4 hours ago",
        "context": "Divergences from the mobilization decree and from Putin’s and Shoigu’s statements about the categories of men who are exempt from mobilization are also causing anger and mistrust toward Russian federal subjects and the Kremlin itself. \n\nSome social media footage already shows mobilized men fighting with enlistment officers, arguing with mobilization representatives, and refusing to serve under unlawful orders.\n\n Some milbloggers claimed that some of the discontented men who have been wrongfully mobilized would have accepted their fate if they had actually met the mobilization criterium.\n\nThe Kremlin is thus committing unmotivated and potentially angry men to war with the task of regaining the initiative in an offensive war in a foreign land on a battlefield far from home.\n\nThat doesn't bode well!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ranger231674",
        "time": "4 hours ago",
        "context": "Russian partial mobilization efforts are suffering from serious and systemic problems in their first days, generating popular resentment and setting conditions to produce a mobilized reserve force incapable of accomplishing the tasks Russian President Vladimir Putin has set for it.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ranger231674",
        "time": "4 hours ago",
        "context": "Ukrainian forces reportedly shot down an Iranian-made Mohajer-6 drone in an unspecified area of the Black Sea, likely near Odesa.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "THE💀LEFT=PURE💀EVIL💀vs😃ULTA😃MAGA😃FOREVER!!!",
        "time": "4 hours ago",
        "context": "All this Ukrainian death because the Jewish actor could not say no to the US military industrial complex, nor to his own NATO membership aspirations.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "👌DemusStultus",
        "time": "3 hours ago",
        "context": "There is zero American accountability as to where this American taxpayer money is going. The Ukrainian oligarchs love it.  And so do the American Arms manufacturers.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "chris-x",
        "time": "4 hours ago",
        "context": "What would be a way and what would be the practical implications if Europe in general and Germany in particular were to break with the US in order to find a European peace and economic framework including Russia? ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "yogajitsu",
        "time": "3 hours ago",
        "context": "Trump supporters realize russia and iran are on the same side?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Eirik_Finn",
        "time": "4 hours ago",
        "context": "Putin's first shift of propaganda squirrels is over. Throwing-in with evil Putin shames you and your descendants, squirrels. Get as far away from evil Putin as you can, while you still can.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "scottyknows58",
        "time": "4 hours ago",
        "context": "I hope every member of the Wagner Group from top to bottom gets identified and hunted down wherever they go. Capital Punishment enforced on all of them. This Propaganda that The Wagner Group is a elite military force fighting opposing military forces is a lie. The Wagner Group isn’t fighting Ukraine’s military on the front lines. They are creeping behind in taken territory Murdering civilians. That is what The Wagner Group does. They kill and torture helpless unarmed civilians.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "thebiglebowski142",
        "time": "4 hours ago",
        "context": "FAT DONNY tried to extort favors from Ukraine for congressionally approved arms..\n    FAT DONNY failed and was impeached for that.",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "thebiglebowski142",
        "time": "4 hours ago",
        "context": "Israel still has normal trade relations with Russia..\n   funny how Fox doesn't mention that.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "chris-x",
        "time": "4 hours ago",
        "context": "The United States is facing its own looming economic disaster. The collapse of the stock market–now down over 20% since the first of the year–is likely to continue. Notwithstanding the Biden administration’s strident insistence that there is no recession, the signs of recession are mounting, especially in the housing market. But the worsening economic picture is not yet sufficient to generate the necessary political pressure among the propagandized American electorate to back away from sending billions to Ukraine. A major shock of stagflation or a collapse of the Ukrainian army, however, could change that calculus.",
        "good": "5",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "THE💀LEFT=PURE💀EVIL💀vs😃ULTA😃MAGA😃FOREVER!!!",
        "time": "4 hours ago",
        "context": "If you're for the Jewish actor, then you're for the corrupt globalist pigs, our version being the brain-dead, fraudulent Potato in Chief.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "IGetAround",
        "time": "4 hours ago",
        "context": "WHY did/are we sending so much money to this guy?  WHY?  I don't care about him and his country....AMERICA FIRST!",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "yogajitsu",
        "time": "3 hours ago",
        "context": "Trump supporters think iran is right and us is wrong",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "yogajitsu",
        "time": "3 hours ago",
        "context": "What trump supporters should do is stop thinking",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Old-Timer",
        "time": "1 hour ago",
        "context": "If Putin wants to \"draft\" soldiers, let him lead them into the conflict.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "ranger231674",
        "time": "3 hours ago",
        "context": "Half of Russia’s 5 million police and law enforcement officials should be drafted, Chechnya leader and close Putin ally Ramzan Kadyrov said Saturday in an apparent sign of concern about the quality of draftees called up in Russia’s mobilization drive. \n\n“Even if we exclude reservists from the equation, we still have a colossal staff of employees who, one way or another, have good physical training and weapons skills,” he said, referring to Russia’s Ministry of Emergency Situations and the nation’s many intelligence, enforcement and policing agencies.\n\nThings are getting a bit tense in Russia, aren't they?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ranger231674",
        "time": "3 hours ago",
        "context": "Finland will soon cut off entry for many Russians after a rise in border crossings attributed to Russia’s mobilization order, according to public broadcaster Yle. \n\nIt is one of the last European Union member states with a land border open to Russians. Poland, Estonia, Latvia and Lithuania closed their borders to most Russian citizens.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "ranger231674",
        "time": "3 hours ago",
        "context": "Riot police arrested demonstrators in Russian cities, with more protests against the mobilization order planned in Moscow and St Petersburg on Saturday evening. \n\nAt least 69 people were arrested in the Siberian cities of Novosibirsk and Tomsk, according to rights monitor OVD-Info.\n\nIt's all starting to go horribly  wrong in the mother land isn't it?",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "mymothersdaughter858",
        "time": "1 hour ago",
        "context": "It is cute that Zelensky thinks Iran cares what he thinks 🤣",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Williamdealz",
        "time": "1 hour ago",
        "context": "You evil is my good..",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "joe-knows-trump-won",
        "time": "1 hour ago",
        "context": "\"Wahh wahhh wahhh! Iranian drones are better and cheaper than the ones I bought from Turkey, Waaahhhh!\" = Ellesnky.",
        "good": "0",
        "bad": "0",
        "replies": []
    }
]