[
    {
        "user_name": "jamesokc",
        "time": "31 May, 2021",
        "context": "It becomes fascination every time something comes out that the US Military is holding out on us on things like this.  We will certainly all have our reason for wanting to hook in and get our thinking of beings from out of this world.  We are still a planet with billions of people on it and can assure you a few of them don't care.  Let's enjoy all we can while we can.",
        "good": "40",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "DelibStupidLibs",
        "time": "31 May, 2021",
        "context": "Well, I DID fall out of a spacecraft while looking out a hatch door.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Happy_in_Montana",
        "time": "31 May, 2021",
        "context": "Dr. Crazy Eyes",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "BrandonsJimCrow2.0👌",
        "time": "31 May, 2021",
        "context": "Am i on candid camera?",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "occer",
        "time": "31 May, 2021",
        "context": "Personally I think holograms. Satellite emitted holograms from Russia and China to detect American response.",
        "good": "12",
        "bad": "14",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "dennismcguire",
        "time": "31 May, 2021",
        "context": "Maybe if they supplied our pilots with something better than a Kodak Brownie we could see for ourselves.",
        "good": "29",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Patrolman",
        "time": "31 May, 2021",
        "context": "If Russia and China have drones capable of flying that this, we are in trouble.",
        "good": "28",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "DelibStupidLibs",
        "time": "31 May, 2021",
        "context": "Let's ask lebron...he knows quite a bit about basketballs.",
        "good": "92",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "jjim",
        "time": "31 May, 2021",
        "context": "I'm with the physicist. If something can violate what we know about accelerations, velocities, changes in direction, etc. That what we have learned and seen over the past 400 years missed a lot.  We are talking here about the level of science and engineering that has taken us from five miles an hour behind a horse to sending self controlled machines to Mars that land themselves. All of that tech is based on an understanding of physics that goes back to Newton.  What these flyers think they saw just didn't happen.",
        "good": "33",
        "bad": "39",
        "replies": []
    },
    {
        "user_name": "areyakiddingme",
        "time": "31 May, 2021",
        "context": "If our military is seeing so many of these ufos  Why are they not shooting at any of them???  This is either China or Russia it is definitely man made",
        "good": "1",
        "bad": "8",
        "replies": []
    },
    {
        "user_name": "arkansastraveler",
        "time": "31 May, 2021",
        "context": "Oh, geez.  Here we go again with the \"logical explanation\" ruse.  Ten bucks says the government got to this guy and is paying him or pressuring him to propose \"weather balloon\" explanations of all these sightings.  It's what they have done for the last 75 years.  If the technical experts in the military and those who SAW these things operate can't explain them, how is this TEACHER in a cloistered university environment going to give us an accurate assessment of them?    Remember J. Allen Hynick and Project Blue Book?  He was TOLD by the Air Force/Government to lie in order to debunk what private citizens had seen and experienced, then decided he couldn't do that and started supporting the idea of E.T. vehicles and beings.  The  time is nearing when the REALITY of these beings is going to become common knowledge.  And our lives will never be the same.  The Fed has been lying to us at every turn of the road on this issue.",
        "good": "52",
        "bad": "29",
        "replies": []
    },
    {
        "user_name": "CelebritiesLie",
        "time": "31 May, 2021",
        "context": "As a Navy veteran, should I be incensed that they called It Nav instead of Navy. I say not because the toddler that wrote this likely graduated from a liberal school and doesn’t know how to write properly.",
        "good": "8",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "JoeRippley",
        "time": "31 May, 2021",
        "context": "I lost my soul when I fell to earth\nMy planets call me to the void of my birth\nThe time has come for me to kill this game\nNow open wide and say my name\nSpace Lord mother mother!!!",
        "good": "3",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "zygote314",
        "time": "31 May, 2021",
        "context": "Was that a refutation of the evidence? Reading this article is a waste of time.",
        "good": "8",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "william985",
        "time": "31 May, 2021",
        "context": "UFO's, Bigfoot, and Black Peoples ID on polling day!",
        "good": "9",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "YourReptilianOverlords",
        "time": "31 May, 2021",
        "context": "A rendering glitch in the Matrix.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "OrangeController",
        "time": "31 May, 2021",
        "context": "We've not been around long enough to find aliens, let alone them find us. People who have not studied astronomy have a hard time comprehending... time.",
        "good": "5",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "cegg",
        "time": "31 May, 2021",
        "context": "Nothing but ghosts or flaws of the monitoring systems.  The spatial distance between stars is just too great even if you grant randomness (Drake's equation) of aliens existing because of the large number of solar systems.",
        "good": "6",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "zulu302291",
        "time": "31 May, 2021",
        "context": "I think it's Bigfoot.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "william985",
        "time": "31 May, 2021",
        "context": "Except that the pilots saw them with their own eyes.  As well as many sailors.  This guy may be splitting hairs and that may be important in his world, but regardless of the details, these things moved at phenomenal speeds and accelerated/decelerated at such a fantastic rate, it would have ripped anything man-made to shreds.",
        "good": "164",
        "bad": "30",
        "replies": []
    },
    {
        "user_name": "gotwoodonmtn",
        "time": "31 May, 2021",
        "context": "DARPA.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "revrebar",
        "time": "31 May, 2021",
        "context": "The author assumes the pilots either didn’t see what they thought they saw or didn’t know how operate their equipment.  He’s mistaken.  And the images are recorded.  Known drones can’t operate like the videos show.",
        "good": "10",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "reason101t",
        "time": "31 May, 2021",
        "context": "This is just another incarnation of the same silly argument for decades - that blurry images of items in the distance mean something.",
        "good": "7",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "t-bone267",
        "time": "31 May, 2021",
        "context": "Nephilum.\nThey are there.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "areyakiddingme",
        "time": "31 May, 2021",
        "context": "We can see the hair follicle from space in the desert of Afghanistan why are the pictures so blurry!!???",
        "good": "29",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "SagittariusA*",
        "time": "31 May, 2021",
        "context": "A naval or air force pilot knows speed and maneuverability. They’re trained in it, and how to counter it to kill their enemy. I believe them when they say that it was fast. Or that it couldn’t possibly maneuver like that. We have the best pilots in the world bar none. I believe them.",
        "good": "127",
        "bad": "13",
        "replies": []
    },
    {
        "user_name": "shadowbanned25",
        "time": "31 May, 2021",
        "context": "Lets get some electric piano's and flashing light boards up there. I'm sure they have tubas and lights to talk back o us..............",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "SenileBiden248",
        "time": "31 May, 2021",
        "context": "We are being monitored as an early sentient species just developing our space travel capabilities.  Fortunately, if any extraterrestrial aliens intended to take us over it would have already happened.  We must be absolutely fascinating to them. Can’t wait to meet them.  I’ll bet we went from first aerial flight to lunar body faster than any species in the history of the universe. 66 years?  Impressive.",
        "good": "19",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "n3wtym3",
        "time": "31 May, 2021",
        "context": "Also, he pointed out that footage from a 1940's propeller aircraft in B&W had better views than the current jet-engine, digital videos being released.",
        "good": "18",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "RandyRhoadsPilot",
        "time": "31 May, 2021",
        "context": "Wait till they see Hillary on here broom...",
        "good": "52",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "veej157",
        "time": "31 May, 2021",
        "context": "160 mph is nothing...  just like this story",
        "good": "14",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "rathervoteformycat367",
        "time": "31 May, 2021",
        "context": "Why does all the footage look like something from a 1970’s video game?",
        "good": "95",
        "bad": "8",
        "replies": []
    },
    {
        "user_name": "towncrier1234",
        "time": "31 May, 2021",
        "context": "These objects are too small to be manned and too slow to be considered extraterrestrial. They're probably some drones being tested out by a foreign country.",
        "good": "9",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "Cyberdactyl046",
        "time": "31 May, 2021",
        "context": "Anyone else notice UFOs are always, and I mean ALWAYS shot at as grainy a resolution as possible at a mile or more?",
        "good": "32",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "xminus1",
        "time": "31 May, 2021",
        "context": "Geez.  All we need now is Georgio and Richard C. Hoagland to tie this all together.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Biden'sVisitingAngel",
        "time": "31 May, 2021",
        "context": "Looks to me like a bee got trapped inside the camera. Yip, I'm pretty sure of it...",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "LandSurfer60",
        "time": "31 May, 2021",
        "context": "Aliens spacecraft that travel across the Universe don’t need Blinking lights, they won’t harass our Aircraft, or show themselves, they have mastered stealth, and consider us a prehistoric species, no probing or animal mutations... ",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "johnsmithusa1776",
        "time": "31 May, 2021",
        "context": "LOL, you know how you point a laser, and make a cat chase it? Well...",
        "good": "5",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "IndependentAmericano",
        "time": "31 May, 2021",
        "context": "They are Aliens. Duh ",
        "good": "2",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "OrangeBottleOpener",
        "time": "31 May, 2021",
        "context": "A fly on the lens",
        "good": "3",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "LastLawman060",
        "time": "31 May, 2021",
        "context": "Skeptics have already shown that some of the motions seen in the videos (like the ocean skimming) may be artifacts of the cameras’ optics and tracking systems,\" he wrote.\n\nOnly problem with that theory is radar can't \"lock on\" to a video anomaly or artifact. These skeptics are exactly that, people who will never be able to admit the existence of other possible intelligence until it is 100% in their face undeniable.. and that's fine. I'm the same way when it comes to the Loch Ness.\n\nHowever, the military reports are numerous and credible. There is something out there be it advanced technology coming from China/Russia or something from out of this world. Either way, we need to get answers.",
        "good": "341",
        "bad": "80",
        "replies": []
    },
    {
        "user_name": "fightcensors",
        "time": "31 May, 2021",
        "context": "Consider for a moment... we have cameras in space that can read license plates on the ground... we have technology that can determine the composition of planets, asteroids, and comets millions of miles away.. Yet... only fuzzy photos of UFOs",
        "good": "22",
        "bad": "4",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "theredundanceofitall",
        "time": "31 May, 2021",
        "context": "Keep in mind, he's only one astrophysicist...\n\nI'm no academic, but UFO's and their capabilities blow me away.  Imagine the power you'd need to bend/manipulate/distort gravity.  \n\nIt's brain-bending.  They go a billion miles a millisecond and then come to a dead stop with no problem.\n\nMakes me wonder what kind of guns they have.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "SenileBiden248",
        "time": "31 May, 2021",
        "context": "Like him or hate him: Trump is a person of immediate action.  The minute he started the Space Force he was taking action.  Better yet: he threatened the aliens covertly during one of his press conferences.  I love that- only Trump would do something like that.  Biden is probably trying to deploy his crackhead son and sleazy brother to shake the aliens down for space credits or something...",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sentinel58",
        "time": "31 May, 2021",
        "context": "Another talking head disinformation pseudo guru . He clearly didn't read Cmdr Fravers Statement about the tracking systems. It would be better for dummys like this to not talk before they know what they are talking about.",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "scottj",
        "time": "31 May, 2021",
        "context": "I have to be honest I will sleep a lot better if I know this technology is alien rather than it be possessed by Russia or China",
        "good": "24",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "just_a_patriot",
        "time": "31 May, 2021",
        "context": "So his column appeared in the NYT.   It may as well have appeared in one of those other supermarket papers.... you know... that one that shows Bill Clinton shaking hands with an alien.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "scottj",
        "time": "31 May, 2021",
        "context": "Up to 14 drones???? Circling our naval ship either disappearing above the radar ceiling or below the water not necessarily traveling at high speeds out in the middle of the ocean.  Following the ship for hours and then disappearing. If this technology is from Russia or China we have a real problem",
        "good": "61",
        "bad": "4",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "1pingyes2pingsno",
        "time": "31 May, 2021",
        "context": "He's another swamp gas advocate. As for the adversary theory...there's no way Russia or China have built these objects. Their technology is either copied or stolen from the US. If America didn't create these objects, nobody on this planet did.",
        "good": "28",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "GeauxTigers",
        "time": "31 May, 2021",
        "context": "“Top Astrophysicist”....he is a professor at the University of Rochester. How “top” could he possibly be???",
        "good": "12",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "scottfreeee",
        "time": "31 May, 2021",
        "context": "I think the same about space aliens as I do about Bigfoot. There is zero physical evidence of the existence of either.  \nThe distances between stars is so vast that I think we will never get a visit from any aliens that are out there.  \nIf I'm wrong and they CAN traverse hundreds or thousands of lightyears, I refuse to believe that they would not make themselves known upon their arrival. ",
        "good": "28",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "CharlieReckless",
        "time": "31 May, 2021",
        "context": "Nobody is traveling hundreds of thousands  or millions of light years just to mess with pilots and people with old shaky vhs recorders. This is either something terrestrial, or something inter dimensional. Normally it would seem something “inter dimensional” would come off as even more SCIFI but tbh, even worm hole theory proposes inter dimensional travel. So why does it have to be from our own known universe? People want so badly for their to be space invaders I can’t understand why lol",
        "good": "7",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "goldie",
        "time": "31 May, 2021",
        "context": "Wow, Frank. Are you the federal government lacky sent in to debunk the videos, or are you that stupid on your own? \"Russians enticed American fighter pilots to turn on their radar.\" I can tell you from first hand knowledge pilots turn on equipment unless there is a restrictive EMCON condition, and I doubt that was the case off the American West Coast. I bet every system was ON except the weapons release button. Fire control radar and other optics are nearly always ON unless training exercises prohibit or other conditions are set by battle commanders. They are always operational or the aircraft doesn't leave the ship. Bracketing a target is not an offensive weapons system, but an internal control feature, and thus, changed nothing emanating from our aircraft. Furthermore, a guided-missile cruiser tracked the objects using their SPY1-A radar, and I can tell you with certainty, that system is amazing. So when they said they see contact, it's there. That system can detect what many others cannot and with great reliability. I believe all the reporting stations and not you, Frank.",
        "good": "27",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "willofel3788",
        "time": "31 May, 2021",
        "context": "Another 60 years before the common people wake up to the reality that these are human created craft that were made by a shadow agency born in the 40's. They're not aliens, they're not Russian, they're not US \"military\", but they are very real. Unlikely I'll still be alive when people realize the truth.",
        "good": "1",
        "bad": "7",
        "replies": []
    },
    {
        "user_name": "Summer_Solstice",
        "time": "31 May, 2021",
        "context": "Black money cover story, imho.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "OrangePopsicle",
        "time": "31 May, 2021",
        "context": "It does seem odd that in the day of 8k video and 60+ megapixel cameras that all we have is this grainy footage that looks as if it were taken with an 8mm from the late 50s.",
        "good": "205",
        "bad": "14",
        "replies": []
    },
    {
        "user_name": "commondenominator405",
        "time": "31 May, 2021",
        "context": "They have shown themselves over the years but haven't tried to communicate because it would be like us trying to communicate with a frog.",
        "good": "14",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "FreedomPup",
        "time": "31 May, 2021",
        "context": "Everyone is so outraged by everything 24/7, a UFO could land in NYC like that movie 'Independence Day', and no one would even flinch. BLM would prob just protest the aliens for not being 'inclusive' or something...",
        "good": "37",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "miles",
        "time": "31 May, 2021",
        "context": "Everything he is saying doesn't explain why experienced military and civilian pilots all over the globe are baffled by some of what they have witnessed with their own eyes ... Never mind the instrumentation",
        "good": "19",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "fed-up257",
        "time": "31 May, 2021",
        "context": "There is always a Debbie downer in the room",
        "good": "5",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "CyanCoffee",
        "time": "31 May, 2021",
        "context": "what about the eye witness accounts from the pilots and sailors who say they saw this stuff with their own eyes?",
        "good": "10",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "bowulf",
        "time": "31 May, 2021",
        "context": "me too, star trek movies were more impressive ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "asshull",
        "time": "31 May, 2021",
        "context": "First of all, if it is earthly technology, we all know one continent that it wouldn't be from, besides Antarctica.  Second, why all the UFO sightings in the last few decades since man invented flight? Could there be a correlation?",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "👑QueenBiden👑",
        "time": "31 May, 2021",
        "context": "Gray Lives Matter 👽👽👽🛸",
        "good": "18",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "LibsStoleWhiteHouse",
        "time": "31 May, 2021",
        "context": "He may be right.\nIn these days, when consumer video resolutions have reached the 8k level, and the Hubble Telescope can show us galaxy formations BILLIONS of light years away in both distance and time, you'd think a multi-billion dollar warship and/or fighter jet could produce something better than a 1920's Buster Keaton train movie.",
        "good": "775",
        "bad": "47",
        "replies": []
    },
    {
        "user_name": "rexdragon",
        "time": "31 May, 2021",
        "context": "I get better pictures on my game trail camera than any UFO videos I've seen.",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "alk",
        "time": "31 May, 2021",
        "context": "So..what the astrophysicist is saying is that there was a flaw in the camera optics that was picking up the exact same thing that an independent flaw in the radar system was picking up, and that the pilot who was visually watching the exact same thing was also imagining what he was seeing.  Where do experts like this come from?  Are people actually supposed to believe them?",
        "good": "336",
        "bad": "44",
        "replies": []
    },
    {
        "user_name": "ljfast",
        "time": "31 May, 2021",
        "context": "This \"story\" tells us nothing of substance. Click bait.",
        "good": "8",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "johnsmithusa1776",
        "time": "31 May, 2021",
        "context": "talk about illegal aliens...",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "hcsaysarfarfarf",
        "time": "31 May, 2021",
        "context": "Its a flying squirrel in a reflective suit.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "crzybilly74",
        "time": "31 May, 2021",
        "context": "anyone ask Marc Singer yet if we should be expecting \"visitors\" from outer space which look like lizards posing as humans who happen to wear bright red uniforms?",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dadsnoangel",
        "time": "31 May, 2021",
        "context": "Way too easy to edited this as we have seen. If they are true where are our leaders?",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "dominousominous",
        "time": "31 May, 2021",
        "context": "Next I'm supposed to believe there's no bigfoot. Whatever dude. ",
        "good": "9",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "rms390",
        "time": "31 May, 2021",
        "context": "This UFO business is just a distraction from what's really going on",
        "good": "15",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "fleabitten",
        "time": "31 May, 2021",
        "context": "Ever since Obama won the noble peace award, or Biden placed Doctor Fauci in charge of the China Virus I have stop listen to 'experts'! Beside it's just a bug or weather balloon or piece of water on their screens right??",
        "good": "4",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "solace7",
        "time": "31 May, 2021",
        "context": "He has no real knowledge of what was observed.  The trouble is that images can be easily created these days by dishonest pranksters.  I too have a PhD in physics and can make no conclusion from the limited public data.  It is sobering, however, to consider the massive distances to the nearest planet that could house life as we know it.  The massive distance is a seemingly insurmountable barrier to potential visitors - unless our science is far more incomplete than we think.",
        "good": "147",
        "bad": "26",
        "replies": []
    },
    {
        "user_name": "scottj",
        "time": "31 May, 2021",
        "context": "I think it’s time for the government to tell us the truth they probably realize that the people here would rather hear That the technology is from another world than to suggest it’s from our enemies. Because let’s face it if the technology is otherworldly it’s been around for a long time and they haven’t bothered us. If we’ve been technologically leapfrogged by China or Russia we are probably cooked   ",
        "good": "261",
        "bad": "15",
        "replies": []
    },
    {
        "user_name": "rexdragon",
        "time": "31 May, 2021",
        "context": "Elon Musk's graphs of the advances of camera technology over time compared to the videos of UFO over the same period says it all.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "commondenominator405",
        "time": "31 May, 2021",
        "context": "Will it change us as a society, as a human race, once they reveal themselves to us? \nProbably not. We'll probably try to kill them.",
        "good": "4",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "comanchewill721",
        "time": "31 May, 2021",
        "context": "hasnt it ever dawned on you you will never find answers to Big Foot or to UFOs.  Read II Thes 2:9 and you will see reference to \"signs and wonders\".....figure it out people.",
        "good": "5",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "grendelbonecollector",
        "time": "31 May, 2021",
        "context": "Germ theory",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bkbearth'smightiesthero",
        "time": "31 May, 2021",
        "context": "Look bud, when you have UFO's or Unidentified Aerial Phenomenon with air craft that reaches speeds of up to 2300MPH, basically making even our F-18's look like they're standing still, you have to take notice of this and it's impossible not to...",
        "good": "16",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "1969fedaykin",
        "time": "31 May, 2021",
        "context": "Smoke and mirrors folks.Other things are going on.Stay the course. ",
        "good": "7",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "thomasrweaver",
        "time": "31 May, 2021",
        "context": "Lunch Bucket says he knows that UFOs are genuine cause he can sniff them.",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "willofel3788",
        "time": "31 May, 2021",
        "context": "Research \"Nazi Bell\" and where all those scientists went after the war. There's a secret vein of human technology that has been covertly developed for decades.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "hcsaysarfarfarf",
        "time": "31 May, 2021",
        "context": "That's not a UFO, it's AOC's thought bubble!",
        "good": "4",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "everyday",
        "time": "31 May, 2021",
        "context": "I think someone has figured out how to jam our defense systems with tic tac images. Imagine a battle with bogeys filling the screens of fighter jets and battle ships.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "BoogersInTheWoods",
        "time": "31 May, 2021",
        "context": "Anything to get your 15 minutes of fame, right Adam?",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "eastlabob",
        "time": "31 May, 2021",
        "context": "Any chance that aliens might abduct Joe Biden?",
        "good": "16",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "hcsaysarfarfarf",
        "time": "31 May, 2021",
        "context": "Joe Biden says \"it could just be another plane....Or it could be Superman\"",
        "good": "16",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "tavenger",
        "time": "31 May, 2021",
        "context": "Guys, if the LGMs want us to know, all they have to do is tell us. If they don't want us to know, there's no way in hell we'll ever find out.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "jman43215",
        "time": "31 May, 2021",
        "context": "Well, when I was abducted, and they were probing my southern regions, they told me by telemarketing that we (people), have ten years left before a distant race attacks our planet. I asked what race would attack us? They answered, this long old pronoun see ations that I couldn't understand. So, they inebriated it for me. BLM",
        "good": "3",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "HomeoftheBills",
        "time": "31 May, 2021",
        "context": "Well they had 7 of these saucer types at area 51 back in the late to mid 50's .Soon after we had the SR-71 the Black Bird .\nThey also had Aero Gel they got out of reverse eng.",
        "good": "4",
        "bad": "4",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "sonomacoast",
        "time": "31 May, 2021",
        "context": "The UFO images shown to us so far are like the pictures we are shown of Bigfoot or Nessie... always blurry... never clear... people that want to believe will.  I think I'll wait for real proof.",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "GreenDice",
        "time": "31 May, 2021",
        "context": "This dude is hiding something.",
        "good": "5",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "nomos",
        "time": "31 May, 2021",
        "context": "How about we all give up on the fruitless search for extraterrestrial life.",
        "good": "4",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "MolasarDAGod",
        "time": "31 May, 2021",
        "context": "Consider that the military in general and fighter jet pilots more specifically, are not generally privy to work performed by DARPA (Defense Advanced Research Projects Agency). They are if you'll pardon the expression, at some level of grunt; low, medium, or high but grunt nonetheless.\n\nQuantum mechanical physicists long ago postulated the kinds of Newtonian \"impossibilities\" we're hearing about now. If some of it has indeed attained fruition and reached testability, then the grunts are going to log and catalog their observations as UFOs.\n\nHere's a decade old, short but dense NASA introduction to Quantum Vacuum as a means of propulsion:\n\n\"... the idea of a “quantum ramjet drive” was proposed by Arthur C. Clark (proposer of geosynchronous communications satellites in 1945) in the book Songs of Distant Earth in 1985: “If vacuum fluctuations can be harnessed for propulsion by anyone besides science fiction writers, the purely engineering problems of interstellar flight would be solved.”  When this question is viewed strictly classically, the answer is clearly no, as there is no reaction mass to be used to conserve momentum. However, Quantum Electrodynamics (QED), which has made predictions verified to 1 part in 10 billion, also predicts that the quantum vacuum (lowest state of the electrodynamic field) is not empty, but rather a sea of virtual particles and photons that pop into and out of existence stemming from the Heisenberg uncertainty principle.\"",
        "good": "4",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "miles",
        "time": "31 May, 2021",
        "context": "Did this expert come from the same school as the one that the experts came from who told me the Wuhan virus couldn't possibly have come from a lab. Or said 'wear a mask, wait no don't , I mean do, I mean don't' ?",
        "good": "13",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "nomos",
        "time": "31 May, 2021",
        "context": "The search for extraterrestrial life is almost as big of a nothing burger as the \"“Trump collusion with Russia” investigation.",
        "good": "13",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "jeffhere",
        "time": "31 May, 2021",
        "context": "that's what his alien overlords told him to say.",
        "good": "3",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "OliveBus",
        "time": "31 May, 2021",
        "context": "Astropenis scientist. He's a professor and still employed. His woke overlords approve of him.",
        "good": "3",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "namrats853",
        "time": "31 May, 2021",
        "context": "i want to see ONE clear video just one....nothing fuzzy , no radar video just  ONE clear video\npreferable with little people in the cockpit or at the portholes........\nNOTHING else will convince me",
        "good": "15",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ah-gil",
        "time": "31 May, 2021",
        "context": "Saw a video on the youtube last night....some guy filmed the moon getting reset like a video or something. Video dont lie.",
        "good": "1",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "connman250",
        "time": "31 May, 2021",
        "context": "All movement is a bi product of temperature fluctuations!",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "beenherebefore348",
        "time": "31 May, 2021",
        "context": "Bigfoot is flying them.  The quality of photos match those of \"reputable\" Bigfoot sightings.",
        "good": "12",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "flasportsman",
        "time": "31 May, 2021",
        "context": "Drones???....instantaneous acceleration and moving 80,000 feet in less than a second, then making sharp right angle turns with out slowing while pulling 600 to 700 G forces? No sonic boom sound? No heat signature at all? No control surfaces nor signs of propulsion?\nIt's not hard to see why the military is so concerned.",
        "good": "37",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "pathfinderofwhatis",
        "time": "31 May, 2021",
        "context": "UFOs are real.  Those craft could not be from this planet and/or this dimension.  It is so astounding that people won't believe it - a type of denial, since they simply can't wrap their mind around such an extraordinary event - the biggest thing in human history.  \n\nNot only the biggest thing, but anywhere from extinction- catastrophic....to a very good thing.  And everything in between.",
        "good": "12",
        "bad": "10",
        "replies": []
    },
    {
        "user_name": "kaleesra",
        "time": "31 May, 2021",
        "context": "It’s already established they are here what’s more important is not if, it’s why.I’ve known they are here since 1983 can’t tell you how long they have been here before that.",
        "good": "6",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "captainsolon",
        "time": "31 May, 2021",
        "context": "Take me to your leader. What, Joe Biden. Ah, never mind.",
        "good": "8",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "jbrontey666",
        "time": "31 May, 2021",
        "context": "NASA is full of uber-nerds who's greatest dream is to find evidence of extraterrestrial life.  It's the holy grail.  To the point where we are spending billions to see if there are even indirect signs of long dead organisms in the soil and atmosphere of Mars.  If any of these very, very smart, driven and motivated scientists thought there was the actual possibility of bona fide intelligent life flying around in our own planet already and common enough to be seen by Navy pilots....well, this is all they would be doing.  You couldn't get any kind of MIT genius to look at chromatographs of Martian dirt, he would be 100% trying to get on a jet and fly around the coast of California 24/7.\n\nNeedless to say, none of them are doing this and nobody who really works in fields related to xenobiology takes UFOs seriously.  And they want to believe, it's just they understand what evidence is.  Interestingly, it's up in the air what will produce the first real evidence: rovers looking in our solar system, radio waves (SETI stuff) or images on telescopes looking at other planets in the galaxy.  Mostly depends on how common life really is out there.",
        "good": "17",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "TheTinMan058",
        "time": "31 May, 2021",
        "context": "It's not clear that any of these sightings were ever visually confirmed by pilots actually seeing them with the naked eye, which means everything is left up to only what was recorded by the electronic systems that detected them.  There is no telling what kinds of defects or flaws could exist in those systems.",
        "good": "8",
        "bad": "7",
        "replies": []
    },
    {
        "user_name": "kaleesra",
        "time": "31 May, 2021",
        "context": "I seen one in 83 it stopped about 100 feet over my head it was huge and metallic it rotated in the middle the lights in the middle blinked on and off it didn’t make a sound I was really afraid so I ran into a ditch by the roadside full of bushes it stayed there a few seconds then sped off faster then the speed of light \nThey are here again the question is why?",
        "good": "1",
        "bad": "9",
        "replies": []
    },
    {
        "user_name": "fudge7974",
        "time": "31 May, 2021",
        "context": "I saw one back in the late 70's....and it wasn't any higher than the telephone poles by the car....no sound....they are definitely for real",
        "good": "6",
        "bad": "5",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "anotherconservativeinexile",
        "time": "31 May, 2021",
        "context": "Yeah, there's  a reason these things are very common just lately, ( the last several years)  and almost always found around our military assets. Ships, planes, bases, etc.  Yes and some commercial planes, too. \n\n 20 years ago, before the dawn of drones,  these things didn't  exist.  What does that tell you? \n\nDid inter galactic space travelers suddenly advance their technology the EXACT same time we advanced our drone technology (?) or did our enemies and adversaries advance their drone technology at the same time we advanced ours? \n\nYes, for sure, there is other life in the universe. Statistics demands it be true. But physics is the law throughout the universe, and the distances are just too great to overcome.",
        "good": "5",
        "bad": "8",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "hawaiiancpk656",
        "time": "31 May, 2021",
        "context": "Looks like a blm supporter running from a job application",
        "good": "6",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "Greyalienshatedoritos",
        "time": "31 May, 2021",
        "context": "I think this IDIOT wouldn't know an alien if he landed the ufo in his front yards, got out and slapped him in the face",
        "good": "11",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "biggieguana",
        "time": "31 May, 2021",
        "context": "I'm more worried about the millions of aliens flooding over our border than the handful of aliens showing off in the air.",
        "good": "64",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "will2000161",
        "time": "31 May, 2021",
        "context": "It's Nazis from Antartica.",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "TheDean77",
        "time": "31 May, 2021",
        "context": "For GODS SAKE   DO NOT   fire a weapon at one of these these things !!",
        "good": "8",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "smartblond",
        "time": "31 May, 2021",
        "context": "My pappy said, don't trust a Russian, especially the top dog. The higher in rank the worse they get. It's obvious the Russians are behind it. Putin will make a fool out of Biden one of thse days.  You wait and see. The only solution my pappy used to say, get him before he gets you.",
        "good": "6",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "GroundCtrl",
        "time": "31 May, 2021",
        "context": "If there is something else living here, with comparable intelligence as us (doesn’t seem like a lot lately); then it’s most likely from earth also.",
        "good": "8",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "TheGoshawk",
        "time": "31 May, 2021",
        "context": "Don't forget. In the early 1940's there were reports of an airplane without a propeller being flown at blazing speeds piloted by a gorilla wearing a top hat and smoking a cigar.\n\nTurns out it was a test pilot named Jack Woolams, while flying the still unknown experimental P59 jet airplane, he would join formation with unsuspecting pilots flying propeller-driven fighters and to their surprise, wave at them while wearing a gorilla mask, a bowler hat and of course smoking a cigar, then speeding away leaving the confused pilots behind.  So convincing was the act that many a pilot who reported the incident spent some serious time with the base psychologist who was doing research into hallucinations caused by flying airplanes.  \n\nThere's a down to earth explanation just around the corner. No need to learn how to do the \"Live long and prosper\" sign just yet.",
        "good": "29",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "Costambar",
        "time": "31 May, 2021",
        "context": "I wonder what would happen, if the navy fired a missile or a high energy laser at these objects?  Not to say that, they'd probably have tried and failed",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "idon'tknow810",
        "time": "31 May, 2021",
        "context": "There are aliens on earth..I swear, just look at the White house it's full of 👽 ",
        "good": "9",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Costambar",
        "time": "31 May, 2021",
        "context": "Videos are always blurry. Never a clear image is seen. coming from state of the art multi billion dollar ships and planes",
        "good": "14",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "conserveuap",
        "time": "31 May, 2021",
        "context": "they have been seen since the 1940s and that's just \"modern\" times. They were called foo fighters by the pilots in WW2. are we supposed to just ignore the history and all of a sudden it's Russia or china?",
        "good": "8",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "sirparker",
        "time": "31 May, 2021",
        "context": "How is it that we can have crystal clear HD images from the surface of Mars yet the best UFO images are always blurry and grainy black and white. My parents had better picture quality with their 8mm home movies in the 1950's.",
        "good": "103",
        "bad": "11",
        "replies": []
    },
    {
        "user_name": "coolhandluke603",
        "time": "31 May, 2021",
        "context": "you skeptics wanna see an alien... just look at the kardashians, if those weird lookin things ain’t aliens from the far reaches of space... then humanity is doomed!",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Boaziam",
        "time": "31 May, 2021",
        "context": "The unanswered question is whether or not the New Aliens will register as Democrats? And, if they don't register as Democrats, with the Democrats build a new dome shaped border wall?",
        "good": "21",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "pcizbs",
        "time": "31 May, 2021",
        "context": "Look up Mick West debunker on Youtube. He has very logical and coherent explanations for these videos.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "CoolaidJoe",
        "time": "31 May, 2021",
        "context": "Well if I was a UFO I would be curious at the lack of democrat IQ.",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Costambar",
        "time": "31 May, 2021",
        "context": "My question is. What's the objective of these UFOs being here and surrounding navy ships? They must be up to something big",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "fonebone77",
        "time": "31 May, 2021",
        "context": "Let's see, which is more likely.  That they are photographic anomalies, of which we have ample evidence of and explanations for, or, that these are aliens, of which we have no evidence of or rationale explanations for?",
        "good": "10",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "bob_bob_bob",
        "time": "31 May, 2021",
        "context": "UFO sightings are not seen at a higher rate by astronomers professional or civilian who spend their carriers looking into the sky.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "kaleesra",
        "time": "31 May, 2021",
        "context": "Well I believe in God and his son Jesus. And I believe that God is magnificent. I don’t know why I even got to see it so close but I do know that we are special \nCreated in God’s image. And what I seen was not of this world we didn’t for sure have that technology in 83",
        "good": "7",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "MYGOD,MYCOUNTRY,MYFREEDOM",
        "time": "31 May, 2021",
        "context": "YOU HAVE TO BE PRETTY ARROGANT TO THINK THAT OUT OF ALL THE GALAXIES AND UNIVERSES OUT THERE THAT WE ARE THE ONLY LIFE FORMS IN EXISTENCE. I KNOW THERES OTHER LIFE. IVE SEEN IT. MY FATHER SAW IT. I WAS 12 YRS OLD AND MY FATHER WAS IN THE AIR FORCE. I WILL LEAVE IT AT THAT. GO AHEAD AND MAKE YOUR JOKES. ",
        "good": "5",
        "bad": "7",
        "replies": []
    },
    {
        "user_name": "tjm807",
        "time": "31 May, 2021",
        "context": "Obviously this is who voted in middle of the night in Detroit, Atlanta, and Philiadelphia! In and out with no proof of ID",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "NoMas2525",
        "time": "31 May, 2021",
        "context": "Who said jelly beans can’t fly. I ate some jelly beans once at a Grateful Dead concert and the entire bag of jelly beans began to levitate and circumnavigate my head like the UFOs in the Navy’s videos, only with far more color. ",
        "good": "18",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "jimr1961",
        "time": "31 May, 2021",
        "context": "Gee, maybe we aren't seeing alien anomalies, but we have capabilities of jamming radar in a way that it projects thing that are not really there?",
        "good": "3",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "kaleesra",
        "time": "31 May, 2021",
        "context": "That’s the point there is no rational explanation for it",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "101stParatrooper",
        "time": "31 May, 2021",
        "context": "We know the capability is there.  Dark energy is also referred to as anti-gravity.  We're just a thousand years or 2 away from harnessing it.  If you did, the shape of the thing wouldn't matter.",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "DrRon155",
        "time": "31 May, 2021",
        "context": "Not impressed? Well, tell me doctor, how many planets have WE visited, hung around on, flown through oceans, flown at Mach 200, flown sideways, done immediate 90 degree turns and done it all silently?!",
        "good": "7",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "rtscar10514",
        "time": "31 May, 2021",
        "context": "The UFO's are undoubtably low-leveling beaches to catch a glimpse of Hurley stunning in a bikini. OK, that was nonsense. The real proof of the existence of UFO's will still remain:  What does Fauci say!",
        "good": "4",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "#1deplorable",
        "time": "31 May, 2021",
        "context": "I have a beaming session with Spock and Gilligan tomorrow.  I'm sure that will produce definite answers.  I'll get back to all of you tomorrow.\n\nMork (from Ork)",
        "good": "7",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "CharlieRunkle776",
        "time": "31 May, 2021",
        "context": "This is what happens when a dumb Dim potus has open borders.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "OliveGoggles",
        "time": "31 May, 2021",
        "context": "Alien lives matter.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "evahelenemahoney",
        "time": "31 May, 2021",
        "context": "So what's the bigger \"threat\"?  UFO sightings that we've known about for 70 years, or the Pentagon suddenly trying to make them into something dangerous?\"  My money is on the latter...",
        "good": "6",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "tjm807",
        "time": "31 May, 2021",
        "context": "Now that's an illegal alien.  No wall stopping that!  Biden would welcome them! Hell come on in.  Wait they dont have Nike's on and making run for the river.  Biden wouldn't understand what the hell is going on!",
        "good": "3",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "kayak4ever",
        "time": "31 May, 2021",
        "context": "None of these people know anything except that what they are seeing can't be explained by any science we have today. The sightings are real, they are frequent, there have been many many more over the decades, and most not from the military.\nAt this point, we know nothing. What you see here is people making a career out of scaring us.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Stillmoon",
        "time": "31 May, 2021",
        "context": "Some peoples minds wont allow them to believe UFO's are real!!  Its just unfathomable in their minds!!  My Grand Father born and raised in Arkansas!  Could not believe any Fish as big as a killer whale!!  Its just they cannot believe!!",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "RedApple",
        "time": "31 May, 2021",
        "context": "You can be certain these \"saucers\" are of Chinese or Soviet/Russian design and build.",
        "good": "1",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "craigmk",
        "time": "31 May, 2021",
        "context": "Not only have I seen a UFO, but I have seen Elvis in a UFO.  He was holding Hillary's missing hard drive.",
        "good": "7",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "floridanation",
        "time": "31 May, 2021",
        "context": "what is worse-- illegal aliens creeping across our southern border or illegal aliens from outer space?",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "kaleesra",
        "time": "31 May, 2021",
        "context": "Ok so they are here whether you believe it or not use your brains. 33 years that I know of they haven’t done anything since then but it looks like they are getting really bold they don’t care if our military sees them",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "slowjoeman",
        "time": "31 May, 2021",
        "context": "It just boils down to somebody is making big bucks of it.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "kaleesra",
        "time": "31 May, 2021",
        "context": "I already said it I was on a road in a camper with 2 other guys it happened in Mexico a road going to Mexicali a Large object came from between 2 mountains it actually it up the mountains we stopped the vehicle and got out it was huge rotating in the middle with the middle lights going off and on it stopped directly over our heads my 2 friends stayed there staring at it but I ran into the ditch on the side it made no sound stayed there a few seconds then was gone in seconds",
        "good": "10",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "alexxx888",
        "time": "31 May, 2021",
        "context": "Those UFOs are from Planets Kremlina and Shina.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "shazaam",
        "time": "31 May, 2021",
        "context": "If the government says there might be UFOs out there, you can be pretty sure there are no aliens or UFOs.",
        "good": "7",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "koredic",
        "time": "31 May, 2021",
        "context": "fake videos, deceptive.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "colonialferret",
        "time": "31 May, 2021",
        "context": "If it is true these things have been around for years, decades, maybe even centuries, then they have shown no threat in all that time. For us to start using language like \"swarm\", \"harass\", \"flying with impunity \"is dangerous.  That language represents us talking ourselves into a confrontation with a force that by all accounts is vastly superior to us.  We should be speaking in peaceful terms to seek peaceful contact, not confrontation.",
        "good": "210",
        "bad": "24",
        "replies": []
    },
    {
        "user_name": "Droogs",
        "time": "31 May, 2021",
        "context": "Your tax dollars hard at work.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "pittpatriot71",
        "time": "31 May, 2021",
        "context": "I pray that aliens aren't real..\nThe Democrats will want to give them welfare and allow them to vote.",
        "good": "8",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "justanamerican296",
        "time": "31 May, 2021",
        "context": "If there are aliens, I believe they have been visiting earth to observe our technical progress and to ensure our horrible species is contained so that we can't spread our hate and stupidity to other galaxies. They can see that we are many years away from being a threat, so they just visit, see what we're up, and gauge our current state of the art tech. Once we become a threat, it's lights out.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Costambar",
        "time": "31 May, 2021",
        "context": "There's a surveillance video,recorded from a military aircraft, over the coast of aguadilla Puerto Rico. It shows a ufo flying over land then crosses to to ocean. Goes under water at high speed.  Comes out of the water at high speed and splits in 2 and keeps flying",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "tortillacowboy",
        "time": "31 May, 2021",
        "context": "BLM declared the UFOs are visiting people of the Black Panther planet. United Nations released the statement, “there goes the neighborhood”",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Doubleguru679",
        "time": "31 May, 2021",
        "context": "so why arent any of the ships and planes equipped with super high resolution cameras to possibly  \"prove\"  what is calimed.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "independent102334532",
        "time": "31 May, 2021",
        "context": "\"some of the motions seen in the videos (like the ocean skimming) may be artifacts of the cameras’ optics and tracking systems,\" he wrote.\"\n\nquestion: did we use chinese components in our military surveillance systems?",
        "good": "47",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "samtheman712",
        "time": "31 May, 2021",
        "context": "I'm waiting for one to land on the White House lawn and we'll still get a pic of a blurry speck.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "totalitariandems000",
        "time": "31 May, 2021",
        "context": "It’s our crafts. 1. If it wasn’t we would’ve shot one down. 2. Google Sal Pais. He has already patented anti-gravity propulsion and our navy bought it in 2017.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "teufulhunden6531",
        "time": "31 May, 2021",
        "context": "This guy is a nut job. Plain and simple.",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "kaleesra",
        "time": "31 May, 2021",
        "context": "I think your right colonialferret\nBesides there’s nothing our military can do or they would have tried it already",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "gladi8rtwice",
        "time": "31 May, 2021",
        "context": "Of course there are UFOs.  They are called UNIDENTIFIED flying objects!  Idiots.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "1776triggerslefties",
        "time": "31 May, 2021",
        "context": "Satan and his minions rule the \"heavens\" aka the skies. He's not a red-skinned pitchfork-wielding horned demon living underground. \"Aliens\" will be part of the great deception.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "jowomi",
        "time": "31 May, 2021",
        "context": "It is estimated that there are 2 trillion galaxies.  What does that make earth?  Less than a speck of dust.  If there is intelligence in the universe, it may not even take physical form.  If there are beings that much more advanced than we, what would they possibly want here? Can you see how ridiculous this all appears?  There is a logical explanation for everything.  ",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "RaviJosyula",
        "time": "31 May, 2021",
        "context": "Are there not footages released by Russia, China, European countries?\nIs there similar chatter in those countries too?\n\nOr the spread of this kind of news is a ruse by media and ideologues for some kind of public perception massaging.\nWhy did Trump create space force?\nWhy didn't Biden cancel the space force?\n\nHow are aliens allowing or threatening Elan Musk to go or not to go to Mars?\nDid NASA receive threats from aliens ever?\nIs Mars rover on Mars also witnessing UFOs?\nAre our satellites in space also are monitoring UFOs?\nWhy are they not attacking our satellites and rockets?\nAre UFOs on earth phenomenon?\n\nAre our drones followed by UFOs?",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "interested_bystander",
        "time": "31 May, 2021",
        "context": "The idea that galactic aliens traveled 100,000 light years just so they could do high speed flybys is literally the stupidest thing I have ever heard.",
        "good": "1",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "joleenworden810",
        "time": "31 May, 2021",
        "context": "I am not aware of any drones that can possibly move as fast as these pilots said they observed.  I am not aware of any drones that can fly in and out of water at will either.  Something is not logical here for the unbelievers, who refuse to allow that there may be others outside earth.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "realist12345678",
        "time": "31 May, 2021",
        "context": "Infrared video of birds and jet exhaust plumes.\nGimme a break...",
        "good": "3",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "Droogs",
        "time": "31 May, 2021",
        "context": "Sham.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "MyOpinionMeansNothing171",
        "time": "31 May, 2021",
        "context": "I think even if there is other intelligent life out in the universe, that we would never be able to visit each other, due to the vast distances involved.",
        "good": "9",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "kaleesra",
        "time": "31 May, 2021",
        "context": "Look it’s kinda my responsibility to let you know but I’m sure you believe what you will but I’m not speaking on belief I’m speaking on fact .",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "gib0217",
        "time": "31 May, 2021",
        "context": "UFO's do not interest me.  Show me a  real alien craft and/or alien then I will be interested.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "kaleesra",
        "time": "31 May, 2021",
        "context": "That’s the point . They haven’t made a move that we know of except maybe cattle mutilation but since I have seen one it’s not so easy to discount what some credible people have said about abduction and experiments",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Tropikaybay",
        "time": "31 May, 2021",
        "context": "Opinion of the day.  Give us some proof of what it is.  Anybody can guess ",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "tbear82nd",
        "time": "31 May, 2021",
        "context": "My Mother worked for NASA for many years. She was one of the lead programmers for the Apollo flights. She never mentioned UFOs at all. She did mention our tech, saying, if you ever saw it, you would never believe it.  I just hope this stuff does not belong to China.",
        "good": "17",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "what???",
        "time": "31 May, 2021",
        "context": "When it come to the government. One must always hold back judgement. It is more likely that it is our own government doing this just so other countries will not notice new technology . They done this before with spy planes. On the other hand I would be curious on how the world would react and see each other differently if in fact we was not alone.",
        "good": "8",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "hope7677",
        "time": "31 May, 2021",
        "context": "Bigelow aerospace outwardly says he knows for fact we aren't alone. Not from thought or speculation but because of what he has seen. This is the man who has our military contracts .... so I tend to believe him. I wish his and the governments research from Skinwalker ranch was public",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "tbear82nd",
        "time": "31 May, 2021",
        "context": "Can anyone blame these green folks, they want welfare, health care and EBT too.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "lord_stanley",
        "time": "31 May, 2021",
        "context": "I think Aliens have a technology that we don't understand yet. I am guessing it has something to do with magnetics, like we do with bullet trains, but theirs are much more sensitive, and yet more controllable.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "GoldHammer",
        "time": "31 May, 2021",
        "context": "I’ve witnessed these things on more than one occasion. Unless you’ve experienced them, you could be skeptical. But, after experiencing them, all skepticism disappears. I became a believer when I saw a silver ball object zig zig across the sky and then shoot straight up in a blink of an eye. Having been well versed on military and civilian aircraft for 20+ years, I can say what I’ve seen defies everything I know.",
        "good": "6",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "Costambar",
        "time": "31 May, 2021",
        "context": "Forget about actual aliens being inside these crafts.  For what I can see.  These things are artificial intelligence drones.   some are very small and able to accelerate at unsurvivable speeds for any fleshy body. Also many appear to be just made of some sort of energy",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "kaleesra",
        "time": "31 May, 2021",
        "context": "Anything we make is moved by some kind of motor that makes noise I seen a craft the size of a foot ball field 100 feet above my head stop making not a sound then then accelerate at an unbelievable speed",
        "good": "5",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "RubberAxe",
        "time": "31 May, 2021",
        "context": "I believe the universe is much too large for us to be the only one.\nOn the other hand, the universe is much too large for aliens to have come here.\nAnd that is regardless of their supposed technology.",
        "good": "11",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "SomeFeedback131",
        "time": "31 May, 2021",
        "context": "I feel like my atari is better than this navy ships computers.  Robotron was better.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jackz",
        "time": "31 May, 2021",
        "context": "There are no aliens that could possibly have reached our solar system.  We are too far away from any other planet that could produce intelligent life.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "slowjoeman",
        "time": "31 May, 2021",
        "context": "They should start capturing video on their smart phone's. The quality would be far greater. lol",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "RaviJosyula",
        "time": "31 May, 2021",
        "context": "why is it we always see UFOs but not aliens themselves?\nAccording these news article they observe several UFOs a day.\n\nNot one of them interested in meeting AOC or Greta Thunberg or Kim Kardasian at least on global warming concerns. We need to see some alien interested in meeting people like me or Joe Biden. Or worst case scenario, one of them must have crash landed and in this day and age of internet and you tube we will should have seen several aliens and their videos.\n\nThere is always a thing called progress and next step. Where are the alien photos and videos?\nI am interested to see these social sciences professors doing some research on their color and racial behavior and gender behaviors. At least there will be some focus change for MSM.",
        "good": "11",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "don'taskme",
        "time": "31 May, 2021",
        "context": "Since it is only happening around OUR warships, I think it is ours. What better way to test our capabilities - and deflect the blame to someone else? I am thinking that the DOD is going to be asking Congress for a HUGE amount to 'combat' this threat in the name of security.",
        "good": "4",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "emma777",
        "time": "31 May, 2021",
        "context": "Read the book \"UFOs: Demonic Activity and Elaborate Hoaxes meant to Deceive Mankind\"\nby Peter Dimond.\n\nPeter Dimond convincingly explains:\n\n-That UFOs are a demonic spiritual phenemonon\n\n-The most interesting facts about UFOs\n\n-Why UFOs cannot be material aircrafts from an alien civilization\n\n-What the top experts in the world on UFOs have concluded about UFOs\n\n-The impossibility of aliens traveling in flying objects through space to planet earth\n\n-The amazing parallels between UFO abduction cases and demonic possession\n\n-Also covered are famous alien abduction cases; Roswell; Majestic 12; the men in black; the alien autopsy film; area 51; cattle mutilations; alien landing strips; crop circles, and more.",
        "good": "4",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "BillXR4",
        "time": "31 May, 2021",
        "context": "It’s amazing the DoD cannot figure this out. Very worrisome.  It’s not extraterrestrials folks. ",
        "good": "6",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "independent102334532",
        "time": "31 May, 2021",
        "context": "\"what does it say about our security if these objects have been produced by an adversary?\"  \n\n\"The National Defense Authorization Act,  included an amendment for fiscal 2019 to ensure federal agencies do not purchase Chinese-made surveillance cameras. singles out Zhejiang Dahua Technology Co. and Hangzhou Hikvision Digital Technology Co., both of which have raised security concerns with the U.S. government and surveillance industry. Hikvision is 42% controlled by the Chinese government. Dahua, in 2017, was found by cybersecurity company ReFirm Labs to have cameras with covert back doors that allowed unauthorized people to tap into them and send information to China.\n\n\"Banned Chinese Security Cameras Are Almost Impossible to Remove\"",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "kaleesra",
        "time": "31 May, 2021",
        "context": "We don’t have there technology or we would be living on there planet",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "RedCocktail",
        "time": "31 May, 2021",
        "context": "I always wondered if there are 'aliens' among us, and they've been here for however many decades, then why haven't they made their move. What are they waiting for. I would assume that they should have been able to collect whatever data, called in their backup or procreated with us by now.....",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Red8Ball",
        "time": "31 May, 2021",
        "context": "The pilots who saw them first hand disagrees this bookworm",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "LocoLopez",
        "time": "31 May, 2021",
        "context": "Finally an article about the flying tic tacs that doesn't assume they are from outer space.",
        "good": "8",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "liberals_lack_intelligence",
        "time": "31 May, 2021",
        "context": "If an alien uses a ray-gun to blast Biden into a vapor ball ....... then they love mankind.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Tongue_in_groove",
        "time": "31 May, 2021",
        "context": "BET, Obama phone home.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Twocats2",
        "time": "31 May, 2021",
        "context": "Science professor? I believe I will stick with the men on the ship and the visual sighting by the pilot before I put all my trust in a college professor. Especially now days!",
        "good": "10",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "JeffreyLiberty928",
        "time": "31 May, 2021",
        "context": "Luminescent bat farts. Explains everything.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "kaleesra",
        "time": "31 May, 2021",
        "context": "You can’t wish away what you see the pilots are trained to know what they’re seeing \nGuess what they don’t know maybe you are smarter since you weren’t there",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Caslon167",
        "time": "31 May, 2021",
        "context": "One way suicide drones that do their thing, then crash into the ocean as planned after exhausting their energy reserves and to escape detection of origin.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "independent102334532",
        "time": "31 May, 2021",
        "context": "maybe an ex·tra·ter·res·tri·al /ˌekstrətəˈrestrēəl saw the tesla roadster elon musk launched in 2018 and thinking about placing an order",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "flg8rgrl023",
        "time": "31 May, 2021",
        "context": "Nope.  Non believe’ ",
        "good": "1",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "C4Myself",
        "time": "31 May, 2021",
        "context": "While one needs to avoid the Hynek swamp gas and Venus brush offs, quite simply, until evidence with context is available, no conclusions can be drawn from the images either way.  The motion of a filmed 'object' can only be determined if the distance and size are known and fixed reference points also visible, preferably from different angles (with the viewing locations also known).  Currently, it's an interesting phenomenon, but that means it raises questions, not answers them.",
        "good": "254",
        "bad": "20",
        "replies": []
    },
    {
        "user_name": "diccus",
        "time": "31 May, 2021",
        "context": "The aliens won't land til everyone gets vaccinated. Human bacteria can harm aliens. Live long and prosper.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "kaleesra",
        "time": "31 May, 2021",
        "context": "I’m not guessing I know what I seen. But I can guess at what I think maybe we are not important enough atm and there keeping an eye on our technology. However they have let the military know they can shut down any nuclear weapons we have and take control of our jets",
        "good": "7",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "liberals_lack_intelligence",
        "time": "31 May, 2021",
        "context": "So, he's a cartoon-dog physicist ???",
        "good": "6",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "SomeGuy357",
        "time": "31 May, 2021",
        "context": "Some of them have been tracked on radar.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "DirtyHobo",
        "time": "31 May, 2021",
        "context": "The Navy’s radar images may very well be electronic artifacts. The objects were sighted on weapons radar but no correlation to an object sighted visually.  With the millions of high resolution cameras and smart phones there must be several photos or videos that clearly depict an unidentified object defining its shape, structure, and size..",
        "good": "81",
        "bad": "8",
        "replies": []
    },
    {
        "user_name": "diccus",
        "time": "31 May, 2021",
        "context": "Um, Mr. Astrophysicist,...Not...They're out there.",
        "good": "3",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "nypostor",
        "time": "31 May, 2021",
        "context": "If God created other beings. So be it. Not for us to bother. Besides, these objects are often light created from outer space objects. Recall crop circles. They are created by lasers mounted on satellites. Many of these UFOs are actually lights abnormality. Notice the usual claims. It appears to move fast or high speed ... All because in outer space, light bends.",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "doglipps639",
        "time": "31 May, 2021",
        "context": "There are no aliens. We are alone in the Milky Way. ",
        "good": "5",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "NeeCee55",
        "time": "31 May, 2021",
        "context": "I’ve seen ufos.  They are nothing new.  There is intelligence far beyond us.  We should be happy that they even like us.  We are children to them ",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "timothyanderson395",
        "time": "31 May, 2021",
        "context": "Agree… the pacing of these objects is too pure and exact when compared to the movement of our aircraft…might be electronic “ghosts”projected to make them appear real…",
        "good": "3",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "heavilyarmed",
        "time": "31 May, 2021",
        "context": "It used to be more fun when people had fuzzy photos taken with an Instamatic Camera or UFOs caught on tape with a Super 8 Video Recorder.\nSo glad everyone now has a high quality camera phones to take the same quality photos.....",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "bulldog2223",
        "time": "31 May, 2021",
        "context": "Some look and act like lasers projected onto a fog bank.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "BYEBYEMISSAMERICANPIE🍒",
        "time": "31 May, 2021",
        "context": "If this is China or Russia then the US is in serious trouble. It seems they are FAR more advanced than we are. ",
        "good": "9",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "oshkoshbigosh",
        "time": "31 May, 2021",
        "context": "You can't compare an old Telescope from its era to modern equipment nowadays.   They both have different sensors suites that are calibrated for certain objectives.\n\nAlso, who do you know that's rich enough to own an 8k television with the technical know-how to use it to its full ability and with true 8k content.  It's a very, very, very small percentage of consumers.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cyberam",
        "time": "31 May, 2021",
        "context": "I've seen clearer bigfoot videos",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Tayvl",
        "time": "31 May, 2021",
        "context": "The Left has successfully dumbed down the country. Expect video evidence of dragons any day now...",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "tgcrissy@gmail.com",
        "time": "31 May, 2021",
        "context": "these comments are mostly just stupid.our best aviators are seeing these objects on a daily basis for decades and we deserve to know what's going on.",
        "good": "9",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "diccus",
        "time": "31 May, 2021",
        "context": "Oh, a mirage? I refuse to believe we are one out of infinity.",
        "good": "7",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "jon1710",
        "time": "31 May, 2021",
        "context": "One thing for sure, if they are aliens they're illegal",
        "good": "11",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "mrdna",
        "time": "31 May, 2021",
        "context": "9 out of 10 astrophysicist's that the US government funds agree...  It's global warming.",
        "good": "12",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "blade4",
        "time": "31 May, 2021",
        "context": "I used to believe in them until the govt started to push it",
        "good": "12",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "m1brando",
        "time": "31 May, 2021",
        "context": "If our military brass isn't worried about them, they know something we don't.",
        "good": "12",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "lbyzq",
        "time": "31 May, 2021",
        "context": "UFO from Siberia.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "jon1710",
        "time": "31 May, 2021",
        "context": "They're real. And reproduce by using their space junk",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Da1Crab",
        "time": "31 May, 2021",
        "context": "71% of the Earth is water. We exist on 29%. Is it that hard to believe another civilization exist on the other 71%? It answers all the Question about what we find and claim it's from Extraterrestrial Beings.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Oh4Petessake!",
        "time": "31 May, 2021",
        "context": "It's pretty obvious folks; they want to meet with our Leader . . . and they keep searching, since they have decided it can't possibly be Joe Biden.",
        "good": "26",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "amac639",
        "time": "31 May, 2021",
        "context": "The ultimate conspiracy for the paranoid American. Pathetic.",
        "good": "9",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "wamps",
        "time": "31 May, 2021",
        "context": "What about the underwater capabilities in addition to the airborne?",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "ilcapo2021",
        "time": "31 May, 2021",
        "context": "Atlantis is real!\n\nLOL",
        "good": "4",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "17_thespiritof_76",
        "time": "31 May, 2021",
        "context": "Or, this individual is one of them, and wants us to chill, while they proceed with their plans.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "garymccullough",
        "time": "31 May, 2021",
        "context": "The Bible speaks of, and about Heavenly Host, that are other than the Angels and Cherubs.",
        "good": "5",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "Oh4Petessake!",
        "time": "31 May, 2021",
        "context": "Its not the cameras  Aliens really are just hazy and fuzzy.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "thebige797",
        "time": "31 May, 2021",
        "context": "I am sure these \"things\" are unidentifiable. But like some of the other commentators its hard for these sightings to pass \"the straight face test\" with the cameras we have available today. If we can read a newspaper from a camera in outer space surely we should have better immeragy of these crafts. Once we see a clear picture of these things then I can fully buy into this.",
        "good": "4",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "FSL",
        "time": "31 May, 2021",
        "context": "meanwhile, snickers and guffaws were heard from DARPA headquarters...",
        "good": "6",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "amac639",
        "time": "31 May, 2021",
        "context": "You people really ought to bone up on some basic physics.",
        "good": "5",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "samsausage",
        "time": "31 May, 2021",
        "context": "🤷 Mfffft I'm not impressed. I've seen better. After all as an astrophysicist, I'm so much more sophisticated than the rest of you.",
        "good": "18",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "timberghost914",
        "time": "31 May, 2021",
        "context": "They are UFO'S searching for the secret entrance to Joe Bidens basement bunker but....they realized there is no intelligent life form there so they moved on!! 🤨",
        "good": "18",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "nodemoncrats813",
        "time": "31 May, 2021",
        "context": "Are we ready for the Real or Fake Alien invasion to happen next ? because something big is coming.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "scott1961",
        "time": "31 May, 2021",
        "context": "I think he's right. Our military should just fly around without their radar on. Oh, and don't carry ammunition or missles, either. Really, how many times flying patrol have they had to open fire?  (sarcasm)\n\nSounds like a big brain with no common sense to me.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "another_nc_guy156",
        "time": "31 May, 2021",
        "context": "And swamp gas - - - the professor forgot to mention swamp gas.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "jblank124",
        "time": "31 May, 2021",
        "context": "Weather balloons. With a bit of swamp gas thrown in.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Whatonearth",
        "time": "31 May, 2021",
        "context": "China knows we are at a weak point post Pandemic, BLM protests riots, Trillions of $ hole, weak administration- Pandemic was just a part of the Chinese BIG plan to prove its hegemony over the world. It's not surprising that Pandemic had to happen in the Election year followed by riots - maybe to take Trump out? Economy Jobs everything was going on well for trump until was hit by Pandemic- Who sponsored those riots?",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "nomorelaws468",
        "time": "31 May, 2021",
        "context": "At one time all the \"scientist\" were positive the earth was flat.",
        "good": "7",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "badhorsie90",
        "time": "31 May, 2021",
        "context": "Bug on the lens.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "americabybirth",
        "time": "31 May, 2021",
        "context": "Never a up close clear photo or something where people can say, yep that's a real UFO no doubt.\nwe don't want lights in the sky or some not clear images from Jets or radar but clear that would take your breath and know its real.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bostonbred",
        "time": "31 May, 2021",
        "context": "Just amazes me how these papers go to any length to find a physicist that will support some view.  Prof Frank is just 1 of 1,000s of Physicists who have opinion.  I personally have never heard of this physicist.  I don't know what he has written nor have I seen any articles he has penned. As a physicist - I am not impressed.",
        "good": "9",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "Hillarys_Thong",
        "time": "31 May, 2021",
        "context": "By the way, where are all the Bigfoot bones? With so many Bigfoots running around, there have to be bones of how many 10's of thousands of previous Bigfoots (Bigfeets?).\n\nYes not one person has ever run across a single bone.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "GoldBlowdryer",
        "time": "31 May, 2021",
        "context": "There is always someone who \"isn't too impressed\" people seemed impressed 100s of years ago when they were seeing them.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "GoldButterfly",
        "time": "31 May, 2021",
        "context": "How come it’s always China or Russia?  No one ever says it’s the Mexicans.   Asking for a friend.",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jack588",
        "time": "31 May, 2021",
        "context": "Danger Will Robinson, Danger!!",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "meyetee",
        "time": "31 May, 2021",
        "context": "And all of the videos are from Restricted Operations Areas . DARPA is testing high tech equipment and aircraft . Those are US top secret . Only the higher ups know the truth. The pilots and radar operators do not. And you have people promoting this as alien for $. Its known as the UFO Industry. Big bucks from news , books , documentaries and UFO conventions.",
        "good": "1",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "towerofbabble",
        "time": "31 May, 2021",
        "context": "These craft are obviously working with the Illuminati under the direct supervision of their masters, the aliens. Don't ever believe anything else.",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "BadDemocratPoliciesFor100Alex",
        "time": "31 May, 2021",
        "context": "Its important to consider all possibilities. Having said that, Commander Fravor's eye witness account, which lines up with his wingman's/wingwoman's account,  throws into doubt Chinese/Russian/US drones  or camera glitches as the explanation.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "hunnydoo",
        "time": "31 May, 2021",
        "context": "public interested because thats what the subject  on which the  news outlets fixate . Gossip fodder.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "Rolandw1",
        "time": "31 May, 2021",
        "context": "So if you were intelligent life... And you could watch humans anytime you want (as we've been beaming into space TV/Radio for some time)... Or you could manipulate all the DNA on the planet by simply  pulling a Fauci and manipulating DNA with viral material sent on a meteorite without as much as leaving your own solar system... Why would you ever, EVER come to this planet to study us closer  on a planet where we burn food for fuel while others of our species die because they won't get enough to eat?\nAs a species we are... no doubt... to intelligent life, repugnant. \n\nAnd for those of you who doubt they couldn't make humans from afar... When you were born there was more viral DNA inserted into your DNA then separates you from a spider monkey.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "takz07",
        "time": "31 May, 2021",
        "context": "I've always been interested and also amused to see that all photos of UFO's and Bigfoot are of the most grainy and unclear kind imaginable.",
        "good": "22",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tonyjr",
        "time": "31 May, 2021",
        "context": "They are our own drones.  Thats why they are around military bases and vessels.  This is all a cover up to keep from exposing our own drone capabilities.  Duh",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "newsjunkieforever641",
        "time": "31 May, 2021",
        "context": "The Great Harvest is coming. Seriously, this astrophysicist has a great point. We can’t be sure it’s aliens just yet.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "DeanoShmino",
        "time": "31 May, 2021",
        "context": "Will be interesting to understand how these things submerge into water and move; as well, break into many different objects in air. Man made? Um, no.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "thelastamerican",
        "time": "31 May, 2021",
        "context": "Being an Astrophysicist does not make him an expert in identifying military aircraft or UFO's.  Radar locks and video footage along with the Pentagon admitting that they have NO IDEA what this phenomenon could possibly be, makes the professor's suggestion sound pretty ignorant.  The days of explaining away hard evidence with explanations like, \"artifacts of the cameras’ optics and tracking systems\" and \"downed weather balloons\", ain't gonna fly anymore.",
        "good": "6",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "theofunesto",
        "time": "31 May, 2021",
        "context": "Let's see if I have this straight.  Aliens from outer space travel light years to get here, zip around in the sky playing peek-a-boo and then just disappear.  Think people!",
        "good": "22",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "mandyalaska",
        "time": "31 May, 2021",
        "context": "\"Frank said that he will read any government reports with interest, but said there may \"be more prosaic explanations\" like the possibility Russia and China are using drones to lure \"our pilots into turning on their radar and other detectors, thus revealing our electronic intelligence capacities.\"\"\n\nBias.  Check out a Nobel Prize winning scientist on Economic Psychology, Daniel Kahneman.  He could explain it better.  And then maybe check out ALL of the evidence.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "nmeast",
        "time": "31 May, 2021",
        "context": "What do these \"ufo watchers\", and governments, think they are going to do, even if these \"sightings\" are actual UFO's from some alien civilization?  If they are actual UFO's, the civilization that has produced, and sent them here, are light years - pun intended - more advanced than we are, and look at us as \"zoo animals\". We don't have weapons capability to do anything about these UFO's and they don't want to attempt to talk to the \"zoo animals\", or they would have done so by now.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jerseygirl66",
        "time": "31 May, 2021",
        "context": "They are not \"out there\".  They are here on earth.  Our enemies are not stupid nor inept. If we  keep looking to the skies we are doomed.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "denniscerasoli065",
        "time": "31 May, 2021",
        "context": "I used to wonder why these so called far advanced aliens haven't landed and made themselves known until I heard an interesting theory the other day. This theory from a physicist said that they were so far advanced that we didn't interest them we're to backward to bother with, lol. It would be similar to the people that live in the rain forests who have lived in these forests and haven't advanced in several thousand years we don't bother them but we observe couldn't that be likened to an advanced society outside our solar system? Just a thought.",
        "good": "9",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "penman",
        "time": "31 May, 2021",
        "context": "We live in a marble at a marble warehouse and nobody will know how many marbles are out in the warehouse until we do an inventory therefore,\n“Engage!”😎",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "whodat496",
        "time": "31 May, 2021",
        "context": "Will be an interesting Independence Day",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "USArmyVetAus",
        "time": "31 May, 2021",
        "context": "You're in freaking denial like most of the universe. The same universe that can't explain how God and ghosts exist. Tell me. If you think we came from apes, how come no other animal has a conscience, a soul, or feel exposed without clothing? Even when the evidence is right in front of you you are in denial. God help you.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "chuckbecker",
        "time": "31 May, 2021",
        "context": "still waiting for a clear picture.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "SophosPublishing",
        "time": "31 May, 2021",
        "context": "Long ago when the Conquistadors appeared offshore in their sailing ships I'm sure the natives had no idea that anyone besides themselves existed in their world view. Nothing has changed except that we, modern society as we like to think of ourselves, are now the natives in a large Universe.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "tdsliberalhypocrisy101",
        "time": "31 May, 2021",
        "context": "Mehh I’m not impressed with this mans attempt to distract and deflect.  Nothing he said was significant whatsoever.  \n\nDoes anyone know if these crafts are capable of manipulating the climate??\n\nBrainwashed Simpletons have been blaming global warming on cars and cows for decades now!!\n\nHow can you make a global warming equation with variables that are unquantifiable??? The answer is that you CANNOT...your global warming equation is COMPLETE garbage.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "wildturkeyrarebreed",
        "time": "31 May, 2021",
        "context": "Anybody can purchase a GoPro which films in 4k and has hyper smooth video stabilization, the military might be able to come up with clearer video of these UFO'S",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "bpennbeepin",
        "time": "31 May, 2021",
        "context": "Remember the Brady bunch episode when they realized the boys were playing tricks with sheets and flashlights on the girls to scare them they were UFOs? Same scenario but different technologies now.",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "orangehairfeuhrious",
        "time": "31 May, 2021",
        "context": "Because he has a brain and believers in this nonsense don’t?",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "joegottago",
        "time": "31 May, 2021",
        "context": "Since photography was first invented, you would think one picture would be clear and in focus.  A billion people with cameras in their phones..., but nothing.  Call me when someone gets a good shot of a \"UFO\".",
        "good": "15",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Fanorn305",
        "time": "31 May, 2021",
        "context": "If these are multi-dimensional ships, that might explain why the videos are always “blurry”.  An'd the ships might be phasing in and out of our dimension.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "WoodenSaucer",
        "time": "31 May, 2021",
        "context": "What if they're coming from the ocean instead of space?",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bikermikeflhtcu583",
        "time": "31 May, 2021",
        "context": "\"...like the possibility Russia and China are using drones to lure \"our pilots...\"\nHeck of a drone that can out fly an F-18!",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Liberty-over-fear",
        "time": "31 May, 2021",
        "context": "People who want to see conspiracies will see them at every turn. They do not need proof the conspiracy exists, they just need to be able to convince themselves that they \"could\" exist, and therefore they must. They dismiss facts as \"coverups\" and embrace \"facts\" that are are anything but and/or are absent of critical analysis. They use the lack of an immediate explanation (or one they like) as proof there is no explanation and therefore \"Aliens\"!",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "tdsliberalhypocrisy101",
        "time": "31 May, 2021",
        "context": "I like how our government decides to tell the truth AFTER completely destroying untold thousands of lives desperately trying to hide it. \n\nSuch admirable behavior.",
        "good": "2",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "Ghost_hunter",
        "time": "31 May, 2021",
        "context": "Close encounters of the 3rd kind was a good movie",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dothedangthing",
        "time": "31 May, 2021",
        "context": "If these vehicles aren’t alien, then they are OURS, not China’s or Russia’s. And if I’m wrong then where is $700 billion annually going!?!",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "picircle7",
        "time": "31 May, 2021",
        "context": "If they are 'UFO's', they're not from a galaxy far, far, away...   And if they have flashing marker lights, certainly not alien...",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "GoldStarFamily203",
        "time": "31 May, 2021",
        "context": "As smart as these aliens are they aren’t as smart as the aliens walking across our southern boarders. ",
        "good": "8",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "sherrysmith",
        "time": "31 May, 2021",
        "context": "Now all the people who are not astrophysicists, but are Experts In Their Own Minds will weigh in.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "garynh284",
        "time": "31 May, 2021",
        "context": "The reason most of these professors are kept locked up on a campus, and not free to wander, is because they're high functioning \"R\" words. They amount of meds they take everyday, just to walk on a campus, without attacking people would impress the worst junkies in Seattle. Their information is always heavily based on their personal bias so you have to listen to them for a very long time and intellectually separate their opinion from useful data. Always... Sometimes they're more trouble than they're worth.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tpc",
        "time": "31 May, 2021",
        "context": "Always nice to have an honest debate about ,anything. As someone who has leaned towards believing in UFO s ,for the last 60 years ,its interesting to see these videos and hear stories from pilots who have witnessed this phenomena but to be honest ,I'm still not sold on the extraterrestrial angle. Let's release all the info ,debate it and then we can all have a better understanding of the possibility of little green men",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "bguylebeau",
        "time": "31 May, 2021",
        "context": "These skeptics are grasping at straws. We now know that these objects are being tracked by multiple sources in real time. These include satellites, surface ships, fighter planes and the pilots themselves. The reports have been going on for decades but we now have the technology to detect and track them. These arrogant intellectual types who continue to snub their nose at everything they cannot explain, are ignorant at best. It’s way past time there was a real investigation by the scientific community. What if Atlantis is real? Just a thought.",
        "good": "4",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "bartusa",
        "time": "31 May, 2021",
        "context": "AND????? This is not new \"news\" this is old news.... They are just trying to keep Nancy Pelosi and Kamala Harris up to date on their \"privileged\" status. Okay, now.. Tell me this... has nobody else noticed how Nancy Pelosi looks like an alien up close?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sapinva",
        "time": "31 May, 2021",
        "context": "The Chinese can't have this kind of technology, because we haven't developed it yet for them to steal. And if the Russians have it, we're done for anyway and none of this matters.",
        "good": "12",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "whiptongue",
        "time": "31 May, 2021",
        "context": "It's a low cost hoax to trick paranoid Americans into allowing pedophiles access to billions of dollars that they'll never have to account for under the cloak of \"national security\".",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bartusa",
        "time": "31 May, 2021",
        "context": "They are coming back for their \"leaders\" Nancy Pelosi and Kamala Harris..... :)",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "sipius22",
        "time": "31 May, 2021",
        "context": "The esteemed professor opened his mouth, talked, but said nothing.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Dnpii",
        "time": "31 May, 2021",
        "context": "It was said already.  How come we can see a zit on Megan Fox from 1000 miles away, pinpoint terrorists in the woods in complete darkness, have planes that fly faster than sound, but can’t see or capture or shoot down a UFO?\n\nUFO people:  There is no intelligent life down here, let’s go.  ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Patriotmade",
        "time": "31 May, 2021",
        "context": "People wake up ..or should I say “be UAP WOKE”. These vehicles are here AND were on the moon in the 1970s. Our astronauts told us so but the press and Congress brushed it off and under the rug. What we see in these releases videos are drones. What has not been released — yet — are the videos of black triangle shaped craft the size of a football field that have been seen across the globe. More to come. But NOW  people are seeing this as a way to legitimize increased funding for our NextGen advanced military. With China building a huge navy, now with its own stealth program, and with countries like Iran and Russia pouring huge resources into drone and cyber warfare..we must take steps..",
        "good": "2",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "saggydrawers",
        "time": "31 May, 2021",
        "context": "The fuzzy triangle shaped ones looked like they were Radio shack drones with a triangle plastic cutout on its lower side to make it look like it is not a drone.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "tubbist",
        "time": "31 May, 2021",
        "context": "In times of uncertainty and fear these UFO hoaxes come up.  This is a symptom of demo spread fear.",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "Comeinrangoon",
        "time": "31 May, 2021",
        "context": "It’s Chicom drones prepping for Pearl Harbor II.  The US Navy only thing that stands between them taking over Taiwan and they want it back.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "steveackerrt",
        "time": "31 May, 2021",
        "context": "Men in the moon are out of cheese and want our Swiss and Colby.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ckormos1",
        "time": "31 May, 2021",
        "context": "Aliens would have to come from planets around other stars. The journey would take hundreds of thousands of years. The speed of light is an absolute condition built into the framework of reality. It can't be exceeded, you can't even come close. Science fiction pretends it's possible but what about relative time? Hundreds of thousands of years would still pass on the alien home planet. Double that for their round trip to Earth. Therefore, if a UFO the size of a airplane appears over Earth and there are few aliens from another star inside, I ask them \"Why did you leave your home, knowing on return it will be totally different or might not even still exist, just to buzz around Earth and why did your people waste their resources on such a nonsense trip?\"",
        "good": "10",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "yourmomwilladoreme",
        "time": "31 May, 2021",
        "context": "-ISIS\n-Covid\n-Aliens\n\nAnything to keep the population scared and obedient",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "CyanBone",
        "time": "31 May, 2021",
        "context": "who isn't sceptical of screen shots of an instrument panel?",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "pensivet",
        "time": "31 May, 2021",
        "context": "I used to shine my flashlight on the wall near my cat and move the light image rapidly to different places on the wall. The cat - as quick as she was - could never, ever catch up to the image. We are being toyed with; whether from friends of Richard Dreyfuss or communist red chinese friends of this excuse of a president. Keep in mind that now is a great time to pin everything on the red friends of slo hidin', however.",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "BillDewall969",
        "time": "31 May, 2021",
        "context": "So Russia and China have flying jellybeans?",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "45twice",
        "time": "31 May, 2021",
        "context": "One more nothing article by a writer that had a deadline to meet.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "lennonp",
        "time": "31 May, 2021",
        "context": "So silly. Repeatedly hear about objects traveling past the speed of sound with no sonic boom. This simply means the objects were NOT traveling past the speed of sound. Duh.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "baitwaister",
        "time": "31 May, 2021",
        "context": "Our alien problem is crossing the Rio Grand at this moment ",
        "good": "36",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "onemorething666",
        "time": "31 May, 2021",
        "context": "..and this article told me nothing...",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "56a171",
        "time": "31 May, 2021",
        "context": "I think someone wants a boat load of cash for .....A STUDY",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "JohnKreese",
        "time": "31 May, 2021",
        "context": "What a highly intelligent physicist.  Apparently Russia and China’s drones can stop in mid flight the. Immediately real the sound barrier.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jimmyolson",
        "time": "31 May, 2021",
        "context": "Looks like they grabbed a CNN \"physicist\".",
        "good": "11",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "foxrocksnow",
        "time": "31 May, 2021",
        "context": "Does not matter if he is convinced or not, the public has a right to know and make their our mind up.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Augustwest",
        "time": "31 May, 2021",
        "context": "These crafts are not Aliens or  China. It's our military.   TR3B's.",
        "good": "4",
        "bad": "2",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "bartusa",
        "time": "31 May, 2021",
        "context": "AND????? This is not new \"news\" this is old news.... They are just trying to keep Nancy Pelosi and Kamala Harris up to date on their \"privileged\" status. Okay, now.. Tell me this... has nobody else noticed how Nancy Pelosi looks like an alien up close?",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "eyeswideshutoo",
        "time": "31 May, 2021",
        "context": "there coming to take us away..hehe..haha..hoho",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bytorsdownfall596",
        "time": "31 May, 2021",
        "context": "Occam's Razor says this is man made tech. The bigger question would be \"is it ours\"?\nThe best way to test it would be against our own advanced radar systems. \nPersonally I think we've discovered a way to manipulate energy to appear as an object.\nOr it could be the myths about lost City of Atlantis are all true.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "scottishdecent",
        "time": "31 May, 2021",
        "context": "these professors are realizing that they are not the smartest people in the Galaxy or universe they realize, that their platform will be shattered, one day! people need to read the Diaries of Admiral Byrd, people need to listen to the speech bye General MacArthur April 1955, when he addressed the Congress.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rogertheindependent",
        "time": "31 May, 2021",
        "context": "Bet Sheldon and the rest of \"The Big Bang Theory\" crowd could come up with a better explanation than this. ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "totochaos",
        "time": "31 May, 2021",
        "context": "He's one of Them.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "GoldBandAid",
        "time": "31 May, 2021",
        "context": "They seem to be in the same category as Big Foot and paranormal.  Every time the Democrats have power and control in the US government their willing accomplices in the New Media attempt to keep the US citizens distracted with tabloid news headlines and articles.  The subject of which are usually UFO, Big Foot, and paranormal.",
        "good": "12",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "fred807",
        "time": "31 May, 2021",
        "context": "I believe the recent video's of UFO'S  , has to do with their alien leader on earth , the wig woman from Compton .",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rush5728",
        "time": "31 May, 2021",
        "context": "\"UFOs harassing ships at 160 mph!\"  Imagine that 160mph !?  Thats just out of this world nobody can fly that fast.  The US Navy is doomed. :)",
        "good": "3",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "airport1",
        "time": "31 May, 2021",
        "context": "ive been a pilot and professional aerial photographer for decades,i really need for this \"astrophysics professor\" to explain his comments concerning ''optics\". it seems very evident that he knows his profession,but sadly appears to have no knowledge of aerial photography.\nim sure we will be disappointed in the soon to be government release of documents because they will be declassified. sadly we will never get the \"good stuff\".",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "GoldController",
        "time": "31 May, 2021",
        "context": "I'd say it's top secret American military equipment. If America can build a b2 bomber 30-40 years ago, like its nothing, it must have some futuristic capabilities now.",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "bird1966",
        "time": "31 May, 2021",
        "context": "I don't understand how with all our technology that all the videos are dark and grainy. where are the more enhanced color and more focused videos?  that includes from our fighter jets and war ships. ",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "MBOG1976",
        "time": "31 May, 2021",
        "context": "The truth is out there! The gov’t has always known but fear telling us the truth! ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "yodagreen",
        "time": "31 May, 2021",
        "context": "If it has a strobing / flashing lights (like the video) then its from earth.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "HA!669",
        "time": "31 May, 2021",
        "context": "Hey! Didn't all you people see the Orcs in The Lord of The Rings?\nOrcs are real.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "saggydrawers",
        "time": "31 May, 2021",
        "context": "all the images are not clear and defined as you would think good HD images might be. \n\nMost of these pics look as though they came out of the 1950's B&W, grainy and blurred.",
        "good": "5",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "sumday",
        "time": "31 May, 2021",
        "context": "Most here either don't want to believe (threatens human privilege) or want proof.  Appearance black holes , gamma rays, microwaves, etc are all new and did not exist until we proved they did.  In fact nothing exist at all until we convince our self that it does exist with superior knowledge.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "newsguy55",
        "time": "31 May, 2021",
        "context": "So, what the good professor is really saying is that we have trained military pilots that only THINK they saw an object do something, when it was the fault of the cameras to begin with. Yeah, right! Not buying it, Does he really think our military personnel are that stupid these days? If so, we're in more trouble than what we thought.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "pantherspride",
        "time": "31 May, 2021",
        "context": "He knows as much as the rest of us.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "common_sense_isn’t",
        "time": "31 May, 2021",
        "context": "If superior intelligent beings visited this planet, they’d take one look at us and run away as fast as possible.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "amerbybrthsthrnbygrcofGd",
        "time": "31 May, 2021",
        "context": "well, if the report blows up all his theories he'll be out of a job won't he?  ",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rounder355",
        "time": "31 May, 2021",
        "context": "Misdirection by the gov to take the focus off China and the WIV.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "sscamaroguy",
        "time": "31 May, 2021",
        "context": "There actually is no explanation why the sightings fail to impress him, except for \"artifacts\" in the optics (which pilots are trained to recognize). There is also the fact that many of the sightings include multiple visual sightings in conjunction with the FLIR. The Chinese and Russians don't have drones that go 13,000 mph.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "spellbound232",
        "time": "31 May, 2021",
        "context": "Personally, I think that these craft are the transport system for Bigfoot, enabling the creatures to remain elusive and still be seen all over the planet!",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dufalator",
        "time": "31 May, 2021",
        "context": "Sorry, it is great that you have a NASA grant, but when you have multiple credible eye witnesses, corroborating advanced radar, FLIR, and satellite instrumentation independently detecting these things at the same time, it is pretty difficult to dismiss. The cat is out of the bag. You can't sweep this under the carpet. \nIf our enemies had these capabilities, they would have already used it against us.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "RedCactus",
        "time": "31 May, 2021",
        "context": "All bait.  No article.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "BorderScot343",
        "time": "31 May, 2021",
        "context": "Alien spacecraft is the LEAST likely possible explanation.  People should stop worrying about space aliens and concern themselves with our REAL threat:  ILLEGAL aliens.",
        "good": "13",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Augustwest",
        "time": "31 May, 2021",
        "context": "Look up TR3B'S.   These crafts are secret  military  ships.   They're  awesome!!!!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dp2007",
        "time": "31 May, 2021",
        "context": "Educated idiots are very entertaining.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Bebe2",
        "time": "31 May, 2021",
        "context": "I read the comments. And I think we should all keep an open mind. Especially, the scientists & astrophysicists. I know one who does keep his mind open. Travis Taylor PhD. Has 3 degrees. He's on the show The Secret to Skinwalker Ranch which Bob Bigelow used to own & the government did research there for years which is now classified. FOIA is no good when a private citizen owns it. They don't have to tell you anything. In my opinion a lot of these scientists do not have an open mind or any faith in anything. So my mind stays open. I don't believe Russia or China is that far ahead of us. This is a vast universe & still growing. None of us can say we know all. We discover new things all the time, even otters that we thought were extinct. So don't be to quick to shut people down because their beliefs are different from yours.",
        "good": "7",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Demosthenes2",
        "time": "31 May, 2021",
        "context": "Why us it that ALL \"evidence\" for UFOs being extraterrestrials visiting earth are NEVER based on physical evidence?\nAll we ever have are \"statements\" using poor logic and belief rather than a single solid physical object.\nYou can't physically examine a claim.\nProof requires real evidence in physical form.",
        "good": "6",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "djlnc596",
        "time": "31 May, 2021",
        "context": "Where's the beef?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "justanotherpers",
        "time": "31 May, 2021",
        "context": "If the media prints it....people will believe. No critical thinking, no doubt, no questions....they'll just follow like sheep going off of the cliff. The dumbing down of America gets worse every day.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "dtm38",
        "time": "31 May, 2021",
        "context": "Where oh where is Art Bell when we need him?   RIP Art, I wish you were still around!",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ERIKSEN",
        "time": "31 May, 2021",
        "context": "Yeh. China and Russia are building drones that defy gravity, and have no visible propulsion systems , and can do 500 G. Sure.  If that were the case, we might as well give up now and let them take over. However, those are neither Chinese nor Russian. They are alien. Why is it so hard to accept that?  Do you honestly believe that we are the only “intelligent” race of  beings?  Just because I get a glass of water from the sea, and there are no fish in it, it doesn’t mean that the sea has no fish.  ",
        "good": "10",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "upyoursdem",
        "time": "31 May, 2021",
        "context": "dems should really be checking this out! if by some chance its our tech it would save tons in greenhuse gas emmisions just saying, hawaii in 30 minutes anyone?",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "2020plague",
        "time": "31 May, 2021",
        "context": "I would think the Navy pilots would have enough common sense and training to know the difference between military engineering and above average military engineering. ",
        "good": "6",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "OrangePuzzle",
        "time": "31 May, 2021",
        "context": "When you see a UFO bigger then a B-52 bomber I'll be concerned, Otherwise it's just a small 👽 probe looking for technology they have had for a thousand years.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tbj1122",
        "time": "31 May, 2021",
        "context": "Ball lightning sometimes has the strange characteristics that have been noted.  It should also be kept in mind that as adept as these pilots are at dealing with enemy airplanes, their testimonies are notoriously unreliable when it comes to identifying phenomena that they're not expecting--the most common \"UFOs\" are Venus and Jupiter near the horizon.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "dasfenster",
        "time": "31 May, 2021",
        "context": "Here's the catch. In order for those things to do what they do, no matter their origin, for an astrophysicist to say he's \"not impressed\" is because he knows they have to be following the laws of physics, even if some of those laws aren't known to us yet.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "chthonic",
        "time": "31 May, 2021",
        "context": "Until there is a clear close up image of these supposedly uap videos \nIt's all pie in the sky as far as I'm concerned",
        "good": "4",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "laurab",
        "time": "31 May, 2021",
        "context": "The feds are spending money on UFO's?  I thought they might spend my tax dollars on something useful ... something that actually improves quality of life.  It's no wonder why people don't want to pay taxes.",
        "good": "3",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "chi2virginia",
        "time": "31 May, 2021",
        "context": "Astrophysicist... my old job.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "scottishdecent",
        "time": "31 May, 2021",
        "context": "the government wants you people to live in fear example the covid-19 look at all the little sheep that's been herded by the shepherd you dumb \"as\"! people ask why things are so grainy when it comes to the pictures, if you look through a 13 power night vision apparatus, on a tow weapon system you will get it same picture and you are acquiring the target at 3750 m that is one reason why your pictures look grainy",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "breakingthewind",
        "time": "31 May, 2021",
        "context": "Don’t get too excited. There are no aliens flying around our planet.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "wt_f",
        "time": "31 May, 2021",
        "context": "He is an alien finder? Cool job.  But an alien hunter is a much cooler job",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "conservativesareright214",
        "time": "31 May, 2021",
        "context": "Wonder how much we are wasting on his grant.  Sounds like a scam to me.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cosmicsnoop",
        "time": "31 May, 2021",
        "context": "This guy is a complete moron. He is the type of person that will end up killing himself because his whole view of life is wrong and he won't be able to face that fact. The Universe is teeming with life. There are UFOs from various alien species in our skies. The human race was engineered by aliens. They created us. That's the situation. To believe anything else just shows how ignorant and in denial you are.",
        "good": "3",
        "bad": "8",
        "replies": []
    },
    {
        "user_name": "fold",
        "time": "31 May, 2021",
        "context": "he will be the first one they disect",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "are122",
        "time": "31 May, 2021",
        "context": "For the money these aircraft cost you'd think they would have considerably better cameras.",
        "good": "8",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "redvblue",
        "time": "31 May, 2021",
        "context": "Beam me up Scotty",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Trumplicious",
        "time": "31 May, 2021",
        "context": "I have see all the stuff on TV recently and for decades on UFO's. One of the most compelling pieces of evidence is the astronaut press conference after the first moon landing. They would not look at the camera. The were not happy. They were not high fiving each other. They did not say it was incredible. Nothing like that. They had frowns on their faces, were looking down, and looked very depressed and disturbed.The reason UFO people give for this is the astronauts saw 3 UFO's parked on the moon near where they landed. Hand radio operators had heard the classified transmissions that were blocked from the public. And if the UFO's were there. I would not put it past our government secretly taking them over the next several years and bringing them to earth and reverse engineering them, even flying them.",
        "good": "5",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "william985",
        "time": "31 May, 2021",
        "context": "Mystery solved.  Jen Psaki did say that Joe Biden moved quick.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "aflinguist171",
        "time": "31 May, 2021",
        "context": "I've seen clear videos from fighters, but ALL UFO videos are bad quality. I wonder why...",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "CyanFan",
        "time": "31 May, 2021",
        "context": "We are NOT alone...",
        "good": "7",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "OrangeFlower",
        "time": "31 May, 2021",
        "context": "if this guy is saying not to get exited about video evidence of alien technology on earth. How can he expect to find anything from a distant star system that he will believe. Do the right thing and give back the grant money fool.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Bingo2016",
        "time": "31 May, 2021",
        "context": "Fake news, fake elections, fake polls, fake UFO\"S,, hell now some scientists are telling us we are all living in a computer simulation.  Is anything real anymore.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "EmperorJones",
        "time": "31 May, 2021",
        "context": "Would our government tell us the truth if aliens did exist? ",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Augustwest",
        "time": "31 May, 2021",
        "context": "Look up TR3B'S.  You'll  see that they are the same thing that these  pilots are seeing.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "fold",
        "time": "31 May, 2021",
        "context": "professor?  thats all i need to know.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "kendol",
        "time": "31 May, 2021",
        "context": "No ufo. Obviously optics involved. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jerrylb",
        "time": "31 May, 2021",
        "context": "Stop calling them little green men, do we know what they identify as? They may see them selves as polka-dot non-binary hetero-home-trans-universal neophins with acute dysphoria men for all we know!",
        "good": "14",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "scaryname",
        "time": "31 May, 2021",
        "context": "I seriously doubt these are from other solar systems.   \n\nAtlanteans.  :P",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "free2air",
        "time": "31 May, 2021",
        "context": "I have yet to see one video, just one, that has clear video, in color. Show me one that has more than 2 pixels and maybe I’ll be impressed.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "paratrooper82941",
        "time": "31 May, 2021",
        "context": "Russian and China drones in order to study our defense and satellite signals, makes more sense than alien intelligence. What is concerning is that our intel and defense system have not been able to capture or explain these sightings. Not sure if it’s because we are gullible and surprised that others have that capability or just at the fact that intel knows more than what it’s being reported.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Vetalways",
        "time": "31 May, 2021",
        "context": "UFOs are that until they are identified. My son and I saw a UFO at Port Clinton Ohio a few weeks ago. It traveled very smooth and fast and changed direction I said wow it's not a plane, chopper, perhaps someone messing with a laser pointer? It zoomed by again a glowing amber ball of light and since a bit of fog was in the air it ruled out the laser possibility!\n Back it came again overhead, ah a dang seagull with its white underside reflecting light from the ground. No longer a UFO!",
        "good": "4",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "shouthard",
        "time": "31 May, 2021",
        "context": "He’s only an astrophysicist. What could he possibly know? 😉",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "totochaos",
        "time": "31 May, 2021",
        "context": "The smartest and most honest person I've ever met once saw something that he described as a craft that defied everything we know about Physics. He saw it forty years ago.\n\nThis is a man who the president of Caltech called \"the smartest man I've ever met\". \n\nWhy is this important? The man was in charge of all of NASA's unmanned spaceflight. He was at NASA from the very start, working in a dirt field that would eventually become Jet Propulsion Laboratory. The man spent 35 years at the lab.\n\nIn retirement, he was a contractor for Skunkworks. The man had the reputation, smarts and the credentials to know that whatever he saw was beyond our capabilities.",
        "good": "9",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "stmarsaille",
        "time": "31 May, 2021",
        "context": "UFO fans would have us believe that aliens come from light years away -- yes, to our planet, even though their existence would mean there are countless other inhabited planets they could just as easily visit -- these aliens take the time and trouble to come HERE.  They have been visiting here for decades if not going back thousands of years, if you believe, \"Ancient Aliens.\"  But despite allowing themselves to be seen -- and photographed and taped (although never quite enough to prove they exist) -- and despite allegedly abducting earthlings -- they never land, they never introduce themselves, and they seem to have no purpose.  Are they simply here to study and observe?  You would think that beings that advanced would be able to wrap up their study pretty quickly.  Proof that they are indeed from another planet or dimension is always just out of reach -- so despite teasing us with appearances, they obviously don't want to actually contact us.  They aren't hostile and they aren't friendly.  None of this makes any sense at all if they are highly advanced beings.  But there is one thing that does make sense:  We are not being visited by beings from another planet, another dimension, or another time.  Even if you believe there must be life on other planets, none of those beings have come here.",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "jojowasaman2",
        "time": "31 May, 2021",
        "context": "When videos get beyond the grainy guesswork characterized by every UFO citing ever, wake me.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Joey#",
        "time": "31 May, 2021",
        "context": "While I think alien life is plausible I wonder why none of the UFO images I’ve seen over time have a quality consistent with today’s technology. \nThey are blurred, grainy and not at all clear. ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "braingoop875",
        "time": "31 May, 2021",
        "context": "Fermi Paradox",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "totochaos",
        "time": "31 May, 2021",
        "context": "It defies logic that these craft belong to China or Russia. Let's take that right off the table. \n\nThe US (and our allies) would be mobilizing all our intellectual talent to confront such a threat from our enemies. The shear magnitude of our research response would be impossible to hide. We'd be trying to match their capabilities in 12 months or less.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "guitarhero",
        "time": "31 May, 2021",
        "context": "Me I don't know nothing",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Ptrckknpp",
        "time": "31 May, 2021",
        "context": "Is this the beginning of another covert UFO denial program.  I find it absurd that the theory is being floated that water reflection and inept US Navy aviators are being tricked by Chinese drones flying at trans dimensional speeds...off the coast near SanDiego?",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "totochaos",
        "time": "31 May, 2021",
        "context": "The former head of the government team investigating UAPs described the skins of the craft as \"having no rivets\".\n\nMaybe YOU haven't seen clear, detailed photos of the craft but it sure sounds like somebody has.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "durpees553",
        "time": "31 May, 2021",
        "context": "Looks like a distraction away from something else.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "grafelfing799",
        "time": "31 May, 2021",
        "context": "Alien craft is a real stretch with Relativity, the speed of light (C) not being able to approach it because of E = mc2, the Universe is expanding faster than the speed of light, going back in time with a wormhole is an even bigger 'stretch', and the big reason against alien craft why would a million year civilization ahead of us want to come here.... the Universe has everything earth has .... except 'The Andy Griffith Show'.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bizpatriot",
        "time": "31 May, 2021",
        "context": "Personally I think it is odd our Government immediately thought it was a UFO rather than a threat from one our enemies. Way the chances of each option....I think an enemy threat is way more likely, especially during current times.\n\nThe fact CBS is airing it should speak volumes.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "averageamerican671",
        "time": "31 May, 2021",
        "context": "200 knots WOW that's fast they must have been traveling for 16 billion years to get here",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "robincorrnwall",
        "time": "31 May, 2021",
        "context": "Always blame either the Chinese or the Russians to try and hide tha fact that you know nothing.",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Pepper_",
        "time": "31 May, 2021",
        "context": "Personally I think we need to fix the problems here at home before we start looking outside our planet.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "kidrockyou",
        "time": "31 May, 2021",
        "context": "I saw the Phoenix lights which many people saw that night however I was fortunate enough to see glowing orbs I presume because they were to bright to see features, they could hover, move in any direction, move at. Speeds that looked instantaneous and all 5 or 6 vanished at once. You be the judge but that was like 24 years ago and I still know of nothing that can do what I saw.",
        "good": "9",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "walkingnformation",
        "time": "31 May, 2021",
        "context": "Hey look, a government disinfo agent. Thanks FOX",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "nigelf",
        "time": "31 May, 2021",
        "context": "It's a democrat hoax.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "anchorpost",
        "time": "31 May, 2021",
        "context": "I wish for a UFO to swoop in and take Joe and Kampala and MIT Romney and Mitch, and Graham to  another plant. Also take Obama, Adam Schiff and Crazy Nancy. Thank You.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "websterminator",
        "time": "31 May, 2021",
        "context": "I don't know why everyone is so excited?  Everytime they interview one of those alien abductees they tell you about anal probes. Maybe that's what you guys are into, but I'll take a pass on that.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "skydog759",
        "time": "31 May, 2021",
        "context": "Maybe it’s Ren or stimpys fart",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "mainebyca",
        "time": "31 May, 2021",
        "context": "Finally an reasonable thoughtful answer to this mystery that makes perfect sense.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "FrenchCreekCL",
        "time": "31 May, 2021",
        "context": "(He won a recent grant from NASA to search for some kind of advanced technology on planets in far-away solar systems.)\n\n  That says it all. He lives on the taxpayers dime.",
        "good": "9",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Sgt_J_J_Sefton🇺🇸",
        "time": "31 May, 2021",
        "context": "Intelligent space aliens are far less plausible than unicorns or leprechauns.",
        "good": "5",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "brian1011",
        "time": "31 May, 2021",
        "context": "A really smart guy that has his scientific conclusion already prepared.  To speak about a craft that is able to travel thru light years of space and defy our limited knowledge of how things should work in our own puny galaxy is only impossible in his brain.  He may still have more to learn about astrophysics and what are the  possibilities in a  universe that is billions of years old.",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "proudtoserve",
        "time": "31 May, 2021",
        "context": "Still doesn't explain how those drones fly with no wings.",
        "good": "9",
        "bad": "0",
        "replies": []
    }
]