[
    {
        "user_name": "whatupyo",
        "time": "3 September, 2022",
        "context": "Exhibit H demonstrating how democrats are trashing the constitution.",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "FighttheFascists",
        "time": "3 September, 2022",
        "context": "Missouri is an evangelical theocracy",
        "good": "0",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "jcir",
        "time": "3 September, 2022",
        "context": "The right has been in full whistle blower mode on this issue and the left has been in full denial mode.  Middle ground says its happening.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Coolbreeze326",
        "time": "3 September, 2022",
        "context": "Was there ever any doubt? Even Suckerberg has admitted to being in the DNC's back pocket.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "benof67",
        "time": "4 September, 2022",
        "context": "The Collusion between the Biden regime with Big Tech and Major Media outlets is a form of collusion Mussolini once describe as the formula for the Ideal Fascist state.  Biden has embraced practices and ideologies to similar to Mussolini's to go unnoticed and unchecked.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "iare",
        "time": "3 September, 2022",
        "context": "But but the MAGA Republicans will censor you and take away your rights. \nYeah right",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "objectivevoice079",
        "time": "4 September, 2022",
        "context": "Finally; the truth surfaces ;I cant tell you how many people were banned from Twitter;for complimenting TRump since 2016...ITs quite evident that the elite billionaires and high tech corporates have collectively conspired to fund the DNC  to promote NEW WORLD ORDER;that being ONE GLOBAL Government of Satanic Leadership....",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Vøn737",
        "time": "3 September, 2022",
        "context": "Bingo! I've said it again and again! This is not a \"conspiracy theory\". The Deep State are using Big Tech/social media to promote misinformation, and censor opponents. Duh. It's obvious. Wake the fork up!",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "elgatoloco168",
        "time": "3 September, 2022",
        "context": "It has been obvious for some time. \nIf the entire Federal system were not corrupt, it would have been dealt with long ago.",
        "good": "2",
        "bad": "0",
        "replies": []
    }
]