[
    {
        "user_name": "pfisher500",
        "time": "16 September, 2022",
        "context": "Glad to hear that Merrick was put in his place.  He thinks that he can tell the judge what's what.",
        "good": "4",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "wayner",
        "time": "16 September, 2022",
        "context": "Trump knew Putin was in a position to be a complete thorn in the side of the world.  While Trump was trying to be friendly to Putin, but still being unpredictable, Putin didn't launch any wars.  Got to believe Trump played it right.",
        "good": "3",
        "bad": "2",
        "replies": [
            {
                "user_name": "kingmax",
                "time": "16 September, 2022",
                "context": "Lying traitor Trump was Putin's puppet. Putin was trying to kill NATO and traitor Trump was doing his best to make Putin's dream come true.\nCorrupt, lying pyg traitor Trump proved he was Putin’s puppet in Helsinki. He took Putin’s word over that of US intelligence agencies and he did it on an international stage. The President of the United States threw US intelligence agencies under the bus in deference to the leader of a foreign adversarial power.",
                "good": "2",
                "bad": "2",
                "replies": [
                    {
                        "user_name": "voteoutthecrazies413",
                        "time": "17 September, 2022",
                        "context": "TDS sad for you",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "MoreyAmsterdamn",
                        "time": "21 September, 2022",
                        "context": "You see how bad Biden is so you are transferring your hate to trump- you are showing signs of Wacko- get help",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "murica572",
        "time": "16 September, 2022",
        "context": "The FBI has destroyed democracy and the brass must be made to pay a steep price for their roll in rigging elections. 40 years in a federal prison or worse.",
        "good": "1",
        "bad": "1",
        "replies": [
            {
                "user_name": "ossie234",
                "time": "18 September, 2022",
                "context": "I agree Trump should get 40 yrs for being a traitor to America.,",
                "good": "0",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "ibleedredwhiteblue921",
                        "time": "18 September, 2022",
                        "context": "How many year should big guy and Hunter get life with out parole",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "ossie234",
                                "time": "18 September, 2022",
                                "context": "The law will decide that..\nUnlike you  I believe no matter who you are if you break the law you go to jail ..",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "johnlkuhn",
        "time": "17 September, 2022",
        "context": "Evil has been disrupting  our lives even day in DC.",
        "good": "4",
        "bad": "1",
        "replies": [
            {
                "user_name": "daisyrosey",
                "time": "17 September, 2022",
                "context": "Biden you are Evil and against the Republicans and Christians. Half or more of this Country. Those white agree with me, Pray to God as our original Leadership did and led us. George Washington, Abraham Lincoln, and many others Whom where great leàders of this country. Obama and Biden have been the Most Evil Leaders of America and àre ready to Destroy America.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "donewiththat",
        "time": "16 September, 2022",
        "context": "As the saying goes, Follow the Money. If this person was paid by the FBI, then it shouldn't be hard to prove.",
        "good": "2",
        "bad": "0",
        "replies": [
            {
                "user_name": "Socratic_method",
                "time": "17 September, 2022",
                "context": "They already know it.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "can’twealljustgetalong699",
        "time": "16 September, 2022",
        "context": "Habba is an unfathomable light-weight. I’ve worked with more than a dozen higher-end attorneys over the years (including those at Perkins Coie), and even junior partners are far superior to Ms. Habba. Attorneys are engaged to undertake serious business, and observing Ms. Habba would prompt me to have serious doubts about Trump. It makes the choice of Michael Cohen appear to be less of an aberration. \nI’m surprised that his kids haven’t fired her, as her lack of intellectual capacity is breathtaking and embarrassing.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "didn'tdrinkthekoolaid",
        "time": "16 September, 2022",
        "context": "Trump's love affair with Putin is indeed a complete outrage, but nothing when compared to his failed coup d'état.",
        "good": "4",
        "bad": "7",
        "replies": [
            {
                "user_name": "voteoutthecrazies413",
                "time": "17 September, 2022",
                "context": "Joe Bribem, the banana republic dictator.  Vote “for me” and I’ll destroy those ultra maga threats to our communist plans for this country beginning with false accusations and namecalling, total destruction of the economy and the American way of life and more.",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "wildrover085",
        "time": "16 September, 2022",
        "context": "Corruption is now paid for.  How unique for a federal institution that Americans trust.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "urbanlogic",
        "time": "16 September, 2022",
        "context": "The DOJ is worried now. Cracks starting to show in their absurd case. Can only fool serious people for so long. Sad indeed.",
        "good": "6",
        "bad": "2",
        "replies": [
            {
                "user_name": "kingmax",
                "time": "16 September, 2022",
                "context": "What absurd case? Why are Trump cultists so dishonest, oblivious and willfully ignorant?",
                "good": "2",
                "bad": "2",
                "replies": [
                    {
                        "user_name": "TerryQ",
                        "time": "17 September, 2022",
                        "context": "just look at them",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "daisyrosey",
                        "time": "17 September, 2022",
                        "context": "There is no such thing as Trump cultists,it's all you Biden cultists that continue to believe all the cult newspapers, that continue to lie!!!!!!!!!!!",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "kingmax",
        "time": "16 September, 2022",
        "context": "Any honest person paying close attention knew the Trump campaign was working with Russia. I kept asking these questions of Trump's supporters:\nWhy did Manafort give internal polling data on 3 key swing states to a Russian agent?\nWhy did the Trump team take a meeting in Trump Tower with Russian agents and lie about it? Do Trump supporters really believe the Russia Tower meeting was about adoptions?\nWhy were there more than 100 contacts between the Trump team and Russian agents and why did they lie so frequently about them?\nWhy did Trump fire Comey (Hint: \"the Russia thing”).\nTrump's clueless suckers could never provide a coherent answer.",
        "good": "2",
        "bad": "9",
        "replies": [
            {
                "user_name": "sargejohn362",
                "time": "16 September, 2022",
                "context": "⚠️PROPAGANDA ALERT ‼️",
                "good": "2",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "cmsgt(ret)89",
        "time": "18 September, 2022",
        "context": "if trump was so wonderful he wouldn't need so many lawyers - dump baggage boy trump",
        "good": "0",
        "bad": "1",
        "replies": [
            {
                "user_name": "ibleedredwhiteblue921",
                "time": "18 September, 2022",
                "context": "Different lawyers to handle Different things u don't send a dog catcher to catch a elephant",
                "good": "1",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "TerryQ",
        "time": "17 September, 2022",
        "context": "okay, thx.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "nothingbuttheemes",
        "time": "18 September, 2022",
        "context": "Is Durham paid by the day? How many more years before he finishes his investigation?",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "8mmmagnum",
        "time": "17 September, 2022",
        "context": "The feds, libs and media are all terrorists of this country.",
        "good": "7",
        "bad": "3",
        "replies": [
            {
                "user_name": "kingmax",
                "time": "17 September, 2022",
                "context": "Please don't storm our US Capitol again, lying traitor.",
                "good": "2",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "TerryQ",
                "time": "17 September, 2022",
                "context": "wowzer, tough guy!",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "daisyrosey",
                "time": "17 September, 2022",
                "context": "I Totally Agree!!!!  THE REPUBLICANS ARE NOT TERRORISTS!!!!!!!!!",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "freesouthafrica",
        "time": "17 September, 2022",
        "context": "Obama's FBI",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "mreggypantz",
        "time": "17 September, 2022",
        "context": "And the party that squawks so frequently about the \"threats to our democracy\" is dead silent when they are the beneficiaries of such corrupt, deceitful, antidemocratic behaviors. Indeed, not only will you not hear a peep of protest from them, their obedient lackeys in the media will barely even give this story any news cycles.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "freesouthafrica",
        "time": "17 September, 2022",
        "context": "Corrupt FBI",
        "good": "6",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "hutchijf",
        "time": "19 September, 2022",
        "context": "Habba’s professional conduct, decisions, and courtroom theatrics have routinely embarrassed her Trumpworld legal colleagues—to the point that there are multiple group chats of Trump lawyers where much of the discussion is devoted to profusely complaining about Habba or harshly mocking her. (Habba, naturally, is not included in the text or email threads.)",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "freesouthafrica",
        "time": "17 September, 2022",
        "context": "PROSECUTE OBAMA",
        "good": "4",
        "bad": "2",
        "replies": []
    }
]