[
    {
        "user_name": "Buttery_Males",
        "time": "1 May, 2021",
        "context": "Wow you rubes will believe anything, won't you? Fox loves to keep you entertained and stupid.",
        "good": "12",
        "bad": "40",
        "replies": []
    },
    {
        "user_name": "gk2",
        "time": "1 May, 2021",
        "context": "Tuckers onto the big issues. Investigating UFOs, setting the police on children wearing masks, stopping immigration because its a Dem plot to replace white voters...",
        "good": "5",
        "bad": "17",
        "replies": []
    },
    {
        "user_name": "climate2017468",
        "time": "1 May, 2021",
        "context": "UFOs lol, stop with the hocus pocus stuff we have enough to take care of here like actual \"aliens\" coming over the border!",
        "good": "26",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "hippocrasy",
        "time": "1 May, 2021",
        "context": "Mr. Potatohead and Dr. Seuss were unavailable for comment at this time.",
        "good": "20",
        "bad": "10",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "PapaSmoke",
        "time": "1 May, 2021",
        "context": "They never ignore anything. Hide it maybe but never was ignored.",
        "good": "28",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "GreenDice",
        "time": "1 May, 2021",
        "context": "Nasa is still searching for life inside Biden's brain!",
        "good": "93",
        "bad": "13",
        "replies": []
    },
    {
        "user_name": "PurpleBucket",
        "time": "1 May, 2021",
        "context": "Blame commie led China",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "TheRepublicMatters🎬",
        "time": "1 May, 2021",
        "context": "This is irrelevant in my view in light of all the confusion we’re going through in this world.",
        "good": "3",
        "bad": "17",
        "replies": []
    },
    {
        "user_name": "llllllBlackLivesDontMatterllllll",
        "time": "1 May, 2021",
        "context": "How amazing would it be to be abducted and snatched out of your home by a UFO and taken to some far away planet where there are no racist violent black animals crying fake racism every waking moment of your life and no embarrassing comical black worshiping white Democrat animals dumping their drool all over that dark skin 24/7 calling their own race racist. Yes please come and abduct me anytime you please",
        "good": "16",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "williamffisher",
        "time": "1 May, 2021",
        "context": "There are no UFOs. If aliens were advanced enough to have developed interstellar travel, why would they play peek-a-boo with us?",
        "good": "8",
        "bad": "8",
        "replies": []
    },
    {
        "user_name": "Biden=FakePresident",
        "time": "1 May, 2021",
        "context": "I've read a bunch on this topic and still do now, much more than I ever planned. While people have seen some very strange things, truth is nothing is confirmed yet. We can only make assumptions even today. The Rendlesham Forest one is particularly interesting in that a binary message was allegedly transferred from craft saying \"Exploration of Humanity.\" That can mean many things, time travelers, interstellar travelers. Despite all my reading, I am not convinced there are actual aliens, but I don't believe it is our adversaries jumping ahead either. Hard to get to truth sometimes, this is one of those topics.",
        "good": "67",
        "bad": "11",
        "replies": []
    },
    {
        "user_name": "👑QueenBiden👑",
        "time": "1 May, 2021",
        "context": "Grey Lives Matter 👽",
        "good": "15",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "CyanWeights",
        "time": "1 May, 2021",
        "context": "Does anybody really believe our government is about to tell the truth? I don't think so.",
        "good": "185",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "dahamburgler",
        "time": "1 May, 2021",
        "context": "After having Rudy on his show Tucker feeds his sci fi loving base some alien desert.",
        "good": "2",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "🧻🚽💩🪠",
        "time": "1 May, 2021",
        "context": "Elizondo raised the possibility that so-called UFOs are actually \"adversarial foreign technology\"\n\nWhat adversary? Russia or China would have used it to their advantage long ago. The only other powers who might be capable are on the good side. Intelligence would have picked up hints of any foreign programs able to do this. We don't even know that the things in the photos are solid objects. Some of them appear to be insects inside the lens. Some appear to be laser light shows. Pink Floyd anyone?",
        "good": "8",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "toolieman",
        "time": "1 May, 2021",
        "context": "At the end of WW2, German scientists were working on aircraft capable of 1,200 MPH, and using alternative forms of propulsion than standard jet engines.  They were doing this while being bombed 24/7/365 by allies night and day. \n Imagine what they would be capable of working in Labs and with sufficient funding.",
        "good": "80",
        "bad": "17",
        "replies": []
    },
    {
        "user_name": "TeddyBeary",
        "time": "1 May, 2021",
        "context": "The Venn diagram of conspiracy theorists and Fox News is grossly but appropriately overlapped.",
        "good": "2",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "qvatchnik099",
        "time": "1 May, 2021",
        "context": "👽",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "JoseMAGA",
        "time": "1 May, 2021",
        "context": "It still BEGS the question ... \n... why travel oodles of light years - with unsurpassed advanced technology - to only avoid contact; but occasionally appear to some isolated slack-jaw farmer in the boonies??!",
        "good": "58",
        "bad": "18",
        "replies": []
    },
    {
        "user_name": "phx5439",
        "time": "1 May, 2021",
        "context": "Ah, UFO's.  The perfect story for Foxbot-level readers.",
        "good": "2",
        "bad": "13",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "cynic378",
        "time": "1 May, 2021",
        "context": "There will be a day of reckoning after our invasion fleet arrives.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "andthehorseyourodeinon704",
        "time": "1 May, 2021",
        "context": "Yeah yeah yeah, UFOs, unidentified flying objects, okay, doesn't mean they came from another star system, just that they were not identified. Yeah I know that just sounds technical, but it sure isn't as far fetched as the 'thinking' (a very dangerous event sometimes) that they must be from advanced civilizations hundreds of light years away. Relax, breath deeply, and just relax.",
        "good": "5",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "GreenRocket",
        "time": "1 May, 2021",
        "context": "Do you notice that the first 20 comments here are from woke paid trolls? The rest of America has better things to do.",
        "good": "8",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "xxx09",
        "time": "1 May, 2021",
        "context": "It really the Jettisons",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cheesypotatoes",
        "time": "1 May, 2021",
        "context": "Are UFO’s racist?",
        "good": "13",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "theancientalien",
        "time": "1 May, 2021",
        "context": "Since I am an expert on this topic, let me set the record straight. Don't worry about UFO's. Worry about voting out the \"Shadow Government\" that took over your country on Jan. 20 2021.",
        "good": "159",
        "bad": "13",
        "replies": []
    },
    {
        "user_name": "kryptonian2075",
        "time": "1 May, 2021",
        "context": "When and alien invasion is more believable than sleepy getting 81M votes",
        "good": "131",
        "bad": "9",
        "replies": []
    },
    {
        "user_name": "VeroVeritas",
        "time": "1 May, 2021",
        "context": "Yaawwnn...",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "karlhungus00",
        "time": "1 May, 2021",
        "context": "Nobody should dismiss what an adversary could think up and develop in response to anti-ballistic missile tech. in the US.  Just like Hitler did with the Maginot line, simply go around it.  Why couldn’t a submarine carry a long range stand-off torpedo that could then launch a terrain following drone capable of carrying a 150kg nuke?  This could be done just a few kM from shore and be over a coastal city in minutes with satellite and radar totally blind to it.  Surprise!  How you like that new light source?",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "wth11b",
        "time": "1 May, 2021",
        "context": "Aliens invented CO19!  Might as well blame them, nobody going to blame the Bat eaters for it!",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "the.reign.in.spain.falls.mainly.to.the.revolution",
        "time": "1 May, 2021",
        "context": "It's obvious the ET's are among us and have been interfering with the reporting about them. One of the ways to identify them is by their refusal to mask up, take the vaccine, or support Biden.",
        "good": "4",
        "bad": "20",
        "replies": []
    },
    {
        "user_name": "ksc",
        "time": "1 May, 2021",
        "context": "Nothing to see here fellas...majority of sightings can be attributed to swamp gas leaking from the pant suits of Hillary, AOC, Waters & Pelosi.",
        "good": "49",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "bob820",
        "time": "1 May, 2021",
        "context": "If they ( beaurcrats ) can't make a racial issue of it they aren't interested.",
        "good": "10",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "lucky_luke",
        "time": "1 May, 2021",
        "context": "Nonsense",
        "good": "1",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "Shakinmyhead530",
        "time": "1 May, 2021",
        "context": "Just turn the ray guns on and fry us all. Let a new generation start over. We've obviously failed at ours.",
        "good": "7",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "DanS.",
        "time": "1 May, 2021",
        "context": "\"Reckoning\", under the Biden Administration, that's funny.",
        "good": "13",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "mtdreams",
        "time": "1 May, 2021",
        "context": "blah Blah Blah",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jonjon_of_jonjon",
        "time": "1 May, 2021",
        "context": "When I was 14, I saw a UFO.  It was saucer shaped and had blue designs on a white background.  I was startled, because when it flew directly overhead, it made absolutely no sound.  That was the last time I talked back to my Mom in the kitchen.",
        "good": "250",
        "bad": "17",
        "replies": []
    },
    {
        "user_name": "barnaclebill,thesailor142",
        "time": "1 May, 2021",
        "context": "Great. Just what we need.\n\nMore illegal aliens.",
        "good": "21",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "dahamburgler",
        "time": "1 May, 2021",
        "context": "Tucker better make sure he registers as a foreign agent, we all know he works for the Aliens at Fox...",
        "good": "2",
        "bad": "7",
        "replies": []
    },
    {
        "user_name": "Paul471",
        "time": "1 May, 2021",
        "context": "Tucker: pick your battles. UFOs are simply not important at this point. If they have the capabilities that these videos seem to show, they obviously don't want to harm us because they could have done so easily. So, either they are peaceful and will contact us in their own good time, or they are fake and don't matter.  \n\n$6T new spending in three months, the destructive GND, new taxes, and new regulations are a far more serious problem right now.\n\nWe can deal with the UFOs when they land and say hello/make their demands.",
        "good": "46",
        "bad": "11",
        "replies": []
    },
    {
        "user_name": "golfer44",
        "time": "1 May, 2021",
        "context": "We are here.....RUN 👽👽👽👽👽",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "AHuman499",
        "time": "1 May, 2021",
        "context": "The Space Aliens were disappointed to find no intelligent life",
        "good": "10",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "jonnyflyboy99",
        "time": "1 May, 2021",
        "context": "The sky is falling ,\nand a mask won't help that either",
        "good": "18",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "itsanillusion",
        "time": "1 May, 2021",
        "context": "No such things as space travelers or ghosts. Funny how humans want to believe in this stuff.....BOO!",
        "good": "1",
        "bad": "10",
        "replies": []
    },
    {
        "user_name": "gopherwrangler",
        "time": "1 May, 2021",
        "context": "How would they reckon if they can’t even explain it?",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jtmojave",
        "time": "1 May, 2021",
        "context": "I continue to pray for the lost in this sin filled world, thank you JESUS 🥰🙌",
        "good": "7",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "DoctorPublius",
        "time": "1 May, 2021",
        "context": "The government CAN'T talk about it-- they are no longer allowed to use the word: ALIENS!\n\nThe truth is out there....",
        "good": "14",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "GreenBasketball",
        "time": "1 May, 2021",
        "context": "What?",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "lookup1",
        "time": "1 May, 2021",
        "context": "No one seen a UFO, no one is hiding anything. Probably some piece of space junk dancing in the wind.",
        "good": "3",
        "bad": "9",
        "replies": []
    },
    {
        "user_name": "gopherwrangler",
        "time": "1 May, 2021",
        "context": "Any other life form capable of getting to us in a “ship” is far more advanced.  Leaps and bounds beyond more advanced.  Do we really need to go looking for them?  Or want to?",
        "good": "111",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "gk2",
        "time": "1 May, 2021",
        "context": "Tucker, why don't you and you friend get onto the constitutionality of making whoopee with underage girls and then giving them \"gifts\" in gratitude.",
        "good": "3",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "CanYouHandletheTruth034",
        "time": "1 May, 2021",
        "context": "Guess the aliens didn’t think UK important enough to visit. No intelligent life there.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "chrisblitzer2",
        "time": "1 May, 2021",
        "context": "Pope is still returning and selling his snake oil.",
        "good": "0",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "taterchip53",
        "time": "1 May, 2021",
        "context": "I fear that if Aliens (the good kind) come into contact with us, will soon learn they are racist. Count on it.",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "dahamburgler",
        "time": "1 May, 2021",
        "context": "Rudy got the Hunter Biden hard drives from Aliens that live in Area 51, They’re willing to testify but no one will listen.",
        "good": "8",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "barnaclebill,thesailor142",
        "time": "1 May, 2021",
        "context": "Biden just found out that aliens might be real...\n\n...he wants to be probed, if you know what I mean.",
        "good": "8",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "🎪🤡ⒷⒾⒹⒺⓃ'Ⓢ🤡ⒸⓁⓄⓌⓃ🤡ⓈⒽⓄⓌ🤡🎪",
        "time": "1 May, 2021",
        "context": "These little green men will soon be demonized by the left for their green supremacy and too much green privilege.  👽  👽  👽",
        "good": "14",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "gk2",
        "time": "1 May, 2021",
        "context": "I really wish Fox would REPLACE Tucker with an Hispanic immigrant.",
        "good": "1",
        "bad": "22",
        "replies": []
    },
    {
        "user_name": "knockoutgamevictim",
        "time": "1 May, 2021",
        "context": "It doesn't matter if the UFO is from Russia or Eris, hiding the UFO's is a threat to national security!! If you can't identify it, than release all of the data to the public until it is identified!",
        "good": "10",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "GoodCigarsNeverDie-TheyJustGetReincarnated",
        "time": "1 May, 2021",
        "context": "Folks, Aliens are real - and they're secretly living amongst us as our neighbors!\n \nTake Houston, Texas where I live as an example. At any given time, there are thousands upon thousands of aliens living here. They all have a UFO, they speak a language from which I do not understand, and they appear to live solely on BBQ and beer. But for some odd reason they seem to be terrified of ice.\n \nJust last week, I walked out into my back yard and screamed - \"ICCCCE\" - and within seconds, every alien within range of my voice had ran from their homes, jumped into their UFOs and zoomed away!",
        "good": "42",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "astoundingshemonster",
        "time": "1 May, 2021",
        "context": "It's Nancy on her broom .",
        "good": "16",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "juspassingthru",
        "time": "1 May, 2021",
        "context": "He has been watching to many movies.\n75-80% of the earths population have cameras in their hands.\nThere will be no doubt if ET showed up on our doorstep, they would be mobbed by a large pack of selfie zombies and streamed live in the first 10mins.",
        "good": "6",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "Proverbs3:5🙂",
        "time": "1 May, 2021",
        "context": "I just find it hard to believe with all the billions of people in the world with billions of cell phones and cameras every now and then you get a weird picture that nobody understands what there looking at. Never a decent photo just a light moving around.. we have filmed the Titanic and we have filmed galaxies other than ours why can't we catch one of these things one time, on film... A picture you can actually look at and decipher what it is.",
        "good": "11",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "VeroVeritas",
        "time": "1 May, 2021",
        "context": "It's parked in my garage. Anyone wanting to see it, give me a call!",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "hilairebelloc",
        "time": "1 May, 2021",
        "context": "Even if these were real (they aren’t) public has a right to NOTHING:\n\n1) Sensitive diplomacy. Rouge nations or individuals may act rashly.\n2) Impossible to have a coordinated response if too many people know.\n3) Information is power.  And not necessarily nefarious.  May only be cautious.  We are not sure what we do know.\n4) Seeking Military secrets.\n5) Pursuing economic advantage.\n6) Preventing destabilization.  \nUncertainty over discoveries.  We may not know what we found.\n7) May be an entirely different phenomenon.\nWhat if what has been discovered is a natural non-sentient but potentially dangerous phenomenon?\n8) Can you think of one good reason why the government should tell people highly sensitive information?\nIt may be better to reveal when we have made more progress.\nDid they come and go and are long gone?\n9) Bad precedent to reveal secrets",
        "good": "0",
        "bad": "12",
        "replies": []
    },
    {
        "user_name": "101stParatrooper",
        "time": "1 May, 2021",
        "context": "Angels are extra-terrestrials.",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "TheTruthAndNothingButTheTruth",
        "time": "1 May, 2021",
        "context": "“The less people know, the more stubbornly they know it.”",
        "good": "9",
        "bad": "2",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "jayo6",
        "time": "1 May, 2021",
        "context": "These sightings (that aren’t natural phenomena or sightings of conventional aircraft, which many likely are) are observations of craft designed as part of advanced aerospace research programs - both manned and unmanned.  They’re not space aliens.  They’re manmade.  \n\nWe should hope aliens don’t ever find earth and don’t find us.  It’s very unlikely they’d simply let us continue to exist, particularly on a planet so rich with resources as our own.",
        "good": "5",
        "bad": "10",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "dixiedied",
        "time": "1 May, 2021",
        "context": "More superstitious nonsense. Guys just selling a book",
        "good": "1",
        "bad": "9",
        "replies": []
    },
    {
        "user_name": "kilowattt245",
        "time": "1 May, 2021",
        "context": "The UFOs are interested in our nuclear technology.",
        "good": "10",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "mpilot",
        "time": "1 May, 2021",
        "context": "Can you imagine beings much smarter than humans looking down at our blue marble and listening to our TV and internet trash being broadcast all over the universe like some pirate radio station in the ocean?  I bet there are \"Do not Enter, these humans are nuts\" signs posted all over the outskirts of our Solar System.  The aliens get to Alpha Centauri and see the markers \"Warning: Cannibal like savages ahead, enter at your own risk\".  No aliens want to think about crazy Liberal ideas - military conquest or shear capitalism (too bad we don't have any resources left for them to pillage).  UFO's?  No way.",
        "good": "8",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "cassiopeian",
        "time": "1 May, 2021",
        "context": "Hey, space aliens!\nWhen you get a chance, come capture Joe Biden, Kamala Harris, Nancy Pelosi, and take them away to your planet!",
        "good": "25",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "WeForgetForYouRetail🧠",
        "time": "1 May, 2021",
        "context": "UFO does not always equate to ETI.  I'm waiting for a MUFON report which will undoubtedly be disseminated shortly thereafter.\n🛸",
        "good": "13",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "barnaclebill,thesailor142",
        "time": "1 May, 2021",
        "context": "They're here and they're hungry.\n\nThe aliens think we smell like pork tacos.",
        "good": "9",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "hilairebelloc",
        "time": "1 May, 2021",
        "context": "These are Russian and Chinese sub and spy trawler launched drones drinking in our signals intel.  The intelligence failure is we got suckered into lighting them up with our radars when we should have ignored them.  E.T. Travelled 86 trillion light years to float over the ocean instead of Times Square?  Ya’ll ignorant fools.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "caphastings605",
        "time": "1 May, 2021",
        "context": "no contact because they see the Democrats as inferior .",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bear_creek_angus",
        "time": "1 May, 2021",
        "context": "I'm more than certain that my first wife was an alien. Her other three husbands will back me up.",
        "good": "19",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "InquiringMinds2Kno!",
        "time": "1 May, 2021",
        "context": "The US government hads.been covering this up since the early 1950's since president Eisenhower.  Because the world powers felt the world wasn't ready to learn about other worldly beings.",
        "good": "29",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "beg4nothing980",
        "time": "1 May, 2021",
        "context": "So, are we going to need an Area 52?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bfmn",
        "time": "1 May, 2021",
        "context": "'plausible deniability keeps running through my mind'\nsing along with the melody of Raindrops Keep Falling on my Head",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "JoseMAGA",
        "time": "1 May, 2021",
        "context": "One possible explanation that surprisingly is not being considered ...\n... over the last two decades surprising advancements has been achieved in warp travel technology research - particularly by Dr. Harold 'Sonny' White and his team at NASA's Eagleworks Laboratory for Advanced Propulsion in advancing onto practical Alcubierre Warp technologies.  ... This could well be the Federal DARPA agency following up on all of this.",
        "good": "4",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "1pingyes2pingsno",
        "time": "1 May, 2021",
        "context": "Instead of the word \"ignored\" I believe \"suppressed' is more accurate, however it was the Pentagon rather than Lawmakers who kept the lid on the subject.",
        "good": "18",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "lenomdeplume",
        "time": "1 May, 2021",
        "context": "Sorry, without evidence, this is just another hyped-up conspiracy thing.  Interesting to think about, though.",
        "good": "3",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "DanS.",
        "time": "1 May, 2021",
        "context": "Joe thinks it's the Jetsons, everything that he knows he learned from cartoons.",
        "good": "19",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "caphastings605",
        "time": "1 May, 2021",
        "context": "first thing the Democrats would want would be vehicle emission testing done on Saucers before full contact to know carbon levels.",
        "good": "20",
        "bad": "3",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "hatedem",
        "time": "1 May, 2021",
        "context": "They are probably coming for the free health care.",
        "good": "10",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "saoirsecat",
        "time": "1 May, 2021",
        "context": "Of course there are UFOs!  That's not to say there are aliens from outer space, just that there are things that haven't been identified.",
        "good": "9",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "1pingyes2pingsno",
        "time": "1 May, 2021",
        "context": "My wife throws UFOs at me all the time. Once they hit me, I am able to identify them so they become IFOs.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "BuckFoeJiden",
        "time": "1 May, 2021",
        "context": "My opinion has always been that whatever it is that has been sighted was of terrestrial origin. There are just too many factors involved to accept that it is from another civilization outside this solar system. I think that such other intelligent races do exist, but each and every one is effectively isolated from all of the others.",
        "good": "8",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "FuzzyDunlop",
        "time": "1 May, 2021",
        "context": "The Malmstrom AFB UFO/Missile Incident in 1967 is a good read for the doubters",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "learningliberty",
        "time": "1 May, 2021",
        "context": "Well what a surprise! Whoever believed we were the only sentient life in the universe? More importantly if we have info then we had better prepare for contact. ",
        "good": "17",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "amerrepck",
        "time": "1 May, 2021",
        "context": "any correlation with mask requirements and aliens? ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jcir",
        "time": "1 May, 2021",
        "context": "My problem with UFO's today.  Everyone has a high def recording device in their pocket yet all we have is trash video of every claimed UFO sighting.\n\nShow me some HD footage of aliens and UFO's that is not from hollywood.",
        "good": "11",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "TheMegoSpider-Man",
        "time": "1 May, 2021",
        "context": "It's hilarious to watch idiots fall for the UFO hoax that had now been commandeered by globalists, corporate fake-news and leftists.",
        "good": "0",
        "bad": "11",
        "replies": []
    },
    {
        "user_name": "lenomdeplume",
        "time": "1 May, 2021",
        "context": "Why is this all coming out just now? Is legalized weed a contributing factor?  Maybe it's just a Grateful Dead tour bus.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "andydufresne1966",
        "time": "1 May, 2021",
        "context": "I've always enjoyed stories about extraterrestrials, especially the ones on the History Channel.\nGREAT entertainment!\nAs kids, we were enthralled by tales of Area 51 / Roswell NM.\nIt was fodder for great science fiction.\nNow?\nThe inexplicable incidents surrounding the Advanced Aerospace Threat Identification Program (AATIP) are just phenomenal, having entered the realm of science reality.\nTake my humble comment for what it's worth.\nI no longer think these recent developments can be dismissed as simply diversionary distractions.\nNo clue as to what these things are, but we now have an extremely credible cast of characters who are willing to report ... and who have too much to lose were they to prevaricate on their observations.",
        "good": "115",
        "bad": "13",
        "replies": []
    },
    {
        "user_name": "amerrepck",
        "time": "1 May, 2021",
        "context": "these are reflections of satellites and space debree",
        "good": "0",
        "bad": "3",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "drernesto",
        "time": "1 May, 2021",
        "context": "People have been seeing weird things in the skies for thousands of years.  I don't claim to know what they are, but pretending they are all hoaxes or hallucinations doesn't seem like a very useful response.  We need to know what they are.",
        "good": "82",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "GoldBulb",
        "time": "1 May, 2021",
        "context": "Lol... they are called demons",
        "good": "3",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "jtbest01",
        "time": "1 May, 2021",
        "context": "It’s a shame our intelligence haven’t been awake and allowed China/ Russia who knows to develop tech we were not aware of.",
        "good": "1",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "wirius",
        "time": "1 May, 2021",
        "context": "Fox knows its base, that's for sure.",
        "good": "6",
        "bad": "11",
        "replies": []
    },
    {
        "user_name": "RedApple",
        "time": "1 May, 2021",
        "context": "Something tells me these \"saucers\" are Soviet/Russian and Chinese in origin.",
        "good": "1",
        "bad": "9",
        "replies": []
    },
    {
        "user_name": "Rude_Rebel",
        "time": "1 May, 2021",
        "context": "Aliens probably avoid this planet whenever they go sightseeing.  ",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jactrac759",
        "time": "1 May, 2021",
        "context": "Some UFO's were prototypes of the B-2 bomber (flying wing) aircraft that we got from the Germans at the end of WWII. Others later on were prototypes of guided smart bombs which we saw a lot of in the gulf war. Those also began development around WWII. Then we always had  weather balloons and natural phenomenon and so on.",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "kayleighMcenany",
        "time": "1 May, 2021",
        "context": "Are we arrogant enough to believe we are the only intelligent life in the universe?",
        "good": "11",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "loki2017",
        "time": "1 May, 2021",
        "context": "I witnessed a UFO twice in my life. Once while deployed in the Air Force and recently over Detroit metro airport. Both flew like nothing I’ve ever seen before. What I saw on both occasions were amazing and I wish mankind could possess that technology. Incredible speed. The two I saw in Detroit would had killed the pilot with the g forces. There’s no doubt in my mind there’s more going on in the universe.",
        "good": "108",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "bigmikegalaxy",
        "time": "1 May, 2021",
        "context": "Reminds me of that old 1960s commercial where the guy keeps shaking his head, muttering \"I'm not gonna pay a lot for that anteater\".  Made as much sense then as this silly UFO nonsense makes now.",
        "good": "2",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "Proverbs3:5🙂",
        "time": "1 May, 2021",
        "context": "A few years back it was crop circles all kinds of crop circles now you don't hear of any more crop circles what did the aliens forget how to draw LOL.",
        "good": "6",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "philly805",
        "time": "1 May, 2021",
        "context": "Grown men believing in UFOs.  Ha hahahahahaha",
        "good": "2",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "H2S04",
        "time": "1 May, 2021",
        "context": "I'm not saying it was aliens, but it was definitely aliens.",
        "good": "4",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "caphastings605",
        "time": "1 May, 2021",
        "context": "Fauci would say before first contact the Aliens would have to have the vaccine and wear a mask and social distance.",
        "good": "6",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "Honestyisthebestpolicy",
        "time": "1 May, 2021",
        "context": "This whole story is yada yada yada.",
        "good": "0",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "vinny1943770",
        "time": "1 May, 2021",
        "context": "Should we follow the lead of the UK?",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "duke@648097",
        "time": "1 May, 2021",
        "context": "I don’t think ufos are from foreign countries. To many whistle blowers and people cannot keep secrets. There is lots advanced technology and I’m sure if one country figured it out then other advanced countries would study the sightings and figure it out. The speed, ability to maneuver directionally incredibly quick is interesting. I see reports of visible to gone to going into the water changing shape. I will need a lot more data before I can form an opinion. Top NASA and  scientific evidence will have to give reports. And I don’t believe the government will tell all it knows. Interesting topic. Lots to learn. Just because there is signaling being sent no one has to answer or it may not mean anything to another being. I have never really ever seen really clean video either always blurry.",
        "good": "17",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "crossroads2.0",
        "time": "1 May, 2021",
        "context": "UFOs appear to have an interest in nuclear facilities. Maybe they are trying to save us from ourselves.",
        "good": "7",
        "bad": "3",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "mikeb.434",
        "time": "1 May, 2021",
        "context": "Assuming that aliens are watching us...In lieu of what's happening in the USA alone they are probably saying what a inferior species",
        "good": "9",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "Sgt_J_J_Sefton🇺🇸",
        "time": "1 May, 2021",
        "context": "OK.\nWake me up when they release the files on leprechauns and unicorns.",
        "good": "3",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "HawnschottFurzt",
        "time": "1 May, 2021",
        "context": "Any alien civilization able to master casual interstellar would first have to know, from our perspective, just about everything there is to know about time and space. The speed of light is not just a good idea..it's the law.",
        "good": "13",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "woofgang",
        "time": "1 May, 2021",
        "context": "The U in UFO stands for \"unidentified\", and people have been seeing them for decades, but now we have to assume they're terrestrial and malevolent, and not assuming that is an \"intelligence failure\"?? I guess some people just can't get enough drama in their lives. Everything points to them having technology so far beyond ours, why worry about it? Realistically, we can't do anything about them, unless you want to start shooting at them. Wouldn't that be foolish.",
        "good": "7",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "nothingisreal147",
        "time": "1 May, 2021",
        "context": "If they’re from mars I don’t think the current administration will make them show their green cards.",
        "good": "18",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "venture",
        "time": "1 May, 2021",
        "context": "The 1950's all over again. Good Lord!",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "PurpleRadio",
        "time": "1 May, 2021",
        "context": "Orange faced Trump is living proof extraterrestrial beings are among us. 😀😀😀😀😀😉",
        "good": "2",
        "bad": "18",
        "replies": []
    },
    {
        "user_name": "AlfredENewman",
        "time": "1 May, 2021",
        "context": "I was in the park last summer and out of the corner of my eye I saw a neon green saucer shaped object. As I looked directly at it it kept getting bigger and bigger. I had just enough time to say to myself \"What is That thing?\" and then it hit me! I will never go to parks where they are playing with frisbees again....",
        "good": "16",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "unchainedmind",
        "time": "1 May, 2021",
        "context": "Are you kidding me? We show pictures of Mars detailing where there are signs of water, but the most we can get of a UFO is some blurred images? It makes no sense.",
        "good": "10",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "CyanApple",
        "time": "1 May, 2021",
        "context": "Absolutely tied to the Jew space Ray. Where is MtG? #qtrumplitards",
        "good": "1",
        "bad": "10",
        "replies": []
    },
    {
        "user_name": "whiplassh343",
        "time": "1 May, 2021",
        "context": "Ack Ack. Ack Ack Ack Ack Ack. Ack Ack Ack Ack. Ack Ack?",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rayj785",
        "time": "1 May, 2021",
        "context": "Democrats are the reason the aliens won't talk to us.",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "shadow777",
        "time": "1 May, 2021",
        "context": "THE TRUTH IS OUT THERE !!!!!",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "caphastings605",
        "time": "1 May, 2021",
        "context": "would BLM riot if the aliens were white ?",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "CyanSailboat",
        "time": "1 May, 2021",
        "context": "This can't be true because it undermines the Bible. Sorry I simply don't believe this is alien technology. It's probably Chinese.",
        "good": "2",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "MrStein",
        "time": "1 May, 2021",
        "context": "They're visitors from the future.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "jakesaysso",
        "time": "1 May, 2021",
        "context": "I always look to UK & European leaders for guidance.     :o)",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "GreenPopcorn",
        "time": "1 May, 2021",
        "context": "These UFO INTRUDERS need to be sent a message. They are UNWELCOME. Projectiles need to be sent their way! If they cant respect out planet we will build a steel wall in the atmosphere. And yes, the steel will come from bullets and missiles! The likes of which these illegal aliens have never seen!",
        "good": "2",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "BuckFoeJiden",
        "time": "1 May, 2021",
        "context": "I've argued with a lot of people about extra-terrestrial races and their supposed travel to this planet. My arguments have always been two fold: 1. The laws of physics coupled with the great distances and immense difficulties navigating in space suggests that travel in deep space is extremely unlikely for any intelligent race. 2. Even if some race has found some kind of \"loophole\" in physics that we don't yet know about, the extreme amount of energy and resources such travel would require makes that travel improbable. Why would any intelligent race expend such great quantities of resources to come here and play cat and mouse with us?",
        "good": "7",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "philly805",
        "time": "1 May, 2021",
        "context": "If UFOs wanted to keep secret, you'd think they would be intelligent enough not to turn on colored blinking lights.",
        "good": "11",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "UltraMAGAPtolomaeus",
        "time": "1 May, 2021",
        "context": "I've never seen a UFO, but my mother has, as well as my grandmother. A few years after my mother's death, I was speaking to people online from my home town who lived in the same neighborhood as my mother purely by chance. They coroborated what my mother had told me without my describing the object or the incident in detail until after they had started discussing the triangular object. This was back in 1963,and what they told me matched my mother's recollection. I have no reason to doubt they are extraterrestrial in origin.",
        "good": "75",
        "bad": "7",
        "replies": []
    },
    {
        "user_name": "philly805",
        "time": "1 May, 2021",
        "context": "After all that distance you'd think UFO men would show themselves asking for a glass of water, or a fill-up with the carbon emitting stuff, the good stuff.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "walkingnformation",
        "time": "1 May, 2021",
        "context": "This is the biggest story in world history. I wish more FOX news personalities had the courage to discuss this subject in a serious manner. This is why Tucker has the number one rated show on any of the news networks.",
        "good": "34",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "WhoDoesWhat",
        "time": "1 May, 2021",
        "context": "What ever it is that continues to reveal itself to the few, I can rest assured that God had something to do with its origins. After all he (God) did create the Heavens and the Earth and everything in them. I have an idea whom it might be in those ships because God doesn't need one to get from here to there and back again, the adversary the Devil (among other names) . . .",
        "good": "4",
        "bad": "8",
        "replies": []
    },
    {
        "user_name": "rayj785",
        "time": "1 May, 2021",
        "context": "The reason the aliens are interested in humans is because they're ranchers.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jalanopi",
        "time": "1 May, 2021",
        "context": "I predict that aliens will finally reveal themselves and announce that the Flat-Earth Society is right.",
        "good": "2",
        "bad": "4",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "directedenergy",
        "time": "1 May, 2021",
        "context": "“How to Serve Man”... what a great Twilight Zone episode",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "harmony",
        "time": "1 May, 2021",
        "context": "everybody on the mars is talking about ufo they saw.",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Highway661",
        "time": "1 May, 2021",
        "context": "Ufomannetwork",
        "good": "0",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "hatenwo",
        "time": "1 May, 2021",
        "context": "UFOs are a fact. Aliens are here.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "philly805",
        "time": "1 May, 2021",
        "context": "UFOs wouldn't travel millions of light years here just to play cat and mouse.",
        "good": "5",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "philly805",
        "time": "1 May, 2021",
        "context": "If you were to travel to a distant inhabited planet, wouldn't you try to communicate with them before anything else just as you were approaching, let's say when you are 10 light minutes away?",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "OliveRaindrop",
        "time": "1 May, 2021",
        "context": "UFO's exist...spaceships (\"flying saucers\") from other worlds spying on us do not. It's that simple.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "philly805",
        "time": "1 May, 2021",
        "context": "Bringing up UFOs on here is worse than bringing up the bible.",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "whiplassh343",
        "time": "1 May, 2021",
        "context": "Seriously, they are interested in our greens. No, not the money but more like trees. Trees are the key to geoengineering. Trees are able to converted Carbon Dioxide to Oxygen with a minimal amount of heat loss. Trees are also able to convert sunlight to Energy for living organisms. Trees also able to live for hundreds or thousands of years. They may be the least interest in humans or nuclear powers. Just look at the carbon dioxide atmosphere on Mars or the sulphuric of Neptune or the gaseous planet of Jupiter, trees will do wonder for those planets if they are able to survive. It's a hundred millions dollars question that Musk trying to ask and pay if someone can find a way to get rid of tons of Carbon in our atmosphere.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "pacificdreams",
        "time": "1 May, 2021",
        "context": "I just hope they land and save us from ourselves.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "#LET'S_GO_BRANDON!",
        "time": "1 May, 2021",
        "context": "Aliens have been calling us UFO for years now:\nUndesirable Freaking Organisms ",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "naiveoptimist",
        "time": "1 May, 2021",
        "context": "They've been stealing stuff from our garden for years, big deal, they don't mean any harm",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "safari223",
        "time": "1 May, 2021",
        "context": "Interesting when more taxation, inflation, VAT and green needed for Space X, Moon/Mars and sky net space dwelling; asteroid, planetary mining missions.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "totochaos",
        "time": "1 May, 2021",
        "context": "We know these crafts don't originate in Africa.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "CLM414",
        "time": "1 May, 2021",
        "context": "🙄  don't we have enough crazy without the UFO wackos chipping in?",
        "good": "2",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "jimrossig571",
        "time": "1 May, 2021",
        "context": "that felt good, thanks",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "johnnyeaston",
        "time": "1 May, 2021",
        "context": "It's high time. -Everyone who can think rationally knows their here. I just hope they hate democrats.",
        "good": "13",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Stillmoon",
        "time": "1 May, 2021",
        "context": "Like their drones Oh yea move at 11k miles an hour!!  Can go from air to sea at that speed go figure!!  Umm!",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "octopus203",
        "time": "1 May, 2021",
        "context": "Not from other planets. Not other Earthly nations. Reported for 1000s of years. Read Genesis. Read Exodus .Study cow mutilations. Study the Mayans. This is beyond conventional understanding. ",
        "good": "1",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "Stillmoon",
        "time": "1 May, 2021",
        "context": "Its probably a moon pigeon!!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "totochaos",
        "time": "1 May, 2021",
        "context": "I can't divulge anything more than I already have.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "thewaywewere",
        "time": "1 May, 2021",
        "context": "So, I'm bored, it's Friday night, I've got no one to mess with.  Then, voila, this article comes up on Fox.\nOMG, where do I start?\nThen I crack up laughing at all of you that takes this seriously and I can't write anything more.\nLOL LOL LOL",
        "good": "5",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "philly805",
        "time": "1 May, 2021",
        "context": "Close Encounters of the 3rd Kind, all over again.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "paulaspen603",
        "time": "1 May, 2021",
        "context": "We are 4 light years or 24 trillion miles from the nearest star.  And you thought your commute to work was long.",
        "good": "13",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "nomos",
        "time": "1 May, 2021",
        "context": "I know it's true cuz I heard it on coast-to-coast, and also saw it on ancient aliens!!",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "whatnowcornpop",
        "time": "1 May, 2021",
        "context": "Here's hoping aliens abduct the Kardashians. Once they see the shallow, oblivious mind-set of those humans the rest of us will be deemed useless and therefore unworthy  of further analysis.",
        "good": "7",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "childofmyFather",
        "time": "1 May, 2021",
        "context": "Dems are offering asylum, education, health-care and cash to all UFO travelers.  Check-in is at California State Capitol.",
        "good": "7",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "caphastings605",
        "time": "1 May, 2021",
        "context": "it would be Cosmic Racism if the Aliens turned out to be White.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Stillmoon",
        "time": "1 May, 2021",
        "context": "So who is really crazy now!!????  Not those who have seen them!!!  Its the Gullible little mind wipes!!  That believed their coverups!!!",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "philly805",
        "time": "1 May, 2021",
        "context": "I had a UFO guy from planet Arrakis over for supper yesterday and he said he couldn't believe how stupid we are.",
        "good": "8",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "nmeast",
        "time": "1 May, 2021",
        "context": "What does this EX official expect the FBI or any other alphabet soup agency to do about UFO’s? If they are actual UFO’s, those beings are light years ahead of us in technology, and weaponry.  It’s like a nuclear scientist trying to explain to a one year old, why he doesn’t like Cheerios- makes no sense to the one year old. ",
        "good": "13",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Logical1and1is2",
        "time": "1 May, 2021",
        "context": "Mediums is how they were described by the navy. \n( Demons/ fallen angels) is my personal opinion.",
        "good": "2",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "MikeaRoo",
        "time": "1 May, 2021",
        "context": "One alien to the another: \"Hang a left and floor it....let's get outta here. This place is a disaster.\"👽>👽.......😁",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "LocoLopez",
        "time": "1 May, 2021",
        "context": "Anyone who believes in aliens from outer space ought head for the nearest mental hospital for a lengthy stay.",
        "good": "3",
        "bad": "11",
        "replies": []
    },
    {
        "user_name": "rayj785",
        "time": "1 May, 2021",
        "context": "I'm pretty sure my ex mother-in-law is an alien. Or the devil, not sure which.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "AheadWarpFactorOne",
        "time": "1 May, 2021",
        "context": "Alien reporting back to comm center: \"I'd tell you what I've discovered among the life forms here, but the sergeant ain't gonna believe it!\". . .",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "LocoLopez",
        "time": "1 May, 2021",
        "context": "Tucker is going to lose a lot of credibility hosting stories like these.   He should leave these to the national enquirer.",
        "good": "1",
        "bad": "12",
        "replies": []
    },
    {
        "user_name": "philly805",
        "time": "1 May, 2021",
        "context": "UFOs showed the Egyptians how to build the pyramids better.  That was after a competing UFO showed the Egyptians how to make them great again.",
        "good": "7",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "jbrontey666",
        "time": "1 May, 2021",
        "context": "There are actually some excellent, rational, non-extraterrestrial explanations for the Navy and other UFO videos on YouTube by a guy called Mick West.  Does some recreations and shows how they could be misinterpreted.  Mostly a combination of infrared video effects and misjudging regarding position of the objects so it looks like they are moving in a different way than they actually were (parallax, etc).  Worth looking up before you totally freak out about the alien invasion.   If NASA and Government was convinced this was real we wouldn't be spending $10 billion to put an r/c car on Mars, this would be A-1 priority.",
        "good": "5",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "austintaytious",
        "time": "1 May, 2021",
        "context": "Once, a few years back, I was sitting on my veranda enjoying the cool night air. As I looked out into the night sky I saw an oval shaped “object” with an odd uniform glow that seemed to be coming from inside. It was moving very slowly but steadily far enough away to move behind large trees far off in the distance. It was heading north and I sat watching it with my wife for about 2-3 minutes until it finally went behind a large stand of trees then never came out from behind those trees again... at least we didn’t see it re-emerge. So we sorta sat back down (we had stood up to move to the railing for a better look trying to make sense of what we had seen). She’s a total nonbeliever but I try to keep an open mind on things I may not fully understand. At any rate, as we were back in our chairs thinking “it” was gone, I saw the exact same object appear in the exact same place moving south to north just as it had the first time. THIS is where it really got weird. We both stood up and went back to the upper veranda railing to watch this identical thing go through the identical motions until it’s position reach directly parallel to where I was standing. Again, same distance, same glow, same shape, same everything.All was as before. Suddenly, I recalled a tv show I’d seen years before about how it’s thought by some that if aliens exist they were said to communicate by way of mental telepathy. Then I had a thought pop into my mind that I could try that, “that” being my focusing my attention on trying to connect with any intelligent form of life or AI that might be aboard. Sounds crazy, I know. BUT, the instant that notion came to me & I did focus as I described, that thing did a 90 degree turn in our direction. But it didn’t do like a plane would’ve with a slow bank to the west toward us... no, I mean it turned instantly like |___ a full 90 degrees with no loss of speed (& remember, it wasn’t moving quickly at the time we first saw it in the distance)  and headed directly for us. I don’t let myself get rattled easily and my wife, who was a total skeptic, suddenly had nothing to say... it scared her so much. Truthfully, I wasn’t saying much either because though it was far away when we spotted it and moving, well, as I said, it seemed slow to us. As soon as I felt the weird connection that I was trying to make. It was now just across the road in front of our house. It only took two seconds before it was, like, literally moving toward us and was, I thought, going to pass right over us and our house. But it didn’t. Just as it got to the far edge of the road in front where we were, it turned again & flew due south. And just like the first time I saw it change direction and head for us, it did the exact same maneuver turning on a dime exactly as it turned toward us the first time & I was just awestruck. My wife was speechless & she isn’t often speechless. The thing made virtually no sound... if anything it was a soft swish. So I stuck my head forward as far as I could w/o putting a hole in the screen trying to get a good look. What I saw I can’t adequately say but it looked like large rectangular fins were opening and closing. I thought it might’ve been birds... but I don’t think it was. I don’t know what it was. But it did beeline it straight for us then grew in size & turned just before it reached our house. The most disturbing thing about the whole incident (to me at least), was I felt like something on the craft (?) knew I was trying send a bit of a signal to it that caused it to come to me as if I’d wanted it to do so. When it got closer it got much bigger. It’s something I’ll never forget nor will I ever truly know what it was. And that’s the truth. ",
        "good": "11",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "rayj785",
        "time": "1 May, 2021",
        "context": "They're not gonna land here because that stupid extended warranty lady keeps calling them.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jbowen634",
        "time": "1 May, 2021",
        "context": "Fear  is a  great \" tool \"  you can get people to do anything , justify anything  , spend any amount of $$$$ when people are fearful  . In the 80's it was \" The Day after \"  nuclear holocaust  so we needed \" star wars \" 100's of billions  spent   ?  911  so we need to  spend trillions  fighting  people in caves for 20 years ?   And  take  away Our Constitutional rights with the Patriot Act ?      Covid 19  take away  people's  human ,   democratic  rights  while  the elites made billions shorting  the economy    . Always  a small elite  behind  all  these Fear Scams    that  make trillions  ( Rand Report (  for  themselves at the expense of the people  .",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "AheadWarpFactorOne",
        "time": "1 May, 2021",
        "context": "This dramatic report will fade away without ever seeing the light of day. . . Way too disturbing to the average human mind. It would make religion understandable, possibly even interesting if it actually were revealed. . .",
        "good": "1",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "Proverbs3:5🙂",
        "time": "1 May, 2021",
        "context": "The only answer that really fits is that they are spirits described in Ezekiel in the Bible, because if there was alien life with our technology we would have pictures of it by now but a spirit you'll probably never get a picture of because it's in the heavenly realm.",
        "good": "4",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "philly805",
        "time": "1 May, 2021",
        "context": "The Mars Rover hasn't seen a UFO yet.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "GoldBone",
        "time": "1 May, 2021",
        "context": "I think they landed at the white house on January 2021 . and are confused as how to do mind control on the mindless.",
        "good": "9",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "philly805",
        "time": "1 May, 2021",
        "context": "I hope there is a press conference with the UFOs before I die.",
        "good": "7",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "fbfullen",
        "time": "1 May, 2021",
        "context": "Oh, I suppose I can wait until the June 25th deadline given by congress to the intel community for an unclassified UAP report. Hopefully an unredacted version will be made public. If that happens I suppose I'll try to figure out if I think the report contains information, misinformation or disinformation. Until then I'll do my best to ignore speculation on what it might contain.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "FuzzyDunlop",
        "time": "1 May, 2021",
        "context": "The Ariel School UFO Encounter Ruwa, Zimbabwe. Google it",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "willthisbeonthetest?858",
        "time": "1 May, 2021",
        "context": "The only logical assumption that can be made is that this a a controlled system. \nIs it from another world or is it inherit to this world? And It remains to be seen whether\nit is demonic in nature, although it's actions suggests this.",
        "good": "2",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "OrangeBottle",
        "time": "1 May, 2021",
        "context": "God I hope there are real UFOs. Plan would be let them beam president joey up. Once they study him they will give up on intelligent life forms on earth and will go away.",
        "good": "9",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "philly805",
        "time": "1 May, 2021",
        "context": "You'd think a UFO would plant a flag to show it beat out another planet's UFO.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "philly805",
        "time": "1 May, 2021",
        "context": "UFOs were responsible for contaminating Earth with the liberal virus in 1906.",
        "good": "9",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "JD'Huntsville'AL",
        "time": "1 May, 2021",
        "context": "I believe there will be \"evidence\" of UFOs released during Biden's reign. WHY? Because the Democrats need SOMETHING to keep we the people in fear so we'll allow the Feds to take away even more of our rights while they \"protect us from the aliens.\" It's the communist way.",
        "good": "24",
        "bad": "2",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "JoeSmutka",
        "time": "1 May, 2021",
        "context": "In December 2019 the Air Force creates Space Force Delta,  and a year later release top secret videos of UFOs that have been verified and baffle the experts?  Existential threats from other worlds?  Thank God for SFD!\n\nIke warned of a growing “military industrial complex”.  In those days they created the “missile gap” to urge the American people and Congress into spending trillions on military hardware to be used in war against Russia.  Now it’s the existential threat of flying saucers. ",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "clandock",
        "time": "1 May, 2021",
        "context": "2 things, same point though.\n\nIf aliens came from another star system, their technology would be so far beyond ours it wouldn't matter.  A single ship could conquer the planet, not that they'd even care to.\n\nSecond.  If foreign countries had this big of an edge, why haven't they ever done anything with it?  Why do they keep pretending to be weak if they actually have such advanced weapons?  \n\nNeither of those explanations makes sense.",
        "good": "102",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "patriot25425",
        "time": "1 May, 2021",
        "context": "If I hadn't seen one for myself I wouldn't really believe it. They're out there and I'll never forget it.",
        "good": "26",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "DirtySanchez122",
        "time": "1 May, 2021",
        "context": "If extraterrestrials ever landed on Earth, Tucker Carlson will be complaining that is was a result of Joe Biden's weak immigration policies.",
        "good": "5",
        "bad": "12",
        "replies": []
    },
    {
        "user_name": "ashketchum",
        "time": "1 May, 2021",
        "context": "Lol. Aliens, Tucker? \nI'm just waiting for Fox's Man-Karen/Fish Stick Prince: Tucker Carlson to tell us he found BatBoy in a cave working for Hillary Clinton and using a pizza restaurant as a front. XD",
        "good": "2",
        "bad": "11",
        "replies": []
    },
    {
        "user_name": "ah-gil",
        "time": "1 May, 2021",
        "context": "True story.....I lived in northern michigan for a few years and walked my cat every night down the same logging trail....she was old didn't like the exercise or the leash....but it was important to keep her healthy.....long story short....you want to see some out of this world stuff....go to northern michigan at night...all kinds of alien looking folks running around.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "█▒█▒█╔╦╗g╦ô╚╩╝▒█▒█▒█WorldsMEANESTman",
        "time": "1 May, 2021",
        "context": "If even a small percentage of UFO/alien sightings were real and the government knows they are or has extraterrestrial tech I would love it if they disclosed all they have. But I think this highly anticipated report is going to be a total let down to all the believers.",
        "good": "8",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "█▒█▒█╔╦╗g╦ô╚╩╝▒█▒█▒█WorldsMEANESTman",
        "time": "1 May, 2021",
        "context": "Its all good Mulder and Scully are on the case.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "backinblack",
        "time": "1 May, 2021",
        "context": "Explain Stealth technoalgy.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "backinblack",
        "time": "1 May, 2021",
        "context": "Planet earth..........................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................Infinity.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Ubart",
        "time": "1 May, 2021",
        "context": "All of you are wrong.  UFOs are not aliens.  We are sumulated and the UFOs are system artifacs.",
        "good": "3",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "spirit77",
        "time": "1 May, 2021",
        "context": "As I have said the UFO's the F/A 18's encountered were AI drones learning to hunt and evade jet fighters. The ball stalk coming out the saucer is to similar to in the field military drones ball stock as well as those found on scout helos. The propulsion system is magnetic based.  Look up MIT years ago floating small animals inside Earth's gravity weightless using high speed magnetic loop. Then reverse that to float a small ship. Thing is due to speed it requires AI pilot. Radio control would be ok for giving orders but not piloting.\n\nThe inverse pyramid ones look to be again AI designed to scout slower targets and be suicide bombs when needed. \n\nFYI FOX the guys saying they can't be drones best pull their collective heads out their rears and come up with better explanation.  The craft while large are clearly not build to hold any living being we know of. I doubt even the much daunted Greys of UFO mythology could sit in one those things comfortably which indicates military craft or scouts.",
        "good": "1",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "philly805",
        "time": "1 May, 2021",
        "context": "Biden wants Kerry to study the UFO carbon footprint.",
        "good": "16",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "JohnGreen11",
        "time": "1 May, 2021",
        "context": "Tucker I regularly watch your show but on this topic you are NUTS.",
        "good": "1",
        "bad": "17",
        "replies": []
    },
    {
        "user_name": "Kwisatz_Haderach",
        "time": "1 May, 2021",
        "context": "They are starships from Jesus’ home planet. They have come to spring him from his holding cell in Area 51.",
        "good": "4",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "jam83gw",
        "time": "1 May, 2021",
        "context": "it must be assassin \nPutin president for life \nspying on the democrats ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Kwisatz_Haderach",
        "time": "1 May, 2021",
        "context": "Clearly, none of you have watched x files. COVID was just a cover to distribute the real vaccine for the alien virus.",
        "good": "7",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Mika998",
        "time": "1 May, 2021",
        "context": "Tucker knows he has fooled everyone. Only a few people know he is an alien from his scary laugh but nobody believes them.",
        "good": "2",
        "bad": "10",
        "replies": []
    },
    {
        "user_name": "usher73",
        "time": "1 May, 2021",
        "context": "Where are all the good quality cell phone photos and videos ? Did bigfoot eat them ?",
        "good": "7",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "dogslivesmatteralotmore",
        "time": "1 May, 2021",
        "context": "Feel for for the poor sap that has to not only explain all this, but has to make dimentia joe understand it..  Whatever they are paying, it isn't enough for that task.",
        "good": "5",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "buffuzo",
        "time": "1 May, 2021",
        "context": "Putin has the tech.  It’s old theories from captured Nazi scientists put to use.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "pranqster",
        "time": "1 May, 2021",
        "context": "Maybe they are here to save us from Biden and the authoritarians.",
        "good": "12",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "chotsky",
        "time": "1 May, 2021",
        "context": "drip drip drip .. they're getting us prepared ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "OliveBulb",
        "time": "1 May, 2021",
        "context": "Never thought I'd see the words \"Tucker Carlson\" and \"Intelligence\" in the same article.",
        "good": "5",
        "bad": "21",
        "replies": []
    },
    {
        "user_name": "JoeSmutka",
        "time": "1 May, 2021",
        "context": "We’re being played - again\n\nIn December 2019 the Air Force creates Space Force Delta, and a year later release top secret videos of UFOs that have been verified and baffle the experts? Existential threats from other worlds? Thank God for SFD! Ike warned of a growing “military industrial complex”. In those days they created the “missile gap” to urge the American people and Congress into spending trillions on military hardware to be used in war against Russia. Now it’s the existential threat of flying saucers. ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "RedBulb",
        "time": "1 May, 2021",
        "context": "UFO’s have amazing WiFi.  Uh-oh...gotta go.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "HawnschottFurzt",
        "time": "1 May, 2021",
        "context": "When Apple finally invents the I-Perdrive, we can go elsewhere and be their UFOs.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "demsareholdingmeprisoner",
        "time": "1 May, 2021",
        "context": "It's not an intelligence failure. It's more like they are hiding it from the public.",
        "good": "15",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tad123280",
        "time": "1 May, 2021",
        "context": "More sightings evident since destructive globalist try to control the global population using every and any means possible. The \"reckoning \" could well be the elimination of the powers that be by a higher intelligence against the increasingly totalitarian Evil.",
        "good": "3",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "Doubleguru679",
        "time": "1 May, 2021",
        "context": "they are all experimental craft they are not from space its a smoke screen to cover up that fact, thats why even today with high def digital cameras we are still getting fuzzy blurry pictures, and the military has 100 times better cameras than we do but still no aha pictures from them !",
        "good": "4",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "rogerusa018",
        "time": "1 May, 2021",
        "context": "This so-called \"report\" will be nothing more than a request for many billions of $$$$ funding to \"investigate strange sightings\".  End of story.",
        "good": "3",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "chinaownsjoe",
        "time": "1 May, 2021",
        "context": "They are trying to invade bidens brain to install intelligence before he causes universal doom",
        "good": "15",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "anakalamaui",
        "time": "1 May, 2021",
        "context": "Usual Fantasy Overdo",
        "good": "2",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "Mike613",
        "time": "1 May, 2021",
        "context": "Can’t come soon enough. I love my family but if this the end, make it quick. Hope its slower for politicians ",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "error": "error"
    },
    {
        "user_name": "DirtySanchez122",
        "time": "1 May, 2021",
        "context": "Let's be honest, FOX \"entertainer\" Tucker Carlson isn't very entertaining. \nBut just when we thought his entire act just an endless litany of imagined Republican grievances, he springs UFO's on us.",
        "good": "3",
        "bad": "12",
        "replies": []
    },
    {
        "user_name": "elmerfudd2",
        "time": "1 May, 2021",
        "context": "i agree with his statement but what about all the british sightings of ufos.  where have they been on uncovering ufos in their country?",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mahgo",
        "time": "1 May, 2021",
        "context": "I never believed in extraterrestrials either until seeing Chicago’s Mayor. Now I’m convinced.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "GoldHammer",
        "time": "1 May, 2021",
        "context": "Tucker. Hahaha ... too funny. You try it without laughing.",
        "good": "5",
        "bad": "13",
        "replies": []
    },
    {
        "user_name": "howdydam1t",
        "time": "1 May, 2021",
        "context": "I have to admit it seems odd that the US only comprises a small portion of our planet and somehow the UFO's only seem to show themselves to us instead of all the other countries around the globe.",
        "good": "1",
        "bad": "9",
        "replies": []
    },
    {
        "user_name": "pkt326",
        "time": "1 May, 2021",
        "context": "David Copperfield flies.  You know he's using wires and pullies but you can't see them so the illusion is very, very real.  And just when you think you know how it's done he passes through several rings that logically wouldn't be possible if there were wires in the way.  You know what you're seeing isn't real but you can't really explain it.  I think UFOs may be something much simpler than we suspect and we're fooled because we can't see the trickery or the natural phenomenon behind them.  Personally, I hope they are ETs as that would mean interstellar travel is possible but as much as I would like to believe it I doubt it.  No one has repealed the laws of physics and if some advanced civilization has done so why do they waste time giving light shows in the sky?",
        "good": "14",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "linus0108",
        "time": "1 May, 2021",
        "context": "Any off planet aliens that may be making a flyover are just interested in watching the current comedy show going on.",
        "good": "12",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "PeBe",
        "time": "1 May, 2021",
        "context": "While growing up, people in my region always saw spectacular things in the night sky.  \n\nMany people figured it was advanced craft flying out of Groom Lake in Nevada because they always came and went from and to that direction.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "OliveBike",
        "time": "1 May, 2021",
        "context": "And exactly what counter-measures would any military initiate against crafts that can make 90 degree turns at 5000 MPH and then disappear completely?",
        "good": "26",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "vettejack",
        "time": "1 May, 2021",
        "context": "I just wish these aliens would get it over with and take out this cesspool of a planet. Either that, or God has one hellava sense of humor if he made us the smartest thing in the universe.",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "dirk_gason",
        "time": "1 May, 2021",
        "context": "If they were truly adversarial and have been for decades don’t you think we would know that by now?  And if they are so advanced that we can barely even detect with today’s technology I think it’s even more silly to think they would drop a “nuke” on DC. They likely have far more advanced ways to take over without having to destroy the planet. They could easily genetically engineer a virus that would only target humans and that would be the end of it. The more I read about UFO’s in the MSM the more it starts to look like a tool that can be used by power brokers to scare Americans into giving up more of their freedoms. We should all proceed with healthy skepticism.",
        "good": "8",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "david493",
        "time": "1 May, 2021",
        "context": "That’s not a UFO. That’s China’s drone telling Biden to bend over. It’s time for his probe. He has “made in China “ tattooed on his .......",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "aliengray👽",
        "time": "1 May, 2021",
        "context": "Your weapons are useless against them. They don't want to talk to a leader. They can put everyone on a plantation and make you work like 1860 slave times. Everyone.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "CrazyBetty",
        "time": "1 May, 2021",
        "context": "OMG - you knew we'd eventually get to UFOs with Tucker...",
        "good": "5",
        "bad": "13",
        "replies": []
    },
    {
        "user_name": "hakunamatada20",
        "time": "1 May, 2021",
        "context": "It's bad enough that we have an incompetent gestapo FBI and intelligence community, but to hear about this now, I'm now beginning to wonder about our top military brass at the Pentagon.....Are they incompetent or simply all hybrid human/lizard aliens just waiting for the right time to take over?",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "weaponseducation",
        "time": "1 May, 2021",
        "context": "I've seen it in 1982. (UFO)  Tampa, FL off the Gulf in my boat with two witnesses. (one is still alive)  The key is the speed.  The  space ship/bright light came close to our boat at 3 AM.  It was screaming fast from what looked like a star then right above us.  It sat for 90 seconds or so, then blasted right back to being a star.  We all stared at it then it shot across our galaxy in a split second, stopped.  Then shot back to where it was. It then shot across the galaxy , stopped, then shot all the way to the right and left, etc.  All in all it lasted 45 plus minutes.  Then shot back above the boat  Tampa, FL (about a mile up)  Then shot away in a straight line into the galaxy.  Gone.  It really happened.  That was in 1982, so I think they are not harmful.  I promise to this story in both of my parents name.  It is real.  I thought about it my whole life.  The bottom line is there are billions of earths out there. They are not harmful.",
        "good": "12",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "pintoflounder522",
        "time": "1 May, 2021",
        "context": "I also think anti-gravity technology is being developed.    \nWe're seeing the military develop maneuvers to apply this breakthrough of conquering gravity.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "benjiiee",
        "time": "1 May, 2021",
        "context": "More like it's technology developed by the military, recognized as UFOs, and kept a secret. Why allow the world to know what technology has been created? Stay steps ahead by not touting the latest developments. Adversaries are up to par as soon as capabilities are know. Technology can be developed \"ahead of time\" simply to combat rising threats as needed, keeping others in the dark.",
        "good": "4",
        "bad": "7",
        "replies": []
    },
    {
        "user_name": "Rush2Reason",
        "time": "1 May, 2021",
        "context": "UFOs and Tucker have a lot in common. According to the judge in his latest trial, anything Tucker says should be taken with a large dose of skepticism. ",
        "good": "1",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "HomLee50731",
        "time": "1 May, 2021",
        "context": "Nancy is victim of body snatchers! And along with Chuck, Adam, Eric, and the other fat one (can't remember his name) try to run a country with the help of Joe B the brain dead idiot. Suddenly the release of strange sightings confirmed (or not) by official footage from the federal government? Someone is hiding something from the public. But why bother the media will just do that without question. So all the hub bub is not necessary, let the stellar news outlets do what they do everyday...nothing!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "gold",
        "time": "1 May, 2021",
        "context": "#1 reason Trump initiated The Space Force.",
        "good": "8",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "crackerlackin",
        "time": "1 May, 2021",
        "context": "Word must have really traveled that Joe's giving free housing, medical, education and more to any alien to show up at our borders.",
        "good": "15",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "libsrflawed",
        "time": "1 May, 2021",
        "context": "It’s obvious we have extra terrestrial life walking amongst us.\nCase in point, Mayor Lori Lightfoot",
        "good": "14",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "█▒█▒█╔╦╗g╦ô╚╩╝▒█▒█▒█WorldsMEANESTman",
        "time": "1 May, 2021",
        "context": "Stop the world I want to get off.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "iwokeup",
        "time": "1 May, 2021",
        "context": "The US government has not been ignoring ufo intelligence. They've been lying and denying about ufos for at least 75 years.",
        "good": "13",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "VonSchnoodle",
        "time": "1 May, 2021",
        "context": "Why does tucker always have to go to some kind of 'Failure'. If UFOs are comming and watching us what are we supposed to do? 'We saw a ufo, we chased it, we have no idea what it is but we don't think its from earth\" What part of this is an intelligence failure?",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "az2mwest",
        "time": "1 May, 2021",
        "context": "Let's clear this up.  Most likely these aerial flying objects are drones and other technologies developed by Skunkworks or other advanced defense corporations.  There are no aliens.  We may be the only life forms in this universe.  In the Bible it says \"Don't let the left hand know what the right hand is doing\".  This is a case of defense technologies being tested on our forces to see their reaction and abilities.",
        "good": "3",
        "bad": "6",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "Yippy-Ty-O-Ty-Ay",
        "time": "1 May, 2021",
        "context": "Tucker's audience doesn't believe that masks are helpful against covid but this they will get behind.",
        "good": "6",
        "bad": "13",
        "replies": []
    },
    {
        "user_name": "twocentsworth",
        "time": "1 May, 2021",
        "context": "UFO’s?  Hottest topic in the trailer park as everyone sits around and discusses what’s on Fox News and believes it’s also real.",
        "good": "1",
        "bad": "9",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "rickh879",
        "time": "1 May, 2021",
        "context": "\"THE INTERGALACTIC FEDERATION OF ALIENS\"\nBelieve it, it's coming soon...",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "290624",
        "time": "1 May, 2021",
        "context": "Jerry, \"You can't Yada Yada Yada aliens.\"\n\nElaine, \"I've Yada Yada Yadaed\" aliens.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Cas1",
        "time": "1 May, 2021",
        "context": "If it’s not popular, the bureaucrats keep it at arms length, they will lose status or power. In today’s mob driven world there are few rules  unless they have media backing. Yes Alice  welcome to wonderland ",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "FrankieBells",
        "time": "1 May, 2021",
        "context": "This \"story\" serves as yet another example of fine copy editing on tha innernit. Who's Pope? Who's Elizondo? LOLOL. Good job, Fox.",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "rbudd",
        "time": "1 May, 2021",
        "context": "More nothing will be forthcoming- why? Cause aliens haven’t been here",
        "good": "3",
        "bad": "8",
        "replies": []
    },
    {
        "user_name": "okie2021",
        "time": "1 May, 2021",
        "context": "The Goa'uld are here!",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jerrylb",
        "time": "1 May, 2021",
        "context": "Yeah, I don' think so.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "truth556",
        "time": "1 May, 2021",
        "context": "They could be experimental aircraft the US doesn't want to admit they are developing. They could be experimental aircraft the US doesn't want to admit the Chinese or Russians are developing. And they could be alien craft. Don't get your panties in a knot, Brit-guy! Haven't you ever watched the X-Files?",
        "good": "2",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "foxresponder",
        "time": "2 May, 2021",
        "context": "Nick Pope: relax big guy. You state, \"It seems like.....blah, blah, blah...\" STOP.  you will be attracting all the QANON folks from don trump.",
        "good": "2",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "anewman",
        "time": "2 May, 2021",
        "context": "The problem with UFOs is that the government has found no way to control them yet.  :-)",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "likydsplit",
        "time": "2 May, 2021",
        "context": "“catastrophic failure of intelligence”\n\nI think there is a lot of that going around in most governments :-)",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "culltheherdnow",
        "time": "2 May, 2021",
        "context": "let's hope the space aliens come here and have a taste for liberal meat suits. they can round all of them up and then go back home. it's a win win for humanity and space aliens. nanu nanu 👽",
        "good": "12",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rfloyd399",
        "time": "2 May, 2021",
        "context": "If an alien came and said \"Take me to your leader\" I would be so embarrassed",
        "good": "19",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "TerrawattsforUS",
        "time": "3 May, 2021",
        "context": "I find amusing that aliens could get here on a spaceship.  If they could get here it would be by some dimension or  law we have not yet discovered, like time travel to move around the universe.  I gotta believe a spaceship would be useless even if it could travel the speed of light.",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "abraham12",
        "time": "3 May, 2021",
        "context": "Well, if there are UFO's and aliens watching us on Earth, there is NO particular reason to believe they are binign.\nClearly, if these are aliens, WE KNOW VIRTUALLY NOTHING, except, their technology is better than ours.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "TheTinMan058",
        "time": "3 May, 2021",
        "context": "So why has there never been any kind of accident or mechanical failure ever of any of these UFOs that would result in recovery of hard evidence of their origins?  Sort of points to the unlikelihood of them being of earth origins.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "AmericanTruth684",
        "time": "2 May, 2021",
        "context": "Did someone put an ad in Space News that said you're all welcome and we'll pay for everything and let you vote, and give you money?",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "unilateral",
        "time": "3 May, 2021",
        "context": "Meh - what good would \"knowing\" have done?",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "kabekew",
        "time": "2 May, 2021",
        "context": "Leave the poor aliens alone. They're obviously not trying to interfere, just observe.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "emar321",
        "time": "3 May, 2021",
        "context": "Tucker show should be classed as science fiction phony. including Tucker, purveyor of fiction.",
        "good": "2",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "nomos",
        "time": "3 May, 2021",
        "context": "People, please give up your hope in extraterrestrial life, it is getting expensive.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "liberals=traitors",
        "time": "2 May, 2021",
        "context": "Democrat are alien invaders ",
        "good": "6",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "OrangeBasketball",
        "time": "3 May, 2021",
        "context": "Their just waiting for the collective BMI of the planet to reach 40....then the feast begins!",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "edandm",
        "time": "3 May, 2021",
        "context": "ex UK official.  are you kidding me? let the 'reckoning' be as imaginary as the problem.  if there are intelligent beings in the universe they would know that manned space exploration is the most moronic thing ever. way ahead of pyramid building and art movies.",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "scotus9113",
        "time": "3 May, 2021",
        "context": "Everytime I read one of these articles the twilight zone music plays in my head. ",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "jmann589",
        "time": "3 May, 2021",
        "context": "As Americans, why is it so hard for us to realize how irrelevant we truly are? Some cannot grasp the idea that we aren’t the only life in this universe because we’ve made everything about us. Humans for some reason think we are the greatest",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "willthisbeonthetest?858",
        "time": "2 May, 2021",
        "context": "Are Democrats going to concentrate on the UFO problem, or are they going \nto leave it up to the FBI?",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dno400",
        "time": "2 May, 2021",
        "context": "My mother says she saw UFOs.  But then again, she suffers from dementia",
        "good": "3",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "bensue",
        "time": "2 May, 2021",
        "context": "google- ben rich from lockheed- pretty darn interesting",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "gulag4u",
        "time": "2 May, 2021",
        "context": "UFO means unidentified flying object. To the average person, all flying aircraft is unidentified. I am sure that many of these so called UFO's are military prototypes being tested.\nBut....\nHere in the US, the US govt has been lying to the general public about the Roswell incident, and about all alien spacecraft and aliens.\nBut now, things are changing. The US govt is preparing the citizens for a confession. From now on, the US govt will admit that, yes, there are alien aircraft, and aliens exist.\nMany other countries already know this.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rock3delta",
        "time": "2 May, 2021",
        "context": "Of course the UK wants answers because they know we have stolen their technology and are tired of the American people covering for the US GOVERNMENT'S theft with the \"aliens \" lie.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "kenhum",
        "time": "2 May, 2021",
        "context": "Tucker needs to stay clear of the fiction, if he wishes to maintain credible.",
        "good": "3",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "foxresponder",
        "time": "2 May, 2021",
        "context": "Before people get too worked up, before they call Scully and Mulder from X-files, please remember: millions of amateur astronomers spot anything and everything that moves, every night, and if significant, report to NASA. So, relax. If IT'S OUT THERE, it will be reported.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "rcamerica629",
        "time": "1 May, 2021",
        "context": "What idiot thinks a bureaucrat can keep a secret, especially here in America, eh? Always somebody with more ego than brains, or a lifestyle they want to support, will blab, sooner rather than later, eh?",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "arrabis",
        "time": "2 May, 2021",
        "context": "Sounds like some people in the UK are jealous that ET didn't fly over their country.",
        "good": "4",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "blairv",
        "time": "1 May, 2021",
        "context": "we don't converse with insects, we just observe them...these civilizations  could be millions of yrs more advanced than our own, we're probably no more than a field project...like waring ant colonies.",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "truthbknwn",
        "time": "2 May, 2021",
        "context": "Its about time our governments stop covering up UFOs and trying to make people look crazy if they speak about their experiences with them.  Good for you Tucker for having the courage to stand up and speak about it!",
        "good": "13",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "101stParatrooper",
        "time": "1 May, 2021",
        "context": "Angels are extraterrestrials. They are not from here.  You didn't really believe they had wings, did you?",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Free-Thinker829",
        "time": "2 May, 2021",
        "context": "What if they left a book, To Serve Man?",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "victoria1951",
        "time": "2 May, 2021",
        "context": "Well if the aliens are surveying the herd to determine if it is time for harvesting, once they realize how large the percentage of the herd is infected with pathogens aka STD's, they will lose their appetite.",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "whyfor",
        "time": "1 May, 2021",
        "context": "The \"U\" stands for \"unidentified.\"  Who cares?  For now they are just apparitions.  I'll wait for them to become \"identified.\"",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Greyalienshatedoritos",
        "time": "1 May, 2021",
        "context": "ANYTHING to change the narrative FROM the pandemic....is good news 2 me.....EVEN ALIENS ",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "morehumanthanhuman",
        "time": "2 May, 2021",
        "context": "So much humor here.  Feels like covering up fear with jokes.  I understand the feeling.  The theory of general relativity teaches us that we can break the speed limit of light by warping space time.  We've already done this in the lab at the Large Hadron Collider, for a split second.  No doubt other civilizations in the galaxy, more advanced than us, have already conquered this technology.  We thought we would find them first.  Instead, they found us.  Humor won't make them go away.  I've had to deal with my fears about this.  I used jokes at first, too.  Now I wonder what technology we could have had if our governments had treated this seriously, instead of cowering in the corner.  I fear we are left now as second class citizens on our own world.",
        "good": "17",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Free-Thinker829",
        "time": "2 May, 2021",
        "context": "The 1952 movie The Day the Earth Stood Still is very apropos.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rtrim",
        "time": "2 May, 2021",
        "context": "Assuming these are from another planet.  We can assume they are more advanced than us because they have managed to traverse greater distances than we can even think about doing.  Their crafts seem to defy the laws of physics as we know them.  That being said, there's an even chance they will decide to leave on their own once they realize we're not worth the effort right now.  Political unrest, racial unrest, wars, and a COVID ravaged earth should be enough to make them reconsider.",
        "good": "9",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "madmagus",
        "time": "1 May, 2021",
        "context": "If the government thought they were terrestrial foreign adversaries using UFOs, they would have responded much differently than they have.  It's only because they are more afraid that they are indeed extraterrestrial in nature that they have tried to hide the truth of them.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "guyfawkes1105",
        "time": "1 May, 2021",
        "context": "The laws of physics and chemistry are the same here as they are elsewhere in the universe.  DNA is a stable molecule.  It is made of common components.  Only discrete combinations work--meaning it does not occur by chance.  It is controlled by both physics and thermodynamics.  The life cycle that occurred on Earth has occurred on other planets with similar conditions.  Dinosaurs still roam somewhere out there.  \nBut intelligence requires a certain brain with a certain metabolism.  Sharks nor lizards have not really evolved in several hundred million years.  The \"alien\" is going to be another variation of dark human mammal.  Melanin protects DNA from radiation affording the chance to survive on more planets.  \nHumans are the only truly vertically upright creatures on this planet that has a gravity field of 9.8m/s2.  This planet does not favor completely upright creatures at all.  It makes me wonder that the reason man first looked into the heavens, because some instinct told him that he came from there.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "NeeCee55",
        "time": "2 May, 2021",
        "context": "In AZ there are tons of sightings.  I love UFOs.  ",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "whyfor",
        "time": "1 May, 2021",
        "context": "I looked up in the sky once and saw millions of bright, dazzling orbs.  Knew it was all over.  But then this gigantic white orb rose in the sky and all the smaller ones didn't come closer.  I think they were scared.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jjh016",
        "time": "2 May, 2021",
        "context": "These UFOs have been invading us for 70 + years and yet there has never been any physical evidence left behind for us to examine?   Really?",
        "good": "5",
        "bad": "7",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "brerhare",
        "time": "2 May, 2021",
        "context": "The extraterrestrials are here too keep mankind from polluting the Galaxy with nuclear poison.",
        "good": "5",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "azog1321",
        "time": "2 May, 2021",
        "context": "Many people who knew what was going on were hit with an intense bright light from an oversized ball point pen and then congratulated for 20 years service at the post office. They may not actually remember what they saw.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "xcv4",
        "time": "1 May, 2021",
        "context": "What do religious folks think about this ? I thought the earth was the chosen planet ?",
        "good": "3",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "ALLINMAGA",
        "time": "1 May, 2021",
        "context": "aliens are / have been here for a long time - better known as democrats",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Gregooo",
        "time": "1 May, 2021",
        "context": "Hey T Man... pretty light news day when you have to fill your programming with UFO stories. Shouldn't this type of content be left for info Wars or pillow manufactures?\n\nHow many millions is your salary?",
        "good": "2",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "bigthunder",
        "time": "2 May, 2021",
        "context": "BKG\nJonJon I read your comment and I can back what you said about absolutely no noise. One night it was me my brother and our mother and her boyfriend we decided to go to a Amish buffet in Lancaster Pa. we finished our dinner and was heading back home. We where traveling down a back country road. It was pitch dark it was night time. We approached a intersection that had a stop sign but before we got there about a mile or so all of a sudden there was a bright intense white light above us. We trued to look out the car windows to figure out what it was but couldn’t because of the brightness of the light. It just followed us , we stopped a couple of times when we stopped it stop right above us. We finally got to the intersection and we stop and it stop right above us again. The intersection and the fields around us was lit up like it was daylight. We got out of the car and look up into the light but couldn’t see any shape at all or hear any noise at all completely silent. We stood there staring at this what ever it was for about five minutes all off a sudden the light went out and there was nothing there and completely silent. This thing completely vanished nothing there and the nite was clear. No plane no helicopter no nothing it truly was a UFO.",
        "good": "8",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "fold",
        "time": "1 May, 2021",
        "context": "if a civilization has developed the ability to travel between the stars, there is no level of intelligence on earth that can deal with that.  millions of years ahead of us.  bring a car, electricity and a radio back to the stone age for a simple example....and thats a miniscule amount of time.  my guess is that many of them are unmanned and have specific purposes.  any life forms that are here have probably been genetically altered for space travel and may not resemble the beings in charge.",
        "good": "14",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "inoit",
        "time": "1 May, 2021",
        "context": "The most believable evidence of \"logical thinking or believing, \" is history.\nHistory tells me, I see nothing much to believe, except; people with different belief's or of a different color, will always be suspicious of each other.\nNeed proof?\nRead about wars between old countries in BC times.\nThousands of millions were massacred, because of their \"different,\" beliefs.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "marvinshort1953",
        "time": "1 May, 2021",
        "context": "Well, I reckon.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "opaoma036",
        "time": "1 May, 2021",
        "context": "They are here, they are real and they don’t like liberals.  I hope they destroy the grid and show us the way back to peace throughout the world.  ",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "havamal",
        "time": "1 May, 2021",
        "context": "You have to explain to the brits that they're referring to multiple US agencies that thought that Saddam Hussein was an immediate threat while completely ignoring Al Qaeda after the 1993 WTC bombing.",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "jmmul123",
        "time": "1 May, 2021",
        "context": "To think that we, humans, represent the only \"life\" in the vast cosmos is pretty narcissistic and self absorbed. \n\nBut to believe anything other, is to question our Biblical concept of God and Jesus and all the rest...Can't have that.",
        "good": "5",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "keith99",
        "time": "1 May, 2021",
        "context": "Fun posts today on this site... Can't do this type of give & take on CNN or MSNDC with Rachel...",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "JG93",
        "time": "1 May, 2021",
        "context": "Where’s Luke Skywalker when you need him.  ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Sparky1778",
        "time": "1 May, 2021",
        "context": "Think about where our civilization and technology was a thousand year ago, then think where another civilization would be if they were a 1,000, 10,000, or 100,000 years ahead of us. It’s not hard to image that they have unlocked principles of physics and technology that we are struggling to comprehend.  Is it that hard to believe it isn’t possible.  There are too many sightings is dispel it.  Read J. Allen Hynek’s books.",
        "good": "8",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "militarydisabled",
        "time": "1 May, 2021",
        "context": "Elements within our government, have overwhelming evidence of these advanced aerospace vehicles.  Astrophysicist Eric Davis has said these advanced vehicles, that we have, are not from or made on earth. They are made of materials we cannot identify. Eight year's before Bob Lazar came out, a flight test engineer, I was working with, told me, the same, that we had in our possession craft, not from this earth. Reason for coverup, is two fold. A race among several countries, too breakthrough the advanced technology and the actual contact, with alien  life forms. Second more ominous reason, is some of the extreme measures taken, too keep all this information secret, at any cost. Fear of prosecution, is a highly motivational factor. Hiding behind walls of special access programs, classifications hoping none of this, will ever see, the light of day.",
        "good": "7",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "theantifederalist",
        "time": "1 May, 2021",
        "context": "Why? What does it matter whether you know of them or not? Are you planning to put the welcome mat out?\n\nAny life form that's visiting our solar system has, in all likelihood, technology which vastly exceeds our own, so you'd better hope they're friendly.\n\nBut be of good cheer. If a species living near the center of our galaxy decided to toodle on out and see what was doing in our neck of the woods, and left about 5,000 B.C., traveling at the speed of light (720 million miles per hour), they won't get here for another 23,000 years.\n\nSo don't leave the light on for them.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "planetary",
        "time": "1 May, 2021",
        "context": "I'm tired of these clowns obsessing over grainy footage of visual artefacts, exhaust flames and birds, insisting that IT MUST BE ALIENS!! when there is a real project to find intelligent life -- SETI -- and it is pathetically underfunded.\n\nOut there in our galaxy is where we'll find evident of intelligent civilizations. We finally got dedicated radio telescopes on the search (the Allen Array) but we could be doing so much more, looking for more advanced methods of communication, looking for evidence of megastructures like Dyson spheres, searching for the energy signatures that would mark Type I and II civilizations.\n\nThere is absolutely no reason for an interstellar civilization to take an interest in us and travel here, and even if we were interesting to them, unless there's an intelligent alien civilization right on our doorstep, there hasn't even been enough time for a potentially curious civilization to intercept our decaying signals and make the journey here.\n\nYou would think UFO enthusiasts would understand that, but most of them don't seem to have any concept of how massive and old our galaxy is. So instead of donating to SETI and/or turning their efforts toward assisting serious searches, they obsess over visual artefacts in low-resolution footage.",
        "good": "2",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "svengolly",
        "time": "1 May, 2021",
        "context": "Somehow, I think the first encounter with aliens will be more like \"Mars Attacks\" and less like \"Close encounters of the 3rd kind\".",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "JamesBomb",
        "time": "1 May, 2021",
        "context": "This just in..\nFauci is now recommending..\nIf you're abducted by aliens you should wear 5 masks.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "2ndnlong",
        "time": "1 May, 2021",
        "context": "What reckoning?  Those tawatts in Washington can't stop Colombians walking hundreds of miles to get into the country, how are they going to deal with being who travelled light years (assuming the UFOs are from other planets)?  All they are going to do is try to register them as Dem voters.",
        "good": "12",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "spaceguy",
        "time": "1 May, 2021",
        "context": "Maybe Biden will invite them down for a beer summit.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "CyanTurtle",
        "time": "1 May, 2021",
        "context": "If any bureaucrat has 'covered up' anything they should go to jail. If they knew it was wrong and covered it up - jail.\nIf Lockheed had materials, but would not disclose that... They should be chopped up and sold off piecemeal. This coverup tendency of handling ufo related things was wrong from the start.  Government project managers of special access projects have become a global embarrassment. Intentionally hiding facts from the people that pay for these projects is taxation without representation. You know how well that turned out the last time bureaucrats tried to get by with it...",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "HawnschottFurzt",
        "time": "1 May, 2021",
        "context": "Generations of TV and movie science fiction have added phrases like warp drive and hyperdrive to our lexicon and  that makes them seem inevitable. I, too, would like to think there'll be a Starship Enterprise or Millennium Falcon in our futures. \nBut theoretical physics says \"no\" to faster-then-light travel and sub-light travel won't get us to the stars or aliens to us.",
        "good": "0",
        "bad": "7",
        "replies": []
    },
    {
        "user_name": "Morlock1",
        "time": "1 May, 2021",
        "context": "No physical evidence here ever of alien presence, but alien life probably does exist.",
        "good": "1",
        "bad": "3",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "lacosanostraofdc",
        "time": "1 May, 2021",
        "context": "It is fascinating that when the UFO reality started to be revealed almost all comments were disbelief.  Looking at the comments today, things are changing.   The slow drip of stories (always released on Friday or Saturday) is working to SLOWLY reveal the truth. Wouldn’t want the sheeple herd to panic.",
        "good": "7",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "AheadWarpFactorOne",
        "time": "1 May, 2021",
        "context": "Ever think that grass hoppers are way more intelligent than humans, but just can't tell us?",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "beer4horses",
        "time": "1 May, 2021",
        "context": "The way I see it is you need to consider the purpose and alternatives surrounding the Pentagon and Navy's communications.  If this were OUR technology, the most likely response would be either confirmation or silence.  Saying we (i.e., United States) don't know, would not only be a lie if this were true, but most importantly, it wouldn't achieve anything.  If we KNOW it's another country's or even have a REMOTE concern that it's another country's technology, we would remain silent and continue to secretly evaluate. We certainly wouldn't ADMIT we don't know. That would embolden our adversaries and give them a reason to challenge us.  I believe we truly have ruled out the latter alternative. What we've seen isn't just considerably beyond any current capabilities, we can't even imagine what it is. Our military and scientific institutions would certainly know if there was even a remote chance it's from, say, China or Russia.  No, there is much more to this communication than just a simple admission of ignorance.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "eagleman",
        "time": "1 May, 2021",
        "context": "the covid scare is over... release the aliens, domestic and intergalactic!!!! fear fear fear.  ",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "okie2021",
        "time": "1 May, 2021",
        "context": "The Borg and Goa'uld are here!",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "evilgnome",
        "time": "1 May, 2021",
        "context": "If extraterrestrials chose to communicate with us, they would tell us that we have met the enemy and it is us, ourselves.  Nothing they could do could be worse than the path humanity is going down now.",
        "good": "20",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "jjjjjones",
        "time": "1 May, 2021",
        "context": "In the beginning of mankind, we were a savage race. Over time our weapons went from sticks and stones to chemical, biological, and nuclear weapons. Our technology went through the roof while we humans haven't changed one bit in all that time. Our level of intelligence has increased ten-fold, but we're still a frightened, brutal race full of ignorance and violence. We still can't get along with some family members, or members of our community. Even state to state we have vast differences of opinions. It's people vs. the government, republicans vs. democrats, women against men, Christians vs. Jews, or Muslims, or atheists. Country vs. country.\n\nIf aliens of a vastly superior intelligence and power were to make themselves fully known to us, our millennia of insane human abuses is clear evidence that we would aggravate them enough for them to (justly) use their power against us. \n\nI honestly think it's time to be afraid. VERY afraid of alien contact.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "JamesBomb",
        "time": "1 May, 2021",
        "context": "Damn...\nPutin again?",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "jtbest01",
        "time": "1 May, 2021",
        "context": "So nothing on satellite or the space station or Hubble telescope etc picked any of this up while they were in space? Whatever this is originated right here on earth.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "tradeyoutrudeaufortrump",
        "time": "1 May, 2021",
        "context": "The June report will likely be watered down as North Americans for the most part are soft and panic easily. Just mention a word like “virus” and they will riot for the last roll of toilet paper.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "philly805",
        "time": "1 May, 2021",
        "context": "It would be interesting to find out if religious people think sightings are UFOs, or more atheists do.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "beer4horses",
        "time": "1 May, 2021",
        "context": "We're not being leapfrogged. There would be other evidence beyond decades of sightings. What is happening though is that we're being visited and the U.S. is trying hard to ease us into this idea gradually.  Lot's of hard headed people out there with no imagination or open-mindedness.  Their heads will explode when they find out the world isn't quite as concrete and grounded as they thought it was.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "lacosanostraofdc",
        "time": "1 May, 2021",
        "context": "Concealment of the most important discovery in human history for 50 years or more is not consistent with a free society where the government supposedly works for the people.  How many lives did the government ruin for people reporting or seeking the truth?  I have seen documentaries about first hand confessions of  government officials who were assigned the task of destroying UFO whistleblower’s lives. The government will say they did it for our own good, as usual.",
        "good": "15",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "JamesBomb",
        "time": "1 May, 2021",
        "context": "I told you guys that head of the CDC chick is actually a Klingon.",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "tradeyoutrudeaufortrump",
        "time": "1 May, 2021",
        "context": "Bout 10 days ago Uranus was close to the moon. Go figure.",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "Averagejoeinsc",
        "time": "1 May, 2021",
        "context": "The government has been leaking these sightings out in dribs and drabs as baby steps to inform the public that we are not alone.  We are being probed and perhaps the governments of nations have made contact with ET.  Prepare to have  your world rocked by the news very shortly.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "matt360",
        "time": "1 May, 2021",
        "context": "The telling us this stuff now so they can explain away the rapture.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "charlesconklin",
        "time": "1 May, 2021",
        "context": "Why even worry about it? If there are aliens here, they are so technology advanced from us that if they wanted to destroy us we would have zero chance of defending ourselves. Don't worry about what we have no power over.",
        "good": "8",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "JamesBomb",
        "time": "1 May, 2021",
        "context": "This just in..\nJoe is saying the UFO's are here to 'serve us'..\nIt's a cook book.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "JamesBomb",
        "time": "1 May, 2021",
        "context": "Now you fools see why we need to raise the defense budget a few more trillion, and order another lockdown..\nThe UFO's are coming.",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "mikek19",
        "time": "1 May, 2021",
        "context": "Do we even have 1 shoe that was dropped out of the UFO...give us something.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mikek19",
        "time": "1 May, 2021",
        "context": "UFO PEOPLE ARE COMPLETE MORONS!",
        "good": "2",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "redbugs",
        "time": "1 May, 2021",
        "context": "if there are aliens in the sky there are aliens on the ground. How many believe Pelosi, Shumer, AOC, Abrams,  Biden, and other democrats are planted alien invaders put here to destroy our society before a total invasion? Makes total sense. we are doomed. ",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "okie2021",
        "time": "1 May, 2021",
        "context": "The war of the worlds is coming!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mikek19",
        "time": "1 May, 2021",
        "context": "How come we can track everything in the air...but UFO's!\nAs I'm laughing",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "coolhandluke603",
        "time": "1 May, 2021",
        "context": "they could have been here for eons, living in under ocean cities, the far side of the moon or even unpopulated areas of the world and we would never know. ",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "DazedandAmused",
        "time": "1 May, 2021",
        "context": "I find it extremely suspicious that the Military/US Government is now allowing these Cockpit HUD videos to be released to the press and public.  Considering there are 100's of these types of videos on file and members of the military have been disciplined for talking about/releasing this type of info.   It's tells me \"we the people\" are being groomed for the day that the big secret will be released and the enviable reality of the World Governments that had known all along but chose not to make it public.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "OrangeCocktail",
        "time": "1 May, 2021",
        "context": "Aliens are just so racist",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "JamesBomb",
        "time": "1 May, 2021",
        "context": "I told you clowns to stop muckin' with the Russians.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "jonathanlb",
        "time": "1 May, 2021",
        "context": "The last year-plus has been really bizarre. I love good blockbusters as much as the next guy, but I want to be watching them on my couch with some popcorn NOT living them! I didn’t need to see what would happen if Outbreak were reality (to be fair Coronavirus was pretty weak compared to Hollywood but whatever), or if 1984 and Fahrenheit 451 met Equilibrium and that became reality. I loved The X-Files and Independence Day as a kid but again I never expressed any interest or desire to have that be reality, they’re fine as movies! What is going on lately? I feel like I’m in The Matrix.",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "TheTinMan058",
        "time": "1 May, 2021",
        "context": "UFOs are not an American thing.  All national egos aside, anything that could avoid detection of any definitive proof of it's existence or true nature for so long from so many is worthy of its mysterious origins.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "GreenLamp",
        "time": "1 May, 2021",
        "context": "The picture of a ufo with windows at the top of the article is very misleading. It suggests that this was the photo taken at the reservation.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "JesseL",
        "time": "1 May, 2021",
        "context": "Wouldn't you think that if they can fly from another galaxy to Earth they could easily have the technology to be invisible? 007 did this with his Aston Martin many years ago..",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "truthful895",
        "time": "1 May, 2021",
        "context": "Tucker Carlson is the the new Columbo who ask the right questions!",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jcimm",
        "time": "1 May, 2021",
        "context": "I always thought in writing that it was proper to use a person's full name before referring to them by last name. You called him Pope. Are you talking about Nick Pope or the guy that wears the funny clothes in Italy?",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "skypilot294",
        "time": "1 May, 2021",
        "context": "interesting that they show up and reveal themselves about the time we are about to  Annihilate ourselves.",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "ronnyboy645",
        "time": "1 May, 2021",
        "context": "They traveled 2 trillion light years to come here for what? Same thing we would do if we could travel that distance. Study life on other planets. We are a one in a billion chance that we developed into what we are today. It shows that they are curious, non- violent beings. Stand down America",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "scotterick",
        "time": "1 May, 2021",
        "context": "\"Welcome home Will Robinson.... DANGER, DANGER!!!!\" ",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "timski67",
        "time": "1 May, 2021",
        "context": "This is just fake news to try and get people to think about something else and take their eyes and thoughts of the dems actions. \nFor you ufo nuts yes there probally are aliens somewhere out there. But wouldnt you think if they could travel so many light years, they could easily stay hidden from us, and if they could travel that far, our technology would be no match for them.  So whats the point worrying about something you have absolutely no control over.",
        "good": "4",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "karek",
        "time": "1 May, 2021",
        "context": "Perhaps they are waiting for us to establish warp speed before first contact.  LOL  Then there is the possibility of inter dimensional travel where our physical laws/constraints do not exist.  Then there is the science fiction story where God told them they could watch but must not interfere.  The possibilities are endless if you have an imagination.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Mctooldesign",
        "time": "1 May, 2021",
        "context": "I believe in God, not UFOs ",
        "good": "4",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "heylookmorevotingballots",
        "time": "1 May, 2021",
        "context": "Its a Cook Book!!!  A COOK BOOK!!",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "justanotherpers",
        "time": "1 May, 2021",
        "context": "I remember when they kidnapped me for a weekend, We went to Mars. There were so many nice little green men. We dined at some really good cosmic places, ate food that was out of this world and had one stellar time. C'mon people, our country is circling the drain and this is what you're worried about?",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "libmindsrdiseased",
        "time": "1 May, 2021",
        "context": "UFO's are exactly what they are.......unidentified.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "brerhare",
        "time": "1 May, 2021",
        "context": "The government has kept it secret to keep from creating hysteria and protect Judeo-Christian believers.",
        "good": "2",
        "bad": "3",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "MisterKnowItAll",
        "time": "1 May, 2021",
        "context": "ET \" Go Home!\"",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "keysdisease",
        "time": "1 May, 2021",
        "context": "If they have the technology to get here, they wouldn’t..",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dreamofsiargao",
        "time": "1 May, 2021",
        "context": "Yawn, first grainy pictures from peoples cameras and now grainy pictures from the government. Wake me up when there is one single piece of physical evidence. If you believe in ghosts you will see ghosts.",
        "good": "5",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "mikek19",
        "time": "1 May, 2021",
        "context": "Some people are just morons!",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "karek",
        "time": "1 May, 2021",
        "context": "The possibilities are endless and limited only by your imagination. Star Trek - They are waiting on us to break the warp speed barrier before they make first contact.  Not from our universe - inter dimensional travel and not limited by our physical constraints/laws.  God told them they could watch but must not interfere, don't remember the science fiction movie but as I recall we were told we could watch the development on on of Jupiters moons but could not interfere.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "truthteller831",
        "time": "1 May, 2021",
        "context": "Worry not about aliens from the South.\nCometh aliens from the Cloud!",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "AheadWarpFactorOne",
        "time": "1 May, 2021",
        "context": "My dad was coming into the house from the garage one cold winter night. As he looked up at the stars, he saw the silhouette of a large triangle passing in front or the star filled background. It was silent and fairly slowly moved across the sky and faded away. No sound, no flashing lights.",
        "good": "14",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "peterbuilt",
        "time": "1 May, 2021",
        "context": "Hopefully there coming to take away the old fool in the white house 😯",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "peace-maker59",
        "time": "1 May, 2021",
        "context": "Area 51 was proven to exist, but it took decades for the government to finally admit it. It'll be interesting to see how long it takes for the gov't to admit UFO's and aliens are real and visit Planet Earth consistently. We know this from the petroglyphs and pictographs depicted in prehistoric cave art in the U.S. and among other ancient cultures around the globe. Astronauts in space crafts also appear in historical religious paintings which lends credibility to the belief that aliens have been visiting earth for hundreds of years.",
        "good": "9",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "joleemlt",
        "time": "1 May, 2021",
        "context": "It's because we have our own UFOs, have had. Next on the agenda will be for the global powers to stage a alien invasion. They're so good at that sort of thing.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "inoit",
        "time": "1 May, 2021",
        "context": "Plez, I have enough hard time believing the stupidity of our two Party-American system, still expressing their as stupidity  each & every day.\nIt's boring me back tooo slee., snorrrr.....",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "safari223",
        "time": "1 May, 2021",
        "context": "“The Matrix is a reflection of our times, or at least our anxieties. It reveals our fear of a mechanization so complete, of a commodification of our bodies and enslavement of our minds so successful, that we are no longer even aware of it, having been made oblivious to our reality by the very technologies that rule us.”\n― Yanis Varoufakis, Talking to My Daughter About the Economy: or, How Capitalism Works - and How It Fails",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "SheldonOtter",
        "time": "1 May, 2021",
        "context": "as democrats legalize drugs ufi sightings be come more real just ask the stump jumper,bskunk ape, and me bigfoot tell you.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "mark1963",
        "time": "1 May, 2021",
        "context": "If the truth is out there.  It will be found with scientific research and fact.  There has to be life with all the planets we have seen so far.",
        "good": "4",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "SheldonOtter",
        "time": "1 May, 2021",
        "context": "perhaps joe and kamala are pod people 👽🤖",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "give-me-liberty",
        "time": "1 May, 2021",
        "context": "They can travel across an ocean of stars. They can travel light years to reach our world, yet our highly efficient government is quite capable of hiding them from us on a day-to-day basis; our government is quite successful in keeping them under wraps and hidden from us. Or, maybe you believe they’re hiding from us - but then why are they seen at all, being obviously so much more technologically superior to us.  Or maybe they are in cahoots with our government for some nafarious reasons?  Whatever the reason, this has to be the most ridiculous conspiracy theory and schlock story to date.  Walmart shoppers, we have news for you.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "parkerds980",
        "time": "1 May, 2021",
        "context": "There must be aliens.  Just look at Waters and Pelosi",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "peterbuilt",
        "time": "1 May, 2021",
        "context": "Green lives matter to democrats 💰🤑",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "biglittleman",
        "time": "1 May, 2021",
        "context": "If there is UFO's we don't stand a chance.\nBut hey they might give in to BLM, NAACP and the Black Congressional Congress's demands.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "CountryLogic",
        "time": "1 May, 2021",
        "context": "I find it interesting the number of people who believe in UFO’s/ extraterrestrials despite there being no actual proof of their existence but yet the same people reject the existence of God while using “there is no proof” as the reason.",
        "good": "10",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "ERIKSEN",
        "time": "1 May, 2021",
        "context": "It will come a day , very soon , when the government, and other world governments as well , won’t be able to deny the existence of aliens.   If you think that we are alone in this vast universe, then you are either arrogant or stupid , or both.  ",
        "good": "9",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "AuntieChrist",
        "time": "1 May, 2021",
        "context": "Fake news to distract the ignorant masses. As if the government never lied to the proletariat before.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "raseaccirala",
        "time": "1 May, 2021",
        "context": "Well, if aliens do come here they better not take my job and need to learn to speak english.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "iron364",
        "time": "1 May, 2021",
        "context": "Strange how UFO sightings is such a hugely American-only phenomenon...",
        "good": "0",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "charles'",
        "time": "1 May, 2021",
        "context": "Let me know the next time someone meets someone from another planet....yawn. Who cares about this drivel!! ",
        "good": "4",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "BadDemocratPoliciesFor100Alex",
        "time": "1 May, 2021",
        "context": "I think they heard Biden is printing money until the ink runs out, they're here for the free stuff.",
        "good": "17",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "fulghn",
        "time": "1 May, 2021",
        "context": "Folks jump from the likelihood that other life must exist 'somewhere' out there in the vast universe to the absurd 'so that's evidence that aliens have been to Earth' so frequently it's downright disturbing.  The very definition of logical fallacy.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "BadDemocratPoliciesFor100Alex",
        "time": "1 May, 2021",
        "context": "Geez more illegal aliens?",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "C4Myself",
        "time": "1 May, 2021",
        "context": "So, can there be aliens?  Sure, there is every reason to think life exists elsewhere in the universe.  Can they be \"visiting\"?  Sure, there is every reason to think that our knowledge of physics is limited compared to what it will be in the future, allowing that some may have already made the necessary advances.  The real question at that point should be: Why bother?  There isn't anything that interesting about us or our planet given the first two points, unless it's comic relief.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "inoit",
        "time": "1 May, 2021",
        "context": "Hmm, I've been around for many years on this planet, but until you find conclusive evidence, I will still not believe any astounding or extraordinary events actually happened, or did happen?\n2 Examples\nJesus escaped from his tomb.\nBeings from another planet \"are out there.\"\nHo hum.",
        "good": "0",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "bowfishslayer614",
        "time": "1 May, 2021",
        "context": "In the movie WAR OF THE WORLDS,  The aliens died of a virus caught from the humans. \nThe Elite in our world governments have cooked up this COVID 19 Virus story to get everyone to take a vaccine, it is to remove anything you have that will harm the aliens.... \nPeople you have been purified/ pasteurized and sold to the aliens for food..\n\nTWILIGHT ZONE  ,, To serve man,,,,,, it is a cook book.",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "error": "error"
    },
    {
        "error": "error"
    },
    {
        "error": "error"
    },
    {
        "error": "error"
    },
    {
        "error": "error"
    }
]