[
    {
        "user_name": "12345abcde404",
        "time": "3 July, 2021",
        "context": "Oh no don’t weaken… what will the news crews chasing tragedy report",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Tropikaybay",
        "time": "3 July, 2021",
        "context": "Federal tax payers should be held responsible for all damage created by hurricanes. If you disagree,, you are a racist. ",
        "good": "9",
        "bad": "10",
        "replies": [
            {
                "user_name": "spikymikie",
                "time": "3 July, 2021",
                "context": "Go back to comedy school. Your humor is weak...",
                "good": "3",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "cj134",
        "time": "3 July, 2021",
        "context": "If it follows the center of the path and runs up the west coast of Florida it will turn and come into the state and cross the state. Does it come in at Tampa Bay or does it do like Charlie did?\n\nCoastal flooding could be an issue along the beaches, one side pulling the water out, the back side pushing it in again.",
        "good": "2",
        "bad": "5",
        "replies": [
            {
                "user_name": "Quietly",
                "time": "3 July, 2021",
                "context": "Don't worry ... this one is / might cause rain and wash the dust off of our cars.\nNational Hurricane Web Site is the go to place for truthful updates / models.\nDon't watch any other news channels ... we'll be okay with this one.",
                "good": "10",
                "bad": "2",
                "replies": [
                    {
                        "user_name": "cj134",
                        "time": "3 July, 2021",
                        "context": "If it runs a slow path up the west coast of FL storm surge flooding can be significant on the barrier islands.\nA small hurricane did that in the 1970's and eroded the beaches so bad they had to do a beach nourishment program.\nNever underestimate what these storms can do, I know it seems cool acting like it's nothing and all but you don't know and it's better to be safe than sorry.",
                        "good": "1",
                        "bad": "5",
                        "replies": []
                    },
                    {
                        "user_name": "masterzvoice",
                        "time": "3 July, 2021",
                        "context": "that is foolish advise. Pay attention to the NHC site but also local meteorological teams in your area. Always stock up and be prepared.",
                        "good": "1",
                        "bad": "3",
                        "replies": []
                    },
                    {
                        "user_name": "ginnyallen",
                        "time": "3 July, 2021",
                        "context": "Then why did you click on this story?",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "stonkysteve",
                "time": "3 July, 2021",
                "context": "West to east is the hardest impact for us on the east side.",
                "good": "0",
                "bad": "2",
                "replies": []
            },
            {
                "user_name": "Blackhulledfleet197",
                "time": "3 July, 2021",
                "context": "A hurricane from Tampa was just in Montreal last night…..\n\nGo Bolts!",
                "good": "7",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "spikymikie",
                "time": "3 July, 2021",
                "context": "Get up to date info from NWS (National Weather Service)  Weather forecasting is a side note here. Its also where FOX gets their info from. And since NWS updates hourly or more, you will get today's info, not yesterday evenings. And the GFS model has it moving up the west side of Florida starting early Tuesday morning. Landfall looks to be more north now, eastern panhandle area.  Will the west coast of Fla get some flooding from storm surge? Yes.  Its the west coast of Florida, and anytime a storm moves up that side it will happen.  And understand that NOBODY can see the future. So just be prepared ahead of time, and get on with living.",
                "good": "2",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "Quietly",
        "time": "3 July, 2021",
        "context": "If folks only used National Hurricane site for information on this type of event ...\nIt would save angst.\n*\nThey have models of when, how strong winds / rain will be, etc.\n*\nThe States will be fine ... Rain Squalls, Gusts of winds.",
        "good": "25",
        "bad": "2",
        "replies": [
            {
                "user_name": "masterzvoice",
                "time": "3 July, 2021",
                "context": "They don't know that. You don't know that. So be prepared.",
                "good": "10",
                "bad": "8",
                "replies": []
            }
        ]
    },
    {
        "error": "error"
    },
    {
        "error": "error"
    },
    {
        "user_name": "StormShadow",
        "time": "3 July, 2021",
        "context": "As soon as she crosses Cuba,she will sing \"Let it go,Let it go,don't hold it back anymore\"",
        "good": "6",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "Blackhulledfleet197",
        "time": "3 July, 2021",
        "context": "If it wiped out the DR….it would be no loss….",
        "good": "1",
        "bad": "2",
        "replies": [
            {
                "user_name": "SunShineMoonShine",
                "time": "3 July, 2021",
                "context": "Dominicans are humans too…with families.",
                "good": "3",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "jimmyford",
        "time": "3 July, 2021",
        "context": "I live in SW Florida. We need to pay attention to hurricanes. However, local news going to Home Depot etc to ask shoppers if they are getting ready for Elsa, 5 days before expected landfall, is over the top. Already had newbies for the northeast ask if they should evacuate.",
        "good": "55",
        "bad": "4",
        "replies": [
            {
                "user_name": "$hillbilly$",
                "time": "3 July, 2021",
                "context": "Yea they should",
                "good": "1",
                "bad": "0",
                "replies": []
            },
            {
                "error": "error"
            },
            {
                "user_name": "jerseygirl66",
                "time": "3 July, 2021",
                "context": "When my mom lived on Ft Myers Beach, until she passed at 99, she was ready all year long.  She knew to have everything ready, including Rx, batteries etc, BEFORE June 1.  She lived there with my dad until he died and then another 20+ years and never was caught unprepared.  The newbies need to have it hammered into their pea brains until they understand the seriousness of hurricanes.",
                "good": "7",
                "bad": "1",
                "replies": []
            },
            {
                "user_name": "GreenFries",
                "time": "3 July, 2021",
                "context": "I would have told them yes it is a good time to evacuate but please don't come back....",
                "good": "31",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "DiscreetPoster",
                "time": "3 July, 2021",
                "context": "We're in SE FL and here the philosophy is that it's never too early to prepare. Necessary items like water, batteries, etc. are in short supply, if available at all, days before a possible landfall. It's happened to us so I'm talking from personal experience. Been here forever and didn't hesitate to run out yesterday to top off my supplies.",
                "good": "10",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "jimmyford",
                        "time": "3 July, 2021",
                        "context": "Agree. My point was being prepared for loss of power is a year round thing, not just hurricane season. People everywhere should be prepared for loss of power, whether it's from weather, fire, accidents etc.",
                        "good": "4",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "bigfootakadarryl",
                "time": "3 July, 2021",
                "context": "5 days before is the BEST TIME TO GET READY.  You idiots that wait are just plain stupid.  But truck will be fully fueled up today, my property cleaned up and ready for the wind, and I am south of Daytona on the coast.  And yes I am monitoring it and I will evacuate very early if it comes here, and it is trending more east in the models after the 8 AM updates.  If it does not come here my truck will be fine with a full tank and my yard will be cleaner.  I have ridden out several hurricanes, will never do it again, the storm is cool, but that living with no AC after and no stores open is misserable, why bother when I can go to the NC mountains and enjoy.  But everyone in Florida should be getting ready today.",
                "good": "8",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "Thesanctuary",
                "time": "3 July, 2021",
                "context": "I have spent my entire life in Florida, primarily in the Florida keys and SW Florida. Don’t under estimate a Hurricane whether it’s a Cat.1 or Cat.5. Your life depends on it. Prepare now for the season, this won’t be the last one. ",
                "good": "11",
                "bad": "2",
                "replies": [
                    {
                        "user_name": "IsThisAllThereIs",
                        "time": "3 July, 2021",
                        "context": "I’m in the Keys now. We just mull it over some rum while staring at the boxes of supplies left from Irma. Bring it on!",
                        "good": "2",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "joepopp",
                "time": "3 July, 2021",
                "context": "You’re right! They always hype up these storms too much. This one looks weak, and it might not even track into Florida.",
                "good": "8",
                "bad": "2",
                "replies": []
            },
            {
                "user_name": "5150voter",
                "time": "3 July, 2021",
                "context": "Tell the newbies that they should evacuate and not come back. lol",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "bigleaguebiglytrump",
        "time": "3 July, 2021",
        "context": "Weaker Hurricane Elsa, yuuup you know that’s due to Covid and Global Warming",
        "good": "23",
        "bad": "4",
        "replies": [
            {
                "user_name": "johnhinnc402",
                "time": "3 July, 2021",
                "context": "And racism",
                "good": "3",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "hh65abc",
        "time": "3 July, 2021",
        "context": "This is not even a Hurricane with winds less than 75 Knots. Sensationalism to promote climate change nonsense. The narrative today to promote Climate Nonsense is \"look at how many named storms we had last year\". Never mind that only hurricanes use to be named and now every storm is named.",
        "good": "54",
        "bad": "3",
        "replies": [
            {
                "error": "error"
            },
            {
                "user_name": "Owls5262",
                "time": "3 July, 2021",
                "context": "I believe they use mph not knots when measuring hurricane winds ",
                "good": "6",
                "bad": "2",
                "replies": []
            },
            {
                "user_name": "bigfootakadarryl",
                "time": "3 July, 2021",
                "context": "Winds are over 74 MPH that is a HURRICANE, not sure where you got 75 knots from.  They for at least many decades always named tropical storms as soon as they have a closed rotation and winds 39 MPH or above.",
                "good": "4",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "sciencerocks",
                "time": "3 July, 2021",
                "context": "How does a seasonal storm \"promote\" climate change?",
                "good": "6",
                "bad": "1",
                "replies": []
            },
            {
                "user_name": "gator358",
                "time": "3 July, 2021",
                "context": "Yes. And don't forget that most tropical storms and even some hurricanes peter out in the open ocean, nowhere near land. If it weren't for weather satellites, no one would even know that they occurred.",
                "good": "4",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "tunein",
        "time": "3 July, 2021",
        "context": "I am a northeast transplant who will spend the majority of my remaining years in Southwest Florida. My intention is to enjoy the sunshine, fishing, and beach relaxation. I certainly have no intention of ruffling the feathers of the locals, but rather assimilate into the culture, as best as I can. I can say, that certainly, we from the northeast, are overly concerned for reports of hurricanes anywhere they make landfall. But this reaction is the result of years of devastating news coverage, where the news outlets in the Northeast sensationalize, for little more than improving their ratings, every tropical storm event that develops. For this reason alone, I suppose that we are very cautious when these storms are about to impact our lives.",
        "good": "10",
        "bad": "2",
        "replies": [
            {
                "user_name": "Archangel40",
                "time": "3 July, 2021",
                "context": "No worries, fill your tub with ice and beer and watch all the crazies run around outside trying to catch air with their shirts when a good gust comes through! We don’t fear hurricanes here because we know it is part of life in Florida! We respect officials and follow guidance if the storm is really bad, but the more Floridians you meet especially the boaters and beach bums, they will acclimate you to our way of life! Relaxation and freedom is what you get here in Florida, enjoy it!!!",
                "good": "2",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "youknowhow",
        "time": "3 July, 2021",
        "context": "Fox News!!! there is no need to bring Surfside into this... That is a bit of a stretch!",
        "good": "7",
        "bad": "1",
        "replies": [
            {
                "user_name": "georgeinsandiego",
                "time": "3 July, 2021",
                "context": "I think the concern is for anyone who might still be alive and hoping for rescue.",
                "good": "5",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "CyanSeahorse",
        "time": "3 July, 2021",
        "context": "Looks like the Earth is initiating it's own method of population control these days.",
        "good": "4",
        "bad": "0",
        "replies": [
            {
                "user_name": "georgeinsandiego",
                "time": "3 July, 2021",
                "context": "Hurricane activity peaked in the 1880s",
                "good": "1",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "Rampage1977",
        "time": "3 July, 2021",
        "context": "Haha. I am going to st Pete Beach on vacation all week. This is nothing but a little wind and rain to Native Floridians. Yall keep watching rhe news letting them scare you to death. Mountain range in Cuba will break this into pieces. ",
        "good": "11",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "twistedmister",
        "time": "3 July, 2021",
        "context": "Hurricanes that hit Hispaniola usually devastate Haiti, but never seem to impact the Dominican Republic as bad, no matter what direction they hit from.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "nicemoveyadork",
        "time": "3 July, 2021",
        "context": "The heading should say...A used to be dude won the Miss Nevada Comp....",
        "good": "5",
        "bad": "1",
        "replies": [
            {
                "user_name": "tunein",
                "time": "3 July, 2021",
                "context": "on a side note, can you imagine the anguish, that the real women, who competed against this male transplant, and lost are feeling! Some of these women have competed their entire life.",
                "good": "8",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "jo48",
        "time": "3 July, 2021",
        "context": "No problem. The Lightning will finish it off in Montreal.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "hogslayer950",
        "time": "3 July, 2021",
        "context": "i'm rollin' thunder, pourin' rain                                                                                                                              i'm comin' on like a hurricane",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "understandthis",
        "time": "3 July, 2021",
        "context": "250 miles from Puerto Rico. They will claim state of emergency on the CAT 1 and blame US for racist lack of funding.",
        "good": "14",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Tim1952",
        "time": "3 July, 2021",
        "context": "What's this make number 293 now",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "kornfed151",
        "time": "3 July, 2021",
        "context": "Libs are highly disappointed",
        "good": "10",
        "bad": "1",
        "replies": [
            {
                "user_name": "TerryDaktyl™",
                "time": "3 July, 2021",
                "context": "Trumpublikans are highly disappointing.",
                "good": "2",
                "bad": "11",
                "replies": []
            }
        ]
    },
    {
        "user_name": "johnhinnc402",
        "time": "3 July, 2021",
        "context": "This will vanish south of central Cuba.  Jet Stream will finish it off.\n\nNHC is just wanting to stay relevant",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "nicemoveyadork",
        "time": "3 July, 2021",
        "context": "Every one knows hurricanes and bad storms can kill you....It's the weather person forecasting I worry about...",
        "good": "18",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "GreenFries",
        "time": "3 July, 2021",
        "context": "If people don't have hurricane storm shutters or panels and think they will go to home depot to buy some plywood panels, prepare yourself for some sticker shock.....",
        "good": "49",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Owls5262",
        "time": "3 July, 2021",
        "context": "How many black people live in florida?  Hurricanes are racist ",
        "good": "8",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "Laurel_and_Harris",
        "time": "3 July, 2021",
        "context": "Today it's tracking west.  Yesterday it was barreling.  Please tell us when it starts surging. then I'll be worried. ",
        "good": "17",
        "bad": "1",
        "replies": [
            {
                "user_name": "djmgdl",
                "time": "3 July, 2021",
                "context": "Tomorrow it will be stalking the state of Florida.",
                "good": "7",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "denzelle",
                "time": "3 July, 2021",
                "context": "Looks like it's going to pounce on Clearwater.  Perhaps we should rename it to Hurricane Xenu.",
                "good": "3",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "JackMeoff®",
        "time": "3 July, 2021",
        "context": "Don't be fooled, once that Cat 1 leaves Cuba, it will be over warmer waters and will become stronger, FLA needs to pay attention here.",
        "good": "22",
        "bad": "6",
        "replies": [
            {
                "user_name": "Laurel_and_Harris",
                "time": "3 July, 2021",
                "context": "Where did you get your meteorology credentials from?  Walmart?",
                "good": "3",
                "bad": "5",
                "replies": [
                    {
                        "user_name": "SunShineMoonShine",
                        "time": "3 July, 2021",
                        "context": "It’s called common sense. \nPrepare for the worst-hope for the best.",
                        "good": "4",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "JackMeoff®",
                        "time": "3 July, 2021",
                        "context": "#YourMothersAnus.com",
                        "good": "1",
                        "bad": "2",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "bigfootakadarryl",
                "time": "3 July, 2021",
                "context": "It is traveling over 31 MPH, unheard of for a hurricane in that area, so the computer models could be very unreliable because they do not have historical data of a storm moving that fast to model after, not for path or strength.",
                "good": "5",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "raccoonboy",
                "time": "3 July, 2021",
                "context": "Only if your a small boat at sea.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "Tognaughty",
        "time": "3 July, 2021",
        "context": "I've got my evacuation plan. Grab the beer and run like hell.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dereg80s",
        "time": "3 July, 2021",
        "context": "and there is a huge fire going on in the sea in gulf. If will continue until all the crude is burned.  - energy production gone wrong. What an environmental disaster",
        "good": "2",
        "bad": "2",
        "replies": [
            {
                "user_name": "johnhinnc402",
                "time": "3 July, 2021",
                "context": "Biden is responsible",
                "good": "1",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "jay1950911",
        "time": "3 July, 2021",
        "context": "Been through about seven or eight Hurricanes over the years.  Yes, they are destructive but I blame a lot of the destruction on lax building codes, uneducated people in their paths, uneducated city and state employees, etc.  Also, I agree that a low pressure area should not be given a name, give the names to the storms after they reach the Hurricane threshold of 74 MPH.",
        "good": "35",
        "bad": "2",
        "replies": [
            {
                "user_name": "joepopp",
                "time": "3 July, 2021",
                "context": "They name them once they reach Tropical Storm criteria. I think it’s 34 knots.  But, they’ve been quick to name these storms over the past few years. It’s dishonest",
                "good": "6",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "autorotator",
                "time": "3 July, 2021",
                "context": "The definition of a WIND was reduced years ago to feed into the narrative.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "johnhinnc402",
        "time": "3 July, 2021",
        "context": "The jet stream at fl 10 is strong and will send this to Bahamas.",
        "good": "6",
        "bad": "3",
        "replies": [
            {
                "user_name": "TerryDaktyl™",
                "time": "3 July, 2021",
                "context": "No it won't.  It will track very near the west coast of FL.",
                "good": "2",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "watchthis!",
                "time": "3 July, 2021",
                "context": "FL10 is 1000 feet. The jet streams start at 30,000 up to around 50,000 feet.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "error": "error"
    },
    {
        "user_name": "raccoonboy",
        "time": "3 July, 2021",
        "context": "Basically going to be a non event as expected. Rest your drama pencils for the last weekend in august. Guaranteed to be a thriller ..",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "brewingbiker201",
        "time": "3 July, 2021",
        "context": "silly article, it was ALWAYS tracking west of that site.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ha-ha-ha01",
        "time": "3 July, 2021",
        "context": "What happened with the \"Queen of destruction. Beast.\" headline?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dholbazao",
        "time": "3 July, 2021",
        "context": "Hey Fox, stop saying it Hurricane. Don’t you know that? It is just a cluster of possible storms or stormy situation. It should be called only after   It gas been measured and meets the criteria to be called hurricane. Shame on you for creating false headlines. ",
        "good": "1",
        "bad": "2",
        "replies": [
            {
                "user_name": "toownselfbetrue",
                "time": "3 July, 2021",
                "context": "It was a Hurricane and then slowed down and is expected to pick up speed again.",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "sundaypuncher",
        "time": "3 July, 2021",
        "context": "If that hurricane hits the Miami area that partial building will more than likely come down !! Prayers for the rescue and recovery!!",
        "good": "5",
        "bad": "0",
        "replies": [
            {
                "error": "error"
            }
        ]
    },
    {
        "user_name": "buffalo8031",
        "time": "3 July, 2021",
        "context": "Invite Biden down to the keys and have him give a speech and his warm air will force the storm out to sea ",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jeffersonspaceplane",
        "time": "3 July, 2021",
        "context": "This ones a cake walk.  Stop freaking people out with this stuff.  If its cat3 then outlying areas and islands need to get to the mainland for the purpose of flooding and high waters. if its a cat4, hunker down. Trailer communities into shelters.  If its a cat5, have at least 2 weeks of beer stocked up.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "JOE_THE_PUPPET",
        "time": "3 July, 2021",
        "context": "Cuba will fill the Hurricane with Anti-American Communist propaganda.",
        "good": "3",
        "bad": "1",
        "replies": [
            {
                "user_name": "michaelpelt",
                "time": "3 July, 2021",
                "context": "Just like the American news media.",
                "good": "7",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "antiliberalhero",
        "time": "3 July, 2021",
        "context": "Here you go. Add one more for climate change.",
        "good": "0",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "theraven666",
        "time": "3 July, 2021",
        "context": "What is all this gloom and doom with hurricane predictions???  Barreling towards Florida!  Florida in the path of the BEAST.  Please!  I am a native Floridian.  These headlines are for sure FAKE NEWS.  You cannot predict the path of a hurricane that far out, and a cat 1 or TS are not much worse than our afternoon thundershowers.  Tell people to be ready, have supplies, batteries, water (which we all do anyway!) and then leave it until you have at least a 70% shot of knowing where it will hit.  Your job is to inform, not scare people half to death.  I am surprised by the newcomers to our state who think that their are eye-strength-winds blowing everywhere underneath that sprawling storm, which is not so.  More education please, less drama!",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "notme152",
        "time": "3 July, 2021",
        "context": "I keep my vanity in the bathroom",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "Archangel40",
        "time": "3 July, 2021",
        "context": "Want to know how much CNN lies, one more example right here…..just watched the weather report and the meteorologist straight up lies and claimed that Elsa was a tropical storm with 70 mph winds and gusts of 85 mph…..sorry dude but that is a Cat 1 hurricane, not a Tropical storm, take it from someone who has lived through every hurricane system in Florida with the exception of time in the military! Can’t change NOAA standards for categorizing extreme storm systems to fit your narrative!!",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "IsThisAllThereIs",
        "time": "3 July, 2021",
        "context": "Rejoice that we don’t have to send supplies and money to PR and Haiti this time. Thank goodness.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cal2177",
        "time": "3 July, 2021",
        "context": "Thankfully, O'Biden threatened to tax it so it slowed to a TS.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "mazchaz",
        "time": "3 July, 2021",
        "context": "Thanks to Joe,  everybody can experience a bad  day even without a hurricane.",
        "good": "4",
        "bad": "1",
        "replies": [
            {
                "error": "error"
            }
        ]
    },
    {
        "user_name": "dakdog",
        "time": "3 July, 2021",
        "context": "This storm, according to everyone in the Biden administration, has the potential to blow over all high-rise buildings along the coast of Florida due to climate change. Now just released! Any buildings anywhere in the United States are in danger of collapse unless the Republicans agree to the green colored portion of the infrastructure bill. ",
        "good": "12",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "lonlyrepublicanlivesmatterl",
        "time": "3 July, 2021",
        "context": "You hear that? No it's not the sound of an approaching hurricane it's the sound of comical racist anti-white Democrat animals crying all over their BLM blankies because all hurricanes are not yet named ghetto names. They want this hurricane to be named Hurricane Shaniqua. Breaking news, hurricanes and Mother Nature are now racist too LOL. Carry on you embarrassing Democrat animals, you have zero credibility left",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "truthbeatshate",
        "time": "3 July, 2021",
        "context": "No no no.... Weakening does not fit the crazy climate change nutjob narrative!!! No! But wait.... no matter what happens... oil, gas and coal usage are to blame! Just ask John (Tossed your medals) Kerry.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sam1775",
        "time": "3 July, 2021",
        "context": "This just in from NOAA; \"The storm weakened due to President Biden's request and him telling it; Come on man. We're re-joining the Paris Accords.\"",
        "good": "5",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "recorddeathsbodybagbiden",
        "time": "3 July, 2021",
        "context": "Sweet I always enjoy when a TS comes thru by me... Makes for a great day of eating, drinking and enjoying the show",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "freedom496",
        "time": "3 July, 2021",
        "context": "It is the same as in Egypt you want to be passed over in time of danger?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "GoldPlanet",
        "time": "3 July, 2021",
        "context": "Did Fat Donnie get his Sharpie out and show the storm track? This time having the storm striking Alaska.",
        "good": "0",
        "bad": "8",
        "replies": [
            {
                "user_name": "blairzo",
                "time": "3 July, 2021",
                "context": "At least he's not a senile old man who has trouble answering questions",
                "good": "3",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "GoldPlanet",
                        "time": "3 July, 2021",
                        "context": "Drinks sippy cups of water with two hands. Can't walk down a ramp unaided. Thinks windmill noise causes cancer. Person, woman, man, camera, TV. Thinks ingesting bleach and shoving UV lights up rear ends is the way to defeat covid. Gets blown out of the water by Chris Wallace and never does an interview with anyone tougher than Hannity again. Believes he just spoke with the president of the U.S. Virgin Islands. Thinks American colonists stormed airports in the Revolutionary War. \nYour hero. Says a lot about him and you.",
                        "good": "0",
                        "bad": "2",
                        "replies": [
                            {
                                "user_name": "charliedavis",
                                "time": "3 July, 2021",
                                "context": "Crapulence Alert",
                                "good": "0",
                                "bad": "1",
                                "replies": []
                            },
                            {
                                "user_name": "recorddeathsbodybagbiden",
                                "time": "3 July, 2021",
                                "context": "Last time Joe answered a question with out a cue card? Joe gets in trouble for answering questions by who knows and he is president, the idiot falls UP stairs 3 times, Can not remember Libya from Syria, I could go about the demented fool",
                                "good": "1",
                                "bad": "1",
                                "replies": []
                            },
                            {
                                "user_name": "notlikeyou",
                                "time": "3 July, 2021",
                                "context": "clown alert",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "rfvette",
                "time": "3 July, 2021",
                "context": "You should spend the $.16 cents, that Joementia saved you on your 4th of July BBQ, on Psychiatric Care.",
                "good": "6",
                "bad": "1",
                "replies": []
            },
            {
                "user_name": "Rwayn",
                "time": "3 July, 2021",
                "context": "Get help for you're TDS it is a sickness liberalism sucks ",
                "good": "4",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "GoldPlanet",
                        "time": "3 July, 2021",
                        "context": "\"you're?\" Dumber than a box of rocks.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "notlikeyou",
                                "time": "3 July, 2021",
                                "context": "clown alert",
                                "good": "0",
                                "bad": "1",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "charliedavis",
                "time": "3 July, 2021",
                "context": "did you justSpermSpankYourselfwithYourtranniewanker???",
                "good": "4",
                "bad": "1",
                "replies": []
            },
            {
                "user_name": "notlikeyou",
                "time": "3 July, 2021",
                "context": "clown alert",
                "good": "0",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "sailingnewyork",
        "time": "3 July, 2021",
        "context": "Fox news seems to be getting lazy.  They used to include the storm tracking maps showing the project path.  Now we're lucky if they even provide a satellite photo.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "CyanRaindrop",
        "time": "3 July, 2021",
        "context": "Just a little rain.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "servant222",
        "time": "3 July, 2021",
        "context": "They are playing the gullible,easily taken in.This is what's really happening.Now for the truth.Believe this.Do not believe the global lie that climate change is caused by greenhouse gases,Carbon emissions,and fossil fuels.They have ulterior motives for telling this lie.This is what God has been telling me since the middle of the 1980's.Visions He has been giving me on a recurring basis.This is what the first vision said, word for word.\"We are coming into a time of illumination, and you ARE GOING TO see whole civilizations walking around naked.It's meant to pass genetic strengths down upon the whole human race.\"We are meant to absorb this energy while it lasts. Plants and animals are also going to be absorbing this energy.This vision has also returned to me on a recurring basis over the years until this present day to continue to reinforce this impression upon my mindset that I may with authority communicate this to the world.Laugh,but this is what you're going to see.Why isn't this being made publicly known.It is suppressed.They are lying and deceptive people that do not want you to know this.Why have the ice caps on Mars been diminishing like our ice caps on earth?Is climate change on earth melting Mars ice caps?No.It's a gradually growing hotter sun that will gradually reach it's crescendo and culmination and then subside.There is nothing to be afraid of.It is a normal and natural process.GLOBAL WARMING is a solar phenomenon.CLIMATE CHANGE IS SOLAR.IT IS NOT MAN CAUSED.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "milobarbin604",
        "time": "7 July, 2021",
        "context": "Nothing increases ratings like a good Hurricane.  Unfortunately the media does more to create hysteria these days then just report the news.  I remember the old days (60's,  70's  &  80's)  when we knew it was coming so we held on tight and weathered the storm and when it was over we all still had plenty of toilet paper.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "JayBay",
        "time": "3 July, 2021",
        "context": "Will Elsa freeze Arendale ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "CATSGOFOR9",
        "time": "3 July, 2021",
        "context": "Thanks to Trump and his sharpie, Elsa is headed back out to sea",
        "good": "0",
        "bad": "6",
        "replies": [
            {
                "error": "error"
            },
            {
                "user_name": "krazykid",
                "time": "3 July, 2021",
                "context": "sad, you how nothing else in life to live for but Trump bashing.",
                "good": "2",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "CATSGOFOR9",
                        "time": "3 July, 2021",
                        "context": "I thank him and you bash mewhy the hate?",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "notlikeyou",
                "time": "3 July, 2021",
                "context": "clown alert",
                "good": "2",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "CATSGOFOR9",
                        "time": "3 July, 2021",
                        "context": "I know right? Orange clown at that!",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "demcitiesburning",
        "time": "3 July, 2021",
        "context": "Meanwhile. Joe Biden opened his own pudding cup today!",
        "good": "1",
        "bad": "1",
        "replies": [
            {
                "user_name": "TerryDaktyl™",
                "time": "4 July, 2021",
                "context": "Meanwhile Trump's CFO sweats in his shorts as will the duly ejected 45.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "druz",
        "time": "3 July, 2021",
        "context": "seriously...rain event minor wind...wont be a hurricane when reaches land...the islands will tear it up. STOP the TERROR...be prepared but for the summer this is only gonna be a good storm that moves in fast and out fast!!!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "isitraccoonseasonyet",
        "time": "4 July, 2021",
        "context": "Kamala can blow it back out to sea. And then, giggle about it.",
        "good": "1",
        "bad": "1",
        "replies": [
            {
                "user_name": "TerryDaktyl™",
                "time": "4 July, 2021",
                "context": "You'd know best about how blowing works.",
                "good": "1",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "isitraccoonseasonyet",
                        "time": "4 July, 2021",
                        "context": "Not like the colored giggler, Cletus.",
                        "good": "0",
                        "bad": "1",
                        "replies": [
                            {
                                "user_name": "TerryDaktyl™",
                                "time": "5 July, 2021",
                                "context": "the Klan is up early today.  Guess that garbage never really goes away.",
                                "good": "0",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "isitraccoonseasonyet",
                                        "time": "5 July, 2021",
                                        "context": "The Klan never sleeps. Get used to it.",
                                        "good": "0",
                                        "bad": "1",
                                        "replies": [
                                            {
                                                "user_name": "TerryDaktyl™",
                                                "time": "5 July, 2021",
                                                "context": "No they don't, Chippy.  You're kind is what made America the pit it's becoming.  Get used to it.",
                                                "good": "0",
                                                "bad": "0",
                                                "replies": [
                                                    {
                                                        "user_name": "isitraccoonseasonyet",
                                                        "time": "6 July, 2021",
                                                        "context": "It’s great where I am. Our cops are overfunded and they still know how to beat a colored with a phone book if they wander into town. It’s only a pit where your kind is. We decide what is right in our region. And if you don’t think so, put on your BLM or ANTIFA garb and come back to Jackson, MS. like you did last year and the same thing will happen. One of those pasty little ANTIFA bugs is still missing. Seems that nobody knows what happened to him. I hope his family finds some closure…",
                                                        "good": "0",
                                                        "bad": "0",
                                                        "replies": [
                                                            {
                                                                "user_name": "TerryDaktyl™",
                                                                "time": "6 July, 2021",
                                                                "context": "MS - lowest in US education and highest in inbreeding.  Now I've got you figured out.",
                                                                "good": "0",
                                                                "bad": "0",
                                                                "replies": []
                                                            }
                                                        ]
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "JayBay",
        "time": "3 July, 2021",
        "context": "Elsa is going home, expected track is EPCOT",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "notlikeyou",
                "time": "3 July, 2021",
                "context": "clown alert",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    }
]