[
    {
        "user_name": "cal_105898",
        "time": "2 April, 2019",
        "context": "Wonder what Putin is hiding from? He is the most beloved man in Russia so why the unusual effort to hide his location?",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "drnybble(doctornibble)457",
                "time": "2 April, 2019",
                "context": "Reason:\nTo prevent what is called \"decapitation\".  It's when the top level of a government are destroyed to prevent effective command and control.",
                "good": "3",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "cal_105898",
                        "time": "2 April, 2019",
                        "context": "I guess that is why most major countries do not have all their command structure in one place, but decentralized?",
                        "good": "6",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "TecheSavy",
        "time": "2 April, 2019",
        "context": "The trick won't last for long....we know what's going on and will be gotten around, just like every other electronic warfare trick..their ignorance was to start using it regularly.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cal_105898",
        "time": "2 April, 2019",
        "context": "I hope that this is not the same Marine Commandant who only a couple of weeks ago said that the US border situation was not a military threat to  US national security?  Apparently his reasoning ability is not that good?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "stoneman133",
        "time": "2 April, 2019",
        "context": "\"question the possible impacts this electronic warfare could have if used\"\nWe would be lost without satellites.... GPS, communications....",
        "good": "9",
        "bad": "0",
        "replies": [
            {
                "user_name": "Jaguarized076",
                "time": "2 April, 2019",
                "context": "So would Russia and China.  They are not immune to the same type of warfare; quite the contrary.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "drnybble(doctornibble)457",
        "time": "2 April, 2019",
        "context": "Much of the US advanced weaponry and war fighting capability requires accurate GPS.  Missiles, artillery, flight ops, ground movements, etc.  Most of our \"eggs\" are in that one GPS basket.\nDisruption of GPS means we cannot effectively defend ourselves.\nGAME OVER?",
        "good": "6",
        "bad": "0",
        "replies": [
            {
                "user_name": "TecheSavy",
                "time": "2 April, 2019",
                "context": "Let's not panic just yet..",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "drnybble(doctornibble)457",
                        "time": "2 April, 2019",
                        "context": "Just WHEN then? When we need GPS and it's not there?  THEN panic?",
                        "good": "4",
                        "bad": "0",
                        "replies": [
                            {
                                "error": "error"
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "cal_105898",
                "time": "2 April, 2019",
                "context": "It is good that it is out in the open and we know about it rather than be surprised by it later? We just have to be aware  that the Russian have said some fantasy stuff recently about their missile system being two generations ahead of everyone else.",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "mikehunt1",
                "time": "2 April, 2019",
                "context": "um when all else fails spray and pray",
                "good": "1",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "edward3248",
                "time": "2 April, 2019",
                "context": "no,gps is not the only thing they use,they also use sensors,radar homing,TERCOM, INS, DSMAC,laser guided weapons,Lidar etc...",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "doctorgreg",
                "time": "2 April, 2019",
                "context": "The military likely have alternatives.  They just are not broadcasting it.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "Budone1",
        "time": "2 April, 2019",
        "context": "This Russian tech helped Hillary dodge sniper fire.",
        "good": "27",
        "bad": "0",
        "replies": [
            {
                "user_name": "RoadKillHeaven",
                "time": "3 April, 2019",
                "context": "HDS much?",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "error": "error"
    },
    {
        "error": "error"
    },
    {
        "user_name": "seandski393",
        "time": "2 April, 2019",
        "context": "Another Clinton spoofing?",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "SanteeClaus",
        "time": "2 April, 2019",
        "context": "We're screwed..SECOND!!!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "DavMichaels",
        "time": "3 April, 2019",
        "context": "He is scared we might come after him after he landed troops in S. America.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "simplythinking",
        "time": "3 April, 2019",
        "context": "Use your GPS, but use your head!",
        "good": "7",
        "bad": "0",
        "replies": [
            {
                "user_name": "raceitarx2",
                "time": "3 April, 2019",
                "context": "Don't drive down stairs just because your GPS says it's the way to go.",
                "good": "7",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "simplythinking",
                        "time": "4 April, 2019",
                        "context": "...And the GPS doesn't know the bridge is out!",
                        "good": "2",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "burww",
        "time": "2 April, 2019",
        "context": "EW is not new it's been in use for decades it the eccm that is important to this",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "observer101",
        "time": "4 April, 2019",
        "context": "The little man is hiding.....I LOVE IT....",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rebelheart728",
        "time": "4 April, 2019",
        "context": "President Trump has him scared!",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "RedCactus",
        "time": "2 April, 2019",
        "context": "If the Democrats should win in 2020 start a war with Russia the US will find itself not only fighting Russia, China, Central America, much as of Europe but will be over whelmed with an under ground Militia that would rather be dead than give up to these Traitors.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "bgordo863",
                "time": "2 April, 2019",
                "context": "\"WOLVERINES!!!!!\"",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "laughorgrowl653",
        "time": "3 April, 2019",
        "context": "What about the “sister cities” UN Agenda 21 where towns and cities have been trading software with Russia and China to name a few.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "laughorgrowl653",
                "time": "3 April, 2019",
                "context": "US cities and towns. Check out yours to see which yours is playing with.",
                "good": "1",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "RedRadio",
                "time": "3 April, 2019",
                "context": "is AOC russian or chinese?",
                "good": "4",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "redtown",
        "time": "4 April, 2019",
        "context": "Putin must think he’s special.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "MocktheIgnorant826",
        "time": "3 April, 2019",
        "context": "Sounds like he's running scared; must have a price on his head back home.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Johnson19420",
        "time": "3 April, 2019",
        "context": "Goes to show you don't need to spend $700bn for an effective military defense. A few nerds/hackers can provide all the defense you need. \n\nBy the way, Russia only spends about $60bn.  Seems as if they have spent if very effectively as their country is just as safe as ours.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "OliveBus",
                "time": "3 April, 2019",
                "context": "Of course it is.  Nobody is threatening them.  We have many threats.  Islamist, China, Russia, North Korea, etc.  \n\nIf Russia fought for human rights and freedoms the way we do, they too would face the level of threat that we do.  Russia doesn't have a national defense, they have a national offense.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "Johnson19420",
                        "time": "4 April, 2019",
                        "context": "Our aggression creates those threats.  \n\nPlus, we don't fight for human rights and freedoms.  We fight for global hegemony.  \n\nIf we simply defended our country, we would significantly reduce the threats we face.  When our invasion of Iraq results in a million deaths, don't you think that would lead to more terrorism?  Why are we in Afghanistan after 17 years?  Why are we meddling in Venezuela?  Ukraine?  The list goes on and on.  \n\nName one country where we have caused more freedom and improved human rights.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "Zradogon",
        "time": "3 April, 2019",
        "context": "If the Russian electronic weapons are able to deceive the NATO and ISIS terrorists, this is very good. If Russian hypersonic missiles are invulnerable and are capable of causing irreparable damage to the United States, this is even better.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "rebelheart728",
                "time": "4 April, 2019",
                "context": "You aren't very smart are you?",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "D@niel",
        "time": "5 April, 2019",
        "context": "Does the navy still teach celestial navigation?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ignotus999",
        "time": "2 April, 2019",
        "context": "And Mr. Trump's response to this latest attack by Putin's Russia is ... what?  Much like his response to the continuing attack on Ukraine, closing of the Kerch Straits, Russian bombers in Venezuela.  Probably sent his good buddy a nice floral arrangement to decorate the Kremlin for Spring.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "bobmiller1963",
                "time": "2 April, 2019",
                "context": "I try to respect your opinion. Really. I feel bad that you believe everything that happens in the world is President Trumps fault. This fixation is not good for you. I think your blood pressure must be way too high. Please, try to relax.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "ignotus999",
                        "time": "2 April, 2019",
                        "context": "I didn't suggest that it's Trump's doing - though none of us know what he discussed with Putin in their secret chats, and even the translator's notes are long since shredded.  The question is, what is he doing about it?  The answer is, nothing.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "warof1812",
                                "time": "3 April, 2019",
                                "context": "Assuming that because you don't know what is being done means that nothing is being done is a bit ignorant.  Just saying...  Do you think it would be smart to tell the world ?",
                                "good": "7",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "RedRadio",
                                        "time": "3 April, 2019",
                                        "context": "we did that with Obama before we attacked ISIS",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": []
                                    }
                                ]
                            },
                            {
                                "user_name": "LawrenceoftheRight",
                                "time": "3 April, 2019",
                                "context": "And what did Obama do ? Nothing",
                                "good": "1",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "bgordo863",
                "time": "2 April, 2019",
                "context": "Still in denial that CNN lied to you I see.  Don't like the taste of that koolaid they served you to drink.",
                "good": "5",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "ignotus999",
                        "time": "2 April, 2019",
                        "context": "Darn that CNN.  Lied about Putin's annexation of Crimea, and the attack in eastern Ukraine, and closing the Kerch Strait, and the bombers in Venezuela - even faked the pictures and casualty lists.  And now CNN (perhaps in cahoots with \"AOC\"?) is messing with our GPS.  And that phony video of Trump fawning over his buddy Putin in Helsinki - guess the crafty Finns are in on it too.  Must be some nasty Kool-Aid ... and that, comrade, is how Americans spell it.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "bobmiller1963",
                                "time": "3 April, 2019",
                                "context": "I'm sorry. You understand that Putins annexation of crimea happened on Obama's watch. The kerch strait incident doesn't involve the US or Nato.\n\nLet me ask. What do you think the President should do about Venezuela? They are not a US state or Territory. Do you believe we should invade and kick the Russians out? \n\nI'd have to disagree with that.",
                                "good": "6",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "ignotus999",
                                        "time": "3 April, 2019",
                                        "context": "Russia guaranteed the territorial integrity of Ukraine and also guaranteed freedom of navigation of the Kerch Strait.  Yes, Putin's aggression does involve the US, and NATO, and violation of international agreements, and constitutes a threat to freedom.\n\nInvasion of Venezuela is unnecessary.\n\nCall in the Russian Ambassador for a chat, and tell him that Russia must pull out of Venezuela, re-open the Kerch Strait, evacuate eastern Ukraine, and restore Ukrainian sovereignty in Crimea.  If the answer is no, send him packing; recall our Ambassador from Moscow (for \"consultation\" as the diplomats say), and systematically curtail trade with Russia.  Consider seizing Russian assets in the US to compensate Ukraine for Putin's seizure of Ukrainian territory.  Advance Ukraine for NATO membership.  For goodness sake, don't unilaterally cancel sanctions against Oleg Deripaska ... which is what Trump did; hence my earlier remark about that fruit basket ... and invite Putin to another love-fest.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": []
                                    }
                                ]
                            },
                            {
                                "user_name": "RichLando",
                                "time": "3 April, 2019",
                                "context": "Too ignorant to know the difference between GPS and GLONASS? LOL. You have no clue.",
                                "good": "0",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "ignotus999",
                                        "time": "3 April, 2019",
                                        "context": "If you're referring to me, yes, I know that \"GLONASS\" is the Russian version of what we call GPS.  These days, it's GLONASS-M, I believe.  (Hey, that membership in the USNI pays dividends sometimes ...)",
                                        "good": "2",
                                        "bad": "0",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "ReefAquarist",
                "time": "3 April, 2019",
                "context": "Much like his response to the continuing attack on Ukraine.\n\nNot a U.S. problem..",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "error": "error"
    },
    {
        "user_name": "jamesabunn",
        "time": "3 April, 2019",
        "context": "AGM-88 HARM will take care of this problem.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rebelheart728",
        "time": "4 April, 2019",
        "context": "All you democrats/socialist I haven't seen where you blamed our president yet?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "laughorgrowl653",
        "time": "3 April, 2019",
        "context": "Joe Biden and his son profited off Russia taking over Ukraine.  I thought China was their profiting.  \n   Obama told Russia to hold off til after the election and he’d be more flexable",
        "good": "0",
        "bad": "0",
        "replies": []
    }
]