[
    {
        "user_name": "geefostabc",
        "time": "16 June, 2021",
        "context": "Oh Oh?\nWhat did the Hubble see this time?",
        "good": "6",
        "bad": "2",
        "replies": [
            {
                "error": "error"
            }
        ]
    },
    {
        "error": "error"
    },
    {
        "user_name": "ᏉᎾᏬᎭᎵ",
        "time": "16 June, 2021",
        "context": "No big deal, we'll just send the shuttle up and the crew can fix it. Oh, wait, scratch that... We've dismantled the shuttle program.",
        "good": "11",
        "bad": "1",
        "replies": [
            {
                "user_name": "PilgrimBangs",
                "time": "22 June, 2021",
                "context": "Who you calling we there cowboy? It was Obama that cancelled the Shuttle program without a replacement.",
                "good": "0",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "GunsnBible",
        "time": "17 June, 2021",
        "context": "Can someone please donate their old iPhone 4 to replace Hubble's computer?",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "dune272",
        "time": "17 June, 2021",
        "context": "I wonder what they're doing with all the UFO pictures from the Hubble and space station?",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "boonie78724",
        "time": "17 June, 2021",
        "context": "Hey. When you make the repairs, how about taking a photo of the UFO's they have been reporting about. Maybe we can finally get a \"real\" photo without the grain and pixels.",
        "good": "6",
        "bad": "1",
        "replies": [
            {
                "user_name": "rubiks6",
                "time": "18 June, 2021",
                "context": "If the pictures were clear, they’d be IFOs not UFOs. Where’s the fun in that? Then you’d have nothing to wag your tongue about.",
                "good": "0",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "Hondoxp589",
        "time": "17 June, 2021",
        "context": "I cringe when I think our billion dollar telescope is going to fly on an Arian rocket. Known for violent vibrations and staging. We should use a falcon heavy for this launch.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "JD'Huntsville'AL",
        "time": "16 June, 2021",
        "context": "The orbiting observatory has been idle since Sunday when a 1980s-era computer that controls the science instruments shut down ... The idled computer was installed during the fifth and final service call in 2009.\nSo NASA spent millions of dollars in 2009 to install as 30 year old computer on the Hubble?",
        "good": "13",
        "bad": "6",
        "replies": [
            {
                "user_name": "slodon28",
                "time": "16 June, 2021",
                "context": "No.\nMore likely a computer that was made to fit using 1995 parts.",
                "good": "5",
                "bad": "1",
                "replies": []
            },
            {
                "user_name": "jr1112",
                "time": "16 June, 2021",
                "context": "That is the way it reads.\nSo the question is - Is NASA technology really that old, or is it simply the current state of journalism?\nI could go either way on this one.",
                "good": "1",
                "bad": "2",
                "replies": [
                    {
                        "user_name": "BrianSan",
                        "time": "17 June, 2021",
                        "context": "I think it's one of those \"if it's not broken, don't fix it\" scenarios. I'm (just guessing) thinking that upgrading the computer would require a lot of other upgrades.\nAlso, it is very task specific, so newer technology might be overkill for what they're doing.",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "planomike",
                "time": "16 June, 2021",
                "context": "It is very possible the hardware, processors, memory, etc., are a special configuration and the software was written to run on that specific hardware.  This was very common back in the 80's and 90's.  Probably easier to leave the software and other systems alone and replace the hardware with similar tech.",
                "good": "16",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "rogerrobertson924",
                "time": "16 June, 2021",
                "context": "Electronics designed to run on earth in atmosphere can not run in space in a vacuum. The atmosphere actually helps cool the electronic components. A computer must be designed and constructed with an abundance of physical heat synchs then tested for decades before launching them into space. Remember ... there is not a qualified service tech within millions and sometimes billions of miles. And the service charge is incredibly expensive.",
                "good": "8",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "KBags64",
        "time": "16 June, 2021",
        "context": "Cancelling the Shuttle program gives us no way to service Hubble.",
        "good": "10",
        "bad": "2",
        "replies": [
            {
                "user_name": "sciencerocks",
                "time": "16 June, 2021",
                "context": "That is false. Bush cancelled the shuttle program for good reason. This allowed the Obama administration to solicit bids and then contract with SpaceX for the next generation of space travel under a joint private and government (NASA) operation.\n\nMeanwhile, the Hubble has served us exceptionally well.",
                "good": "7",
                "bad": "9",
                "replies": [
                    {
                        "error": "error"
                    },
                    {
                        "user_name": "dune272",
                        "time": "17 June, 2021",
                        "context": "Why would you lie about Bush calcelling the program?  Obama did that! Everything you jerks do is a lie!",
                        "good": "0",
                        "bad": "2",
                        "replies": [
                            {
                                "user_name": "sciencerocks",
                                "time": "22 June, 2021",
                                "context": "The space shuttle program was being phased out under a Bush administration decision. Its last flight was during the Obama administration but the decision, and a good decision by Bush, had already been made. Those are just simple, verifiable, historical facts.",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "user_name": "PilgrimBangs",
                        "time": "22 June, 2021",
                        "context": "But it was cancelled with the intent on a replacement system that was cancelled by Obama.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "sciencerocks",
                                "time": "22 June, 2021",
                                "context": "The replacement system was WAY over budget and showed no promise. The NASA/SpaceX partnership worked out beautifully.",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "error": "error"
    },
    {
        "user_name": "rubiks6",
        "time": "18 June, 2021",
        "context": "It would make a nice exercise ball launcher.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "SagittariusA*",
        "time": "17 June, 2021",
        "context": "It's a shame we don't have a new fleet of space shuttles capable of capturing the hubble and fixing it. I blame Carter, Reagan, Clinton, Bush, and Obama as well as the congresses during their presidencies. Plenty of time to have had new ones built or gotten them started.",
        "good": "6",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "TheIlluminatus",
        "time": "19 June, 2021",
        "context": "All that money wasted on a stupid telescope.\n\nIt could have been sent right into the plutocrats' treasure rooms.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "GunsnBible",
        "time": "22 June, 2021",
        "context": "The flux capacitor probably failed.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "fakeitgoodnasa",
        "time": "17 June, 2021",
        "context": "It's time for some astros to garb up in their scuba suits for a quick fixer-upper to the Hubble. We need more pics of 'exploding stars' please Nasa, so get busy..",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "thomaswinslow009",
        "time": "17 June, 2021",
        "context": "Was the Hubble telescope on Biden's list of 16 things the Russians couldn't hack?",
        "good": "4",
        "bad": "0",
        "replies": []
    }
]