[
    {
        "user_name": "sgt.biffo’hara",
        "time": "4 hours ago",
        "context": "It’s like Wac A Mole. You remove your info from one, it shows up on another. You can’t hide anymore no matter how hard you try. Google your own name and you will be shocked what’s pops up about you ",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Pomegranation",
        "time": "4 hours ago",
        "context": "All these methods to remove your personal data require you to submit your personal data.",
        "good": "23",
        "bad": "0",
        "replies": [
            {
                "user_name": "Grunt970",
                "time": "3 hours ago",
                "context": "I change all my password every month. ",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "MrHistoryBuff",
        "time": "3 hours ago",
        "context": "It’s all still there in Lexis Nexus and the credit bureaus. ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "@justathoughttoconsider",
        "time": "3 hours ago",
        "context": "Very helpful!",
        "good": "0",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "canaddar0101",
        "time": "2 hours ago",
        "context": "Get rid of Facebook. That will fix a huge part of your privacy issues.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Thahn",
        "time": "2 hours ago",
        "context": "I got a letter from the State Tax that my personal data along with others were breached.  They sent me to the 3 credit bureaus for one year free monitoring.\n\nSometime later, I got a mail from my bank.... the same thing happened.  \nThe point is, yours, my personal data are out there and you can't do anything about it.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "usmc1951806",
        "time": "4 hours ago",
        "context": "I’m not worth looking at ..nothing ..no risqué photos no nothing ",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "randy4usa",
        "time": "3 hours ago",
        "context": "People can look me up.  They'll find I'm retired after working professionally for many years, that I'm not a felon, and I vote Republican.  I'm okay with that.",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "lukemeter711",
        "time": "2 hours ago",
        "context": "It’s worth looking into this. The less the general public has access to your information, the safer you are. I can see the day coming when leftists use the information on these sites to track down and attack political enemies.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Acreage-Vehicles-Property.",
        "time": "3 hours ago",
        "context": "If you send the verification to your Email, you're identifying yourself to Been Verified. There really is no way to do it short of hiring a law firm to obtain court order to restrain these predatory information gatherers from engaging character assassination which is what they do for profit.  Each should be legislated out of existence by the US Congress.  \n\nHorrible people.",
        "good": "12",
        "bad": "0",
        "replies": [
            {
                "user_name": "shadowbandaug27",
                "time": "2 hours ago",
                "context": "you simply attack their employees. You act like the world isn't the world",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    }
]