[
    {
        "user_name": "BLdnM",
        "time": "3 September, 2022",
        "context": "Wonder what theyd find if they had raided every past presidents home.",
        "good": "9",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "johnn707",
        "time": "3 September, 2022",
        "context": "So the FBI was on either to any truth coming out about your body's family ahead of the election the officials who offered These Warnings to Facebook should be charged & prosecuted for violating the hatch act for campaigning in their official roles",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "notsureyet",
        "time": "3 September, 2022",
        "context": "Great article!",
        "good": "7",
        "bad": "10",
        "replies": []
    },
    {
        "user_name": "charactermatters733",
        "time": "3 September, 2022",
        "context": "Opinion piece is well done. I'm certain Trump-a-holics  will label discredit the author as a RINO.",
        "good": "13",
        "bad": "23",
        "replies": []
    },
    {
        "user_name": "johnn707",
        "time": "3 September, 2022",
        "context": "Never in the history of the world have I seen anything worse than a Democratic Party",
        "good": "72",
        "bad": "10",
        "replies": []
    },
    {
        "user_name": "opalboy",
        "time": "3 September, 2022",
        "context": "Wow, how biased must you be!?!",
        "good": "14",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "enormouscrank",
        "time": "3 September, 2022",
        "context": "\"a neutral and detached judge\"\n\nPerhaps detached from reality such as this 'impartial' lawyer Zelin seems to be.",
        "good": "50",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "johnn707",
        "time": "3 September, 2022",
        "context": "As an Independent I have tried to listen to the views of both sides. It became obvious to me several years ago that most of the major news organizations no longer cared about reporting the news. They only cared about an agenda. That agenda was to constantly criticize those who love this country, defend this country. and devote their lives to making it stronger and better. Trained as a journalist I could not believe the lies and deceptions of those in my degree field. We were trained to report the 5 W's and 1H: Who, What, When, Where, Why and How. It is an extremely difficult task to collect information without bias and to report only the facts. Today, no one practices these principles. They report without an open mind. As a result, people take sides and fail to learn where the other side comes from. And they certainly report only one side of the story. It is sad. Truth dies when the mind closes. So do countries.",
        "good": "756",
        "bad": "45",
        "replies": []
    },
    {
        "user_name": "bananarepublican632",
        "time": "3 September, 2022",
        "context": "Outstanding analysis, written in a way most maga should be able to comprehend . Thanks",
        "good": "13",
        "bad": "31",
        "replies": []
    },
    {
        "user_name": "johnn707",
        "time": "3 September, 2022",
        "context": "I am a Conservative and a supporter of conservative policies.  I do not like Trump, but I love the policies therefore he gets my vote by default.  I had no idea I was a threat to the \"very soul of this country!\"",
        "good": "565",
        "bad": "43",
        "replies": []
    },
    {
        "user_name": "galileo444",
        "time": "3 September, 2022",
        "context": "Bill Barr sure is showing his true colors.  He made a public statement that Trump had no right to possess classified documents.  He didn't weigh in on the legality of the general warrant, he didn't weigh in on the judge shopping, he didn't weigh in on the deliberate bad optics of the 'raid', he didn't weigh in on the fact that Trump may have declassified them (something Hillary had no authority to do), he didn't weigh in on the likelihood of other former presidents having such documents, etc., etc., etc......thanks Bill.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "odyss",
        "time": "3 September, 2022",
        "context": "We are seeing the democrats getting ready for a coup. Imprisoning opposition leaders and calling their supporters \"enemies of the state\" is right out of the socialist insurrectionists' playbook.",
        "good": "14",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "FreeAMERICANWins",
        "time": "3 September, 2022",
        "context": "And we are to trust the GOVERNMENT HAHAHA.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "clarkkent09",
        "time": "3 September, 2022",
        "context": "Where’s the story about Bill Barr saying there’s no reason Trump should have had those documents? Fox is hiding it’s own stories.",
        "good": "5",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "CDZ864",
        "time": "3 September, 2022",
        "context": "Seems the commenters are upset that DJT isn’t above the law. Maybe the government should just allow him to commit his crimes without law enforcement involvement. Good thing he’s almost 80. His diet will take him the way of Ivana in short order. ",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "cxl119",
        "time": "3 September, 2022",
        "context": "The author spends the majority of the article giving us a lesson in the Constitution.  Only in the last few paragraphs does he acknowledge the very special circumstances here.  A \"neutral and detached judge\" many can claim this is not.  \"Perhaps it is in the public's best interest...\"  - Yes, Randy, it is.  That is why the Special Master is not a distraction, but a well deserved check on what half the country believes was a warrant given out with bias.  If the special master can allay the fears of half the country, then this is a benefit.",
        "good": "265",
        "bad": "12",
        "replies": []
    },
    {
        "user_name": "ourhome22",
        "time": "3 September, 2022",
        "context": "Ok then, lets apply the same to  Hill and Bill and Obama....",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "honestly540",
        "time": "3 September, 2022",
        "context": "As the onion of the former President’s behavior is slowly peeled the level of incompetence and careless behavior has certainly crossed the line of criminal. We need to prosecute him. We also need a serious look at codifying some of his behaviors to remove the gray areas he seemed to operate in. Making a clear declassification process, even for the president, is a start. I think no one ever considered such an action necessary, because Presidents would never be so blatantly careless or lawless but we can’t believe that after this.",
        "good": "9",
        "bad": "15",
        "replies": []
    },
    {
        "user_name": "cmsgt(ret)89",
        "time": "3 September, 2022",
        "context": "dump baggage boy trump - elect a real man DeSantis 2024/2028",
        "good": "0",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "justanotherstablegenius",
        "time": "3 September, 2022",
        "context": "Never thought I would see a header like that on Fox. 😮 Great job. ",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "readrevelations",
        "time": "3 September, 2022",
        "context": "In this environment of hatred toward Trump, he definitely needs a special master to keep things neutral and fair.  They are holding off , dragging the clock, as they continue to look for the smoking gun they could not find while they were there at Mara largo. who could trust any in this government with all the other witch hunts. They got away with impeaching him for no reason twice. Even many democrats know this is over the top wrong, but they do not dare speak or they will get harassed by Pelosi. Look how they turned on Manchin. He finally had to cave or else.  Now another Pelosi puppet.",
        "good": "6",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "md,mph,phd",
        "time": "3 September, 2022",
        "context": "Attorney client privilege has NO standing when documents were stolen.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "moveon2020",
        "time": "3 September, 2022",
        "context": "Trump RINO sheep fail to understand that even though they think their idol is the messiah, he's not above the law.\n\nI guess the rule of law is now a RINO too. How embarrassing 🤡",
        "good": "2",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "TheRacerX",
        "time": "3 September, 2022",
        "context": "How will they choose someone who is impartial? It will either be a Trump supporter, or it will be a communist. There's no such thing as impartial any more, especially when it has to do with Trump. 🙄",
        "good": "61",
        "bad": "11",
        "replies": []
    },
    {
        "user_name": "galanark884",
        "time": "3 September, 2022",
        "context": "Why does this hack have a job? \nDeclassified is declassified. \n14th Amendment. Hillary could not declassify what she had on her servers illegally, and whether by design or negligence, she let several foreign adversaries have access to those documents. Yet she was not prosecuted, due to an excuse that is not in the statute. More to the point, after Bill met with Comey's boss on a remote tarmac.",
        "good": "80",
        "bad": "9",
        "replies": []
    },
    {
        "user_name": "Nickg314",
        "time": "3 September, 2022",
        "context": "Another leftie professor trying to justify this political stunt. We all know it was Schiff that for this call rolling, that’s all we need to know ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "chromedome12325",
        "time": "3 September, 2022",
        "context": "Mr. Chicken Little...where are Hitliary's documents? Has she faced litigation? Let me grab a hammer and Bleachbit when the IRS comes to my house and see what happens: handcuffs!",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Bill3",
        "time": "3 September, 2022",
        "context": "Hahaha! Pure comedy gold!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "someonewithanopinion",
        "time": "3 September, 2022",
        "context": "Let’s not short circuit the process. Crime, search, find, charges. You asked for an exception and requested permission to violate the privacy, obtained the evidence and now don’t know what to do. Don’t jerk us around it’s either a chargeable offense or it isn’t. If it is, make the arrest. If it isn’t, someone must resign. ",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "kingofbs424",
        "time": "3 September, 2022",
        "context": "True article by Randy Zelin, but the search warrant was politically motivated. I see this being used as a weapon against a political enemy's!!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "marjar3",
        "time": "3 September, 2022",
        "context": "Russia, Russia, Russia - only with a different name.\nDEMS ARE DESPERATE!!!",
        "good": "38",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "forefinger",
        "time": "3 September, 2022",
        "context": "And before that judge or magistrate signs the search warrant, that judge or magistrate – who is \"neutral and detached,\" \nAnd herein lies the caveat. Has it been determined that the \"judge or magistrate\" are neutral and detached in this matter. Some say not.",
        "good": "25",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "special.master",
        "time": "3 September, 2022",
        "context": "Why is the left and the FBI afraid of the special master?  Just let Trump and the good people out there have a sense that this is not another deep state Russian hoax which the FBI spread lies about, and gave cover to the press and media companies.  All election rigging lies. No one trusts the federal government.",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "marcol2",
        "time": "3 September, 2022",
        "context": "A special master does not ‘take over’ the case. Their role would only be to sift through documents which is\nNow unnecessary since the DOJ has already sifted , read and copied everything anyways.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "luvlabs",
        "time": "3 September, 2022",
        "context": "I figured Democrats would be trolling on this opinion piece.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jimmyc1965625",
        "time": "3 September, 2022",
        "context": "Gosh, I don't understand why Bonespurs' attorneys don't simply tell the judge that Bonespurs secretly declassified all the top secret documents. Don't they watch Hannity?",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "TrumpL’oie",
        "time": "3 September, 2022",
        "context": "Where’s all the stuff that was in the empty folders?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dunwatchinmsm",
        "time": "3 September, 2022",
        "context": "Reference made of being “neutral and detached”…which sounds like a great idea to ban any and all trials in DC forever.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "notalibspov512",
        "time": "3 September, 2022",
        "context": "Where is the “search warrant” for Hillary Clinton and Hunter Biden?  People are less upset over the semantics of raid vs search warrant than the fact that it was political.  ",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "notalibspov512",
        "time": "3 September, 2022",
        "context": "Where is the “search warrant” for Hillary Clinton and Hunter Biden?  People are less upset over the semantics of raid vs search warrant than the fact that it was political.  ",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "mmba",
        "time": "3 September, 2022",
        "context": "The fact that government documents were found at Trump’s home/country club are evidence for me that he sees himself as above the law. He lied, stalled, denied and now has the audacity to criticize the DOJ/FBI for coming to take what belongs to the government and the American people. This is not the Dems or Biden treating DJT unfairly or calling him names. This is national security interests taken improperly by the former president. Rail against the wind if you want but those are the facts..the truth. When do we get to hold him accountable??",
        "good": "3",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "thedudeness",
        "time": "3 September, 2022",
        "context": "PS: Search warrants are specific in what can be taken as per the constitution and are supposed to be issued only on physical evidence",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "arniescav",
        "time": "3 September, 2022",
        "context": "And yeah who tipped off the fbi causing the search? Don't tell me this is not a dem agenda.",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "sidewayscharlie",
        "time": "3 September, 2022",
        "context": "Opinions are like your behind ! Any way  there is innocent until proven guilty! Now when the warrant was carried out ,it was so vague to it’s actual purpose and no one was allowed to witness the instrument and intrusion to the fact that weather  they planted evidence or carried jewelry or whatever they felt like stealing was unencumbered as to not issue a complete detailed list of everything that was removed from the residence to the lawyer present or   by any observer .",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "grazer",
        "time": "3 September, 2022",
        "context": "Well, Randy, dear writer:  receipts that say miscellaneous don't protect anyone but the government. Hillary Clinton's was not invaded like this.  She knew they were coming and bleached the server.  Not only that, the FBI aided and abetted her in destroying evidence because they hammered phones and laptops at the FBI office and let the world know.  This little essay did not make the case for why one was treated like a queen and one was treated like a dog.  DOUBLE STANDARDS - THEY DON'T PROTECT THE COUNTRY.  You are trying to influence the judge.",
        "good": "30",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "tallone101",
        "time": "3 September, 2022",
        "context": "where are the Hunter docs?  MAGA!",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "neveragain586",
        "time": "3 September, 2022",
        "context": "Elon is a communist. Fox News is now complacent. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "alwhite4",
        "time": "3 September, 2022",
        "context": "If there is nothing to hide why not have a special master? How do we know that under these convenient cover sheets that say \"Top Secret\", each page underneath doesn't have a stamp across the front of each page that says, \"Declassified\"? We can't just take the democrats FBI, DOJ or the US Treasury departments word on anything as they can only take direction from democrats and seem to be really corrupt. If the democrats aren't hiding anything why not have another pair of eye from a special master look at each and every document in question? Because with pictures like this the democrats know they have NOTHING and are trying to turn people against Trump without a true shred of evidence, because if these documents were really still classified the democrat would have arrested Trump already but they haven't, have they!",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "laakona027",
        "time": "3 September, 2022",
        "context": "A box of cover sheets does not make a violation. AND, how did these clowns get a FISA (foreign intelligence surveillance act) warrant for what is claimed to be a domestic security violation?",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "brentsp",
        "time": "3 September, 2022",
        "context": "Randy, when the actual truth comes out that this was an orchestrated and manufactured heist, will you then write a new opinion piece on this eating a plate of crow?  ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "DeroyMurdock",
        "time": "3 September, 2022",
        "context": "The author ignores several key points:\n\nGeneral warrants are unconstitutional. As he writes, the Constitution requires that search warrants must be \"...particularly describing the place to be searched...: Key word: Particularly.\n\nThe search warrant issued before the FBI's raid on Mar-A-Lago covered all presidential documents dated January 20, 2017 through January 20, 2021. That includes the entire Trump Administration, from start to finish. This would cover everything from classified nuclear secrets (relevant to the National Archives records supposedly at issue) to President Donald J. Trump's thoughts on whether to serve ice cream or cherry pie at a lunch with members of Congress (utterly ungermane to the matters at hand).\n\nAs it happens, this raid -- we now learn -- including snatching photographs of Trump, a framed copy of Time magazine, and even several items of clothing. Did this include classified ties? Top secret shirts? Nuclear cufflinks?\n\nIt seems likelier that the FBI just opened a net, dragged it through Mar-A-Lago, and threw the entire net into a truck. Then they sifted through it for days, picking out whatever they found interesting.\n\nThis raid reportedly seized documents that were covered by attorney-client privilege. That is a massive assault on due process and basic human liberty. Shame on the FBI and the Justice Department for this hideous violation of Trump's basic civil rights. \n\nDeroy Murdock\nNew York City",
        "good": "4",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "someonewithanopinion",
        "time": "3 September, 2022",
        "context": "If it’s a chargeable offense, make the arrest. Let the trial discern guilt or innocence.  ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "siskiyoukid",
        "time": "3 September, 2022",
        "context": "DJT is a criminal con man. He will be indicted soon. The only question is where. I guess GA.",
        "good": "2",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "taxedinny",
        "time": "3 September, 2022",
        "context": "About what i expected from a Cornell professor.  ",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "brianaugusta",
        "time": "3 September, 2022",
        "context": "Randy you are a partisan hack.  You can take that from a MAGA terrorist is how my president describes me ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Demosthenes2",
        "time": "3 September, 2022",
        "context": "Trump took the documents. That is a crime. Full stop.\nThe government asked for the documents back. Trump did not return ALL of them. That is a crime. Full stop.\nThe government asked again with a subpoena and AGAIN Trump did not return ALL of them. That is a crime. Full stop.\nThe government LAWFULLY following ALL DUE PROCESS OF LAW obtained a warrant and TOOK the documents Trump ILLEGALLY had. There is NOTHING WRONG with doing that. Full stop.\nAll of Trump's complaints and his supporters incessant lying and whining are lies and whining to deflect from Trump's irresponsible criminal misconduct. Full stop.\nDeal with it.",
        "good": "11",
        "bad": "9",
        "replies": []
    },
    {
        "user_name": "phil1295166",
        "time": "3 September, 2022",
        "context": "Let Comey and the FBI review the documents.  Trump would get off just like Hillary did.  ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mkelter2011",
        "time": "3 September, 2022",
        "context": "The Fourth Amendment reads: \"The right of the people to be secure in their persons, houses, papers, and effects, against unreasonable searches and seizures, shall not be violated, and no Warrants shall issue, but upon probable cause, supported by Oath or affirmation, and particularly describing the place to be searched, and the persons or things to be seized.\" \n\nSo the \"probable cause\" for this warrant is 50% redacted.  This is not what was intended in our Constitution.",
        "good": "188",
        "bad": "17",
        "replies": []
    },
    {
        "user_name": "ehol180",
        "time": "3 September, 2022",
        "context": "“Neutral and detatched judge” ahhhhahahahaha! 🤡",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "franzz",
        "time": "3 September, 2022",
        "context": "Nothing more than political persecution……..no government agency can be trusted……..to be fair , apolitical…….the deep state is entrenched in every facet….can not.go against them ….there is an agenda……",
        "good": "7",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "thevoiceinyourhead",
        "time": "3 September, 2022",
        "context": "The fbi raiding Trumps home is the \"red herring\".  The democrats need something as a distraction from their own sins before the November election.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "apple755",
        "time": "3 September, 2022",
        "context": "😂🤣🤣🤣🤣 who wrote this, the same communist Democratic, who wrote the Russian Collusion, priceless, the so call journalist today went to school at the Joseph Goebbels indoctrination school. None of them, have any credibility ",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "centralfloridamillennial",
        "time": "3 September, 2022",
        "context": "Trump will be indicted and charged shortly after the midterms",
        "good": "2",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "libsarepedos22",
        "time": "3 September, 2022",
        "context": "See that’s  cute. Parroting bill Barr",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "robstew500",
        "time": "3 September, 2022",
        "context": "wow fox isn't playing Trump's games anymore",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jmpi",
        "time": "3 September, 2022",
        "context": "An organization that hid evidence for both a presidntial smear and for Hunter and you see them as credible? Based on what? Some papers scattered on a floor somewhere with random cover sheets thrown into the mix? Oh! And their word! Right! Wonder what the chain of custody was for these uninventoried-when-seized docs...",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "john_cocteausten",
        "time": "3 September, 2022",
        "context": "The MAGA crowd continue to want to grant Trump special rights and privileges. This writer hits the nail on the head:\n\n\"Nowhere in the law is there a carve-out permitting a former president of the United States to avoid his residence being the subject of a search warrant. And the truth is, a search warrant, by its very nature, is a check on the power of the government to violate our rights as United States citizens to be free from unwarranted government intrusion into our personal space.\"",
        "good": "3",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "KhalDrogo207",
        "time": "3 September, 2022",
        "context": "“Search warrant was authorized by a neutral and detached Judge”….  This opinion piece was trash from the get go but when I reached that line I realized this was either purposeful ignorance or intellectual dishonesty either way the author is a 🤡",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Ancientdays810",
        "time": "3 September, 2022",
        "context": "The 4th Amendment protects one of the most important rights the colonists believed because it was the most Egregious violation they suffered at the hand of the British - Unlawful search and seizure at the hand of \"The General Warrant\". The British would arrive at their home with a warrant with NO specificity and take whatever they wanted. thus the language in the 4th Amendment guarding against \"The Genera Warrant\": \"and no Warrants shall issue, but upon probable cause, supported by Oath or affirmation, and particularly describing the place to be searched, and the persons or things to be seized.\"  The Mara-Lago search warrant was a \"GENERAL SEARCH WARRANT\" that described virtually no limits to what could be seized. \"Including Boxes \"Next to\" Boxes containing... and covering Trump's entire term as President as the only date limitation. The things they took (i.e. passport, attorney-client privileged documents) and the manner in which the search was conducted (The first Lady's under-ware drawer, really?) are all signs of an unrestricted search and thus unconstitutional.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "GoldDucky",
        "time": "3 September, 2022",
        "context": "A SPECIAL MASTER IS EXACTLY what is needed, because you can't trust a  CORRUPT DEMOCRAT run FBI and Justice Dept.!!!!!!",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "gamecop360",
        "time": "3 September, 2022",
        "context": "Yeah OK. POLITICALLY motivated. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "just4laughs",
        "time": "3 September, 2022",
        "context": "Fun Fact;\nThe Universities, Media and Socialists did the same thing in 1930s Germany ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "just4laughs",
        "time": "3 September, 2022",
        "context": "The same group that covered for Clinton and Biden are now prosecuting Trump ",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ja1970",
        "time": "3 September, 2022",
        "context": "Very good article….the Fourth Amendment part was informative and closes the door on the worthless complaints this was an “illegal raid”",
        "good": "3",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "tutu623659",
        "time": "3 September, 2022",
        "context": "Was it no longer legal that a President can legally declassify certain documents when leaving office?",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "shapeschiffter",
        "time": "3 September, 2022",
        "context": "Neutral and detached judge issued the warrant?  Really?  What is this guy smoking?",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "GoldDucky",
        "time": "3 September, 2022",
        "context": "OH,.....ONE OTHER THING!!!  If the FBI displayed classified documents in this staged photo, then they themselves are guilty of publishing classified material!!!!   If they weren't classified material or were declassified then the former President did nothing wrong!!!",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "GoldDucky",
        "time": "3 September, 2022",
        "context": "WHAT ABOUT, Clinton's 30,000 e-mails and classified documents that disappeared!!!   WHAT ABOUT the 30,000 documents obama sequestered and took from the White House!!!\nDEMOCRAT CORRUPTION....THAT'S WHAT!!!!",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ezezel334",
        "time": "3 September, 2022",
        "context": "What ignorant rube wrote this?  I bet this guy thinks WWE wrestling is real, too.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "just4laughs",
        "time": "3 September, 2022",
        "context": "Fun Fact:\nHillary stole more government documents by far and the same government covered for her.",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "columbo-djt",
        "time": "3 September, 2022",
        "context": "Mr Trump sir, I am a little confused. In 2016, when you were running for President you vowed to strictly \"enforce\" all laws regarding classified documents. You said we need the “best protection of classified information.” You went on to point out how service members have risked their lives to acquire classified information. You said, \"No one is above the law\". Why then did you hold on to national security secrets in your country club knowingly putting our national security at risk? Do the laws not apply to you?",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "livefreeordiehard123",
        "time": "3 September, 2022",
        "context": "One huge elephant in the room that the author missed. The judge in this case was not \"Neutral and Detached\" like the writer falsely claimed. \n\nThe judge who signed the search warrant was a huge documented supporter of the democratic party. This judge was biased and approved an unlawful search warrant based on partisan reasons.\n\nBetter luck next time. We have seen this show of corruption before- the 2 unjustified and unconstitutional impeachments of President Trump.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bak78",
        "time": "3 September, 2022",
        "context": "Only thing is, Dems pulled this stunt so many times they  exposed themselves and how our Government actually works, and it's, terrifying,  unlawful and corrupt through and through. YOU very people trying to reword RAIDING are scaring all America with your clever play on words - we don't like or trust you.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "lightfighter427",
        "time": "3 September, 2022",
        "context": "the person that wrote this article is full of it and assuming that the judge they found was neutral. how do we know? how often do we hear about some activist judge, usually liberal, doing some Highly Questionable things to say the least. more than I can remember and I have a long memory.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Senseandsensibility094",
        "time": "3 September, 2022",
        "context": "It isn’t about the documents.  It is about the partisan behavior of the DOJ and FBI.  Also a conflict of interest.  This is beyond ridiculous that people are unable to think clearly because their hatred and obsessions obscure any thinking. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bidenscribsheet",
        "time": "3 September, 2022",
        "context": "that judge or magistrate – who is \"neutral and detached,\" must be satisfied that...\nAnd...done. the judge who signed the warrant contributed to the Obama campaign. Therefore considered a donor to the party who has made countless attempts to discredit and impeach, imprison Trump. It doesn't matter how much was donated, the judge is no longer impartial and unbiased. No other President has been the target of such harassment, to date ALL of which has proved wrong and empty.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "backhomesc",
        "time": "3 September, 2022",
        "context": "The problem is documents don’t talk. They just lay there, the pesky, stubborn things, and refuse to say a word.  That is why masters have been used by courts forever to get neutral review of records in partnership breakups, contract disputes, copyright infringement cases and lots of other matters. So when heavily armed FBI thugs break into the home of the former president and political leader of half the country MAYBE it’s prudent to use a special master to see what the thugs took from his wife’s closet. You know, just to be sure everything is on the up and up.",
        "good": "4",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "myhousehaswheels",
        "time": "3 September, 2022",
        "context": "FOX doesn't know what to do\n  Support Trump -  Don't support Trump.\n\nheheheh - well, at least they admit it WASNT a RAID but a LEGAL Search Warrant",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "whambatt",
        "time": "3 September, 2022",
        "context": "“neutral and detached judge” this judge that issued the FBI warrant had recused him self from a Trump investigation! And the FBI has shown political bias! If a January 6th committee with no congressional recognition can be organized. Why not, transparently ",
        "good": "3",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "epictetus2022",
        "time": "3 September, 2022",
        "context": "I’m sure Trump violated the law; he’s reckless and I don’t care what happens to him.  However, do we really need three weeks of this garbage  on every morning show and nighttime news program?  The current president just spent upwards of a trillion dollars without authorization from congress and during a period of rampant inflation and my fellow citizens yawn.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "VoiceOfReason21025",
        "time": "3 September, 2022",
        "context": "The opinion is spot on. Trump is at fault here NO way to spin it. But they keep trying to.",
        "good": "6",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "myhousehaswheels",
        "time": "3 September, 2022",
        "context": "If Trump can't get a verdict from his OWN APPOINTED JUDGE\n\nWhat is this world coming to",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "All-Good-Names-R-Gone",
        "time": "3 September, 2022",
        "context": "Don is not going to be able to get a CEO or lawyer to be the Fall Guy this time.",
        "good": "3",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "demsoc.is.ingsoc",
        "time": "3 September, 2022",
        "context": "Randy Zelin, what you don’t take into consideration is that this man has been bullied by the government for purely political reasons for 6 years. Sure an IRS audit is a “process” to weed out cheaters, but how would you like one every year Randy? The impeachments, the hoaxes, all an attempt to make him quit or get him on a technicality have one purpose: to keep him from running for President.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "IMuteidiots",
        "time": "3 September, 2022",
        "context": "This reporter is a propagandist.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "BobbyD.016",
        "time": "3 September, 2022",
        "context": "An incredibly ignorant opinion. Just goes to show that years of education and obtaining knowledge can not necessarily give you wisdom. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ucanthandleit",
        "time": "3 September, 2022",
        "context": "The relationship between Trump and the GOP reminds me of a story about the scorpion and the frog, A scorpion asks a frog to carry him over a river. The frog is afraid of being stung, but the scorpion argues that if it did so, both would sink and the scorpion would drown. The frog then agrees, but midway across the river the scorpion does indeed sting the frog, dooming them both. Guess whos the scorpion?",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "pigpenmckernan212",
        "time": "3 September, 2022",
        "context": "Oh sure they do.  Unfortunately the Nazis have been trying to frame Trump for 7 years so anyone with a three digit IQ is holding their nose this time, too.  Plus, the DOJ leaks like a sieve.  What is the issue with a neutral observer unless their are things to hide?",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mydog'shumandaddy",
        "time": "3 September, 2022",
        "context": "The crazy part of all this is that there's a lot more classified information INSIDE HIS HEAD than what they recovered in physical form.....HE WAS THE PRESIDENT.......he knows stuff....he's seen stuff....he's been told stuff.....how are they going to get THAT back from him?",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "JuzMy2Sense",
        "time": "3 September, 2022",
        "context": "It’s not an opinion, it’s a necessity!",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "earnest-abe",
        "time": "3 September, 2022",
        "context": "There is no process to declassify documents.\nAll the president has to say is \"These are declassified\" and viola!  ",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "Graunchd",
        "time": "3 September, 2022",
        "context": "And if the warrant is approved on the basis of inaccurate, false info, by a biased judge...what then? And the \"evidence\" siezed was planted, or otherwise falsified....what then? The photo-op with the so called documents looked right out of some old Soviet Union show trial  where the outcome was preordained...",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "oilfieldgreasemonkey",
        "time": "3 September, 2022",
        "context": "Oh boy, Trumpers aren't going to like this article. 😆",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "brokegstring",
        "time": "3 September, 2022",
        "context": "\"Give him enough rope...\" leakers and informants will take it from there. Trumq's disadvantage, he loves to hear himself talk, his thought processes are remedial and infantile.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "centralfloridamillennial",
        "time": "3 September, 2022",
        "context": "Why is it all MAGA has is what about",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "Yeahsure873",
        "time": "3 September, 2022",
        "context": "Trump promised he would ensure the handling of classified material unlike Hillary. He then creates a law against the very thing he did!",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "readrevelations",
        "time": "3 September, 2022",
        "context": "The devils in the details!  Biden, look in the mirror and you will see who is \"the threat to our Soul\" as you have destroyed our once beautiful country and reputation. Your lack of leadership, being a puppet and just listening and doing whatever the left tells you, they control your every word. This speech said it all you have turned on your fellow countrymen, anyone that has a different view than your cronies do. You were all about uniting people when you campaigned! \n The evil liberals knew you were the perfect fit whom they would have full control over and get whatever they wanted, They have to stay focused on Trump with mind games aimed at anyone who is republican. He is the Deflector\". My prayer is all the republicans get out and VOTE all of you out.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "FinishHim",
        "time": "3 September, 2022",
        "context": "His entire argument in this article falls apart when he mentioned a “fair and impartial” judge. There has been too much evidence over the past 7 years of the Govt. NOT being either fair or impartial to suddenly trust them now. I wish it wasn’t true but I think I speak for many Conservatives who feel the Govt is completely corrupt and untrustworthy. I wish I didn’t feel this way but decades of deceit have destroyed my confidence in our Republic. ",
        "good": "87",
        "bad": "9",
        "replies": []
    },
    {
        "user_name": "ohmitysmiter",
        "time": "3 September, 2022",
        "context": "The problem is the scarcity of “neutral and detached” judges.  There has been a long downward spiral towards judges just being another form of politician…",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "icantusesocialmedia",
        "time": "3 September, 2022",
        "context": "\"Typically, these affidavits are kept secret, and for obvious reasons. Laws cannot effectively be enforced if the government cannot put its cases together in secrecy.\"\nThe writer is wrong here.  The Fourth amendment DOES protect against \". . . unreasonable search and seizure.\"  The key word here is \"unreasonable\".  And the government does not put its cases together in secrecy to enforce the law.  The affidavit is supposed to show the reason for the search, but the only reason that was not blacked out was that there were classified documents on the property.  Trump was already cooperating with the FBI and the archive people.  Trump's actions are totally transparent and the government's actions were not.  That is the classic definition of unreasonable.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "justmeagain915",
        "time": "3 September, 2022",
        "context": "IF is a huge word when it comes to the law.  How many times have we heard of prosecutors lying or hiding evidence?J  Plenty.  If you want to give up your rights then that's okay.  Me and most other people in this country want to keep them so we'll side with Trump having a Special Master.  Nothing wrong with asserting your rights no matter how long the DOJ or court of law has to wait.  The writer sounds like a far left liberal to me.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "sail4",
        "time": "3 September, 2022",
        "context": "OPINIONS OF A CIUB REPORTER\nVS\nCONSTITUTIONAL SCHOLARS AND PRACTICING HIGH POWERED LAWYERS\n\n......FBI LIED........\n\nBREAKING: The FBI affiant who swore to the Mar-a-Lago search warrant appears to have made a critical factual error by stating in the unsealed affidavit: “I do not believe that any spaces within the PREMISES have been authorized for the storage of classified information.” This finding, which is the linchpin of the criminal case vs. Trump, overlooks the fact that:\n\n\n1) White House records confirm that a Sensitive Compartmented Information Facility (SCIF) authorizing the briefing and storage of classified material up to the TS/SCI level had in fact been installed at Mar-a-Lago;\n\nWARRANT HAS MANY ISSUES THAT WILL DESTROY THE DOJ's FRAUD",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "KapmBob",
        "time": "3 September, 2022",
        "context": "Two names to remember, folks:  Hillary Clinton, and Sandy Berger.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bufordt",
        "time": "3 September, 2022",
        "context": "This writer along with several people who commented on here are all the willful ignorant sheep of America!  You all believe what the government tells you?  You believe what the media tells you?  Absolutely amazing how take what they say as truth when for the past 6 years heck 50 years everything they have told you and reported has been a lie.  And I still say the worst was the politicians receiving closed door hearings then turning around and going on TV and telling you the utter opposite!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "wilmerdicphit",
        "time": "3 September, 2022",
        "context": "it doesn't protect you when the government is corrupt. ",
        "good": "3",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "ralphkamdon",
        "time": "3 September, 2022",
        "context": "He was going to trade the secret documents for asylum in Russia.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Laserbuzz",
        "time": "3 September, 2022",
        "context": "You mean proof like the proof there was a Russia dossier?",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "justanothercomment830",
        "time": "3 September, 2022",
        "context": "Baloney. The FBI \"Taint Team' can't be trusted. Look at those FISA Warrants.  Further there there are more leaks of contents now than before the FBI raid. Neutral and detched judge who had to recuse himself from other issues realated to Dem. nonsense charges. \n\nThe picture is meaningless propaganda. And is also a violation of rights. \n\nPls tell the American public you had something more than a missing Top Secret Receipt for one of Melania's dresses for the phoney affidavit. \n\nRandy Zellin-Cornell Law? Another Obama political hack. Special Masters aren't an unusual request-happens all the time. \n\nThs purported Garland case will come down to a cardboard recycling violation.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mira3",
        "time": "3 September, 2022",
        "context": "The opinion of a Democrat shill. ",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "tortuga6",
        "time": "3 September, 2022",
        "context": "Well-written",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "reaper163",
        "time": "3 September, 2022",
        "context": "The liberals went from claiming there was nuclear codes to wild conspiracy theories about empty folders. What a bunch of nut jobs.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "paxamericana690",
        "time": "3 September, 2022",
        "context": "Nowhere is there a carve out for DEMOCRAT Secretary of State Hillary Clinton to take bleach-bit to her computer to obstruct a lawful subpoena. BUT SHE DID, and she was not prosecuted. Two bogus impeachments, two and a half years of bogus Russian collusion investigation, and a President who now says that if you are pro-life, pro-traditional marriage and believe that men are men and women are women, then you are an anti-American MAGA extremist. Pardon me if I am not impressed with how “normal” you find a criminal prosecution of a former President to be. ",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rightnow1238",
        "time": "3 September, 2022",
        "context": "One ingredient in this opinion is missing. The deep state is real. We have witnessed every effort to insure Trump wasn't and won't be effective in government. He was impugned and impeached for HIS ENTIRE PRESIDENCY. And this too has a reeking odor.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "wegotproblems",
        "time": "3 September, 2022",
        "context": "Forget your hate for a Minute and put yourself in this situation , having your house searched \n---------------   READ THE 4th  AMENDMENT ----------------------------------------------",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "golfkris",
        "time": "3 September, 2022",
        "context": "\"Let me just say, I think the driver on this from the beginning was loads of classified information sitting in Mar-a-Lago. People say this [raid] was unprecedented -- well, it's also unprecedented for a president to take all this classified information and put them in a country club, okay,\" sic Bill Barr Fox News interview.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Jimbo62873",
        "time": "3 September, 2022",
        "context": "Blah blah blah. A 6th grader can understand this is another desperate attempt to “get” Trump.",
        "good": "3",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "GoldDucky",
        "time": "3 September, 2022",
        "context": "democrats........THE OFFICIAL PARTY OF ...HATE.....DECEPTION.....AND......CORRUPTION!!!!\nON FULL DISPLAY today!!!!",
        "good": "5",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "DON'SFOXNATION",
        "time": "3 September, 2022",
        "context": "Re the doc picture, we know the FBI and DOJ are crooked, but Trump is still entitled to unbiased justice, not a Kangaroo court.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "tayninh67",
        "time": "3 September, 2022",
        "context": "Dont have a problem with a fair investigation of Trump. Just wish the same would be done with Hilary and Hunter. Get the truth out there on all of them",
        "good": "9",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "KeepFLRed190",
        "time": "3 September, 2022",
        "context": "Hey look everyone!  Bill Barr has a pet parrot!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "deathtoalldemocrats",
        "time": "3 September, 2022",
        "context": "The FBI has more than proven they can never be trusted again. They have been taken over by the DNC.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Yeahsure873",
        "time": "3 September, 2022",
        "context": "All those stolen classified documents are really making Trump look like a Russian mole 😱",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Minenotyours24me14u",
        "time": "3 September, 2022",
        "context": "what are they afraid of?\nthe master would just validate their findings right?\nliberals are the most insecure people I've ever known.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "clear-as-a-bell",
        "time": "3 September, 2022",
        "context": "It sounds like opinion, whether he has bias or not. I don't know. But he can't decide Trump had \"nefarious\" intentions. The rule of law doesn't come from a law professor's opinion. And this guy isn't a mind reader. \n\nHe sounds bias in his assumptions, but I am not a mind reader either. We used to have a principle of innocent until proven guilty in a court of law. And convictions we're based on actions not on intent.  That principle went out with people being convicted on media and social media. Give me the old days.",
        "good": "120",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "cherokeepatriot844",
        "time": "3 September, 2022",
        "context": "This guy is definitely a liberal",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tehrdbl655",
        "time": "3 September, 2022",
        "context": "Don't trust a politicized DOJ and FBI.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "LR69",
        "time": "3 September, 2022",
        "context": "We will ever know what Obama and Hillary still have. ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jmmul123",
        "time": "3 September, 2022",
        "context": "Trump is a carnival barker....a really good one....but one none the less. \n\nThat makes his followers rubes.",
        "good": "3",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "tallgrass",
        "time": "3 September, 2022",
        "context": "So then why did the National Archives release these super top secret docs to Trump in first place? Wouldn't the Archive Administration be the baddies?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "billyjackoil",
        "time": "3 September, 2022",
        "context": "Trump should be burned at the stake for the blasphemy of calling the government deity of the \"woke again\" evil and corrupt.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mrsolution",
        "time": "3 September, 2022",
        "context": "Applying common sense --- For the past 6 years democrats and DOJ/FBI have been trying to find something, anything on Trump. To the extent of lying to the courts and of course, the public. Anyone thinking Trump would not be cautious with every move at this point just isn't thinking. \nAnd the magistrate was biased.",
        "good": "9",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "Re-normalizing",
        "time": "3 September, 2022",
        "context": "No one is questioning whether a search warrant is constitutional. But they question whether THIS search warrant was warranted! \n\n“A search warrant was executed on a residence which just happened to be that of a former president…” …who just happens to be the current President’s likely challenger. Don’t be naive.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "BIDENISAPUPPET0321",
        "time": "3 September, 2022",
        "context": "A corrupt FBI serving a search warrant which has no legal basis is in no way a protection of Trump's rights much less John Q public. Who let this hack in the door....maybe Fox is trying to get the former viewers of CNN.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Lincoln'sParty",
        "time": "3 September, 2022",
        "context": "Mr. Zelin, \"unbiased and detached judge\" you clearly have no business writing and have no idea how to be objective.  Do your research before you start typing.  CNN has openings now....you should apply.. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "morgan436",
        "time": "3 September, 2022",
        "context": "If the judge is making a bad decision, the search warrant does not mean the search was reasonable.   A more honest decision would be to enforce the affidavit given it was a former president that had the authority to read every document in his house legally.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "buhbyedon714",
        "time": "3 September, 2022",
        "context": "\"Hey Vladimir.\"  Got some interesting docs to show you.  You want to know who's been telling us about your troop positions?  Yeah, I got it right here.\"",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Yeahsure873",
        "time": "3 September, 2022",
        "context": "Wonder who got all the classified material from the empty folders? Could Melania be selling them? Is she a foreign plant???",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "57channels",
        "time": "3 September, 2022",
        "context": "That’s it.! I’m going to Truth Social, OAN and Newsmax for my “fair and balanced” reporting. Fox is making it sound like Fearless Leader could be g...g...g.......guilty of something.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "buhbyedon714",
        "time": "3 September, 2022",
        "context": "\"Hey Sultan, how's it hanging?  Thanks for the $2 Billion, glad we could work together.\"",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "lcocks",
        "time": "3 September, 2022",
        "context": "So when will we see a raid on Obamas mansion?  Or Clinton’s?  Based on you op-ed it would be an important thing to do in order to support the constitution. It would be an obligation, in order to protect Bill, Hillary, Barry, and Michael!\nAnd have you been given access to read “the documents”?  Of course not. So you have no knowledge that these “documents” give any justification to a middle of the night raid on the private residence of a former president. \nAnd what was in Melania’s closet that required a constitutional search?  Lingerie?  Evening gown.\nSeek medical help. You are deranged.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "policiesmatter",
        "time": "3 September, 2022",
        "context": "This is a dead issue until Hillary is cuffed, prosecuted and behind bars.\n\nThis is a dead issue until Hunter Biden is cuffed, prosecuted and behind bars.\n\nThis is a dead issue until Eric Swolwrll  is cuffed, prosecuted and behind bars.\n\nObama also took documents from the White House.  If you recall, he ordered documents of his administration sealed as though he owned them.  So, how are his documents his and yet Trump’s documents belong to the government?",
        "good": "4",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "KeepFLRed190",
        "time": "3 September, 2022",
        "context": "Fox News is letting their inner Liz Cheney show….",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Arch_Vile",
        "time": "3 September, 2022",
        "context": "That affidavit has just about as many redactions as a Obama birth certificate. And we can’t even see it. Transparency.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "sothankful97",
        "time": "3 September, 2022",
        "context": "It’s worth noting the author is an adjunct from Cornell, need I say anymore??",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jen1976",
        "time": "3 September, 2022",
        "context": "how came Hillary can have the same thing on her computer that was hacked with no consequences?  dems think Hillary lost because of documents so they think trump will to... but after all their shameful lies and impeachment it obvious a witchhunt which drives his base more.   I'm so tired of this. ",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "cranefrompa",
        "time": "3 September, 2022",
        "context": "So they had top secret documents at Trump's home?  What's the problem?  Who could have possibly stolen them?  Trump's guests?\n\nOr...\n\n\"The club got permission to hire 87 foreign waiters, cooks and housekeepers for the season that began last fall and ended this spring. The company has asked to hire 92 more to start in October. A spokeswoman for the Trump Organization did not respond to a question about how foreign workers are vetted.\"\n\nSo unvetted foreigners.  Okay.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Speed17",
        "time": "3 September, 2022",
        "context": "just like the FISA warrant was legally obtained. HA! Based on the ceaseless false pretense attacks on Prs Trump from the congress and MSM,  this warrant smells of a Republican DOJ lead fishing expedition.  \nWithout the special master, we're forced to take the word of the Republicans once again that will hold this over Trump, that they have the \"smoking gun\" with a false scenario that they can't disclose due \"national security \"  but never make any official charge, trying him only in the court of public opinion. \nThey have done this throughout his presidency,  and have a proven track record of creating false evidence, so why should we suddenly trust them.\nTrust the same DOJ that considers concerned Parents domestic terrorists? ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jimbopoppy",
        "time": "3 September, 2022",
        "context": "Trust the same FBI that has Hunters laptop and 51 former intelligence officials that said it was Russian propaganda?  The same FBI that gave Facebook a heads up on false information coming out?  We should question our government and demand transparency and not blindly follow",
        "good": "9",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Dead😵Tsunami🌊",
        "time": "3 September, 2022",
        "context": "Need to search coffin by sand trap",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "patriotmaga#wwg1wga",
        "time": "3 September, 2022",
        "context": "Why would Fox publish this?  It’s trying to make TRUMP look bad.\n\nMAGA",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Icescrewu",
        "time": "3 September, 2022",
        "context": "Sure they do.........🙄",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "theyareallmine",
        "time": "3 September, 2022",
        "context": "Trump says he wouldn't lose any supporters for shooting a man on 5th Avenue. Do those supporters want to stick by him if he's selling nuclear secrets to foreigners?",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "tca596",
        "time": "3 September, 2022",
        "context": "Those aren’t documents they are folders. At least 50 of them were empty. What happened to integrity?!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Kodon",
        "time": "3 September, 2022",
        "context": "Ok that’s fine then let’s do the same for Hunter Biden and the Clintons!! Fair is fair! Stop being one sided and let’s all see the truth! Remember what Pelosi and Biden said NO OnE is ABOVE the LAW! Now that’s funny!!!",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "iowapd",
        "time": "3 September, 2022",
        "context": "\"And the truth is, a search warrant, by its very nature, is a check on the power of the government to violate our rights as United States citizens to be free from unwarranted government intrusion into our personal space.\"\n\nB.S.  Why was FBI Lawyer Clinesmith fired and convicted of false statements on the Russia search warrant.  Not to mention Peter Strzok and his honey. \n\nThe above quote ONLY applies when it was done legally in the first place.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "blkchwill",
        "time": "3 September, 2022",
        "context": "I wish the same scrutiny would be applied to the other side! The mother load of deception could then be exposed!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "zarikk",
        "time": "3 September, 2022",
        "context": "Half of you deplorables are saying the FBI planted the classified documents, and the other half is saying Trump declassified the documents? Which is it? Maybe you deplorables should talk amongst yourselves first, then return to the forum with the same lie.",
        "good": "3",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "tca596",
        "time": "3 September, 2022",
        "context": "I don’t hear anyone  questioning the fbi about the difference between this and Hillary and Obama!",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "abcdepuppy",
        "time": "3 September, 2022",
        "context": "Hmmm... had never heard of a \"special master\" until all this arose. If the term were used for a dim, would it be changed due to the connotation of the phrase? When the majority changes, will the opposition observe the same rules that they imposed on the previous minority? Probably not.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ragcpa66",
        "time": "3 September, 2022",
        "context": "What this incompetent doesn’t understand is none of these are classified. The President is the sole decider on classification and he indicated he declassified them. Case law here with Judicial watch and Former President Clinton. The fact that Fox allows judicial incompetence as a one sided opinion tells us how far and biased they have become. I guess I need to delete the app",
        "good": "3",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "sobbeger",
        "time": "3 September, 2022",
        "context": "You mean those Top Secret documents that some fbi hack threw across the floor and then snapped a pic of? Is that the official procedure for handling Top Secret documents? Seems more like a photo op to me.",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "paxamericana690",
        "time": "3 September, 2022",
        "context": "Randy Zelig is an apologist for the regime. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dhbarr624",
        "time": "3 September, 2022",
        "context": "We are supposed to just ignore the proven fact that the DOJ and FBI have altered documents and lied to courts in the past regarding Trump?   The idea that the Government is justified redacting the affidavit is laughable on its face -- this isn't a case against some drug lord who might try to assassinate witnesses, this is a dispute between Trump and the National Archives over which documents are personal and which must be archived.   A case ruled by current precedent set in 2013 over the Bill Clinton tapes in which a federal judge ruled that the former president is the sole arbiter of what is personal.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "edwardthefirst",
        "time": "3 September, 2022",
        "context": "Why are all the liberals fighting this appointment.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sgtk",
        "time": "3 September, 2022",
        "context": "Nothing political here,  right?  🥴",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Punkn",
        "time": "3 September, 2022",
        "context": "Randy, please get help for your TDS…",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "deplorablekiwi",
        "time": "3 September, 2022",
        "context": "Hey Zelig why don’t you start at the fact that the document  Covers are from the FBI, and there is plenty of first hand accounts that the FBI put the covers and staged them on the floor. Trump never leaves anything in a mess, his office did not house any of those docs either. It was purely for public damage, The kicker, everyone else at FOX except you, know this too.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tallgrass",
        "time": "3 September, 2022",
        "context": "And why are these photos of \"secret\" docs on the floor shown all over the news outlets if they are supposed to be secret and protected?",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "imisstrump327",
        "time": "3 September, 2022",
        "context": "The author is a democrat operative. End of credibility. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "truthtell",
        "time": "3 September, 2022",
        "context": "An accurate factual article.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "buhbyedon714",
        "time": "3 September, 2022",
        "context": "The knowledge is beginning to sink in that Trump has committed executable crimes.",
        "good": "5",
        "bad": "7",
        "replies": []
    },
    {
        "user_name": "‘Ole/no.7",
        "time": "3 September, 2022",
        "context": "He can put his opinions where the sun don’t shine (incidentally where they came from)",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "libservative074",
        "time": "3 September, 2022",
        "context": "“What?! I declassified all of those top secret documents back when I was POTUS. You all didn’t get the memo?”",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Christmasguy",
        "time": "3 September, 2022",
        "context": "Opinion piece. Not real news investigation ",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sniffydementia2022",
        "time": "3 September, 2022",
        "context": "The real distractions are the fraudulent FBI raid and Jan 6th TDS hearings ",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "CATSGOFOR9",
        "time": "3 September, 2022",
        "context": "I hear from a reliable source (Facebook) that the FBI had a hard time getting ketchup stains off the documents",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "apubesworstnightmare",
        "time": "3 September, 2022",
        "context": "As always the cult caught with their pants down after everyone else went home.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "maddoogg",
        "time": "3 September, 2022",
        "context": "The Swamp will stoop to any level to discredit Trump.  Keep watching, it isn't over yet.",
        "good": "4",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "FactsandBalanced",
        "time": "3 September, 2022",
        "context": "Within a week of the FBI search of former President Donald Trump's Mar-a-Lago resort, former White House chief of staff Mark Meadows handed over texts and emails to the National Archives that he had not previously turned over from his time in the administration. \nThe end is near as more and more people come clean to save themselves.",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "apubesworstnightmare",
        "time": "3 September, 2022",
        "context": "The rats finally have a excuse to jump off the sinking ship but his enablers won't be forgotten on election day.",
        "good": "1",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "eli56",
        "time": "3 September, 2022",
        "context": "He said an unbiased and neutral judge. There are many of those judges until pictures and money show up then they get to change their minds. Ask Epstein about that, oh hes dead.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dondenson",
        "time": "3 September, 2022",
        "context": "Typical modern day American professor... common sense of a bowl of soup ",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "cplklegg",
        "time": "3 September, 2022",
        "context": "To all of those who buy the bogus claim that Trump declassified the documents involved I ask this: why did Trump keep it top secret that he had declassified the top secret documents until after the FBI had seized them?",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "CrayZdaz",
        "time": "3 September, 2022",
        "context": "I am definitely a conservative and yes I voted for Trump but this is really bad, taking these documents was wrong by any definition and what he has done could dramatically hurt the upcoming elections as well as 2024 elections.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "reverenddoctor804",
        "time": "3 September, 2022",
        "context": "The author of the article is a Cornell lawyer but doesn’t know anything about classified documents. The President has ultimate and instantaneous authority to declassify per the existing Executive Orders. The Executive Orders do not specify any requirements for the process or the notifications. Even if this issue goes to trial, the fact that a Presidential declassification process is not written down will exonerate Trump. If there is no process to follow, there can be no violation of process. ",
        "good": "22",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "boris25",
        "time": "3 September, 2022",
        "context": "I guess I’m confused. The latest report states “ 50 of the classified folders taken by the FBI were empty “ . So is having an empty classified folder a crime? Also, as President didn’t Trump have the authority to declassify any and all documents he wanted  to declassify? Did President Trump have a “ declassified stamp” he carried around with him so he could stamp the documents so there wouldn’t be any confusion by the FBI or DOJ? Why is asking for an independent review of the documents a “ distraction “? If the FBI & DOJ were in the right, why would they oppose the appointment?  Just wondering?",
        "good": "42",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "ichabodamerica692",
        "time": "3 September, 2022",
        "context": "How can Randy, the uninformed, politically biased, and someone who knows nothing about what documents were found or what they say, say that \"the documents speak for themselves\"? Has he seen and read them all, does he have all the facts? The answer is NO!, this this \"opinion piece\" is nothing other that DISINFORMATION and PROPAGANDA by a Democrat hack.\nRandy, write about something yo have actual knowledge of, like say Game of Thrones, or the \"trans\" issue......",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "apubesworstnightmare",
        "time": "3 September, 2022",
        "context": "Last maga rally will any terrorists attend, I'm sure the fbi will have facial recognition cameras to catch the last of the insurrectionists.",
        "good": "3",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "jimwymr64",
        "time": "3 September, 2022",
        "context": "“Randy Zelin is an adjunct professor of law at Cornell Law School and a noted trial attorney with a concentration in white collar criminal defense as well as complex civil litigation matters.” And an avowed leftist who hates Trump. His opinion is worthless.",
        "good": "7",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "DK24",
        "time": "3 September, 2022",
        "context": "There’s no possible way that a judge could have political leanings of their own and sign a search warrant based on those feelings about the owner of the property being searched….\n\nRiiiiiiiiiiight……\n\nThe Constitution means NOTHING to democrats. ",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "ontheotherhand405",
        "time": "3 September, 2022",
        "context": "If you completely stand by the 2nd Amendment without alterations, read the other ones because you have to accept them too",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "BRight374",
        "time": "3 September, 2022",
        "context": "When did Fox News start censoring posting? When they are written within the standards they set. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "pman68",
        "time": "3 September, 2022",
        "context": "The DOJ has found that President Trump let the extended warranty on “The Beast” expire. Garland quoted as saying, “we’ve got him now.”",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "kremmer9999",
        "time": "3 September, 2022",
        "context": "Maybe today's the day Trump tells us exactly why he kept those documents. What were his intentions?",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "discipilesofiron235",
        "time": "3 September, 2022",
        "context": "What a shame and embarrassment the USA has become attacking the former president while ignoring for decades all the crimes the Clintons and other Democrats have performed. These politics reminds me of the documentary I just seen on TV leading up to WWI between all the monarchs in Europe trying to retain power.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "whatsmorelikely",
        "time": "3 September, 2022",
        "context": "The question has nothing to do with documents and everything to do with probable cause.  Probable cause requires a crime with a statute is about to be committed, is being committed or was committed.  Without this, the raid was a violation of Trumps 4th, 6th, 8th and 14th Amendments.  With that established, everyone at DOJ/FBI can be charged with violating 18 US 241 and 18 US 242.  Conspiracy to violate rights and violating rights under the color of law.  The documents were already declassified.  Nobody cares about the documents.",
        "good": "3",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "Curmudgeon",
        "time": "3 September, 2022",
        "context": "After the Mueller fake investigation, why would Trump not look for an honest mediator?",
        "good": "14",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "iowapd",
        "time": "3 September, 2022",
        "context": "A search warrant in this case was likely not really hard to get, you don't have to prove guilt.  When you get a search warrant for a regular citizen and say you are looking for a motorcycle.  In that case, you can't look in a lock box, for instance because a motorcycle won't fit in it. In this case, they were looking for documents so it gave them carte blanche to look at everything, including privileged documents. That is what they were doing, so unlike the Watergate burglars, they burglarized Trump under the color of law.  A shame we can't trust the upper level FBI but they have brought it on themselves.",
        "good": "166",
        "bad": "19",
        "replies": []
    },
    {
        "user_name": "vandriver",
        "time": "3 September, 2022",
        "context": "Let me see if I can guess this opinion it's bias....",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jimmyc1965625",
        "time": "3 September, 2022",
        "context": "I'm having a hard time accepting that the same demographic which fell for the scams of Jim Baker, Jerry Falwell & Sons, Jimmy Swaggart, etc., etc. also got taken in by Bonespurs. \nI always figured they were great judges of character",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "libservative074",
        "time": "3 September, 2022",
        "context": "Why on earth did Donald Trump need top secret documents at his personal residence when he is no longer POTUS?\n\nWhy on earth didn’t he simply give all of these documents back to the government upon their initial request?\n\nWhy on earth would the POTUS have a “standing order” to declassify top secret documents that were brought to his personal residence?\n\nWhy on earth are these seemingly difficult questions for Trump supporters to ask themselves?",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "theunforgiving",
        "time": "3 September, 2022",
        "context": "The documents DO NOT speak for themselves.  What was the subject matter of the documents?  Seems to me like planted evidence.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "RetiredLEO(itsgoodtobegone)",
        "time": "3 September, 2022",
        "context": "A profoundly stated argument. \nWho could argue with such enlightened concluding insights such as “….documents are what they are and “What will be, will be.”  Nothing unique about this warrant (except that such a warrant has never been served on an ex-president of the United States, in the history of the US) except that there is no established legal precedent for such a search on an ex-President’s home.  And how can one classify the execution of a search warrant as a raid?  Its not like federal agents armed with weapons of war (to use the vernacular associated with our liberal friends), on property guarded by other federal agents, (Secret Service) oh wait, yes they were.  \nSo please explain to this simple minded citizen, how the alledged most transparent administration on history, guided by diverse, inclusive and non-biased values can effectively argue that there is nothing to see here?  Feel free to “redact” or omit language you feel is detrimental to your position, I’m sure you are familiar ith that process. \nThe only “Special Master” needed is what we are currently experiencing with our current President. ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mtak995379",
        "time": "3 September, 2022",
        "context": "I only ask that the law be applied to all equally.  Hillary should have been investigated.",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tallgrass",
        "time": "3 September, 2022",
        "context": "FBI should not focus on receiver of said docs but the SENDER. National Archive released and sent docs out. GUILTY PARTY archive administrator.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dre2078",
        "time": "3 September, 2022",
        "context": "I’m sure that the list of classified documents that Hillary was keeping on her unsecured email server connected to the internet making them available to every hostile nation on the planet would speak for itself too, but we’re not allowed to see that list due to Democrat criminal corruption. ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "moderationisthekey",
        "time": "3 September, 2022",
        "context": "The cult will be most displeased by this article. One must never speak ill of Dear Leader. He is all knowing and everyone loves him. ",
        "good": "2",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "TrumpL’oie",
        "time": "3 September, 2022",
        "context": "A major advantage of Fox News is that Trump supporters don’t have to read about the most troubling aspects of the stolen government documents.  Like the almost 50 government folders that were found empty.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "demswillwin",
        "time": "3 September, 2022",
        "context": "A lot is not being revealed by DOJ. They are protecting agents and informants that would be revealed in the documents. They are trying to get these people to safety because Trump in selling the secrets to the Russians and Iranians for big dollars has put these people in danger. DOJ cares about these Americans and foreign nationals who supplied top secret info. Trump on the other hand is out for a quick buck.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "BlueRing",
        "time": "3 September, 2022",
        "context": "\"Trump talk of ‘special master’ a distraction. Documents speak for themselves.\"\n\nIt's not the documents that \"speak for themselves\", it's the factless accusations going back to 2016 by TDS liberal extremists that speak for themselves. As of right now, the track record of the America-hating Democrat Machine is:\n\nTrump Accusations: countless\nSupporting Facts: Zero",
        "good": "7",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "brokegstring",
        "time": "3 September, 2022",
        "context": "Have they no shame? They even confiscated Trumq's birth certificate! He's frantically communicating with the Kenyan government seeking a duplicate copy.",
        "good": "0",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "All-Good-Names-R-Gone",
        "time": "3 September, 2022",
        "context": "Maybe Don will get his story straight for the folks at the rally tonight.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "YouDon'tKnow",
        "time": "3 September, 2022",
        "context": "What's really scary about this is, everyone knows the FBI is compromised. One politically biased agent has been put out to pasture. These agents are reading top secret and personal documents not meant for them. Any information they gain will be weaponized or used for profit. Nothing going on in the democrat regime is used to benefit American citizens. Everything is a weapon.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rikker4",
        "time": "3 September, 2022",
        "context": "If Trump's attorneys were smart, they'd be seeking a plea deal right about now.",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "beautifuldragonfly",
        "time": "3 September, 2022",
        "context": "Midterms!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "medicpride230",
        "time": "3 September, 2022",
        "context": "So, we’re just going to ignore the fact that Hillary got off completely? Illegally had a separate server to deliberately avoid oversight and then when the server was subpoenaed, it was wiped clean along with multiple smashed handheld devices. The law is not equal ",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "estebang",
        "time": "3 September, 2022",
        "context": "A tyrannical government can authorize anything it wants with a jumble of legal jargon and make it look legitimate \"because we say so.\"  Given the sheer volume of redactions in the warrant, no competent adult can rationalize the acts committed against the former president.",
        "good": "4",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "nvysqdrn286",
        "time": "3 September, 2022",
        "context": "I keep going back to the Carter Paige warrant issued by a \"detached\" judge in which the FBI under oath said that they had probable cause to believe Paige had committed crimes.  Their probable cause was based on the Steele dossier which the FBI knew at the time was fake evidence!!  Paige is still suing the federal government.  We have major problems with our legal system, the FBI and the DOJ.",
        "good": "22",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "jmhauser99",
        "time": "3 September, 2022",
        "context": "This so-called \"law professor\" needs to read the Fourth Amendment.  General warrants are illegal.  If you are in his class, you should change to a different professor.",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Columbusmoose.",
        "time": "3 September, 2022",
        "context": "For 5 years I’ve watch dozen of false accusations against president trump drop by the wayside. Untill I see proof of a major crime, I’m giving him the benefit of the doubt, and I encourage everyone to do the same, and vote your wallet",
        "good": "15",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "rhbear",
        "time": "3 September, 2022",
        "context": "He told you what you wanted to hear.\nThat's on HIM.\nYou still believe.\nThat's on YOU.\nEnough.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Yeah,So?",
        "time": "3 September, 2022",
        "context": "Actually the raid on Trumps home is the distraction away from the LIBS horrible record and a Prez with historically low ratings.",
        "good": "8",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "Even.Less.Intelligent.Than.Expected_(ELITE)",
        "time": "3 September, 2022",
        "context": "When you hire a professor to write an opinion piece, this is what you get . . . a lecture.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "karenjost",
        "time": "3 September, 2022",
        "context": "The problem is that a \"neutral\" judge was not neutral.  Politics have so permeated our society that in the case of Trump there was no neutrality.  A biased judge signed the warrant, which was vague in what was being searched for.  Anything and everything that \"might\" be something we can use to make Trump look bad is not a legal basis for a warrant.  Then the FBI and DOJ looked through all the documents, and I'm sure copied, even ones they legally should not have, before anything could be done to stop them.  Trump asking for a neutral special master came too late.  When it comes to Donald Trump he does not get legal process under the constitution.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "MisfitToyz",
        "time": "3 September, 2022",
        "context": "The bias from this author is evident. The government overstepped here to secure a warrant to search. Yes agreed the former President had classified documents in his possession. But the FBI went on fishing expedition beyond the limited scope of the search to seize personal items and other items including clothing and newspaper articles, etc.  That had zero relevance to the classified documents. If In fact he was guilty of noncompliance with the National Archives Agency like so many of his predecessors. Then they (DOJ and their Feeb henchmen) could have used less sensational and intrusive methods to recover said documents including the dozens of classified envelopes with nothing inside of them. The government can’t use their powers to request a search warrant in search of crime without probable cause. This a  planned distraction to muddy the waters before the bloodbath coming in November when the Republicans take back the House and Senate. Most people see through this overreaching stunt by the corrupt upper echelons of the DOJ and FBI with influence from the people running the White House.  If those documents were so sensitive then thy did this regime wait so long to retrieve them. ",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "dirkbroadcloth",
        "time": "3 September, 2022",
        "context": "They took Melania's children's books, Cat in the Hat is now semi-fascist?",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "FactsandBalanced",
        "time": "3 September, 2022",
        "context": "A very informative article. Over the past week I've begun to see a shift in the reporting on this site. Distancing itself from Trump is a wise move by Fox News. Don't fret, over time you will accept the fact you were conned by \"Don the Con\" and the tens of thousands of lies he has told you.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Critter612",
        "time": "3 September, 2022",
        "context": "I think the operative words here are “that judge or magistrate – who is \"neutral and detached”",
        "good": "4",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "justsayingitnow1",
        "time": "3 September, 2022",
        "context": "says another never Trumper",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "iamnotadiseasevector",
        "time": "3 September, 2022",
        "context": "The judge wasn’t neutral lol",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "centralfloridamillennial",
        "time": "3 September, 2022",
        "context": "Garland needs to seat a Federal Grand Jury and have Trump testify as where the missing documents are",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "GWashingtonVigilance",
        "time": "3 September, 2022",
        "context": "The Government found 48 EMPTY Classified Document Folders at Mara Lago.\n\nWhat did the Flusher in Chief do with those 48 CLASSIFIED GOVERNMENT DOCUMENTS?\n\nThis latest revelation is in addition to the Classified Documents TRUMP Stole, Lied About and Concealed from the Federal Government.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "eneres_fonaed",
        "time": "3 September, 2022",
        "context": "What's really funny is most of the docs the FBI found are empty folders and they are frantically looking for things to put into them and make things look legit !!!",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "TrumpL’oie",
        "time": "3 September, 2022",
        "context": "I didn’t even know I had them\nI declassified them\nThey’re mine\nSomebody else packed them\nThey’re all locked up\nI gave you everything I had\nYou should have just asked for them\nNobody had access to them\nI’m writing my memoir\nBut Obama",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dog63",
        "time": "3 September, 2022",
        "context": "Ok Randy, i think we can consider you a Democrat with a bad case of TDS.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dcrash275",
        "time": "3 September, 2022",
        "context": "It doesn't matter. It's over. The FBI and DOJ are compromised.  They have nothing. Trump will rock 2024.",
        "good": "3",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "jaquas",
        "time": "3 September, 2022",
        "context": "Let me see...FBI has had HUNTER'S lap top almost three years and still hasn't released contents, Epstein and Maxwell's little black book and flight logs,  Hunter's financial records...list goes on.  Yet Raid Trump's home and throw papers all over the floor for political public perception after a couple weeks.  Why not raid a few other ex-POTUS homes and see what we find.   And throw HILLARY'S DEEP STATE shenanigans in the mix also.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "uvw",
        "time": "3 September, 2022",
        "context": "No. Trump is entitled to a disinterested third party to oversee this dispute. I would not trust the\nFBI and DOJ as far as I can throw the Statue of Liberty. How hard is it for the government to add or remove a piece of paper if their goal is to destroy Trump.",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "keitje",
        "time": "3 September, 2022",
        "context": "This guy should be on cnn",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "areaman103",
        "time": "3 September, 2022",
        "context": "Assign the \"Special Master\" - so what if it's a distraction. That can only be determined after the review and it's obvious that the federal agencies are compromised and corrupted.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "truthisnotfact",
        "time": "3 September, 2022",
        "context": "Bill Barr nailed it. If Trumps lie about blanket declassification is true, then he recklessly put US interests at risk by waving a wand of declassification over unreviewed and unredacted documents. Who knows who walked off with what.  By law thes documents would be public as is. Next week is lie number 3. He had no idea he had them.",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "ladatwork",
        "time": "3 September, 2022",
        "context": "If the documents \"are what they are\" then what's the issue with the special master? The issue is that Randy Zelin is a lair. He's trying to justify the Governemnt's actions using the the Constitution inspite of the fact that the 4th Ammendment was violated. Zelin claims the judge is impartial. In who's court?",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "mugzy",
        "time": "3 September, 2022",
        "context": "All I know is that Joe now sleeps with Melanias undies under his pillow. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "JohninDE",
        "time": "3 September, 2022",
        "context": "These types of documents could have been found at any ex president's house and Hillary Clinton's and yet they weren't raided the requestion here is why was there a raid on Trump only.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "epg'74",
        "time": "3 September, 2022",
        "context": "Where was the raid on Hillary's residence? Where's Hunter's laptop? We say no more..........",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "eddiet191",
        "time": "3 September, 2022",
        "context": "Typical MAGATS! Always run their mouths until a subpoena/deposition",
        "good": "3",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "individualismvscollectivism",
        "time": "5 September, 2022",
        "context": "How much money did the author get for this story?",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "grinnedreaper775",
        "time": "5 September, 2022",
        "context": "The \" Special Master\", must be Viewed as the First Change in the FBI /DOJ overhaul that's coming. They have abused their power ,and the Tyranny has to be Stopped. Major investigation is needed before people feel their justice system  is fair and unbiased again.",
        "good": "2",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "MAGA_Buttplugs_Hate_America🇺🇸",
        "time": "5 September, 2022",
        "context": "The public deserves full transparency: the trial must be streamed live.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "proudamerican803",
        "time": "5 September, 2022",
        "context": "I think it's just another witch hunt. ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "usa_weekendwarrior",
        "time": "5 September, 2022",
        "context": "magistrate – who is \"neutral and detached,\" \n\nWhy did the same magistrate months earlier claim conflict of interest in a Trump/Hillary issue?",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "dwkent349",
        "time": "5 September, 2022",
        "context": "So, we do not have the rights of Hillary Clinton or Comey? Since we are republicans and not part of the the elite establishment or the third estate we will be prosecuted to the fullest extent possible. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "gem048",
        "time": "5 September, 2022",
        "context": "Typical Marxist who twists the Constitution with lies and propaganda.  General Warrants are not in amendment IV....that is the point of the IV amendment.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "wendykroy",
        "time": "5 September, 2022",
        "context": "Right now, the ex-president of the United States is being turned down by some of the best lawyers.  There are 2 reasons lawyers turn down people.  One - the case is uphill and probably not winnable.  Two - the client has a long history of stiffing lawyers.\nTrump has BOTH of those issues, and thus is surrounded by flunky lawyers.",
        "good": "5",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "FJRB",
        "time": "6 September, 2022",
        "context": "Bottom line there was a raid based upon fabricated data which now turns out to be false, just like the fake Russia investigation.  At what point does America say enough.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "4katydid",
        "time": "5 September, 2022",
        "context": "BTW:  the definition of Unconstitutional is not \" Anything Trump doesn't like.\"",
        "good": "9",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "tohan12",
        "time": "5 September, 2022",
        "context": "FBI and DOJ are corrupt to the bone and everything they try to do to Trump has to be scrutinized by a special master. This is not negotiable.",
        "good": "3",
        "bad": "9",
        "replies": []
    },
    {
        "user_name": "liberty311550",
        "time": "6 September, 2022",
        "context": "Not according to a federal judge. Donald Trump is the sole arbiter on what is his and what is the government's documents. He was also the sole arbiter on what was classified and what was not in his administration. Anything the president took with him -- like all presidents before -- is not classified.\nSo in summary, the search warrant was invalid for lack of a crime to investigate.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "patriotperson",
        "time": "5 September, 2022",
        "context": "If the FBI isn't crooked why do they try to silence Trump while leaking to news medias?",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "NoNSNListed",
        "time": "5 September, 2022",
        "context": "He's a lawyer--he just isn't very good at it.  At the end of the day the only real question is this: were those documents still classified?  The president says he declassified them, and he had the authority to do so.  He can be accused of sloppiness by not getting rid of folders or marking declassification dates, but he doesn't have to do that.  Pretty simple when you think about it.  ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "MAGA_Buttplugs_Hate_America🇺🇸",
        "time": "5 September, 2022",
        "context": "Tax cheaters attack the IRS. \nCriminals attack the FBI.",
        "good": "11",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "wendykroy",
        "time": "5 September, 2022",
        "context": "The former president has a history of approaching legal proceedings as if they are political conflicts ...and of making incendiary remarks to confuse the issue and divide the country.",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Canadensis",
        "time": "5 September, 2022",
        "context": "Prejudice and bias! \n  Can you imagine the uproar created by hearing that a MLB umpire, just before the final game of a World Series, not only supports one team but actually hates the other team. In fact, he even has money on his favorite team.  I can guarantee that official would not be allowed to officiate that game. In fact, he'd be fired! Yet we allow judges to express their views (and place bets in the form of contributions) on who they like and dislike when it comes to politics. \n  We all agree that judges and FBI agents have a First Amendment Right to speak their views. The challenge is accepting that a judge who contributes to the one party will offer a neutral and unbiased legal opinion when dealing with cases involving members of the opposing party.  I believe that once any of these officials, especially the FBI and  the Judiciary, offer political opinions and preferences, either written, verbal or with financial support, they should be made to recuse themselves from any cases involving any members of two teams involved. ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "slappee",
        "time": "6 September, 2022",
        "context": "All of this is a nothing burger..... Just Donkey and propaganda news distracting voters from the issues where the Donkeys have created crisis after crisis.  The border (or lack there of), The economy, Gas prices, Foreign policy (or lack there of), taxes going up, tax audits for all.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "MAGA_Buttplugs_Hate_America🇺🇸",
        "time": "5 September, 2022",
        "context": "The GOP is dead. The fish rots from the head. ",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "covidfighter2",
        "time": "5 September, 2022",
        "context": "Here's a real dilemma for the DOJ.  Do they investigate the circumstances in which Judge Cannon was inserted into the Trump criminal investigation?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "4katydid",
        "time": "5 September, 2022",
        "context": "The former president no longer holds any special powers.  He has to obey the same laws that you and I and every other American must obey, unless we want to be charged with a crime.",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "wendykroy",
        "time": "5 September, 2022",
        "context": "There was no raid.  A legal search warrant was obtained and served, period.  The FBI is and has always been a highly conservative, right wing organization which has nothing to do with the Democrats.",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "lazarohabla",
        "time": "5 September, 2022",
        "context": "Ideal Judge, ideal subpoena, and ideal affidavit are one thing. What we got was: A bias, conflict of interest Judge (by his own admission), an overbroad general subpoena (which is a no, no), and an substandard affidavit, whose predicate is FBI agents' feelings and opinion, and unsubstantiated claims by the media.",
        "good": "2",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "Xenon21",
        "time": "6 September, 2022",
        "context": "The staged photograph of former President Trump's papers is incendiary and should be CENSORED as PROPAGANDA...",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "other_paul",
        "time": "6 September, 2022",
        "context": "If there are no issues with the content of the documents, a special master will not harm the DOJ's prosecution.\nIt makes one wonder why the DOJ is so vehemently opposed to this action.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "brianodonnell",
        "time": "5 September, 2022",
        "context": "These FBI agents are some of the same agents behind the Russian hoax the FBI has no credibility anymore",
        "good": "2",
        "bad": "8",
        "replies": []
    },
    {
        "user_name": "liberalitarian",
        "time": "4 September, 2022",
        "context": "If America was at war and Trump removed top secret information without authorization, he would be subject to a firing squad. The righties love executions, so how about a big name one?",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dinn",
        "time": "4 September, 2022",
        "context": "I just want Trump to explain to the American people why he took the documents and what he intended to do with them.\nWe've heard his complaints.  We've heard some excuses.   But he has never given any kind explanation of why these particular documents were important to him, and how he intended to use them.  They do not belong to him, classified or not.  Trump had documents that by law belong to the National Archives.  I want to hear from his mouth (not a lawyer, or other talking head) his reasoning for why it is okay that he has them and when he will return them.  Until then, I don't care to hear his rallying points or his attacks on law enforcement or America.",
        "good": "7",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "notsureyet",
        "time": "5 September, 2022",
        "context": "The former president,  whom by the way ,  is banned from operating a charity,  need to come forward with the reason he was hoarding the government owned documents and why he resisted returning them every step of the way",
        "good": "7",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "misterpower",
        "time": "5 September, 2022",
        "context": "It is remarkable to me how many commenters here find all the evidence they need in prognostication, innuendo, gossip, social media posts, and other sources that are even less reliable.  If everything that has been alleged was sufficiently supported by evidence, then an indictment or even conviction would have already been secured.  On the other hand, if the allegations can be proven with evidence before an unbiased jury (which may be very difficult to find), then appropriate action should be taken.  Unfortunately, the track record of so many years of false and unprovable allegations has undermined the confidence of one significant portion of the population and stoked the TDS of another significant portion of the population so nobody is willing to give the wheels of justice time to sort through evidence and develop proof.  Given the absolutely unambiguous bias demonstrated by the FBI in the FISA warrant and numerous other actions, it is no wonder that the \"probable cause\" justification is doubted.  The author of this opinion piece seems absolutely convinced that the judge who issued the warrant was \"neutral and detached.\"  I don't know whether that is true or not, but I have seen enough bias from enough corners of the \"Justice Department\" and the \"halls of Justice\" that skepticism certainly seems warranted.  Maybe we should just all go back to the adage \"innocent until PROVEN guilty!\"",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "Enlightened12345",
        "time": "4 September, 2022",
        "context": "Trump needs to be indicted in Washington.  Why Washington? Because Washington is where the crime occurred.  He stole the documents from that location.  If a burglar goes into your home in Washington, but goes to Florida to hide away, he is brought back to Washington (scene of the crime) to be tried.  \n\nHe took thousands of documents illegally from the White House (our house).  Why?  He never says \"why\" he took them, why he hid them, why he wouldn't hand them over even though he was asked so many times? He throws everything back and calls the search illegal, drags his wife and child into the fray to use them to help anger his base, gain more sympathy.  After all, he is a great manipulator.  He never takes any personal responsibility...NEVER!!  He never addresses the \"why\".... Why does he have covers for Top Secret records, but the records are missing.  Why did he take these records considering he never wanted to read anything when he was in office?  I believe did this because he truly feels everything, he wants is his...his money, his wife, his Attorney General, his generals.  It's aways about him.  He's done untold damage to our security of our country.  We will never know how many of our assets in other countries were killed because of his absolute disregard for our beautiful country.  I honestly have no words to describe how disgusted i am by this \"man\".",
        "good": "7",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "dcp000",
        "time": "4 September, 2022",
        "context": "D. Trump got caught red handed hoarding 35 boxes of stolen presidential documents at his golf course resort.  This is a great threat to our national security.  Trump broke the law.\nHold him accountable and lock him up!!",
        "good": "9",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "randyvanbrisen",
        "time": "4 September, 2022",
        "context": "Trump has offered ZERO reason for WHY he had those CLASSIFIED documents in the first place.  ZERO.",
        "good": "7",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Scott5651",
        "time": "4 September, 2022",
        "context": "FBI DOJ have lost all credibility",
        "good": "3",
        "bad": "9",
        "replies": []
    },
    {
        "user_name": "Filbert",
        "time": "4 September, 2022",
        "context": "An ABC News report about some other situation on May 16, 2017 said this:\nAs president, Trump has the legal power to declassify information. He also has the authority to share information with whomever he wants, including foreign adversaries.  At the White House today, Trump's national security adviser, H.R. McMaster, defended Trump's disclosure and said it \"is wholly appropriate for the president to share whatever information he thinks is necessary to advance the security of the American people.  \"Trump is protected under an executive order that was signed by Barack Obama in 2009 establishing a uniform system for \"classifying, safeguarding and declassifying national security information.  \"The order allows the president to determine the system of designating classified information, and he is the ultimate authority over U.S. intelligence agencies, which gather and classify the information. The Supreme Court confirmed as much in its 1988 ruling in Department of Navy v. Egan.  \"[The president's] authority to classify and control access to information bearing on national security … flows primarily from this constitutional investment of power in the president and exists quite apart from any explicit congressional grant,\" the court said.\"",
        "good": "1",
        "bad": "7",
        "replies": []
    },
    {
        "user_name": "qequalszero",
        "time": "4 September, 2022",
        "context": "More important than the documents they found at MAGA LARGO, are the documents that were already sold from MAGA LARGO.",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "walkabout52",
        "time": "4 September, 2022",
        "context": "Can't do any harm. Like left always says if you are right what do you have to hide or to loose. Rushed justice is seldom good.",
        "good": "0",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "realdeal725",
        "time": "5 September, 2022",
        "context": "If the DOJ has such a strong case, why did they have to go out of their way to cherry pick a judge that has ADMITTED bias and animus against Trump?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "brianodonnell",
        "time": "5 September, 2022",
        "context": "These FBI agents are some of the same agents behind the Russian hoax the FBI has no credibility anymore",
        "good": "3",
        "bad": "7",
        "replies": []
    },
    {
        "user_name": "qequalszero",
        "time": "4 September, 2022",
        "context": "Mr. Trump, why did you take all those documents, classified or otherwise, with you to Florida in the first place?  Doing so, was a clear violation of the Presidential Records Act. What was the purpose?  Why did you repeatedly refuse to return those documents?  So far you have only offered excuses, deflection, and whataboutism.  America wants an explanation as to why you wanted those documents.",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "RollTheTape",
        "time": "4 September, 2022",
        "context": "Trump in 2016: \"In my administration, I'm going to enforce all laws concerning the protection of classified information. No one will be above the law.\"",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cchatel",
        "time": "4 September, 2022",
        "context": "I trust the FBI and the justice system. I don't believe a word out of Trump's mouth.",
        "good": "10",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "vcdave",
        "time": "4 September, 2022",
        "context": "The Democrats started the distraction by illegally raiding his home.",
        "good": "1",
        "bad": "8",
        "replies": []
    },
    {
        "user_name": "imperialpresence",
        "time": "4 September, 2022",
        "context": "demanding the doj make these top secret documents public so they can individually decide if it was secret or not",
        "good": "0",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "rationalhuman238",
        "time": "4 September, 2022",
        "context": "This morning, one of Trump's many supporters in the Republican Party stated \"But he [Trump] has a different set of rules that apply to him,\" Right, the Law doesn't apply to Trump. he can do whatever he wants including steal OUR secret documents, lie about it, lose them, and put agents and intelligence at risk. All because Emperor Trump gets to operate under \"a different set of rules\". That's what Trump and his remaining supporters are now arguing. I'd say it was unbelievable, but those are the facts.",
        "good": "10",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "vimtu4984",
        "time": "4 September, 2022",
        "context": "The guy is really stretching the right to \" run over\" one's right to privacy ",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "1789defender",
        "time": "4 September, 2022",
        "context": "They got Trump on obstruction already.  CASE CLOSED.\n\nRemember, the \"cover up,\"  is what took Nixon down.  Obstruction.",
        "good": "10",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "jimmyc1965625",
        "time": "4 September, 2022",
        "context": "Bonespurs' best shot now is to throw his parking garage lawyer under the bus:\n\"I didn't mean to break the law! I trusted my lawyer, and it turns out she gave me bad advice and lied to the governmen...how was I supposd to know she was trying to get me to steal top secret information!\"",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "TrumpLovesJesus669",
        "time": "4 September, 2022",
        "context": "Trump said last night that the FBI verbally abused Baron and may have even pushed him.\nWhy isn't Fox reporting that?",
        "good": "4",
        "bad": "8",
        "replies": []
    },
    {
        "user_name": "cchatel",
        "time": "4 September, 2022",
        "context": "If Donald is being investigated, it's because he thinks he's above the law and keeps breaking it. Russia did interfere with the 2016 election, Donald did ask the head of state of Ukraine to find dirt on his political opponent, he did ask an election official to \"find\" him the votes he needed, he did send a mob to the Capitol and he did bring boxes of classified documents to his home, illegally. He deserves the attention the justice system is giving him.",
        "good": "9",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "jimmyc1965625",
        "time": "4 September, 2022",
        "context": "43 folders of classified information that are unaccounted for. Time to bring in Bonespurs for waterboarding. \nMy prediction is that during the first bucket, he'll say \" I plead the Fifth Amendm....glug, glug, glug!\"\n\n...but he'll spill his guts as soon as he sees the second bucket.",
        "good": "2",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "jconnor500939",
        "time": "4 September, 2022",
        "context": "We need a special master because we don't trust the DOJ to be honest.  They have revealed themselves to be partisan hacks far too many times.",
        "good": "2",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "jwd2344945",
        "time": "4 September, 2022",
        "context": "The whole shenanigan is a distraction from the total incompetence and failure of the Biden Administration and handlers.  How are things going at the collapsed border, crime ridden Democrat cities, abysmal foreign policy and everything else they need distraction from?  The Two impeachments to nowhere and Jan 6 distractions fizzled out…..so now this.",
        "good": "4",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "milquetoast411287",
        "time": "4 September, 2022",
        "context": "Listen to Randall Zelin speak of rights under the Constitution.\nListen to him wax on about a warrant that just happened to be \nissued to a certain resident at a certain Mar-a-Lago.\nListen to him ignore the facts of the case.\nAnd ignore the fact that Presidents can and do declassify\nany documents they see fit when taking them.\nClinton did it. Obama did it. BUT TRUMP CAN'T?\nThis renders the entire fishing expedition MOOT!\nShut up, Randy, fancy lad!",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "son12",
        "time": "4 September, 2022",
        "context": "What you fail to mention is each prez has the power and authority to declassify what they want to declassify and the process involved is murky at best as we are all learning but to say the FBI should be trusted when they have proved otherwise would be lunacy !!",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "rush55",
        "time": "4 September, 2022",
        "context": "How can the Democrats say \"the documents speak for themselves\" when nobody has even SEEN the documents but the Democrats",
        "good": "1",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "lastindymod",
        "time": "4 September, 2022",
        "context": "The Presidential Records Act states that all materials relating to the president's governmental duties must be turned over to the National Archives the moment the president leaves office. \nUnder the Constitution, that is noon on January 20th.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "commonsense767",
        "time": "4 September, 2022",
        "context": "What harm would result from an objective party reviewing the documents to determine which ones are protected by executive or attorney/client privilege, which ones fell within the scope of the search warrant, and whether the search warrant was overbroad? The FBI has sat on Hunter Biden's laptop for more than two years. Why are they in such a hurry to investigate Trump??",
        "good": "1",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "caymandave505",
        "time": "4 September, 2022",
        "context": "How do we know for absolute certainty that the weak,failed and feckless fbi/doj did NOT PLANT DOCUMENTS??? What the fbi/doj did accomplish is give the GOP a HUGE WIN IN NOVEMBER and in 2024. Thank you soooo much guys. We know who you are.",
        "good": "4",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "jimmyc1965625",
        "time": "4 September, 2022",
        "context": "Evolution of Bonespurs' Defense in 3 short weeks.\n1. I don't have any classified documents \n2. The FBI planted them \n3. I declassified them\n4. I needed to steal the documents in order to write my memoir.",
        "good": "5",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "holycow289",
        "time": "4 September, 2022",
        "context": "Some bottom lines here;\n1. Judges are human and have political leanings.\n\n2. If these documents are classified and controlled, who allowed them to be taken by Trumps staff?\n\n3. If under control someone would notice them missing right away, not 18 months later.\n\n4. The President while in office does have the highest level of security clearance, and is responsible for their security when in his possesion. He also has authority to declassify material, but their is a process for that.\n\nIt is concerning that President Trump continues to shoot himself in the foot like this leaving ammunition to be used against him. They keep slinging mud, eventualy some of it sticks. Time to wise up.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "atom790",
        "time": "4 September, 2022",
        "context": "Sorry but this Judge was NOT Neutral or Detached! He does not like Donald Trump...Was part of the Liberal Crew who wants to hang the Ex President....",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "!!!***#",
        "time": "4 September, 2022",
        "context": "Mr Zelin....................... nobody gives a flying \"f\" about your opinion just continue to teach.  You obviously are biased.",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "conservativesareright214",
        "time": "4 September, 2022",
        "context": "The FBI has never treated Trump fairly or objectively.  They certainly are not going to start now..",
        "good": "3",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "commonsense767",
        "time": "4 September, 2022",
        "context": "If \"the documents speak for themselves,\" then why wouldn't the FBI allow Trump's lawyers to observe the search? Why did the FBI demand that security cameras be turned off? WHAT WAS THE FBI TRYING TO HIDE?",
        "good": "0",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "dcp000",
        "time": "4 September, 2022",
        "context": "Like Jan 6, this entire mess is the fault of D. Trump.\nTrump thinks he was King of America and could ignore our laws.\nTrump broke the law, threatening our national security.\nLock him up!",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "jimmyc1965625",
        "time": "4 September, 2022",
        "context": "I loved Bill Barr's analysis of the \"I declassified them\" defense on Friday:\n\"If Trump really did declassify top secret documents without giving the agency an opportunity to explain why the names of foreign operatives should not be published, that's even worse than stealing classified documents!\"\n\nDonnie has to pick his poison:\n1. Either he declassified documents in gross dereliction of his duties, or\n2. He stole classified documents",
        "good": "5",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "1t1",
        "time": "4 September, 2022",
        "context": "Show if any of Obama, Clinton, Bush document's taken were files marked like Trumps...that would be the right thing to do to give proper perspective to this particular search warrant..surely those details are available to be seen in the archives records department.\nWhy hasn't anyone looked into that comparison to give a fair portrayal of what other President's walked out with.",
        "good": "1",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "dcp000",
        "time": "4 September, 2022",
        "context": "Like Jan 6, this entire mess is the fault of D. Trump.\nTrump thinks he was King of America and could ignore our laws.\nTrump broke the law, threatening our national security.\nLock him up!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "19harwood61715",
        "time": "4 September, 2022",
        "context": "What documents show or don't show are important if it shows the warrant was a fishing expedition or so vague to include the Bible, then that would show up in the same affidavit would show just cause if it wasn't so redacted. If there was any real evidence that showed up that would have required a search warrant, it would have been leaked along with staged classification covers. Which was an actual crime to leak pictures of a crime seen and security violation.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "GenStark",
        "time": "4 September, 2022",
        "context": "Cornell Law School would issue an apology for this odious aggregation of drivel from one of their faculty if they had the integrity and discrimination of a genuine school of law.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "yukiko70",
        "time": "4 September, 2022",
        "context": "When President Trump received these documents he was President. He being the Commander in Chief was legally able to declassify any and all documents generated.",
        "good": "2",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "ConcernedNAZ",
        "time": "4 September, 2022",
        "context": "So...what if a Special Master with clearances is appointed, goes through everything...and says it's all as reported by the FBI/DOJ? What will the \"Trump can do no wrong\" crowd have to say?",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "therational1",
        "time": "4 September, 2022",
        "context": "This article makes so much sense it's a sure bet the MAGAts will be screaming about it.",
        "good": "8",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "moishe99",
        "time": "4 September, 2022",
        "context": "\"In my administration, I'm going to enforce all laws concerning the protection of classified information. No one will be above the law.\" DJ Trump, August 2016. \n\n\"One of the first things we must do is to enforce all classification rules and to enforce all laws relating to the handling of classified information,\" Trump, September 2016.\n\n\"Any government employee who engaged in this kind of behavior would be barred from handling classified information,\" Trump said. \"Again, that alone disqualifies [Hillary Clinton].\" Trump September 2016.",
        "good": "6",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "DAVIDL.",
        "time": "4 September, 2022",
        "context": "THE DOCUMENTS SPEAK FOR THEMSELVES , AND THEY SAY WHAT EVER THE FBI PROGRAMED THE DOCUMENTS TO SAY! JUST LIKE THEY HAVE DONE TO TRUMP IN THE PAST!",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "hdenflies",
        "time": "4 September, 2022",
        "context": "Randy Zelin sounds like a liberal.",
        "good": "7",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "scwoftx",
        "time": "4 September, 2022",
        "context": "Yeah they show nothing but what the FBI wanted people to see. It's all fake and if anyone is trying to deflect it's the DOJ &  FBI",
        "good": "7",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "goolie",
        "time": "4 September, 2022",
        "context": "biden--zelensky--kolomoisky--PRIVATBANK--Burisma",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "polarlight",
        "time": "4 September, 2022",
        "context": "the whole trump thing has been entertaining.....whats next lol....i kind of wonder if there will be more excitement to come ....like maybe some things turn up as to where the contents of the empty folders went",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "ddr2029",
        "time": "4 September, 2022",
        "context": "Why are the left so afraid of an independent review of the materials.  (That's a rhetorical question.)",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "carya072",
        "time": "4 September, 2022",
        "context": "Apparently we have writers, I would refer to them as journalists.. but they are not.. needs to look up what a \"Special Master\" is, the documents which have not been seen by the press, the public or anyone currently trustworthy... but your right sell that bridge in San Francisco, while your at it..",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "dtnu2956",
        "time": "4 September, 2022",
        "context": "Not Trump but Trump's legal team is broadly arguing that a special master is necessary to ensure the Justice Department returns any of his private documents seized during the search of Mar-a-Lago, 10 thousands of them.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "AmericaisDone",
        "time": "4 September, 2022",
        "context": "Bet this tool defended Hilary just like you am I rite? Or am I rite!? I mean she only bleach bit and took hammer to the phones…clearly not obstruction of justice! What rationale could think that!!!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "acleanslateofmind",
        "time": "4 September, 2022",
        "context": "The author here misses a huge fact that the judge who signed off on the warrant had previously recused himself from another case because of his own anti-Trump feelings. So to say this same judge would therefore be fair and reliable in this case is a foolish assumption and casts everything the writer bases their article on into doubt",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dtnu2956",
        "time": "4 September, 2022",
        "context": "A neutral and detached judge signed the warrant? The guy In a June 22 filing, Reinhart recused himself from the Trump's RICO lawsuit against Hillary Clinton case and asked that it be reassigned pursuant to subsection 455 under Title 28 of the U.S. Code, which states that any justice, judge or magistrate shall disqualify themselves from \"any proceeding in which his impartiality might reasonably be questioned.\" LOL.",
        "good": "8",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "nodemd.02",
        "time": "4 September, 2022",
        "context": "The awesome  authority  of POTUS. De- classified  .. not de classified. WHY is Trump  the first potus to be scrutinized  over this?",
        "good": "3",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "KAMS539",
        "time": "4 September, 2022",
        "context": "The FBI tells too many whoppers for anyone to take their word for it",
        "good": "7",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "nodemd.02",
        "time": "4 September, 2022",
        "context": "Presidential  libraries, both democratic  and republican  ,have such documentary  in them ..Where were they stored before being placed  into these libraries?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "winnersnotwhiners",
        "time": "4 September, 2022",
        "context": "A distraction?  When a special master should have been put into place BEFORE they seized a single document?  I think not.  Get bent, tool.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "kbits",
        "time": "4 September, 2022",
        "context": "If the game was fair, and the rules were applied equally, there'd be no problem.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "truthbomb372",
        "time": "4 September, 2022",
        "context": "This guy has TDS brain going off in over drive.   He was president.  Hillary was not even president.  ",
        "good": "3",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "heymikie902",
        "time": "4 September, 2022",
        "context": "The distraction is the politicization of the FBI and the known items taken that were not within the scope of the search warrant.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "richtool",
        "time": "4 September, 2022",
        "context": "Blah blah blah...There are so many assumptions in this article that the writer ASSumes the persona of one.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "johnsmith729273",
        "time": "4 September, 2022",
        "context": "fox is so off the rails.  they slam trump in the same headline as showing the biggest, leftist propaganda photo of staged, high-security docs that would have never been near a camera without fbi corruption.",
        "good": "7",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "nothingbuta",
        "time": "4 September, 2022",
        "context": "The search appears warranted, but I’m not sure this judge is neutral or detached!",
        "good": "3",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "yerkiddin",
        "time": "4 September, 2022",
        "context": "Okay, Doris Day, pay no attention to the skeezy highly paid crony bureaucrats behind the curtain who have already been caught and proved to be liars for the past DECADE.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "redgeorge",
        "time": "4 September, 2022",
        "context": "I could also take some lead ingots and spray them with gold  paint and then take a picture and tell everyone I found gold bars and try to sell them as such...but short of an assay of the actual bars the picture proves nothing.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "nodemd.02",
        "time": "4 September, 2022",
        "context": "The chicken are the egg  Once again democrats  have found away to tear up this country   Documentary  allowed. Not allowed.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "RedStrawberry",
        "time": "4 September, 2022",
        "context": "“The lady doth protest too much, methinks.”  This guy just goes on and on. When you’re straight down the middle right . . . Well, you’re straight down the middle and right.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "nobodyyouknow",
        "time": "4 September, 2022",
        "context": "How can someone use verifiable facts to reach a conclusion, contradictory to those facts?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tonybacks",
        "time": "4 September, 2022",
        "context": "Thanks Randy Z. your piece seems totally unbiased and not all self righteous and minimizing.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "toothpaste181",
        "time": "4 September, 2022",
        "context": "PUTIN GOT \nTRAITOR TRUMPS BACK.\nLITERALLY.",
        "good": "1",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "toothpaste181",
        "time": "4 September, 2022",
        "context": "REPUBLICAN PARTY  \nIS A \nTERRORIST ORGANIZATION.",
        "good": "1",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "toothpaste181",
        "time": "4 September, 2022",
        "context": "THE ONLY COUNTRY\nTRAITOR TRUMP WILL QUALIFY\nTO CONTEST A PRESIDENTIAL ELECTION NOW IS RUSSIA.",
        "good": "1",
        "bad": "7",
        "replies": []
    },
    {
        "user_name": "bigjoemufferaw999",
        "time": "4 September, 2022",
        "context": "I haven't read through the comments yet but I assume there's a bunch of angry Trump supporters unwilling to admit their hero could ever do anything wrong. Has Trump explained yet why he had these documents and refused to return them? That's a question that should be answered.",
        "good": "1",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "loraxthemedic",
        "time": "4 September, 2022",
        "context": "Randy Zellin belongs at Cnnlol or mslsd. ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "TCC147",
        "time": "4 September, 2022",
        "context": "This guys statement is so full of contradictions I wonder if he's read it back to himself.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "toothpaste181",
        "time": "4 September, 2022",
        "context": "TRAITORS \nGET BURIED \nIN CRATERS.",
        "good": "0",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "ohplease578",
        "time": "4 September, 2022",
        "context": "But what about Hunter Biden’s laptop",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mockingbird",
        "time": "4 September, 2022",
        "context": "The FBI trying to block John Durham is the bottom line",
        "good": "3",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "fckfoxopinions",
        "time": "4 September, 2022",
        "context": "Old Fox with all their LIBERAL OPINION WRiters, like they’re going to convince us if their fake opinions.  This was a desperate attempt to distract from the crest more inflation bill, look good to democrat voters and scare conservatives.   All they did was make TRUMP A MARTYR.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "canadianblackmark",
        "time": "4 September, 2022",
        "context": "Looks like any investigation in to DOJ corruption is going to turn up Barr's name",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "almshouse524",
        "time": "4 September, 2022",
        "context": "NUTZ……….",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mikeveryhighnumber",
        "time": "4 September, 2022",
        "context": "OK, so did the warrant meet Constitutional standards?  And did the search comply with it?  Certainly a big NO on the second part with the FBI admission on his passports.  So the whole bundle needs a review.",
        "good": "6",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "offgridx",
        "time": "4 September, 2022",
        "context": "Sorry no if they were declassified, this is a President of the United States, and he gets treated very badly have some respect",
        "good": "7",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "waterloobill",
        "time": "4 September, 2022",
        "context": ",I had to check the logo at the top of the page again, i was sure i somehow wS reading the liberal diatribe from CNN",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "F100",
        "time": "4 September, 2022",
        "context": "Hey Tone. I swear on my muddah. \nWooden Doors ??!!!\nWooden Doors.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rhydelus",
        "time": "4 September, 2022",
        "context": "FBI/DOJ has an awful record of bias against Trump dating back to the Russia collusion hoax, so by all means, appoint the special master.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "toothpaste181",
        "time": "4 September, 2022",
        "context": "TRAITOR TRUMP \nSOLD THE MISSING TOP SECRET DOCUMENTS \nTO KILLER PUTIN.",
        "good": "2",
        "bad": "6",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "nothingbuta",
        "time": "4 September, 2022",
        "context": "This should have been done on the day of the raid!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mrtaanderson",
        "time": "4 September, 2022",
        "context": "The FBI agent filing for the warrant \"believes classified documents have not been handled or stored in a secure manner.\"  That reminds of this un-secure server used by the head of the state department to conduct personal and government business.  When the server was finally assessed, it had been wiped clean, like nothing was there.  Essentially any government property that was there previously, had been destroyed.   Surely on the honor system, we just have to take their word for it that all government information was turned over.",
        "good": "4",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "NeverBidenandHO70!",
        "time": "4 September, 2022",
        "context": "Red herring, more like an orchestrated witch hunt or fishing expedition! Either one will fit the bill. After all, we heard all about the supposed \"evidence\" for several years on the Russia Collusion fiasco, and then found out it was manufactured by none other than Hillary & Co.!",
        "good": "5",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "TripleGear",
        "time": "4 September, 2022",
        "context": "THE CRANIORECTALLY INVERTED AUTHOR   .... who wrote this thing ignored the part of the 4th Amendment that states:  \"...supported by Oath or affirmation, and particularly describing the place to be searched, and the persons or things to be seized.\" (The FBI Trampled all over this part)....   Plus, ANY President has the right to De-classify ANY document, without any specific procedure.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "zd1",
        "time": "4 September, 2022",
        "context": "Trump supporters believe that the US Government is corrupt - and the only solution is to throw out constitutional law, and give Trump unconstitutional authority.  The majority of americans don't want that craziness.",
        "good": "1",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "rexleh",
        "time": "4 September, 2022",
        "context": "A phony “Russia Collusion” investigation that found nothing. A sham impeachment followed by an acquittal. Another sham impeachment and another acquittal. Clear corruption and bias within the highest ranks of the DoJ and FBI, and you want me to believe your lies about Trump THIS time?",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "hesagoodboy!",
        "time": "4 September, 2022",
        "context": "yep, the FBI, planted the evidence and carefully placed it on the floor hoping that Americans will finally believe their lies this time.",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "theoriginalmac503",
        "time": "4 September, 2022",
        "context": "Name, describe and give reasons of importance for each of the “documents”",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "toomanywars",
        "time": "4 September, 2022",
        "context": "Problem it is was carried out by the same institution that already lied about Trump to a FISA court.  The FBI has a demonstrated animosity against Trump and is therefore certifiably non-neutral in any evidence it claims to have collected.  Yes, claims.  If they lied to a FISA court, they could have easily planted classified info into the documents they found.  Now maybe they found real classified info and didn't mishandle it.  But the point remains that the FBI's word cannot be trusted in a court of law.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "daveginoly181",
        "time": "4 September, 2022",
        "context": "Blah, blah, blah. All this \"search warrant\" talk is a smoke screen for the real issue - were the documents declassified? A court ruled that documents in the possession of a FPOTUS are \"presumptively declassified\" (the court's words), because a POTUS has plenary authority to declassify documents, and there is no rule by which he must do so. Just handling the documents as if they are declassified declassifies them, because declassification is within his authority and there can be no presumption the POTUS is committing a crime when his handling of such documents can be legal through his power to declassify. If a POTUS retains documents after he leaves office, the legal presumption is that he declassified them before leaving office.\n\nA POTUS also has plenary authority to designate documents \"presidential\" (potentially disclosable by the NARA, if the NARA gains control of them) or \"personal\", which can be permanently hidden from the public. (This too has already been adjudicated, when a court refused to order NARA to do that which NARA was not empowered to do - to seize and disclose certain records held by FPOTUS Bill Clinton.) Trump could consider any and all of the records in his possession \"personal\" and he would have no obligation to turn them over or to disclose them to anyone. Even NARA can be forced to negotiate the surrender of presidential records, and there is no timeline for the FPOTUS' surrender of such documents. A FPOTUS can delay such negotiations indefinitely.",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "F-16Pilot",
        "time": "4 September, 2022",
        "context": "The author’s line of reasoning is well presented except for one principle. We the People have to believe that those administering the law are honest and trustworthy. Our entire system of government depends on honesty and trustworthiness. Unfortunately, over the last 7 years, those in power in our most fundamental institutions (Department of Justice, education system, and the mainstream media) have proven themselves so devoid of honesty and trust that our Constitutional form of government no longer warrants the Peoples support.",
        "good": "3",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "ZigZagWanderer",
        "time": "4 September, 2022",
        "context": "Tell me, Randy, what's with the obviously staged photo which just happens to include a magazine cover relevant to the raid? Also the out of sequence, mismatched, scattered folders. Why is this the only photo they released and why didn't they hold a press conference afterwards like they usually do with major cases? Why did they want the cameras turned off ? Why didn't they allow Trump's lawyers inside? Why did they object to the affidavit and why was it all so heavily redacted when released? \n\nYou are clearly infected, Randy, but the American people have a whole lot of questions.",
        "good": "3",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "williammalinski",
        "time": "4 September, 2022",
        "context": "The opinion of Randy Zellin is totally false. The fourth amendment demands that a search must be specific of what are where to look. It is intended to protect citizens from general warrants. The court decided in President Clinton’ s case that the President is the sole determiner of what is a personal record. The President is the sole authority on what is classified or unclassified. The picture displayed is of cover sheets, which are unclassified forms that can be stored in any unclassified container for use when needed to cover a classified document.  This Magistrate is a politically biased person that recently recused himself due to his bias, but in this case forgot he was biased against Trump. Why does it take 300 man hours to search a specific place for a specific item? This was not a probable cause search. It was a search of an individual in hopes of finding anything that might be prosecuted. Mr. Zellin is obviously biased and not a journalist.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "politiguru",
        "time": "4 September, 2022",
        "context": "So judge Rhinehart, who signed the search warrant, is a fair and partial judge?",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "Ronphillips",
        "time": "4 September, 2022",
        "context": "A posed photo proves absolutly nothing. NOTHING! And a photo of covers not docs. Its not evidence its a photo op. Even the artical is as rediculous as the fake photo. Why was thie even published by FOX ? Just boaring tripe,,, yawn",
        "good": "4",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "anti-brandon",
        "time": "4 September, 2022",
        "context": "Neutral detached judge? ",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "squaretoround",
        "time": "4 September, 2022",
        "context": "Your opinion is wrong.  No, I didn't read the op ed.",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "zd1",
        "time": "4 September, 2022",
        "context": "How many times have Trump's DOJ / FBI appointees gone against Trump?  He appointed these people.",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "JeffreyCourtney",
        "time": "4 September, 2022",
        "context": "Considering the unbelievable lawlessness perpetrated by the FBI, DOJ, intelligence agencies, and with the corrupt Democrat Communist Party sponsoring it for over five years, Donald needs to be protected from further corruption.  These agencies no longer have the public trust.  The special master is a small step toward protecting Donald's rights.  Apparently, the article's author Zelin was in a mindless zombie cult for the last five years so is oblivious to all of this in his search for brains.  What will be, will be.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "greengrass16",
        "time": "4 September, 2022",
        "context": "Take this guy off Fox News right now.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Reasonable_Honest_And_Moderate",
        "time": "4 September, 2022",
        "context": "The Fox announcers are speculating about future litigation on whether Trump declassified these documents however it looks like Trump lawyers are not going to challenge the government on the classification issue. They appear to feel their client lied on this issue. It has been almost a month and they have not filed any motion with regard to the classification. You would think they would want to make sure this issue is settled before an indictment takes place if there was any truth in the declassification narrative.\n\nSimilarly, Trump lawyers have not challenged the legality of the search itself.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "jerryhauser",
        "time": "4 September, 2022",
        "context": "Is there any law that says a former president cannot have this information at his residence? He presumably still has a clearance. It’s clearly in a place that’s secure and he certainly had reason to have it while he was still the president. Also you can’t just return it by sending it by fedex. You have to coordinate with a courier to to pick it up meaning somebody under the current administration would have to agree to take it. \n\nHe surely did a better job following the rules than the FBI who took a photo of it and released it to the public, redacted or not, without going through the declassification process. And they probably didn’t use a secure camera either, since it was probably connected to an unclassified network to upload it. And if it was taken with a phone that’s even worse.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "JimBob450",
        "time": "4 September, 2022",
        "context": "Why were these docs at his house?",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "zd1",
        "time": "4 September, 2022",
        "context": "excuses excuses excuses",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mrtaanderson",
        "time": "4 September, 2022",
        "context": "how is this a \"Red Herring\".  The FBI has already looked and made copies of the documents.  Trump just wants a neutral 3rd party involved to review the documents.  This is not going to delay the FBI from doing anything.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "villager",
        "time": "4 September, 2022",
        "context": "Randy Zelin, wherever you got your law degree go get your money back. Quit your job and find something simple to do like in fast food. I'm tired of listening to \"experts\" talking about our Constitution and interperating it to shore up your narrative which is usually bias. The FBI went in and spent 9 hours looking for anything to build any case against Trump. Tell me what did they find in Mrs. Trump's closet? The FBI treated this like a General Search Warrant which is illegal. You and your friends are being exposed. Your gonna wonder what fell on you. What would it hurt to have an independent set of eyes look at what the FBI took? The Judge asked that question last Thursday. Why now is the DOJ in a hurry? Yeah, right.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "MrNatural291",
        "time": "4 September, 2022",
        "context": "He has it right, the search was warranted.  Trump is a grifting autocrat, and good luck GOP if he runs again.",
        "good": "4",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "drw123",
        "time": "4 September, 2022",
        "context": "I dunno, he sounds biased to me.  And you have to remember, he was an \"Acting Attorney General\" which means he never actually had the job.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "steveatcho3",
        "time": "4 September, 2022",
        "context": "Has anyone remembered to turn the auto-declassify off?",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Barnes41",
        "time": "4 September, 2022",
        "context": "Is FOX going wolk now?  If so, Newsmax isn’t!",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "ttimest",
        "time": "4 September, 2022",
        "context": "Let me introduce you to the documents.  Document 1:\"  Hi i'm an empty folder,  and these are all my other empty folder friends\"",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "zd1",
        "time": "4 September, 2022",
        "context": "Trump will continue to commit crimes, it's just a matter of time before he's convicted.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "JimBob450",
        "time": "4 September, 2022",
        "context": "Trump has a junior varsity legal team. No real lawyer with any common sense will help him.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "YSONEGATIVE948",
        "time": "4 September, 2022",
        "context": "If it’s SO secret and classified then why are they showing pictures on the……never mind. \n🤦",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Viking.",
        "time": "4 September, 2022",
        "context": "The howling manchild is a traitor and should be treated as one end of the story.",
        "good": "2",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "SouthWestGirl🌵",
        "time": "4 September, 2022",
        "context": "Randy....another liberal who is always right!  No way Jose'",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "rsgoode",
        "time": "4 September, 2022",
        "context": "If the documents speak for themselves, a special master would clearly see that. Why be opposed?",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "russ5tide",
        "time": "4 September, 2022",
        "context": "Imagine for a second how great this country could be currently if so many people weren’t suffering from Trump derangement syndrome and found a way to stop being so bitter and petty and focused on the things that really matter and things that are real!!!",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "gulfcoaster438",
        "time": "4 September, 2022",
        "context": "I truely believe the F.B.I. and the D.O.J. are bias, and want to supress a political rival, and will plant evidence to have false charges against trump. he then will be a political prisioner, ",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "spacecowb0y",
        "time": "4 September, 2022",
        "context": "I wonder if Professor Zelin would have just the same amount of trust and voice it so adamantly if Trumps DOJ had conducted an armed raid on Bidens home and office prior to the 2018 midterms? Would he and you liberals still be so supportive of the DOJ, FBI and the judicial system? What if you had learned the FBI had lied to a FISA judge in order to spy on a Biden campaign worker before that?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "zd1",
        "time": "4 September, 2022",
        "context": "The people at the National Archives were the ones who called the FBI and told them they needed help retrieving classified documents that Trump withheld from them.  The National Archives - a bunch of librarians.  Stop blaming the FBI and look into the facts.",
        "good": "3",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "cak677",
        "time": "4 September, 2022",
        "context": "We get all kinds of “ neutral and detached “ coming from liberals when they know its anything but.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "TheirPlanAllAlong",
        "time": "4 September, 2022",
        "context": "Cornell is a woke university and the writer is is a woke fellow. The judge was a Biden contributor.  Keep your guard up everybody. Another sign of Fox moving leftward.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "master-marine",
        "time": "4 September, 2022",
        "context": "hey MAGAts, it is not a political matter..... this time no McConnells, no Iadyboy Lindseys and no other Repubs there to save Donnie\n\nthis time it is the executive branch.... Fat Donnie got caught red handed\n\nFat Donnie's next address: GITMO or Leavenworth ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "JimBob450",
        "time": "4 September, 2022",
        "context": "Trump is a dude that thinks the world revolves around him.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "rehartman",
        "time": "4 September, 2022",
        "context": "All the newspaper clips the FBI took also speak loads.  I wonder if the judge signed off on those.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ragtimer",
        "time": "4 September, 2022",
        "context": "I have five words of rebuttal: Hillary Clinton and Hunter Biden.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "pevl",
        "time": "4 September, 2022",
        "context": "Trump is a major threat to our national security.",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "America_The_Great675",
        "time": "4 September, 2022",
        "context": "The freaks will read the article...and still be unable to accept reality.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "zd1",
        "time": "4 September, 2022",
        "context": "MAGA - greatness - to me, would be a return to the old two party system; and instead of voting in a bunch of loudmouths, we use the Law to Drain the Swamp:  demand election reform, lobbying reform, term limits.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "ttimest",
        "time": "4 September, 2022",
        "context": "How did that \"nowhere is there a carve-out\" apply to Hillary Clinton,  and she wasn't even President.  Lock her up.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ridgerunner23163",
        "time": "4 September, 2022",
        "context": "My opinion which is just as good as your is the Biden administration will lie, cheat, and steal to try and keep President Trump from running again! And that in its self is enough to make me vote for him once more!",
        "good": "3",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "Tracer1.",
        "time": "4 September, 2022",
        "context": "4th Admendment was violated in it's scope. Narrow as possible, they searched beyond Narrow as possible. \n The Magistrate who signed off on the search warrant,was not neutral, and in fact was biased.\n This should be thrown out in it entirety.",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "TGH0369",
        "time": "4 September, 2022",
        "context": "How about that, another editorial by another never Trumper. When will they ever learn??? ",
        "good": "1",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "shadowfire891",
        "time": "4 September, 2022",
        "context": "So the F.B.I. says these are classified documents not to seen by the public, but they released photos of all the documents to the  leftist media machine for the public to see. Now does that make sense.",
        "good": "3",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "123waitnc188",
        "time": "4 September, 2022",
        "context": "Looks to me like the FBI took some docs from here and some there, and threw them up in the air and took a pic of where they landed.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "commonsenceman",
        "time": "4 September, 2022",
        "context": "None of this would be a problem if Obama and Hillary had been treated similarly.  They were not.  This is nothing but a banana republic political witch hunt.  Everyone knows it.  I’m not a big McConnell fan but thank God he kept Garland off the Supreme Court!",
        "good": "4",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "thankschina898",
        "time": "4 September, 2022",
        "context": "The FBI: \"Make sure and bring the TOP SECRET and CLASSIFIED ink stamps!!!\"",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ReduceToZero",
        "time": "4 September, 2022",
        "context": "Randy Zelin is a Liberal who hates Trump. The warrant was politically motivated, the magistrate hates Trump, the agents doing the raid hate Trump.\n\nThis is a clear violation of the 4th Amendment and Trump will win yet again.\n\nThey swamp can't beat him legally. It took $300 million and states breaking their own laws to fraudulently defeat him and he is not going anywhere.",
        "good": "1",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "provenit",
        "time": "4 September, 2022",
        "context": "If only the FBI didn't lie to the FISA court to such aggregious degree a FISA judge banned them from appearing in their court again.  If only the FBI didn't instruct the agents to stop investigating the Hunter laptop until after the election.  If only the FBI didn't tell Facebook to sensor and silence hunter's laptop story.  If only myriad FBI employees investigating the phoney Trump Russia hoax didn't say....we will stop Trump from becoming president.  If only....but they did, and more.  So, yep, a special master is long over due.  The FBI leadership, at least, is corrupt.",
        "good": "8",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "gregs329",
        "time": "4 September, 2022",
        "context": "Wow FOX, well done👏👏👏, you actually got a balanced opinion piece published. But lets watch the cult lose their stuff having the truth told on FOX🤣🤣🤣",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Ross81-06-05",
        "time": "4 September, 2022",
        "context": "I would believe the FBI, if they were not caught numerous times lying to investigate Trump in the past. ",
        "good": "2",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "netjammer",
        "time": "4 September, 2022",
        "context": "Indeed, the DOCUMENTS SPEAK FOR THEMSELVES.....They've said:  There isn't anything here, but the media shall claim there is, to fool the sheep!!!",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "bonducca",
        "time": "4 September, 2022",
        "context": "Who  wrote this nonsense?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "TrickieDick",
        "time": "4 September, 2022",
        "context": "Well if Trump gets indicted, then Obama and Clinton deserve the same fate, for they did the same crime, actually much worse. She deliberately deleted her emails. Hmm I wonder why. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dangeorgino",
        "time": "4 September, 2022",
        "context": "So let's raid Obama to protect him too. right? ",
        "good": "4",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "russ5tide",
        "time": "4 September, 2022",
        "context": "Anyone acting like President Trump packed your these boxes himself and snuck off with them and put them at Mar-A-Lago are simply just trying to find dirt on Trump. If the laws are not applied evenly between democrats at republicans (and they aren’t) democrats get a pass and than the DOJ comes full force at republicans against all norms acting like this is the biggest breach of our laws in history and it’s hypocrisy at its finest. If you don’t see through all of this for what it truly is. Than your clearly biased against trump for whatever reason!!!  If you hate Trump, you have to let it go. Most the reasons you think he is a criminal/fraud are all lies. It doesn’t take much sense to see that. What is wrong with making America great again? What is wrong with an American president putting America’s priorities ahead of other countries? That is the job the president and our government!!!!!!",
        "good": "4",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "46vintage",
        "time": "4 September, 2022",
        "context": "It is another Communist Week End at Fox News .  You should read Chris Stirewalt , over at Politico  , He is still whining because Fox Fired him for being the first in the nation to call 2020 for Joe Biden .",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "JimBob450",
        "time": "4 September, 2022",
        "context": "Answer me this - why were these documents found at his house?",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "jetwing",
        "time": "4 September, 2022",
        "context": "I always fall back on the Democrats axiom…if you can’t fix it—get Trump to do it.",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "Sdb41",
        "time": "4 September, 2022",
        "context": "Neutral judge?  What planet have you been living on??",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "KNagappala",
        "time": "4 September, 2022",
        "context": "What's that saying about opinions again? That they're like..... this guy? ",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "fightthefarleft",
        "time": "4 September, 2022",
        "context": "An absurd opinion piece.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "suspended",
        "time": "4 September, 2022",
        "context": "This guy from Cornell is as biased as Joe Biden himself. Great article and not one ounce of law behind it. The President is the final say on what is and isn’t classified plain and simple. Let’s go get a search warrant from McDonalds drive thru and then go and get the 3 million documents Obama has. Maybe even search Michelle’s under wear drawer and the kids while we’re at it. Then fan it out on the floor and take pics and put it on social media! Wow! Wouldn’t that be impressive. Lol what a joke ",
        "good": "3",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "jonlarson",
        "time": "4 September, 2022",
        "context": "The judge that ok'd the raid donated to the \"Obama Victory Fund\" and also donated to \"Obama for America\". \n\nHe also recused himself from Trump's lawsuit against Hillary Clinton. Said he couldn't be impartial.... and no, he wasn't appointed by Trump. \n\nHe's a Trump hater. Just like Dan Rather is a Trump hater. That's why Reinhart reposted Dan Rather's spew against Trump and that's why he signed off on the raid. He's everything that's wrong with politics in America.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Alotta.Anger",
        "time": "4 September, 2022",
        "context": "The documents are a distraction.  None of what was shown or inventoried contains document NUMBERS.  And none of them are BOUND.  This is a staged photo, and fraudulent search.  Some people in the FBI need to come forward or face prosecution themselves.",
        "good": "3",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "jonlarson",
        "time": "4 September, 2022",
        "context": "The author of this article, Randy Zelin, has an entire Twitter page dedicated to bashing Trump.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "staedyreason",
        "time": "4 September, 2022",
        "context": "It is fun to watch the trump spiral downword.",
        "good": "3",
        "bad": "7",
        "replies": []
    },
    {
        "user_name": "philip_oliver_holz266",
        "time": "4 September, 2022",
        "context": "“One of the first things we must do is to enforce all classification rules and to enforce all laws relating to the handling of classified information,” - Donald J. Trump",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "LetsGoBrandon_clap_clap_clap",
        "time": "4 September, 2022",
        "context": "Wrong. The Democrats shopped around to get a judge to sign off. The writer of this opinion is not well if he thinks there’s no bias or agenda to “get Trump”",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "mr.spock318",
        "time": "4 September, 2022",
        "context": "all declassified",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "tmcc59",
        "time": "4 September, 2022",
        "context": "FOX is going to the left.  CNN is going to the right. When its all said & done; its gonna be a sight !!",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "0302USMC",
        "time": "4 September, 2022",
        "context": "What the tool that wrote this conveniently ignores is the unequal application of the law under a totally biased justice department and a weak attorney general.\nAlso, the FBI usually serves warrants civilly. Armed jackbooted thugs showing up to your house armed with enough guns to invade Cuba is a raid.",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "jfk1962309",
        "time": "4 September, 2022",
        "context": "All documents seized should be ran through a forensic laboratory to see if in fact President Trump's DNA or fingerprints are on them. I remember Vince Foster's documents found in the west wing of the Whitehouse in Hillary Clinton private library.  The documents she claimed that never existed but once through the laboratory her fingerprints were all over those documents.  Vince foster was found dead days after that. Gun shot to the back of the head, ruled a suicide.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "tothemoon497",
        "time": "4 September, 2022",
        "context": "But we can at least all agree he took what were not his and refused to return it even after being asked numerous times. In the real world we call people like that thieves.",
        "good": "2",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "Argonaut1",
        "time": "4 September, 2022",
        "context": "This opinion is pure junk from Paul Ryan ‘s swamp. ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "JohnPaulJones503",
        "time": "4 September, 2022",
        "context": "A white collar criminal lawyer who does not practice constitutional law has no understanding of executive privilege. Perhaps this is something that should be taught in law school.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "tonykat",
        "time": "4 September, 2022",
        "context": "“A neutral and detached judge” yeah, right!",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "dishdog87",
        "time": "4 September, 2022",
        "context": "Yup. The two tiered justice system still hard at work ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "uscitnotmx",
        "time": "4 September, 2022",
        "context": "Then a search warrant needs to be executed on the former Secretary of State, remember the one with the personal  router and classified documents on her cell phone! Or how about the former president who gave China GPS technology for their 'weather' satellites! Or how about the president who has ties to china, a daughters diary showing pedophelia, or a son with ties to Russia and China and his lap top. Or let's look at the Lefts current darling, the so called 6 January', well what about when ANTIFA set fire to part of washington, where is the investigation. The list goes on and on...",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "pfisher500",
        "time": "4 September, 2022",
        "context": "I totally disagree with those that say there is no need for a special master.  I think they themselves would insist on it if they were in the same predicament.  The raiders broke the law by taking things that had no relation to the \"probable cause\" which we do not even know yet. They also were not following the law by looking at privileged info.  This entire incidence doesn't make any sense yet and personally I doubt the purpose of the raid.  I don't think they got what they were hoping to find.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "jfk1962309",
        "time": "4 September, 2022",
        "context": "They knew President Trump was in New York at the time so the raid must go on so nobody sees what goes on behind them closed doors.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "fif1776",
        "time": "4 September, 2022",
        "context": "The raid speaks for itself - tells us that we are now living in a third world country.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jfk1962309",
        "time": "4 September, 2022",
        "context": "May we view the search warrant for the email servers in Clinton's basement ? How about the search warrant and contents from  Jeffrey Epstein?",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "dwtwin",
        "time": "4 September, 2022",
        "context": "What's up Fox, hiring CNN rejects for their opinions now? Newsmax thanks you LOL.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "JQuest",
        "time": "4 September, 2022",
        "context": "What a maroon. The photo is staged and in direct violation of proper handling of classified documents. There is no proof whatsoever that there are actual documents attached.  This was a failed attempt by the DOJ to try and convince people.",
        "good": "4",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "RedLeaf",
        "time": "4 September, 2022",
        "context": "This raid was a distraction and totally unnecessary.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "muricason",
        "time": "4 September, 2022",
        "context": "\"Wolverine....bring me a cheese pizza.\"",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jt^",
        "time": "4 September, 2022",
        "context": "The  real  distraction is  the FBI  raiding Trump  over  documents  he  has  the authority  to see anyway.  Mostly all they found  were empty  folders.    It is one of two  things.   To  distract  people from the sad  state of our economy  and inflation,  OR  to  tie Trump up in court  for the next 2  years  so  he  can't run  again  for President.",
        "good": "2",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "momma249248",
        "time": "4 September, 2022",
        "context": "When government efforts are fueled by partisanship, it is no surprise that people get upset. After 6+ years and no evidence that any accusations have been factual, this appears to be political persecution and nothing more.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "philip_oliver_holz266",
        "time": "4 September, 2022",
        "context": "“In my administration, I’m going to enforce all laws concerning the protection of classified information. No one will be above the law.” - Donald J. Trump",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "varoy",
        "time": "4 September, 2022",
        "context": "This is a fair and honest article about what happened and why. Trump is not above the law. ",
        "good": "2",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "travestar869",
        "time": "4 September, 2022",
        "context": "The raid was the most intrusive means available to expropriate President Trump's property. The DOJ overstepped its authority because raids are supposed to be a last resort, used only after all reasonable, less intrusive means were attempted.",
        "good": "0",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "deplorableleeroy",
        "time": "4 September, 2022",
        "context": "\"Randy Zelin is an adjunct professor of law at Cornell Law School\"....liberal professor who would have guessed ",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "earnestinevanston",
        "time": "4 September, 2022",
        "context": "Here's where Randy Zelin loses his argument- Judge Reinhart is NOT a neutral and detached judge.\n\nReinhart two months ago recused himself from Trump's RICO lawsuit against Hillary Clinton and the Democratic National Committee without providing a reason why. Judges recuse themselves from cases when they have a personal bias or prejudice concerning a party. \n\nReinhart in 2017 posted an anti-Trump rant on his personal Facebook page, which he has conveniently removed. Here's what he wrote in part: \"Donald Trump doesn’t have the moral stature to kiss John Lewis’s feet. Or, as Joseph Welch said to Joseph McCarthy, ‘At long last, have you left no sense of decency?’”\n\nAnd this is the so called nuetral and impartial judge to sign off on a warrant to search a former president's home 18 months after he left office and who plans to run again. Nice try Zelin.\n\nVOTE OUT ALL DEMOCRATS!\n\nYES WE CAN!!",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "democratturnedrepublican456",
        "time": "4 September, 2022",
        "context": "The FBI is hiding something that needs to be scrutinized by an impartial party",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "geraghb",
        "time": "4 September, 2022",
        "context": "Libs have to use the word \"distraction\" now because that's what they do.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "BCerentano",
        "time": "4 September, 2022",
        "context": "Now let's tell the other half of the story...\n\nThe FBI submitted falsified documents to the FISA court so they could then eavesdrop on the Trump campaign.\n\nAfter it became known that Hillary Clinton had an unsecured & unauthorized server in her home which contained classified information they issued a subpoena. Before Hillary gave the server to the FBI, she destroyed all of the evidence. When her staffers were ordered to give their phones to the FBI, they smashed them. There were no raids to see if they still retained classified information and there were no prosecutions.\n\nThe FBI briefed then- President Obama that they had information that Hillary Clinton was going to circulated a story about Trump-Russia collusion in order to deflect attention away from her server scandal. But, when the story surfaced in the papers, the FBI investigated as though it was legitimate. When the agents leading the investigation reported there was nothing to the story, FBI leadership (Comey) told them to let the investigation continue.\n\nThe FBI had Hunter Biden's laptop since December 2019 but, kept it buried. Whistle-blower are now coming forward to say they were told not to open the laptop. Despite now acknowledging the laptop is legit, there has been no raid on Hunter or Joe Biden's homes despite proof that they were both taking money from China, Russia, Ukraine and everywhere else.\n\nThe FBI has proven they are dishonest and biased.",
        "good": "4",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "Tigerwal586",
        "time": "4 September, 2022",
        "context": "Martha is lovely😍",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ks19",
        "time": "4 September, 2022",
        "context": "King of spin and stalling. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "superscouser",
        "time": "4 September, 2022",
        "context": "Professor or not, this guy can't write. A very badly written article with no cohesive arguments. Not sure why a wannabe liberal is writing opinion pieces for Fox. While CNN is trying to go right, Fox in many ways is going left.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "brokedownbetty",
        "time": "4 September, 2022",
        "context": "I would like to thank the author for his support of the CCP. He marches a great goose step.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "legacy's",
        "time": "4 September, 2022",
        "context": "The following caused by Biden, isn't a deflection, it is a disaster:  Out of control inflation, a “RECESSION,” stock market crash, unemployment rate up, record gasoline prices, record Federal debt due to out of control democrat spending to BUY votes, out of control crime, record deaths from drugs, school shootings resulting in deaths of school kids, millions of illegals pouring into the country, hundreds of billions spent on illegals, road deaths, Covid deaths, record homelessness, supply chain shortages, no baby formula, road rage incidents, kids failing at school, mentally ill boys calling themselves transgenders so they can take showers with the girls, 325 mass shootings in the past 7 months, hiring an IRS army of 87,000 agents and now lots of talk about food shortages this fall from the people who grow the food, the farmers.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "bruerb",
        "time": "4 September, 2022",
        "context": "Isn't this precisely why Trump wanted to \"lock her up\". Perhaps he should lock himself up. Can he not remember what he had in his basement so he needs someone to look at it all so he can remember? Why did trump have this in his basement and why didn't he give it all back when he was supposed to? Sounds like self made drama and playing the victim when everything you did is the cause of the outcome!",
        "good": "3",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "crazyguy62FU",
        "time": "4 September, 2022",
        "context": "😂😂😂😂",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "beatairforce038",
        "time": "4 September, 2022",
        "context": "Donald and Hillary are two sides of the same coin. \nHeck, she’s almost as fat as he is now!",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "Socratic_method",
        "time": "4 September, 2022",
        "context": "Dems make much of the fact that Trump has not released the security footage taken during the raid.  If I were Trump's lawyer I'd advise him not to release it until if/when he is indicted.  He doesn't have to prove that he is innocent or that the FBI is guilty.  \"reasonable doubt\" is his friend.  Speaking of which, demanding the cameras be turned off during the search raises a big doubt.  Demanding Trump turn over the footage is another.  The DOJ bears the burden of proof, and every time its \"anonymous source with knowledge\" leaks a \"fact\" they can't prove will be another reasonable doubt.\n\nSo, no, DJT should not be releasing anything.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "conservativesareright214",
        "time": "4 September, 2022",
        "context": "The FBI would never mishandle information regarding Trump or falsely accuse him of anything, would they?",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jmayer150465",
        "time": "4 September, 2022",
        "context": "What is the sanction against a judge or magistrate that abuses the authority granted to him/her and issues a warrant that is found to be invalid?",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Sis",
        "time": "4 September, 2022",
        "context": "Why is this even a Fox article?  Sounds more like a CNN article",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Mitch735",
        "time": "4 September, 2022",
        "context": "How do you no the judge is unbiased.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "4d4e",
        "time": "4 September, 2022",
        "context": "A search warrant requires both the Executive and Judicial branches of government to agree that there is probable cause to believe a crime was committed.  They did.  MAGAs can complain but this is what the constitution requires.",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "juanvaldez144",
        "time": "4 September, 2022",
        "context": "“Neutral and detached judge”? Bwaaahaaa!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "kindnessmatters",
        "time": "4 September, 2022",
        "context": "FBI staged everything!\nThis has Hillary Clinton written all over it!  It is definitely her style!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "IllegitimateJoe891",
        "time": "4 September, 2022",
        "context": "The Marxist Left is evil.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "fredv",
        "time": "4 September, 2022",
        "context": "Fox News is going soft if it prints an article like this one. It is clear to any intelligent person that the raid was a direct political attack on Trump by an extremely powerful adversary. Possibly Fox is afraid that the next raid will be at Fox News headquarters. If the Right looses courage now we are all lost. I hope this has not happened.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "TheTruthAndNothingButTheTruth",
        "time": "4 September, 2022",
        "context": "Everyone is entitled to their “opinion”, the problem arises when “opinion” is published as “NEWS”.  ",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "solace7",
        "time": "4 September, 2022",
        "context": "\"that judge or magistrate – who is \"neutral and detached,\"  The presumption of a neutral judge is so incredibly naive it invalidates the dude's points entirely.  Moreover, the judge could not predict what sort of documents the FBI would seize.  Therefore, a mutually agreed upon referee who can separate germane to subpoena documents from those private and not subject to seizure or examination is essential.",
        "good": "2",
        "bad": "0",
        "replies": []
    }
]