[
    {
        "user_name": "sickofnews-8646",
        "time": "12 July, 2021",
        "context": "Cool. Wolves in Northern Michigan and Snakes still in Lansing.",
        "good": "22",
        "bad": "0",
        "replies": [
            {
                "user_name": "Quinsareth1",
                "time": "13 July, 2021",
                "context": "Hopefully these wolf packs will be re-introduced to the state capitol grounds.",
                "good": "7",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "GodBlessMyGreatStateOfTexas",
        "time": "12 July, 2021",
        "context": "Wolves Do Serve A Useful Purpose,  However Democrats Do Not!",
        "good": "49",
        "bad": "3",
        "replies": [
            {
                "user_name": "sickofnews-8646",
                "time": "12 July, 2021",
                "context": "Especially in Pure Michigan.",
                "good": "9",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "cjr919",
        "time": "12 July, 2021",
        "context": "Not a hopeful sign for the ranchers",
        "good": "4",
        "bad": "12",
        "replies": [
            {
                "user_name": "ᏉᎾᏬᎭᎵ",
                "time": "12 July, 2021",
                "context": "No ranches on Isle Royale.",
                "good": "8",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "LivFreOrDi215",
        "time": "12 July, 2021",
        "context": "The Gray Wolves are such a beautiful animal....glad they're growing in number....",
        "good": "21",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "rubiks6",
        "time": "12 July, 2021",
        "context": "Unless there is a solution to inbreeding you can expect the population to go down to zero in a few years.",
        "good": "3",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "antinastynancy",
        "time": "13 July, 2021",
        "context": "A good wolf hangs on a wall the rest should join it...along with tree huggers and demiRats....i iive for all thee to go Extinct.....",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "conservativenation",
        "time": "12 July, 2021",
        "context": "This drive for wolves has been nothing but problems for the western US. Good luck Michigan!",
        "good": "23",
        "bad": "17",
        "replies": [
            {
                "user_name": "FarkQuark",
                "time": "12 July, 2021",
                "context": "Wolves are very important to the ecosystem. They help weed out the sick and genetically deficient prey species, many of which are favorite of hunters and favored of wildlife spotters.\n\nThe elk, deer, moose and other animals are much healthier and their numbers are much better kept in check where there are wolves. Also the trees and other fauna are healthier and more diverse because of wolves.\n\nYes wolves are a nuisance to some farms, but they are also welcome to many other farms. Wolves help prevent overgrazing of farmland and wilderness.\n\nThough it is sometimes necessary to eliminate problem wolves, and sometimes it is necessary to reduce the population on the mainland.",
                "good": "18",
                "bad": "10",
                "replies": [
                    {
                        "user_name": "conservativenation",
                        "time": "12 July, 2021",
                        "context": "Bruh, what planet are you on? I’m in the thick of it. That cute little picture you paint is not the reality. Wolves are a species that can kill for fun. They are substantially harming the larger game in the west. They have no real balance to keep them in check aside from man.",
                        "good": "4",
                        "bad": "5",
                        "replies": [
                            {
                                "user_name": "FarkQuark",
                                "time": "12 July, 2021",
                                "context": "Your obviously from some other planet. I'm from Earth.\n\nThere are non-Hunter factors that do keep wolves numbers limited; habitat, food abundance, and disease. Sometimes it is necessary for human hunters to intervene.\n\nRanching encroachment of Yellowstone Park has also been a problem. Ranchers have increasingly encroached into the wilderness, and parks that are the natural habitat of wolves.\n\nHumans are killers to, so should we eliminate all of them?\n\nMost wolves do not bother humans or livestock. Natural wolves have a tendency to fear man. It's usually the Wolf dog hybrid that is more likely to maim cattle, pray on cattle and attack humans.\n\nThey kill to eat, so do we. Ranchers kill to eat.\n\nMost of the wild wolves that have been dissected, do not contain livestock stomach contents as per DNA examination.\n\nI've been in the thick of it with wolves and coyotes; and have never had a problem.\n\nIf you really were in the thick of it, then you would know more about wolves.",
                                "good": "3",
                                "bad": "3",
                                "replies": [
                                    {
                                        "user_name": "conservativenation",
                                        "time": "13 July, 2021",
                                        "context": "You are a liar. Wolves kill for sport. That’s a  fact. I have not even mentioned livestock issues. I have seen the carcasses of whole, large wild game first hand. Again, you are trying to smooth over the reality we are living with.",
                                        "good": "3",
                                        "bad": "2",
                                        "replies": [
                                            {
                                                "user_name": "beadgBass",
                                                "time": "13 July, 2021",
                                                "context": "FarkQuark gave a very accurate account.\nAnd bringing back wolves to Yellowstone has had many benefits in restoring the ecosystem.",
                                                "good": "0",
                                                "bad": "0",
                                                "replies": [
                                                    {
                                                        "user_name": "conservativenation",
                                                        "time": "14 July, 2021",
                                                        "context": "Yellowstone is also having problems. Yes, at first all was great. Now, they also are having management issues. There are no natural predators. It’s like there is this group of dreamers out there thinking all the animals get along as if they are in an ark. The mindset is really juvenile when you think about it .",
                                                        "good": "1",
                                                        "bad": "0",
                                                        "replies": [
                                                            {
                                                                "user_name": "beadgBass",
                                                                "time": "14 July, 2021",
                                                                "context": "\"There are no natural predators.\"\n\nReally? Which planet do you live on?",
                                                                "good": "0",
                                                                "bad": "0",
                                                                "replies": [
                                                                    {
                                                                        "user_name": "conservativenation",
                                                                        "time": "14 July, 2021",
                                                                        "context": "What animal is chasing down wolves ? I think you need to have the streetlights and experience the wilderness.",
                                                                        "good": "1",
                                                                        "bad": "0",
                                                                        "replies": [
                                                                            {
                                                                                "user_name": "beadgBass",
                                                                                "time": "14 July, 2021",
                                                                                "context": "You were very unclear with your post.\nYou sounded like a creationist saying that there are no natural predators.\nBut specific to wolves, there are many natural predators. Those are mostly the predators from within, i.e. parasites, viruses, bacteria, and so forth. But wolves are also predated by fellow carnivores such as bears, and scavengers such as birds of prey.\nYou are the one ignoring the wonders of the wilderness. I follow the wilderness as a profession.",
                                                                                "good": "0",
                                                                                "bad": "0",
                                                                                "replies": [
                                                                                    {
                                                                                        "user_name": "conservativenation",
                                                                                        "time": "14 July, 2021",
                                                                                        "context": "Bears? Seriously? Parasites?  C’mon. Wolves are apex predators. This is fact. Put down the Disney movie and pick up an adult title. Parasites, seriously? How dumb",
                                                                                        "good": "1",
                                                                                        "bad": "1",
                                                                                        "replies": [
                                                                                            {
                                                                                                "user_name": "beadgBass",
                                                                                                "time": "14 July, 2021",
                                                                                                "context": "I have a PhD in zoology.\nYou are the one reading the comic books.",
                                                                                                "good": "0",
                                                                                                "bad": "0",
                                                                                                "replies": [
                                                                                                    {
                                                                                                        "user_name": "conservativenation",
                                                                                                        "time": "14 July, 2021",
                                                                                                        "context": "Just goes to show just how easily “knowledge” is bought these days",
                                                                                                        "good": "0",
                                                                                                        "bad": "1",
                                                                                                        "replies": [
                                                                                                            {
                                                                                                                "user_name": "beadgBass",
                                                                                                                "time": "14 July, 2021",
                                                                                                                "context": "Then maybe you should buy some.\nStart with a book on parasites.",
                                                                                                                "good": "0",
                                                                                                                "bad": "0",
                                                                                                                "replies": [
                                                                                                                    {
                                                                                                                        "user_name": "conservativenation",
                                                                                                                        "time": "14 July, 2021",
                                                                                                                        "context": "What's sad is that, that piece of paper empowered you and made you feel important. However, in this case, simple field experience would of gone further. You might not of enjoyed it as much. But, you would of met some great people and seen things the internet could never replicate. Now, you walk around and will leave this convo thinking you still have the upper hand. like a Californian wondering why their state burns nearly constantly.",
                                                                                                                        "good": "0",
                                                                                                                        "bad": "0",
                                                                                                                        "replies": [
                                                                                                                            {
                                                                                                                                "user_name": "beadgBass",
                                                                                                                                "time": "14 July, 2021",
                                                                                                                                "context": "I direct a nature center, so I have plenty of field experience. Been around the world many times too.",
                                                                                                                                "good": "0",
                                                                                                                                "bad": "0",
                                                                                                                                "replies": [
                                                                                                                                    {
                                                                                                                                        "user_name": "conservativenation",
                                                                                                                                        "time": "14 July, 2021",
                                                                                                                                        "context": "You direct a \"nature center\"....That's hilarious. People like you need to leave your little suburban homes and visit the backcountry with guides that LIVE THERE. You really have no idea how foolish you sound. I would LOVE to visit this nature center! If there is a God, I would someday stumble into this place for one of your presentations. It's easy when you're preaching to folks who maintain a lifestyle similar to you. It's easy when preaching to kindergartners or others from a broke down public school.",
                                                                                                                                        "good": "0",
                                                                                                                                        "bad": "1",
                                                                                                                                        "replies": [
                                                                                                                                            {
                                                                                                                                                "user_name": "beadgBass",
                                                                                                                                                "time": "14 July, 2021",
                                                                                                                                                "context": "So, keyboard warrior, does the typing of completely uninformed insults with anonymity help you get over your miserable failure of a life?\nBTW, there is a God, and you should probably try to respect His teachings considerably more.",
                                                                                                                                                "good": "0",
                                                                                                                                                "bad": "0",
                                                                                                                                                "replies": []
                                                                                                                                            }
                                                                                                                                        ]
                                                                                                                                    }
                                                                                                                                ]
                                                                                                                            }
                                                                                                                        ]
                                                                                                                    }
                                                                                                                ]
                                                                                                            }
                                                                                                        ]
                                                                                                    }
                                                                                                ]
                                                                                            }
                                                                                        ]
                                                                                    }
                                                                                ]
                                                                            }
                                                                        ]
                                                                    }
                                                                ]
                                                            }
                                                        ]
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "user_name": "mtcap",
                        "time": "13 July, 2021",
                        "context": "The elk, deer, moose are much healthier?  The 10 moose and 20 elk the wolves didn't kill in MT are not a healthy population.",
                        "good": "2",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "conservativenation",
                                "time": "14 July, 2021",
                                "context": "100% . That’s my experience.",
                                "good": "1",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "maxinestaxadermist",
        "time": "13 July, 2021",
        "context": "The predator species is 13% of the population.",
        "good": "10",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "FarkQuark",
        "time": "12 July, 2021",
        "context": "Decades ago I went to Isle Royale on the Voyager and its sister ship several times. The wolves were the main attraction for our family. It's a shame that the island is too small thus there is a problem with inbreeding. It would be nice to have a wolf exchange program to try to keep the genetics of the Isle Royale packs healthy.\n\nThe problem with a wolf exchange program is the risk of spreading disease. Any such wolves should be quarantined, vaccinated and thoroughly examined to try to prevent the spread of disease.\n\nWolves are great at improving the prey species, such as deer, elk and other animals. They are also great at reducing overpopulation and disease and those animals. It helps deer and elk to evolve stronger and bigger; so hunters ought to have mixed feelings about wolves.\n\nWolves sometimes can be a nuisance to ranchers, however there are reimbursement programs, and programs that investigate and sometimes eliminate problem wolves/packs. The wolves were here first, we are the invaders/immigrants. Wolves are very important to the ecosystem. Wolves also help the health and diversity of other animals, and fauna. Yellowstone has had an improvement in bison, other wildlife and fauna since the reintroduction of wolves.",
        "good": "17",
        "bad": "3",
        "replies": [
            {
                "user_name": "rubiks6",
                "time": "13 July, 2021",
                "context": "To say the wolves came first is meaningless. Wolf populations come and go on this island. Inbreeding will quickly destroy the present population and after a while, new wolves will come from the mainland over the frozen lake. Now, of course, men will totally interfere with the natural patterns but that's what men do. It's not like wolves are going to go extinct.",
                "good": "11",
                "bad": "3",
                "replies": [
                    {
                        "user_name": "beadgBass",
                        "time": "13 July, 2021",
                        "context": "Inbreeding for this population won't be a problem, because, if you read the article, there is the option of bringing in new wolves, or they might come naturally. FarkQuark explained that quite nicely as well.\n\nThat said, I doubt that inbreeding was the cause of the reduced number of wolves, as per the article. That would take a LOT longer than a decade for it to be a problem, unless they had been isolated on the island for a long time before the decade of decline, which seems unlikely.\n\nBTW, wolves were threatened with extinction not long ago, and were on the IUCN Red list.",
                        "good": "3",
                        "bad": "1",
                        "replies": [
                            {
                                "user_name": "rubiks6",
                                "time": "13 July, 2021",
                                "context": "If I were to guess, I'd say the wolves left the same way they came. It's likely they come and go regularly. Of course, Man will find it necessary to interfere with the natural order. It's what Man does, which is okay if there is a good reason but even for no reason men will interfere. It's what they do.",
                                "good": "1",
                                "bad": "2",
                                "replies": []
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "cakepronoun",
        "time": "12 July, 2021",
        "context": "Be careful what you wish for.  Wolves are awesome creatures but bring a whole host of problems.  There were reasons we got rid of them 150 years ago.",
        "good": "22",
        "bad": "28",
        "replies": [
            {
                "error": "error"
            },
            {
                "user_name": "bugslayer",
                "time": "12 July, 2021",
                "context": "the reasons they were gotten rid of 150 years ago was greed and ignorance...of course the wolves became a problem for the ranchers, they killed off all the buffalo, what did they expect the wolves to eat?",
                "good": "14",
                "bad": "3",
                "replies": []
            }
        ]
    },
    {
        "user_name": "az-moe",
        "time": "13 July, 2021",
        "context": "Has anyone seen what the repopulation of wolves has done to not only domestic livestock but also natural animals like deer, elk, moose, etc? They are literally killing machines that wipe out species as they move through. I'm mixed, agree that all animals should be allowed to live, but... ",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "yeah.no,i’mright.",
        "time": "13 July, 2021",
        "context": "No moose were reached—or caught up with—for comment on this report…",
        "good": "12",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "OlafTheLogical",
        "time": "14 July, 2021",
        "context": "Only good wolf is a dead wolf. ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dan5047628",
        "time": "13 July, 2021",
        "context": "Bet the farmers and ranchers that killed the wolves off in the first place can't wait to have their livestock slaughtered.",
        "good": "1",
        "bad": "2",
        "replies": [
            {
                "user_name": "snowpinenh",
                "time": "13 July, 2021",
                "context": "Isle Royale is a national park and a remote island.  There are no farms or ranches there, and only one lodging establishment.",
                "good": "2",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "az-moe",
                        "time": "13 July, 2021",
                        "context": "So there isn't any deer, elk, moose, rabbits, etc? Because they will soon be wiped out. Can you name one natural predictor of wolves? No you can't, there are none ",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "pt1093",
                        "time": "14 July, 2021",
                        "context": "Not the farmer and ranchers, but the hikers and kayakers who wander astray.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "Leroy6721",
        "time": "13 July, 2021",
        "context": "The natural balance must be maintained, all extra wolves 🐺 can be sent to the Adirondack Mountains,NY,USA. Also, the AKC needs fresh DNA 🧬 ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "osoright605",
        "time": "13 July, 2021",
        "context": "Welp, they're releasing tiger sharks in lake Huron to curb grass carp populations, so why not add a few lions to keep down the inbreeding wolves?",
        "good": "1",
        "bad": "2",
        "replies": [
            {
                "user_name": "wewil",
                "time": "13 July, 2021",
                "context": "Sorry, that was an April Fools joke.",
                "good": "1",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "trumpguyforever",
                "time": "13 July, 2021",
                "context": "Tiger sharks can only live in salt water Skippy....",
                "good": "2",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "hunter3",
                        "time": "13 July, 2021",
                        "context": "Skippy, you missed the joke...",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "osoright605",
                        "time": "14 July, 2021",
                        "context": "correction, bull sharks",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "VHart51563",
        "time": "13 July, 2021",
        "context": "If the Moose population was too high, why didn't the MDNR issue hunting permits and MAKE some $$$$$ from license's and THEN do some research?",
        "good": "2",
        "bad": "1",
        "replies": [
            {
                "user_name": "hunter3",
                "time": "13 July, 2021",
                "context": "The short answer is because Isle Royal is a National Park, hunting is prohibited in National Parks.\n  Under the Trump Administration there were plans to allow hunting in national parks for the exact reasons you cited. I'm sure that's off the table now.",
                "good": "6",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "kenhum",
        "time": "14 July, 2021",
        "context": "What is wrong with you people wanting wolves?  Well, you'll reap what you sow.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "wilko",
        "time": "15 July, 2021",
        "context": "Feed them liberal tourists.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jdubya2.0",
        "time": "13 July, 2021",
        "context": "Yeah, who wants to eat moose…🙄",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "dan5047628",
        "time": "14 July, 2021",
        "context": "This will end badly. \nIn the early 1980's Environmentalist released 8 breeding pairs of coyote in North Florida to replace our extinct wolf. \nNow the state is overrun with them. They are even within the cities eating small dogs at cats.\nThese people shouldn't have a licensed to fix the environment.\n Why don't we get a vote on what invasive species are introduced to our properties?",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "skihunter",
        "time": "14 July, 2021",
        "context": "And now for something completely different",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Woken=Broken",
        "time": "13 July, 2021",
        "context": "Winter Study by Nevada Barr is a good book about the Isle Royal wolves.  It's a mystery but a lot of the story is about how they study the wolves.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jdubya2.0",
        "time": "13 July, 2021",
        "context": "if there’s a problem with inbreeding, maybe they shouldn’t be there?",
        "good": "2",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "cakepronoun",
        "time": "13 July, 2021",
        "context": "Do inbred wolves like banjo music, too?",
        "good": "0",
        "bad": "5",
        "replies": [
            {
                "user_name": "smitd",
                "time": "13 July, 2021",
                "context": "In spite of your leaving yourself wide open, I won't take the opportunity ... but you know what I'm thinking ...",
                "good": "2",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "AZbil",
                        "time": "13 July, 2021",
                        "context": "I can hear it in AZ and the cloths washer is on the spin cycle.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "smitd",
                                "time": "13 July, 2021",
                                "context": "Eavesdropping, eh? LOL",
                                "good": "1",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "skihunter",
                                        "time": "14 July, 2021",
                                        "context": "Who isn't ?",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "AZbil",
                "time": "13 July, 2021",
                "context": "no thumbs.",
                "good": "2",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "OlafTheLogical",
                "time": "14 July, 2021",
                "context": "Dubstep ",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    }
]