[
    {
        "user_name": "Uamuseme2",
        "time": "5 November, 2018",
        "context": "A much cheaper way to find moronic people.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "monkeysuncle",
        "time": "5 November, 2018",
        "context": "The drones should be equipped with devices which suck firearms up Into the sky and drop them in steel blast furnaces to be remelted into plowshares.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "RetiredJay",
                "time": "5 November, 2018",
                "context": "Ok what steel is available on modern firearms is the wrong type for making plowshares and the use of plows has proved to be inefficient in modern farming  time go home and try it again !!!",
                "good": "3",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "jaywye",
        "time": "5 November, 2018",
        "context": "have a large drone flying over the forest canopy,where it can receive the GPS signals for accurate location,and still be close enough to communicate with the under-canopy small drones and relay the precise location of a lost person back to the large drone and then to base controllers.(the Rangers.)",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "RuralVoter2",
        "time": "5 November, 2018",
        "context": "Why do people intentionally go out and get lost and then expect the rest of us to pay for their rescue?",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mc49",
        "time": "5 November, 2018",
        "context": "Drones are already in use in New Mexico to help find the Lost.....",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "OrangeGuitar",
        "time": "5 November, 2018",
        "context": "How many jobs will be eliminated?",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "GreenGuitar",
        "time": "5 November, 2018",
        "context": "Researchers at MIT say that a sophisticated fleet of drones could help find lost husbands by searching under dense barroom canopies on Friday night when he is just trying to sneak in a beer before coming home.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "holepuncher",
        "time": "5 November, 2018",
        "context": "If they want to go into the woods out without a personal location device or a handheld gps, they should just be left out there.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "monkeysuncle",
                "time": "5 November, 2018",
                "context": "Daniel Boon just rolled over in his grave.",
                "good": "2",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "RetiredJay",
        "time": "5 November, 2018",
        "context": "I think as preventive measure the government should have large drones flying overhead that communicate with smaller drones that can tag and track everyone, this way when someone turns up missing the drones can quickly locate then or at least give the last know location combined with ground/street surveillance no one will loose direction in their life",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "9thInfantry",
        "time": "5 November, 2018",
        "context": "And in other news, MIT scientist predicts our sun will disappear in approximately seven hours EST. Chance of re-appearing is good, news at 11.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "AmericanByTheGraceOfGod",
        "time": "5 November, 2018",
        "context": "Well, duh. Did we really need MIT researchers to tell us this?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "GoldBattery",
        "time": "6 November, 2018",
        "context": "I see a tremendous invasion of privacy and infringement on our 4th amendment rights. Every time one of these are allowed to be used for the purpose of catching criminals or gathering probable cause to search someones home or property there's the probability they will be used illegally. A ruse for permission to use one of these can and is likely to occur.  History has proven that many times.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "GreenHat",
                "time": "6 November, 2018",
                "context": "yea, but in oregon, colorado and california it could be used to deliver pot, saving millions from getting off their couch",
                "good": "4",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "afnav175",
        "time": "7 November, 2018",
        "context": "Actually the answer is to put a small cel phone repeater over the area with a tethered balloon or drone",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "joseywales0331",
        "time": "6 November, 2018",
        "context": "Some of those lost hikers never should have been out there in the first place.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "thomaswinslow",
        "time": "5 November, 2018",
        "context": "good idea but I would put heat sensor on them and they could then pick up the body heat of anyone that is below the forest line. There are going to be many uses in the long run for drones and soon you will be seeing them in the skies quite often I suspect. Some large and some small",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "alioli49422",
        "time": "6 November, 2018",
        "context": "Somebody send MIT over to South Korea so they can drone bibles over to North Korea. Do it now.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "GreenHat",
        "time": "6 November, 2018",
        "context": "in another theory discussed by these millennial snowflakes - they say that the use of these new portable optical devices, some call binoculars --could also be of use in spotting lost people from distances much greater than just normal eyesight...they have applied for a NSF grant so they can study it for the rest of their lives as it might also be apart of climate change . Both are good as they are never going to move from their couches to search for someone, unless they might have large supplies of pot.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "Wampeter9",
                "time": "6 November, 2018",
                "context": "Lidar and utilization of mesh computer networks to provide locational accuracy in areas not well covered by GPS is actually pretty cool use of technology... I am not sure why it is generally being ridiculed here. I'll agree that drones in general can and probably will be really problematic from a privacy perspective, and also that there are a lot of bad uses and bad pilot/ owners out there, but there are some positives, too. This could be one of them.",
                "good": "3",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "GreenHat",
                        "time": "6 November, 2018",
                        "context": "it is being ridiculed because we already knew that... hell, they used balloons in the civil war to spot enemy troops, using a drone has been used for a decade by the military even as attack vehicles...so someone realizing it could be used to find lost hikers, or their dog in their back yard does not need a scientist to bring it to our attention.... wow,",
                        "good": "3",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "Wampeter9",
                                "time": "6 November, 2018",
                                "context": "So, that isn't the same as lidar, which is what the article is talking about. That technology can see through thick canopies, which is why it is innovative. Go to a heavily wooded area in a balloon with your binoculars (you can even wear your civil war uniform) and look straight down. Many times, you will only see foliage.  Lidar can help with that, can actually identify objects beneath that canopy. I am not saying it is the second coming, but it is a cool use of the technology. Same is true of using mesh networks. I agree 100% that this isn't a heavy hitting article full of insight, but I fail to see why it is worthy of so much vitriol. Put another way, you say \"we already knew that\", but could you personally coordinate a group of drone technology to locate a target in a remote location where GPS is sketchy through heavy canopy? I couldn't, and I think it is cool that these kids are.  That is my point.... why ridicule someone that is working to improve and understand things?",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "error": "error"
    },
    {
        "user_name": "DSchmidlapp",
        "time": "6 November, 2018",
        "context": "I forsee a lot of crashed drones and skinned up trees in our future.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "maxcat7071",
        "time": "5 November, 2018",
        "context": "Yes it could but will most likely be used to spie on people as an invasion of privacy.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "PurplePizza",
        "time": "6 November, 2018",
        "context": "Or another approach that could save a lot of taxpayer money.....If you get lost, you need to find your way out.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "regius",
        "time": "7 November, 2018",
        "context": "\"each drone mapped a roughly 20-square-meter area in about two to five minutes\"\nThat seems awfully slow to me. That is roughly the size of my living room. Two-five minutes to map my living room?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ladycat",
        "time": "5 November, 2018",
        "context": "Drones!  Be afraid, be very, very afraid!!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ak2co",
        "time": "6 November, 2018",
        "context": "So this is a no brainer, no offense to MIT where amazing minds abound,but you needed research to see this is possible?",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "FruitFly",
        "time": "6 November, 2018",
        "context": "Could they possibly be used in the back rooms of the Senate and the House to shed light on the political dealmaking and big money (i.e. Google, Facebook, Twitter, Elon Musk with Tesla, etc.) corruption that threatens our country?",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "ryanthomas52",
        "time": "5 November, 2018",
        "context": "Better have a strong battery life. The typical 20-minute flight time won't help finding anyone.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "EmbracingNature",
        "time": "7 November, 2018",
        "context": "I think it is a great idea.  Would be nice if it had the ability to allow two way communications.  I was lost in CO. hiking a 14K footer in August 2018, I made a mistake coming down in the dark.  A drone flew up to me (about 10 feet away), stayed there for about 1 minute, maybe longer and then flew off.  Left me in the dark lost.  It would have been nice if I could have spoke to it and whoever was flying it. (Military or on Auto pilot I suspect, very professional drone).\n\nLucky I had compass and map and eventually found my way.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Tomk76",
        "time": "5 November, 2018",
        "context": "A hiker really should not get lost if prepared. I hiked the Sierras by myselft for 20 years until i was 76.  Made a 3D map of the hike, used GPS and compass.   Informed my children of the hike and expected exit of the hike. Talked to other hikers before i started to determine if taking the same route and their expected ETD and carried adequate water and small first aid kit.  Sounds like a lot of work, but it wasn't.  After 100+ hikes preparation was automatic.",
        "good": "4",
        "bad": "0",
        "replies": [
            {
                "error": "error"
            }
        ]
    }
]