[
    {
        "user_name": "milehiconservative",
        "time": "1 January, 2022",
        "context": "$$ we don't have. Keep spending.. yeah.. that's right.. keep spending",
        "good": "4",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "301877w",
        "time": "1 January, 2022",
        "context": "Bill Nelson is wearing a skin suit. HOLY_F#CK",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mashiekorbin995",
        "time": "1 January, 2022",
        "context": "Cheechee bow wow Space Force!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Rellats",
        "time": "1 January, 2022",
        "context": "Who is this dude’s plastic surgeon?!!!!",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "healthysk3ptic",
        "time": "1 January, 2022",
        "context": "If Biden promised it means the station is probably doomed.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "ZootAllures032",
        "time": "1 January, 2022",
        "context": "Bill Nelson is another clown show Democrat who should have been put out to pasture long ago. As a Floridian, I'm embarrassed to admit that this ineffective moron was one of our Senators.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "beefy8888",
        "time": "1 January, 2022",
        "context": "just think of all the great discoveries they have made at the ISS that have greatly improved your life.\n\nif it wasnt for the ISS we wouldnt have..................im drawing a blank here.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "dementatalibiden",
        "time": "1 January, 2022",
        "context": "Its time to build the USS Enterprise in space.  Large enough to house several hundred but manned by 25.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "BadAttitude079",
        "time": "1 January, 2022",
        "context": "Wait….. the other article said we were going to Mars to eat people. Come on man!!",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "COTToget",
        "time": "1 January, 2022",
        "context": "Remember the movie The Mask? The kid grew up. Seriously how old is this guy? Just the Dem pol we need leading us into the final frontier. Lordy, he probably can’t even use a cell phone.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "oldschool1971",
        "time": "1 January, 2022",
        "context": "So we are going to send the first Woman of color to the moon!   So can we send KAAAMAALAA Now  ?????",
        "good": "3",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "bbrexit",
        "time": "1 January, 2022",
        "context": "Send congress members up there for a closer look, bring them back in two terms.",
        "good": "22",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tedwis",
        "time": "1 January, 2022",
        "context": "Perhaps the Biden administration will all volunteer to be sent to the international space station and return in 2030!",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "vapatriot530",
        "time": "1 January, 2022",
        "context": "This guy was great in the sequel to The Silence of the Lambs, he rode that wheel chair like a boss",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "984roger",
        "time": "1 January, 2022",
        "context": "Uh oh.  This means nations working together, which MAGA hates as it’s too close to the feared “globalism…”",
        "good": "0",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "olderamer",
        "time": "1 January, 2022",
        "context": "So 'the first woman and the first person of color' will be sent to the moon.  WOKE and PC thinking has invaded the space program as well.  Reverse racism and sexism is rampant.",
        "good": "8",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "hawgriderbc",
        "time": "1 January, 2022",
        "context": "Good thing the Russians provided a way for US astronauts to get there and back for years,  or if would have already been abandoned. ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "godincognito",
        "time": "1 January, 2022",
        "context": "That thing is under water. See the bubbles. NASA hoax like Covid.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "LongTau",
        "time": "1 January, 2022",
        "context": "The ISS is just an expensive toy. IF it had any meaningful purpose, that has long passed.",
        "good": "14",
        "bad": "6",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "rickydfrommiami",
        "time": "1 January, 2022",
        "context": "another positive case of Dementia, for sure!",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "break_fast",
        "time": "1 January, 2022",
        "context": "Sounds like a good place for Democrats.  Then maybe a little galactic laser action from Space Force.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "patv",
        "time": "1 January, 2022",
        "context": "Bill Nelson: Living proof of the failures of cosmetic surgery.",
        "good": "15",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jetliner",
        "time": "1 January, 2022",
        "context": "Of course Bill conveniently chose himself to go up in the Shuttle in the past.  These Dems live a perpetual ego trip.  Not even the Terminator can stop them.  Bill please no more cosmetic work either brother.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cmsgt(ret)89",
        "time": "1 January, 2022",
        "context": "I committed to support my local beer distributors.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Dmillette198",
        "time": "1 January, 2022",
        "context": "Isn't the space station a relic from the deep past now?\nWhen is this thing going to be dismantled, abandoned and/or retired?\nIs there anything new that the occupants can do that hasn't already been done?",
        "good": "0",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "devildog84",
        "time": "1 January, 2022",
        "context": "Biden took up space in college.",
        "good": "14",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "kick@sstexan",
        "time": "1 January, 2022",
        "context": "I’m all for a greatly expanded International Space Station as long as it’s the final destination for illegal aliens crossing our southern border.",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "itsjonny",
        "time": "1 January, 2022",
        "context": "Is it just me or does Nelson look undead?",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "grafelfing799",
        "time": "1 January, 2022",
        "context": "Well I sure hope so, I'd sure hate to have that thing fall on California or New York.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "OldMarine70",
        "time": "1 January, 2022",
        "context": "Don't we have enough to take care of here on Earth first??",
        "good": "3",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "Victoria20!",
        "time": "1 January, 2022",
        "context": "Will they require masks?",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "fahrwright",
        "time": "1 January, 2022",
        "context": "sure it's like everything else \"international \" the US taxpayers bankroll 95% of it FJB",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "truthstingz435",
        "time": "1 January, 2022",
        "context": "i commit to living long enough to watch it fall out of the sky back to earth waaaayyyyy before then.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "olericat",
        "time": "1 January, 2022",
        "context": "The United States’ continued participation on the ISS will enhance innovation and competitiveness, as well as advance the research and technology necessary to send the first woman and first person of color to the Moon.\n\nIf a man can be in space or on the moon, what more advances are required to send a woman or a person of color other than sperate bathrooms??",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "lostlink_returns",
        "time": "1 January, 2022",
        "context": "Ambivalent about anything that comes out of the *biden junta.  But, this, the International space station, support for it, I'm good with it.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "SchoolingLiberals",
        "time": "1 January, 2022",
        "context": "Can we have Biden committed to the space station until 2030?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "flirtnwitdisaster",
        "time": "1 January, 2022",
        "context": "They should be trying to figure out how to use it to travel back and forth to the moon.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rvondutch",
        "time": "1 January, 2022",
        "context": "The liberal left mocked and laughed at the creation of the space force, but they wouldn't think it very funny if some place like China knocked out our entire communications system with a few well-placed attacks on satellites. One primary mission by the space force will be to prevent that from happening. So keep on laughing and mocking, you can't fix stupid.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "notwithoutreason967",
        "time": "1 January, 2022",
        "context": "Well of course! We can always just print up the money, or borrow it from the Chinese.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "conservativesareright214",
        "time": "1 January, 2022",
        "context": "I didn't see how much this support is going to cost us, or maybe that just doesn't matter.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dyndoeth",
        "time": "1 January, 2022",
        "context": "Commit to build ITER....bring billions out of poverty",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Useyourbrain64",
        "time": "1 January, 2022",
        "context": "Russia created a debris field that will endanger the ISS for years to come. That's ok?",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "PurpleBone",
        "time": "1 January, 2022",
        "context": "United Nations – U.N. Agenda 21 depopulation of 95% of world by year 2030 is now underway,signed and approved by 200 world leaders at the Rio,Brazil Earth Summit in 1992\nDepopulation Agenda Explained by Dr. Rima Laibow",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tyreu",
        "time": "1 January, 2022",
        "context": "That's nice.  Will we do the same thing for veterans,  police and Americans left in foreign countries ",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sheila86",
        "time": "1 January, 2022",
        "context": "'Congress currently has only approved funding for the station through 2024'\n'Congress currently has approved funding for the station only through 2024'\n\nThere, I fixt that.  Now, I'm getting off of this thread so I can go in my kitchen to bake some synonym buns for my New Year dinner.  I hope I can bake them just like grammar used to make.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "hippieron275",
        "time": "1 January, 2022",
        "context": "\"The International Space Station is a beacon of peaceful international scientific collaboration and for more than 20 years has returned enormous scientific, educational, and technological developments to benefit humanity,\"   Can anyone name even one of the scientific, educational and technological benefits from the ISS?  Do we pay more than the other countries that fund this?",
        "good": "10",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "PeterBravo545",
        "time": "1 January, 2022",
        "context": "That thing looks like a horrible piece of space junk from some planet zooming through space on an uncertain  journey to a final  collision with some other space debris...pb",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mrgetnwhrufitn",
        "time": "1 January, 2022",
        "context": "No man has gone more than 450 miles into space since the moon landings(all done during Richard Nixon's adm), but we celebrate it like it's the 231,000 miles to the moon....something seems fishy.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "orlfla",
        "time": "1 January, 2022",
        "context": "I didn't know Bill Nelson was still in government, let alone still alive. I think he was in the room with them when they signed the Declaration of Independence. These dinosaurs in government have to go. He flew on the Space Shuttle once and no considers himself an expert in space science.",
        "good": "13",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "pinboy446",
        "time": "1 January, 2022",
        "context": "A jobs program. At least the shuttle gone that white elephant.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "heylookhere",
        "time": "1 January, 2022",
        "context": "Good! 👍",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "startagainfree",
        "time": "1 January, 2022",
        "context": "What are U.S. taxpayers getting out if this venture? Almost nothing. Yeah, with that in  mind, let us waste 10 more years of taxpayer dollars on nothing ... the Democrat agenda.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "peach46282",
        "time": "1 January, 2022",
        "context": "I thought the space station was supposed to provide a laboratory for major advances in science.  About the same way embryonic stem cell research was going the rid the world of disease",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "UR2",
        "time": "1 January, 2022",
        "context": "At this point in time, it's a total waste of money. Divert the money to finish the wall",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "OrangeMan2024002",
        "time": "1 January, 2022",
        "context": "Sure, why not. We only pay a billion dollars a day in interest on our debt.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mynameisearl",
        "time": "1 January, 2022",
        "context": "WOW! Bill needs to do something with his poltergeist head!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "lamontcranstonthethird",
        "time": "1 January, 2022",
        "context": "In the not-too-distant future,\nsomewhere in time and space,\nMike Nelson and his robot pals\nare caught in an endless chase,\n\nPursued by a woman whose name is Pearl,\nan evil gal who wants to rule the world.\nShe threw a few things in her purse,\nand in her rocketship she hunts him all across the universe.\n\n(Pearl) I'll get you!!!\n\n(Pearl) I'll send him cheesy movies,\nthe worst I can find, la, la, la.\nHe'll have to sit and watch them all,\nand I'll monitor his mind, la, la, la.\n\nNow keep in mind Mike can't control\nwhere the movies begin or end, la, la, la.\nHe'll try to keep his sanity,\nwith the help of his robot friends.\n\nROBOT ROLL CALL\n\nCambot! (You're on!)\nGypsy! (Oh, my stars!)\nTom Servo! (Check me out!)\nCroooow! (I'm different!)\n\nIf you're wondering how he eats and breathes,\nand other science facts, la, la, la.\nJust repeat to yourself it's just a show,\nI should really just relax,\nfor Mystery Science Theater 3000",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mutts",
        "time": "1 January, 2022",
        "context": "\"Plenty of things to spend this money on here  on earth\" the naysayers complain. Like what? Monthly free money to buy drugs and Tvs? More social workers or any of the other things the war on poverty has not solved in over half a century? Since the days of world discovery there have been naysayers without the vision to imagine what lies beyond and the wisdom to know there are even greater things we cannot imagine waiting to be discovered and invented . Think about the now much maligned Columbus couldn't get Italy to fund his exploration and how he had to go to Spain. The discoveries and knowledge were immense though it took many years for that to pay off for mankind (and we can argue if it would have been better for the \"indiginous\"  tribes to have stayed in the stone age another time). The thing is is that we have to do it all. We have to take care of our own. We have to take care of others, we have to explore and we have to learn because those will be the efforts that reward future generations in ways we can't imagine. ",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "OliveSushi",
        "time": "1 January, 2022",
        "context": "That's gonna be a game change for the red and blue sheep",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "peej820",
        "time": "1 January, 2022",
        "context": "Will see what happens after Russia invades Ukraine.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "blasto",
        "time": "1 January, 2022",
        "context": "Give the money to Elon and stop giving hundreds of millions to Russia, which uses to the money to buildup its military.",
        "good": "16",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "byronallen",
        "time": "1 January, 2022",
        "context": "Nelson is known by all as \"DUMB AS A BRICK\" !!!  He understand nothing about NASA and on previous flights he flew, they had to make sure he touched nothing.   I mean really stupid!!!   But, this type of appointment should not surprise anybody as democrats specialize in putting people in jobs that they have no ability to handle, including the presidency.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "RedSword",
        "time": "1 January, 2022",
        "context": "Once again, Biden appears entirely clueless about even the bare essentials of his job role and limitations.  No President can \"commit\" the government to anything extending beyond their own term of office.  Only a treaty can do that -- and that takes the involvement of Congress.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bribing-Bidens",
        "time": "1 January, 2022",
        "context": "Russia must now be banned from joining the ISS",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "OrangeRing",
        "time": "1 January, 2022",
        "context": "Biden once drove an 18 wheeler to the ISS. Ask him, he'll tell ya",
        "good": "16",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "whatsmorelikely",
        "time": "1 January, 2022",
        "context": "A total waste of time and money.  We need to escape our solar system, not just planet earth.  Our sun will burn out, but before it does that, it will burn us out first.  We have plenty of needs for funding right here on the surface.  Banking a space motel for NASA isn't a wise use of money.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "girlintx",
        "time": "1 January, 2022",
        "context": "Nelson has had more plastic surgery & botox than...well, anything!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "demlibslie1",
        "time": "1 January, 2022",
        "context": "last I heard the thing was going to burn up soon.......is this yet another money grab",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "blasph",
        "time": "1 January, 2022",
        "context": "Democrats are definitely Alien spawn. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "d'bender731",
        "time": "1 January, 2022",
        "context": "I wonder if Bill Nelson is riddled with dementia like Brandon. He looks ancient. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "someotherview",
        "time": "1 January, 2022",
        "context": "Obama cancelled the shuttle program without having another US built rocket to get astronauts to the space station. Then he paid Russia to get US astronauts to the space station with US tax dollars. Think of all the equality building a new US rocket would have generated.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Cobra87",
        "time": "1 January, 2022",
        "context": "Bill Nelson is a joke. He couldn't lead his way out of a wet paper bag.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "csmsss",
        "time": "1 January, 2022",
        "context": "NASA.  Yet another pointless gummint organization that needs to go away yesterday.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "laughingtothebank",
        "time": "1 January, 2022",
        "context": "With all these enormous developments, can we have somebody’s Top Ten?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "paulinee384",
        "time": "1 January, 2022",
        "context": "Which of the other illustrious space agencies is also contributing MONEY to the space station? Just us I presume.  Lots of people get to say what happens on it but none of the others are willing to financially support it???",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "charliehoss",
        "time": "1 January, 2022",
        "context": "Nelson is such a sleeve bag!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rambalderaz",
        "time": "1 January, 2022",
        "context": "So...basically more money thrown up..and will never come down..not benefiting anyone..basically yeah. Here we go again.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "gregrevere",
        "time": "1 January, 2022",
        "context": "space is the mew frotier. and the science exploration is super interesting and exciting. but. its not something i want to be paying for with tax dollars. ",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "GoldPopsicle",
        "time": "1 January, 2022",
        "context": "We aren't going to have a country in 2030 on our current trajectory.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "gotg",
        "time": "1 January, 2022",
        "context": "Bill Nelson has never held a working job!! he has been paid by the taxpayers for the last 50 years!!  again useless spending by the Democratic party!!  ",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "garface",
        "time": "1 January, 2022",
        "context": "Why work side by side with Russia and countries who utilize the scientific knowledge to kill remaining Americans on Earth and take control of the US Democracy from space with Russia?",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "fortheobservations",
        "time": "1 January, 2022",
        "context": "The idea of this space station when pitched in  80s and 90s far cry from how it is used since launch.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "pinktacolover469",
        "time": "1 January, 2022",
        "context": "The printing presses at the treasury are spinning out of control !",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "OrangeCandy",
        "time": "1 January, 2022",
        "context": "What's the rate of decay on that thing, anyway??",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Hesnotmypresident555",
        "time": "1 January, 2022",
        "context": "Zero interest.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "faction_of_1",
        "time": "1 January, 2022",
        "context": "That’s good news, and who don’t like good news?!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "OrangeHat",
        "time": "1 January, 2022",
        "context": "The biggest rip off con going, \nNASSA!\nDo you actually think we have a billion dollar Tonka truck on mars? Think we have been to the moon?\nBillions of our hard earned money is stolen and re distributed under the lies of NASSA snakes!",
        "good": "1",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "SirFigNewton894",
        "time": "1 January, 2022",
        "context": "TEN BILLION DOLLAR telescope went up recently so mankind can try to see where it all began. Too bad they didn't just read the holy scriptures and believe the truth; could have saved $10 billion to use for those in need right here on the planet.",
        "good": "2",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "dg50484",
        "time": "1 January, 2022",
        "context": "We are WAY past due for a new space station, and the gateway is not going to cut it. It's time to get building. China is already ahead of us.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Sophiesbelly",
        "time": "1 January, 2022",
        "context": "Bill Nelson looks like a space alien ,take it easy your looking like those freak sisters in Calif.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "web0623",
        "time": "1 January, 2022",
        "context": "I totally agree with funding for ISS and beyond.  I would have preferred Reagan's vision but it is what it is.\n\nWhat gets me is the number of short sighted people who believe it is a waste of money.  To them I assume was the New World a waste?  I am sure the progressive enlightenmet will believe so. Was penicillin a waste?  How about tomatoes or potatoes or corn?  Certainly any discovery made since Columbus has to be erased, right?\n\nI am disgusted by those who want to make amends to the past, to those who are not victims of it.  My ancestors were serfs.  I own nothing to anyone, except those I work with and my family.\n\nThat is what America is supposed to be.\n\nSo, exploration!  Learning!  Finding the things we didn't know we didn't know!  That absolutely should be the goal! \nWhen exploration, just for its own sake ends, we die.  It will be a long, drawn out death.  At the end it will end. Nothing new will end everything and be the end.\n\nWho among you really believes we know all that is knowable or all that we need?  \n\nThat is what I call short sighted.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "itsanillusion458",
        "time": "1 January, 2022",
        "context": "How much money was approved? List the benefits and accomplishments that help humanity. Give us that information.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "hiphoppippop",
        "time": "1 January, 2022",
        "context": "nah boy we shold be helpin poor black folk",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Reverend306",
        "time": "1 January, 2022",
        "context": "Are we the ONLY ones supporting it? If so call it the American Space Station. We support 90% of the world.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "nicewalter",
        "time": "1 January, 2022",
        "context": "Good news!  We need to continue our efforts at growing knowledge and getting deeper into space.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "OrangePizza",
        "time": "1 January, 2022",
        "context": "Crime is rampant, inflation is nearly as high as the space station, thousands of energy industry workers were fired, pipe lines have been shut down, thousands are infected w/ Covid; a virus that Joe promised to destroy.  But never fear, America, Joe will spend billions more floating around on the space station & going to the moon.....don't worry....be happy.\n\nLET'S GO BRANDON",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "JamesBomb",
        "time": "1 January, 2022",
        "context": "Cage fight on board the ISS..\nAnderson Cooper Vanderbilt and Don Le'mon vs. the Russians.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "thebonedog",
        "time": "1 January, 2022",
        "context": "What a waste of money!",
        "good": "2",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "samintacoma",
        "time": "1 January, 2022",
        "context": "I hope Brandon has the money in his pockets to pay for his commitment.  I didn’t make it and don’t agree to it.  There will be changes coming in 2022 and beyond!",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "dinosaur🦕",
        "time": "1 January, 2022",
        "context": "Thank you, President Trump, for creating the US Space Force 💪🏻 🚀 👨🏻‍🚀 🇺🇸\n\nAn attack on our Great Republic's space assets is no different than an attack on its soil 🌍 🇺🇸 🌌 🇺🇸\n\nSomeday these Dims will be forced by circumstances to admit it's indispensable 💯\n\nBut even then they'll never admit who we have to thank... \nPresident Donald Trump 💪🏼 🇺🇸",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "just_the_facts016",
        "time": "1 January, 2022",
        "context": "Thanks,Joe!\nUp yours,trump!",
        "good": "0",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "chlymideaharris",
        "time": "1 January, 2022",
        "context": "How much plastic surgery have you had Bill? Geeeeesshhhh!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rexthedog",
        "time": "1 January, 2022",
        "context": "Is it just me, but does Nelson look like he had already been embalmed. But he is still feeding at the government teat.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "vettejack",
        "time": "1 January, 2022",
        "context": "But, but, but...I'm one of those 'white supremist\" that helped build the ISS!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "conebred",
        "time": "1 January, 2022",
        "context": "Ya wouldn't want to be stuck on the ISS dependent on a FJB commitment.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Proud.Navy.Vet",
        "time": "1 January, 2022",
        "context": "Bill Nelson looks like an alien from some other planet in that photo.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Jhubb1006",
        "time": "1 January, 2022",
        "context": "earth is flat... you can easily search nasa declassified documents on thee official nasa website and it's right there. There is no space, just atmosphere. ",
        "good": "0",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "'44model",
        "time": "1 January, 2022",
        "context": "And if you need more money we’ll just print it for you…",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "justanotherday095",
        "time": "1 January, 2022",
        "context": "Let the billionaires build their space hotel",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "jimdandy073",
        "time": "1 January, 2022",
        "context": "Defund NASA until debt is paid off.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "thunderagent",
        "time": "1 January, 2022",
        "context": "So in other words, we pay for all of it.",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "SupportEntertainmentnotPolitics.",
        "time": "1 January, 2022",
        "context": "That’s it, shoot money into space! Never mind about balancing the budget first? \nIf this was on the level the budget would be balanced first. $31 Trillion in debt. Never enough for democrats or the companies they work for. ",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "jayo6",
        "time": "1 January, 2022",
        "context": "First decision thus far by this administration that I support.  Good job - we should support REAL science and scientific research, not politically-manipulated pseudo-science like psychology, racial / gender studies, liberal arts, etc.  \n\nHard sciences, engineering, design, mathematics and classical arts are where we should be putting our effort and attention - things that benefit us and enrich us, not divide and confuse.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "fordprefec",
        "time": "1 January, 2022",
        "context": "With Putin on a war path, it would have been wiser to let the funding run out in 2024, pull our modules off of the station and give the thing to Russia. We should be thinking about building our own space station anyway!!!",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "WAStateCrusader",
        "time": "1 January, 2022",
        "context": "does anyone pay for this other than the US taxpayer?\n\nPT Barnum was right.......",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Ididthat!",
        "time": "1 January, 2022",
        "context": "This administration can’t do anything original. It screws up everything… somehow, liberals have even screwed this up.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tdsbullfighter",
        "time": "1 January, 2022",
        "context": "Bill Nelson calls himself an astronaut after the politician got taxpayers to pay millions for his seat on the shuttle. Never had a problem with sending him to space, but had a problem with bringing him back!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "SupportEntertainmentnotPolitics.",
        "time": "1 January, 2022",
        "context": "Bill Nelson is a retired Democrat for years. What is he doing in the news? He is not part of anything but maybe stock buybacks after democratic companies get government contracts. Just another scam to get taxpayer money with kickbacks to the Democratic Party. Follow the money! ",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "ScienceGal",
        "time": "1 January, 2022",
        "context": "Remember \n\nDONT LOOK UP!!!!",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Loonie1",
        "time": "1 January, 2022",
        "context": "What a huge and complete waste of money and human talent!!!!!!!!",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "jmcgowan5571",
        "time": "1 January, 2022",
        "context": "Seems like the only advancements of the international space station this year was averting disasters. I support space exploration and believe it does provide technological advances that improves lives. However do a quick search of anything from the international space station and you get a list of possibilities. A letter from the head of the agency in charge of the space station points out advancement that have changed lives not one of which came from the ISS. \nIt appears the the 21st century so far is going to be the century on mediocity if we Continue on this path.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "cadaverjoefakeprez",
        "time": "1 January, 2022",
        "context": "I thought Bill Nelson was dead. \nWhy do so many Democrats look like cadavers?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "WorkerBee370",
        "time": "1 January, 2022",
        "context": "Good thing that we are funding the space station for just a few more years because by 2024, all we will be hiring for NASA and to work at the space station will be people that are not qualified and who were hired by criteria other than a high IQ and great skill in science and math. But I am so old fashioned.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "antilibtard64",
        "time": "1 January, 2022",
        "context": "What Biden means is: \"Sure, we will give $billions to the space station and continue to disregard Americans here at home.\"",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tnrabbithunter915",
        "time": "1 January, 2022",
        "context": "We built it to start with",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "billmill",
        "time": "1 January, 2022",
        "context": "Seems like a huge waste of money, we could be sending these astronauts to Red Roof Inn for the weekend and learn more.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "chile10001488",
        "time": "1 January, 2022",
        "context": "\"...for more than 20 years has returned enormous scientific, educational, and technological developments to benefit humanity...\"\n\nThis is pure propaganda. It would be interesting to hear them say what benefit the space station has actually had for humanity. It's benefitted the contractors who supply it. And if there was to be any great scientific breakthrough, that knowledge would go straight to a major corporation which would also benefit greatly. \"Humanity\" then would only get what they can pay for...again.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "adrian1954824",
        "time": "1 January, 2022",
        "context": "Well at least the Russians and Chinese still have a Space Program.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "rico61",
        "time": "1 January, 2022",
        "context": "Curious what percentage of the ISS is funded by the U.S. Maybe it should be the U.S. Space Station and we should approve all visitors.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ricobravo",
        "time": "1 January, 2022",
        "context": "Ah. Russian welfare.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "SadSackIAm972",
        "time": "1 January, 2022",
        "context": "He looks like he’s been rode hard and put up dry. ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ahwrites",
        "time": "1 January, 2022",
        "context": "Uh oh. We learned what Biden's support means. Whoever gets left behind in space is gonna have a heck of a time getting brought back to earth by private, civilians  'cuz we know Biden will be busy napping.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "BuckFoeJiden",
        "time": "1 January, 2022",
        "context": "I'm more interested in learning what the Webb telescope finds.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "web0623",
        "time": "1 January, 2022",
        "context": "I spoke with a person who objects to funding ISS.  \nHe replied:\nPlease name one thing from our 60+ years that has benefitted the tax payers who are\n footing the bill.  I'm not talking future possibilities.  I'm talking a\n tangible return on our investment that warrants continued spending.  \nTang doesn't count.  Lol\nMy reply:\nTo begin GPS, communications, weather... that is immediate top of the head thoughts.  Do you need more?\nHis reply:\nMankind survived quite well throught history without these things.\n\nAm I out of touch?  Is exploration and discovery dead?  Am I the only one who wants to know what we don't know?",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "hiwayne!",
        "time": "1 January, 2022",
        "context": "One of the few things Biden has done that I agree with",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jazbojones",
        "time": "1 January, 2022",
        "context": "NASA does/has done great things. It's also a decades old bureaucracy that spent decades & billions failing to replace the shuttle to the point Russia was are only way into space, it's captive to political pork & civil service union, etc.  Competitive commercialization of space is greatly accelerating progress. Hopefully space stations are next.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "SupportEntertainmentnotPolitics.",
        "time": "1 January, 2022",
        "context": "Democrats! How about feeding the homeless Americans on our streets? How about building careers with skilled trade education. How about bringing our factories back to the United States? How about balanced budgets in all democratic states? In addition balance the federal budget. \nWhere is the fiscal responsibility for the taxpayer. \nYou want to shoot it  into space. Budgets, training, education, debt, homeless, factory jobs come first. Make America great instead of your pocketbooks! \n ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "hawgryder",
        "time": "1 January, 2022",
        "context": "Translation:  the United States Taxpayers will \"Foot the Bill\" while other Countries \"Reap the Benefits\" ...",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "BigPicture416",
        "time": "1 January, 2022",
        "context": "We hear about experiments and nothing more. Billions spent with no accountability",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Dr.KrentistDDS",
        "time": "1 January, 2022",
        "context": "Let the tallyband pay for it",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "libs_smh",
        "time": "1 January, 2022",
        "context": "NASA, like most federal agencies, need to decouple from that tax payer's teat.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "brucegordon",
        "time": "1 January, 2022",
        "context": "Congress currently has only approved funding for the station through 2024.... With the extra money (Putin said)   \"Well thanks Joey\"",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "razzmatazz000",
        "time": "1 January, 2022",
        "context": "It is old and outdated.  The only thing we are getting done is microwaving humans with radiation.   ",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "billadams",
        "time": "1 January, 2022",
        "context": "I Thought it was a JOINT Venture between the Countries?? Why do Dems Always Commit to Paying for Everything... well The American Tax Payers to fit the Bill .. Make it a Joint Equal Thing... What does it do anyway to Benefit The US",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "TeeK181",
        "time": "1 January, 2022",
        "context": "INTERNATIONAL?!!!!!\nwhat a stupid idea!!!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mortyo6",
        "time": "1 January, 2022",
        "context": "\"for more than 20 years has returned enormous scientific, educational, and technological developments to benefit humanity,\" Nelson wrote \n  And then he can't really name any.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "letsgobrandon!973",
        "time": "1 January, 2022",
        "context": "Wait! you  mean Biden hasn't given that to China, yet?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "NJFishHead715",
        "time": "1 January, 2022",
        "context": "Bill Nelson looks like he was too close to the fire.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bornadragonfly",
        "time": "1 January, 2022",
        "context": "One would think since the US all but foot the bill and made it..that we would and could do as we seen fit with it..including not allowing say..Russia and China..to use it?",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "BidenIsTooStupidToBeMyPresident🍦🧠",
        "time": "1 January, 2022",
        "context": "I worked under Nelson when he was the inept Insurance Commissioner of Florida. Politics is crazy stuff. Now he’s administrating NASA. Promoting the most incompetent is the Democrats’ only rule. Oh, Bill, your Botox is glistening. Dust a bit of powder on that forehead. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "spygirl945",
        "time": "1 January, 2022",
        "context": "Mr Nelson's pic makes him look out of this world.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mikeconte",
        "time": "1 January, 2022",
        "context": "Is NASA being run by an space alien.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dinosaur🦕",
        "time": "1 January, 2022",
        "context": "Starlink is among many US assets in space in a fast growing frontier for business\n\nThanks to President Trump 💪🏻 🇺🇲\nwe have the US Space Force 👨🏻‍🚀🚀 \n\nThe 1967 Outer Space Treaty will become outdated as soon as e.g. China, NK, Iran or Russia do what they do in space too 🤷🏻‍♂️\n\nThanks to the leadership of Don Trump,\nhowever, they'll think twice  🦅🇺🇸",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rolandbett",
        "time": "1 January, 2022",
        "context": "Didn’t I read somewhere about kids going to bed hungry????? Are they growing food for them at the space station????",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "RedButton",
        "time": "1 January, 2022",
        "context": "We will end up evacuating our astronauts as the others sleep. They will wake up with all the communication equipment scuttled, empty supplies, and no return vehicles. We might even get to see a cosmonaut clinging to the outside of the return vehicle as it reenters earth's atmosphere.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "matt82g",
        "time": "1 January, 2022",
        "context": "Bill Nelson looks like he is from space",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "fest3er1",
        "time": "1 January, 2022",
        "context": "Biden/Harris can’t actually commit funding without Congress.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "freebird73",
        "time": "1 January, 2022",
        "context": "Lets send AOC and posse up for an untethered space walk, problem solved.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "BlueCocktail",
        "time": "1 January, 2022",
        "context": "Looking for other planets to ruin with political correctness and perversion!  Humans have trashed the oceans and space with junk!  No surprise here!  So much to do here and yet soon it will be all over for this second earth age!",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "harvethecuke",
        "time": "1 January, 2022",
        "context": "Can wait till Trump gets back in and fires Nelson. One of the worst people ever.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "keeppushingfortruth",
        "time": "1 January, 2022",
        "context": "Continuing support for the ISS is the first time I can actually give Biden credit for doing something right.  I find myself looking up and waiting for the flying pigs.",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "nowordone",
        "time": "1 January, 2022",
        "context": "First learn how to count votes legally the we can talk about space",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "PMST33",
        "time": "1 January, 2022",
        "context": "How?\nThe us is bankrupt.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "anotherDogFacedPonySolder",
        "time": "1 January, 2022",
        "context": "wasting  more tax dollars ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ConservativeView",
        "time": "1 January, 2022",
        "context": "Can we send Nelson there and see if he gets younger there? \n    They put someone in charge that younger people can’t associate with.   If the United States  wants a supportive future they need to attract more youthful participants.  Nelson is too old.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "perogi007",
        "time": "1 January, 2022",
        "context": "Great..I guess Biden will be sending illegals there next.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "FireandManeuver",
        "time": "1 January, 2022",
        "context": "ISS is outdated and not worth more money to keep it propped up.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "nickola13",
        "time": "1 January, 2022",
        "context": "I'm sure the US is footing most of the operational bill to keep this obsolete thing running",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Briareus",
        "time": "1 January, 2022",
        "context": "well, the only countries that can go to the ISS are countries that match or exceed what the USA is paying......that should be the rule...",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "52guns",
        "time": "1 January, 2022",
        "context": "It'd be nice if someone could tell us what we're getting for our dollars.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "All_This_Makes_My_Head_Hurt",
        "time": "1 January, 2022",
        "context": "Is there ANYBODY in this government that is UNDER 80 years old??? ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "timetraveler828",
        "time": "1 January, 2022",
        "context": "Spending a lot of money on a platform that goes no where and does nothing except promote international cooperation. \n\nLet's do something great, go to Mars, plant the American flag, and show the international community what America can do!",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "fuzer",
        "time": "1 January, 2022",
        "context": "America will be under Chinese control by then.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "edwardlarson410",
        "time": "1 January, 2022",
        "context": "When it comes to funding the space program, you really can't believe\nanything that anyone in D.C. says. They've broken their promises hundreds of\ntimes and the program objectives change every time there is a new president,\na new congress, or a new administrator which is to say that every 2 years or so,\neverything changes.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "yogi584",
        "time": "1 January, 2022",
        "context": "Nelson is an alien!!!  Stranded on our planet.  Does he have antenna coming out of his head when he wants to talk to the mother ship?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Briareus",
        "time": "1 January, 2022",
        "context": "Do nothing Bill Nelson, a dinosaur of historical democrat politicians, much like Biden....worthless...brainless...and collecting a check...",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "🍻fizzyliftingdrinks🍻",
        "time": "1 January, 2022",
        "context": "Now if they would just commit to controlling our southern border in 2022 and beyond, they might actually be productive.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "guntherman",
        "time": "1 January, 2022",
        "context": "Nelson is another obviously embalmed senior citizen who doesn’t have a clue.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "wonderhorse",
        "time": "1 January, 2022",
        "context": "expensive playground for the rich. And we get none stick pans. Waste of money.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "nolealum83",
        "time": "1 January, 2022",
        "context": "better to turn it over to commercial interest to operate and began focus on missions to return to the moon and Mars.  US manned space missions have been trapped in low earth orbit for 45 years.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "beachbum483",
        "time": "1 January, 2022",
        "context": "Why would it need any supports? I thought it was just floating there.....",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "seekanfind",
        "time": "1 January, 2022",
        "context": "They should plant a flag on mars that reads FDT.",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "alacran337",
        "time": "1 January, 2022",
        "context": "One word for our \"Dumb Government\", \"DUMB FOOLS!\"",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jse33",
        "time": "1 January, 2022",
        "context": "Beware of any promises made by Brandon, he has a history of not keeping them.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "baseball",
        "time": "1 January, 2022",
        "context": "Uggh!\nTime to stop being a hamster on a treadmill and literally running in a neverending circle around the earth!\nSpend the money on engine technology not based on 1930s Germany and move on past the 3 rock from the sun!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "wonderhorse",
        "time": "1 January, 2022",
        "context": "Space exploration is so 1960's. These days who cares?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "attackhelicopter",
        "time": "1 January, 2022",
        "context": "Not worried about cannibalism? Whew!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "DemandTruth",
        "time": "1 January, 2022",
        "context": "Bill Nelson adding no valve just stealing our taxpayer dollars. One day America will wake up to these blood sucking career politicians ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bidenluvscommies",
        "time": "1 January, 2022",
        "context": "waste of time and money as we give away these technologies to other countries and pay for the majority of the program. These other countries will use the technologies against us eventually",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "vote786",
        "time": "1 January, 2022",
        "context": "That’s nice. If Russians cut diplomatic ties to the US what happens. Remember the Russians own and operate the ISS Propulsion Module and without the Shuttle what is your plan to maintain correct orbit?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "wonderhorse",
        "time": "1 January, 2022",
        "context": "Gonna be so funny if that Chinese rover on the moons darkside discovers evidence of extraterrestrial life with that gate thing they appear to have found. NASA will be peed!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "timetraveler828",
        "time": "1 January, 2022",
        "context": "Whatever happened to JFK's speech: \"We go to the moon and do the other things not because they are easy but because they are hard?\"\nAfter the moon we stopped doing the hard things.\n\nNASA - stop shooting for low orbit and start doing something hard!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "the.morning.after",
        "time": "1 January, 2022",
        "context": "we, the USA did not commit...FJB, the idiot told to do that followed instructions.\nThe true Manchurian Candidate",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "opto86",
        "time": "1 January, 2022",
        "context": "Why is necessary to mention the first woman and first person of color to the Moon?\n\nTrying to make space exploration discriminatory is exploitation.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Ohyeah59342",
        "time": "1 January, 2022",
        "context": "Personal note to Bill Nelson: Too much on the Botox. ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mortyo6",
        "time": "1 January, 2022",
        "context": "Over 20 Years. In orbit? Not buying it.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "thedude2020015",
        "time": "1 January, 2022",
        "context": "Rick Scott sent Bill Nelson packing down here in Florida. By the appearance of that 2018 photo of him, I believe Brandon should pick him for his 2024 reelection campaign.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mortyo6",
        "time": "1 January, 2022",
        "context": "I bet the video of the ISS being built in space is awesome! Oh, I guess they forgot to film it🙄",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "SorosJoe",
        "time": "1 January, 2022",
        "context": "A few facelifts too many...............",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "timetraveler828",
        "time": "1 January, 2022",
        "context": "The International Space Station has had zero cases of COVID!\nBiden asked the NASA chief if its due to everyone wearing a mask?",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "beachbum483",
        "time": "1 January, 2022",
        "context": "The research done on the space station that cannot be performed on earth has the potential to benefit mankind far into the future. Money well spent.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "SharonWalker-Whiteheas",
        "time": "1 January, 2022",
        "context": "Bill Nelson is another bottom feeder liberal. He looks like the walking dead. He needs to retire.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "116164",
        "time": "1 January, 2022",
        "context": "\"advance the research and technology necessary to send the first woman and first person of color to the Moon under NASA’s Artemis program\" Why would the technology be any different, we sent a men to moon in 69, maybe NASA should review that data",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rexit",
        "time": "1 January, 2022",
        "context": "Just keep that dam Communist China off it",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sanecity",
        "time": "1 January, 2022",
        "context": "The money would be better spent developing a better rocket motor than supporting a hosting platform for billionaire space tourists.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Chicagonfire",
        "time": "1 January, 2022",
        "context": "Wow! He’s a live mummy ha",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "wonderhorse",
        "time": "1 January, 2022",
        "context": "I hope China, Russia and others shoot down Musks satellites. What right do these trillionaires have to ruin the night sky for the entire planet?",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "MoreMajorum",
        "time": "1 January, 2022",
        "context": "It's fun spending other people's money.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "pale_rider",
        "time": "1 January, 2022",
        "context": "Bill is pocketing how much?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rednek16",
        "time": "1 January, 2022",
        "context": "Support the ISS for another 8 years...sure, keep the antique up there and give other nations access to emerging technologies and America's capabilities and focus on the ISS, while China and Russia move towards space domination.\n\nSo thankful Elon Musk is moving towards Mars, the skills and technology he creates will counter NASA's complacency.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "infinitetime",
        "time": "1 January, 2022",
        "context": "Space station has used up it's usefulness. It's important America establish a Moon base.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "genchur",
        "time": "1 January, 2022",
        "context": "Is everyone running our government an 80 year old fossil?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "genchur",
        "time": "1 January, 2022",
        "context": "Is everyone running our government an 80 year old fossil?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "traf",
        "time": "1 January, 2022",
        "context": "Wonder if this old goat uses Plaster of Paris on his ugly mug,.....just like old Mother Pelosi?",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "AL.Lopez",
        "time": "1 January, 2022",
        "context": "Wait up a NY minute. Bill Nelson was defeated by the people in 2018 in his race for his 4th term as senator. So now, he is promoted to a position where his decisions affect thousands of lives? That is freaked out! Appointed by POTUS, of course.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "timetraveler828",
        "time": "1 January, 2022",
        "context": "If NASA had been running Spain's exploration program in 1492 they would have had the fleet sitting in a Spanish harbor with foreign sailors on it after discovering America .",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mrdeplorabletoyou4",
        "time": "1 January, 2022",
        "context": "\"Ground control to Geezer Bill\"",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "WhiteStar",
        "time": "1 January, 2022",
        "context": "I am glad we have Elon Musk to lead America in space exploration. NASA has continued its slide toward irrelevance which began under Barry's and Bush's reign. The appointment of a Democrat politician to NASA at this time seals the deal.",
        "good": "4",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "robstew500",
        "time": "1 January, 2022",
        "context": "Make Earth great again!",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "wingedrat",
        "time": "1 January, 2022",
        "context": "I think it is a great thing to do. A few more people on this high tech. ride and safe return. It will be in a theme park soon.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "wonderhorse",
        "time": "1 January, 2022",
        "context": "When we have none-polluting reusable electric space rockets, then is the time man kind can go explore space. But until we get the massive pollution issue sorted, space should not be a playground for the rich.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "censorwrap",
        "time": "1 January, 2022",
        "context": "If the federal government could spend $640 on a Toilet Seat and billions on planes never put into production can you imagine the money thrown away on something that we can not see, taste, hear or feel….and the only way to bring it back down is to hopefully burn it up on reentry. Boggles the mind……some bean counter somewhere knows the bottom line.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "BlueBucket",
        "time": "1 January, 2022",
        "context": "Got to keep spying on everyone on the planet don't we?\n\"The stated mission of the International Space Station is to enable long-term exploration of space \"\nSo the ISS can travel the Universe like the Enterprise? Who knew? WOW!",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "timetraveler828",
        "time": "1 January, 2022",
        "context": "The first female and black to the moon?\nDidn't the Democrats learn anything from picking Karmala Harris for VP?",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "trappertn",
        "time": "1 January, 2022",
        "context": "ISS is an old, obsolete, derelict space station. Maintenance and viability have exceeded its value. It has served its purpose. Set it on trajectory to the Sun or it will soon become just more space junk orbiting the Earth. If the US hadn’t funded the cost other countries involved would have let it burn up on reentry into Earth’s atmosphere years ago.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "motie",
        "time": "1 January, 2022",
        "context": "Until someone comes along and says otherwise, this is OUR solar system, along with all of its resources.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "wonderhorse",
        "time": "1 January, 2022",
        "context": "Russia gives the world the gift of space exploration. The US turns it in to a playground for the super rich. Such progress.....",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "FB*6594",
        "time": "1 January, 2022",
        "context": "Can we please fix our Southern border BEFORE we spend any more money on space? Space doesn't have a drug\\terrorist\\illegal alien problem right now, but we do!!!\n\nFJB & his regime",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "hippieron275",
        "time": "1 January, 2022",
        "context": "Can NASA defeat COVID with research done on the ISS?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "CanYouHandletheTruth034",
        "time": "1 January, 2022",
        "context": "Come on, Elon. When are you gonna build that Space X permanent station in Earth orbit? The manufacturing possibilities are endless. People would pay you to let them work and live there. Your Mars ships could be built and leave from there. You could declare it an independent country with NO taxes. Think of the Musk Coin mining possibilities. Free solar power to beam on down for profits. You wouldn’t even need Scotty.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "genchur",
        "time": "1 January, 2022",
        "context": "Is any science being accomplished that a hot air balloon couldn’t?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "AH1933",
        "time": "1 January, 2022",
        "context": "What  exactly do they do up there?  Has anyone’s life improved by having a space station?  How about taking care of us earthlings and spend the cash here in the USA. ",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "StrengthOfTen",
        "time": "4 January, 2022",
        "context": "A few years ago there used to always be comments on space articles saying space travel and the moon landings were fake.\n\nAt last that's stopped.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "shavedkitty69",
        "time": "2 January, 2022",
        "context": "i keep drinking but i ain't getting drunker",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Rathgic",
        "time": "1 January, 2022",
        "context": "What does Biden care.   He's already spending trillions and passing it on to future generations to pay.  \n\n \nIn my view it lost any particular usefulness years ago.    How is being weightless, which never happens on earth relevant to much of anything, given the huge cost.\n\nJust a very expensive play toy for scientist looking for something to do.  Anything will do.\n\nRight up their now, with the filthy rich going up to weightlessness for a few minutes,  as absurd cost,  that could accomplished any of many needed things to do here on earth.\n\nMaintaining the space station is causing huge amounts of money to not be available for much needed purposes.   And that should be the MAIN CRTITERION FOR SPENDING ANY GOVERNMENT MONEY:\n\n             WHAT ARE WE GIVING UP?    Anything can be justifies, even if meaningless unless we always considered how else it could be spent.  \n\n            But then we don't give up anything...... we just pass it on to future generations to pay, like they don't have their own expenses to pay.\n\n        But bondholders of our worthless principle bonds that will never be paid off,  just reissued over and over to change the name of the owner and look like they didn't default on being paid. BEWARE . Some future generation, with self respect, which  people who don't  pay their bills do not have is not going to bail you out of your poor investment.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "freebirdhankster",
        "time": "1 January, 2022",
        "context": "The World will End by then due to Man Made Climate Changes, so Why Bother?  (Make that WHITE Man Made Climate Change)",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "disappointed5525",
        "time": "1 January, 2022",
        "context": "I think continuing U.S. - Russian cooperation is very helpful in detering hostilities between the two nations and thus a very positive thing.  But why has NASA become obsessed with race and gender?  Surely if anyone can move beyond those absurd limitations, it would be NASA!  Yet, here we are!  ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    }
]