[
    {
        "user_name": "OneVoiceofReason",
        "time": "23 January, 2019",
        "context": "We never had this problem with RC planes and helicopters because drones are too easy to fly. A four year old can fly one with a few minutes of training. They should install an RFID style chip in every drone that will show up on air traffic controller's screens so they will know exactly where it is and it's registered serial number, just like a transponder in an airplane.",
        "good": "14",
        "bad": "0",
        "replies": [
            {
                "user_name": "PurpleAirBalloon",
                "time": "23 January, 2019",
                "context": "And on the transmitter that is controlling it.",
                "good": "9",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "quintleo",
                        "time": "23 January, 2019",
                        "context": "On the drone makes sense, on the transmitter doesn't - it's not the transmitter causing the issues.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "Guest1234567890530",
                "time": "23 January, 2019",
                "context": "The transmitter is held by the person responsible that needs to be apprehended and held accountable.",
                "good": "11",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "magabeliever",
        "time": "23 January, 2019",
        "context": "Just have drones fly vectors . Have to communicate with local air traffic if you want to fly near airport.  Why don't they do this?  Then if in violation you would hold the person responsible.  I don't know much about these things but maybe it would help as this seems to be happening more often",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "ralph078",
                "time": "23 January, 2019",
                "context": "I think they would need transponders for that - probably way too heavy for a drone.",
                "good": "3",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "cupohemlock",
                "time": "23 January, 2019",
                "context": "They do.  Typically one cannot fly a UAV within controlled airspace without ATC clearance.  Whomever was piloting this drone was violating the law, likely on purpose.  Those of us who are responsible and licensed by the FAA condemn the actions taken by these reckless individuals.",
                "good": "9",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "twsides122",
                        "time": "23 January, 2019",
                        "context": "More proof that more laws won't stop the problem.  If someone is going to break the laws that are on the books now, adding a dozen more won't stop them from doing it again.",
                        "good": "11",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "error": "error"
    },
    {
        "error": "error"
    },
    {
        "user_name": "PurpleAirBalloon",
        "time": "23 January, 2019",
        "context": "Tracking technology to find the control transmitter must exist.  Needs to be disseminated to potential danger areas such as airports (and the airport police).",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "doefromprover",
        "time": "23 January, 2019",
        "context": "Find the frequencies they use and equip airports with a low-power \"white noise\" transmitter at those freqs.  Mandate that all civilian drones MUST be built to use those freqs.  Maybe not a complete solution - but it's a start...",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "nelccfl",
        "time": "23 January, 2019",
        "context": "Maby it's ET",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "IT'SMAGATIME",
        "time": "23 January, 2019",
        "context": "liberals being terrorist with their toys.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "RedButterfly",
                "time": "23 January, 2019",
                "context": "You win the dumbest comment of the day (so far)!",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "captainjack12",
                        "time": "23 January, 2019",
                        "context": "po little the truth hurts don't it?",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "twmat311",
        "time": "23 January, 2019",
        "context": "The common complaint is that these things are fast to get away - they do their thing, and they're gone.  No responder is going to catch them at the scene; you have to tag or record them as it happens, then track them down.  Or, have an airplane-safe instant disabler or barrier to prevent airspace breach.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "theghost4",
        "time": "23 January, 2019",
        "context": "Someone better act now.  It's only a matter of time until a $150 toy takes out an aircraft.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "error": "error"
    },
    {
        "user_name": "rightvinny",
        "time": "23 January, 2019",
        "context": "Drones of any size are a menace to aviation. It's not a matter of IF an accident will happen, but WHEN.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "polban1",
        "time": "23 January, 2019",
        "context": "Anti-drone devices have existed for many years. Airports simply need to invest in them.\nIt's like crying about a headache with a bottle of tylenol sitting next to you.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mrdepro706",
        "time": "23 January, 2019",
        "context": "What's stopping a terrorist from bringing down a plane in a high populated area...",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "RexfordL",
                "time": "14 March, 2019",
                "context": "There are a lot easier ways to bring down an airliner than trying to do it with a drone.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "error": "error"
    },
    {
        "user_name": "gallowspoll",
        "time": "23 January, 2019",
        "context": "Drones should have VIN numbers like cars.",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "error": "error"
            }
        ]
    },
    {
        "user_name": "7seascaptain",
        "time": "23 January, 2019",
        "context": "Now, when drones are outlawed or require training and expensive permits, we will all remember why lawmakers deemed it so.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sailingnewyork",
        "time": "23 January, 2019",
        "context": "I wish journalists would proofread their stories.  This story is unclear as to what happened.   What is a ground stop?  If the drone was at 3,400 feet, how was it within 30 feet of a plane that is at a ground stop?",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "error": "error"
            }
        ]
    },
    {
        "user_name": "glidingbuzzard680",
        "time": "23 January, 2019",
        "context": "Where is the blurry, shaky video of it?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "my_2_sense",
        "time": "23 January, 2019",
        "context": "Lasers and drones -- small prices for big hazards.  Makes the age-old knock of commercial airline pilots against general aviation violating their airspace seem insignificant.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "PhriendlystrangeR",
        "time": "23 January, 2019",
        "context": "what's everyone droning on and on about?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "madjack990",
        "time": "23 January, 2019",
        "context": "Since people can't play nicely with their toys here is what should be done. All drones should be required to have a valid VIN, just like a motor vehicle. All drones should require registration and license that would be renewed annually. The license would need to be transferred any time the drone changes ownership. A registration number must be visible on the drone. Operating an unregistered drone would be subject to a fine, just like operating an aircraft without registration.\nThere is a device that looks something like a gun used to capture drones. The radio signal between the drone and controller is not all that secure. When pointed at a drone the operator can take full control. and safely land the drone. Since the drone would be registered, the owner could be tracked down and fined.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "abraham12",
        "time": "23 January, 2019",
        "context": "This is nothing.\nWait until Amazon puts thousands of these in the air and they start getting hijacked by hackers!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jrdrag",
        "time": "23 January, 2019",
        "context": "Claims? Was there ever a reason to doubt the words of a pilot in the air with passenger's safety being put at risk by a drone nearby? It happened. Do something about it.",
        "good": "8",
        "bad": "0",
        "replies": [
            {
                "user_name": "skyefox23",
                "time": "23 January, 2019",
                "context": "Actually CNN immediately brought on some random nonpilot guy who promptly said that the pilot was lying, it couldn’t have been a drone, and there was no way the pilot would be able to see it going 400mph. This is what they call reliable reporting, despite the fact the guy had no experience, no knowledge, and clearly didn’t know about a) the speed limit in a class bravo, or 2) planes slow down to 120-170mph when on approach to land so it’s actually very easy to spot things like birds and drones.",
                "good": "2",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "jigsaw53",
                        "time": "23 January, 2019",
                        "context": "Maybe you need to go back a reread,It said 400 ft. not 400 mph",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "error": "error"
            },
            {
                "user_name": "skyefox23",
                "time": "23 January, 2019",
                "context": "I'm talking about the guy on CNN who said 400mph.  Has nothing to do with the max altitude for drone operators (which they ignore).",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "Talaysia",
        "time": "23 January, 2019",
        "context": "So…was there a drone or not?\nMy drone drains its battery with all of the flashing lights on it and things like that are noticeable even more so at an airport.\nBut the thing that gets me thinking about it is that this, the third thing I've read about it, all fail to get past the \"Well, this one pilot who flies for this one airline said…\" except there is no known pilot or airline the pilot flies for who saw a drone on Tuesday. No one on the ground reported one.\nSee how hard it can be to be a critical thinker?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "notalib.",
        "time": "23 January, 2019",
        "context": "Guess what al gore invented?",
        "good": "3",
        "bad": "0",
        "replies": []
    }
]