[
    {
        "user_name": "dan5047628",
        "time": "4 August, 2022",
        "context": "Beach fertilizer",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "skeff",
        "time": "4 August, 2022",
        "context": "The Sargasso Sea has been around for centuries. It covers a vast area of the North Atlantic east of the Caribbean. It's just shifted a bit. However, this does provide some employment opportunities. As far as desalinated water for the power plant so the rich folks have air conditioning goes, I'm not too upset.",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "iffartshadteeth",
        "time": "5 August, 2022",
        "context": "mother nature doing it's thing..... cleaning itself, feeding itself....being itself\n\nwith more 'bunker fish' there needs to be more food for them and places for them to hide and breed.....it inconveniences 'man' so we complain and look for things that caused it or for things to get rid of it\n\nthis could well be a sign of regrowth, or a reward from mother nature for the work done to keep shorelines cleaner\n\nso what if it is because of climate change; that's been going on for billions of years",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "beadgBass",
        "time": "6 August, 2022",
        "context": "I defy any of you to disprove a connection of this to anthropogenic global warming.\nWe know AWG is real, so tell us this is nothing but a \"cyclical\" thing, though we've never seen it in human history.",
        "good": "3",
        "bad": "0",
        "replies": [
            {
                "user_name": "conservative_soldier",
                "time": "13 August, 2022",
                "context": "Exactly!\nNo amount of money can turn off the Sun, or the normal cycle of Earth.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "cb1882",
        "time": "4 August, 2022",
        "context": "\"... possible factors include a rise in water temperatures as a result of climate change..' \nMan's ego is such that if he sees something for the first time, he concludes it is the first occurrence in the billion year history of the planet.",
        "good": "8",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "Valério",
        "time": "4 August, 2022",
        "context": "The liberal green energy policies are not helping but they are making things worse. Even seaweed piles up when liberals are in power.",
        "good": "7",
        "bad": "2",
        "replies": [
            {
                "user_name": "HoodoooVoodooBlood",
                "time": "4 August, 2022",
                "context": "Mr. GoodNews, \nThe results of your SonoGram and CT Scan with Contrast indicate that your head is lodged in a very dark, dank, malodorous region of your body. My assistant here at the Clinic can do an extraction, if you'd like. There will be a brief recovery time, about an hour, or, so. \nHowever, many people like yourself prefer to keep their heads lodged in that area and are surprisingly, very content and happy... and they seem to enjoy the view. \nJust let the front desk know, on your way out Mr. GoodNews, if you'd like that extraction. \nThanks for coming in today. Goodbye.",
                "good": "2",
                "bad": "2",
                "replies": [
                    {
                        "user_name": "thunker54",
                        "time": "4 August, 2022",
                        "context": "Trying to be humorous and insulting at the same time. Epic fail. Don't quit your day job - IF you have one.",
                        "good": "2",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "lycopine",
                "time": "6 August, 2022",
                "context": "kind of like MAGAts piled up when they were in power... and tried by force to keep it?",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "americanmight",
                        "time": "6 August, 2022",
                        "context": "They’ll be “in power” again….soon.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "Just-My-Opinion",
        "time": "5 August, 2022",
        "context": "If it looks like sewage it is sewage. Forger about climate change. Rolaw sewage has been dumped into our oceans from everywhere on earth. India, China, Mexico, Not to mention the poorest of countries",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "brylcreamboomer",
        "time": "8 August, 2022",
        "context": "My guess - lots of untreated water from Sewage plants. It acts like fertilizer and the plants go nuts. Eventually the sea weed becomes disconnected and starts to float where the wind and waves pile it up on the shore. BILLIONS of flies show up and feed on it. They bite people too.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "GreenCar",
        "time": "6 August, 2022",
        "context": "Use it for compost!",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "carnotaurus",
        "time": "4 August, 2022",
        "context": "Saw this first hand at Cocoa Beach. Couldn't even fish from the shore as there was so much of this stuff.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "conservative_soldier",
        "time": "13 August, 2022",
        "context": "You can't control the Sun people!!!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "disbarr",
        "time": "14 August, 2022",
        "context": "Why was this not harvested by China? Communists love a salty snack!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dan5047628",
        "time": "9 August, 2022",
        "context": "It happens",
        "good": "0",
        "bad": "0",
        "replies": []
    }
]