[
    {
        "user_name": "fractiousinfidel",
        "time": "12 July, 2022",
        "context": "OK, who squealed?",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "exmark",
        "time": "12 July, 2022",
        "context": "So much effort to prolong life, and so little effort to prepare for death.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sentient-chatbot",
        "time": "12 July, 2022",
        "context": "Lot's of brain dead Biden supporters to practice on...",
        "good": "2",
        "bad": "1",
        "replies": [
            {
                "user_name": "fractiousinfidel",
                "time": "12 July, 2022",
                "context": "Abi who?",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "cakepronoun",
        "time": "12 July, 2022",
        "context": "Our technological advances are breathtaking.  As a young child, my dad and I visited my dad's friend in the hospital after that friend had a heart-attack.  Dad told me on the way out that there was nothing anyone could do about heart problems.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "fdr350",
        "time": "12 July, 2022",
        "context": "I'm so glad Ginni Thomas volunteered for this procedure",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mucaro",
        "time": "15 July, 2022",
        "context": "They will kill innocent pigs to save people.\nThey are not saving any lives.  They are breaking even, at best.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "johnch22",
                "time": "23 July, 2022",
                "context": "Where do you think pork comes from?",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "mucaro",
                        "time": "24 July, 2022",
                        "context": "That's besides the point.  I'm just clarifying the math.  If all life counted, they are breaking even.  I have nothing against that, but the statement is inacurate.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "johnch22",
                                "time": "24 July, 2022",
                                "context": "So you value the life of humans the same as pigs?",
                                "good": "0",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "mucaro",
                                        "time": "24 July, 2022",
                                        "context": "No, you said that, not me.  Just read what I wrote, not between the lines.  The general term \"life\" has one definition only, what distinguishes a functioning being from a dead body.\nIn simpler terms, if a human is alive and a pig is alive, then we have two lives.  They doctors in this article saved human lives, not lives.\nYou need to work on your reading comprehension.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "noitanimirscid",
        "time": "12 July, 2022",
        "context": "Hey NY, DeBakey and Cooley did this in Houston about sixty years ago.",
        "good": "0",
        "bad": "1",
        "replies": [
            {
                "user_name": "ourlordandsaviordonaldjtrump",
                "time": "12 July, 2022",
                "context": "No, they were great surgeons who made great advances in heart surgery but I'm sure they would be the first to applaud these advances.  I'm from Houston and this is not about bragging rights.  As a Houstonian, I can assure you that decades of watching the Astros, Oilers, Rockets, Aeros, Gamblers Hurricane and everyone else lose that's not important to us.\n\nNo, I don't even care that the Spastros finally won something.  They don't even play at the Dome anymore.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    }
]