[
    {
        "user_name": "dechris2",
        "time": "2 days ago",
        "context": "The KGB rides again.  Putin would be so proud.",
        "good": "10",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "broodingprussian",
        "time": "2 days ago",
        "context": "The FBI - Biden's KGB.",
        "good": "22",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "shirleyurong",
        "time": "2 days ago",
        "context": "FBI is the New Gestapo. Defund the FBI. Whoever thought this could happen in America?",
        "good": "36",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "warrenjamesonx",
        "time": "2 days ago",
        "context": "The head if the FBI is being played by the Democrats and all look like hacks",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "User1142",
        "time": "2 days ago",
        "context": "Hoover’s company going back to their roots of being the political police for the administration",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "taxslave033",
        "time": "2 days ago",
        "context": "FBI was serving a felony warrant on someone known to have firearms.  Sounds like fairly standard procedure.",
        "good": "4",
        "bad": "14",
        "replies": []
    },
    {
        "user_name": "thanks412",
        "time": "2 days ago",
        "context": "shame on those fbi  agents that did not have the guts to stand up to their puppet socialist bosses and say we only two and one car no armor and no guns this is a private law-biding American citizen \nthese are probably the same agents that searched Melanie's underwear drawers\nreal classy you should all be ashamed of yourselves for putting those innocent children through your gestapo tactics real classy how can you look in a mirror",
        "good": "9",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "voting4trump2024",
        "time": "2 days ago",
        "context": "Welcome to the democrats new fascist banana republic where they go after their political opponents with the gestapo fbi in their quest for one party rule!",
        "good": "12",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "fredm2022",
        "time": "2 days ago",
        "context": "I guess if the guy is on your side politically it's OK for him to push 70-year-olds to the ground.",
        "good": "6",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "eileen965",
        "time": "2 days ago",
        "context": "When Republicans retake Congress fire the DOJ & FBI. Thanx",
        "good": "10",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "americaunderattack270",
        "time": "2 days ago",
        "context": "This country is headed for war, we just need to have a republican president at the time so he has access to the military",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "espi17",
        "time": "2 days ago",
        "context": "If the GOP takes the House and Senate and does not make the FBI pay for these acts.....shame on them.  This is not OK.  Not America.",
        "good": "32",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "nomobrandon",
        "time": "2 days ago",
        "context": "Where has America gone?  I want to go there....",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "avatarofpan",
        "time": "2 days ago",
        "context": "How can we keep the public believing The Big Lie that Hannity always pushes that “It is only a few bad apples “ with stuff like this, the over three hundred cops hanging out in Texas as children died, the unjust raid on Trump’s home, the parents being arrested at school board meetings for trying to protect their children from grooming. The pastors being arrested for holding service. The unjust prosecution of those in DC on January sixth and all the other stories of the abuses of law enforcement.  Republicans are learning the truth and it must stop!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "blairzo",
        "time": "2 days ago",
        "context": "The FBI and DOJ are in the dems pockets",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "hobo080",
        "time": "2 days ago",
        "context": "There are more important issues to address than abortion.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "samintacoma",
        "time": "2 days ago",
        "context": "They need to understand that these intimidation tactics will not intimidate us, they will just awaken us to the threat and fill us with a terrible resolve!",
        "good": "32",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "j.mapleseed",
        "time": "2 days ago",
        "context": "The FBI has become the DBI. The Democrat Bureau of Investigation.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bendoverusademssay",
        "time": "2 days ago",
        "context": "FBI activists loyal to democrats are just trying to keep abortion in the news as November approaches.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "fredm2022",
        "time": "2 days ago",
        "context": "Six children? If not abortions, he or his wife at least need some sort of birth control.",
        "good": "0",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "wisconsinconservative751",
        "time": "2 days ago",
        "context": "The first mistake was thinking there is any moral code with this administration.   Look for the dark side, 99.9% of the time that's their stance.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jeffkelly695",
        "time": "2 days ago",
        "context": "The DOJ, and FBI have lost all credibility Americans no longer trust them!",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "patrickhenry0076",
        "time": "2 days ago",
        "context": "This is what I consider crimes against America and in 2023 I want all Democrat Communist Dark Siders that have committed crimes against America to be prosecuted and convicted.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "msicf",
        "time": "2 days ago",
        "context": "IRS weaponized. DOJ weaponized. FBI weaponized. Stay tuned.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "culturegeek410",
        "time": "2 days ago",
        "context": "Meanwhile, no prosecution against members of Jane’s Revenge, who organized vandalism to buildings housing pro-life organizations, or those responsible for burning churches. Such is the world we live in!",
        "good": "57",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "nomobrandon",
        "time": "2 days ago",
        "context": "Quit excusing actions of the FBI rank and file.  I was \"only following orders\" doesn't absolve Nazis and doesn't wash for our thugs either.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "erinmclaughlin",
        "time": "2 days ago",
        "context": "So much for biden claiming he wasn't going to weaponize the DOJ.  Everything said in Biden's   inauguration speech, he has done the complete opposite.  Clearly, biden is not running the country as the staff are doing what they want to.  \"just sign here, Joe and all will be taken care of\"",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "norinos358",
        "time": "2 days ago",
        "context": "The FBI is operating more and more like the Gestapo!",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "kingofgoats459",
        "time": "2 days ago",
        "context": "EXACTLY why the founders limited power, perhaps a reminder is in order. A reorganization of ALL federal agencies is far past due. Congress gave away their oversight powers at the direct expense of the citizens and Constitution.",
        "good": "63",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "lboo",
        "time": "2 days ago",
        "context": "What was a 12 year old doing protesting?  The concept of abortion seems to me to be beyond a  12 year old's comprehension.  Protests are no place for children given the propensity to get violent.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "BigPicture416",
        "time": "2 days ago",
        "context": "I am not one to believe our FBI but compared to the Christian ANTIFA they are honorable. No bigger group of self serving sociopaths than Christian activists.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "version7",
        "time": "2 days ago",
        "context": "I seriously doubt he pushed anyone and if he did, it's was probably in self defense...  But to know for sure, let's see the videos....  let's see them now.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "avatarofpan",
        "time": "2 days ago",
        "context": "You act as if this corruption of law enforcement is something new!\nIt is not.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cm141",
        "time": "2 days ago",
        "context": "Where has our beautiful America, the land of the free, gone?\nWe are now the land of deception, crime, and chaos.\nAll thanks to traitor Joe Biden and word salad kammy giggles, (and their demonic handlers).",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "pauler800",
        "time": "2 days ago",
        "context": "So, when the FBI arrests an actual groomer, Republicans are really mad. \"The King’s Men, a Catholic ministry that aims to spiritually mentor young Catholic men.\" And, apparently, teach them to harass women seeking healthcare.",
        "good": "1",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "pseodospurious",
        "time": "2 days ago",
        "context": "Why is it always the those who skirt the law compllain when law enforcement, enforeces the law?  If Al Capone were alive today he would call being brought to justice a political witch hunt.",
        "good": "1",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "Command_Shift_Right",
        "time": "2 days ago",
        "context": "A page ripped right from the stormtrooper's handbook. \"If we can do this to him, we can do this to you. We're coming.\"",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "truewest",
        "time": "2 days ago",
        "context": "'scuse me, Mr. Garland....isn't threatening and intimidating Federal Judges also a FEDERAL offense?",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mattgaetzsvenmo",
        "time": "2 days ago",
        "context": "Republican victimhood is a known mental illness.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "RPH937",
        "time": "2 days ago",
        "context": "It’s the political arm of the Biden administration, whose job is to persecute and intimidate those who speak out against them.",
        "good": "43",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sheldorris",
        "time": "2 days ago",
        "context": "All you need to know about the FBI,DOJ and IRS.....\n\nsecret police\n\nnoun\nA police force operating largely in secret and often using terror tactics to suppress dissent and political opposition.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Bumpkinpatch",
        "time": "2 days ago",
        "context": "More lies from the DOJ and FBI.   ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Tortuga",
        "time": "2 days ago",
        "context": "Certainly a summons to appear rather than an all out armed presence by several agents would’ve been sufficient ",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dpt",
        "time": "2 days ago",
        "context": "Impeach Garland and Wray.  Investigate FBI and jail all corrupt agents!!!  The DOJ and FBI have failed America since they were weaponized by President Obama and corrupted by Biden!!",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "0ldtime'r'",
        "time": "2 days ago",
        "context": "hahahahaha,now ya-gone-and-done-it!!!!!!!! FEDS made a huge mistake now! hahahahahha",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "lsg834",
        "time": "2 days ago",
        "context": "Apparently we’re now in a police state. If this doesn’t frighten people, I’m not sure what would. People have trouble believing that this type of political intimidation can happen in the U.S., but it’s here. ",
        "good": "51",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "scottyknows58",
        "time": "2 days ago",
        "context": "Hey Honey! I am going to take Junior with me and use him for cover while I yell and scream at young women in front of the Abortion clinics. \nOk Dear! I will make you two sandwiches in case you get hungry. \nTop Dad and Mom of The Year teaching their 12 year old the ropes so he can be a chip off the ol Top Dad block.",
        "good": "5",
        "bad": "9",
        "replies": []
    },
    {
        "user_name": "LeftcalimovedtoAmerica596",
        "time": "2 days ago",
        "context": "He should be going away for overpopulating the earth. 2 kid max buddy. ",
        "good": "1",
        "bad": "9",
        "replies": []
    },
    {
        "user_name": "DT1944",
        "time": "2 days ago",
        "context": "What is going on with the DOJ and the FBI? Are they trying to mimic the STASI from East Germany? They are now becoming the population most feared political group.",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Wxtz",
        "time": "2 days ago",
        "context": "Welcome to a country ruled by the real fascist neo-communist Democrat Party.  Their keeping power over you is what everything is about now. ",
        "good": "11",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Dm1217",
        "time": "2 days ago",
        "context": "The DOJ is the American Gestapo.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "FreeAMERICANWins",
        "time": "2 days ago",
        "context": "FBI is a total joke years ago they were respected now no one respect them . and the DOJ is the Gestapo for the Democratics ",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sheldorris",
        "time": "2 days ago",
        "context": "Sure hope he has not spoken at  a school board meeting recently or Garland will seek the death penalty.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "starcomederadiputs",
        "time": "2 days ago",
        "context": "abolish the FBI.  CORRUPT",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "TBD602380",
        "time": "2 days ago",
        "context": "There's a strong case to be made for a motion to dismiss the charge being granted, based on the intent and/or nature of the law's purpose itself. \nThis so-called \"assault\" did not emanate out of any attempt to block or prevent entry to an abortion clinic, or to harm anyone specifically because of their employment by a clinic, but rather it (the alleged assault) was personally directed at a specific individual who had mistreated his son, i.e. a father protecting his child. IOW, this law does not apply.",
        "good": "45",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mrcub",
        "time": "2 days ago",
        "context": "One simple question -does the statute used as a basis to arrest this man have an \"intent\" provision.  Meaning, must they prove the man intended to prevent the creepy old man from entering the building or was the father simply protecting his son?\n\nThe DoJ and the FBI have been allowed to become political weapons wielded by democrats.  I don't want the pendulum to swing the other direction but that might be the only way democrats understand the consequences of their actions.",
        "good": "28",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Bluefish346",
        "time": "2 days ago",
        "context": "Why is the 72 year old man’s identity kept secret… and the fact that the man didn’t show up for his court proceedings., tells me that the department of justice is trying to intimidate Pro lifers.  What does that tell you about the department of justice and the government that’s running it…",
        "good": "49",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "joed123",
        "time": "2 days ago",
        "context": "Why is this a federal issue?",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "d-3",
        "time": "2 days ago",
        "context": "Federal Bullies Incorporated.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "vote4liz",
        "time": "2 days ago",
        "context": "Houck is a \"celibacy educator\"? That's a thing?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Taxpayingcitizen143",
        "time": "2 days ago",
        "context": "I love my country but I’m ashamed of my fellow Americans for allowing this level of corruption without standing up for each other. It’s We the People, not We the Government. Let that sink in while y’all fight with each other over a political side that only acknowledges you when they need a vote.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "felix2742",
        "time": "2 days ago",
        "context": "So the Stalinist Gestapo, formerly known as the FBI, shakes down the Pillow Guy one week and this citizen who was merely defending his kid the next. They must be so proud at how far they've fallen in such a short amount of time",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jabrony",
        "time": "2 days ago",
        "context": "The f.b.i must be dismantled and abolished with no benefits. They are plenty of prisons looking for correctional officers.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "gadsden_one",
        "time": "2 days ago",
        "context": "Welcome to the Fascist States of America.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "SickofCriminals",
        "time": "2 days ago",
        "context": "I hope Trump wins in 2024, so he can have AG Garland arrested and jailed for corruption and political bias.",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Backwin",
        "time": "2 days ago",
        "context": "We now know what it’s like to live in North Korea, but with McDonalds …..and college football… ",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "macsimone",
        "time": "2 days ago",
        "context": "Gestapo like actions intended to terrorize. I’d be embarrassed to be a FBI agent  ",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mikeb1",
        "time": "2 days ago",
        "context": "Vote Republican. Then we can put these Facists in jail where they belong. Jail them or worse. ",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "vetnvolly526",
        "time": "2 days ago",
        "context": "What’s next?\n\nKristallnacht!\n\nThis administration constantly accuse other of fascism, while they blatantly practice it!",
        "good": "7",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "tigermike",
        "time": "2 days ago",
        "context": "The FBI has become nothing more than hatchet  man institution for the left. If the Republicans  take control of congress  in the midterms  then  there needs to be a complete overhaul  of the institution up to and including the firing of the Washington  office from the top to the janitor.....",
        "good": "4",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "Outlaw72",
        "time": "2 days ago",
        "context": "The Department Of Injustice and Federal Bureau Of Intimidation think their actions will only scare people into being submissive and quiet. ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "PapiBruno1",
        "time": "2 days ago",
        "context": "DOJ and FBI worse than fake news! They are part of the deceitful fraudulent incompetent incapable diabolical democratic mob! Democrats destroying America! Vote them all out and save America ",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "SheikYaboody",
        "time": "2 days ago",
        "context": "Too outrageous to be true. There has to he more to the story. Why did it take a year to execute an arrest warrant for simple assault?",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "SickofCriminals",
        "time": "2 days ago",
        "context": "If the Republicans take over in 2024, I hope the FBI Management from Director Wray on down to every GS15 Democrat Activist is replaced with non-political personnel.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "RM3USN",
        "time": "2 days ago",
        "context": "Don't be intimidated. We outnumber and out gun.",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "stephen76",
        "time": "2 days ago",
        "context": "Shame on the. FBI who’ve become the new Gestopo",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "FJRB",
        "time": "2 days ago",
        "context": "Garland is no different than Hermann Göring.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "oh,please...",
        "time": "2 days ago",
        "context": "Every agency not in the Constitution should be permanently shut down, period. Enough.",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "justsomethoughts501",
        "time": "2 days ago",
        "context": "25 agents to arrest someone with 6 young children and no criminal record.  A little over the top.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "justiceneedsserved",
        "time": "2 days ago",
        "context": "Get used to it.  Over the top FBI raids are a good start.  Wait until the IRS descends upon us",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "vote4liz",
        "time": "2 days ago",
        "context": "The Gospel According to Karen...And Jesus said, go spread my truth far and wide, and if you should not be listened to, assault an elderly man, twice. \nAmen",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dtc61",
        "time": "2 days ago",
        "context": "AND, who is it that actually trusts either DOJ, the WH or FBI?    When you politicize EVERY aspect of what is supposed to be \"equal justice for all\" then what you get is totalitarianism- that is what the democrats and this president have brought to the nation.   I do not trust any of them especially when it comes to those who do not agree with their positions or policy.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Binhthuy",
        "time": "2 days ago",
        "context": "People wake up their coming after you like the NAZI’s did.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "covidfighter1",
        "time": "2 days ago",
        "context": "This is the bully that pushed down a 72-year-old man twice, right?  Party of law and order.   Lol 😆",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "gadsden_one",
        "time": "2 days ago",
        "context": "No people are more dangerous than those who have been pushed too far and have no where else to go.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dingedong",
        "time": "2 days ago",
        "context": "Vote Republican to save our country!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "heyzeuschristo",
        "time": "2 days ago",
        "context": "Too bad they didn't late term abort him.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "scienceisreal127",
        "time": "2 days ago",
        "context": "Gee, maybe you shouldn't have assaulted a 72 year old man?",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "this_might_hurt",
        "time": "2 days ago",
        "context": "He drove two hours with his 12yr old to MIND OTHER PEOPLE’S BUSINESS.",
        "good": "3",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "st1950",
        "time": "2 days ago",
        "context": "Gotta love Merrick Garland - bless his heart - he didn't make it to the SC so now he is angry and taking it out on all conservatives in his quest to get even!  The more he does this - the more he reinforces why he is NOT on the SC.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "realM16",
        "time": "2 days ago",
        "context": "17 act of terrorism by jane’s revenge on pro life clinics, zero suspects zero arrests\nA man defends his child on a public sidewalk and the doj sets up a grand jury to prosecute him…yup makes sense",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mattgaetzsvenmo",
        "time": "2 days ago",
        "context": "Guy claims to be a “masculinity expert” and brings a 12 year old to intimidate and harass women walking into health clinics 😂",
        "good": "1",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "VeritasDLI",
        "time": "2 days ago",
        "context": "No difference between that and the Gestapo.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Jasmine101",
        "time": "2 days ago",
        "context": "The FBI and the DOJ have become the ruling powers in the USA. These are unelected bureaucrats. This will not end well.",
        "good": "5",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "jhol58472",
        "time": "2 days ago",
        "context": "This is what you get when you voted for Joe Biden. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "witjoiner",
        "time": "2 days ago",
        "context": "Nonsense. The polls all indicate that people will vote to keep this police state. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mattgaetzsvenmo",
        "time": "2 days ago",
        "context": "Bringing a 12 year old to harass women entering a clinic that provides abortions? Sounds like grooming.",
        "good": "3",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "keptman",
        "time": "2 days ago",
        "context": "Fear and intimidation administration -- we roll over because they control the institutions of our society and they are pushing hard now, doing things that would never have been done in the past. You had better not hold beliefs contrary to the left, sit down shut up bend to their will. This is not hyperbole now, this is happening. 80000 new armed IRS agents who will be screened in hiring in their political leanings. The FBI the CIA the Universities, K-12 education, the DOJ, the prosecuting attorneys, the main stream media and on and on. The evidence is everywhere, and we just take it.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "ButchS",
        "time": "2 days ago",
        "context": "Once again the Fascist Biden uses the corrupt DOJ and FBI to intimidate their opponents ",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "BlueSnow",
        "time": "2 days ago",
        "context": "Poor kids . Indoctrinated so young . ",
        "good": "3",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "c1t",
        "time": "2 days ago",
        "context": "This regime is picking up tidbits from Putin and the FSB.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "jghoosier",
        "time": "2 days ago",
        "context": "The FBI and the DOJ are out of control in our current police state.  America wake up and vote Republican before it is too late.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "45gotitright",
        "time": "2 days ago",
        "context": "Looks like this regime is acting just like hitler's brown shirts.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "EdwardR.RooneyDeanofStudents",
        "time": "2 days ago",
        "context": "I just watched a news story where someone who was opposed to abortion was standing out side of an abortion clinic. he said that he believes as a Christian man his god and jesus were pro life. the problem is that they don't live in a Christian nation and their belief and ideology of their religion have no influence on our nation or government. Learn to mind your own business!",
        "good": "2",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "bnoem1",
        "time": "2 days ago",
        "context": "Dem led tactics:  \"Ve have vays of shuttink you up, you conservative extremists!\"",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jakebig",
        "time": "2 days ago",
        "context": "Dems weaponizing their offices to hunt down all political opposition.",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "gadsden_one",
        "time": "2 days ago",
        "context": "The FBI/KGB are sending a message.\nOppose abortion, homosexuaIity, or transgender ideology, and they will target you.\nWelcome to the Totalitarian State.",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "gadsden_one",
        "time": "2 days ago",
        "context": "The FBI used to be one of the most trusted agencies in the US.\nNow, it is one of the least trusted.\nThanks, Democrats.",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "this_might_hurt",
        "time": "2 days ago",
        "context": "I think we can all agree that had he stayed his back side at home with his wife and 7 kids, none of this would’ve happened.",
        "good": "3",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "pattlee",
        "time": "2 days ago",
        "context": "It is the path of Democrat party to use maximum force with guns of their DOJ and FBI to breakdown any Americans against their evil agendas.  Democrat party will behave like China communist day by day.",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "ykaterina",
        "time": "2 days ago",
        "context": "Off the rails?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "lacosanostraofdc",
        "time": "2 days ago",
        "context": "If and when it is proven that the FBI did this for political reasons there needs to be a massive, peaceful, nation wide protest.   Of course as non democrat protesters we will be risking our lives and freedom to peacefully exercise our constitutional rights, but it has come to that point where it is necessary.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "cryptome",
        "time": "2 days ago",
        "context": "The fbi and department of justice needs to be abolished they are now just Democrats hit men ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "BillyJackwasaliberal",
        "time": "2 days ago",
        "context": "FBI have been threatened by the right over and over! These FBI agents acted like they should in order to keep everyone safe! I'll remind everyone that the far right have killed abortion doctors in the past....Republicans just say they care about law and order and law enforcement but their words and actions say different. Congressman Graham suggests political violence is a option. Congresswoman Greene and others call to defund the FBI. Republicans say they will take to the streets if we hold Trump accountable. How does any of that support law enforcement?! Let's not forget 1\\6 Republicans beat Capitol police , called for a vice president to be hang! As Trump supporters tried to overthrow the United States of America! Republicans still say it was a regular tour of the Capitol! Trump said he is giving financial aid to the criminals that attacked the Capitol! ENOUGH!",
        "good": "3",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "this_might_hurt",
        "time": "2 days ago",
        "context": "I hope they throw the book at him. \n\nLeave people alone! Mind your business!",
        "good": "3",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "Sharp1234",
        "time": "2 days ago",
        "context": "Maybe the father was going to a school board meeting so the doj had to arrest him",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "donaldoraymundomartinez988",
        "time": "2 days ago",
        "context": "WE ARE LIVING IN A FASCIST STATE NOW...DON'T YOU SEE THAT???????",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jakebig",
        "time": "2 days ago",
        "context": "you could only harass supreme court justices,",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "GLL",
        "time": "2 days ago",
        "context": "FBI turning into Biden’s SS soldiers.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "pizzaman1200",
        "time": "2 days ago",
        "context": "Could it be that the power mad Democrats weaponized the DOJ, FBI, and the EPA to further there causes...no that couldn't be the case, it's just a lot of coincidences.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "liwfhrybdep",
        "time": "2 days ago",
        "context": "Pure political stunt for Bidumb's base",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Godhelpus😱",
        "time": "2 days ago",
        "context": "if this story doesn’t scare you…….i am very afraid.    think about it when you vote please",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "mba4",
        "time": "2 days ago",
        "context": "The corrupt FBI/DoJ using its power for leftist political purposes.  Wait til the Democrat Socialist Party's 87,000 IRS agents hit the ground - many armed.   VOTE the Dems out. ",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "john22s",
        "time": "2 days ago",
        "context": "We are under attack from abroad, and from within.\n\nOn a side note, America has the most amount of armed citizens of any country worldwide. That's by design.\n\nDon't poke the bear.\n\n🚨🇺🇸",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "FritzTheCat231",
        "time": "2 days ago",
        "context": "It’s not the arrest per se, it’s the way he was arrested. Fifteen to twenty agents with guns drawn to arrest one pro-life activist who local police declined to charge almost a year after the altercation. Exploiting the FBI for political intimidation anyone?",
        "good": "14",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "EdwardR.RooneyDeanofStudents",
        "time": "2 days ago",
        "context": "If you are opposed to Abortion, dont get one. you have no right to tell others or try to stop others from getting one.",
        "good": "5",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "gadsden_one",
        "time": "2 days ago",
        "context": "It's kind of funny to hear Antifa and BLM supporters now claiming to be the party of \"law and order\".",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Stompadem4freedom",
        "time": "2 days ago",
        "context": "We need the names and addresses of the federal agents to be posted. About time some fed up citizens show up at their homes and have a discussion with their families!",
        "good": "4",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "aoa2010",
        "time": "2 days ago",
        "context": "He assaulted a 72-year-old man. End of story.",
        "good": "2",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "justthefacts177",
        "time": "2 days ago",
        "context": "Believing conspiracy theories is a mental illness.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sargejohn362",
        "time": "2 days ago",
        "context": "If it looks like a duck, if it quacks like a duck and walks like a duck. Then it's a duck. It appears the FBI looks, talks , and acts  like Gestapo... Then.... they are?",
        "good": "7",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Valinor99",
        "time": "2 days ago",
        "context": "\"Let's Go Brandon!\"",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "heyzeuschristo",
        "time": "2 days ago",
        "context": "Every church should have an abortion clinic next door.",
        "good": "1",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "Suzfah",
        "time": "2 days ago",
        "context": "So if the American people can’t see what is happening here, than you condone the totalitarian, corrupt Democrats that are using the justice system and the FBI against their opponents and anyone that disagrees with them. This isn’t a a corrupt third world country, or is it? Merrick Garland has to go. ",
        "good": "5",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "gadsden_one",
        "time": "2 days ago",
        "context": "The fascist democrat plan now is pretty visible.\nBan and confiscate firearms.\nEstablished a powerful centralized police force, like the FBI, IRS, EPA, and ATF.\nThen attack any and all political opposition, which will be easy to do with social media.\nWelcome to the FAscists States of America.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "gadsden_one",
        "time": "2 days ago",
        "context": "Democrats are slowly but surely destroying the Bill of Rights.\nThey want to control free speech, they want to ban and confiscate firearms, and they have no respect for any of our other Constitutional Rights.\nThings are going to get ugly.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "liberalsuck657",
        "time": "2 days ago",
        "context": "Lawyers aren't my favorite people when it comes to integrity, but when it comes between what the lawyer says, and what the FBI says? I'll go with the lawyer.\n\nI'm not sure what the voters have to do to get politicians to begin to dismantle the FBI, but what ever it is, we should get started.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "xenaluna0418",
        "time": "2 days ago",
        "context": "\"Freedom and justice cannot be parceled out in pieces to suit political convenience. I don't believe you can stand for freedom for one group of people and deny it to others.\"   Coretta Scott King",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mtg",
        "time": "2 days ago",
        "context": "I would be ashamed to be a member of this once respected law agency as they have become a tool of the Democratic party and are pursuing people who offend Democrats, just by existing.",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "chezz693",
        "time": "2 days ago",
        "context": "KGB GEES",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "🦖TheEndisNigh🦄",
        "time": "2 days ago",
        "context": "The FBI is out of control and a clear and present danger to America and Americans freedom. \n🇨🇳🇨🇳🇨🇳🇨🇳FBI🇨🇳🇨🇳🇨🇳🇨🇳",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "xenaluna0418",
        "time": "2 days ago",
        "context": "\"We are fast approaching the stage of the ultimate inversion: the stage where the government is free to do anything it pleases, while the citizens may act only by permission; which is the stage of the darkest periods of human history, the stage of rule by brute force.\"   Ayn Rand",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "pacoute",
        "time": "2 days ago",
        "context": "The action from the FBI was despicable and predictable of what Wray and Garland have been doing and will continue to do while they are in office.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "seaden",
        "time": "2 days ago",
        "context": "\" A senior FBI source previously told Fox News there may have been 15-20 agents at the house but denied 25 were there.\"\n\nWow, there weren't 25, only 15-20, what a good use of manpower considering the target of the raid and the REAL threats our country faces. Merrick Garland needs to be fired, along with Christopher Wray.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Ozzie56",
        "time": "2 days ago",
        "context": "Biden's America . Remember and VOTE in November  !",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Sillybob",
        "time": "2 days ago",
        "context": "These types of 'snapshots' in time will absolutely be Garland's DOJ legacy!!!!!",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "whdog",
        "time": "2 days ago",
        "context": "This Garland character has got to go what a Biden puppet",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "granee",
        "time": "2 days ago",
        "context": "this administration has used the doj to promote their corruptness",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "xenaluna0418",
        "time": "2 days ago",
        "context": "\"'Emergencies' have always been the pretext on which the safeguards of individual liberty have been eroded.\"   Friedrich August von Hayek",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tripledogdare",
        "time": "2 days ago",
        "context": "Garland & Wray must have thought this poor father was a major WACO case ,with enough full armed FBI to disperse a crowd, Hello,,,sounds like North Korea folks",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "scoopdapoop",
        "time": "2 days ago",
        "context": "doj out of control.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sheltiego599",
        "time": "2 days ago",
        "context": "We live in a post Christian society....we gave it away with our vote....we let the school and media parent our children....pray on bended knee for forgiveness ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "scienceisreal127",
        "time": "2 days ago",
        "context": "If you don't want to have to deal with the FBI, don't break the law.",
        "good": "1",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "👊knucklesandwich👊",
        "time": "2 days ago",
        "context": "Do you think the decision to keep him off the Scotus was a good one? Certainly seems that way now. In this case hindsight worked.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "OrangeMan2024002",
        "time": "2 days ago",
        "context": "Since when does any law enforcement agency need an small army of armed men to apprehend a man charged for assault? \nThis is clearly a political stunt.",
        "good": "20",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rationalthought714",
        "time": "2 days ago",
        "context": "Pure intimidation.  Biden is running so scared, he will resort to anything to avoid prison.  Too late Joe...they're coming for you after the November election and you and your son are going to jail!  How sad that a once proud law enforcement organization has been reduced to the enforcement arm of the Libs.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "slowburn856",
        "time": "2 days ago",
        "context": "Sounds like he is so dedicated to his cause he uses violence to get his point across...then doesn't want to face the consequences..don't do the crime if you can't do the time....don't do it...",
        "good": "1",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "302'dcorp",
        "time": "2 days ago",
        "context": "I feel bad for the Philly cops that did not make an arrest last October.  There will be an Internal Affairs investigation and the cops will be brought up on charges of misfeasance and dereliction of duty with the the ADA fired.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "hightide852",
        "time": "2 days ago",
        "context": "We are a true third world country. What a few months in presidency can shake up the country along with the rest of the world. ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "slowburn856",
        "time": "2 days ago",
        "context": "Fox likes criminals . When will this guy be on Tucker or Hannity's show ?",
        "good": "1",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "kcoach",
        "time": "2 days ago",
        "context": "The “best Catholics” and friends of the Pope in America are Nancy and Joe,  just ask them! As a Catholic, I’m ashamed of them and this FBI and DOJ. ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Anytime_Anywhere",
        "time": "2 days ago",
        "context": "Democrats are desperate to keep Abortion the number one political issue.  They've FAILED at everything and don't want their sheep to know it. 🐑",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bikeman500",
        "time": "2 days ago",
        "context": "Mayberry’s Sheriff Taylor could have arrested him alone.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "avatarofpan",
        "time": "2 days ago",
        "context": "Do you truly not get that this is your fault?\nHow long has the Right been pushing The Big Lie that “it is only a few bad apples,” ?",
        "good": "0",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "Lou4192000159",
        "time": "2 days ago",
        "context": "when will the rest of you conservatives figure out this isn't a game we are being hunted and targeted by this administration and the government entities. this is a war that we are loosing because we don't want to believe it's happening. It's happening and if you don't act soon it will be too late.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "slaman",
        "time": "2 days ago",
        "context": "I have said it so many times on these comments, you get what you vote for. They cheat as well to win also. Not sure how much longer this country can survive at the rate we are going. 2 Chronicles - 7:14",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "enjoytodave553",
        "time": "2 days ago",
        "context": "Merrick Garland 🙈\n\nDepartment Of Joke 🃏",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "DemandTruth",
        "time": "2 days ago",
        "context": "FBI is similar to the Gestopo, so corrupt…needs to be stripped and started over..they are trying very hard to stop Trump as they know he will end their corrupt ways..sad what they have become ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "kwm71",
        "time": "2 days ago",
        "context": "Please politically wait your turn. They will come to your house for no extra charges. Hilarious.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jba5928",
        "time": "2 days ago",
        "context": "The modern day Gestapo.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "lostamerica693",
        "time": "2 days ago",
        "context": "Is this a comunist country, sure does look like it when goverment law enforcment are used as a political weapon,",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "UTNVolsR1",
        "time": "2 days ago",
        "context": "I think some are missing a point here. He attacked a 71 year old senior citizen. He had a 12 year old at a place of protest. Really a 12 year old has zero business there. Come on. Then add you only have one side of this. You people normally go after people of color when they give one side of what a cop did. Now it is a white man and sometime we both do not believe in and that is abortions. The 72 year old from what I have read NEVER laid a hand on the 12 year old. So he had zero right to assault the senior. Step back a look at everything individually.",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "israelreal",
        "time": "2 days ago",
        "context": "Like going back in time and Stalin manipulating the citizens,  the mlitary and law enforcement to punish an take over those that do not agree with the comminist agenda.  Killing and perseucting the population.  Gaining total control and then killling and persecuting those who helped them gain power the don’t follow the comminist line.  History repeats itself because of human nature.  We see the take ovr by the commiinust in our local, state and federal governmnt.  Don’t be surprised of the outcome of the next election. ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "nobodybutme21",
        "time": "2 days ago",
        "context": "reminds me of the gestapo. well, it just reminds me. nothing more.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mRNAsecretoflife=life",
        "time": "2 days ago",
        "context": "Fox really would love to create a theocracy out of the US...",
        "good": "0",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "saltyfly",
        "time": "2 days ago",
        "context": "FBI are little college kids with no brains ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jamesh.",
        "time": "2 days ago",
        "context": "Criminals get a free pass in Xiden's America...victims are punished.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "elbowsmcfadden",
        "time": "2 days ago",
        "context": "Federal crime.\n\nLock Him Up.",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "S.W.171",
        "time": "2 days ago",
        "context": "Add this case to the list of reasons for the existence of the 2A. Apparently, Waco and Ruby Ridge have faded from the memories of the Neo-Tyrants, now bent on using Law Enforcement to intimidate Conservatives at School Board Meetings AND in their house of worship.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Smitty65",
        "time": "2 days ago",
        "context": "Stand up to criminal traitor democrats ideals and they send their storm troopers after you ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "TheShrinkingGOP",
        "time": "2 days ago",
        "context": "EXTREME MAGA ALERT.  The MAGA's are out of control right now. Calling for defunding law enforcement when one of their kind gets arrested for violating laws.  Pretty insane.  Biden was right and you lunatics prove it every single day.",
        "good": "2",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "tsedawkaw",
        "time": "2 days ago",
        "context": "This is the marxist, communist, socialist, biden team at it's best.  The fbi is now a liberal leftwing terrorist agency under biden.  Here is bidens fbi attacking the church man and christians for nothing.  You have a chance to vote against biden and his attacks on democracy the constitution and the bill of rights so vote.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "whatever66666",
        "time": "2 days ago",
        "context": "This was an intimidation act, nothing more.  It really highlights the corruption in the DOJ and FBI.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "DonaldJ2024",
        "time": "2 days ago",
        "context": "There has to be laws broken for you to be arrested.    Any agency going around arresting people to intimidate is un constitutional and these people must be arrested and charged with treason they took an oath to up hold the constitution and they must be held accountable for acts against law abiding citizens...",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "lunatiknik",
        "time": "2 days ago",
        "context": "Democrats don’t care what’s outrageous or not. They only care about what they can get away with.\n\nAt this point and time, that seems to be just about anything,",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "alex246",
        "time": "2 days ago",
        "context": "The guy committed a crime, does he think that he's above the law because he opposes women's rights?",
        "good": "4",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "Xmas",
        "time": "2 days ago",
        "context": "Catholics around America are in shock at what BIDEN and his justice department did. But did nothing when democrats attacked churches, shot a pro lifer, destroyed pro life buildings ",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Chicana",
        "time": "2 days ago",
        "context": "This act was a mark of things to come by the now democrat communist party !!! No more freedom of speech allowed on speech that is approved by the communist party he needs to be released 🙏🏽🙏🏽🙏🏽🙏🏽",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jupiterthree",
        "time": "2 days ago",
        "context": "More proof that christianity is as bad as isIam.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mytwofoxes",
        "time": "2 days ago",
        "context": "there may have been 15-20 agents at the house but denied 25 were there.\nThere is some kind of a leadership problem here.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "depressionbaby329",
        "time": "2 days ago",
        "context": "God Almighty! To think that Merrick Garland could have been on the Supreme Court.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "1canorwegian",
        "time": "2 days ago",
        "context": "Biden has weaponized FBI and DOJ to go after those who oppose him. This is anti-American, unconstitutional and criminal. Biden should be impeached on so many fronts.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "hooliganvet",
        "time": "2 days ago",
        "context": "Ministry for State Security.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "jh83155",
        "time": "2 days ago",
        "context": "The FBI is out of control, period.  We need to elect candidates that will reel them in and clean house.  ",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "DonaldJ2024",
        "time": "2 days ago",
        "context": "If the dems want a police state then in November it will be their turn to see what it feels like",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Steeler58484",
        "time": "2 days ago",
        "context": "The G man, Gordon Liddy said aim between the eyes. Good advice.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "selenagomer",
        "time": "2 days ago",
        "context": "Did the FBI beat and arrest Biden for tax evasion taking 10% for the big guy?",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bryteeyes",
        "time": "2 days ago",
        "context": "The FBI need to be congratulated for their steadfast bravery. Fifteen to twenty armed agents is woefully inadequate when confronting an unarmed harmless family man. Send more next time!",
        "good": "7",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "css009",
        "time": "2 days ago",
        "context": "When are you Federal Agents going to stand up to your supervisors and tell them this is wrong and we're not going to do it?\n\nGrow a pair!!!!!!!!!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "justthetruth229",
        "time": "2 days ago",
        "context": "The FBI is America's KGB.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "paratrpr1",
        "time": "2 days ago",
        "context": "When confronted by individuals wearing body armor,  a head shot is best. Anything worth shooting is worth shooting twice.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ally’smom",
        "time": "2 days ago",
        "context": "But Novembers coming",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cognomen238",
        "time": "2 days ago",
        "context": "Next week, the FBI will be raiding the home of an angry parent who upset a school board member.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "jupiterthree",
        "time": "2 days ago",
        "context": "Pat, I'd like to solve the puzzle:  \"right wing christian domestic terrorist\"",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "scoopdapoop",
        "time": "2 days ago",
        "context": "Sue up the wazoo.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "valleyyodeler",
        "time": "2 days ago",
        "context": "Blessed are those who are persecuted…",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "BobTheBrain",
        "time": "2 days ago",
        "context": "The Freedom of Access Clinic Entrances Act, or FACE Act, which makes it a federal crime to use force with the intent to injure, intimidate and interfere with anyone because that person provides reproductive health care. \n\nBreak Federal laws, expect a Federal response.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "yelnatsekud",
        "time": "2 days ago",
        "context": "The leftist fascists don’t even try hiding their ill will. ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "crackerjack22",
        "time": "2 days ago",
        "context": "So what’s going on with Hunter Biden’s laptop it’s a mystery",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "therewasnofraud",
        "time": "2 days ago",
        "context": "Trump people support these people.  Yet they sky scream about antifa.\n\nyou're being fooled",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "causeican",
        "time": "2 days ago",
        "context": "I’m sick of the federal government picking what laws they want. All laws should be followed. If not why should we follow any of them ",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "themightyphantom",
        "time": "2 days ago",
        "context": "When are conservative leaders going to realize that they have to use the same tactics against liberals???!!!",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "tcam223",
        "time": "2 days ago",
        "context": "It's a federal criminal offense involving violence, yeah, they're going to have guns drawn when they make that kind of arrest. This is America, law enforcement is going to assume that everyone is potentially armed.",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "Xmas",
        "time": "2 days ago",
        "context": "Biden has taken away all security clearance and demoted FBI agents who dare to talk about the WOKE FASCIST BIDEN FBI!",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "flannelnightmare",
        "time": "2 days ago",
        "context": "Doesn't surprise me at all.  The FBI is a Gestapo-like arm of the Biden government.  They don't even try to hide it anymore.  I used to respect them.  Now I fear them.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "pdbicycle",
        "time": "2 days ago",
        "context": "That's Biden and his FBI and DOJ.  They let true criminals of the Cartels to control the Southern border but if you are a conservative and jaywalked it's shackles and a cavity search.",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "WhereRULaddyBuck",
        "time": "2 days ago",
        "context": "“ \"They tried to take a set of facts that are clearly purely local, and they've twisted them to try to drive a political narrative at the federal level,\" Breen added.“ Honey, can you make some popcorn?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ctconnservative",
        "time": "2 days ago",
        "context": "This is the tyranny our forefathers were concerned about when giving us the 2A.",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "cvordking",
        "time": "2 days ago",
        "context": "YOU ARE NOT SAFE!\n    Janes revenge, FBI is on it! No arrests yet but they  are still  finishing up with the parents at school meetings…",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "blammokerpow",
        "time": "2 days ago",
        "context": "let the court sort it out... you don't lay a hand on anyone if they do not want- is assault",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "smuckhunter",
        "time": "2 days ago",
        "context": "This is not a good plan, getting people more fired up is not a good plan. Threatening people for reasons of making folks bend the knee is not a good plan. We have far too many talking civil war, this not going to calm people. Backing off and playing nicer is the better plan. If a civil war starts likely it just is a straw too far.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "robert25834",
        "time": "2 days ago",
        "context": "DNC = Comply or die.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "cyceaux215",
        "time": "2 days ago",
        "context": "Political which hunt from the Marxist liberal democrats ",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Meema33",
        "time": "2 days ago",
        "context": "Who is this 72 year old victim they are protecting? What’s his back story? Has he been accused of instigating these types of altercations against minors in the past? ",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "JBrowne",
        "time": "2 days ago",
        "context": "Aww did someone push him down? Did he require medical attention?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "geraldjr491",
        "time": "2 days ago",
        "context": "American gestapo needs to be dealt with accordingly folks!",
        "good": "7",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "ROThornhill696",
        "time": "2 days ago",
        "context": "Thank God garland never made it to the Supreme Court.🤔",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Xmas",
        "time": "2 days ago",
        "context": "BIDENS FBI who called mom and pop terrorists for attacking CRT being taught in their schools, are now going after pro lifers",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "SheriffLongmire438",
        "time": "2 days ago",
        "context": "The Justice Dept and the FBI have become tools for the democrat cult of Molek!",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bono111",
        "time": "2 days ago",
        "context": "Time to start declawing the ugly Demovratic machine that is not serving the best interests of the american people nor are they fulfilling their oaths of office...",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "1boliver",
        "time": "2 days ago",
        "context": "If there more than two agents were there to arrest a dad, then all the extras need to have their right foot surgically removed and retired for lying to the American public. Time to clean up the FBI for communist activity in the men's room.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "peterbravo588",
        "time": "2 days ago",
        "context": "When  the GOP takes over th house , they will bring impeachment charges against this whole illegitimate regime. Lets see how many Trump haters are going to end up kicked out of office and even some may go to prison.....\"Thanks be to God who always leads us in triumph in Christ Jesus\"......pb",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "truthhammer938",
        "time": "2 days ago",
        "context": "Department of Injustice. The true criminals are running the DoJ and its a disgrace.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "GunsAGoGo056",
        "time": "2 days ago",
        "context": "Democrats will do anything to win and the FBI has become a terrorist organization.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "kwiseman379",
        "time": "2 days ago",
        "context": "The mob will come for you. America is disintegrating.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "williamweiss",
        "time": "2 days ago",
        "context": "This should scare every citizen.\nThe FBI has been weaponized and politicized by Biden's DOJ to go after anyone who does not buy the woke agenda.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "fartyhearty",
        "time": "2 days ago",
        "context": "We should trust the FBI. They really did a great job for us on 911.",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "billyc.",
        "time": "2 days ago",
        "context": "Every FBI agent who participated in this raid on a peaceable person's home should resign immediately. We don't need cowardly FEDs abusing power. Of course, the chief power abusers are Biden and Merrick Garland. Under them, the DOJ and FBI are corrupt to the core.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "prairie17",
        "time": "2 days ago",
        "context": "It's sad how far we've fallen under joey.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "noamazon",
        "time": "2 days ago",
        "context": "If they do this, imagine the police state tactics that biden's Gestapo will employ with 87,000 newly hired, armed tax agents, brown shirts that were hired EXPLICITLY for their willingness to use deadly force.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "thinktank4369",
        "time": "2 days ago",
        "context": "This was done simply because we are about to have an election and they think abortion is the main issue that can save them. Furthermore, why was the FACE act used for this the guy that was pushed. He does not provide abortion nor  was he employed by the clinic. He approached the pro life man and his son with verbal assaults. He was the instigator!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "nephilem",
        "time": "2 days ago",
        "context": "How do these people who work for the FBI get out of bed in the mornings? They all need to be disbanded and stopped form working in law enforcement forever. If you are a Democrat than you need to be jailed!!!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "fartyhearty",
        "time": "2 days ago",
        "context": "The FBI hasn’t raided or arrested any of the child rapists on Ghislane Maxwell’s client list.",
        "good": "9",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Jayhawk1964",
        "time": "2 days ago",
        "context": "I do not recall a single instance where the FBI targeted citizens for minor offenses while Trump was president.  It seems like its common practice under Bidens administration.  Who are the real fascists here?  The case was dismissed in court twice so time to bring out the FBI.  Yeah this is a great use of taxpayers dollars.  And a blatant violation of the Constitution.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "avatarofpan",
        "time": "2 days ago",
        "context": "Please remember that when law enforcement is breaking down your door in the middle of the night to arrest you for your conservative beliefs that “it is only a few bad apples.”\nYou did this!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "fartyhearty",
        "time": "2 days ago",
        "context": "The FBI sent a team of agents to investigate Bubba Wallace’s garage door rope…….",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "ash1972",
        "time": "2 days ago",
        "context": "Dude has 7 kids. He should be arrested for overpopulation of the Earth.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "oooca",
        "time": "2 days ago",
        "context": "This is all Garland. To think that they actually proposed him as a Supreme Court justice. Keep in mind that if the democrats get a majority in the Senate, they can change the rules to get a guy like this on the Supreme Court.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Nebuchadnezzarr",
        "time": "2 days ago",
        "context": "If you're an FBI Agent reading about what has just happened, YOU should be VERY ashamed of what you have become a part of. If you were there, YOU DISGUST ME.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dogmanofdesert",
        "time": "2 days ago",
        "context": "They sent armed men after this guy, they sent \"0\" Zero after Ncholas Cruz who they had a ton of information on.  Our hero's the FBI, what a joke.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cks260",
        "time": "2 days ago",
        "context": "Communist intimidation...plain and simple....the democommies are using the fbi just like the commies use the kgb, or the nazis used the ss......",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "DES11",
        "time": "2 days ago",
        "context": "I think this is PERSECUTION! ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cassidyhutchinson",
        "time": "2 days ago",
        "context": "MAGA being hunted by America😃",
        "good": "1",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "Biden’ssenile",
        "time": "2 days ago",
        "context": "Can everyone please stop! The pastor did not deny anyone access to the clinic. The old man got in his young sons face. You get in someone’s face and sometimes you get hurt! Pastor was just protecting his son!",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mrinsurancebroker",
        "time": "2 days ago",
        "context": "Chirs Swecker seems like just the man to clean up the FBI, but it would take a smart President to appoint him.  I suggest we don't hold out breath.  His explanation about how the DOJ is run by political hack ideologs is very telling.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "thinktank4369",
        "time": "2 days ago",
        "context": "Dems are stoking the fire and hoping for violence in a hail marry attempt at turning the vote.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "fartyhearty",
        "time": "2 days ago",
        "context": "Have they found the Supreme Court leaker yet? There were like 30 possible people. Too hard I guess.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "wakes",
        "time": "2 days ago",
        "context": "Federal Bureau of Intimidation at work for the Democrat Party.",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "fedup1982",
        "time": "2 days ago",
        "context": "The justice department is corrupt.....",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    }
]