[
    {
        "user_name": "groupthinknot",
        "time": "1 September, 2022",
        "context": "Again, if there's nothing to hide. \nWhy go to such great lengths?\nNational Security or maybe something more.\nSay for example mid-terms...",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mattgaetzsvenmo",
        "time": "1 September, 2022",
        "context": "MAGAts are BIGLY mad about a photo of evidence exhibited to a court filing 😂",
        "good": "3",
        "bad": "12",
        "replies": []
    },
    {
        "user_name": "kresshugo255",
        "time": "1 September, 2022",
        "context": "The facts cannot be denied:  (1) Trump was in unauthorized possession of national defense information, namely properly marked classified documents; (2) He was put on notice by the U.S. Government that he was not permitted to retain those documents at Mar-a-Lago; and (3) He continued to maintain possession of the documents and undertook efforts to conceal until the FBI finally executed a search warrant earlier this month.",
        "good": "8",
        "bad": "23",
        "replies": [
            {
                "user_name": "smokeyj",
                "time": "1 September, 2022",
                "context": "The facts cannot be denied:  You only know what is being reported by the MSM that also hates Trump.  It has also been reported that the fibbies knew that there were classified docs in his home back earlier this year and told him that he needs to add a lock to the storage room.  If they knowingly allowed classifed docs to be mishandled, then they are as guilty of mishandling those documents as anyone else. Why did they not take those documents at that time instead of waiting for several months closer to the midterms?",
                "good": "17",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "OmegaMan441",
                        "time": "1 September, 2022",
                        "context": "He was asked, repeatedly, to return ALL the documents.  His attorney signed an affidavit attesting that all had been returned.  So either Trump withheld information from his attorneys, or, the lawyers are complicit...",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "toosoonold075",
                        "time": "1 September, 2022",
                        "context": "Trump has admitted that he stole them. Why would he do that?",
                        "good": "1",
                        "bad": "1",
                        "replies": [
                            {
                                "user_name": "smokeyj",
                                "time": "1 September, 2022",
                                "context": "I would suppose that Trump called you personally and told you that he \"stole\" those document.  You and most all of the posters on this site only regurgitate what has been reported by the MSM which btw are biased toward Mr. Trump.  When you have actual facts, come back and show us.",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "user_name": "jackwade",
                        "time": "1 September, 2022",
                        "context": "Fox has reported the same thing as all the other networks.  To suggest only mainstream media outlets has reported on the facts.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "rhino23",
                        "time": "1 September, 2022",
                        "context": "That’s an easy question to answer they need a smokin gun this close to the midterms because the Democrats had nothing to run on the current administration has been a failure so far in 18 months",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "matty",
                "time": "1 September, 2022",
                "context": "You start off blatantly wrong or at a minimum jumping to conclusions with no evidence. You end the same way. Gibbersh.",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "douglas430",
                "time": "1 September, 2022",
                "context": "Part 1\n\nHere something you don’t seem to understand, and it is obvious because I have worked for and been trained by the Federal Government in the handling of Classified Messages. When something is put out, that is Classified, whether Top Secret, Secret or Confidential, when it is Declassified, the markings on the pieces of paper don’t magically disappear. Also, the only person who is (normally) allowed to declassify a Classified Item is called the Original Classification Authority, that is the Person or Entity that originally Classified the Item in Question. The ONLY exception to that, is the President of the United States. He is sometimes called the Ultimate Classification Authority, as he has the power to Declassify ANYTHING in the Government. The Definitions for these are SUPPOSED to be: Top Secret – Information whose disclosure will cause Exceptionally Grave Damage to the United States of America, Secret – Information whose disclosure will cause grave damage to the United States of America, and Confidential – Information whose disclosure will cause damage to the United States of America. Unfortunately, today, too much information is classified because it will cause EMBARRASSMENT to the individual Classifying the data.",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "douglas430",
                "time": "1 September, 2022",
                "context": "Part 2\n\nFor instance, there have been times in the past (mostly in the mid ‘90s) when I would read some classified document, while listening to the TV (tuned to CNN, and Bernard Shaw) and what was being said on the TV was almost word-for-word what was in the Classified Document I had in my hand. \n\nThe reason I say all of this is, or should be, simple, as the ultimate Classification Authority, the President has the power to Declassify anything he wants, and we do NOT know what documents that are “Marked” are actually Classified. Has he declassified them? I would NOT trust the DOJ to tell me whether the President has Declassified a DoD Document, as they, in all likelihood have never seen it. They’re just going off the physical markings on the paper. Something that, as I previously noted, doesn’t necessarily mean it is STILL classified.",
                "good": "0",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "jaffy",
                        "time": "1 September, 2022",
                        "context": "So when Trump stated yesterday that the fbi removed the classified documents from the boxes, dumping them on the floor for a photo op, was he lying? \nWhen his legal team filed in court that a special master must have a security clearance, that’s because nothing was classified?",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "supremeranter805",
                        "time": "1 September, 2022",
                        "context": "True. I had a Top Secret clearance when I was in the Army.\nAlso it’s been widely discussed that the current classification system has been abused by classifying documents that may just be embarrassing. I think this is much ado about nothing except trying to get Trump again. The FBI and justice department have lost so much credibility over the last few years they are not to be trusted.",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "supremeranter805",
                "time": "1 September, 2022",
                "context": "1. The question of authorized or unauthorized has not been decided yet so you are wrong.\n2. The ultimate determination of whether he is or is not allowed to retain those documents is not a unilateral decision by the biden administration, so you are wrong for now.\n3. He is allowed to maintain possession until either a court order.\nWe all know that this is just another desperate attempt to persecute Pres Trump.",
                "good": "10",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "wildtimz",
                        "time": "1 September, 2022",
                        "context": "None of this is on these windbags' say so.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "upnorth1201",
                        "time": "1 September, 2022",
                        "context": "it has been answered. You're not paying attention. \nHe's not the president, therefore no longer should be holding US top secrets in his desk at M\nIts been a month and trump still hasn't provided any rational for WHY he had the documents. Why don't you think about that for a second instead of rushing to defend him? ",
                        "good": "3",
                        "bad": "1",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "gamecock1936",
                "time": "2 September, 2022",
                "context": "look back at your sweet hillary clinton (255) 30'000 of hers deleted and destoryed and they didn't even talk to her. wake up america and it looks like they are. stay tuned.",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "RoyMo",
                "time": "3 September, 2022",
                "context": "So if it's a very straight forward case as pointed out by you. What is the DOJ waiting for then.  It's still possible that Trump might be prosecuted, but I doubt it very much.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "jackson32",
        "time": "1 September, 2022",
        "context": "The Courts are a part of Gov they will never go against the pigs",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "hooduhthunkit",
        "time": "1 September, 2022",
        "context": "If this was so Mission Impossibleesque, why did they toss papers on the floor to photograph them? Why, if it's such a National Security concern, would you do that? This is going to come down to whether or not the DOJ and the courts allow Trump's argument of \"they were declassified\". If Trump said they were declassified, which he was the ultimate arbiter of said action and of which there are no required documentation processes for that to occur, then the question needs to be asked of Trump.. Would you have made the documents, with the documents in the state you deemed them, available for a FOIA request or disseminated those to our allies and, possibly, our adversaries? If Trump can't answer yes to that, he's guilty. If he says yes, he walks.",
        "good": "6",
        "bad": "5",
        "replies": [
            {
                "user_name": "rumy",
                "time": "1 September, 2022",
                "context": "They were in desk drawers. Did you expect them to photograph the desk?  The cartons? While they most certainly photographed the containers the floor was probably the place they had enough room to photo all the evidence found in that room for a crime scene photo which it obviously was.  Use your heads people.  Nothing nefarious about this.",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "upnorth1201",
                "time": "1 September, 2022",
                "context": "Those agents needed to get special clearance just to touch those documents. Maybe worry less why they decided to take photos of evidence like they always do and focus on why Trump had the docs to begin with.",
                "good": "1",
                "bad": "2",
                "replies": []
            }
        ]
    },
    {
        "user_name": "brerhare",
        "time": "1 September, 2022",
        "context": "Jonathan,  why in the World was Trump hoarding these Secret Documents?",
        "good": "5",
        "bad": "7",
        "replies": [
            {
                "user_name": "britstubbs",
                "time": "1 September, 2022",
                "context": "Why did Hillary destroy 33,000 emails computer equipment , cell phones in the middle  of an FBI  investigation regarding classified documents on an email server in her home ?\nThat was not a problem for her even though the FBI Director press conference elaborated on all the laws that were broken by Team Clinton all of whom were democrats .\nWhere were the obstruction charges ?",
                "good": "5",
                "bad": "4",
                "replies": [
                    {
                        "user_name": "OmegaMan441",
                        "time": "1 September, 2022",
                        "context": "Whataboutism is a weak defense when facing potential espionage charges.",
                        "good": "3",
                        "bad": "2",
                        "replies": [
                            {
                                "user_name": "britstubbs",
                                "time": "1 September, 2022",
                                "context": "That is it , that is all you got ?\nWhere is your defense of the Queen of Mean ?\nYou are about as Omega as a dead salmon on a hot sidewalk .",
                                "good": "1",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "OmegaMan441",
                                        "time": "1 September, 2022",
                                        "context": "Clinton isn't being investigated...",
                                        "good": "1",
                                        "bad": "1",
                                        "replies": [
                                            {
                                                "user_name": "britstubbs",
                                                "time": "1 September, 2022",
                                                "context": "It is called precedent , get use to it  democrats will get a lot of it over the next decade as the worm turns and the MAGA party takes its revenge.",
                                                "good": "1",
                                                "bad": "0",
                                                "replies": []
                                            },
                                            {
                                                "user_name": "wildtimz",
                                                "time": "1 September, 2022",
                                                "context": "The two tiered justice system is very relevant here.  Of course, you are okay with it.  Too bad.  You are going to keep hearing about it until it changes.",
                                                "good": "0",
                                                "bad": "0",
                                                "replies": []
                                            }
                                        ]
                                    }
                                ]
                            },
                            {
                                "user_name": "mrbyll",
                                "time": "1 September, 2022",
                                "context": "They have no other argument and refuse to answer why he had the documents",
                                "good": "0",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "britstubbs",
                                        "time": "1 September, 2022",
                                        "context": "Presidents have wide latitude to declassify documents and that is what President Trump did.\nThe documents were in his possession legally and the FBI made sure way back in the Spring when they told him to pad lock the storage room.\nThis whole thing is a phony set up designed to distract , harass and keep him off the ballot and out of politics.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": []
                                    }
                                ]
                            },
                            {
                                "user_name": "Noneedforaname",
                                "time": "3 September, 2022",
                                "context": "Espionage? LOL! Okay Matlock, such weak grounds they drag out \"espionage\" to throw at a former President. Tireless bilge from you people, talk about being filled to the brim with hate.",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "user_name": "toosoonold075",
                        "time": "1 September, 2022",
                        "context": "Clinton did not intentionally steal anything. Clinton did not obstruct an investigation. Clinton sent 4 emails with classified markings to other government employees that had clearance to view the materials.\n\nTrump stole the documents. Trump lied about stealing the documents. Trump obstructed the investigation into his theft of the documents. Why am I not surprised that you can't see the difference? Trump loves the uneducated, they are easier to fool.",
                        "good": "1",
                        "bad": "5",
                        "replies": [
                            {
                                "user_name": "Noneedforaname",
                                "time": "3 September, 2022",
                                "context": "Her server was hacked by every one of our adversaries intelligence agencies as admitted by James Comey. And she did steal quite a bit actually. In fact, she even stole the silverware and china from the White House when she and Billy boy left.",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            },
                            {
                                "user_name": "egalot779",
                                "time": "5 September, 2022",
                                "context": "Wrong! Clinton set up her own email server for her and her staff to avoid having their communications be archived and available to FOIA requests. That's how all those emails ended up in that server. It was only when she was cought and subpoenaed the she proceeded to destroy it's data and gone see the records of her communications with her staff.",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "Teacher124351",
                "time": "1 September, 2022",
                "context": "The President, even Ojoho, can declassify documents.",
                "good": "1",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "cultoftrump216",
                        "time": "3 September, 2022",
                        "context": "It's weird he hasn't said they were declassified in court. He actually in court said the special master would need top secret security clearance.  Which would be weird if the documents were declassified, right?",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "rhino23",
                "time": "1 September, 2022",
                "context": "Do we actually know what secrets he’s hoarding nothings been released it could’ve been us presidential notes from Ukraine’s discussion or could be stop about crossfire hurricane you don’t really know",
                "good": "1",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "TheyAreAllLying",
                "time": "1 September, 2022",
                "context": "Mine! Mine! Mine!",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "deeplydeplored",
        "time": "1 September, 2022",
        "context": "Hillary had a server with Gobs of classified material in her bathroom.  They couldn't be bothered to even ask her why she scrubbed it like \"with a cloth or something\".\nAnd Trump, an actual president elected by the American people gets this...  the whole DOJ and FBI is corrupt.  There is no other explanation.",
        "good": "19",
        "bad": "1",
        "replies": [
            {
                "user_name": "kresshugo255",
                "time": "1 September, 2022",
                "context": "So you're not real sharp?",
                "good": "1",
                "bad": "3",
                "replies": [
                    {
                        "user_name": "OmegaMan441",
                        "time": "1 September, 2022",
                        "context": "Not really an American.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "great_white_buffalo",
                        "time": "1 September, 2022",
                        "context": "Ad hominem when you can't dispute the facts, huh, cletus.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "taxpayer560000000",
                "time": "1 September, 2022",
                "context": "Great post. Thank you.",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "jackwade",
                "time": "1 September, 2022",
                "context": "If you were more informed, you would know that the information was not classified when the emails  was sent. It  was much latter when they were classified retroactively.  Nor did any emails contain any top secrets. That being said, I don't agree with Comeys assessment not to pursue the case. The Trumps DOJ dropped the ball.",
                "good": "0",
                "bad": "1",
                "replies": []
            },
            {
                "user_name": "diogenespal",
                "time": "3 September, 2022",
                "context": "Hillary had a little more than 100 items that either were classified at the time they were exchanged, or were reclassified afterward. Trump had more than 300 items--and counting. And he keeps on coming up with laughable explanations. At least Clinton fessed up and provided rational explanations.  \nSo, if you were happy to chant \"Lock her up\" for what she did, I presume you're ready to chant the same thing whenever you see Trump in public?",
                "good": "0",
                "bad": "1",
                "replies": []
            },
            {
                "user_name": "harlowjean939",
                "time": "4 September, 2022",
                "context": "Are you kidding me??  \n\nYou know, after this S show of an ex president gets closer and closer to prison for mishandling documents, you all are going to get quieter and quieter because you'll realize you're supporting a reality show star who committed some VERY serious crimes against our country. Donald Trump will become synonymous Benedict Arnold and traitor.\n\nBTW, Trump enacted a law that gives this very crime much longer prison terms.  Oh the irony!",
                "good": "0",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "kresshugo255",
        "time": "1 September, 2022",
        "context": "“Fair and balanced” was the original Fox News lie, one of the rotten planks that built the foundation of today’s fascist movement.  Birtherism. The caravan invasion. Covid denialism. Rampant election fraud. All of these found a comfortable home at Fox. Murdoch and his miserable spawn are the immigrants who have done more damage to this country than any impoverished Guatemalans crossing the border fleeing poverty.",
        "good": "6",
        "bad": "9",
        "replies": []
    },
    {
        "user_name": "ShadyJ",
        "time": "1 September, 2022",
        "context": "If the documents were Declassified there will be a paper trail proving that.",
        "good": "5",
        "bad": "4",
        "replies": [
            {
                "user_name": "OmegaMan441",
                "time": "1 September, 2022",
                "context": "Pursuant to the National Defense Act and a standing executive order, the Director of National Intelligence would have had to have signed off of the declassification.",
                "good": "2",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "supremeranter805",
                "time": "1 September, 2022",
                "context": "Not necessarily, the President has the ultimate authority regarding the declassification of documents. There is an outstanding legal question as to whether he is required to do it in writing or can do it ad-hoc.",
                "good": "0",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "diogenespal",
                        "time": "3 September, 2022",
                        "context": "There is no outstanding legal question as to whether Trump or any president, once his term of office has ended, has a right to retain government documents, especially top secret documents. The answer is NO.\nTrump supporters keep on insisting that because theoretically Trump had ultimate power to declassify documents, he could do what he pleased. (By the way, Trump's attorneys have not made that argument in court, just like during their contesting the outcome of the 2020 election, they never made before a judge the same outlandish claims they made to the media. ) Also, does anyone have any evidence that there existed such a standing order that when Trump moved stuff to his private residence it magically was declassified?\nHas any of you wondered WHY he declassified top secret documents? So far, other than arguing that because he could, it's OK. Maybe you should also wonder whether someone who could act so recklessly should ever have set foot in the White House. That flaw starts with a lack of character.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "supremeranter805",
                                "time": "3 September, 2022",
                                "context": "The only fact is that you don’t know the facts. You do know what the leftist media has told you, but they don’t know either.\nYou do have the process backwards though, the burden of proof is on our partisan and corrupt justice dept, not on Pres Trump.\nTop Secret documents are declassified regularly as are Secret and Confidential.\nI had a Top Secret clearance when I was part of the Intel Community back in the 1970’s. I’m not sure if it has changed by now but the GDS required documents to be declassified on a timetable and unless a reason existed to keep them classified they were declassified. This applied to ALL classified documents.\nFrankly the only thing that matters is if this posed a real threat to national security. Absent that this is much ado about nothing.\nI would refer you to the hacked server with classified info found in Hillary’s closet. Huma Abadan’s laptop with classified emails which was backed up to Anthony Weiner’s laptop. Also lets not forget Bill Clinton’s former National Security Advisor caught stuffing classified documents down his pants in the National Archives.\nI hope you were outraged then as you are now.\nRather than being consumed with hate for one person I would think this country would be better served with the fair and equal application of the law.",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "rhienold",
        "time": "1 September, 2022",
        "context": "Even the DOJ does not claim they found them strewn on the floor. They obviously did that for dramatic effect and left it open to interpretation with the knowledge that meant Biden supporters are easily hoodwinked.",
        "good": "24",
        "bad": "5",
        "replies": [
            {
                "user_name": "OmegaMan441",
                "time": "1 September, 2022",
                "context": "When have you ever seen evidence just photographed in a pile?",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "just-another-idiot985",
                        "time": "1 September, 2022",
                        "context": "After just about any drug or weapons bust by the police. You haven't seen pics of all the drugs, weapons, and piles of cash piled up on tables before?",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "toosoonold075",
                "time": "1 September, 2022",
                "context": "The picture shows that the documents were directly in the possession of Donald J. Trump. The picture tells a thousand words, the documents were clearly marked and it would be impossible to mistake them for something else. The picture shows that they were valued by Trump. The picture shows that he clearly lied and obstructed the investigation. What part do you have trouble understanding?",
                "good": "6",
                "bad": "8",
                "replies": [
                    {
                        "user_name": "just-another-idiot985",
                        "time": "1 September, 2022",
                        "context": "These were only the documents that were found in Trump's office. They could have found an Abrams tank, an Apache helicopter, and a tactical nuclear weapon on the compound, and Trump lackeys would try to somehow justify it as a DOJ witch hunt. \n\nIt was only a matter of time before Trump finally dug his own grave. Personally, I want the DOJ to nail him to the wall for defrauding the gov't and election fraud. I'm a lifelong Republican, but I tossed Trump in the dumpster like all Republicans should have done after his delusional election conspiracy theory, his scheme to overturn the election, and his dereliction of duty once he was informed that Jan06 protestors were armed.",
                        "good": "0",
                        "bad": "3",
                        "replies": [
                            {
                                "user_name": "rhino23",
                                "time": "1 September, 2022",
                                "context": "Those Apache helicopters were left in Afghanistan during Biden Magoo’s Withdrawal",
                                "good": "2",
                                "bad": "0",
                                "replies": []
                            },
                            {
                                "user_name": "majorbummer",
                                "time": "3 September, 2022",
                                "context": "just-another-idiot985 :  Well, at least you chose an appropriate screen name.",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            },
                            {
                                "user_name": "jm16166",
                                "time": "3 September, 2022",
                                "context": "That wascally wabbit! You got him now, Elmer!",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            },
                            {
                                "user_name": "jokeas",
                                "time": "5 September, 2022",
                                "context": "Who was armed.",
                                "good": "0",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "just-another-idiot985",
                                        "time": "5 September, 2022",
                                        "context": "Many protestors were spotted by law enforcement before Trump's speech as having handguns and AR-15 style rifles. There are pictures with people in the trees with weapons, and people being armed is on audio communication among the law enforcement channels. \nTrump was informed of this when he demanded that the metal detectors be taken down in order to have a bigger crowd. As he stated, \"they're not here to harm me.\"\nAt that moment in time when Trump was first informed of rally goers being armed with weapons, Trump should have placed two phone calls to the Sec of Defense and the AG and had the entire Capitol Complex locked down and swarming with agents from the FBI, ATF, DEA, Secret Service, U.S. Marshals, etc. and the DC National Guard. Trump failed to live up to his fiduciary duty as President of the United States. It is without a doubt the most abominable act (or lack thereof) I have ever seen in my lifetime from a sitting U.S. President.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "user_name": "johne37179",
                        "time": "1 September, 2022",
                        "context": "If you are knowledgeable about classified information, you know that the markings are not dispositive about whether or not information is classified. There is much classified information with no markings whatsoever and there is much unclassified information that may still holdover previously classified markings. It is the person that has the information that is responsible for determining the level of classification based on the training they have received and they must certify when they get their clearance that they are able to do that.",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "Roubenesque",
                        "time": "2 September, 2022",
                        "context": "Have you ever visited a Presidential Library?",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "Curley396",
                        "time": "3 September, 2022",
                        "context": "Uh the picture is arraigned for  your consumption tool \n.they said the found the docs in his drawer . Hidden in ..\nWell actually , they cannot be that ‘hidden’ if they found them .\nWhat are you ‘hiding’ in your underwear drawer. Wouldn’t you say it is just a place to ‘keep’ them ‘ .  \nNot with Trump - if i had a dollar for every presser i watched him calmly walked away from excusing himself , only to read next am the obligatory ‘trump storms off , rages away , snarls … id be wealthy . Tool .\nHe has his issues , i am not even a big fan of that personality type , but they were in ‘his office ‘ working him over for set ups to play  you tools BEFORE he was even inaugurated. And that is against my religion .",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "foxisgreatamericannews",
                        "time": "3 September, 2022",
                        "context": "Any buffoon that never had a TS/SCI would agree with you.  Never serveds are always right in their own minds.  Which are exceedingly tiny",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "burke21",
                "time": "1 September, 2022",
                "context": "They were spread around for a photo. No conspiracy this time.\nNOTE: Documents Trump was not supposed to have.\nTrump supporters are missing the point and are obviously hoodwinked.",
                "good": "0",
                "bad": "1",
                "replies": []
            },
            {
                "user_name": "jackwade",
                "time": "1 September, 2022",
                "context": "Are you suggesting that the documents wasn't found in Trumps residence? You should take note that the Trump team isn't challenging that the documents weren't found, but rather they were photographed on the floor. It's a ridiculous complaint.  It doesn't change the fact that Trump had them.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "tpp1414",
                        "time": "1 September, 2022",
                        "context": "Are you suggesting, based on your apparent infinite knowledge of the topic, that the picture determines if a. the documents were still classified b The Documents were in an un-secure location c. the documents were mis-handled d. The documents werent placed there during the search (potentially) e. The documents werent allowed to be there under the executive privilege section of the Presidential records act.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "snoopyeee556",
                "time": "3 September, 2022",
                "context": "There was no need for a visual as you say .\nThey are trying the case before the media just as they did in the Russian hoax case.\nThese democrats are trying to create an election climate like 2020 to energize their base and sway independents for the mid terms. Just like the didgusting Biden speech  last night which has already backfired. There only hope is to try and make the election about Trump when everyone knows it is about Biden and his parties disaster in governing.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "mustbe5150",
        "time": "2 September, 2022",
        "context": "The photo of the documents is an attempt to show people there were actual documents. And what do republicans politicians do, they say how do we know they weren’t planted. Just another of many excuses for there false god Trump.",
        "good": "2",
        "bad": "2",
        "replies": [
            {
                "user_name": "%$&",
                "time": "2 September, 2022",
                "context": "People knew there were files,  there his",
                "good": "0",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "mustbe5150",
                        "time": "2 September, 2022",
                        "context": "The Trump cult members still don’t believe.",
                        "good": "1",
                        "bad": "1",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "OmegaMan441",
        "time": "1 September, 2022",
        "context": "What isn't weak is in finding Trump's passports side by side with the classified documents in his desk drawer.  It suggests he himself was the one who handled them.  It also makes it difficult for Trump to argue that movers or aides mishandled the documents or that he was unaware of their presence.",
        "good": "3",
        "bad": "6",
        "replies": [
            {
                "user_name": "great_white_buffalo",
                "time": "1 September, 2022",
                "context": "How many times do your masters have to lie to you before you realize nothing they say can be trusted.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "wiskeytangofoxtrot",
                        "time": "1 September, 2022",
                        "context": "The secret service’s pin-device surveillance documented FBI agents moving documents into the office. This is not the same surveillance referenced in the hallway: these devices are hidden. The pin-video surveillance was eventually powered off by the source, but not before capturing additional  materials being brought into the storage area. The video clearly shows the office, storage room and vault room prior to the assault. There were no boxes, and no documents laying about. DOJ evidence-photos show a staged display of documents. The government source has been identified as a secret service agent affiliated with a senior democrat leader.  When the dust settles, Trump will be prosecuted, the secret service evidence will be suppressed and the MAGA movement will be further discredited and marginalized. Power will be preserved and societal harmony established. With the eradication of the right, peace will return as the populace is pacified.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "wildtimz",
                        "time": "1 September, 2022",
                        "context": "Bray, donkey, bray",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "passito",
                "time": "1 September, 2022",
                "context": "Do tell why the location of the passports suggests he was the one who handled the documents? Do you really think a man in his position is the only one who has access to his travel documents? Could there not be a case where his assistant(s) who organize his travel keeps his passport? Wow, amazing how people with so little facts are trying to play Perry Mason.",
                "good": "3",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "isitsafe",
                "time": "2 September, 2022",
                "context": "Mute point on passports. Trump said everything was declassified. Trump has all authority to declassify. End of story.",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "snoopyeee556",
                "time": "3 September, 2022",
                "context": "yEAH THATS PROOF ALRIGHT",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "GovCrist",
        "time": "1 September, 2022",
        "context": "I used to thing Turley was non-partisan but in the last few months his gone all in for the Trump Train.",
        "good": "1",
        "bad": "1",
        "replies": [
            {
                "user_name": "Noneedforaname",
                "time": "3 September, 2022",
                "context": "Orrrrrr, he sees the obvious double standard this administration has been engaged in all along.",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "dawnsa",
                "time": "5 September, 2022",
                "context": "Because Turley sees exactly what is going on.  ",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "texaswatching641",
        "time": "1 September, 2022",
        "context": "This is reminiscent of the 2020 election, if the big lie was truly a big lie.  Why didn't the democrats demand an impartial audit to prove it was a big lie instead doing everything they could to prevent the audit.  The democrats and their actions portrayed the fact, they weren't sure the big lie was a lie.\nHere is the same thing.  They don't want someone they don't control looking over their shoulders.",
        "good": "11",
        "bad": "2",
        "replies": [
            {
                "user_name": "wildtimz",
                "time": "1 September, 2022",
                "context": "Totally",
                "good": "1",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "jackwade",
                "time": "1 September, 2022",
                "context": "What do you think the Mueller Report was about. What do you think the reason  for Trumps impeachment was about. Your comment is ridiculous.",
                "good": "1",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "rhino23",
                        "time": "1 September, 2022",
                        "context": "The Mueller report revealed Top FBI agents wanting to get FISA wire campaign Approved and started by Hillary’s campaign both impeachment were a sham purely political next",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "isitsafe",
                        "time": "2 September, 2022",
                        "context": "You make no sense. Mueller and impeachments occurred prior to the topic at hand.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "snoopyeee556",
                "time": "3 September, 2022",
                "context": "They deployed 100 lawyers across the country and 50 in Arizona alone.\nEven trying to get spies into the counting place locations.",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "RoyMo",
                "time": "3 September, 2022",
                "context": "Reasonable and sound argument.",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "Allion",
                "time": "3 September, 2022",
                "context": "All investigations have shown no large scale election fraud.  60 court filings all thrown out for lack of merit.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "mkbex",
        "time": "1 September, 2022",
        "context": "Wow all of you liberals....... Nuclear codes, look at the classified document covers, blah blah, since you listen to a media that doesn't report the news and covers for the Biden Crime Family, you don't know what they don't report to you....If it was nuclear codes, than this wouldn't of waited 6 months, Classified documents are de classified, with the exit .....get it right would you, because if any of this starts down the path of Trump being accountable, Than Hillary, Bill, and Obama ...can all also go to Jail , they all either had docs, made tapes , or erased 16000 confidential emails",
        "good": "1",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "fascisttrump",
        "time": "1 September, 2022",
        "context": "Hahahahahaha.   Jonathan Turley!!   FUNNY STUFF!!!   Where you been, Jon boy?!",
        "good": "1",
        "bad": "1",
        "replies": [
            {
                "user_name": "RoyMo",
                "time": "2 September, 2022",
                "context": "Stand up comedian?",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "fascisttrump",
                        "time": "2 September, 2022",
                        "context": "YES!! Turley is definitely a comic- he’s not bad, too!",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "%$&",
                "time": "2 September, 2022",
                "context": "I still see you got some Biden dribbling off your lips",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "fascisttrump",
                        "time": "3 September, 2022",
                        "context": "???",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "TheRepublicMatters🎬",
        "time": "2 September, 2022",
        "context": "This is unbelievable.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "avoiceinthewoods",
        "time": "1 September, 2022",
        "context": "I guess my most obvious observation, is that the FBI photographed Classified Documents, then posted or leaked the picture online.  I was trained on classified and privellaged information while in the Military.  What the FBI did is in violation of USC10.  There was no evidentiary need to take pictures of those documents on the floor.  That is not how they found them, and as to what was found, they took possession.  I bet you dollars to donuts, if Trump would have taken that picture (under the guise of documenting what they took) and released it, they would be calling that a crime.",
        "good": "7",
        "bad": "3",
        "replies": [
            {
                "user_name": "snoopyeee556",
                "time": "3 September, 2022",
                "context": "The information was spelled out in the court filing and the photos are like something right out of the tabuloids playbooks. But their trolls come on here and say \" SEE !\nSEE ! there is the proof SEE\".",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "gesunde",
        "time": "1 September, 2022",
        "context": "The most corrupt and incompetent Administration in the history of the United States. The D.O.J., F.B.I. full of nothing less than the most corrupt people in our nation's history. Doing the bidding of the Socialist-Democratic party.",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "pumpintrump",
        "time": "3 September, 2022",
        "context": "The Florida Judge that is working on Trump's documents that he forgot to return (like an overdue library book) has released a more detailed list of what the FBI took.. and we NOW know that many of the Top Secret folders that should be holding a Top Secret Document were EMPTY!  \n\nWhere did they go? And why are none of Fox's talking heads talking about this breaking news.",
        "good": "1",
        "bad": "4",
        "replies": [
            {
                "user_name": "eddunn1",
                "time": "3 September, 2022",
                "context": "All of his family members are running around with gobs of papers bulging out of their pants.",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "egyptiandancer460",
                "time": "3 September, 2022",
                "context": "No one knows what happened inside Mar-a-Lago when the FBI agents took the documents. Trump's lawyers were not allowed to attend the seizure of the documents. This picture of the empty folders stinks. The FBI can never be trusted anymore after all what they did to Trump and other conservatives. Moreover their bias to the Democratic cause is well documented. The appointment of a special master is long due.",
                "good": "2",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "pumpintrump",
                        "time": "3 September, 2022",
                        "context": "Trump's Lawyer was on Ingram the next night and she admitted on live TV that she, Trump and Trump's Kids all watch the entire raid on CCTV.  She added that Trump had a better view of the raid than anyone\n\nTrump promised to release a copy of the security cameras of the raid, until he discovered that the FBI had a copy of that too...  So the speaking point that the FBI planted or altered evidence died about 3 weeks ago.. try to keep up.  \n\nOh and the special master will not filter out planted evidence they will only be looking for solicitor client privileged items.  Of course we all know that the DOJ has already seen all of this stuff so the special master has nothing to do.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "grazer",
                                "time": "3 September, 2022",
                                "context": "The special master has a receipt to go by and a warrant describing certain items.  The special master will also be describing anything that doesn't comport.  DOJ is as crooked as FBI.  Can't be trusted.  Worthless pieces of ... well, you know.",
                                "good": "0",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "pumpintrump",
                                        "time": "3 September, 2022",
                                        "context": "You get your law degree at TrumpU?  it shows...\n\nNo the special master will ONLY filter DIRECT attorney client communication  privileged information.   This has been confirmed in court.  Trump's \"legal\" team has tired to expand that to include executive privileged information but even the Trump appointed judge isn't going for that.\n\nHere is the deal on ANY police search.  Once they are legally in your house.  They can collect ANY evidence from ANY crime, not just the stuff  that they are looking for in the Warrant..",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "grazer",
                "time": "3 September, 2022",
                "context": "These are the same guys who knowingly sought warrants from the FISA court using a false dossier, and you think they were honest here?  They have one goal -- bring down Trump, and people like you still believe them.",
                "good": "1",
                "bad": "2",
                "replies": [
                    {
                        "user_name": "pumpintrump",
                        "time": "3 September, 2022",
                        "context": "Trump promised to release those warrants in \"two weeks\"  2009 days ago and we are still waiting... He baited you with the FISA warrants and now he is baiting you with his ask for an evidence  master... You might say that there is evidence that Trump master baited you.",
                        "good": "0",
                        "bad": "1",
                        "replies": [
                            {
                                "user_name": "grazer",
                                "time": "3 September, 2022",
                                "context": "What?",
                                "good": "0",
                                "bad": "1",
                                "replies": [
                                    {
                                        "user_name": "pumpintrump",
                                        "time": "3 September, 2022",
                                        "context": "Which words are confusing to you?  Is English your second language?",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "user_name": "letsgetrational",
                        "time": "4 September, 2022",
                        "context": "Recall that the issue with the dossier came up when it was included in a warrant renewal application. Not the original.\nThe renewal also included information on results from the original surveillance, which would have been the primary driver for renewal. You did not hear the whole story.\nIn this latest case, the facts are obvious. The FBI found what they were looking for, which Trump had NO legal right to posses. He had previously reported that all had been returned. That was a false statement.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "letsgetrational",
                "time": "4 September, 2022",
                "context": "There were many documents that were not in folders, which could explain much of it.  However, with Trump it's not hard to imagine other possibilities.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "BrandonWon376",
        "time": "1 September, 2022",
        "context": "Trump is guilty. \nMAGA’s need to own that\nOr Real Americans will make MAGA’s own it.",
        "good": "3",
        "bad": "6",
        "replies": [
            {
                "user_name": "texaswatching641",
                "time": "1 September, 2022",
                "context": "The reality is this generation of democrats and their corruption makes the Grant and Jackson administrations look like choir boys.  Given your level of obvious intelligence, to understand this you would have to do something you probably have never in your life.  Do some research and develop your own talking points.",
                "good": "2",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "upnorth1201",
                        "time": "1 September, 2022",
                        "context": "The actual reality is its becoming clear a majority of Americans reject MAGA extremism and your movement is losing steam everyday.",
                        "good": "0",
                        "bad": "1",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "wildtimz",
                "time": "1 September, 2022",
                "context": "The US has due process in its rule of law.  Real Americans embrace and abide by that.   This wholesale slander, smearing, defamation is totally un-American.  The Democratic Party has strayed far from our precious underpinnings.  You actually speak of making fellow Americans own your unproven accusations as fact.  And you call them fascists...  What have you come to with this. If democrats can't be in power without overbearing any part of the citizenry, then they have violated their oaths and should be removed from power.",
                "good": "4",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "qracker",
                        "time": "1 September, 2022",
                        "context": "\"The US has due process in its rule of law.\"\nYup\n\n\"This wholesale slander, smearing, defamation is totally un-American. \"\nBy Trump about the DOJ and FBI, all of us true Americans agree.\n\n\"The Democratic Party has strayed far from our precious underpinnings.\"\nThere is nothing about any of these proceedings that are due to the Democratic party. You're only making inane inferences in that regard.\n\n\"And you call them fascists...\"\nNope. Just the violent MAGAs who commit domestic terrorism while chanting \"Fight for Trump\" or \"Hang Mike Pence\" while bashing in the heads of cops with American flags while holding Trump flags.  That IS fascism.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "rhino23",
                "time": "1 September, 2022",
                "context": "Name the real Americans who actually stand behind Biden Magoo",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "RoyMo",
                "time": "3 September, 2022",
                "context": "Guilty without a trial?  And you're a real American?",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "Noneedforaname",
                "time": "3 September, 2022",
                "context": "Okay tuff-guy, feel free to stop by any time to \"make me own it\"... LOL!",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "dawnsa",
                "time": "5 September, 2022",
                "context": "You mean the true Americans that set buildings on fire, killed police and other civilians?  Those Americans?",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "bidensaturd",
        "time": "1 September, 2022",
        "context": "If Trump is being charged, then Hillary should be executed.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "this_might_hurt",
        "time": "1 September, 2022",
        "context": "How to get a check from Fox for saying absolutely nothing. \n\n🤭",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "jackwade",
        "time": "1 September, 2022",
        "context": "I can't  help to notice that the Trump team didn't refute the documents legitamacy, but rather complain  that they weren't spread out on the floor.",
        "good": "2",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "wiskeytangofoxtrot",
        "time": "1 September, 2022",
        "context": "I think the DOJ has come to realize that 70 million Americans distrust every word, action and policy the government spews. From this reality, they understand that convincing a judge is only a tiny element in the attack against Trump. The greater requirement is to create a narrative that either convinces the far right of Trump’s alleged criminal activity (not likely), or the government will necessarily have to undermine, discredit or fully disenfranchise a potentially dangerous and large section of the American population. The game now is information operations. The government understands that faced with violence or penalty, people are generally weak and easily manipulated into submission. Native Americans, black slaves and Jews can attest to this truth. This time it will be white, middle and lower class republicans. White republicans have no stomach for contesting what will be demanded of them. They will not fight as their forefathers did. \n\nIf the government is successful in prosecuting Trump, his supporters will put their heads down and butts up and submit to government subjugation. Trump’s white supporters will surrender to the dominate power as has every group since this continent was colonized. We are seeing the beginning of retaliatory strikes against the white, conservative majority.  \nWhen they come for you, you will roll over like every group of people has done in the entire history of this particular “republic.” Your America is no more. What choice do you have?",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "bribing-Bidens",
        "time": "1 September, 2022",
        "context": "The reason the corrupt Dem DOJ don't wants \"special master\" because they don't want an outsider get near to those boxes, so they can slip in any other documents they want",
        "good": "4",
        "bad": "4",
        "replies": [
            {
                "user_name": "OmegaMan441",
                "time": "1 September, 2022",
                "context": "Glad you have it sussed out.  /s",
                "good": "1",
                "bad": "1",
                "replies": []
            },
            {
                "user_name": "mawtha",
                "time": "1 September, 2022",
                "context": "I agree & I read elsewhere that the FBI would not allow any of Trump's staff to remain close by during the raid?  One would think they would want some Trump people to witness the raid so that they could not be accused of doing anything nefarious.",
                "good": "4",
                "bad": "2",
                "replies": []
            },
            {
                "user_name": "kiester1",
                "time": "1 September, 2022",
                "context": "exactly. after the knowingly false steele dossier and knowingly false russian collusion hoax / coup that the doj and fbi were actively involved in, they are simply not to be trusted over this raid.",
                "good": "2",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "mikerob100",
        "time": "2 September, 2022",
        "context": "Turely was once a respectable scholar.  Money will corrupt anyone.",
        "good": "4",
        "bad": "5",
        "replies": [
            {
                "user_name": "RoyMo",
                "time": "3 September, 2022",
                "context": "Don't slander anyone unless you are very sure. In what way is he corrupt. I thought his inputs are sound and reasonable.",
                "good": "2",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "Noneedforaname",
                "time": "3 September, 2022",
                "context": "Who's paying him? He's an admitted democrat",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "pumpintrump",
        "time": "3 September, 2022",
        "context": "Turley starts with a lie and goes down hill fast.  In court Trump has not contested that they were classified, but on Fox, on Right wing Radio and on Truth social he is sticking with \"DECLASSIFIED\" \n\nSo which is it Trump, what your lawyers told the court, or what you spew on Truth social.",
        "good": "5",
        "bad": "1",
        "replies": [
            {
                "user_name": "barryg284",
                "time": "3 September, 2022",
                "context": "Trump was charged with what crime?",
                "good": "3",
                "bad": "2",
                "replies": [
                    {
                        "user_name": "linus",
                        "time": "3 September, 2022",
                        "context": "Be patient",
                        "good": "2",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "pumpintrump",
                        "time": "3 September, 2022",
                        "context": "Is English your second language?  You seem rather clueless.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "letsgetrational",
                        "time": "5 September, 2022",
                        "context": "So far he has pleaded the 5th at his tax fraud deposition for every question other than his \nname.  Are you good a the paint the taxes Trump cheated on??",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "Noneedforaname",
                "time": "3 September, 2022",
                "context": "You're addicted to being outraged. It's mildly humorous to read",
                "good": "1",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "wolfman0802",
        "time": "1 September, 2022",
        "context": "Apparently, they didn't plant the correct evidence in their raid...",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "yabbadabbadu",
        "time": "1 September, 2022",
        "context": "Apparently Turley must have seen the unredacted docs or more likely he's paid to paint the world a happy bright orange. \nPutting a TV actor over the USA is a really bad choice - one that the cultists continue to excel at.",
        "good": "2",
        "bad": "6",
        "replies": [
            {
                "user_name": "rhino23",
                "time": "1 September, 2022",
                "context": "Kinda like hiring the FBI agents from the FISA That Mueller went after now reporting for certain networks",
                "good": "1",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "yabbadabbadu",
                        "time": "1 September, 2022",
                        "context": "In English please...",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "john894",
        "time": "1 September, 2022",
        "context": "In other words, it was mostly a smoke screen for a different motive...",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "qracker",
        "time": "1 September, 2022",
        "context": "I thought that the legal aspects of Jonathan Turley were really transparently weak.",
        "good": "1",
        "bad": "1",
        "replies": [
            {
                "user_name": "RoyMo",
                "time": "2 September, 2022",
                "context": "Why don't you refute his arguments, wise guy?",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "john3perry167",
        "time": "1 September, 2022",
        "context": "Turley failed to mention that photo is proof that Trump's lawyer lied about not having any additional docs...another incompetent Trump lawyer not knowing what he is talking about...So why hasn't Rudy offered his opinion ?",
        "good": "4",
        "bad": "3",
        "replies": [
            {
                "user_name": "Noneedforaname",
                "time": "3 September, 2022",
                "context": "That photo proved nothing and was a ham-handed attempt at swaying opinion. Its obvious you've never been accused of being the brightest bulb in the box Johnny.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "DaveInNC245",
        "time": "1 September, 2022",
        "context": "So Fox's in-house legal genius basically ignores all the most important issues around the documents case and focuses on the photo and the special master request which he himself states are irrelevant to the larger case. Why not a more insightful column--w all know you re much smarter that this!!",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "Noneedforaname",
                "time": "3 September, 2022",
                "context": "What exactly are the \"important issues around the documents\" counsel?",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "DaveInNC245",
                        "time": "5 September, 2022",
                        "context": "Top secret docs taken to a country club, removed from their identifying folders and mixed in with newspapers, magazines and other mementos.  11,000 pieces of Federal property taken as....what?...souvenirs?  Why, Donald, why??",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "Noneedforaname",
                                "time": "5 September, 2022",
                                "context": "You know just about as much as I do as to where these things were and how they were being kept, which is to say you know nothing. ",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "4katydid",
        "time": "2 September, 2022",
        "context": "Trump illegally had these classified documents in an unsecured location for up to 18 months.  They need to be returned to the agencies where they originated ASAP, so it can be determined if any of the information got out and has put America' s national security at risk.  Appointing a Special Master will delay that process.",
        "good": "1",
        "bad": "6",
        "replies": [
            {
                "user_name": "RoyMo",
                "time": "2 September, 2022",
                "context": "18 months too late, my friend. Why so afraid to have a special master review the docs? I think it would reveal whether the DOJs case is legitimate or not. Anyway, my educated guess is the judge will appoint a special master.",
                "good": "4",
                "bad": "2",
                "replies": []
            },
            {
                "user_name": "%$&",
                "time": "2 September, 2022",
                "context": "Files in a cabinet in a locked closest by the FBI has caused no harm.  The sky is failing🙄",
                "good": "2",
                "bad": "2",
                "replies": []
            }
        ]
    },
    {
        "user_name": "Alexander.Hamilton",
        "time": "3 September, 2022",
        "context": "I never kid - and don't call me turley.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "🇺🇸america1st",
        "time": "3 September, 2022",
        "context": "This is a ridiculous raid! all they had to do was take the docs if it was as urgent as they’re making it sound! Something smells fishy about this whole raid!",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "letsgetrational",
                "time": "5 September, 2022",
                "context": "They had been attempting to get the docs for a long time. Trump told the FBi that everything had been returned. That was clearly wrong They were lied to. Hence the need for a search and they came, found and took what they were looking for.",
                "good": "1",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "🇺🇸america1st",
                        "time": "5 September, 2022",
                        "context": "So you already have it all figured out without any evidence just hearsay! ",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "Alexander.Hamilton",
        "time": "3 September, 2022",
        "context": "I like presidents that don't take the fifth - or need to.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sonnyliston",
        "time": "3 September, 2022",
        "context": "They had no intention to file anything against Trump. This is another corrupt attempt at slandering Trump to influence the next couple elections. This is another nothing burger thats going no where. It wont work anyway, these clowns are losing the next two elections big",
        "good": "1",
        "bad": "1",
        "replies": [
            {
                "user_name": "letsgetrational",
                "time": "4 September, 2022",
                "context": "These are felonies. The impeachments were obvious felonies. This time it will end in criminal court and not the Senate.",
                "good": "0",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "freedomof76",
        "time": "3 September, 2022",
        "context": "Ever notice how this loudmouthed loser never volunteers to defend Little Donnie the one term loser in court?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Alexander.Hamilton",
        "time": "3 September, 2022",
        "context": "The Republican party of Lincoln and Reagan is dead.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "grazer",
        "time": "3 September, 2022",
        "context": "Democrats can't even admit what they did with the FISA warrants.  They cost people a lot of money in legal fees to defend themselves against accusations the FBI and DOJ  KNEW were fake.  Can't trust any of them.",
        "good": "2",
        "bad": "1",
        "replies": [
            {
                "user_name": "letsgetrational",
                "time": "4 September, 2022",
                "context": "What did Dems do??? There were LOTS of reasons to be concerned and there still are.",
                "good": "0",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "grazer",
                        "time": "5 September, 2022",
                        "context": "They went to a FISA judge and on their oath said:  here are the facts, judge, give us a warrant, when they KNEW the facts they presented were FALSE.  Own it.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "letsgetrational",
                                "time": "5 September, 2022",
                                "context": "You don't have all the facts straight.\n1) This was not \"The Dems,\" but the investigator who chose to include something that wasn't fully vetted.\n2) This was for an extension of an existing surveillance, not to support initiating surveillance. As such, the information on results of the surveillance to date would have been most important to the court.\nSo you were given a misleading version of the facts.",
                                "good": "1",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "grazer",
                                        "time": "5 September, 2022",
                                        "context": "They knew that the dossier was FALSE.  Has nothing to do with vetting anything.  They used it unethically, and you seem to be challenged in that area, too.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "robthereader",
        "time": "3 September, 2022",
        "context": "Releasing the picture to the public with no context other than marked \"classified\" is nothing but trying Trump in the court of public opinion.  The corrupt media jumped all over it just as we'd expect these juveniles to do.  IMO Garland waited almost 2 weeks to allow the raid because he had to have his legal eagles come up with some sort of twisted legal reason to justify it.",
        "good": "2",
        "bad": "2",
        "replies": [
            {
                "user_name": "letsgetrational",
                "time": "4 September, 2022",
                "context": "They cannot release classified information. They can only u all show that such documents were there.\nIs that really not immediately obvious,?",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "robthereader",
                        "time": "5 September, 2022",
                        "context": "All I see is folders and some documents marked that way.  That means NOTHING and doesn't change my initial point one bit.  ",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "Crimson17",
        "time": "5 September, 2022",
        "context": "Everyone with a brain realizes that this was done for political reasons. If not they could have done it months ago. And Trump was cooperating with their requests why do a raid early enough so the news media could get shots of all the flashing lights.  If was had been daylight the footage wouldn't have had much effect. What did they think was in Melania's closet? I feel bad for the future Presidents who are going to get the same treatment. I can't wait for 2025 when Biden's house with be crawling with agents finding documents about his influence peddling for 30 years. if we had term limits he would have long been forgotten.  The only way to \"fix\" our country is to put term limits for Congress. Then most of our leaders wouldn't be a bunch of old men (and Nancy) most from California and New York. ",
        "good": "2",
        "bad": "0",
        "replies": [
            {
                "user_name": "comrademushroomdick",
                "time": "7 September, 2022",
                "context": "tRump stole documents and lied about it",
                "good": "0",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "Alexander.Hamilton",
        "time": "3 September, 2022",
        "context": "Much easier to lie of Fox - than in court.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "yarm",
        "time": "3 September, 2022",
        "context": "Turley is a Trump stooge.",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "Curley396",
        "time": "3 September, 2022",
        "context": "Well mission accomplished - here you all are , left , right and even center bend all over discussing the ‘get trump’ issue without a snippet of inflation , recession , wages war nor even famine .m",
        "good": "0",
        "bad": "1",
        "replies": [
            {
                "user_name": "letsgetrational",
                "time": "5 September, 2022",
                "context": "There is no recession at this point. Have you seen the jobs numbers?\nAnd do you have an idea as to what has caused global inflation? I would bet no.",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "General_Sherman_",
        "time": "3 September, 2022",
        "context": "This guy used to be a fixture on Keith Olberman's show",
        "good": "0",
        "bad": "0",
        "replies": []
    }
]