[
    {
        "user_name": "bwaldorf333",
        "time": "16 hours ago",
        "context": "This article is one long \"whataboutism\".",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "BidenPOS",
        "time": "16 hours ago",
        "context": "So the left wing propaganda media is schilling for the Basement Dwelling Dementia Patient President...Who knew?!?",
        "good": "23",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tayninh67",
        "time": "16 hours ago",
        "context": "FOX needs to do what the vast majority of Americans do..........ignore CNN and MSNBC. Their viewership is so low they get more attention from FOX.",
        "good": "20",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "Mainstream_American",
        "time": "16 hours ago",
        "context": "President Donald Trump is the most intelligent and effective president in the history of the United States of America and the Progressive Democrat Party is tremendously frightened by his awesome brilliance and his determination to drain the buecratic swamp of criminals in Washington DC. ",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Mainstream_American",
        "time": "16 hours ago",
        "context": "CNN,  Donald Trump is the most intelligent and effective president in the history of the United States of America and the Progressive Democrat Party is tremendously frightened by his awesome brilliance and his determination to drain the buecratic swamp of criminals in Washington DC. ",
        "good": "36",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "notadumbocrat824",
        "time": "16 hours ago",
        "context": "81,000,000 votes LOLOLOLOLOLOLOLOL",
        "good": "12",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jrrjrr063",
        "time": "16 hours ago",
        "context": "They don't cover sleepy joe, they cover up for sleepy joe. Everybody knows it, which is why NOBODY WATCHES.",
        "good": "64",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Sentinel314",
        "time": "16 hours ago",
        "context": "LOL @ Fox News for just now realizing MSM are dem cheerleaders.  Maybe they will announce the Japs bombed Pearl Harbor soon.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "AOCgoesBankrupt",
        "time": "16 hours ago",
        "context": "Every president should be required to submit to annual cognitive assessments.  These should evaluate both mental acuity and emotional stability.  (That would eliminate all leading democrats, BTW)",
        "good": "30",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "b9876",
        "time": "16 hours ago",
        "context": "Tim Apple was hilariously funny and classic Trump, whereas this was both sad and disturbing.",
        "good": "38",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "GreenCoathanger",
        "time": "16 hours ago",
        "context": "Still concerned about a former president? Isn't Biden the president? Shouldn't \"they\" be concerned with today not a guy from 2 years ago?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "austxmax",
        "time": "16 hours ago",
        "context": "Can we exchange Brandon for Jackie?  Would be very cool if we could.  MAGAA!!",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "propagandist",
        "time": "16 hours ago",
        "context": "He forgot.  It happens.  Everyone wants to rush to diagnosis, as if they've never misplaced their car keys or forgotten a phone number.  Years ago, a Harvard trained doctor wrote a very interesting article for Reader's Digest.  He explained how things have changed in this modern age.  We are overloaded with things we have to remember, from pins to passwords to 10 number phones.  Its natural to forget a few things, considering how much we demand from our brains now.",
        "good": "1",
        "bad": "13",
        "replies": []
    },
    {
        "user_name": "FailureToCommunicate121",
        "time": "16 hours ago",
        "context": "A Trump misspelling became a national talking point across all media outlets.  Even became part of Wikipedia.  Covfefe (/koʊˈfɛfi/ koh-FEH-fee) is a misspelling, widely presumed to be a typo, that Donald Trump used in a viral tweet when he was U.S. President.\n\nBiden looks for dead people, forgets he shakes hands, reminisces about 12 yr old girls, and can't finish a sentence without a garbled word.  And nothing from the MSM.",
        "good": "15",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "tough@heart",
        "time": "16 hours ago",
        "context": "Hey News medias, The more you dont show truth the more you will lose ratings.  Ppl want truth not lies.  God prefer truth Evil prefer lies so which are you ganne be?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "matthewstephen",
        "time": "16 hours ago",
        "context": "MSM is our TASS and PRAVDA.  Watch at your own risk.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "randy4usa",
        "time": "16 hours ago",
        "context": "CNN and MSNBC avoid talking about a major red flag for Biden's loss of mental acuity.\nThat means that possibly a dozen people have been left in the dark.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cb1882",
        "time": "16 hours ago",
        "context": "It's perfect. I can see the crowds chanting \"Where's Jackie?\"",
        "good": "31",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rebelrouser",
        "time": "16 hours ago",
        "context": "JOE BIDEN IS A EPIC FAILURE.   PERIOD!!!!",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jamie070",
        "time": "16 hours ago",
        "context": "Why was it unreasonalbe for biden not to know someone he doesn't know well, had died???  I'm not seeing it.   that's life.  people die.   Biden is expected to have omniscience and know all things now, meanwhile, trump isn't supposed to know the name of a very person he was JUST BRIEFED about minutes before.  really???   do you people even hear yourselves how illogical you are?",
        "good": "0",
        "bad": "12",
        "replies": []
    },
    {
        "user_name": "philip_oliver_holz266",
        "time": "16 hours ago",
        "context": "\"We're building a wall on the border of New Mexico. And we're building a wall in Colorado,\" - Donald J. Trump",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "you'llneverwalkalone",
        "time": "16 hours ago",
        "context": "Even in mental yard Brandon would be closely watched.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "keepthemhonest",
        "time": "16 hours ago",
        "context": "Tim Apple. Lol. Forgot about that. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "havesomerespect",
        "time": "16 hours ago",
        "context": "Joe Biden has been spotted in Florida yelling for Dog Face Pony Soldiers to come rescue people as part of his strategy to combat climate change.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "perogi007",
        "time": "16 hours ago",
        "context": "It's worse than we thought.  He was looking for Jackie Kennedy.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "WutChuTomBout",
        "time": "16 hours ago",
        "context": "“Top of mind” is what Biden’s handlers used as their excuse for his broken brain, as if calling for and scanning a room looking for a deceased person is something people normally do when they’re thinking of someone that has passed.",
        "good": "20",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "usmc88755",
        "time": "16 hours ago",
        "context": "Where's Jackie? Where's Waldo? Let's Go Brandon!",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "snoopy1",
        "time": "16 hours ago",
        "context": "Don't worry, the public has woken up and have had enough of Crazy Joe's act ! He needs to be at Shady Pines playing bingo and having rice pudding for an afternoon snack ! I just watched a short video of Old Joe speaking a few short words and he turned to walk off stage the wrong way. The look on the woman face and one of the guys just behind him was priceless!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "joe_fred355",
        "time": "16 hours ago",
        "context": "If you lined up 1/2 of the leftist media and 1/2 of Biden's appointees (or more), and you had no idea who they were, you'd think you were at some mental institution with people who were delusional thinking they were normal or that they were somehow extremely intelligent and smarter than everyone else,  when they really needed to be in padded rooms highly medicated.  And this is just by looking at them and their behavior.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "OldFloridian",
        "time": "16 hours ago",
        "context": "MSNBC it even trashier than CNN, if that's possible.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "krx",
        "time": "16 hours ago",
        "context": "Increasing priority - cover for the vegetable.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "LegendaryTroll",
        "time": "16 hours ago",
        "context": "But but but but but but but what about? That’s the only answer Red Hats ever have. Like a 10 year old. “Mommy, Johnny did it too!!” Yawn.",
        "good": "1",
        "bad": "8",
        "replies": []
    },
    {
        "user_name": "rj100060",
        "time": "16 hours ago",
        "context": "They are all just spoiled children in a sandbox.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jamie070",
        "time": "16 hours ago",
        "context": "1 - tim Apple IS a gaffe.  there is no such person as Tim Apple.   In fact, Apple is a HUGE economic engine in this country, to NOT know you're meeting TIm COOKE< who Trump was prepped to meet just minutes before IS a huge gaffe.   2 - WHY is it UNREASONABLE to NOT know someone you didn't know well died?    Do realize this comparison -- you're saying Trump shouldn't be responsible to know THE NAME of a person he was JUST TOLD what his name was, a very famous person, who he was just prepped to meet.. that's not too much to expect, yet biden is supposed to be expected to be omniscient all knowing of all the health status of all the 400+ members of the house and 100 of the senate???    honestly, do you people not hear how ridiculous you are?",
        "good": "0",
        "bad": "9",
        "replies": []
    },
    {
        "user_name": "Nowonthetee",
        "time": "16 hours ago",
        "context": "Remember when Trump called his own wife Melanie??\nAwesome!",
        "good": "1",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "istandforourflag",
        "time": "16 hours ago",
        "context": "..... and then, shielding his eyes with one hand, he scanned the audience and said.... \"Where's Waldo",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Johnson19420",
        "time": "16 hours ago",
        "context": "If it weren't for double standards, liberals wouldn't have any standards at all.",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "redman52",
        "time": "16 hours ago",
        "context": "CNN Makes Fun of Ginni Thomas for Believing 2020 Election Was Stolen – But She’s Right – The 2020 Election NEVER Should Have Been Certified for Joe Biden\nSeptember 30, 2022, 10:15amby Joe Hoft",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "flyovervoter22",
        "time": "16 hours ago",
        "context": "I'll take a Tim Apple comment over seeing dead people!  A bit different.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "havesomerespect",
        "time": "16 hours ago",
        "context": "Tim Apple 🍎 is world renowned, yes we know!   He's also a Chinese Collaborator and Enabler.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mjs1332482",
        "time": "16 hours ago",
        "context": "Troubling reports surface that biden's family knew of his dementia in 2017-2018 claiming he didn't know his own address and depended on the secret service to get home.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Democratsuckock!",
        "time": "16 hours ago",
        "context": "Democrats finest right there - Bwaaahahaha!!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Frank1314",
        "time": "16 hours ago",
        "context": "I don't think forgetting someone's name is the same as forgetting someone is dead.",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "lolita2022",
        "time": "16 hours ago",
        "context": "THE FAKE MEDIA",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "halmac883",
        "time": "16 hours ago",
        "context": "The Republicans need to buy airtime and run commercials on a never ending real of all of Biden’s so called “gaffs” which are literally dementia. Democrats would rather ignore a Democratic President with dementia, holding the nuclear codes, than tell the truth. Their motto is “America Last.”",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "samb495",
        "time": "16 hours ago",
        "context": "Meh.  Staunch Republican, but who cares if he had yet another senior moment?  We all have duh moments from time to time.  In the end, he is better than having Kamala in charge.  Careful what you wish for...\n\nPeople act like he is more than a puppet.  He's not making policy decisions.  He has a staff of creeps to do that for him.  He is irrelevant.",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "northseatiger",
        "time": "16 hours ago",
        "context": "I once put a satellite dish up in England to be able to watch CNN in the '90's. I would never look at them for two reasons. First, it is depressing to see how far they have fallen from the success they once were, you know, \"go woke go broke\". Secondly, they have become a platform for all the communist thought in this country and having been to former communist countries and seen the damage done by communism in those countries, seeing it espoused on CNN hourly is  sickening.......................",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Steven45",
        "time": "16 hours ago",
        "context": "CNN and MSNBC can no longer be trusted to tell Americans the truth. ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cometogetherforapurpose",
        "time": "16 hours ago",
        "context": "They are not trustworthy news outlets anyway. i stopped going there.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "wolfhowl99",
        "time": "16 hours ago",
        "context": "Holding Biden to the same standard they treated Trump would hurt their chances in the midterms. They don’t mock Biden, even though there’s so much low-hanging fruit. Instead, they make excuses, lie, and distract to protect him, like the good little Democrat allies they are.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jamie070",
        "time": "16 hours ago",
        "context": "Why was it joe's responsibility to know a person he didn't know well, who isn't family, had died.   Not seeing it.   why was that SOOO HORRIBLE!!! OH MY GOD! JOE DOESNT KNOW THE HEALTH STATUS OF ALL 400 MEMBER OF CONGRESS!   you people really can't be trusted with power. you're all nuts, this whole line of drama is nonsensical",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "Steven45",
        "time": "16 hours ago",
        "context": "CNN and MSNBC can no longer be trusted to tell Americans the truth. ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "propagandist",
        "time": "16 hours ago",
        "context": "All media focused on the gaffe and completely ignored the topic at the summit.  Hunger, Nutrition, & Health.  A very important subject that needs to be discussed.",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "gripoflush",
        "time": "16 hours ago",
        "context": "Tim Apple... I almost forgot about that one.  \n\nWhat were we obsessing about again?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "WheresJackie?",
        "time": "16 hours ago",
        "context": "Trump's statement pales in comparison.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rafaelcruz903",
        "time": "16 hours ago",
        "context": "America is SOOO mean to Fat Donald.\n\nAmerica needs to stop being SOOOOO mean to Fat Donald.\n\nFox \"News\" hates it when America is SOOOO mean to Fat Donald.",
        "good": "0",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "Steven45",
        "time": "16 hours ago",
        "context": "CNN and MSNBC can no longer be trusted to tell Americans the truth. ",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Oh_no_you_didn't!",
        "time": "16 hours ago",
        "context": "Even if Trump slipped up and didn't realize at the time he was calling him \"Tim Apple,\" that pales in comparison to forgetting that a colleague died... especially a colleague that died in a horrific way, and one that you spoke about after her death. There is really no comparison.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "TrueAntifascist",
        "time": "16 hours ago",
        "context": "It is not just “Where’s Jackie”. It is everyday with something. It maybe forgetting to put your foot down when you stop your bike. It maybe forgetting your location and forgetting simple plans like where to exit. This guy is obviously mentally unfit to be the president and leader of the free world.",
        "good": "20",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "AnnLee786",
        "time": "16 hours ago",
        "context": "So much for CNN being less partisan.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "karimia55",
        "time": "16 hours ago",
        "context": "CNN, MSNBC, and all the other far left media, you have failed the public.  There will be a time, sometime in the near future,  where you must get life saving information out to the public and guess what…….NO ONE WILL BELIEVE YOU!",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "maggie12345",
        "time": "16 hours ago",
        "context": "I was just on CNN.  The gaffe was covered.  I haven’t checked on MSNBC.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "PVBound",
        "time": "16 hours ago",
        "context": "Anyone who doesn’t acknowledge the bias at this point is just brain dead. ",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "justthefacts555",
        "time": "16 hours ago",
        "context": "Tim Apple?  How about when he thought Frederick Douglass was still alive?",
        "good": "6",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "WheresJackie?",
        "time": "16 hours ago",
        "context": "Did Joe cut her brake lines, like he did with his first wife?",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "travestar869",
        "time": "16 hours ago",
        "context": "Where's Joe?",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "OrangeMan2024002",
        "time": "16 hours ago",
        "context": "This is why 35% doesn't know that Joe has dementia and believes we are on the right track.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jumpjet1156",
        "time": "16 hours ago",
        "context": "The man behind the curtain can't be blamed for this one. Tell another lie, Karine.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "hypocriticaldim",
        "time": "16 hours ago",
        "context": "Bidens lap dogs",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "meh_whatever",
        "time": "16 hours ago",
        "context": "The science is settled. Biden is a vegetable.",
        "good": "8",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "WheresJackie?",
        "time": "16 hours ago",
        "context": "Dig her up",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "hypocriticaldim",
        "time": "16 hours ago",
        "context": "Where's Jackie?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "elkraken",
        "time": "16 hours ago",
        "context": "Where is Jackie?",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "VetRanger",
        "time": "16 hours ago",
        "context": "Trump forgot a last name…..he didn’t try to resurrect a dead Steve Jobs….. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cygnus475",
        "time": "16 hours ago",
        "context": "The fake news propaganda outlets need to be shut down, nobody watches or trusts them anymore, they have all dug there own graves by being bought by the democratic crime family!!!!!",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "duke-one",
        "time": "16 hours ago",
        "context": "Our country has a pile of major problems and there is bit of a game as to which is on top. Border, voter ID, crime, crime and more crime. As this and another article this morning point out (https://www.foxnews.com/media/flattering-media-coverage-didnt-help-abrams-orourke-win-georgia-tx-voters-politico) we can not fix these with the MSM abusing their 1st Amendment  rights. Our country and our culture are large and complex; citizens need honest, accurate news if they have any hope of knowing what is going on. How else can we vote for the best candidates for very important positions? So my \"vote\" for most important fix is to force the MSM to be honest; big ask I know.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "MisterScience",
        "time": "16 hours ago",
        "context": "I told you people, 'Top of Mind!'",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rallieann",
        "time": "16 hours ago",
        "context": "Someone needs to remind these broadcasters that they do so via a license provided to them by the FCC! The make up of the FCC may change in November!!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "phubai91A10-69",
        "time": "16 hours ago",
        "context": "Biden in a remake of The Sixth Sense? I doubt it seriously. He has no sense or cerebral activity period.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "coffem8",
        "time": "16 hours ago",
        "context": "Biden has issues with either dementia or Alzheimer's. That is not up for debate. He will not make it through his full term. He will disappear more and more from the public. If I were congressional Republicans, I would insist that every bill signing... everything that Biden has to put his signature on be witnessed by multiple people from both parties from here on out.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "riley0056",
        "time": "16 hours ago",
        "context": "The blatant hypocrisy has become laughable.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Bidenisaloser1",
        "time": "16 hours ago",
        "context": "The media is as dangerous as the FBI to the survival of this country. ",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "lovetheus_",
        "time": "16 hours ago",
        "context": "It's the new chant at stadiums and arenas....\"Where's Jackie, Brandon\"",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "felix2742",
        "time": "16 hours ago",
        "context": "Just the President talking to dead people. Nothing to see here....",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "randpaulsneighbor",
        "time": "16 hours ago",
        "context": "Remember when Trump said he was in New York during 7/11?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "BillyJackwasaliberal",
        "time": "16 hours ago",
        "context": "We could always go back to the last guy did you hear what he said recently? He said he could just think and make documents unclassified by just thinking it. That's what a schizophrenic thinks. The overwhelming Majority of republicans still support this unstable man!..... No that's something to really worry about that man back in office!",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "sp00ky",
        "time": "16 hours ago",
        "context": "The hypocrisy of the left will cost them the midterms.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "randpaulsneighbor",
        "time": "16 hours ago",
        "context": "Remember when Trump wanted to find the “oranges “of the Mueller probe.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Don'tLikeBiden?Leave",
        "time": "16 hours ago",
        "context": "Because no one cares.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Duke2022",
        "time": "16 hours ago",
        "context": "I thought CNN was making changes within the network.  I foresee CNN going under.  Hopefully the rest of those far left, racist, fake news, etc., etc. the same.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "freddyfour20",
        "time": "16 hours ago",
        "context": "Leftists news doesn’t report ANY of potus or vp failings or gaffes.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "redwoodkingfish",
        "time": "16 hours ago",
        "context": "You know Fox cant run any stories about the mid terms so they run this non story for 3 days.\nToo funny. Remember when trump said we bombed the airports in the revolutionary war\nWE do",
        "good": "0",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "#LGB305",
        "time": "16 hours ago",
        "context": "Don the Lemon. Says it all for CNN.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "goodgrief69",
        "time": "16 hours ago",
        "context": "Maximum age on inauguration day should be 60! No exceptions",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "SadAmerican587",
        "time": "16 hours ago",
        "context": "Everyone knows now, the fake news media is exposed. There is no saving you, shut down and go away. ",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "lesfender",
        "time": "16 hours ago",
        "context": "That's just the way it is, some things will never change...",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bigdrop",
        "time": "16 hours ago",
        "context": "DEMORACTS = HYPOCRISY\n\nEnd of story.  Period.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "justthefacts555",
        "time": "16 hours ago",
        "context": "The year before Tim Apple, he had called Lockheed Martin CEO Marillyn Hewson “Marillyn Lockheed.”",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bearway64767",
        "time": "16 hours ago",
        "context": "Marxists worship their dear leaders.  Marxists NEVER say anything negative about their Dear Leader.  See North Korea as another example.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "goodgrief69",
        "time": "16 hours ago",
        "context": "CNN and MSNBC are just journalisming all over the place!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "lesfender",
        "time": "16 hours ago",
        "context": "Not cover it........they dont even see any issues with somebody looking for a dead person.  Keep in mind, he never really connected she was dead.  They just kinda moved on.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dalbur",
        "time": "16 hours ago",
        "context": "He is signing a new bill which is name after her today, he had sent emails and letters to her family.  He should have known, this is all dementia.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Nolibsplease908",
        "time": "16 hours ago",
        "context": "Finally, Biden is fun to watch.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "fatdaddy635",
        "time": "16 hours ago",
        "context": "State ran media. \n You know this because they all read from the same script that the police state hands them.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "BillyJackwasaliberal",
        "time": "16 hours ago",
        "context": "For someone that's not all there he sure is getting a lot done for America!......Republicans will not get the senate and the house is looking very very rocky. Well republicans worked to take away a woman's right to her own body in  state after red state democrats were busy getting real things done for America. Democrats have lowered healthcare cost , took real action on real climate change.  Biden's infrastructure bill is so popular that 14 republicans recently took credit for projects starting in their state unfortunately they voted against the bill that is bringing the projects!",
        "good": "1",
        "bad": "9",
        "replies": []
    },
    {
        "user_name": "roget324",
        "time": "16 hours ago",
        "context": "And these dufuses wonder why their ratings are in the dumpster. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "aionesco",
        "time": "16 hours ago",
        "context": "I guess it's no secret that we have a one party media, as with any other totalitarian country. We are The Resistance.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "randpaulsneighbor",
        "time": "16 hours ago",
        "context": "😂Thighland 😂",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Anti-Democrat-Disinformation-Warrior",
        "time": "16 hours ago",
        "context": "Why is NOBODY calling for Dementia Joe to undergo cognitive tests???!!!  The safety and security of this country DEMANDS IT!!!!",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "raindropsonroses",
        "time": "16 hours ago",
        "context": "Instead of focusing on how awful Biden is, let's put Trump out there and the Left will melt by the name \"Trump\". True ignorance to blame a man hundreds of miles away on a golf course somewhere for something that happened years ago. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "omeomi",
        "time": "16 hours ago",
        "context": "Trump was joking - and the media never seemed to realize he had a sense of humor - the dem media took everything he said at face value.   With Biden - they excuse every lie he tells, every gaffe he makes....and now he talks to dead people and the Dem media says 'you go, joe'.",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "FoolsWillAlwaysFollowFools....Period",
        "time": "16 hours ago",
        "context": "All of the news stations received orders to NOT mention Mr. Puddle Pants' \"cognitive issues!\"\nThis comes from those who are never seen or heard from.\n(Cleaned up because this site wouldn't allow for the correct spelling of \"Mr. Puddle Pants and his Brain-Faahtzzz\").",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "straightshooter101",
        "time": "16 hours ago",
        "context": "The problem is Joe Biden is not having gaffes. He's doesn't know what he is saying. Can you say ALZHEIMERS!",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rumorsofthetruth",
        "time": "16 hours ago",
        "context": "Where's Jackie?\nLet's Go Brandon!",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "outsideobserver927",
        "time": "16 hours ago",
        "context": "If Biden was not aware that the lady had passed away, the White House press secretary should have just said that.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Carissima",
        "time": "16 hours ago",
        "context": "They are contributing to the ruination of the US…..",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "randpaulsneighbor",
        "time": "16 hours ago",
        "context": "✊🏿Yo,Semite!!!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "J’a",
        "time": "16 hours ago",
        "context": "Of course fear pass for diaper boy, no surprise they’ll all be out of business in a year. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "airknocker",
        "time": "16 hours ago",
        "context": "This was no simple Gaffe as the media is promoting it as......Biden publicly \nmourned Rep. Walorski's death in a statement issued in August, and a \nvideo tribute to Walorski played at the event. Biden also recently \nsigned a bill renaming an Indiana V.A. clinic after Walorski, \nbut apparently none of those events stuck with him enough to prevent him\n from searching the crowd for the late congresswoman.",
        "good": "10",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "h8libs_alot",
        "time": "16 hours ago",
        "context": "The hypocrisy of the MSM is not longer stunning - it's pure propaganda similar to what you see in China and the Middle East.  Shameful. Then again, I never watch those sources anyway.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "pacnordawg",
        "time": "16 hours ago",
        "context": "Folks, only one real reason to why Biden is still in office, the folks in CHARGE of really running this administration and country don’t want a Black woman as President\nThis includes the media….",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "nkdgolf1",
        "time": "16 hours ago",
        "context": "There’s a reason no one watches these two joke stations.  ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "maggie12345",
        "time": "16 hours ago",
        "context": "For fun, I googled on “where’s Jackie cnn” and found several news stories.  I then googled on “Frederick douglass Trump Fox News” and found none.  CNN is far more willing to report on democrat  mistakes/shortcomings than fox is on those of republicans.",
        "good": "0",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "redwoodkingfish",
        "time": "16 hours ago",
        "context": "Time for breakfast. 3 eggs a couple of slices of bacon, wheat toast and a BIG glass of red hat tears. So much winning",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "redwoodkingfish",
        "time": "16 hours ago",
        "context": "Remember when Joe told trump to \"shut up\" and then took his job. Now that was funny,\nAm I right red hats ?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "peteringeorgia",
        "time": "16 hours ago",
        "context": "What about the time Trump thought Fredrick Douglas was living.",
        "good": "1",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "66+",
        "time": "16 hours ago",
        "context": "MAIN STREET MEDIA. A.K.A. DEMENTIA JOE'S PROTECTORS!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Th1nk2wic3",
        "time": "16 hours ago",
        "context": "\"EPA says 'do not ingest' disinfectants after controversy over Trump coronavirus comments\"\n\nhttps://www.foxnews.com/politics/epa-warns-americans-do-not-ingest-disinfectants",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "insertnamehere386",
        "time": "16 hours ago",
        "context": "And Fox News avoids stories about Trump stealing classified documents, inciting a coup attempt and absolutely colluding with Russia.\nYou know, important things.",
        "good": "0",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "satan*rules*this*world*but*his*time*has*come",
        "time": "16 hours ago",
        "context": "I have yet to meet a Biden supporter in public, even though they voted for him they're too ashamed to be recognized for it.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "abstractanalysisofthebombarde",
        "time": "16 hours ago",
        "context": "The only way anyone knows what CNN and PMSDNC are saying is by seeing Fox News report on it.  Quit giving CNN and PMSDNC any coverage.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "lesfender",
        "time": "16 hours ago",
        "context": "I want to hear Biden in whisper mode say.......\"I see dead people\"",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "awalk",
        "time": "16 hours ago",
        "context": "One of the worst ones for Trump. Was when he was on stage saying Melania wishes she could be here with us. I guess he forgot she was right on stage with him. But Fox News only talks about Biden. Pure hypocrites",
        "good": "2",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "Danger🧨Mouse2022",
        "time": "16 hours ago",
        "context": "Leftists. First thing to go is their common sense.  Then the sense of humor. 🤭",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Anarchy-From-Texas",
        "time": "16 hours ago",
        "context": "They should be covering it, but Fox News needs to cover all of Trump's snafu's as well.   We all know Fox doesn't carry them.",
        "good": "0",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "skylines",
        "time": "15 hours ago",
        "context": "CNN, MSNBC avoid Biden's Where's Jackie?.... Where's CNN?, Where's MSNBC? They are both lost in the ratings.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "igirl",
        "time": "15 hours ago",
        "context": "INFLATION JOE is just a PUPPET of a group of people who want to turn the USA into a third world country !\n\nVOTE OUT ALL DEMS",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "msattler066",
        "time": "15 hours ago",
        "context": "The liberal media is always going to present what suits their agendas rather than anything truthful.   That's why so few people pay it much mind anymore.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "fartyhearty",
        "time": "15 hours ago",
        "context": "George Washington! The father of our nation! Where’s George? Stand up and say hello!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "geedubb",
        "time": "15 hours ago",
        "context": "This is what passes for journalism?  Fox \"News\" is a joke.",
        "good": "0",
        "bad": "8",
        "replies": []
    },
    {
        "user_name": "BOB2016",
        "time": "15 hours ago",
        "context": "Trump describes the media as dishonest and calls their reporting fake news.  This story points that out.  CNN and MSNBC are not credible news services....never were.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "comeagain",
        "time": "15 hours ago",
        "context": "Both men are too old for the job.\n\nSounds like CNN and MSNBC are biased. Did Fox cover trumps “Tim apple” gaffe or are they being hypocrites ??",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "HadEnuph",
        "time": "15 hours ago",
        "context": "Harris praises North Korea and Biden is looking for dead people.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "redwoodkingfish",
        "time": "15 hours ago",
        "context": "Fox runs this non story for 3 days to keeps the red hats \"minds\" off the midterms\nROEVEMBER is coming no matter how hard you cry red hats",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "micdund3836",
        "time": "16 hours ago",
        "context": "Trump abd Biden were both horrific presidents.\nI don't know why any of you spend even a second defending either of these people.",
        "good": "0",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "houtex",
        "time": "15 hours ago",
        "context": "After covering up Hillary's criminality, Hunter's criminality, and Biden's gaffe's, is it any wonder why the media is largely hated and ignored by the majority of the American public?",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Savedemocracy523",
        "time": "15 hours ago",
        "context": "And this is why CNN is dying. No one wants censorship and they simply don’t get it.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Anti-Democrat-Disinformation-Warrior",
        "time": "15 hours ago",
        "context": "CNN has ONE article on it and it dismisses it as a \"gaffe\".  And the beat/deceit goes on...",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "davegreen50",
        "time": "15 hours ago",
        "context": "Don't get me wrong, it's not one sided, but really? \"You picked on OUR guy when HE made a gaff, but ignored a gaff from YOUR guy! We're telling!!\"",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "wileyk",
        "time": "15 hours ago",
        "context": "They should be happy for him.  Apparently he's moving on from pedophilia to necrophilia.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "airknocker",
        "time": "15 hours ago",
        "context": "Yesterday........\nJoey aimlessly wandered towards computers shortly after \ndiscussing the impact of Hurricane Ian at the FEMA Headquarters today \nand ignored FEMA administrator Deanne Criswell, who failed to guide the \nconfused president in the correct direction.\nAfter it was apparent that Biden was ignoring Criswell and Homeland \nSecurity Chief Alejandro Mayorkas, and aimlessly wandering towards the \ncomputers, the president appeared to momentarily realize he was not \nwhere he should be.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ah44",
        "time": "15 hours ago",
        "context": "I watched Trump give hours of press conferences, answering question after question, all with no teleprompter, and he did a great job.  I've seen Trump at his rallies speaking off the cuff for hours, and again, he did a great job.  Meanwhile, Biden can't even read the teleprompter, and if he goes off script, then he shows he is inept, and not very smart.  The fact the media covered for Biden to help him get elected and now, are still covering for him is absurd.  Imagine, just imagine, if Trump told anybody, \"You ain't black if you don't vote for me.\"",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Mons1914",
        "time": "15 hours ago",
        "context": "\"Where's your 401K?\"",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Independent00",
        "time": "15 hours ago",
        "context": "Top of what? Mind? What mind?",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Th1nk2wic3",
        "time": "15 hours ago",
        "context": "\"Trump to Hannity: Presidents can declassify documents 'by thinking about it'\"\n\nhttps://www.foxnews.com/politics/trump-hannity-presidents-can-declassify-documents-thinking-about-it",
        "good": "0",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "wsdutton",
        "time": "16 hours ago",
        "context": "Tim Apple was a normal occurrence for Trump. He also can’t say the word “origin”. He calls it oranges.",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "getaway922",
        "time": "15 hours ago",
        "context": "I suppose Fox NEVER avoids certain stories that make Trump and his cult look unfavorable? Like the lunatic Trump thinking right now he won the 2020 election after 2 yrs? Maybe people could drink bleach? So many others!",
        "good": "5",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "Tecmaniac",
        "time": "16 hours ago",
        "context": "COGNITIVE TEST !!!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "gatorskin",
        "time": "15 hours ago",
        "context": "Did he thank the Easter BUnny again!!???",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "gatorskin",
        "time": "15 hours ago",
        "context": "C'mon Chuck stand up!!!! (He was paralyzed!!!!)",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "eastvanmum",
        "time": "15 hours ago",
        "context": "Come on people... both Bidens “ where’s Jackie” and Trump looking around a table for Frederick Douglas....\nGotta just make you smile ...even a little bit!!!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "HBCA",
        "time": "15 hours ago",
        "context": "Where's Jackie will turn out to be even bigger than let's go Brandon.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "BillyJackwasaliberal",
        "time": "15 hours ago",
        "context": "Wow! For someone that's not all there he sure is getting a lot of great things  for America!......Republicans will not get the senate and the house is looking very very rocky. Well republicans worked to take away a woman's right to her own body in  state after red state democrats were busy getting real things done for America. Democrats have lowered healthcare cost , took real action on real climate change.  Biden's infrastructure bill is so popular that 14 republicans recently took credit for projects starting in their state unfortunately they voted against the bill that is bringing the projects!",
        "good": "0",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "strandedinthecenter",
        "time": "15 hours ago",
        "context": "If the \"Tim Apple\" incident had been Biden, he'd have called him Bill Gates, and the media would be explaining that it's an easy mistake.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "navchief",
        "time": "15 hours ago",
        "context": "I thought he was looking for his \"blankie\" in jacket form? Time for a nappie, Joey",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "PatriotCalifornia",
        "time": "15 hours ago",
        "context": "Trump uses thought control to change classification of docs! He could have used the sharpie to move the hurricane ",
        "good": "1",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "PatriotCalifornia",
        "time": "15 hours ago",
        "context": "Trump stole secrets and his billionaire buddies gave Saudi and the UAE access to the president and changed speeches to give - the president did it just like the puppet he is ! Traitor to our country!!!",
        "good": "0",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "jamie070",
        "time": "15 hours ago",
        "context": "this histrionics is so typical of how unhinged republicans .  I see no reason why biden should have known she died.   she's just someone he knew.   not family. not a friend.   no one of distinction,  so why should he have known at all?   no reason.   Like a CEO that has over 500 staff, why would he know that?   he wouldn't.   No one would have bothered him with it, he's busy, it's inconsequential to his job and his life.   Just republicans once against being nonsensical.  Trump said drink bleach that's reasonable.   yet biden is supposed to be omniscient about 500 members of staff.   republciansre so unhinged",
        "good": "0",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "maxhardover",
        "time": "15 hours ago",
        "context": "I   see    dead   People...\n                                                -Joe Biden",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jb1080",
        "time": "15 hours ago",
        "context": "The MM calls a Trump \"slip of the tongue\" a sign of mental decline, but Biden forgetting a Congresswoman's death less than 60 days after, as he asks where she is,  is just a wittle gaff.  Hilariously biased and we all see it.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "GL13851",
        "time": "15 hours ago",
        "context": "Biden's 'Where's\nJackie ⁉️ OH COME ON Man‼️ 🇺🇸🇺🇸🇺🇸 MAGA 2024🇺🇸🇺🇸🇺🇸",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tbone113",
        "time": "15 hours ago",
        "context": "F CNN and MSNBC.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "socrates469",
        "time": "15 hours ago",
        "context": "Trump and Biden are too old.   They both belong in a nursing home.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "spiderweb2",
        "time": "15 hours ago",
        "context": "Is anyone really surprised at this point. CNN and MSNBC aren't news sites.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "furryguy64",
        "time": "15 hours ago",
        "context": "This is not true. Both networks covered it. As for Trump. well, his snafus are legendary and plentiful, so....",
        "good": "1",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "hineni47618",
        "time": "15 hours ago",
        "context": "If the Dems have a presidential primary in 2024 I probably won't vote for Joe Biden, but I will vote for the Dem ticket that Nov because presidential elections are a choice between the GOP & Dem tickets. The Republican party as it is today is utterly corrupt & riddled with treason & incompetence. \n\nJoe Biden was well known for his gaffes for decades. His performance as president is more than adequate in contrast to his immediate predecessor. I shudder to think how President Trump would have handled the Ukraine war.",
        "good": "1",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "marybethm",
        "time": "15 hours ago",
        "context": "Trump took a cognitive exam by WH physician. Now Congressman Tx and scored 100% pass. Biden needs to now. ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "CanYouHandletheTruth034",
        "time": "15 hours ago",
        "context": "Expectations verified true become facts. So, if you want propaganda and lies and coverups with your morning coffee, then the Dim MSM is there for you.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "#nogascon",
        "time": "15 hours ago",
        "context": "The job of Socialist controlled media is to defend their party's leader at any cost. They will do anything to defend him, cover up for him, lie for him and minimize the damage at all cost. They are not journalists, but Socialist Activists who will lie, deny, and defend their feckless leader while attacking his political enemies.  The hypocrisy is breath taking.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "good-ol-bad-guy",
        "time": "15 hours ago",
        "context": "It's a shame to see Bidumb in such a stage of dementia. If he were an animal the humanitarian thing to do would be to put him down.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Tara12",
        "time": "15 hours ago",
        "context": "Nothing new. We know the media is dishonest, sleazy and despicable.  ",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Simpleman85",
        "time": "15 hours ago",
        "context": "No reason to worry - Joe has nightly conversations with JFK and FDR, these specters have been a guiding influence for him",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "truthseeker1266",
        "time": "15 hours ago",
        "context": "Maybe if our southern border was declared a DMZ she could make a visit and declare  America's \"rock-solid commitment\" to Canadians.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bazinski",
        "time": "15 hours ago",
        "context": "For my monthly cable TV fee, I certainly expect more insightful reporting from news organizations which now appear to be akin to a school of pubescent girls in training bras.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "karl_hungus",
        "time": "15 hours ago",
        "context": "She’s dead but he shook hands with her anyways.  Told her she’s got quite a grip.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "commonsense236",
        "time": "15 hours ago",
        "context": "Karine Jean-Pierre is truly an historic figure.  She is - without a doubt - the worst press secretary in my lifetime, and I'm retired.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bingo!232",
        "time": "15 hours ago",
        "context": "HHHUUUGGGEEE difference.  Trump took the MoCA test and aced it.  Biden????  If he has taken the test he hasn't told us nor has he released the results.  Biden has lost his marbles and we all know it.  Looking around for a dead person is just the beginning.  It only gets worse from here.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "waterwellone",
        "time": "15 hours ago",
        "context": "Where in the hello is Saturday Night Live when the country needs some humor? \nThe Biden administration has offered up more opportunity for the good citizens of the United States of America to laugh at them selves than any other POTUS in history. \nCome ON!  SNL lets see some skits with Jean-Perrier answering question about Biden when he is about to deliver a serious message but comes up with an oddball comment like 'Where is Jackie'.  SNL, do not become part of the dehumanization of the people of this country.  People need a good laugh now and then.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "emjae",
        "time": "15 hours ago",
        "context": "I guess we can understand his mistake since most of his voters are dead.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ahopfer",
        "time": "15 hours ago",
        "context": "The Progressive Liberal media (ABC, CBS, NBC, WaPo, NYT etc. and cnn and msnbc) always misrepresent Both political parties. This un American media every days rigs elections by ignoring all the wrong Democrats achieve and ignoring all the good Republicans achieve. This media goes even further to extreme hype of allegations toward Republicans.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bidendeclining",
        "time": "15 hours ago",
        "context": "Just when you think the worst President in history can’t get worse, Biden manages to once again make a fool of himself. Hard to watch the accelerated decline. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "chuckbryan",
        "time": "15 hours ago",
        "context": "FAKE NEWS gets more viewers here than at their channels.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "elkraken",
        "time": "15 hours ago",
        "context": "Jackie just voted.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "justthefacts555",
        "time": "15 hours ago",
        "context": "Fox News didn't see a word about Trump's rally last week when he told his cult, \"We need to keep our country gay!\", but sure let's look at what CNN is doing.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jamie070",
        "time": "15 hours ago",
        "context": "When I first heard the story I thought...so??? why should he have known or even if he  heard someone he didn't know and isn't family died.  oh well, well, he's bringing down the trade  debt, our economy is doing better than any other across teh world, joe is handing inflation and labor shortage and supply chain better than any other country in the world, Biden was spot on about his response to Ukraine, he got us vaccines quickly which got our country going again...he's basically done an awesome awesome job so I guess republicans have to attack him for not being omniscient about the health status of over 400 members of congress and 100 senators.  yeah, I guess that's all they have to complain about ...he's not all knowing meanwhile, trump said drink bleach and and didn't know the CEO of APPLE wasn't named \"Tim Apple\"",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bdatruth",
        "time": "15 hours ago",
        "context": "What Jackie represents is the kind of non-MAGA Republican Joe says he can work with, sort of like Liz Cheney and Adam Kinzinger.\nI'll bet this staff told him to give her a 'shout out', opps failed again.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "huntington-smythe873",
        "time": "15 hours ago",
        "context": "Biden said he shook hands with Jackie at breakfast.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "gallowspoll",
        "time": "15 hours ago",
        "context": "See what happens when media outlets are funded by the government?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "brassdragon",
        "time": "15 hours ago",
        "context": "The MSM refuses to acknowledge or report, the WH staff refuses to answer questions or concerns, the Democrats in Congress ignore inquiries about the visually obvious cognitive mental deterioration of this current President.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "162DWing",
        "time": "15 hours ago",
        "context": "Sorry CNN, that’s a weak attempt to cover President Biden’s mental health, Pres Trump saying Tim Apple is actually funny.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bdatruth",
        "time": "15 hours ago",
        "context": "Great how do they explain Kamala announcing our enduring alliance with North Korea.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "concerned_conservative668",
        "time": "15 hours ago",
        "context": "There's always two sets of rules...",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "DJ1492",
        "time": "15 hours ago",
        "context": "While the \"mainstream media\" remains firmly committed to Biden and the Dems, they don't appreciate being treated like they're stupid. When the press secretary refuses to answer legitimate questions about Joe's dementia they may just make a bigger story out of it. The scariest part? God forbid Kamala Harris would have to step in. The very thought gives me cold chills.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cacjme",
        "time": "15 hours ago",
        "context": "Tim Apple is funny, where's Jackie is just plain pitiful.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "elkraken",
        "time": "15 hours ago",
        "context": "Anyone seen Jackie?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "eyewin",
        "time": "15 hours ago",
        "context": "Drive by media, lame stream media is what Rush called them since Clinton and they have only gotten worse.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "countryboy562",
        "time": "15 hours ago",
        "context": "Trump just said it! I see dead people. He is the kid from The 6th sense” all grown up! Biden just Alzheimered up!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "\"eric\"",
        "time": "15 hours ago",
        "context": "Toppled Mind Joe",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "veryoldcop202",
        "time": "15 hours ago",
        "context": "I am trying to recall the MSM reporting anything negative about the amoeba",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jeb_stewart",
        "time": "15 hours ago",
        "context": "And this is why Smurf re-runs have higher viewership than CNN ans MSNBC.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "billybobmagaidiot",
        "time": "13 hours ago",
        "context": "Other media outlets know are way ahead of fox as being a news source",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mdam19",
        "time": "15 hours ago",
        "context": "What is the most repulsive nauseating repugnant thing on this planet? A democrat.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "obiden569",
        "time": "15 hours ago",
        "context": "The media and the liberals are deviding this country.  The media attacked Trump 24/7.   Trump had to fight back. Vote red",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "TAK2",
        "time": "15 hours ago",
        "context": "Nope, no double standard here...  move along....",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "irondragon1",
        "time": "14 hours ago",
        "context": "CNN would be non existent if Fox along with the other network quit bringing them up. Who cares what they do or don't cover?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "justthefacts555",
        "time": "15 hours ago",
        "context": "Tim Apple?  What about Trump's claim about George Washington taking over the airports in 1775??  Was that old age or just stupidity? \n\n“The Continental Army suffered a bitter winter of Valley Forge, found glory across the waters of the Delaware and seized victory from Cornwallis of Yorktown. Our army manned the air. It rammed the ramparts. It took over the airports. It did everything it had to do.",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "marine0024",
        "time": "14 hours ago",
        "context": "And the Nappy said?  Oh thats right, NOBODY CARES!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "indridcold322",
        "time": "15 hours ago",
        "context": "Tim apple is funny I will give you that but when you are walking around looking for a dead person that is just hilarious that shows your mind is completely gone , right now we are living in the movie weekend at Bernies and guess what part Joe is playing , if I was Russia and China I would have already attacked because America has never been weaker than it is with Joe Biden.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ahopfer",
        "time": "15 hours ago",
        "context": "Only ~ 72% of Americans know the Liberal Media is lying to them. The other 28% don't want to hear it. The lack of Due Process was very noticeable during both impeachments THAT was ignored and once the Media ignores; that is when voters have an excuse not to see it.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "obiden569",
        "time": "14 hours ago",
        "context": "Joe Biden is the worst president ever, he must be stopped. 100 house seats and 7 Senate in the midterms will do the trick",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "sigp229",
        "time": "15 hours ago",
        "context": "Today Joetard is looking for Elvis!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "commonsense236",
        "time": "14 hours ago",
        "context": "Can you imagine the press if President Trump had been looking for (the late) Steve Jobs?",
        "good": "0",
        "bad": "0",
        "replies": []
    }
]