[
    {
        "user_name": "HarryBaals404",
        "time": "14 August, 2022",
        "context": "Can’t pump oil in America because some how America is making the planet cleaner by pumping the oil in foreign countries then buying it and having it shipped to the United States. ",
        "good": "5",
        "bad": "2",
        "replies": [
            {
                "user_name": "FrankieRizzo656",
                "time": "14 August, 2022",
                "context": "Yes. When democrats ban drilling in our country we are in effect exporting pollution to countries who are nowhere near as kind to the environment as we are. Net effect- democrats have created more pollution. Made things worse.",
                "good": "5",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "lycopine",
                        "time": "16 August, 2022",
                        "context": "maybe the 9000 oil leases that are currently awaiting drilling would happen if Big Oil stopped making such high profits by restricting supply in the USA.\nCANCER-vatives, always blaming someone without evidence, facts or data.",
                        "good": "0",
                        "bad": "1",
                        "replies": [
                            {
                                "user_name": "FrankieRizzo656",
                                "time": "2 September, 2022",
                                "context": "Profits are the name of the game in capitalism. Take oil companies profits away....",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "wng239",
                "time": "16 August, 2022",
                "context": "Last I checked US today remains the biggest driller of oil.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "rrconsv22",
        "time": "14 August, 2022",
        "context": "Granholm 200% A COMPLETE AND TOTAL DISGRACE.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "reaganghost277",
        "time": "14 August, 2022",
        "context": "About time a dem said what every normal thinker knows.  Guess she'll be out of a job soon.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "DefamedWorker",
        "time": "14 August, 2022",
        "context": "Nuclear energy clean energy? So I guess all that nuclear waste and spent fuel rods they have been burying all across the US is just super good for the environment too. Im sure the people that lived around Fukushima and Chernobyl would disagree about how clean nuclear energy is.",
        "good": "1",
        "bad": "1",
        "replies": [
            {
                "user_name": "masterzvoice",
                "time": "15 August, 2022",
                "context": "There are a lot of solutions to that in recent years the media has refused to cover ---until now, apparently.",
                "good": "1",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "DefamedWorker",
                        "time": "21 August, 2022",
                        "context": "What solutions? Could you name some of them, or provide a link naming them? I like to verify such claims. Nothing personal.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "TRUTH!395",
                "time": "21 August, 2022",
                "context": "Wonder where they'll bury the used batteries from EVs?",
                "good": "2",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "DefamedWorker",
                        "time": "21 August, 2022",
                        "context": "Same place they are storing nuclear waste no doubt.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "FrankieRizzo656",
        "time": "14 August, 2022",
        "context": "Heard from my Russian friends Putin loves Biden gaffes. Cracks him up.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "blewsea",
        "time": "14 August, 2022",
        "context": "CBO says different. Who do you trust?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "realrelics",
        "time": "14 August, 2022",
        "context": "Nuclear power plants would be fine, as long as they are only Thorium reactors. Which are very safe and don't have any meltdown issues.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "undercat",
        "time": "14 August, 2022",
        "context": "Well at least she's not here to tell us that shutting down pipeline projects and canceling drilling leases has no effect on prices.  So there's that.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "lycopine",
                "time": "16 August, 2022",
                "context": "a pipeline that was never built has ZERO effect on prices, and there's over 9000 leases awaiting drilling that big oil ignores. And why not? With such high demand and an artificially restricted supply big oil has seen sky high record profits the past 3 years.\nSo there's that...",
                "good": "0",
                "bad": "2",
                "replies": [
                    {
                        "user_name": "TRUTH!395",
                        "time": "21 August, 2022",
                        "context": "That would be true, if the Progressives allowed OUR GOVERNMENT TO ISSUE PERMITS! They never talk about that part....just big bad oil companies. Why would the oil companies invest BILLIONS, WHEN THE BIDEN ADMINISTRATION TELLS US THAT IT'S A DEAD INDUSTRY?",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "FrankieRizzo656",
        "time": "14 August, 2022",
        "context": "This is great. Democrats must get over their fear of clean safe nuclear power. We can't run on unicorn farts like they think.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "HarryBaals404",
        "time": "14 August, 2022",
        "context": "Meanwhile China is building hundreds of new coal fired power plants to make more products to sell to Americans, then use that money to buy up America’s farmland and real estate and companies. Makes sense to Democrats.",
        "good": "10",
        "bad": "2",
        "replies": [
            {
                "user_name": "YetHereYouAre",
                "time": "15 August, 2022",
                "context": "They got to pay off the Big Guy somehow.",
                "good": "1",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "wng239",
                "time": "16 August, 2022",
                "context": "China is building coal plants, but they are also shutting down old coal plants. And they also built out 3X more renewables than US in 2021, and it will be 5X more renewables than US in 2022.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "bringoutyourdead1143",
                        "time": "16 August, 2022",
                        "context": "You left a letter out of your name, WONG! FXI!",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "OliveBottleOpener",
        "time": "17 August, 2022",
        "context": "And what about the by product of nuclear power.  Ultimately it will end up in the watersheds.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "EatenByAGrue",
        "time": "16 August, 2022",
        "context": "Ironic, isn't it...",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "biggunbrandon",
        "time": "16 August, 2022",
        "context": "Climate change is real. But it's not coming from industry or energy. \n\nRussia has been the perpetrator since the Soviets put a program in place in the 1950s to deliberately raise the temperature on Earth in order to terraform their north and Siberia to be more hospitable. They are finally succeeding at the long game and it's giving them the confidence to begin an invasion on Europe. \n\nAt the same time, their propoganda machine has been sabotaging us with the promise of electric cars and wind turbines. Wake up.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jrettinger",
        "time": "17 August, 2022",
        "context": "A windmill, solar panel, or tide wave gadget produce electricity to light one single light bulb in a demonstration model.  There are no inventions of this kind that power an entire small city for its electrical needs.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "wng239",
                "time": "18 August, 2022",
                "context": "solar panels on my roof produce more power than my entire house. And I don't even have a large roof.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "skeff",
        "time": "17 August, 2022",
        "context": "Wait a second. Is this the same (mis)-Administration? They must smell vast sums of graft and corruption cash from nuclear mega-projects.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cg2022",
        "time": "14 August, 2022",
        "context": "But they have shut down or are shutting our existing facilities.  Just wow!",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "wng239",
                "time": "16 August, 2022",
                "context": "Because old reactors need expensive maintenance that costs pretty much close to what it cost to build them in the first place.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "wng239",
        "time": "16 August, 2022",
        "context": "The big issues with nuclear are:\nhigh price, 2-3x more expensive\ntakes a long time to build, some have taken 15 years\nneeds lots of water\npoor ramp times",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "lycopine",
                "time": "16 August, 2022",
                "context": "Hopefully within 10-20 years fusion energy will bail out planet Earth's human inhabitants before they completely destroy it.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "wng239",
                        "time": "16 August, 2022",
                        "context": "Fusion energy will not bail out humans. First of all, let us imagine we suddenly are able to do fusion. Do you honestly think that we'll be handing out fusion reactors all over the world? We know humans and answer is no.\n\nAnd to be honest, I'll tell you this. Even if fusion gives unlimited free energy, at least for residential use. Solar PV+batteries will be cheaper. Do you know why? Because generation is half the cost, the other half is transmission and distribution costs. So can solar pv + batteries becomes cheaper than distribution and transmission costs? The answer is yes.\n\nNot to mention, we should be moving away from a centralized grid. Any time a wire gets cut between you and the power source and you get blackouts. It also makes it difficult to do maintenance on the grid as taking down anything can result in issues.\n\nWhat I'd like to see is reform of the artificial restrictions on rooftop solar, Australia pays 2.5X less for rooftop solar than people in US do.(this is without subsidies).",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "kartl",
                "time": "16 August, 2022",
                "context": "Did you read the article?  Are you following the next gen nuclear power plants?  Yes the older plants are costly but the goal is to not build the ear type plants but small scale nuclear plants \n\nSee Lynn Good Barton’s round table talk on nuclear energy and open your mind.  \n\nSolar and wind will not cut it at all",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "wng239",
                        "time": "16 August, 2022",
                        "context": "Yes I have been following next gen nuclear powerplants, but so far those have only been tested in a lab. It'll be a few years before one is used commercially assuming no delays. Then probably a decade until all the little things are worked out. Then another decade or 2 until it gets to mass adoption.\n\nAnd why do you think solar and wind (alongside other renewables) won't cut it at all? Do explain.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "kartl",
                                "time": "17 August, 2022",
                                "context": "The renewables cannot carry base load power needs. \n\nThey are not reliable 24 x 7.",
                                "good": "0",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "wng239",
                                        "time": "17 August, 2022",
                                        "context": "Sure they can, hydro, geothermal, biofuel, tidal can do baseload.\n\nThat said, the concept of baseload is in itself a bit flawed.\n\nNo power source can do 24x7 reliably, 100% capacity factor doesn't exist. What makes the grid reliable is the grid as a whole. If there is no wind in location A, there is wind in location B. Add combination of multiple renewables, some storage and you get a reliable grid. Even more reliable than we have now.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "balowski-seven",
        "time": "15 August, 2022",
        "context": "Democrats have blocked the development of nuclear power for the last 40 years.   They are scam artists.   If you do try to build a nuclear plant, Democrats will make sure it takes decades to open... is at all.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mermaidsirencall",
        "time": "16 August, 2022",
        "context": "Did she forget about the 3-Mile Island catastrophe on March 28, 1979?  Then there is Chernobyl disaster on April 26, 1986.  She's certainly is old enough to have heard about both. She also seems to know or forgotten as she didn't mention that nuclear plants use millions of gallons of water to keep cool - expelling a flow out into the water that it is in - that will increase the water to at least 10 degrees warmer - causing significant thermal water pollution, killing fish & increase algae growth.  It also could potentially affect the weather in the area where it is located.  This study came out of Stanford University published report of February 19, 2019.\nAnother dummy in this biden admin.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "money4nuttin",
                "time": "16 August, 2022",
                "context": "Death count from TMI? \nName an energy source that does not a large negative impact. \n\nAnd for citing nuclear disasters, don't forget the 2011 Fukushima Daiichi.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "patriot4life",
        "time": "27 August, 2022",
        "context": "What about all the buried spent nuclear fuel rods. Eventually that is gonna be a problem. Why not Natural gas fired electric plants, It burns clean and we have lots of it.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "masterzvoice",
        "time": "15 August, 2022",
        "context": "30% tax credits? That means nothing to the little guy. If you make $100,000 a year and install a 1x $20,000 solar system on your roof, you could save $6,000 and pay $14,000 in taxes instead of $20,000in taxes this year. \n\nBut even then you are out $14,000 this year for the system which might save you $100 a month in electricity and which will cost $300 per year to clean and maintain during its 20 year life span.",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "wng239",
                "time": "16 August, 2022",
                "context": "I've had solar panels for a few years, have paid $0 to clean them. Rain kind of self cleans them.\n\nYou can also take a loan, pay 0 down. And just have lower monthly bills. Just less savings as the total of the loan would be higher.",
                "good": "0",
                "bad": "2",
                "replies": []
            }
        ]
    },
    {
        "user_name": "Nebsy",
        "time": "15 August, 2022",
        "context": "Next gen military/naval vessels....  wind and solar?  haha.  OBVIOUSLY, nuclear energy is absolutely essential.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "earlwb",
        "time": "16 August, 2022",
        "context": "The Dems regulated nuclear energy out of existence. If what she said was true they would be building more nuclear plants. But there isn’t even one nuclear plant to be built at all on the drawing boards.",
        "good": "2",
        "bad": "0",
        "replies": [
            {
                "user_name": "wng239",
                "time": "16 August, 2022",
                "context": "Pretty sure there are, there is even one coming up this year in Georgia.\n\nThat said, the biggest problem with nuclear is again the high cost",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "Haywoodjablowme303",
        "time": "16 August, 2022",
        "context": "The U.S. had the biggest uranium stocks in the world but Hillary let RUSSIA BUY THEM.\nFACT.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "proud_to_be_conservative680",
        "time": "16 August, 2022",
        "context": "With the technology we have right now, nuclear power is the only stable source of energy if fossil fuels are eliminated.  There is much safer technology for nuclear plants now than in the past including ones that use thorium which is a much more abundant element and not one that can be used in weapons.  The Green Gang can't have it both ways.  You can't say you are for green energy but not nuclear.  It has to be part of the solution.  Wind and solar are not stable forms of energy until we find a way to store it.",
        "good": "6",
        "bad": "0",
        "replies": [
            {
                "user_name": "wng239",
                "time": "16 August, 2022",
                "context": "Thorium is still in experimental stage. It'll be decades before it becomes generally available.\n\nWind and solar complement each other and are stable enough for use, storing is one option, another is overgeneration(what difference if it is cheap), you can also backfill with other renewables like geothermal, hydro, tidal, biofuel and etc. Many of which are still cheaper than nuclear.\n\nThere is also cheap storage now available called Sand batteries. You effectively heat up sand and it keeps it for long term storage.",
                "good": "0",
                "bad": "3",
                "replies": []
            }
        ]
    },
    {
        "user_name": "Remmi341",
        "time": "14 August, 2022",
        "context": "we will need a thousand more to keep up with the demand that will be needed with all the electric cars and trucks they plan to have,",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "brylcreamboomer",
        "time": "15 August, 2022",
        "context": "Overall i agree thorium nuclear power is the way to go, but I'll add this too.... she's pretty clueless about what the department of energy is really all about.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "money4nuttin",
        "time": "16 August, 2022",
        "context": "Adding nuclear to the energy systems is the first intelligent thing Granholm has said since taking the assignment she is unqualified for. Then, predictably, she screwed it up by talking about putting solar panels on your roof subsidized with your own money.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dan5047628",
        "time": "17 August, 2022",
        "context": "Clean Energy? No such thing. Solar Panels are made from toxic materials, Wind Turbines kill Eagles and other birds. Nuclear is Nuclear and will never be clean. \nWith that said: The Earth will be fine until God is done with it.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "wng239",
                "time": "18 August, 2022",
                "context": "What toxic materials is there in solar panels? (the ones actually put on people's rooftops, not niche panels)\n\nWind turbines kill 3-5x less birds than coal. And with improvements those numbers continue to decrease",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "lycopine",
                "time": "5 September, 2022",
                "context": "my god will destroy your god long before that...",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "NormanBlanton",
        "time": "15 August, 2022",
        "context": "Natural Gas is much Cleaner than Coal.\n\nso why Ban Fracking",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "0100011001010101",
                "time": "15 August, 2022",
                "context": "So there's drinkable water?",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "NormanBlanton",
                        "time": "16 August, 2022",
                        "context": "NG doesn't contaminate the water table,  there are thousand of feet between the two stratum.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "lycopine",
                                "time": "16 August, 2022",
                                "context": "if that's so true, why did \"W\" expand fracking for his big oil donors and exempt them from the Clean Water Act?",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "earlwb",
        "time": "24 August, 2022",
        "context": "They regulated the nuclear industry out of business. No new nuclear power plants are being built and the current ones are on borrowed time until deactivated. So she lies like usual.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mtwallet526",
        "time": "15 August, 2022",
        "context": "Not until you deal with the waste problem. Storing it in 55 gal drums out in the yard don't cut it.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "Polyesterpants",
                "time": "15 August, 2022",
                "context": "unlike the 80s. todays nuclear technology recycles 90% of the nuclear waste using uranium rods. And, thorium reactors produce even less. do some research before doubting nuclear energys roll in our future",
                "good": "3",
                "bad": "2",
                "replies": [
                    {
                        "user_name": "mtwallet526",
                        "time": "15 August, 2022",
                        "context": "So, you don't have a problem with storing new waste along side the old waste still stuck in storage because no one wants to deal with it effectively. \"Not in My back yard\" is the current expression. Yet taking these facilities off line is a no no. It doesn't matter what or how good today's tech does or doesn't. We still have yesterday's, and even last decades waste. Yucca Mtn. still costs taxpayers annually even though it goes unused. The WIPP facility in N.M. just sticks it underground. Recycling only the various containers. And some power plants are Still storing on site. Research ? Ya, enough to know that the problem hasn't been solved. While we continue to create more.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "quietsmith",
                                "time": "16 August, 2022",
                                "context": "Burning fossil fuels creates a huge problem with no solution.\n\nNuclear creates a problem we can cope with.",
                                "good": "0",
                                "bad": "1",
                                "replies": [
                                    {
                                        "user_name": "mtwallet526",
                                        "time": "16 August, 2022",
                                        "context": "By all means, enlighten us.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "Nebsy",
                "time": "15 August, 2022",
                "context": "mtwallet..  You know how to tell when somebody doesn't have a legitimate argument?  They exaggerate the problem.  \nAll of U.S. nuclear waste fits on a football field a few yards deep.  In other words...  the problem is minimal.  Very minimal.  It' takes a mile long train of coal to generate the energy you'll use in your lifetime.  Vs...  the same energy from a tablespoon of nuclear fuel.  VS...  how much pollution, mining deaths, processing deaths...  to produce the solar panels, wind turbines etc to provide that energy.  More people die installing solar panels..  falling off buildings then are killed by nuclear energy/nuclear waste.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "mtwallet526",
                        "time": "15 August, 2022",
                        "context": "SO ? That doesn't do anything about the problem. Out of sight out of mind is not an answer. And if so little, as you claim, is the issue. Why did it take a mountain to hid it under. Or three thousand feet underground in an old salt mine. Which by the way is still subject to flooding by an expanding aquifer. So what if people are clumsy and fall off of roofs or wind towers. More deaths by other means does not excuse the issue at hand. The contamination and pollution of nuclear waste.  And the interest now in adding more to that problem will do what for us being that it takes five yrs to build. Only after the Green people allow a permit.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "wng239",
                        "time": "16 August, 2022",
                        "context": "That was back when the solar and wind industries were new and many procedures were not standardized. These days, solar is less than nuclear and wind slightly more.\n\nThat said, deaths from nuclear are severely under-reported. That is because not all deaths are as straight forward as someone dying on the spot.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "kartl",
                "time": "16 August, 2022",
                "context": "You really don’t have any contributions to what is viable.  \n\nGood, cut your port line to your home and put a wind tower on your yard to power your home and charge your vehicle",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "Polyesterpants",
        "time": "15 August, 2022",
        "context": "Thorium reactors are the safest way and less toxic. ",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "quietsmith",
        "time": "16 August, 2022",
        "context": "Nuclear is the best way to get us off fossil fuels, and it actually works.\n\nThe left will never ever ever let you build it.",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "wng239",
                "time": "16 August, 2022",
                "context": "And how is expensive energy that requires a ton of water during droughts actually work?",
                "good": "0",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "quietsmith",
                        "time": "16 August, 2022",
                        "context": "One of the reasons we're having adverse weather conditions is due to climate change. \n\nWe need to get off fossil fuels as best we can, green energy is decades away from being a viable replacement, we need something in the meantime. \n\nYou got a better idea?",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "wng239",
                                "time": "16 August, 2022",
                                "context": "Why is green energy decades from being viable replacement? It was decades from being viable decades ago, people are just not caught up with how much things have changed. That a lot has to do with the fossil fuel industry which uses decades old info pretending it reflects reality of today.\n\nToday, solar pv and on shore wind are the cheapest way to generate electricity. With hydro and geothermal slightly more expensive. Today, even solar+batteries is cheaper than nuclear.\n\nAnd being commodities, the higher economies of scale, the cheaper they get. On Shore wind has dropped 3.5x in price since 2010. Solar PV has dropped 12X in price since 2010.",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "user_name": "kartl",
                        "time": "16 August, 2022",
                        "context": "Read the article again and note that it is the newer nuclear technology that we need to push to not the G3 reactors that have been in place since the 50’s.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "wng239",
                                "time": "16 August, 2022",
                                "context": "I am well aware of G4, but G4 reactors are still in experimental stage. By the time the tech is tested outside a lab, all issues worked out and etc. It'll already be a few decades at the least.",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "princessroxana",
        "time": "16 August, 2022",
        "context": "The goal is LESS and more expensive energy and lower standards of living for the peons. That's why libbies are fixated on inefficient,  insufficient wind and solar.",
        "good": "2",
        "bad": "0",
        "replies": [
            {
                "user_name": "wng239",
                "time": "16 August, 2022",
                "context": "Wind and solar are the cheapest now so you know...",
                "good": "0",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "kartl",
                        "time": "17 August, 2022",
                        "context": "But not the most reliable and sustainable 24 x7",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "wng239",
                                "time": "17 August, 2022",
                                "context": "Nothing is sustainable 24/7, as nothing has 100% capacity factor. This is why the grid exists as a whole",
                                "good": "0",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "patriot4life",
                                        "time": "27 August, 2022",
                                        "context": "Wow wng you really drank all the kool-aid.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": [
                                            {
                                                "user_name": "wng239",
                                                "time": "27 August, 2022",
                                                "context": "Nope, just unlike most people I actually know how the electric grid works. \nBut I guess when most people get their education from the mass media and politicians, most of which only have experience with the grid is plugging things into an outlet, and even that they get wrong half the time",
                                                "good": "0",
                                                "bad": "0",
                                                "replies": []
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "user_name": "reconsurgeon",
                        "time": "17 August, 2022",
                        "context": "...and most unreliable",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "wng239",
                                "time": "17 August, 2022",
                                "context": "More reliable than pretty much any fossil fuel generation. Intermittent does not mean unreliable. Intermittent is still predictable and can be modeled for. Unreliable is unexpected failure. And in that sense, solar and wind are over 10x more reliable.",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "atrustedmediabrandha!",
        "time": "30 August, 2022",
        "context": "In the role of commander in chief, I cannot believe those that held the post would not have required our military bases and strategic  defense contractor factories to run on nuclear.  There is little supply chain needed so they could operate for years without interruption and they can be made safe from attack.",
        "good": "0",
        "bad": "0",
        "replies": []
    }
]