[
    {
        "user_name": "sum_guy",
        "time": "6 November, 2021",
        "context": "It's not paranoia if they really are out to get you",
        "good": "10",
        "bad": "0",
        "replies": [
            {
                "user_name": "babyboomer669",
                "time": "6 November, 2021",
                "context": "I always tell members of my family there is nothing wrong with being a little paranoid.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "downtwoearth",
        "time": "6 November, 2021",
        "context": "Well I do have people out to get me.  If they could get access to my phone they would.  They like to reach out to my neighbors and employers.  So what do you do at that point?  They have money and I don’t?",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "4dragonscassino",
                "time": "6 November, 2021",
                "context": "Um...what are you talking about?",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "Glasgow-ky",
                        "time": "11 November, 2021",
                        "context": "Debt collectors haha",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "rknrl",
        "time": "6 November, 2021",
        "context": "If china has eyes on all their people then they have eyes on all of us. duh",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "b_banzai",
                "time": "6 November, 2021",
                "context": "Ewwwww! Eyeball juice.",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "naysayer1234",
        "time": "6 November, 2021",
        "context": "I was recently talking with my dad on the phone. While we were talking I mentioned that I would be applying Round-up on areas of my sidewalks that had weeds growing out of control. He advised that was a bad idea with my kids and pets around and that I should use something else. He then went on to explain that he read about Round-up causing cancer. An hour later Facebook had numerous ads on my feed that talked about class action lawsuits for people that had been exposed to large amounts of Round-up and ended up with cancer. NO WAY WAS THIS COINCIDENTAL!",
        "good": "13",
        "bad": "0",
        "replies": [
            {
                "user_name": "coralreefer",
                "time": "6 November, 2021",
                "context": "Big  tech is willing  to get in the weeds  to spy...",
                "good": "2",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "angelssix",
                        "time": "6 November, 2021",
                        "context": "I use Oversite on my Mac.  It advises me when the microphone or camera is turned on on my computer.",
                        "good": "2",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "coralreefer",
                                "time": "6 November, 2021",
                                "context": "good  to know!...",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "dogbreath761",
                "time": "6 November, 2021",
                "context": "If you ever get an email about pork, ham, salt and preservatives don’t open it.  It’s spam.",
                "good": "11",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "naysayer1234",
                        "time": "6 November, 2021",
                        "context": "LOL!!! Thank you for that!",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "editherudite882",
                "time": "6 November, 2021",
                "context": "It would be interesting to know what his alternate is for Roundup.  You do realize that Roundup is like the covid vaccination.  Same anti-science hysteria.   The one problem that most people have is that they do not realize that everything is chemicals.",
                "good": "3",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "rancher1967",
                        "time": "6 November, 2021",
                        "context": "Exactly, if Round Up was actually as dangerous as some would like you to think it was (competitors, tree huggers and ambulance chaser lawyers) the average person wouldn’t be able to just put it in their grocery cart with the rest of their food to take it home and use. It would be highly restricted and regulated for license sale and use only, or banned entirely like Agent Orange.",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "naysayer1234",
                        "time": "6 November, 2021",
                        "context": "You completely miss the point of the story. But as long as you get to share your unwanted opinion on the Round-up matter, you get to feel good about yourself. Lol! Great job!",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "rancher1967",
                "time": "6 November, 2021",
                "context": "If you look at the actual toxicity of Round Up vs something most people use every day like Caffeine you’d find you’d have to consume a thousand times less Caffeine than Round Up to kill yourself from either.\n\nUse the Round Up, follow the directions on the label including that part that tells you don’t drink it and you’ll be just fine. Depending on the types of vegetation you’re after nothing works better. The average person isn’t out applying hundreds of gallons to thousands of acres where they’re spending the day soaked in it and breathing it non stop. If those same people were applying Caffeine at the same rate they’d be dead before the day was over, yet most people have no fear of Caffeine at all.",
                "good": "1",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "chiefsbrat",
                "time": "11 November, 2021",
                "context": "The Roundup lawsuit commercials have increased the hype with no science. Even the huge jury award a few years back, to agriculture workers that sprayed massive amounts of Roundup and other chemicals without proper protections, could never prove Roundup was the culprit in the cancer cases.\nSmall, household use, following directions, not spraying in windy conditions, and allowing it to dry has nearly zero risk.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "duhhthink",
        "time": "6 November, 2021",
        "context": "We’re all being stalked and we all should be paranoid!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "generaleisenhower",
        "time": "6 November, 2021",
        "context": "Don’t use Google. Google can’t be trusted.",
        "good": "11",
        "bad": "0",
        "replies": [
            {
                "user_name": "b_banzai",
                "time": "6 November, 2021",
                "context": "The are evil.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "Crotchety_Old_Dude",
        "time": "6 November, 2021",
        "context": "Listening for the 'wake' word means every single word intercepted by the highly sensitive microphone is being processed by cloud servers of the parent company.  These words are not stored on your device.  Processing entails recording, cataloguing, classifying, archiving then responding as necessary.  These companies are not simply dumping your non-wake words and phrases into some data dustbin.  They're using every last word to define you as a commodity.",
        "good": "4",
        "bad": "0",
        "replies": [
            {
                "user_name": "JustACommonGuy",
                "time": "6 November, 2021",
                "context": "Not true. These devices are listening locally for a limited number of wake words. ONLY after the wake word is detected do they begin streaming audio to their clouds for further processing. Without the wake word, nothing is going to a cloud.",
                "good": "0",
                "bad": "3",
                "replies": [
                    {
                        "user_name": "Crotchety_Old_Dude",
                        "time": "8 November, 2021",
                        "context": "Your reply could fertilize a field to a lush greenness.  The devices do not have the processing capacity to know the inflection or verbal nuance from every possible user for every possible wake word.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "error": "error"
    },
    {
        "user_name": "tompost",
        "time": "6 November, 2021",
        "context": "My wife asked me why I was talking so quietly?\n\nI said I was afraid Mark Zuckerberg was listening. She laughed. I laughed. Alexa laughed. Siri Laughed.",
        "good": "21",
        "bad": "0",
        "replies": [
            {
                "user_name": "rknrl",
                "time": "6 November, 2021",
                "context": "hahah",
                "good": "2",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "editherudite882",
                "time": "6 November, 2021",
                "context": "Back years ago, we used to communicate with our Russian relatives in the Russian language.  Just the regular family reports.  But, one time I set down and connected and I overheard a live conversation between a US federal agent and a translator, and they were discussing the exact phrasing of something that I had written in Russian. They were discussing it in English.  Evidently, it wasn't the exactly worded phrase, but was close to some sort of a code phrase that would mean something. So, they used to do it manually before they got the robots.   Be careful about talking about your childhood memories.  A bunny rabbit could be a nuclear missile to Siri.",
                "good": "1",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "babyboomer669",
                "time": "6 November, 2021",
                "context": "That’s a good one.  I’m going to use it.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "strandedinthecenter",
        "time": "6 November, 2021",
        "context": "Just because you're paranoid doesn't mean they're all not out to get you.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "nightowl13",
        "time": "6 November, 2021",
        "context": "If I make you a nice hot cup of coffee in the morning you should say \"Thank you\", instead of this ungrateful \"How did you get in my house?\" business! \n😉",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "edpaq201",
        "time": "6 November, 2021",
        "context": "Remember years back when there was talk about micro chipping people and the outrage it caused? Well they figured out how to get around that and tricked us into chipping ourselves willingly.",
        "good": "10",
        "bad": "1",
        "replies": [
            {
                "user_name": ".vaccinatedandmasked",
                "time": "6 November, 2021",
                "context": "If you're not a criminal, what do you have to hide?",
                "good": "1",
                "bad": "7",
                "replies": [
                    {
                        "error": "error"
                    },
                    {
                        "user_name": "edpaq201",
                        "time": "6 November, 2021",
                        "context": "Are you serious? Then why not just let strangers just come into your house any time they want and look through your personal belongings. Why not just let law enforcement come in anytime they want. If your not a criminal then you have nothing to worry about. Right?",
                        "good": "3",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": ".vaccinatedandmasked",
                                "time": "6 November, 2021",
                                "context": "LE is welcome anytime. You, not so much.",
                                "good": "1",
                                "bad": "1",
                                "replies": [
                                    {
                                        "user_name": "edpaq201",
                                        "time": "6 November, 2021",
                                        "context": "But why would I not be welcome to look through your things? If your not a criminal you have nothing to worry about. Right?I'm just someone who wants to look at all your things.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "user_name": "502ndEngrCoAFB",
                        "time": "6 November, 2021",
                        "context": "Not too bright, are you?",
                        "good": "1",
                        "bad": "1",
                        "replies": [
                            {
                                "user_name": ".vaccinatedandmasked",
                                "time": "6 November, 2021",
                                "context": "Muted now, aren't you.",
                                "good": "0",
                                "bad": "2",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "error": "error"
                    },
                    {
                        "user_name": "artjuevos",
                        "time": "6 November, 2021",
                        "context": "If one is not a criminal, why do they have to look?",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "4dragonscassino",
                                "time": "6 November, 2021",
                                "context": "How do they know what you are without looking?",
                                "good": "0",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "artjuevos",
                                        "time": "6 November, 2021",
                                        "context": "They don't know. So they look anyway.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "user_name": "elofugarit",
                        "time": "6 November, 2021",
                        "context": "Most Democrats are under a judge's order to stay at least 1000ft from schools and playgrounds.",
                        "good": "1",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": ".vaccinatedandmasked",
                                "time": "6 November, 2021",
                                "context": "Has that had an impact on your romantic pursuits?",
                                "good": "1",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "user_name": "4dragonscassino",
                        "time": "6 November, 2021",
                        "context": "So it's cool for the cops to come search your house and family?",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "freenbean_i_fonebone",
        "time": "6 November, 2021",
        "context": "I was talking to a friend about how technology is becoming more and more intrusive in our lives, and he said, \"I read online that you're acting paranoid.\"\n\n🙄",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cmwyo",
        "time": "6 November, 2021",
        "context": "Just remember......, it's not paranoia if they're really coming after you!!",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "artjuevos",
                "time": "6 November, 2021",
                "context": "Maybe it's insomnia keeping them up at night.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "11B3A",
        "time": "6 November, 2021",
        "context": "Once you give up paranoia, that's when they get you.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "azbitesback",
        "time": "6 November, 2021",
        "context": "\"How to know if you're being stalked or are just paranoid\" i have good reason to be PARANOID because Congress and THE FEDS passed, made LAWS/RULES like  the UN-PATRIOT \"PATRIOT ACT\" that have been used ON US and AN EX PRESIDENT and HIS ADVISERS!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "elofugarit",
        "time": "6 November, 2021",
        "context": "Rockwell song stuck in my head now!!",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "UnapologeticPatriot843",
        "time": "6 November, 2021",
        "context": "I wouldn’t be so paranoid if everyone wasn’t out to get me!",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "GoldPopsicle",
        "time": "6 November, 2021",
        "context": "Everyone is screaming questions into their cellphone for Siri and they are concerned about privacy?   I can't make this up.",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mjagain999",
        "time": "6 November, 2021",
        "context": "Everyone is phishing for your information, each with their own special hook. Be careful out there!",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "yourargumentisinvalid",
        "time": "6 November, 2021",
        "context": "Relax, you are not being stalked.  By the way, your new furniture looks great from outside.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "HaroldPither",
        "time": "6 November, 2021",
        "context": "Speaking of Kim Kommando, I used to listen to her sometimes but it's hard for me to do so because she's on Saturday afternoons in my neck of the woods, not the best time to catch the whole show.  Sometimes when I'm driving I'll get a bit of it.  She's very helpful to the callers.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "silkyjohnson743",
        "time": "6 November, 2021",
        "context": "I had a opossum in my back porch last night",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "DJ76",
                "time": "6 November, 2021",
                "context": "How did it taste?",
                "good": "1",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "silkyjohnson743",
                        "time": "6 November, 2021",
                        "context": "I called uncle Jed for Granny's recipe",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "HaroldPither",
                "time": "6 November, 2021",
                "context": "I recently had one try and drag a 14 pould sack of cat food out the door.  They are strong for their size.  If it hadn't caught on the slider track she might have made away with it.",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "startagainfree",
        "time": "6 November, 2021",
        "context": "The only people I respect are people still standing after I club them across the back of their heads. Fear ... it's relative.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": ".vaccinatedandmasked",
        "time": "6 November, 2021",
        "context": "All the stalkers I've met are here on Fox.\n\nThank God for Mute.",
        "good": "1",
        "bad": "4",
        "replies": [
            {
                "error": "error"
            },
            {
                "user_name": "brad523",
                "time": "6 November, 2021",
                "context": "Make sure you're wearing at least 3 masks while you drive solo. Or if your outside cycling or hiking, jogging that you wear 4 masks and a face shield.",
                "good": "2",
                "bad": "0",
                "replies": [
                    {
                        "user_name": ".vaccinatedandmasked",
                        "time": "6 November, 2021",
                        "context": "One N95 works even better. I purchase them by the crate, but then, I can afford them.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "docbill",
                "time": "6 November, 2021",
                "context": "None wanted to meet you.  Mask your hands.  You might spread covid through the keyboard.",
                "good": "1",
                "bad": "0",
                "replies": [
                    {
                        "user_name": ".vaccinatedandmasked",
                        "time": "6 November, 2021",
                        "context": "I read COVID being spread here on Fox every day by stupid ANTIVA paleocons.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "ohmitysmiter",
        "time": "6 November, 2021",
        "context": "When everyone is out to get you, paranoia is just good sense..",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "lucifernewsom",
        "time": "6 November, 2021",
        "context": "The only ones stalking us is our own government",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "greenie",
        "time": "6 November, 2021",
        "context": "Last year I was looking at window replacement for a friend. Within the next few days I started receiving junk mail advertising windows in my mailbox. This is definitely not a coincidence.\nWe are being watched and I’m sure that the government is also watching.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mjandecka",
        "time": "6 November, 2021",
        "context": "Stalkers? If she's beautiful and kind... I'll open the door and welcome her in.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "b_banzai",
                "time": "6 November, 2021",
                "context": "Then... the dream turns baaad. The questions start. \nWhere were you last night? Why didn't you text me back immediately? I need to know when you leave work.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "mjandecka",
                        "time": "6 November, 2021",
                        "context": "No. The dreams don't turn bad. All those questions asked... I'd respond and say, \"My dear, I was looking for you. Now come to bed.\"",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "b_banzai",
                                "time": "6 November, 2021",
                                "context": "Well ok. Just for the night. Leave the money on the nightstand.",
                                "good": "1",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "mjandecka",
                                        "time": "6 November, 2021",
                                        "context": "No. Beautiful and kind doesn't make those type of transactions. Nor do I.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": [
                                            {
                                                "user_name": "b_banzai",
                                                "time": "6 November, 2021",
                                                "context": "Well, everyone is entitled to be stupid. You go guy!!",
                                                "good": "0",
                                                "bad": "0",
                                                "replies": [
                                                    {
                                                        "user_name": "mjandecka",
                                                        "time": "6 November, 2021",
                                                        "context": "Everyone is entitled to be stupid however not everyone is entitled to be a gentleman. Glad I'm the latter.",
                                                        "good": "0",
                                                        "bad": "0",
                                                        "replies": []
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "user_name": "jimshorts",
                        "time": "6 November, 2021",
                        "context": "How many beers have you had? NO, thats 4 im counting. Crazy stuff like that.",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "DJ76",
        "time": "6 November, 2021",
        "context": "It isn't paranoia if they really ARE out to get you!  ;)",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Republicationonly",
        "time": "6 November, 2021",
        "context": "Go with the paranoid. Its much easier to deal with.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "gasman",
        "time": "6 November, 2021",
        "context": "As the saying goes, you are not paranoid, every one really is against you.....",
        "good": "3",
        "bad": "0",
        "replies": [
            {
                "user_name": ".vaccinatedandmasked",
                "time": "6 November, 2021",
                "context": "Most every Fox regular feels that way.",
                "good": "1",
                "bad": "2",
                "replies": []
            }
        ]
    },
    {
        "user_name": "sysvridesagain",
        "time": "6 November, 2021",
        "context": "As far as the \"I didn't install that\" part, you need to be careful when you install even legit things like the Adobe reader.  If you don't uncheck them, it will install McAfee Security Scan Plus, McAfee Safe Content and the Chrome browser extension for Acrobat.  While none of these are malicious, it's still very deceitful for a big company like Adobe.",
        "good": "8",
        "bad": "0",
        "replies": [
            {
                "user_name": "almostlibertarian",
                "time": "6 November, 2021",
                "context": "Agreed, and Microsoft is especially annoying if you have their web browser, Edge.",
                "good": "6",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "understandb4beingunderstood",
                "time": "6 November, 2021",
                "context": "Adobe is the worst.  Also very expensive.  There are free ways to do everything they have to offer.",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "apcw",
        "time": "6 November, 2021",
        "context": "Hey here is a trick, I dont own a Iphone, dont do banking on it, not on facebook, not on instagram, not on social media, my phones only use, telephone calls and for emergencies, yep still get text messages, dont open them, they go into the trash, just wish taking my trash out of the house was that easy.. \nLife is so good when you are not tied to a phone. It rings, and oh, GPS, turned off , so is the WIFI..",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "lcharlie",
        "time": "6 November, 2021",
        "context": "\"Is it me or is someone, something tracking everything I do in my device?\"\n\nThe answer is \"no, it's not you, big tech & the rest of the Democrat Party are in fact tracking EVERYTHING you do on your device\".",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": ".vaccinatedandmasked",
                "time": "6 November, 2021",
                "context": "Not to mention the NSA. I often get a kick out of every violence-preaching paleocon identifying himself as a domestic terrorist, complete with his weapon of choice, intended target and electronic location.\n\nPaleocons are idiots by nature.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "lcharlie",
                        "time": "6 November, 2021",
                        "context": "Don't know what a \"Paleocon\" is but when I said \"the rest of the Democrat Party\", that was meant to include the NSA.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": ".vaccinatedandmasked",
                                "time": "6 November, 2021",
                                "context": "You could google it. Even Websters would help.",
                                "good": "0",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "lcharlie",
                                        "time": "6 November, 2021",
                                        "context": "No thanks, I'm good.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": [
                                            {
                                                "user_name": ".vaccinatedandmasked",
                                                "time": "6 November, 2021",
                                                "context": "Suit yourself.",
                                                "good": "0",
                                                "bad": "0",
                                                "replies": []
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "TravelHog",
        "time": "16 November, 2021",
        "context": "Of course the tech companies, along with our government, spy on us 24/7. They have all along. And you're complicit in allowing it as well. Facts are facts.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "whatswwrongwithyou",
        "time": "6 November, 2021",
        "context": "I'm not paranoid they really are out to get me.  I got the scaranoid pissophrenia.  They've been following me since I left Berlin in '86.  The STASI don't you know.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "blackbear2",
        "time": "6 November, 2021",
        "context": "It is (sometimes) fun being stalked.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "alvawolf",
        "time": "8 November, 2021",
        "context": "They are comming to get you!! Just joking.   Or am I",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "loudobbs'-ghost",
        "time": "6 November, 2021",
        "context": "Antipsychotics for everyone!!!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mentor397",
        "time": "8 November, 2021",
        "context": "This is just a Komando advertisement.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ugh___you_smell_that_schiff_?",
        "time": "11 November, 2021",
        "context": "there are some apps that are sold as practical jokes, and 'hide' just like malware: you buy 'em whilst 'borrowing' a friend's handheld. eg Buttrider: does emergency Grindr alerts whenever you're in a stall in a public building or interstate. Hey Boy!  a lot like Buttrider: it casts slurs to any device nearby that its AI deems owned by a black ( if it knows you're driving, the viciousness of the slurs ramp up significantly).",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mactruth",
        "time": "6 November, 2021",
        "context": "Rest assured that big tech is monitoring to ensure you are not being stalked by anyone but them.  Well, them and the federal government that is unless you live in a democrat controlled state then you can include them.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "prolaw441",
        "time": "6 November, 2021",
        "context": "Tech listens in all the time. They are disgusting. ",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": ".vaccinatedandmasked",
                "time": "6 November, 2021",
                "context": "Why do you keep purchasing and using \"tech\"?",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    }
]