[
    {
        "user_name": "EEngr=mc^2",
        "time": "20 June, 2021",
        "context": "I watched the launch & explosion - the vapor clouds hung in the sky for an hour.",
        "good": "84",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "Hunter'sLaptop251",
        "time": "20 June, 2021",
        "context": "I thought this was settled in the 80’s. It sounds to me like someone dug all this up just to rehash it and write a book and shear the sheep",
        "good": "14",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Usacitizen199",
        "time": "20 June, 2021",
        "context": "NASA is now project equity?  This has gone too far!  Their new concentration is on racial equity!  Fire all whites now!  Paint Black Lives Matter on all rockets. Only gays and lez or blacks need apply!",
        "good": "30",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "onsecondthought",
        "time": "20 June, 2021",
        "context": "No news here. The accident investigation more than 30 years ago included that at least some of the crew survived the initial explosion.",
        "good": "202",
        "bad": "11",
        "replies": []
    },
    {
        "user_name": "The_81Million",
        "time": "20 June, 2021",
        "context": "I’ve seen pictures of the charred remains. Looks like they’ve been in an explosion 🤷🏽‍♂️",
        "good": "0",
        "bad": "33",
        "replies": []
    },
    {
        "user_name": "5oclocksomewhere753",
        "time": "20 June, 2021",
        "context": "I saw the explosion and cried in front of the TV when President Reagan spoke that evening.",
        "good": "71",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "🗽AMERICAN🎸ROCK🕷PATRIOT",
        "time": "20 June, 2021",
        "context": "This is Biden's America. As his liberal policies begin to become law, more and more heros will die in explosions.",
        "good": "20",
        "bad": "18",
        "replies": []
    },
    {
        "user_name": "Crotalushorridus",
        "time": "20 June, 2021",
        "context": "….even back in 1986, NASA was way ahead with “mission equity”",
        "good": "5",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "jacobite",
        "time": "20 June, 2021",
        "context": "Not sure if I believe that.",
        "good": "12",
        "bad": "5",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "quill",
        "time": "20 June, 2021",
        "context": "CLICK BAIT...the rest of the story is well known , about the o-rings and the cold outside temp at launch and the burn through of the fuel tanks, the quote below is pure speculation.\n \n\"But the capsule the crew was sitting inside did not explode. It was ejected in the explosion, and remained intact. The brave crew members — Smith, Dick Scobee, Ronald McNair, Ellison Onizuka, Judith Resnik, Gregory Jarvis and Christa McAuliffe — survived the initial disaster and \"were conscious, at least at first, and fully aware that something was wrong,\"",
        "good": "16",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "DonTheOrangeMoron",
        "time": "20 June, 2021",
        "context": "First Reagan committed treason by selling arms to Iran, and then he pressured NASA into a launch that they weren’t ready for.\n\nRepubliQan presidents are always corrupt liars.",
        "good": "2",
        "bad": "45",
        "replies": []
    },
    {
        "user_name": "john_baron",
        "time": "20 June, 2021",
        "context": "Congressional Republicans claim it was just a normal tourist voyage and no one was injured.",
        "good": "4",
        "bad": "15",
        "replies": []
    },
    {
        "user_name": "nn5",
        "time": "20 June, 2021",
        "context": "An explosion at 1540 mph and they survived, THEN fell to earth.  Umm.....no.  Just no!!  Survived an explosion at twice the speed of sound.  Yeah.....no.",
        "good": "1",
        "bad": "10",
        "replies": []
    },
    {
        "user_name": "rickjames19",
        "time": "20 June, 2021",
        "context": "So the author, Kevin Cook, tries to get the accolades of the left by bashing President Reagan, who was responsible for getting a teacher in the program. The author claims that “The announcement sounded pure, but the program was really a gambit to bolster the president’s reelection chances.” Sorry, but I lived though all of this, and nobody was suggesting that or believed that. Nice try, though.",
        "good": "385",
        "bad": "15",
        "replies": []
    },
    {
        "user_name": "NavyNP7",
        "time": "20 June, 2021",
        "context": "Well, what I got from this article is that Dan Rather’s snarky commentary caused unnecessary political pressure to forge ahead with the launch. Once again, the leftist media ruins everything and gets people killed.",
        "good": "74",
        "bad": "8",
        "replies": []
    },
    {
        "user_name": "sickoflies",
        "time": "20 June, 2021",
        "context": "I remember watching the launch in science class. I remember the somber feelings from everyone when we realized it had exploded. I can't believe it has been over 35 years. \n\nI'm glad to see we still have brave men & women willing to take the risk for exploring the unknown. It will be great when we get back to the moon and even greater when we get to Mars. Can't wait to see what happens.",
        "good": "347",
        "bad": "20",
        "replies": []
    },
    {
        "user_name": "pinboy446",
        "time": "20 June, 2021",
        "context": "The most arrogant program in history glad its over and everybody got laidoff.",
        "good": "3",
        "bad": "29",
        "replies": []
    },
    {
        "user_name": "rommazntz",
        "time": "20 June, 2021",
        "context": "they were all registered Biden voters in the last election.......Absentee ballots. ",
        "good": "19",
        "bad": "7",
        "replies": []
    },
    {
        "user_name": "bidenslyin",
        "time": "20 June, 2021",
        "context": "4 White Men 2 Women and 1 Black Man. This is what you call a Diversity Diaster. ",
        "good": "5",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "easydoesit196",
        "time": "20 June, 2021",
        "context": "NASA and others already had reports on this. Hardly new.",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "reticuli",
        "time": "20 June, 2021",
        "context": "The part about them being alive has been known from almost the beginning.  It's not just some possible theory postulated in a new book for the first time.  I had never heard that there was evidence the pilot flipped switches, attempting to regain control, though.  It's worth pointing out the original test shuttle flights had an ejection system, pressure suits for the flight, and Story Musgrave was instrumental in getting an escape system (though not an ejection one) and pressure suits back onto the shuttles after Challenger.  The Russian shuttle also had ejection seats, and while the US considered them not likely to work well in those circumstances, the fact is there were ejections from SR-71s and it was quite remarkable how well ejection can work, especially when you're protected in a pressure suit. Heck, there was a case where the entire Blackbird disintegrated around the pilot in-flight without even an ejection taking place and he survived due to his pressure suit and automated parachute!",
        "good": "615",
        "bad": "31",
        "replies": []
    },
    {
        "user_name": "thePandemicbrotherhood",
        "time": "20 June, 2021",
        "context": "The seven died of Covid. And 2 of them were trans, while the rest were inter-racial gays. White supremacists blew up the shuttle with AR15 ghost guns.",
        "good": "9",
        "bad": "14",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "pso9834",
        "time": "20 June, 2021",
        "context": "Politics got involved, which led to the disaster. Today, NASA re-introduced politics, wanting to be politically correct, or Woke.\nLesson NOT learned.",
        "good": "102",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "lymana",
        "time": "20 June, 2021",
        "context": "I worked at NASA at the time.  I went back to my business when I saw the temperature.  The Viton o-rings weren't up to temperature so it should not have launched.  It was launched anyway because Reagan's staff needed a propaganda piece so the risk was taken.  At the very least, the launch director should have been sent to prison for willfully ignoring the manufacturer's temperature specifications which is the same as murder.  There was a lot of rage against the launch director and friends.  It still makes me sick and so does Reagan's speech (that someone wrote for him); \"They broke the surly bonds of Earth and touched the face of God\".  What a puke.",
        "good": "6",
        "bad": "30",
        "replies": []
    },
    {
        "user_name": "🗽AMERICAN🎸ROCK🕷PATRIOT",
        "time": "20 June, 2021",
        "context": "Reagan killed those patriots!",
        "good": "1",
        "bad": "28",
        "replies": []
    },
    {
        "user_name": "TGH0369",
        "time": "20 June, 2021",
        "context": "Maybe I’m just out of touch, but it seems to me that Christa McCaulif always gets top billing in this story. She was just a teacher, the others were more deserving of the headlines. ",
        "good": "13",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "vagrowr",
        "time": "20 June, 2021",
        "context": "The dangers that NASA officials knew full well existed should have resulted in some type of manslaughter/murder charges.  They were warned repeatedly that the exact thing that happened was a high possibility. ",
        "good": "21",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "chkh",
        "time": "20 June, 2021",
        "context": "What did Mrs. McAuliffe say to her husband as she left that day?\n\nAnswer:  You feed the dog.  I'll feed the fish.\n\nI shouldn't have said that!  Lord, I apologize.",
        "good": "6",
        "bad": "14",
        "replies": []
    },
    {
        "user_name": "more1776",
        "time": "20 June, 2021",
        "context": "My dad grew up with Michael Smith, said he was super smart. He took a calculator in high school - rewrote the functions he needed it to do and sent it back to the manufacturer. Who knows if they ever did anything with it.",
        "good": "31",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ranger1107",
        "time": "20 June, 2021",
        "context": "I watched the whole thing on TV…I was stunned when that happened.  I was a little kid then, didn’t really understand why it happened at first, but it felt like I just got punched in the gut.  ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "goonies",
        "time": "20 June, 2021",
        "context": "I remember watching it live at school right after reading rainbow. The teacher jumped up and cut the tv off once she realized what happened. This story is so sad .RIP",
        "good": "96",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "owlghore",
        "time": "20 June, 2021",
        "context": "This has been the theory for many years. Nothing new. \n\nAlso al gore invented space shuttles.",
        "good": "14",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "HBCA",
        "time": "20 June, 2021",
        "context": "Biden's clean diapers most likely survive an explosion for a few seconds also.",
        "good": "10",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "bse2112",
        "time": "20 June, 2021",
        "context": "Horse apples! They were instant dust. If you seen it live like I did, common sense alone dictates it. People will do anything to sell a book. Disgusting!",
        "good": "4",
        "bad": "9",
        "replies": []
    },
    {
        "user_name": "tellthetruthalready",
        "time": "20 June, 2021",
        "context": "Not buying it.",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "TGH0369",
        "time": "20 June, 2021",
        "context": "Maybe I’m just out of touch, but it seems to me that Christa McCaulif always gets top billing in this story. She was just a teacher, the others were more deserving of the headlines. ",
        "good": "26",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "crcnwadavid",
        "time": "20 June, 2021",
        "context": "Need\nAnother\nSeven \nAstronauts",
        "good": "5",
        "bad": "7",
        "replies": []
    },
    {
        "user_name": "RUserious?377",
        "time": "20 June, 2021",
        "context": "No news Fox news. Ugh",
        "good": "1",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "whatabout522",
        "time": "20 June, 2021",
        "context": "at that time I lived in Melbourne about 30 miles or less south of the Cape \nI recall watching many launches from my home on the beach \nmy favorite were night blastoffs. \n\non that faithful day it had been unusually cold the entire week \n\nwhen I saw the explosion \nit was clear they couldn't survive ",
        "good": "34",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "katch1000",
        "time": "20 June, 2021",
        "context": "Those Billionaires that plan to fly soon . Common sense would tell you just keep your feet on the ground",
        "good": "14",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "cj134",
        "time": "20 June, 2021",
        "context": "The seals \"shrunk\" from the cold but it was later discovered they had seals leak prior to that day in warmer weather.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "justpappystu600",
        "time": "20 June, 2021",
        "context": "Rest in peace Challenger Crew, you have remained in the hearts and minds of your loved ones, fellow workers and America...",
        "good": "178",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "randy4usa",
        "time": "20 June, 2021",
        "context": "\"As was later learned, the cold of the Florida morning had stiffened the rubber O-rings that held the booster sections together, containing the explosive fuel inside.\"\n\nTotally wrong.  The people who made the decision to launch were told by the engineers at Morton Thiokol, specifically the engineers in charge of the booster rockets, that failure of the O-rings at the temperature of that morning was 100% certain, and they must not launch.  They pleaded with them to not launch.  The Challenger astronauts were murdered by NASA management.",
        "good": "53",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "jalanopi",
        "time": "20 June, 2021",
        "context": "Factoid - The silo used was the same one that already entombed debris from Apollo 1.",
        "good": "11",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "Jasonups5",
        "time": "20 June, 2021",
        "context": "Was at school on the playground and seen it take off!! RIP Challenger Crew🇺🇸🇺🇸🇺🇸🇺🇸",
        "good": "14",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "pookiejohnson",
        "time": "20 June, 2021",
        "context": "They're all still dead yo... let it go!",
        "good": "3",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "SlickWilly",
        "time": "20 June, 2021",
        "context": "Fun fact.  Bill Nelson the current NASA Administrator bumped Christa McAuliffe  from the Columbia flight.  Had this slum ball politician not bumped her she would still be alive today.  Trading her life for his.  Another reason to hate politicians ",
        "good": "10",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "chernobyl-ly",
        "time": "20 June, 2021",
        "context": "It makes me think about the song \"We didn't start the fire\" by Billy Joel.   Even if Sally Ride wasn't on the challenger -- I always thought she was when I heard the song.",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "onyoursixinca",
        "time": "20 June, 2021",
        "context": "This was a known back then...\n\n  More important to me is how we chose astronauts based off who they know Politically...",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Dr.AneasTaint",
        "time": "20 June, 2021",
        "context": "Little known fact, Christa McAuliffe had blue eyes, one blew left and the other blew right.",
        "good": "1",
        "bad": "24",
        "replies": []
    },
    {
        "user_name": "squarlm1",
        "time": "20 June, 2021",
        "context": "It’s always about christa mcauliffe, as if nobody else died that day. I wonder if she is related to the J.O. governor of Virginia?",
        "good": "13",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "victimseverywhere",
        "time": "20 June, 2021",
        "context": "It wasn’t long after this that American women changed from being conquerors  to being victims. This was played over and over in every school.",
        "good": "6",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "civilwar2020",
        "time": "20 June, 2021",
        "context": "Another example of government not listening to the private sector resulting in a catastrophic outcome. It never ends. Let government argue over welfare for the rich or welfare for the poor in a battle for votes. Leave everything else to the private sector.",
        "good": "38",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "MrBuckFiden",
        "time": "20 June, 2021",
        "context": "i remember telling my parents i was too sick to go to school that day.\ni was in the middle of watching Press Your Luck and chanting, \"NO WHAMMIES!  NO WHAMMIES!\" when the game show was interrupted and the announcement was made.",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "BooneDog",
        "time": "20 June, 2021",
        "context": "Actually the main fuel tank did not “explode” it actually imploded due to rapid depressurization. ",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "rgarrow",
        "time": "20 June, 2021",
        "context": "I don't know, but I must have seen the explosion 90 dozen times, and I believe the crew and the space shuttle were totally vaporized... no one survived that explosion.",
        "good": "2",
        "bad": "7",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "lakeshoredrive",
        "time": "20 June, 2021",
        "context": "If the capsule that the team was riding  survived the explosion, was there not a parachute or something similar that they could have deployed to calm down the descent?  I know nothing of this but it seems like a logical question..",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "capt.joe973",
        "time": "20 June, 2021",
        "context": "Fun fact they all had blue eyes 👀! One blue here one blue there LOL.",
        "good": "0",
        "bad": "11",
        "replies": []
    },
    {
        "user_name": "Proverbs3:5🙂",
        "time": "20 June, 2021",
        "context": "I watched that explosion live when it happened.. it was one of the biggest explosions ever ,highly doubtful anybody could have lived through it. Rest in peace and love Challenger crew..",
        "good": "25",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "Bennington1776",
        "time": "20 June, 2021",
        "context": "NASA….not since Lewis & Clark did the United States have hero’s of this magnitude… from Mercury to Gemini to Apollo and beyond truly divine intervention.  God Bless America… ",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Dogood44",
        "time": "20 June, 2021",
        "context": "I remember very well, I was heartbroken over the whole thing.\nI still have a piece of Challenger \nhistory.\nA souvenir first day cover of the first\nspace mail. With Three postmarks.\nOne the day the stamps were released, one the day the shuttle launched, and one the day the shuttle landed at Edwards AF Base.",
        "good": "13",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "chitown33",
        "time": "20 June, 2021",
        "context": "Duh! We knew this back in 1986. Just trying to sell a Book",
        "good": "8",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "HomeoftheBills",
        "time": "20 June, 2021",
        "context": "I remember in hisory class we watced the whole thing happened teacher had tears in his eyes a big man at 6'7'' over 380 . Bad day we will never forget .",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "surflaunch2858",
        "time": "20 June, 2021",
        "context": "I witnessed disaster first hand from north Merritt Island.\nThe dull roar of the explosion rolled across the land unlike the normal launch sound of the boosters burning.\nI remember I was surprised that the launch smoke was more gray in color than other launches I had seen.\nI later heard the boosters were loaded for a heavier payload, not sure if that was the cause of the color change. \nThe breakup was a stunning image I will never forget.\nThe entire Space Coast community was in mourning for months.",
        "good": "516",
        "bad": "16",
        "replies": []
    },
    {
        "user_name": "Dr.AneasTaint",
        "time": "20 June, 2021",
        "context": "NASA released the final transmission they received from the ship and it was from Christa McAuliffe and she asked, What does this button do?",
        "good": "2",
        "bad": "13",
        "replies": []
    },
    {
        "user_name": "ted_west",
        "time": "20 June, 2021",
        "context": "This article adds to the horror and sorrow over the Challenger disaster and its magnificent crew... so why would Fox lead it with a video still of the Vice Sow?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "f.foo",
        "time": "20 June, 2021",
        "context": "Tragedy beyond description:(",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "you'll_be_ok",
        "time": "20 June, 2021",
        "context": "They probably didnt even realize it",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "ShadyJ",
        "time": "20 June, 2021",
        "context": "Another misleading fox headline. \nNobody survived the explosion of the shuttle. \nThey did survive the explosion of the boosters after seperation but they were dead once the shuttle blew.",
        "good": "1",
        "bad": "5",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "PurpleStrawberry",
        "time": "20 June, 2021",
        "context": "The view the challenger crew survived the explosion only to die on impact was brought to light 20 years ago.. but no one wants to remember.",
        "good": "11",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "DarthVapor...24",
        "time": "20 June, 2021",
        "context": "Interesting now I don’t need to buy the book . Enough info for me",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "leftistsworstnightmare",
        "time": "20 June, 2021",
        "context": "You had a pretty good idea that the forward part of the shuttle was intact on the way down. Telescopic cameras captured the larger pieces falling into the ocean and trajectory determined which pieces they were.\n\nIt was entirely possible that most survived the explosion given the strength of the shuttle itself and the pressure suits they were wearing. That would have been a terrifying 2 minutes.",
        "good": "673",
        "bad": "14",
        "replies": []
    },
    {
        "user_name": "dr.banner",
        "time": "20 June, 2021",
        "context": "Geeeez \nSo sick of hearing that the Challenger \"Blew up\" Challenger did not blow up at all. The external fuel tank did not blow up either. The Orbiter was destroyed due to Aerodynamic break up. And yes, at least some of the crew initiated their emergency oxygen packs after the break up and plunge to the sea.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "jgrazzi",
        "time": "20 June, 2021",
        "context": "How many more times are we going to remind the family members about something we’ve heard a million times since the Challenger disaster? How many more books on the subject will be written? I sincerely hope that when your family members die, someone is there every year to remind you of the morbid details.",
        "good": "7",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "aurorapatman",
        "time": "20 June, 2021",
        "context": "\"During a teleconference a few hours before the launch, the makers of the O-rings expressed concern that cold might compromise the shuttle, but one NASA manager infamously fired back, 'When do you want me to launch — next April?'\"\n\nNo...just when it's safe...science...",
        "good": "18",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "thewiserman",
        "time": "20 June, 2021",
        "context": "Still brings tears to my eyes. 😭",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rob1959",
        "time": "20 June, 2021",
        "context": "How about we have some good News, just for one Day!\nWake up America",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "realamerican7613",
        "time": "20 June, 2021",
        "context": "I like to pretend that they survived explosion, g force,the crash but then sharks ate their heads",
        "good": "0",
        "bad": "10",
        "replies": []
    },
    {
        "user_name": "GreenRocket",
        "time": "20 June, 2021",
        "context": "Way to open old wounds and dig a little deeper.  What seems like simple, interesting facts to some who don't remember, these were painful events that took years for others to deal with.  Now, they got dug up and made just a little worse.  Thanks (sarcasm).",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "HateCA",
        "time": "20 June, 2021",
        "context": "Wonder what ever happened to that “NASA manager” who decided to fly after a recommendation of not to?",
        "good": "23",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "CyanWeights",
        "time": "20 June, 2021",
        "context": "I remember watching it in class in 6th grade on the TV wheeled in for the event.",
        "good": "16",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "laura67",
        "time": "20 June, 2021",
        "context": "I remember the day well, I was working\nfor a subcontractor that made some electronics for LMSC for the booster rockets for the shuttle. We were all shocked,\nbut praying at same time the failure was not our devices; as it turned out it was not. A sad day indeed, may they all rest\nin peace.",
        "good": "60",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "averagejoe39",
        "time": "20 June, 2021",
        "context": "You would think that the media would take a step back and reflect on the role they played in this.  NASA acting prudently was not an embarrassment. Losing a shuttle and crew was embarrassing. Seems the media has only gotten worse at driving their spin.",
        "good": "8",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "galieno",
        "time": "20 June, 2021",
        "context": "I wonder if this story has anything to do with Bezos and his upcoming 'vacation?' Nah.... just a coincidence.... right?",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Labs25",
        "time": "20 June, 2021",
        "context": "Look how prejudice they were back then?!? SMH at the moronic left and people buying their lies ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "acynical",
        "time": "20 June, 2021",
        "context": "Where did the Challenger astraunouts take their vacation?\nAll over Florida.",
        "good": "1",
        "bad": "17",
        "replies": []
    },
    {
        "user_name": "chiefreynolds",
        "time": "20 June, 2021",
        "context": "The Weather Channel did a great documentary on it. Yes, they easily could have been alive.",
        "good": "9",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "wolfcreek243",
        "time": "20 June, 2021",
        "context": "Why is being brought up again?  The families have endured enough pain!",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "trollingbothsides",
        "time": "20 June, 2021",
        "context": "NASA: Need Another Seven Astronauts",
        "good": "3",
        "bad": "10",
        "replies": []
    },
    {
        "user_name": "maddog33",
        "time": "20 June, 2021",
        "context": "it was 35 years ago. Your not telling us anything new. unless youve got something new, for god sakes let it go. Their families have gone through enough and continue going through it every single day they look up, let it go",
        "good": "7",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "Coulter",
        "time": "20 June, 2021",
        "context": "At the time, I was a Civilian Test Inspector working on US Submarines.  I searched through Navy Regulations on O-rings.  I then found out the diameter of the booster rockets.   The diameter of the booster rockets was too large to use an O-ring.  It requires a Quad Ring with a recommendation to have a locking lip.  Something any good engineer should have known.",
        "good": "15",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "retiredvet",
        "time": "20 June, 2021",
        "context": "These articles always hit me as I lost a friend on the Columbia.  Risky business.  The Challenger was much more preventable as Management didn't listen to the lower level safety specialists saying \"no go\" because the temperature was too low and the O-Rings on the boosters wouldn't seal properly.  Even if the Columbia later on had its damaged tile discovered, there wasn't a fix in time before the crew would run out of air.  Amazing what a few tubes of filler/sealant would mean later on.",
        "good": "52",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "surflaunch2858",
        "time": "20 June, 2021",
        "context": "The last week of January is always a somber time for NASA. In the space of six days, the agency recalls three fatal space tragedies: the Apollo 1 fire of Jan. 27, 1967, the Challenger shuttle disaster of Jan. 28, 1986 and the Columbia shuttle accident of Feb. 1, 2003. \nThose dates and the surrounding weeks should be set aside as \"no launch\" dates in memory of this lost.",
        "good": "35",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "OregonRepublican-Yeswedoexist",
        "time": "20 June, 2021",
        "context": "I was in the 8th grade and my mom let me stay home from school to watch it. I remember asking her, “what happened, mom?”   She quickly turned off the tv and took me shopping. Whatever I wanted that day, I got. I think my mom realized how precious life was.  Hard to believe it was that long ago.",
        "good": "24",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "asingaofsongs",
        "time": "20 June, 2021",
        "context": "Some of them had water in their lungs. Not that they would have survived the injuries.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "r_scottus151",
        "time": "20 June, 2021",
        "context": "Well, duh. We all knew this back then. The video showed it. This is old news. Tragic, but we knew this some 35 years ago.",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "reddeyedog",
        "time": "20 June, 2021",
        "context": "Old news.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "waterbasin47",
        "time": "20 June, 2021",
        "context": "Obviously, the radio traffic confirmed that.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "franksopinion",
        "time": "20 June, 2021",
        "context": "\"The announcement sounded pure, but the program was really a gambit to bolster the president’s reelection chances.\" At that stage in my life I was a diehard Democrat academic that despised Reagan like almost everyone else in academe.  We mocked him mercilessly.  I voted against him in both 1980 and 1984. But Reagan hardly need the teacher in space gambit to bolster his election chances.  Both elections were historical blowouts with Carter winning only 3 states in 1980, one of which was his home state of Georgia, and Mondale winning ONLY one in 1984, which was his home state of Minnesota. The so called \"intelligentsia\" and the mainstream media (including Rather) hated the Republican Party with a passion but disguised it better than today, where they don't even try to hide it any more.",
        "good": "403",
        "bad": "24",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "irradiatetheleft",
        "time": "20 June, 2021",
        "context": "They did want to forget about it. If NASA has always been run by idiots. They should have been sued to their last penny and thrown in prison.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "1daysoon",
        "time": "20 June, 2021",
        "context": "How come so many incompetent statements  don't blow up in the face of the writer.  Someone is going to write that they rode a capsule out then died in Russia.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "solace7",
        "time": "20 June, 2021",
        "context": "The scenario described above is probably correct.  A hydrogen-oxygen explosion involving initially unmixed species would proceed very slowly in comparison to a TNT or other true explosive blast.  It is unfortunate that the shuttle was not designed so that the crew compartment was capable of ejection and parachute decent.  If it had been, they would likely have survived.  Problem is that bureaucrats were the decision makers and they rarely make good decisions.",
        "good": "374",
        "bad": "10",
        "replies": []
    },
    {
        "user_name": "ConservativeView",
        "time": "20 June, 2021",
        "context": "I agree, it was known and it was suggested that they had audio and possibly video of the post explosion.  It was suggested when it happened that there was a part of the shuttle that was intact \nWhy would someone Ned to write a book now about something we know already.",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "fridayagain",
        "time": "20 June, 2021",
        "context": "This story is all about selling a book but it reminded me of something very interesting. My sister in law called one morning shortly after the disaster and told us she had been watching TV news about this lye into the night. She said there was a report that the crew had survived the impact and the capsule was being brought in. That was the last mention of any survivors or the possibility of such that late night. We searched and recorded the news for months and it was never mentioned again. Of course we didn’t have internet but if only she’d had her VCR recording! She knows what she saw and heard. We will never know the truth but someone does.",
        "good": "3",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "bikepharm",
        "time": "20 June, 2021",
        "context": "Nothing but speculation.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "supertroop",
        "time": "20 June, 2021",
        "context": "Don’t believe it. The magnitude of that explosion killed them by the fire or the concussion. Unsure why this needs to be debated at this point. The next story…How the dinosaurs died!",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "WillieDeWitt",
        "time": "20 June, 2021",
        "context": "Trump's fault, right libbies???",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "u.s.matters",
        "time": "20 June, 2021",
        "context": "I watched this in the classroom in 5th grade. A tragedy. Years later I watched a movie, \"Challenger\" where some engineers told them not to launch below a certain temperature. But do to lack of of certain \"data\" they launched anyway. Anyway a sad story and sad to say I had a first row seat. Many lessons to be learned here.",
        "good": "10",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "PPCGayo",
        "time": "20 June, 2021",
        "context": "We all know it was the teacher.  She asked \"what is this button for\"?   BOOM!",
        "good": "2",
        "bad": "16",
        "replies": []
    },
    {
        "user_name": "deepthinkingbrian",
        "time": "20 June, 2021",
        "context": "They went out in a blaze of glory, and their names will live on forever.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rubiks6",
        "time": "20 June, 2021",
        "context": "There's just too much bad irony in this story. All those dreams, never imagining you were going to space and then being chosen to actually go. All that preparation, saying goodbye to your students and friends and kissing your husband goodbye. Then , when it's really happening, poof. Two minutes to think about the death you're about to experience and then it's over. That's a really bad day.\n\nThe whole thing has similarities to the Titanic, in that the arrogance of Man was really put on display that day. It really makes me sad.\n\nGod is real and He wishes for us to recognize our own weakness and our need for Him. Each one of us needs Him. You may not be going up in a space shuttle but tomorrow on this Earth is not promised to you. Call upon God today and He can secure your life after death. Only God's mercy can save you from the fires of Hell that otherwise await all of us. I don't know if Christa McAuliffe put her faith in Jesus Christ before she died. I sure hope so. You should put your faith in him today.",
        "good": "12",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "Red8Ball",
        "time": "20 June, 2021",
        "context": "This is no big revelation everyone has known this since  the early 90s that they survived the initial explosion and destruction of the orbiter, It's also been suspected since the beginning that the ones in the back survived until the impacted on the ocean and were possibly conscious",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "boromirsbane",
        "time": "20 June, 2021",
        "context": "I lived on Merritt Island just miles from the Space Center. The launch woke me from sleep, as it always did, but the end explosion was very disturbing. Roof was rattling. Jumped up ran to the back porch looked up to see the smoke plumes going in multiple directions. Knew right away this was very bad for the astronauts. Hate that articles today use a school teacher as the focal point. My father worked for NASA and was friends with Dick Scobee. He took the loss very hard. Scobee was a great pilot and piloted the shuttle two years earlier. Commander of the flight was a great honor and wish his heroism was more prevalent in these stories.",
        "good": "75",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "mtnbikertx61",
        "time": "20 June, 2021",
        "context": "Just like the Challenger disaster, Its only a matter of time until we hit our Ocean, the folks in charge have no idea how to drive the country. Its not going to end with a bang but more of a whimper... and I still remember that day when it exploded. Failure to imagine and the decision to go ahead no matter the red flags along the way.  You plan for so many scenarios when doing any type of mission, but you can only plan so much, regarding the O-rings and the weather, someone low on the totem pole at Morton Thiokol probably brought it up, but more than likely was told to stuff it early on. money and contracts at stake so on we went.... I hope they didnt suffer. They were someones Mom or Dad , Husband Wife Friend, thats what we should never forget.....",
        "good": "5",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "luckysteg",
        "time": "20 June, 2021",
        "context": "A much more united country at that time.",
        "good": "28",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Npain4life",
        "time": "20 June, 2021",
        "context": "You know 2 minutes doesn’t sound like a long time but stop whatever you’re doing and sit there for 2 minutes. Now it feels like an eternity. And knowing or not knowing that there is nothing you can do to change what is going to happen. RIP Challenger Crew. ",
        "good": "66",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "edwardlarson410",
        "time": "20 June, 2021",
        "context": "The real scandal in the Challenger disaster is the fact that NASA was launching outside of their design parameters and they knew it. But, they went ahead because they were afraid that the negative press would cost them some budget money. NASA also knew about the O-ring problem, 2 years before the disaster. It's shameful and the NASA managers have blood on their hands as does the media.",
        "good": "84",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "Armyguy74112",
        "time": "20 June, 2021",
        "context": "Now if only the crew section had a parachute to allow for a safe descent in case of an emergency like this they would possibly all still be alive today.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jamesblucas",
        "time": "20 June, 2021",
        "context": "The engineers knew this was a possibility but failed to raise the alert because of a malignant culture at NASA and the governmental pressure to succeed.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "CaptainBD",
        "time": "20 June, 2021",
        "context": "I can't help but notice the two women, a black guy, and an Asian among the crew. Looks like we had equality in the 80's too. ",
        "good": "19",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "deltav",
        "time": "20 June, 2021",
        "context": "First of all, and as others have mentioned below, this is old news.  \n\nSecond of all (and granted this is nitpicky), this is totally false but variations of this are repeated ad nauseum in any MSM media outlet when referring to Challenger: \n\n\"The tank quickly ruptured, igniting the hydrogen fuel and causing a massive, Hindenburg-like explosion. \"\n\nThere was no \"huge explosion\".  The vehicle broke up due to aerodynamic and mechanical stresses due to the SRB burn thru that compromised the lower field joint.  There were several events that occured very rapidly after the field joint finally let go that caused vehicular breakup.  I would encourage anyone to view the official Challenger accident investigation video on youtube where this is covered in great detail.",
        "good": "15",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "porkchop383",
        "time": "20 June, 2021",
        "context": "I finally stopped having the nightmares a couple years ago... glad to see they will be back.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "mrnightingale",
        "time": "20 June, 2021",
        "context": "This isn't new material, but it's a good reminder.",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "whatthef?",
        "time": "20 June, 2021",
        "context": "Why are they acting like this is new information? This was revealed pretty close to the disaster.",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "1daysoon",
        "time": "20 June, 2021",
        "context": "I gotta come clean. I was told by a very close friend that was a janitor at the main pad.  He said it was  nada cover up.  They brought the crew in late at night and paid them to keep their mouths shut because NASA did not want to reveal that it was staged to get simpathy for getting more funds to honor them, but it was funneled to NASA.\nSome may be dead from old age though.",
        "good": "1",
        "bad": "21",
        "replies": []
    },
    {
        "user_name": "VoltaireGalilei",
        "time": "20 June, 2021",
        "context": "Loss of this shuttle is yet another example of science (in this case engineering) being willfully ignored for political management purposes. Timely.",
        "good": "8",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "moonpiespotlight",
        "time": "20 June, 2021",
        "context": "It happened on my birthday.",
        "good": "3",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "amazingdaddy",
        "time": "20 June, 2021",
        "context": "This was well known at the time - the crew cabin survived the explosion and remained intact until it hit the ocean, where it was obliterated. Whomever “discovered” this is probably too young to know this fact - he or she should have done their homework.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "skeff",
        "time": "20 June, 2021",
        "context": "We knew this at the time, but the media kept it kinda quiet out of respect -- something they don't understand anymore. It came out on \"60 Minutes\" or some other exploitative show. The crew compartment did not disintegrate in the explosion -- it was designed to survive, and it did. They likely all died when it impacted the ocean -- but what a horrible few minutes for them before it hit the sea. 😥",
        "good": "15",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "patrickphillips050",
        "time": "20 June, 2021",
        "context": "I was in elementary school when this happened. It was terrible. I watched President Reagans address to the nation about the event. He spoke directly to the students of America. It was comforting. I didn't really pay any attention to politics before then, but I became a Republican on that day.",
        "good": "443",
        "bad": "25",
        "replies": []
    },
    {
        "user_name": "ymu",
        "time": "20 June, 2021",
        "context": "God bless them.  They are all heroes.  Even NASA isn't infallible, unfortunately, only God is. Humbling to know that.",
        "good": "10",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "jastpeel7734",
        "time": "20 June, 2021",
        "context": "I know for sure, indubitably, that they were alive when they hit the water.\n\nThe High Data Rate Recorder (HDRR) was my project at Odetics, Inc. in Anaheim, CA. I was the drafting coordinator for the HDRR.\n\nThe HDRR records many things, as well as astronaut telemetry, and the HDRR survived the plunge. After it was recovered from the bottom of the ocean a team from Odetics went to florida and they were able to recover 90% of the data.\n\nCrandall Gudmundson, president, and co-owner of Odetics, told me personally, based on the recovered data, \"They were alive when they hit the water.\"",
        "good": "38",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "beenherebefore348",
        "time": "20 June, 2021",
        "context": "Fauci was likely in charge of the go, no-go decision.",
        "good": "6",
        "bad": "2",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "bourgeoiz",
        "time": "20 June, 2021",
        "context": "This is another good example of trickle down economics.",
        "good": "1",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "Chris_Cornell_is_GOD.",
        "time": "20 June, 2021",
        "context": "Almost 40 years ago and that was a diverse crew.  Now NASA is saying they will give ‘equity’ to anyone that’s not a white man.   Like a lot of institutions, they’ve decided to fix a problem that didn’t exist.  The military is doing the same thing.  When you decide to fix a problem that doesn’t exist, you first have to create the problem.   It’s all so idiotic.",
        "good": "30",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "cachai56",
        "time": "20 June, 2021",
        "context": "If they had been armed, they could have possibly taken out that flame near the O rings and survived. Those darn laws keeping astronauts from carrying on flights…",
        "good": "0",
        "bad": "12",
        "replies": []
    },
    {
        "user_name": "1pingyes2pingsno",
        "time": "20 June, 2021",
        "context": "A blue ribbon selection panel including Pam Dawber? I'm convinced that once someone gets to appear on TV, the whole world thinks they are instantly either a genius or god (or both).",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Yello!",
        "time": "20 June, 2021",
        "context": "NASA is like Covid….”conspiracy”",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "BettyCO",
        "time": "20 June, 2021",
        "context": "Is this a slam at Dan Rather? Comments like his certainly didn’t help the situation. It’s a shame so much pressure to launch compromised the Crews safety. I watched it live that day. I’ll never forget the horror. They are American heroes we will never forget. ",
        "good": "11",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "terminator",
        "time": "20 June, 2021",
        "context": "Sad story of engineers yet another time being over ruled by bureaucrats.  Too many times in history this has happened.  Antilock brakes, air bags, etc.  And how many times would the bureaucrat remain unscathed and often times promoted.   Seeing the flare off the solid rocket booster  on the replay of the launch, I suspected in minutes what had happened.  Sad to say it was the only time I really wished  I had been wrong.  My coworkers and I, at an aerospace firm, were watching in shock and dismay at the tragedy.   We were so saddened for all those involved. \nIt was the first job for most of us just getting our degrees, but it was a lesson we learned from that would help us to prevent unnecessary risk in our careers.  We learned to stay firm in our convictions and not be bullied into compromising when the risk was too high.  Sadly in today's world we do not see this  mind set as much as we should.  Hopefully we will once again.",
        "good": "466",
        "bad": "16",
        "replies": []
    },
    {
        "user_name": "bourgeoiz",
        "time": "20 June, 2021",
        "context": "What did McAuliffe say to her husband before getting on the Challenger?  \n\n\"You feed the kids and I'll feed the fish.\"",
        "good": "2",
        "bad": "27",
        "replies": []
    },
    {
        "user_name": "williamffisher",
        "time": "20 June, 2021",
        "context": "There is absolutely no new information here. This has been common knowledge for decades. Why is this news?",
        "good": "7",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "hinnyvt",
        "time": "20 June, 2021",
        "context": "I remember watching this occur on live tv in 6th grade science class. This & 9/11 are etched into memory.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "thoraxhammersmith",
        "time": "20 June, 2021",
        "context": "I remember this. i was in 5th grade, and we were actually watching it live when the challenger exploded. We were in shock and disbelief. It was horrifying.",
        "good": "19",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Catman956",
        "time": "20 June, 2021",
        "context": "Thank you Dan Rather.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "retireddist1b",
        "time": "20 June, 2021",
        "context": "I think this nation has much more serious issues to face right now.   That was then and this is now and we just had a Presidential election stolen in full public view.   Pay attention to what matters now.",
        "good": "60",
        "bad": "12",
        "replies": []
    },
    {
        "user_name": "sunny497",
        "time": "20 June, 2021",
        "context": "Just curious...if there were any lawsuits for this tragic accident that could \nhave been prevented  ??  What brave heroes and exceptionally unique Challenger Crew !\nWe SALUTE ALL OF YOU. ",
        "good": "12",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bourgeoiz",
        "time": "20 June, 2021",
        "context": "What does NASA stand for?\n\nNeed\nAnother \nSeven \nAstronauts",
        "good": "1",
        "bad": "9",
        "replies": []
    },
    {
        "user_name": "loveofthecommonman",
        "time": "20 June, 2021",
        "context": "At least we didn't farm out manned launches to Russia back then.  Obama-Biden shutdown our manned space program and relied on Russia to put Americans in space.",
        "good": "18",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "pinballdude66",
        "time": "20 June, 2021",
        "context": "So it's not a claim, it's already a known fact revealed by NASA a long time ago that at least some of the crew initially survived the explosion, this ain't news.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tager",
        "time": "20 June, 2021",
        "context": "yes definitely they were still alive.  what is more, this was the first shuttle flight that did not have a chute for the shuttle itself.  the decision had been to remove it to save weight because some idiot had decided there was no possible way the shuttle would survive an explosion during the initial ascent so the chute was just dead weight.  the oxy controls on the back of flight suits was just one more bonehead idea.  the astronauts were killed by hitting the water.  the shuttle body was still intact when found on the ocean floor.  and of course the launch should have been postponed again due to the cold.  they knew that.  That sad tragedy lives in my brain right next to JFK, MLKJ, Bobby Kennedy, the NASA silo fire, and 9/11.  ",
        "good": "8",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "doubledeuce",
        "time": "20 June, 2021",
        "context": "I was watching this live with a bunch of other college students in a big video room. We were excited at launch and then the explosion. It’s just something you never forget. I feel even worse knowing their deaths were not instantaneous.",
        "good": "28",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Imbecile_Joe😵and_Kamela_Toe🐫",
        "time": "20 June, 2021",
        "context": "I remember watching that happen.  I was in first grade and the entire elementary school was in the gymnasium sitting on the basketball court to watch the launch on TV.  When it expoded I didn't really know what happened, I just remember the teachers mouths wide open for a couple of seconds before one gained composure and quickly went to turn the TV off.",
        "good": "8",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "bandito_01",
        "time": "20 June, 2021",
        "context": "biden's America.  This is biden's fault,",
        "good": "3",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "2daysreality",
        "time": "20 June, 2021",
        "context": "Was staying at a Houston hotel getting ready to leave for a job interview and turned on the news.  Couldn't believe the pictures on the news.  What a sad day.",
        "good": "13",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "yepbookertdied",
        "time": "20 June, 2021",
        "context": "Ahh the smell of burning flesh as I walked out of our barracks at the 230th MP Co in Kaiserslautern, FRG that day",
        "good": "2",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "Randomized",
        "time": "20 June, 2021",
        "context": "That the crew survived the explosion and was killed upon impact with the sea has been known since shortly after the incident. Nothing \"surprising\" about the claim in the new book.",
        "good": "20",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "GreenCarrot",
        "time": "20 June, 2021",
        "context": "First Asian American astronaut dies in space and they focus on the white woman.",
        "good": "0",
        "bad": "28",
        "replies": []
    },
    {
        "user_name": "bourgeoiz",
        "time": "20 June, 2021",
        "context": "What were McAuliffe's last words?\n\nWhat does this button do?\n\nNo...\n\nWhy would I teach Critical Race Theory?",
        "good": "7",
        "bad": "9",
        "replies": []
    },
    {
        "user_name": "elsinorejohn",
        "time": "20 June, 2021",
        "context": "This is one of those events that you will always remember where you were when it happened. I stayed home from school and was supposed to watch it in 7th grade social studies but watched it at home instead. Even as a 13 year old i knew what was going on and had a feeling they had to suffer just based on the sequence of events. I was even naive enough to think they may have actually survived all the way to the water.",
        "good": "16",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "shelbylovesglocks",
        "time": "20 June, 2021",
        "context": "When we colonize Mars it's no secret that hundreds maybe even thousands will need to get on one way spacecraft knowing full well that they will never return to earth, and at most there lifespan will be another year, until a self sustaining base is up and running.  During WWII tens of thousands of Americans in the military and intelligence services were told up front that they were being sent on missions where there was a very small probability that they would survive.  The soldiers that hit the beaches at Normandy were told the night before to enjoy sunset because most of them wouldn't live to see a sunset again.   As we embark on space exploration I hope we still have men and women with the resolve to willingly and enthusiastically sacrifice their lives for the good of humanity.  From what I see of our youth today though I'm very worried that we don't.",
        "good": "321",
        "bad": "16",
        "replies": []
    },
    {
        "user_name": "bandito_01",
        "time": "20 June, 2021",
        "context": "It's nice to think that they didn't feel it but the truth probably is that some felt it and some didn't because they were already dead.",
        "good": "10",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "texasjranch",
        "time": "20 June, 2021",
        "context": "This is nothing new. I was invited to that launch because of the work my HS gifted program did with NASA on their \"get away special\" program. My teacher for that program was supposed to be the teacher that went but they found out he was ill during the physical and he lost the shot at it. We were all still supposed to go. I'm glad we didn't but the erie thing was I was in Houston at NASA when the team was training and got to meet the crew. And a few months later they were gone. Then when the next one went down we were hauling hay as it was coming down and ended up with debris from it in our hay. Rather a creepy feeling to be touched by both shuttles like that.",
        "good": "25",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "derp!",
        "time": "20 June, 2021",
        "context": "AOC almost died in the Challenger explosion.",
        "good": "13",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "bobjones660",
        "time": "20 June, 2021",
        "context": "\"choose as the first citizen passenger in the history of our space program one of America’s finest — a teacher.\" - back then, a teacher WAS one of America's finest. Today, they are the enemy of America.",
        "good": "28",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "pso9834",
        "time": "20 June, 2021",
        "context": "If you are interested in the cause of the Challenger disaster, you can google the topic and add the name Bob Ebeling, who was the engineer that warned NASA that the seal was going to leak in the record low temperature and cause the explosion. \nAfter the investigation, NASA said that the deaths of the seven Challenger astronauts served to remind the space agency \"to remain vigilant and to listen to those like Mr. Ebeling who have the courage to speak up.\" \nIt was politics that overrode the warnings from the engineers. I hope by introducing Woke in the culture, NASA does not forget that it was politics that caused the disaster.",
        "good": "25",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "bourgeoiz",
        "time": "20 June, 2021",
        "context": "What color were McAuliffe eyes?  Blue.  One blew that way and another blew that way.",
        "good": "2",
        "bad": "13",
        "replies": []
    },
    {
        "user_name": "mentor397",
        "time": "20 June, 2021",
        "context": "Exactly what is \"surprising\"?  They've been saying for years that at least some of the astronauts survived - until they hit the water, that is.  The book may be new, but that claim isn't.",
        "good": "14",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "DinkerbertOgelhump",
        "time": "20 June, 2021",
        "context": "wow. that's a long fall.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "seektruth605",
        "time": "20 June, 2021",
        "context": "IT never should have happened considering the O-rings on the solid rocket boosters were having problems but NASA still took the chance with their lives.",
        "good": "4",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "ManneQuin",
        "time": "20 June, 2021",
        "context": "This is the first I've heard that they survived the initial blast. All these years I thought the explosion was instant death and they didn't know what hit them, which to me was a blessing. I would imagine that 2 minutes is a long long time in a situation like that. The entire country had a strange quiet and was shocked for several days.",
        "good": "36",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "CalvinAtwood",
        "time": "20 June, 2021",
        "context": "Um..   I just read the tag line.   This \"theory\" isn't anything new.  It's been around since day one...",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bourgeoiz",
        "time": "20 June, 2021",
        "context": "The person who made the O ring went to Trump University.  What could have gone wrong?",
        "good": "2",
        "bad": "29",
        "replies": []
    },
    {
        "user_name": "wdrumm56401",
        "time": "20 June, 2021",
        "context": "You know, the  teacher was a science teacher. After the disaster she was history. ",
        "good": "5",
        "bad": "9",
        "replies": []
    },
    {
        "user_name": "freestuff4life",
        "time": "20 June, 2021",
        "context": "True Americans and true heroes.",
        "good": "7",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "OrangeBee",
        "time": "20 June, 2021",
        "context": "I was in 3rd grade off sick from school, remember watching this :(",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "OrangeBee",
        "time": "20 June, 2021",
        "context": "So really we can blame Dan Rather.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jackd.thomas",
        "time": "20 June, 2021",
        "context": "Summary:  Several of the skilled astronauts accustomed to the G’s experienced a horrific death that lasted over 8 minutes as the vehicle free fell to earth, freezing, gasping for air, bloodied, spinning wildly inside a washing machine, fully aware of their eventual fate.  \n\nIt was terrifying.  This has been known for a long time.  \n\nRonald Reagan nailed it in his speech that followed the disaster.  \n\n“The future doesn’t belong to the faint hearted.  It belongs to the brave.”\n\nGod bless our American heroes.",
        "good": "109",
        "bad": "4",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "Laurel_and_Harris",
        "time": "20 June, 2021",
        "context": "When ever I feel something bad is about to happen,  I'll say \"Challenger, go with throttle up.\"",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "CyanHelmet",
        "time": "20 June, 2021",
        "context": "Whereas ye know not what shall be on the morrow. For what is your life? It is even a vapour, that appeareth for a little time, and then vanisheth away. James 4:14. Are you saved?",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bourgeoiz",
        "time": "20 June, 2021",
        "context": "I can remember the indoctrination of the Reagan administration in schools.  This was a small part of it.  We had to watch many of his addresses to the nation.",
        "good": "1",
        "bad": "12",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "max672",
        "time": "20 June, 2021",
        "context": "Just like when President Kennedy was shot, I remember where I was on that day.  Likewise, when the Challenger tragedy happened I was in Beaufort, SC working on a roofing project for the US Navy at the Marine Corp Recruit Depot Parris Island, SC.  We had closed down for the day because the outside temperature was about 32 degrees.  A very cold cold front had descended on the entire region including Cape Kennedy in Florida.  Two very sad days and memories for me.",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "Botard",
        "time": "20 June, 2021",
        "context": "Some good comments here, but many make me ashamed to be an American. This was a terrible tragedy and these astronauts were the bravest of the brave.",
        "good": "11",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "loveofthecommonman",
        "time": "20 June, 2021",
        "context": "As a child, I was fortunate enough to witness all the Mercury, Gemini, and Apollo programs. Those were heady days in the space race and we kicked Russia’s butt. But at a dear cost. RIP Gus, Ed, and Roger.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "shazaamster",
        "time": "20 June, 2021",
        "context": "We never learn enough.  For the crew capsule to survive, the front tiled section is not a wonder whatsoever, but the rear bulkhead, surely it must be far more reinforced than you might imagine because it would have received the full force in order to take the capsule from 3 G's to 20 G's as it separated.  How is that even possible?  How much energy is needed to accelerate what might be 30 tons from 3 G's to 20 G's?  And is the rear bulkhead really capable of absorbing that energy?  No one ever advises what are the metric's they use to determine no sudden depressurisation?   And why is there no crew emergency power so we can at least hear what they experience and the status of controls, like pressure in capsule etc.?  Why give them emergency oxygen but no emergency power?  So many times amateur people, like me, never seem to get to hear the answer to questions even an amateur has.",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "justheretohelp",
        "time": "20 June, 2021",
        "context": "They were strong and strapped in with suits that protected them from various type of pressure and shocks. The crew capsule with bodies was found on the sea floor. If they drowned after sinking, they're not going to tell us.",
        "good": "4",
        "bad": "2",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "SilentService559",
        "time": "20 June, 2021",
        "context": "This information isn’t new and has been well documented.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "wdrumm56401",
        "time": "20 June, 2021",
        "context": "Opps, I ment social studies teacher. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jp6969",
        "time": "20 June, 2021",
        "context": "So, it's Mindy's fault?",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "error": "error"
    },
    {
        "user_name": "ponyboy58",
        "time": "20 June, 2021",
        "context": "This is no surprise. The fact that switches were thrown and air supplies turned on was documented several months after the fact.\nNo one wants to think that those poor people went through several minutes of hell before they hit the water. It's easier to think they all went quickly and at once during the explosion.",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "error": "error"
    },
    {
        "user_name": "cegg",
        "time": "20 June, 2021",
        "context": "The shuttle program should have been kept at the experimental stage and not become the main Nasa launch vehicle.  It's bloated budget had gobbled up a lot of potential robotic missions and even its constraints played into effecting the design of other space missions.  The over selling and it's under performance is one of the worst for any launch vehicle.",
        "good": "3",
        "bad": "3",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "error": "error"
    },
    {
        "user_name": "amsy",
        "time": "20 June, 2021",
        "context": "Save your money and watch the numerous videos on YouTube. All that is described here is all on video. And had been for years.  In at least one of the videos, an engineer highlights the capsule thru the explosion and follows it's decent to the water.",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "bobbycatrell746",
        "time": "20 June, 2021",
        "context": "Several NASA engineers warned about what might happen if they launched during those very cold temps and those warnings were NOT taken seriously. When they recoved the remains/crew cabin several of the crew had water in their lungs. A sign they were probably still alive following the crash into the ocean and then drowned.",
        "good": "6",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "GoldFlask",
        "time": "20 June, 2021",
        "context": "Probably climate change or racism.",
        "good": "4",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "immunetobs016",
        "time": "20 June, 2021",
        "context": "The point of this article is what?",
        "good": "3",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "svrao",
        "time": "20 June, 2021",
        "context": "Space is not the habitat of man, passenger space flight is a stupid idea. America has many crackpots, some became Presidents.",
        "good": "1",
        "bad": "4",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "Divested1",
        "time": "20 June, 2021",
        "context": "Brings back memories. I was in 5th grade at the time. I remember they gathered us all in the library to celebrate and watch the launch. A few months before we had a Delta flight 191 to get literally slammed to the ground by a micro-burst on approach to DFW. Two stinging events for my young psyche that I feel led me to become somewhat of an aviation enthusiast. It was also a reminder of how you can be here one moment, and the next you are gone. Gives perspective on how we fit in the scheme of things, both as an organism and as spiritual beings.",
        "good": "188",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "Viking.",
        "time": "20 June, 2021",
        "context": "I recall every second of this tragedy as if it was yesterday. I was in total shock at what I witnessed, I was 16 years old and in the crowd watching. Very sad sad day in American history.",
        "good": "12",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "MikeMailway",
        "time": "20 June, 2021",
        "context": "It didn't need to happen. More than a few engineers were aware that the o rings were failing and exhaust gases were leaking out of the solid rocket boosters. Have the courage to stand alone and speak up when it's necessary to speak up.",
        "good": "28",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "loveofthecommonman",
        "time": "20 June, 2021",
        "context": "Have any liberals trolls here blamed the Challenger disaster on Trump yet?",
        "good": "13",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Paula_from_Utah",
        "time": "20 June, 2021",
        "context": "I wonder what became of that NASA manager who was so snarky about legitimate concerns?\n\nPoliticians should never have been allowed to decide when to launch something like the shuttle. Safety should always be first.\n\nI’ve read that there was evidence showing that the astronauts survived the explosion, I’ve just never knew what that evidence was. It sickens me to know they knew what was happening. The horror of that….. ",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "hlh575",
        "time": "20 June, 2021",
        "context": "I remember seeing this on TV in my 12th grade Science class.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "babybison2020#",
        "time": "20 June, 2021",
        "context": "That disaster was 35 years ago. It seems we really aren’t a racist nation, two women and a black astronaut… were on the Challenger.  ",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Northernpatriotoffreedom.",
        "time": "20 June, 2021",
        "context": "It's appalling how many people are against this piece of American history, and the heroic people that accepted that mission.",
        "good": "15",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "aesops.retreat",
        "time": "20 June, 2021",
        "context": "Reagan should be on Mt Rushmore.  One of the Best Presidents ever.\nRegardless how the H8ers and Low IQ respond to this. Those idiots are in love with Dementia Joe. They have NO judging ability.",
        "good": "25",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "1640riversidedrive",
        "time": "20 June, 2021",
        "context": "Were this mission to be flown today, there wouldn't be one token black or female.  Biden would say, \"I’m directing NASA to begin a search to choose as the first all-BLACK, TRANSGENDER crew passenger in the history of our space program.\"",
        "good": "11",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "purpleroses",
        "time": "20 June, 2021",
        "context": "I don't think we need to be reminded of this tragedy.  Let them rest in peace.",
        "good": "7",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "libertyordeath111",
        "time": "20 June, 2021",
        "context": "Old news.",
        "good": "2",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "fridayagain",
        "time": "20 June, 2021",
        "context": "If my spouse had been a brave teacher, ordinary American who gave it all to be the first to be chosen the first in space, I’d want a marked grave! Idk why Mr McAuliffe would think “tourists” would somehow disturb a grave and that just seems very odd to me. Did the other heroes of this tragedy have unmarked graves? Nope, that just makes no sense.",
        "good": "7",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "bobfrombobville",
        "time": "20 June, 2021",
        "context": "This accident was 100% NASA leadership’s fault. MT has warned them that the temperatures were well below design reliability. NASA also has previous flight data to support the impending failure of the critical parts. NASA choose to continue with the flight anyway despite the warnings from the solid rocket booster manufacturer. \n\nThe cause of the disaster was an Aerodynamic breakup of the SRB and the main fuel tank. Which is why the flight deck was intact and they survived the breakup. Terrifying free fall back to earth….\n\n100% preventable…..",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "ceeferjay6",
        "time": "20 June, 2021",
        "context": "Dan Rather....Never really understanding his job was to report the news and not give his opinion.",
        "good": "9",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "squigly",
        "time": "20 June, 2021",
        "context": "Not new.\nTwenty years ago, the experts \nsaid they survived 30 or 40 seconds \nin their seats after the explosion. ",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "elenageorge",
        "time": "20 June, 2021",
        "context": "January is cursed for space launches.  We killed Gus Grissom, Ed White, and Roger Chaffee in a January pad fire ;-(",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tbear82nd",
        "time": "20 June, 2021",
        "context": "Ok working off a very old memory but as I recall this is not new, it was said some of them had water in their lungs and as I understand it, that means they were still alive in the water.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "loveofthecommonman",
        "time": "20 June, 2021",
        "context": "Rest in Peace:\nGus Grissom\nAlan White\nRoger Chaffee\nAlan Shepard\nNeil Armstrong\nJim Lovell\nJohn Glen\nDeke Slaton\nJack Swigert\nAll real American heroes!!",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "error": "error"
    },
    {
        "user_name": "chap1012",
        "time": "20 June, 2021",
        "context": "I remember this like it was yesterday.  My daughter was only 5 yrs old (now 39).  May the crew rest in peace.  Job well done.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "GoldRadio",
        "time": "20 June, 2021",
        "context": "Journalism: The mental equivalent of an appendix, formed in early mankind and contemporarily entirely useless.\n\nWho wants to read an article regarding one of the worst aerospace disasters in history to reveal that the crew was conscious following the explosion and after experiencing the crushing force of 20 Gs fell to earth and make impact with the ocean at approximately 200 mph. \n\n\"Surprising\" is not the appropriate term for such a revelation, although journalist Reed Tucker probably rushed home to masturbate after learning the details of the crew's probable fate. \n\nThe Challenger crew met their demise attempting to reach space. That mission ended in needless tragedy because of poor ground control judgment decisions. The actual experience that those astronauts apparently encountered is irrelevant in the minds of all who recall that fateful event.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Beaver_Breath",
        "time": "20 June, 2021",
        "context": "Their suits must have contained their remains.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "bfmn",
        "time": "20 June, 2021",
        "context": "A couple of years ago a documentary, shown on I believe the anniversary of this tragic event, revealed some never disclosed information regarding this event.  \nOne of the items disclosed was that the explosion did not end the lives of all on board Challenger.  \nThe documentary disclosed that they also actually have recordings/communications from some of the crew, up to the point of the modules contact with the ocean.  It was mentioned that these will not be disclosed to the public out of respect for the astronauts and their families.  \nAs some may or may not be aware the crew occupied a pressurized module, which allowed for some of the members to survive the initial explosion.  \nI remember this event as if it happened yesterday.  I was watching it live and thought to myself that they had all must have perished.  I remember listening to the news anchors and mission control as they continued talking as if they didn't know what had happened.  \nI sat there stunned at what I saw.",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "juiced",
        "time": "20 June, 2021",
        "context": "This story and book cover nothing new.  The issue with the thrown switches and the emergency packs being activated have been known since about 1994 when I first heard about it, and probably earlier then that.  The issue that they were under pressure to launch was also known, driven by the democrats and certain big wigs in the media desperate to keep attacking Reagan and any program he pushed for while the reporters spent time in Russia on the Soviets dime for \"fact finding trips\" every time they had a chance.  Back in the late 70's to mid-1980's, the Soviets found out it was far cheaper to host \"fact finding trips\" in the Soviet Union for certain members of the media and politicians and they got free publicity and propaganda out of it that was far more reliable at influencing US public opinion then it's donations and support for liberal groups in the US and groups ranging from environmental and anti-nuke activist groups in Europe.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "josephdirt",
        "time": "20 June, 2021",
        "context": "I won't read the book as it seems the author is painting Christa as a social justice warrior and victim. Kind of disgusting if you ask me.",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "calswami",
        "time": "20 June, 2021",
        "context": "Critical Space Theory",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "r_scottus151",
        "time": "20 June, 2021",
        "context": "We all SAW the command capsule come out in tact. Most people with common sense knows they were still alive. Who does this writer think it is, and they have covered new ground?\n\n\nI mean, REALLY...Video doesnt lie. Why do all these liberals think video lies?",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "a1anda2",
        "time": "20 June, 2021",
        "context": "Educated idiots are a huge problem in the world today.",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "peregrine464",
        "time": "20 June, 2021",
        "context": "Story is likely true. Hope they didn’t suffer. May they all Rest In Peace.",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ironranger281",
        "time": "20 June, 2021",
        "context": "Why could it not be the Clintons and not these heros ?",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "ironranger281",
        "time": "20 June, 2021",
        "context": "Liberals destroyed the shuttle because they didnt want to see a black man in space ! \n\nIt would destroy their agenda !",
        "good": "9",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "mrwaffle",
        "time": "20 June, 2021",
        "context": "Everyone knows the actual last words heard on the flight recorder was McAuliffe saying \"what does this button do?\".",
        "good": "1",
        "bad": "8",
        "replies": []
    },
    {
        "user_name": "OrangeCactus",
        "time": "20 June, 2021",
        "context": "Yep.that is truth.I know.but,they perished.and knew the risk.NASA still and is,our frontier.",
        "good": "3",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "maxcackle",
        "time": "20 June, 2021",
        "context": "Sealteam6.  Why is it that when I see one of his comments I picture someone with Down's Syndrome with a cape running around saying \"I am a memba of theal team thix\".",
        "good": "14",
        "bad": "2",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "GreenPopcorn",
        "time": "20 June, 2021",
        "context": "They were alive and conscious all the way down. I know this for a fact. And the public doesn't know details that are truly horrifying",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "error": "error"
    },
    {
        "user_name": "gentle_barron-trump",
        "time": "20 June, 2021",
        "context": "Why is this non-news item on the front page of the Fox News web site when there are Trump voters all over the country committing terrorist attacks with their vehicles against innocent Americans?",
        "good": "1",
        "bad": "16",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "error": "error"
    },
    {
        "user_name": "USMC_Drum_&_Bugle",
        "time": "20 June, 2021",
        "context": "Fascinating. And newly uncovered evidence shows the Japanese used airplanes to attack Pearl harbor.",
        "good": "1",
        "bad": "8",
        "replies": []
    },
    {
        "user_name": "mrwaffle",
        "time": "20 June, 2021",
        "context": "Nothing new has been brought up in this book or news article.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "error": "error"
    },
    {
        "user_name": "scubby51",
        "time": "20 June, 2021",
        "context": "I personally knew one of the people involved in the \"orginal design\" by Morton-Thiokol of the solid fuel boosters. The orginal design called for the booster fuel to be poured in one homogeneous fill with the sections assembled. The rubber o-rings were for hydro-static testing only. Rubber can not stop burning solid rocket fuel. Just like you wouldn't use a rubber gasket in a cars exhaust. They are made out of metal or high-temperature fibre material. The orginal design called for the booster to be made near Brunswick, Ga. Placed on a barge and taken to the Cape via the inter-costal waterway, then installed on the main rocket. They were made in sections because a cetain senator wanted them made in Utah! Politics!",
        "good": "28",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "kallus33",
        "time": "20 June, 2021",
        "context": "Well that was surprising, I thought for certain the revelation would be that it is now Trump’s fault.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "deplorablebrian",
        "time": "20 June, 2021",
        "context": "As dangerous as going into space is we should start emphasizing equity and racial justice over competence and performance.\n\nI’m sure a lot of the people shot into space agree... :D",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "ericstevens",
        "time": "20 June, 2021",
        "context": "I was 14, at home from school for a snow day, watching this on the TV with my brothers and sister. I can never forget. I also remember the story of a fisherman off the coast that day with a story of supernatural origins. Maybe it was true, after all?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "JohnRawls",
        "time": "20 June, 2021",
        "context": "watched that in real time in HS geography class",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mrwaffle",
        "time": "20 June, 2021",
        "context": "So! Are they saying it was the sudden stop that killed them?",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "thesecondcomingoftrump",
        "time": "20 June, 2021",
        "context": "weather that cold in florida is rare ....sounds like the press was putting pressure on the launch and the mangers made a poor decision to launch",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Robert912",
        "time": "20 June, 2021",
        "context": "This has been long known. It was a failure of technology much like Titanic. NASA arrogance said there was “1 in 100,000 chances there could be a complete vehicle loss with crew killed. It turned out to be 2 complete loses for 135 flights. A complete disastrous program. Waste of life and treasure at 1 billion per launch as well.",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "wowjustwow107",
        "time": "20 June, 2021",
        "context": "This os not new, watch any number of documentaries since the incident",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "MyMIstake4Coffins",
        "time": "20 June, 2021",
        "context": "I heard this a long time ago.  One guy pulled up one of the videos and pointed to the compartment intact and falling to earth.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "scottbuzz",
        "time": "20 June, 2021",
        "context": "I was finishing college at the time in Missouri, after five years in the Air Force. I've always remembered a guy who said it was the end of NASA. Liberals are so clueless. I took this clown to a nearby Navy base for the dedication of a new building named \"Challenger \"",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rupertm1e6",
        "time": "20 June, 2021",
        "context": "The classified report indicated the cause of death at least for some of them was drowning.  They survived the explosion and left messages for their family's on personal voice recorders.  Rough way to go but at least they had a chance to say goodbye.  Today it seems like space travel thanks to SpaceX is going to be far less of the governments only chosen few and open to many more.  That is good.  There will however be more accidents any time the edge is pushed, and those that sign up know the risks and rewards.  To all of those that go out and push the edge of the envelope I salute you and wish you Godspeed.",
        "good": "6",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "allons!",
        "time": "20 June, 2021",
        "context": "The FBI set the whole thing up. You will see.",
        "good": "1",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "idon'tknow810",
        "time": "20 June, 2021",
        "context": "WE WILL NEVER FORGET YOUR COURAGE...RIP  AND FOR YOU TROLLS.  WHAT COMES AROUND GOES AROUND. THE FUNNY THING IS WHEN YOUR GONE. WE WON'T EVEN KNOW IT.. ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "vegg319",
        "time": "20 June, 2021",
        "context": "I watched the launch from Kissemmee Florida. Felt my stomach and heart drop when I saw the split. Those who were watching know what I mean by that. We all knew that something had gone horribly wrong.\n\nAll these years later, just remembering I'm tearing up. \n\nGod bless the crew's families. To relive that moment over and over would be like reliving their family members deaths again and again.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Quietly",
        "time": "20 June, 2021",
        "context": "What do I think?\nChrista McAuliffe & I were similar in age when she she had the courage to fly to the moon.\nWe all watched with envy; us, her family and her Students.\n*\nIt is NOT sad that she and several others perished.\nIf you ask her (then) students how they remember her goal / her dreams ...\nEvery single one of her students are doing GREAT.\n*\nWhile I might have been to chicken to do what Christa did,\nI learned, as did her STUDENTS -\nBetter to try and fail versus don't try and fail.",
        "good": "5",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "ceeferjay6",
        "time": "20 June, 2021",
        "context": "I wonder how Rather felt afterwards?.....He must have felt some guilt that his words had contributed to NASA's determination to NOT cancel another launch.\nWow, a big burden to carry.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "ArmySniper919",
        "time": "20 June, 2021",
        "context": "Our current GOVERNMENT will not disclose who killed the female at the capitol Jan 6 much less tell us anything else. They think and are correct that most ate too stupid to handle the truth.",
        "good": "11",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "CMDRViperMetcalf,USN",
        "time": "20 June, 2021",
        "context": "Jesus wept.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rfrx951",
        "time": "20 June, 2021",
        "context": "Feynman lectures on this were fascinating.  This isn’t news, just selling a book.  I live in Orlando and remember seeing this as a kid.  Remember it like yesterday :(",
        "good": "7",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "HPLwasright",
        "time": "20 June, 2021",
        "context": "CLICKBAIT HEADLINE\nAs many others have noted here, it has been known for 35 years that the crew survived the initial explosion. \nSeveral comments have referenced the crew's last messages to families. While this may be true no such transcripts have been published, although the National Enquirer faked some 30 years ago, which is what might be the source of that belief.\nIt has been documented that two of the emergency oxygen supply valves were manually opened, suggesting survivors of the initial blast.\nIt's fine to favorably review a new book, but it is wrong to hype the book with incorrect facts.",
        "good": "12",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "j.robertpetrosh",
        "time": "20 June, 2021",
        "context": "They had voice and data recording.  I do believe transcripts of what was audible was made public years ago.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dcbrooks",
        "time": "20 June, 2021",
        "context": "I was 8 years old watching the launch on my grandmothers black and white TV. I'll never forget seeing that shuttle explode.  It was like a 911 moment.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "rfrx951",
        "time": "20 June, 2021",
        "context": "Sealteam6 doesn’t understand basic civics but will come here and lecture us on what should be.   /popcorn",
        "good": "4",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "truetexan1",
        "time": "20 June, 2021",
        "context": "This shows that the government should not be trusted to do anything.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "gregjones55",
        "time": "20 June, 2021",
        "context": "Aaaand here come the keyboard astrophysicists.",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "wxman33",
        "time": "20 June, 2021",
        "context": "...and the Left's blaming Trump again...err, sorry, Reagan. Same tactics different decade.....",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sandiglas",
        "time": "20 June, 2021",
        "context": "What, exactly is the surprising claim made by the book?  That the astronauts survived the initial blast?  That's been known since shortly after the accident.  Perhaps the surprising claim is that the whole teacher in space thing was a political gambit to get votes?  The claim itself, I suppose, is surprising, and doubtful.  Perhaps the author is thinking in this day and age of politicians doing anything to garner a few votes that people would believe that the man who was up my nearly 20 points in the polls and would go on to win every state but his opponent's home state felt a need to curry favor.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ceeferjay6",
        "time": "20 June, 2021",
        "context": "Dan rather is also on record for telling America:\n\"The launch has been postponed so often since its original date, December 18, that it's now known as mission impossible.”\n\nLittle wonder NASA were feeling the pressure to launch!.....Rather should have stuck to simply reporting the news instead of trying to be Mr Smart Guy!",
        "good": "39",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "LMike444",
        "time": "20 June, 2021",
        "context": "Old news. NASA wanted to spare the family the details but \nrelentless news reporters and lawyers kept bringing it up. \nTragic loss. Administrators pushed for a launch when it was \ntoo cold out. Rubber o-rings were too stiff at that temperature.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "Mr.Science",
        "time": "20 June, 2021",
        "context": "They have a memorial at Arlington.\n\nLet us hope that Democrats don't tear it down.",
        "good": "9",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "weswin",
        "time": "20 June, 2021",
        "context": "l can't even imagine the sheer terror.\nmay they all rest in peace, their souls comforted by God himself.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "moneybags1980",
        "time": "20 June, 2021",
        "context": "A family member worked at NASA when this happend and said that the astronauts where still alive until the hit the water.",
        "good": "4",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "BlueCactus",
        "time": "20 June, 2021",
        "context": "This is not new.............",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "PensH8r",
        "time": "20 June, 2021",
        "context": "This was sad. This was my “where were you when Kennedy was killed” moment my parents talked about.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "TheMegoSpider-Man",
        "time": "20 June, 2021",
        "context": "Dan Rather and the rest of fake news that put pressure on NASA to launch were partly responsible. They wanted the launch so they could obsess over coverage and get money from big ratings.",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "looking_glass",
        "time": "20 June, 2021",
        "context": "did it hurt? ..probably.",
        "good": "0",
        "bad": "10",
        "replies": []
    },
    {
        "user_name": "indysue",
        "time": "20 June, 2021",
        "context": "Chilling. Astronauts are the best of the best.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "maholan903",
        "time": "20 June, 2021",
        "context": "Terrible reporting. Click bait.  We knew the story. So what the back story on selection. They all died, accident, tragedy.  I was there in FL. Still makes me sad.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "steamrockfevor",
        "time": "20 June, 2021",
        "context": "“ when do you want us to launch, next April  ?” Arrogance kills. And the democrat liberal media didn’t help either by ridiculing the delays.",
        "good": "17",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "DirtySanchez122",
        "time": "20 June, 2021",
        "context": "NASA (Need Another Seven Astronauts)",
        "good": "0",
        "bad": "14",
        "replies": []
    },
    {
        "user_name": "litvak",
        "time": "20 June, 2021",
        "context": "It was one of those earth shaking events that I can instantly regress to where I was and what I was thinking at the time. Much like President Kennedy's assassination, or 9/11. It's like we all abandon our egos for a moment, and become a collective consciousness.",
        "good": "23",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "village24green",
        "time": "20 June, 2021",
        "context": "I can't help thinking they were free-basing coke and doing silly stuff during lift-off",
        "good": "0",
        "bad": "17",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "Jwalls",
        "time": "20 June, 2021",
        "context": "NASA=Need Another Seven Astronauts ",
        "good": "2",
        "bad": "12",
        "replies": []
    },
    {
        "user_name": "hilairebelloc",
        "time": "20 June, 2021",
        "context": "Important story but the crew surviving is not a new revelation.  It’s been discussed for at least 20 years if not more.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "village24green",
        "time": "20 June, 2021",
        "context": "I wasn't quite born then but I'm taken aback by just how evil were the 'NWO' forces controlling the government then.",
        "good": "0",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "village24green",
        "time": "20 June, 2021",
        "context": "Breathtaking ride while it lasted. I'm sure they all had their thrill.",
        "good": "0",
        "bad": "15",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "outdatedwhiteman",
        "time": "20 June, 2021",
        "context": "I could see the crazy contrails in Tampa after the explosion. I couldn't figure it out. I just was unable to process something so horrible was possible. A friend called me minutes later and told me what happened.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "johnvmfa122",
        "time": "20 June, 2021",
        "context": "I knew the Challenger was doomed the Sunday before the launch. I was at MCRD in San Diego at the time, and told a few of my fellow recruits the Shuttle was going to blow up, and for precisely the reasons the investigation later revealed. The boosters were an already well known weakness, and they were never rated for flight in the conditions they were trying fire them at. My SDI had a field day with me when he found out I called it days before.... The physics of it all were so basic that I still have a hard time believing they were so blind to it.",
        "good": "9",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "AAFPEPTOE2",
        "time": "20 June, 2021",
        "context": "Engineers studied the Challenger disaster.  There was specific warnings by an engineer that the temperature was outside tolerance range and the \"O\" rings could fail.   That engineer was overrode by \"higher-ups\" at Morton Thiokol.  Serious miscall caused the crew's lives and the Challanger disaster to meet schedule and spare embarrassment to the spacecraft engineers.\n\nMany lessons learned, but at the expense of the Challenger crew and years of delay for the Space Program.",
        "good": "36",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "anon-E-mouse-81",
        "time": "20 June, 2021",
        "context": "🤦‍♀️🤦‍♀️ Christa is alive.. theyre all alive guys.🤦‍♀️.. she a professor at a university.. some changed their nanes but MOST of them didnt even change their damn names.. these are facts and the evidence is scrutinized and verified but the main stream news take their direction from our overlords at the TOP (NEW WORLD ORDER> CABAL) so they wont even acknowledge the evidence and the news casters im sure believe the mainatream narrative because its not easy to accept that the people we trust at the top would decieve us.  \n\nThe moon landibg is also fake.. i LITERALLY WATCHED KUBRICKS DEATH BED CONFESSION ADMITTING THIS.. yes we did go to the moon.. eventually.. but not in 1969.. that was NOT LIVE BROADCAST.. too dangerous to do that LIVE while russia was watching.. if they died on the way wed be weak.. \n\nThey lied to us guys. .. the deepstate gov LIED. Theyve been in charge since the 30s when they enslaved us with the fed res. \n\nGuys ive LITERALLY watched the fake moon landing.. it show neil armstrong taking off his helmet on the moon set.. and take picture with plain clothes people.. it was between cuts.. ive literally watch s. Kubrick admit with great remorse what he did..",
        "good": "3",
        "bad": "19",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "rockstarrn",
        "time": "20 June, 2021",
        "context": "This is not new information this has been known for years ",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "kornfed151",
        "time": "20 June, 2021",
        "context": "One thing I remember about that time was that everyone loved being an American",
        "good": "39",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "WillUSMC",
        "time": "20 June, 2021",
        "context": "I was home on leave from Marine Corps boot camp and watched this live. My uncle was a launch pad engineer at NASA when this happened. RIP to all on board.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "areonedeeone",
        "time": "20 June, 2021",
        "context": "If we could take 1/10 of the cash we are throwing at social parasite programs and put it into NASA, we wouldn't have to watch the Chinese and adventure monkeys like Musk. play in space and talk of going to The Moon and Mars. Think about it.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "silvermane2018",
        "time": "20 June, 2021",
        "context": "I remember watching the launch & explosion while in Jr. high school, during a free period that was in the cafeteria. Friend brought his 2\" LCD TV to school, so a few of us watched because we were bored...that little TV with an antenna was huge tech back then. And most stations were still broadcast, not cable back then.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Tayvl",
        "time": "20 June, 2021",
        "context": "Reagan was ahead of his time when he cut funding to the corrupt NEA. And whoever wrote this story implied that he was being hypocritical by having the teacher in space contest. The NEA has nothing to do with teaching, it's just another (huge) corrupt labor union, doing more harm than good for students.",
        "good": "17",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "punjisticks370148",
        "time": "20 June, 2021",
        "context": "The obvious fact that there were no transsexuals and hispanics aboard (lack of diversity - too much whiteness and heterosexuality) doomed this mission.",
        "good": "10",
        "bad": "17",
        "replies": []
    },
    {
        "user_name": "ringding",
        "time": "20 June, 2021",
        "context": "Dan Blather ridiculed NASA for delaying based on caution. Sounds about right",
        "good": "21",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "hooduhthunkit",
        "time": "20 June, 2021",
        "context": "How did they know Christa McAuliffe had dandruff? They found her head and shoulders on the beach. \n\n\nI know, bad joke.. I watched that explosion while living in FL. It was always an exciting time when they launched from Cape Canaveral. I went and saw many launches from there.",
        "good": "0",
        "bad": "11",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "FSL",
        "time": "20 June, 2021",
        "context": "\"showed no signs of a sudden depressurization that could have rendered the occupants unconscious\"\n\nif they got hit by 20Gs of acceleration then they were unconscious, at least.",
        "good": "3",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "michaelwinner",
        "time": "20 June, 2021",
        "context": "Bad American design.",
        "good": "1",
        "bad": "8",
        "replies": []
    },
    {
        "user_name": "FL4FREEDOM",
        "time": "20 June, 2021",
        "context": "It was a horrible tragic day we cried for days did we really need this information ? What good comes from knowing they lived and knew something was wrong",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "travishammergobw",
        "time": "20 June, 2021",
        "context": "\"The announcement sounded pure, but the program was really a gambit to bolster the president’s reelection chances.\"\n\nI'm no fan of Reagan, but you could frame anything a president does right before a reelection this way. Very slimy.",
        "good": "4",
        "bad": "9",
        "replies": []
    },
    {
        "user_name": "jonathonnulph",
        "time": "20 June, 2021",
        "context": "I'll never forget that; it was right after I graduated from HS (class of '85) but I was still in the Vo-tech school (Forbes Road East, Monroeville PA outside of Pittsburgh) for my second year.  Me and a friend of mine just got done smoking a joint when we sat down and watched the launch.  Because I was so high, it took me a few minutes to realize what the heck was going on.  I actually thought that I was hallucinating the explosion for a second.  A friend of mine that I met in '06 was a construction manager in Merritt Island during the explosion and he told me that they watched it happen and the sound of the explosion was deafening even though it was 12 miles high.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "hooduhthunkit",
        "time": "20 June, 2021",
        "context": "\"A little-known Air Force official whose title was range safety officer quickly hit a self-destruct button, causing the boosters to explode and fall into the sea rather than on any populated areas.\". \n\nThey blew them up prematurely. They weren't going to land on any populated area. They were reengaging their programmed trajectories when they blew them up.",
        "good": "0",
        "bad": "10",
        "replies": []
    },
    {
        "user_name": "DogOnPorch",
        "time": "20 June, 2021",
        "context": "Spaceflight had become routine. Or so everybody had thought.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "4Jane",
        "time": "20 June, 2021",
        "context": "They were dealing with G forces untested on them.  Can't imagine not passing out or trying to manoeuver, but it looks like some of them did try.  This an accident that never should have happened. The O Rings maker expressed appropriate concern that NASA did not take seriously.",
        "good": "15",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "phxbob",
        "time": "20 June, 2021",
        "context": "I remember this happening and I worked in a Houston photo lab that processed 1000's of photos after the explosion for NASA. It was common knowledge they shot upwards and survived minutes until hitting the water and left messages to their families on personal recorders. My dad worked on a ship that recovered the cabin and the bodies. It is something I will never forget.",
        "good": "4",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "village24green",
        "time": "20 June, 2021",
        "context": "Were the guys going to get it on with those two hotties in space? The mind does boggle.",
        "good": "0",
        "bad": "24",
        "replies": []
    },
    {
        "user_name": "my_2_sense",
        "time": "20 June, 2021",
        "context": "So a terrifying, painful death for all aboard.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "eskovan",
        "time": "20 June, 2021",
        "context": "Pressure suits and parachutes, and some of them might have survived. It was absolutely those last few feet that killed them all..",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "ttttvzz445",
        "time": "20 June, 2021",
        "context": "These are well known facts back in 86. Some of the crew died upon impact with the ocean and they launched the shuttle out of temp spec. ",
        "good": "1",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "$toNyme72",
        "time": "20 June, 2021",
        "context": "What they looking for out there science? Man woman  and the definition of said sex",
        "good": "0",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "towerofbabble",
        "time": "20 June, 2021",
        "context": "What's \"surprising\" about any of this? I could've told you this ten years ago, if not more. This is just free advertising for a book. I wonder how much the publisher paid for that?",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "mc130ip",
        "time": "20 June, 2021",
        "context": "The really sad thing is that one person on the mission died for a Reagan publicity stunt.",
        "good": "0",
        "bad": "15",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "jmkski",
        "time": "20 June, 2021",
        "context": "Plenty of this info I heard a long time ago.  Someone making a buck.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jodawg",
        "time": "20 June, 2021",
        "context": "This isn't new.  They said that they were probably alive after the explosion back when It happened.",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "logos037",
        "time": "20 June, 2021",
        "context": "I suspect a bigger story would be how a design with a poor fitting O Ring got to the final. Seriously O rings are well understood. Seems to me there has to be more to that",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "gary1290",
        "time": "20 June, 2021",
        "context": "This isn't new. I was told many years ago there was evidence that there was system inputs by the crew indicating they survived.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "elvis2019",
        "time": "20 June, 2021",
        "context": "I hear their doppelgangers are alive and well.",
        "good": "1",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "Outlaw1967",
        "time": "20 June, 2021",
        "context": "They quit painting the boosters just to save weight, so stop posting they should have had a 30 ton parachute system that would deploy at escape velocity speed.\nI was in basic training when this happened, the drills let us watch by relaying the picture by mirrors down the barracks hallway.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "johnny98",
        "time": "20 June, 2021",
        "context": "As the old saying goes \"how time flys by\", I was in 7th grade shop class and the teacher let us watch that doomed launch, we were in silence after the explosion, I remember that like yesterday.....",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "river_rover",
        "time": "20 June, 2021",
        "context": "What does NASA stand for........Need Another Seven Astronauts.",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "HornedToad",
        "time": "20 June, 2021",
        "context": "There is nothing new or startling about the emergency air valves being activated AFTER the explosion.  It was a well documented and reported on fact at the time.  The astronauts were alive an conscious as their still intact cabin fell towards the sea, killing them on impact.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "usafben",
        "time": "20 June, 2021",
        "context": "Who was the NASA manager that said, infamously \"When do you want me to launch — next April?\" Who was it?",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "marks159",
        "time": "20 June, 2021",
        "context": "Every so often an article comes out describing how the astronauts were alive for several minutes after the initial explosion.  What's the point?  They died tragically but heroically. Do we really need the families and loved ones of these brave people to relive their final frightening moments over and over again for 35 years?  Let them rest",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ScienceNotSuperstition",
        "time": "20 June, 2021",
        "context": "The Challenger disaster occurred because bureaucrats didn't listen to engineers - who told them not to launch. This is also how the unstable Boeing 737 MAX was produced. Engineers told Boeing's bean counter management that a new airframe should be designed to compete with the Airbus A320neo, but they were told to modify the 1960's era 737 instead to save money.",
        "good": "27",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "👑QueenBiden👑",
        "time": "20 June, 2021",
        "context": "Thanks for the info we already knew about.",
        "good": "3",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "jbrob36",
        "time": "20 June, 2021",
        "context": "Good to see the consistency of Dan Rather ... a moron then and a moron now.",
        "good": "13",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tpc",
        "time": "20 June, 2021",
        "context": "Whatever else is true or not true about this article, the idea that Regan did this to boost his re-election chances ,is laughable. ",
        "good": "8",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "iwillnotcomply..",
        "time": "20 June, 2021",
        "context": "I watched it happen in real time no need to read about it.. god bless challenger and her crew....you will never be forgotten...",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "vetterinchief",
        "time": "20 June, 2021",
        "context": "I did a double take on this story. I thought is was well-established that the crew was likely alive  as the crew compartment fell to earth. It is unforgivable that NASA did not provide for crew safety in case of a mishap. Space shuttle flights were the most dangerous according to their safety records.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "azr61",
        "time": "20 June, 2021",
        "context": "People will write anything for a buck. Most of this info was already known.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "joey_brown",
        "time": "20 June, 2021",
        "context": "Crew surviving explosion is nothing new. This came up about a year after the incident, but was quickly squashed by NASA. I remember this well, because quite a few people where I worked at heard the same thing.",
        "good": "22",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "grogersh",
        "time": "20 June, 2021",
        "context": "I had just finished AF basic training and was in tech school in Denver Colorado when this happened.   I will never forget the sadness I felt in my heart when I heard the news.  I remember asking the instructor was this the one with the teacher?  He said yes, and the entire class went silent.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "johnny421",
        "time": "20 June, 2021",
        "context": "There was no surviving this accident.  The same thing could happen with every rocket we send up.  It is unavoidable.  If there is a breach like this, a Space-X rocket will explode and kill everyone aboard just as easily.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Igloo",
        "time": "20 June, 2021",
        "context": "Nothing new here.  I’m surprised they didn’t discover it was Trump”s fault.",
        "good": "20",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jjjjjj",
        "time": "20 June, 2021",
        "context": "I do believe that nothing happens unless the Lord allows it.  Consider an alternate hypothesis. On both the shuttle Columbia,  where the entire crew was vaporized upon re-entry, and the Challenger disaster, there was a woman onboard who left a son on Earth.  How far away is too far to be just? Perhaps other men need to respect that and not take that which has been devoted to another, especially a child. Just asking.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "RedPlane",
        "time": "20 June, 2021",
        "context": "Liberals run the space program. They make perfect space cadets. What a waste of life and money.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "🇺🇸🇺🇸🇺🇸PATRIOT🇺🇸🇺🇸🇺🇸",
        "time": "20 June, 2021",
        "context": "And now Joe Biden is sitting at the same desk as Reagan…unbelievable. Reagan still has more wherewithal to this day.",
        "good": "37",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "brewistmonk345",
        "time": "20 June, 2021",
        "context": "This was \"news\" in 1987.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sandyc777",
        "time": "20 June, 2021",
        "context": "In 1986 I watched Christa McAuliffe blast off while in the company of Christa's brother in law who was a school principal at a special needs facility. Our whole staff and small student body were present with TVs set up in the classroom. When the explosion occurred we, the staff, were frozen horrified but the young students, mostly with Down Syndrome, where cheering at what they thought were fireworks. Trying to gently explain the tragedy to these children while comforting Christa's brother in law was heartbreaking.",
        "good": "201",
        "bad": "13",
        "replies": []
    },
    {
        "user_name": "dinglehopper",
        "time": "20 June, 2021",
        "context": "The capsule the crew was sitting inside did not explode. It was ejected\nand sadly enough  Nasa cheeped out and eliminated the escape parashot portion of the space shuttle. And when the next shuttle blew up no working escape pod then either.",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "ThePeoplesPeople",
        "time": "20 June, 2021",
        "context": "Click Bait - we all knew this decades ago. Anything to make a buck. Even rehashing dead stories.",
        "good": "8",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "interrayshullovintomaga",
        "time": "20 June, 2021",
        "context": "... a Bud Light",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "depalma13136",
        "time": "20 June, 2021",
        "context": "Ummmm....everyone knew they survived the initial explosion in 1986.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "DinkerbertOgelhump",
        "time": "20 June, 2021",
        "context": "that's one hell of a roller coaster ride.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "interrayshullovintomaga",
        "time": "20 June, 2021",
        "context": "...Head & Shoulders",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "edmondosnk",
        "time": "20 June, 2021",
        "context": "That's no revelation...what a crock of. story and probably more of waste of a book, too.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "frontman",
        "time": "20 June, 2021",
        "context": "A nice way to profit on tragedy, and to claim that the crew “may” or “likely” have been conscious for a few additional seconds adds a ghoulish twist to increase interest, sales, and cash. No one knows how quickly they died, and any suggestion is nothing more than a WAG. And of course, the focus was always on McAuliffe, who was the least skilled and least qualified person on the mission. The other names are forgotten, despite the fact that they had dedicated decades of study, hard work, and still needed more than a little luck to become astronauts. In the 80’s, these people’s odds of becoming astronauts and going on a shuttle mission were  even greater than McAuliffe’s.",
        "good": "28",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "#guncontrol",
        "time": "20 June, 2021",
        "context": "Not new information",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "irasmatter",
        "time": "20 June, 2021",
        "context": "All they needed was a temp sensor to flash red on a control panel instead of an ambiguous guideline in some manual. The engineers who claimed to know the likelihood of O-ring failure below a certain temp should have never allowed that ambiguity to exist in the launch procedure. It was a huge mistake to treat temperature as a vague guideline as opposed to  a hard stop on the launch.",
        "good": "18",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Liberty-over-fear",
        "time": "20 June, 2021",
        "context": "Here is the worst thing. NASA still has not learned from the Challenger or Columbia.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "seeleenick",
        "time": "20 June, 2021",
        "context": "\"The announcement sounded pure, but the program was really a gambit to bolster the president’s reelection chances.\"  There was no need to read past that point.  Taking every opportunity to smear President Reagan spoils whatever value the author's work might have held.",
        "good": "47",
        "bad": "3",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "radiac",
        "time": "20 June, 2021",
        "context": "I thought well  it finally happened. Something was going to happen one day.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "native44234",
        "time": "20 June, 2021",
        "context": "It has been known since the capsule was located that they were alive when they hit the water. This is not new information. The smoke trail remained in the air for hours and could be seen all across Florida. It was a tragedy that was attributed to the arrogance of the NASA Officials that ignored the recommendations of the engineers who did not want to launch in the cold weather.",
        "good": "11",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "seanseamus522840",
        "time": "20 June, 2021",
        "context": "Nothing new here. No ‘shocking’ revelations. Must be a slow news day. American media sucks.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "error": "error"
    },
    {
        "user_name": "dereg80s",
        "time": "20 June, 2021",
        "context": "This happened  due to political interference forcing NASA to make many more unnecessary manned flights than engaging in true R&D",
        "good": "3",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "joyfulone",
        "time": "20 June, 2021",
        "context": "John Paul Jackson, a prophetic man, had a vision from God in the weeks  prior to the Challenger exploding. He contacted NASA and told them in detail what God had shown him about this mission ending in an explosion. He warned them and urged them to fix certain things. No one would listen to him, perhaps thinking he was nuts.",
        "good": "3",
        "bad": "5",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "Liberty-over-fear",
        "time": "20 June, 2021",
        "context": "There is nothing new in this. All of this was in the Presidential Commission Report (Rogers Commission) in 1986. It is well known the at least some of the crew, including the pilot and commander survived to impact, if not all the crew, based on settings, switches and air use. \n\nThe explosion of the Fuel tank was not what destroyed the Shuttle, the Explosion was well below the limits of the shuttle's structural tolerances. Rather she ripped apart as her vector went off axis of the air-stream at supersonic speeds, IOW it's speed ripped her apart when she was not longer pointed into the airflow.\n\nThis disaster remains THE case study in engineering failures, from the programmatic level right down to the technician.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "JIMBOC733",
        "time": "20 June, 2021",
        "context": "This was NASAs fault through and through. After receiving MULTIPLE complaints about the high probability of O ring failure, they launched anyway. That’s the true story. Do your research. ",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mpilot",
        "time": "20 June, 2021",
        "context": "Has the term \"Rest in Peace\" ever hit anyone's brain cells?  Why would you bring this terrifying thought to the families of these brave astronauts?  Are you that insane?  That much of a narcissist?  That greedy to profit off someone else's tragedy?  Whoever wrote this book and article for Fox needs to be taken out in front of firing squad and executed.  YOU people are downright CRUEL!!!!",
        "good": "7",
        "bad": "12",
        "replies": []
    },
    {
        "user_name": "danfromthenorth722",
        "time": "20 June, 2021",
        "context": "i was a young engineer, first year out of college working at Marshall Space Flight Center in Huntsville that day.  We were working on other things that morning because we thought the flight was scrubbed due to cold.  Media heads like Rather shamed NASA for repeated launch delays.  The day before the launch members of Congress started investigation into the costly launch delays.  Within hours after the loss of Challenger these same people were shoving cameras and microphones at people at NASA asking if we felt undue pressure to launch considering the weather.  The hypocrisy and lecturing from these people was shocking.  I've been cynical of the media ever since.",
        "good": "53",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "QuePasaUSA",
        "time": "20 June, 2021",
        "context": "I remember watching the explosion in 8th grade. A week later the joke NASA stands for Need Another Seven Astronauts started floating around school. One of the kids said the joke in class and we all got detention. Things you remember.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "robertowallace",
        "time": "20 June, 2021",
        "context": "“Goodbye...uhhh....ahhh...I’m getting lost again....”—Senile Joe",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "bobbybiggz",
        "time": "20 June, 2021",
        "context": "A near instantaneous jump to 20 g's is far more than enough to render all on board unconscious, which is actually what happened. Flipping switches, trying to gain control of the aircraft after the explosion is pure nonsense. They were unconscious from the moment it exploded.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "skinflintstone",
        "time": "20 June, 2021",
        "context": "Seriously? The writer thinks 3 months away from the election President Reagan needed a 'gimmick' to bolster his reelection chances? At that time he was pretty much a lock to win every state except Mondale's home state of Minnesota.",
        "good": "86",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "l.James(Bo)Thornburg",
        "time": "20 June, 2021",
        "context": "This \"information\" that the crew survived for several seconds or until water impact has been around since a few days after the mishap.  But if you can write a book, or Fox can get a click, let's run it out there again, although it benefits no one.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jppcasey1",
        "time": "20 June, 2021",
        "context": "I was sitting in the \"day room\" of my barracks with a couple of buddies watching this live.  It was shocking; it was one of those life events you never forget.  \nIn my opinion, they died the second the external tank exploded.  It had over 1.5 million pounds of fuel in just that one tank alone.  The idea of them surviving the explosion and being conscious while falling with the other debris in to the ocean is simply not true.  Just because it sells advertisement and makes good documentaries, doesn't make it true.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "From_the_desk_of_🍊🤡",
        "time": "20 June, 2021",
        "context": "Reagan's fault .. he pushed for the launch despite engineers stating it was unsafe",
        "good": "0",
        "bad": "11",
        "replies": []
    },
    {
        "user_name": "politicalzoo",
        "time": "20 June, 2021",
        "context": "As Kennedy Space Center director Bob Cabana said later, \"It was like they were saying, ‘We want to forget about this.’ \n\nYeah... you just devastated tens of thousands of young school kids who were watching live... not really something you want to hash out in the public...\n\nI won't forget the shock that day.... prepared me for 9/11.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "gringostar",
        "time": "20 June, 2021",
        "context": "The article is a BOOK REVIEW for heaven's sake.  It is not intended to be breaking news.",
        "good": "10",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "gatedfox",
        "time": "20 June, 2021",
        "context": "I was a mere lad in High School when this happened and my Science teacher was in the final 10 candidates. He thought for sure he would be the one selected since he was the only remaining science teacher. When the Challenger exploded he told us his life changed forever. We often would see him weeping in class as the final candidates had grown very close. Very sad event.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "robertowallace",
        "time": "20 June, 2021",
        "context": "“Where’s the cat?”—Senile Joe looking for his German Shepherd Dog, Chuck",
        "good": "3",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "stephentroup7777",
        "time": "20 June, 2021",
        "context": "The only think I learned from this is that 3 of the crew's air tanks had been toggled on.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "robertowallace",
        "time": "20 June, 2021",
        "context": "Did the black guy die first?",
        "good": "1",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "robertowallace",
        "time": "20 June, 2021",
        "context": "“What’s this button for?”—Christa MacAuliffe",
        "good": "1",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "buurga",
        "time": "20 June, 2021",
        "context": "Did you notice the trash on Reagan. He cut funding to the NEA (ALL RIGHT RON!), so his backing of a teacher was strictly political. Nice balanced reasoning ................LOL.",
        "good": "7",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "dirtybird",
        "time": "20 June, 2021",
        "context": "I had left a five-gallon bucket half filled with water in front of my shop the day before which was frozen solid that morning. Stopped at a traffic light on the corner of Lake Worth road and Military Trail, I saw the Challenger streaking across the sky. A split second later I watched it explode. It was one of those things that you can’t un-see. \n\nLake Worth, Florida 01/28/86 was a very sad day.",
        "good": "38",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "🐧thereisagod2⭐",
        "time": "20 June, 2021",
        "context": "FAKE NEWS",
        "good": "0",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "interrayshullovintomaga",
        "time": "20 June, 2021",
        "context": "If you want a truly interesting account of this, read Nobely, sciency,  O-ring in ice water demo dude’s account in the book “What Do You Care What Other People Think?” about his stint on the Rogers Commission.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "burner011",
        "time": "20 June, 2021",
        "context": "How is this new? We have known this for years. The last I checked you could still hear their final words after the explosion prior to the crew cabin hitting the water. ",
        "good": "9",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Dementia-Joe",
        "time": "20 June, 2021",
        "context": "Every single one of the crew members is alive today. NASA is a national disgrace",
        "good": "0",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "anyDimisathreattotherepublic",
        "time": "20 June, 2021",
        "context": "This is what happens when you \"throw caution to the wind\" because your'e getting hammered by the media....they want their \"show\"",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ivankasloppyseconds763",
        "time": "20 June, 2021",
        "context": "This is not new information.",
        "good": "13",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "youcan'tmakeitup!!",
        "time": "20 June, 2021",
        "context": "Facts matter.  The solid booster didn’t “leak” fuel.  They’re called solid boosters because the fuel inside is well, solid, It can’t leak!  The exhaust blew by/around/through the O ring similar to a blow torch.  Worse, this occurred on the inboard side of the booster adjacent to the external fuel tank.  Once this flame burnt through the tank it ignited the fuel (which was liquid) in the external tank causing the explosion.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "txgal57",
        "time": "20 June, 2021",
        "context": "Heard for years the crew was alive for a bit after explosion.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "robertowallace",
        "time": "20 June, 2021",
        "context": "She sounds like a real piece of work.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "robertowallace",
        "time": "20 June, 2021",
        "context": "Joe Biden thinks Challenger is a stool softener.",
        "good": "9",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Dannyy123",
        "time": "20 June, 2021",
        "context": "One of the main causes is something called Group Think. With the previous launch cancellations and “embarrassments’ said by Loser Dan Rather, the launch control discussed in detail; should we launch after a freeze.  The loud mouths took control so there were ‘no more embarrassing’ cancellations and the rest “went along with the crowd’ , now termed Group Think ",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jerrylb",
        "time": "20 June, 2021",
        "context": "This is not something new.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "CyanBattery",
        "time": "20 June, 2021",
        "context": "The media...including RATHER...wanted to embarrass Reagan.  Just another clear example of media propaganda against conservatives.",
        "good": "9",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "yourmomwilladoreme",
        "time": "20 June, 2021",
        "context": "Every person that has undergone a serious Surgery has accepted a certain amount of risk that they will not survive. These Astronauts were not 'heroes', God bless them but they knew the risk of being strapped to what is in essence a bomb. Do we talk about the first people that drowned attempting to cross the ocean to find North America...?",
        "good": "2",
        "bad": "7",
        "replies": []
    },
    {
        "user_name": "Marlin",
        "time": "20 June, 2021",
        "context": "Space is dangerous. This is why humans will never go to Mars, Elon Musk not withstanding.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "midwestmom648",
        "time": "20 June, 2021",
        "context": "I’ll never forget where I was when this tragedy occurred.  My co-worker brought his little color TV to work.  We all watched what happened live. The comforting message from Reagan is what truly distinguishes him as the great orator.  ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "robertowallace",
        "time": "20 June, 2021",
        "context": "“Whatchu talkin’ ‘bout, Willis?”—black astronaut",
        "good": "0",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "jppcasey1",
        "time": "20 June, 2021",
        "context": "They died instantly.  They were sitting on 1.5 million pounds of liquid fuel.  This phony theory that they survived the explosion comes up every year.  It's used as clickbait to sell advertisements, and to make documentaries.  Let them rest in peace.",
        "good": "4",
        "bad": "7",
        "replies": []
    },
    {
        "user_name": "irlfan1",
        "time": "20 June, 2021",
        "context": "I certainly hope that the book is more accurate than this error ridden article, but I doubt it.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "recoveringdemocrat",
        "time": "20 June, 2021",
        "context": "Absolutely nothing new in this article. It's been known since shortly after the accident that they likely survived the explosion and that oxygen masks had been deployed, indicating that at least some of them were alive during the descent to the water.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "muellerfail",
        "time": "20 June, 2021",
        "context": "Investigation decades ago revealed engineers knew this could happen in cold weather.\nAs stated in the article, they warned the NASA managers.\nIt was well documented. But the managers didn't listen to the engineers.\nNow that Democrat social engineering has NASA putting \"diversity\" ahead of competence, these preventable tragedies will likely happen again, as merit takes a back seat to Democrat vote buying and manipulation.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "robertowallace",
        "time": "20 June, 2021",
        "context": "Affirmative Action kills again....",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "robertowallace",
        "time": "20 June, 2021",
        "context": "What did the President of Guatemala say first to Kamala Harris when she landed?\n\nTrump Won, the Border Crisis is your’s and Sloppy Joe’s fault, and you ain’t really even black!”.",
        "good": "7",
        "bad": "2",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "dontbeajerk2019",
        "time": "20 June, 2021",
        "context": "Sooo the government was even LYING back in 1986. Take your vaccination like a good little boy and sit down. FOOLS!  When someone pushes me too hard for me to do something I get suspicious.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "robertowallace",
        "time": "20 June, 2021",
        "context": "Stolen elections have consequences.",
        "good": "2",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "sawyerjanuary",
        "time": "20 June, 2021",
        "context": "Way to badmouth someone who isn't here to defend herself: A \"chubby Girl Scout with no knack for science or math\"; chosen for the flight \"because she'd be good on the Johnny Carson show\" (this from a fellow teacher who lost out to McAuliffe.) Sour grapes much? And the whole idea was a campaign stunt by President Reagan to grab teachers' votes?? Smear campaign wrapped in ghoulish sensationalism. Sounds like this disaster of a book was written by a misogynistic liberal loon.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "robertowallace",
        "time": "20 June, 2021",
        "context": "What do Cicadas and Slow Joe have in common?\n\n\nThey all recently crawled out from their holes after doing NOTHING for almost 20 years and now are making messes everywhere they go.",
        "good": "8",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "PurpleCar",
        "time": "20 June, 2021",
        "context": "Whole elementary school was watching. Then we got sent home",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "the_shadow",
        "time": "20 June, 2021",
        "context": "Money, its always about money.  It always amazed me they had NOTHING, when every vehicle before it had a parachute. yes the shuttle was large,  but the crew compartment could/should have been designed to eject .  With all the money this country wastes on nonsense, (and always has) they couldn't put in a parachute for these people.  Politicians, not engineers made these decisions.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "CyanCherries",
        "time": "20 June, 2021",
        "context": "I remember that day.  I live in Houston now and had the unfortunate honor of helping recover Columbia debris a few years back. \nAll heroes.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "callwalker",
        "time": "20 June, 2021",
        "context": "This has been known for many years. It's not anything new.",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "marginal",
        "time": "20 June, 2021",
        "context": "This article was more of an advertisement than anything else.",
        "good": "4",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "BidensPrompter",
        "time": "20 June, 2021",
        "context": "nothing new, lame article",
        "good": "1",
        "bad": "3",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "error": "error"
    },
    {
        "user_name": "gladtobeouttanj",
        "time": "20 June, 2021",
        "context": "Was on the USS Coral Sea in the Mediterranean when Petty Officer Smalls came into forward IC to inform us of this tragedy. We would go on to bomb Libya a few months later after our deployment was extended a month.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mikeymacd",
        "time": "20 June, 2021",
        "context": "Back when teachers weren't teaching kids to hate America, believe genetic science is a \"social construct\", and focus on skin color first and the person themself, second.",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "*cynic*",
        "time": "20 June, 2021",
        "context": "This is what happens when management overrides safety protocols.",
        "good": "26",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dontbeajerk2019",
        "time": "20 June, 2021",
        "context": "I am from the government and I'm here to help you. Yea, I bet.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "jppcasey1",
        "time": "20 June, 2021",
        "context": "\"An investigation later concluded the jump in G-force was \"survivable, and the probability of injury is low.\" \"   Yeah ok!  Yeah right!  An instant increase of 20g's would blow your brains out.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "lookthruthesmoke",
        "time": "20 June, 2021",
        "context": "ALL useless speculation. Would of, Should of, Could of.\nIf you enjoy this kind of \"investigative journalism\" watch \"Ancient Aliens\"",
        "good": "4",
        "bad": "2",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "muellerfail",
        "time": "20 June, 2021",
        "context": "Reed Tucker of the New York Times... seems more likely.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "havamal",
        "time": "20 June, 2021",
        "context": "The eye opening thing about this look back in history is how much better the reporting was. If this happened today the Florida cold snap that affected the O-rings would be blamed on climate change and the defect in the O-rings would be tangentially blamed on trump because he invested in the company once in 1978.",
        "good": "38",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "quadratic",
        "time": "20 June, 2021",
        "context": "I watched the Blue Ribbon committee that Ronald Reagan appointed. The 'O' Rings were supposed to be reusable. \nThey were burning through but not all the way so they were they were replaced every flight.  And of all things, an accountant brought this issue up. Why are we buying new 'O' rings for each flight? \nNobody listened to him.\nBoosters then had a double 'O' ring, to prevent future burn through.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bidensarebusted",
        "time": "20 June, 2021",
        "context": "Most people consider \" Wokeness \" as a leftist ideology, however after reading this story , I realised that Reagan was being quiet \" Woke \" by pushing for a non Astronaut and especially a female to participate in the Apollo mission. Ironically, trying to gain political points to benefit your public approval ( eg. Kamala Harris ) eventually leads to disaster.",
        "good": "6",
        "bad": "9",
        "replies": []
    },
    {
        "user_name": "laurentianabyssal",
        "time": "20 June, 2021",
        "context": "Not sure there’s anything new here. There’s lots of data that says the crew were alive until hitting the ocean. An interview with Story Musgrave is very telling.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "interrayshullovintomaga",
        "time": "20 June, 2021",
        "context": "...Need Another Seven Astronauts",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "nap51d007",
        "time": "20 June, 2021",
        "context": "Thanks Dan Rather & the rest of the media for pushing them to launch.  Also, thanks NASA for thinking going to space isn't dangerous.  To quote a famous line from the disastrous Apollo 1 tragedy, everyone had \"go fever\"  they didn't learn from Gene Kranz, by saying NO if something didn't look right.",
        "good": "38",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "EAlbee",
        "time": "20 June, 2021",
        "context": "the Dan Rather quote is kind of interesting.  \nI understand that the press had it out for Reagan and probably did not want this to succeed.",
        "good": "21",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "tommariner",
        "time": "20 June, 2021",
        "context": "Five Space Shuttles were built, two failed killing all aboard. It cost half a billion dollars to get each flight refurbished for the trip to the ISS 254 miles up.\n\nTwo decades before the Challenger disaster, Long Island, NY had built 15 Lunar Excursion Modules (LEM)'s to go the 237,000 miles to the Moon. Ten flew, all returning their crews safely. \n\nThen a more powerful Senator grabbed the Space Bucks for his State, we forgot what we had learned on Long Island and got the Shuttles. Hey, the large airplane did its job helping get the Space Station built, but how much faster, how much safer would it have been if our \"winner takes all\" military procurement had left the LEM folks in the game?",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "lima533",
        "time": "20 June, 2021",
        "context": "My 7th grade class watched it all live on tv.  We all prayed for them as a class after the disaster.  Nobody complained about praying",
        "good": "23",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Silencedogood790",
        "time": "20 June, 2021",
        "context": "All of this is old news. The crew was aware of the situation and responded to training. \nWhy now?",
        "good": "8",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "thewhiteone",
        "time": "20 June, 2021",
        "context": "I’ve gotten over this tragedy years ago and now fox is digging up old memories now I’m suffering from ptsd I need therapy",
        "good": "5",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "IronHead38",
        "time": "20 June, 2021",
        "context": "So, it was Dan Rather's fault the launch wasn't delayed again.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "patriotcomm1",
        "time": "20 June, 2021",
        "context": "Old news, no new info in this article despite the click-bate headline. Try publishing this at the end of January near the actual anniversary. Publishing this in June seems random and lazy.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jvgman216",
        "time": "20 June, 2021",
        "context": "Kevin Cook seems to gloss-over that before President Reagan announced the intent to select a teacher for the space program's new mission that there were two other non-astronauts who took advantage of the opportunity. Sen. Jake Garn (R-Utah), and Cong. Bill Nelson (D-FL), both on their respective bodies' Science & Technology Committee were the beneficiaries. The rumor was that they started the entire mission program's foundation. The underlying error in the entire mission is that the space program itself, despite the public perceiving it as a routine operation, was and still is highly experimental in its basic nature. Astronauts accept the risk of that fact. (Alan Shepard quipped that it's pretty scary to sit on the launch pad and realize the whole thing was built by 'the lowest bidder.') I'm not certain that McAuliffe really grasped the fact.  Garn and Nelson both got their 'ride on the space shuttle' and NASA (to McAuliffe's detriment) was pressed into making the mission launches PR events rather than the complex engineering experiments they actually are. Nelson, recently named NASA Administrator by Pres. Biden, was chastised by Gus Grissom's widow (Betty) when his 1st Senate campaign described him as 'an astronaut' despite not meeting the criteria for the title that were in place at the time. In true political fashion, the criteria were changed so that 'Mission Specialist' is now considered an \"Astronaut.\" Fundamentally, both Garn and Nelson were PR cargo on the Shuttle.",
        "good": "32",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Joe948",
        "time": "20 June, 2021",
        "context": "And only the wrong people were punished.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "thewhiteone",
        "time": "20 June, 2021",
        "context": "Nothing new to report so let’s report something old",
        "good": "7",
        "bad": "7",
        "replies": []
    },
    {
        "user_name": "lookthruthesmoke",
        "time": "20 June, 2021",
        "context": "It took 410 days from ground breaking to completion to build the Empire State Building.\nThat would be impossible today, even with our advanced technology.\nWe no longer have the will or the drive to accomplish great things.\nOur generations of heroes is over. We are now in the \"Cry baby\" generation. They believe EVERYTHING \nis owed to them, and they own no responsibility to the future.\nThey are going to learn the hard way that everything you have is temporary, and if you are not willing and able to fight to keep it you will not have it long.",
        "good": "91",
        "bad": "8",
        "replies": []
    },
    {
        "user_name": "village24green",
        "time": "20 June, 2021",
        "context": "Everyone knew this was staged to create outrage and disdain, and channel interest toward soviet Mir space station",
        "good": "0",
        "bad": "10",
        "replies": []
    },
    {
        "user_name": "keepprintingmoremoney",
        "time": "20 June, 2021",
        "context": "I meant a Bud Light.",
        "good": "0",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "im_gumby",
        "time": "20 June, 2021",
        "context": "This isn't new and something that was known but not talked about back when it happened.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "pagana",
        "time": "20 June, 2021",
        "context": "Yeah, what's the point of this conclusion? Dead, is dead.",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "rustywatts",
        "time": "20 June, 2021",
        "context": "I remember national stress relief through terrible jokes:\n\nDo you know why the astronauts did not shower before launch?  They knew they’d wash-up on the beach.",
        "good": "0",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "ERock",
        "time": "20 June, 2021",
        "context": "Yawn.  Old news being regurgitated as new news. They also knew about the leak & the extreme probability of it going “boom” …just another DS/NASA “nothing to see her” burger",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ra2013532",
        "time": "20 June, 2021",
        "context": "If the shuttle had an emergency parachute system, they might have survived.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "TowerOne",
        "time": "20 June, 2021",
        "context": "BLM is trying to figure out how to explain how a black man in 1986 could possibly be part of this crew.   With all the oppression BLM claims and teaches, how could this have happened???",
        "good": "24",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "victimseverywhere",
        "time": "20 June, 2021",
        "context": "This was what a victim looked like pre-#Metoo era",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "morlock1000",
        "time": "20 June, 2021",
        "context": "“ Down on the ground at Mission Control, a computer screen indicated falling pressure in the right booster rocket. It was leaking fuel.” Not a very accurate description of the shuttle launch system. The booster rockets on either side of the shuttle are solid fuel rockets, which is the consistency of a rubber tire. It doesn’t leak once it’s cast in place. The damaged o ring did allow the rocket exhaust to vent sideways from the booster like a cutting torch into the main fuel tank that did contain liquid fuel.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ARHinVA172",
        "time": "20 June, 2021",
        "context": "Not sure what is new info here.  The fact that the emergency air pack were activated was admitted by NASA in 1986.  And it isn't a surprise that the crew compartment held together - it was designed to remain pressurized, so it had quite a bit of structural integrity.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "justiceneedsserved",
        "time": "20 June, 2021",
        "context": "\"Uh oh,\" he said.\n\nWhenever I hear those words I cringe.  I have a couple of pre-teen grandsons that say that once in awhile when we are doing a project together......It never turns out to be a stroke of genius",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "robertkearney45",
        "time": "20 June, 2021",
        "context": "I'll never forget that. I was at work alone watching a whole bank of TV screens. It took me a moment to process what I had actually seen. Very similar to 911 and watching the second plane hit the tower, also at work but watching it via computer.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Istenem!",
        "time": "20 June, 2021",
        "context": "The news media at that time announced  that the voice recordings revealed human suffering on the way down. We all knew they had survived the initial  blast and most were killed on oceanic impact. Tragedy caused by vanity.",
        "good": "7",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "d.b.cooper'sghost",
        "time": "20 June, 2021",
        "context": "Apart from this being old news if NASA's management let journalistic hacks like Dan Rather influence their decision to launch then they were a special blend of stupid.  \nFortunately it all came out in the wash with Dan after the George W. Bush Air National Guard debacle exposing him for the hack shill journalist he truly was.  Of course few even watch CBS anymore but firing Dan was the best thing they ever did!",
        "good": "13",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "tsb8c",
        "time": "20 June, 2021",
        "context": "I was working at NASA in Houston when this happened. I was standing in the Mission Control Room right behind the Flight Director's console watching the launch. I saw video not transmitted to the public during the explosion. The crew module did not explode and the interior camera was still in tact a few seconds after he explosion occurred. I saw crew members reaching under their seats to open valves on emergency oxygen tanks, and also saw flames eventually breach the floor of the module before the video went out.",
        "good": "10",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Fncisnumber1",
        "time": "20 June, 2021",
        "context": "The Challenger was already breaking up when the hydrogen ignited. This was all in the official NASA report. But, the media never bothered to read it, or look at the pictures which show all this happening for the illiterate.  Once the strut that held the solid rocket burned through, the ship was no longer aerodynamic enough to resist the forces on it, so it started to come apart. ",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "bbows",
        "time": "20 June, 2021",
        "context": "I was in sixth grade math class, watching this launch live on the TV they wheeled in from AV lab. I remember this day like it was yesterday. RIP",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "hal09i",
        "time": "20 June, 2021",
        "context": "The only thing surprising here is that this info is being peddled as new. It's not. It's a fact that's been known for years.",
        "good": "9",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Whitelightning777192",
        "time": "20 June, 2021",
        "context": "I was in 6th grade. No one said a word. You could hear a pin drop.  We watched it live. I thought it looked like sabotage until the truth came out. RIP my fellow Americans. ",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "evilgnome",
        "time": "20 June, 2021",
        "context": "In June, 1982, I had the opportunity to watch Columbia launch from just three miles away.  My friend's dad worked for NASA, and employees' families had special viewing privileges at a nearby location.  Only the press corp was closer than us.  The launch had a sight, sound and feel I will never forget!  Words can't describe the experience, and I am forever grateful.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "BlueCone",
        "time": "20 June, 2021",
        "context": "On that day I went home for my lunch break so I could watch the blast-off live. I wish I wouldn't have.. One of those things you never forget",
        "good": "7",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "trollonfire2",
        "time": "20 June, 2021",
        "context": "I myself am not buying the shrunken o ring nonsense. Do the Clintons have an alibi for that day?",
        "good": "11",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "UPNorth906",
        "time": "20 June, 2021",
        "context": "This theory is nothing new.  I have seen it in documentarys in the past.  The crew cabin was desined to withstand major stress of flight and possible crash when tryint to land.   They likely were not awake during the fall as the G-Force would have knocked them out.\nAlso, what diference does it make now.",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "richn74",
        "time": "20 June, 2021",
        "context": "It seems Christa McAuliffe’s courage and dedication to her students has been lost on some of today’s teacher’s union leaders. She was the consummate teacher putting her love for her students ahead of her own safety concerns.",
        "good": "67",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "dammitbobby",
        "time": "20 June, 2021",
        "context": "So, NASA is on this diversity campaign, yet, there were two women and a black guy who were on that shuttle.",
        "good": "14",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jo48",
        "time": "20 June, 2021",
        "context": "Dan Rather, the smirking rebel hero of the useless Left.",
        "good": "16",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "RandyRhoadsPilot",
        "time": "20 June, 2021",
        "context": "AOC survived the Challenger blast.. she’s still seeing a therapist about it…,",
        "good": "14",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "we’reisthestimuluschecks",
        "time": "20 June, 2021",
        "context": "JFK jr is still alive look into this challenger crew and the truth will be there ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Drewcifer",
        "time": "20 June, 2021",
        "context": "What a wonderful thing to share NOW. Or did it just take this long for an official opinion to be formed?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "krozenek",
        "time": "20 June, 2021",
        "context": "I was in high school.  We watched this happen on TV in science class.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "corona22",
        "time": "20 June, 2021",
        "context": "They did a John Kennedy jr..",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "themilkhasgonebad",
        "time": "20 June, 2021",
        "context": "This happened the year I was born so while I don’t remember it I studied it. At that time all I heard about Challenger it was the teacher on board. Because you were being taught by teachers so obviously that was huge for them. Not an interesting story, horrible result, and certainly not relevant to the world. It took, I believe two more blow ups before NASA scrapped the shuttle program so this was hardly a revolutionary flight. Frankly, sad and boring is how I’d describe Challenger.",
        "good": "2",
        "bad": "9",
        "replies": []
    },
    {
        "user_name": "whyfor",
        "time": "20 June, 2021",
        "context": "Likely survived explosion?  NASA said this in 1986.",
        "good": "18",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "GoldSubmarine",
        "time": "20 June, 2021",
        "context": "With electronic media SO  SECURE!.  our banking is never going to be attacked, YaI know some banks have been hit, I know a pipeline has been hit, an electric grid or two, a few businesses.  Biden had a list of 16 (sixteen) cyber attacks Russia was not allowed to hit. Did you hear me 16 No-No's. Was banking one of them? Biden tough, \n  Court packing,  They will need the \"Kids table\" because they, Well they are liberal Kids coming.\nKnowing UFO's are bringing (?) people who are much smarter than us, But at this time we best call them people of color and find out if they are gay.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "hateseveryone",
        "time": "20 June, 2021",
        "context": "I'll never forget that day sitting in 10 grade biology class. God speed Heroes.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jboh",
        "time": "20 June, 2021",
        "context": "[\"CBS anchor Dan Rather called ‘today’s high-tech low comedy’ an embarrassment,...]\n\nDan Rather...talking about embarrassment...that's rich!",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "gedwards808",
        "time": "20 June, 2021",
        "context": "The only surprising thing is the length of the article with no surprises",
        "good": "5",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "Eaglesnest13",
        "time": "20 June, 2021",
        "context": "Just goes to show the power of the Press got them all killed!!!",
        "good": "12",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "keepinitrealusa",
        "time": "20 June, 2021",
        "context": "Not sure why this is news. This has been known since right after the accident in 1986. In fact, my teacher in school around that time held a stopwatch up for the class to demonstrate how long the astronauts were alive until impact with the water.\nIt was awful. They knew they were going to die. RIP 🇺🇸",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dachshundsrule",
        "time": "20 June, 2021",
        "context": "That was one of the three saddest days I can remember. You never forget what you were doing when the news came across, much like Kennedy's assassination and 9/11.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "chris.p.bacon224",
        "time": "20 June, 2021",
        "context": "Elon Musk to the rescue in 2021!",
        "good": "0",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "drillboss103",
        "time": "20 June, 2021",
        "context": "Dan Rather's public shaming of NASA officials into making rash decisions make him just as guilty as everyone who approved the launch.",
        "good": "13",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "falcontruth104",
        "time": "20 June, 2021",
        "context": "I don’t know how they get people to want to fly into space.  Even the smallest issue will end up getting you killed.   It doesn’t matter if you’re genius astronaut or engineer.  Issues will occur that you can’t control.   I wouldn’t set foot on a spaceship even for $100,000,000.  \nThese rich people like Bezos, wanting to go to space are insane.  They are going to risk their lives and lose everything for something they don’t need to be involved in.",
        "good": "4",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "superk55",
        "time": "20 June, 2021",
        "context": "McAuliffe -  I never should have picked up that damn brochureeeeeeeeeeeeeeeeee!!!!!!!!",
        "good": "1",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "RedTree",
        "time": "20 June, 2021",
        "context": "Netflix ran a series on this with interviews.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "moosekuteer",
        "time": "20 June, 2021",
        "context": "We saw this live on TV at my school. It took about 3 days for  the first “Head & Shoulders” joke to circulate.",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "mensa136",
        "time": "20 June, 2021",
        "context": "i was flat on my back in the hospital having just had a spinal tap and told \"do not move\"! they turned on tv for me..two minutes later the challenger exploded right before my eyes! i managed not to move but, it was tough-a  horrible thing to happen-not necessary-bowed to political pressure. i wouldn't want to be the guy who said \"what do  you want me to o launch next april\"! uh yeah..let's not kill our astronauts!",
        "good": "3",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "ric3763",
        "time": "20 June, 2021",
        "context": "I remember that day. I pulled up to a 7-Eleven store hearing this on the radio. Told this black guy about it. His reaction it was regretful.",
        "good": "0",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "maga20204life",
        "time": "20 June, 2021",
        "context": "That is reason #31 why I never wanted to ride the rocket.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Colo805",
        "time": "20 June, 2021",
        "context": "trillions of taxpayer dollars for Tang and dead astronauts ",
        "good": "1",
        "bad": "10",
        "replies": []
    },
    {
        "user_name": "posttenebraslux",
        "time": "20 June, 2021",
        "context": "Nothing in this article is not already known,  what exactly is \"untold\"?",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "LastAmericanPatriot",
        "time": "20 June, 2021",
        "context": "Old news.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "hillary’s_cankles_speak",
        "time": "20 June, 2021",
        "context": "Really??  Dredge this story up on Fathers Day?  Nice job.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "upn2dwind",
        "time": "20 June, 2021",
        "context": "My brother worked for NASA from about '63 til the mid 90's. He shared with our family that \nMission Control was in radio contact with some of the crew all the way down. I have never\nhad any reason to believe otherwise. It was his opinion that over zealous launch officials \nwere totally responsible for the failure.",
        "good": "13",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "Chasmay10",
        "time": "20 June, 2021",
        "context": "I was at sea aboard USS Coral Sea CV-43 somewhere in the Mediterranean Sea. I doubt we were watching it live. However, I remember standing in a doorway speaking with my EMO in one room and watching the TV in another. I recall seeing the explosion and from that point I don’t have any memory….Almost as if I’ve blocked it out.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "ferrulecat",
        "time": "20 June, 2021",
        "context": "Nothing in this story is a \"surprising claim\" other than body-shaming young Christa McAuliffe by referring to her as \"chubby\".  This is surprising in 2021.",
        "good": "1",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "onceanettech",
        "time": "20 June, 2021",
        "context": "I was in technical school at the time. We wheeled out one of those old carts with a TV and vcr so we could watch. It was eerie how deafening the silence was after it happened. The only thing that tops that image in my mind is seeing the towers fall on 9/11.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Morlock1",
        "time": "20 June, 2021",
        "context": "Out of respect  for the crew and their families, profiting from speculation re the crew's last moments is very wrong.",
        "good": "8",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "TakeItEasy,Baby",
        "time": "20 June, 2021",
        "context": "There is plenty of blame to go around for this disaster but I resent that it's being used as another attack by the Left. If Carter or Clinton had been president when this happened no correlation would be brought up.",
        "good": "6",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "mcpatriot1",
        "time": "20 June, 2021",
        "context": "Don't know the whole story of the Morton Thiokol o-rings, but seems to me that ANY rubber/rubberized material such as this will either totally fail or be compromised in cold (enough) temps...add to this the various and political rush/pressures to launch after so many scrubbed attempts that in the end over-shadowed anything of clear minds and common sense...that THAT's the real cause of the disaster.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mekjv1769",
        "time": "20 June, 2021",
        "context": "According to what I have read roughly 24 American lives have been lost for absolutely nothing with the NASA program.  The whole thing is an obscene waste of tax payers money.",
        "good": "1",
        "bad": "19",
        "replies": []
    },
    {
        "user_name": "CommonsenseVA",
        "time": "20 June, 2021",
        "context": "Nothing new here-reports of the air packs being turned on were made at the time.  What it does show is how well trained and brave the astronauts were, reacting to the situation by doing what they could to save everyone aboard-and how stupid NASA was to allow the launch when the O-ring makers voiced their concerns. Like Columbia, this disaster could have been prevented. God Bless all of them and their friends and families.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "prophman",
        "time": "20 June, 2021",
        "context": "My cousin trained with Christa among the 10 semi finalists. She was at the white house for the announcement. On launch day she, my Mom and aunt were watching from the VIP grandstand. I was watching from a hospital where our 1st son was born a few days before. ",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "clivusmultrum666",
        "time": "20 June, 2021",
        "context": "I recall even back then the democrat media pushed fake news trying to convince people that Reagan overruled NASA and ordered the launch....a total lie. \n\nSome things never change.\n\nSpeaking of liars, I would have enjoyed this piece much more without being reminded of or having to look at the face of the odious, lying democrat propagandist, Dan Rather.",
        "good": "17",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "neutrondog",
        "time": "20 June, 2021",
        "context": "The administration had previously cut funding to the National Education Association, leaving the group to denounce Reagan as \"America’s Scrooge on education.\" \n\nWhy was the federal government funding a teacher's union?",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "contrary7",
        "time": "20 June, 2021",
        "context": "Hope I'm alive when all the truth comes out on various conspiracies.\nI've heard another version where these dedicated astronauts are alive & well, \nand living their lives.",
        "good": "2",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "megamind960",
        "time": "20 June, 2021",
        "context": "This was a terrible day for all that watched it live. While it was found that this was a preventable tragedy, we also must remember that any manned space mission carries a huge amount of risk. May all of the Challenger astronauts rest in peace.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "lgem",
        "time": "20 June, 2021",
        "context": "Space is fake. The earth is flat. Read your Bible.",
        "good": "1",
        "bad": "15",
        "replies": []
    },
    {
        "user_name": "MrGuy1",
        "time": "20 June, 2021",
        "context": "I hope that they did not suffer, no matter how you cut it they all died doing what they loved, RIP",
        "good": "9",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "tokenposter",
        "time": "20 June, 2021",
        "context": "NASA, more or less killed those people. And the guy responsible was given a slap on the wrist. And the guy that warned against the launch was fired and called crazy at the time.",
        "good": "13",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "BidensPrompter",
        "time": "20 June, 2021",
        "context": "Still waiting for the surprising claim.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "bpowell",
        "time": "20 June, 2021",
        "context": "Another fox headline blunder. What is untold here?",
        "good": "0",
        "bad": "3",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "FigNooton",
        "time": "20 June, 2021",
        "context": "I was in high school at the time and watching it from the cafeteria during lunch. When the explosion happened, the room went silent. It was my senior year moment I won’t forget. ",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "thefishguy",
        "time": "20 June, 2021",
        "context": "Didn't know O rings caused the problem. I don't understand why they couldn't find something more durable. I mean head gaskets can with stand below Zero weather and then up 5000 degree in a matter of a minute and I have never had one fail on me, even after a 100k miles.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sunfun",
        "time": "20 June, 2021",
        "context": "NASA ..Need Another Seven Astronauts ",
        "good": "1",
        "bad": "9",
        "replies": []
    },
    {
        "user_name": "mo11",
        "time": "20 June, 2021",
        "context": "Ignore safety protocols so a politician can get some glory.",
        "good": "2",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "Misfit",
        "time": "20 June, 2021",
        "context": "The only astronaut that they think survived the blast was smith. Since the medical monitor showed him inhaling and exhaling O2. The O2 system is diluted demand and O2 can only be delivered to a person by lung force. It’s not free flowing O2. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "fratbiggit",
        "time": "20 June, 2021",
        "context": "The strong likelihood of this has been known from the start.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mistyshorthair",
        "time": "20 June, 2021",
        "context": "I'm sure not to buy that book!!  There's nothing in this article, hence the book, that hasn't been known for decades!!",
        "good": "8",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "cw2soon",
        "time": "20 June, 2021",
        "context": "She was chosen cuz good looking woman. Okeedokee.. NASA wasted the time of all the males and ugly females. ",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "BidensPrompter",
        "time": "20 June, 2021",
        "context": "I was looking forward to McNair's sax solo in space, at the time.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "chumley111",
        "time": "20 June, 2021",
        "context": "Let's see, Trump was not in the picture yet, so who's to blame?",
        "good": "10",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "getoverit524",
        "time": "20 June, 2021",
        "context": "I remember that day.\nWe where watching it in school...\nChrist's McAuliffe eyes where BLUE.\nONE BLEW THIS WAY AND INE BLEW THAT WAY...",
        "good": "1",
        "bad": "17",
        "replies": []
    },
    {
        "user_name": "ilfautcroire272",
        "time": "20 June, 2021",
        "context": "“The announcement sounded pure, but the program was really a gambit to bolster the president’s reelection chances.“. Possibly.  However this quote comes from the text of the article, not as a quote from the book.  Yet, it is presented as fact by the author, assuming I read correctly.  That is, at best, very slanted and not professional journalism, besides being a horrible thing to write.",
        "good": "15",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "teaman654",
        "time": "20 June, 2021",
        "context": "Big solid rockets should never be used for human space flight.  The Dr. Von Braun German rocket team hated the big solid rockets.  After the German rocket team retired out, Utah had powerful politicians who mandated the big solid rockets for the Space Shuttle Program.  The pressure to use big solid rockets for NASA human space flight is still alive and well today.  Look at the current NASA SLS Program.  The problem with the big solid rockets for human space flight is that you can't turn them off once ignited, posing a safety issue for getting the crew off in the event of a failure.  This has been looked at and studied for years, with no really good solution, but politics still drive their use.  The big solid rockets also make the Air Force Range Safety officers nervous every launch.  What if the Flight Termination System fails?  If so, it is then just a prayer these big solid rockets don't hit a populated area.",
        "good": "3",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "whatthef?",
        "time": "20 June, 2021",
        "context": "I never noticed before that Jarvis had a different patch than the others. I wonder why.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "arcadia73",
        "time": "20 June, 2021",
        "context": "This article is as pathetic as it gets. It is already well established that it was not an explosion but a massive structural breakdown. To vomit out this material for clicks shows how lazy the staff are on this site.",
        "good": "1",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "superk55",
        "time": "20 June, 2021",
        "context": "McAuliffe - I never should have picked up that damn brochureeeeeeeeeeeeeeeeee!!!!!!!!",
        "good": "3",
        "bad": "2",
        "replies": []
    }
]