[
    {
        "user_name": "rowlbar",
        "time": "1 day ago",
        "context": "When all you have is lies...",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dave7976",
        "time": "1 day ago",
        "context": "It's NOT JUST 9 month abortion.  Delaware and California passed laws to allow PERINATAL abortion.  That is 30 DAYS AFTER birth!",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "MAGreat1085",
                "time": "1 day ago",
                "context": "That can’t be true as that is legalizing murder, please advise on the source of your information.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "Mainstream_American",
        "time": "1 day ago",
        "context": "ABORTION  IS MURDER ",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Broken_Toaster_Review",
        "time": "1 day ago",
        "context": "I bet Glenn Kessler was the kid that wore a bicycle helmet and harness with the child leash.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "osufan1015056",
        "time": "1 day ago",
        "context": "More times than not, these so called \"fact checkers\" are  funded by the left.\n\nBill Gates has been known to fund a few of them which \"fact checked\" him, vaccines, and things he has come out on the record and stated publicly.\n\nWho fact checks the fact checkers?  You do!  It's called open source investigation and is the only way you will ever know truth versus lies.",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "chagrin",
        "time": "1 day ago",
        "context": "I don’t understand why this is even an issue. Who can possibly argue that late term abortion of viable children is anyone’s right? It’s murder, period, full stop. ",
        "good": "25",
        "bad": "0",
        "replies": [
            {
                "user_name": "beltrann",
                "time": "1 day ago",
                "context": "No, it's Health Care.  Don't you believe what the Left says?  Mother is healthy, Child is healthy then they abort the Child so of course its Health Care.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "46driver",
        "time": "1 day ago",
        "context": "New slogan for WaPo…\n“Democracy Died In Dementia”",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "deshawn_johnson",
        "time": "1 day ago",
        "context": "Not only do they happen, they are mandatory.  I used to be a democrate until I read all the stories on facebook about white families being told IN THE DELIVERY ROOM that they need to have their newborn aborted.  Perhaps the doctor was part of BLM?  Tough to say because main stream media does not want to pick up this story.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "CMAG🇺🇸",
        "time": "1 day ago",
        "context": "Washington Post “Fact Checkers” go by the Democrat Fascist Handbook when checking facts! ",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "thegolliwogs",
        "time": "1 day ago",
        "context": "Liberals, especially those in the media, often have trouble with the little things - like getting the facts straight and telling the truth.",
        "good": "27",
        "bad": "0",
        "replies": [
            {
                "user_name": "theheathn163",
                "time": "1 day ago",
                "context": "A fetus is not a potential life. It is a life with potential.",
                "good": "10",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "terryyaqui",
        "time": "1 day ago",
        "context": "There is NOTHING WRONG with abortion if performed OFTEN ENOUGH AND ON THE RIGHT PEOPLE, regardless of term.  This limits the procreation of future generations of \"Undesirables,\" who become \"net takers\" rather than net contributors.\n\nSo, with reversal of \"Roe\" and \"Casey,\" abortion will still be legal in some states.  This makes it even more imperative to give financial incentives not only to abort, but also give those same financial incentives to BOTH women AND men to exercise CONTROL over their bodies.\n\nTherefore, in states which allow abortion, women within those states NEED FREE ABORTIONS.  For women outside those states who want abortions, provide transportation subsidies.  Also, as part of the abortion procedure, pay those same women a FINANCIAL BONUS TO VOLUNTARILY undergo sterilization.  That way, the burden of future generations of \"social parasites\" can be LIMITED, if not totally eliminated.\n\nThe same financial incentives can be offered to men to CHOOSE to exercise their right and undergo permanent vasectomies.\n\nCombined, future generations of undesirables will eventually dwindle down to a manageable number.\n\n\"It is better for all the world if, instead of waiting to execute degenerate offspring for their crimes or let them starve for their imbecility, society can prevent those who are manifestly unfit from continuing their kind.\" (Buck v. Bell, 274 U.S. 200, 208 (1927), majority opinion written by Associate Justice of the United States, Oliver Wendell Holmes, Jr.)",
        "good": "0",
        "bad": "8",
        "replies": [
            {
                "user_name": "godblessamerica93",
                "time": "1 day ago",
                "context": "Wow.....this isn't too dissimilar to Jonathan Swift's 'A Modest Proposal.' a satire that proposed eating children to ease parents' burdens.",
                "good": "4",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "terryyaqui",
                        "time": "1 day ago",
                        "context": "It is not intended to ease parents' burdens.  Rather it is designed ease societal burdens.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "TheGambler390",
                "time": "1 day ago",
                "context": "Pay for your own abortion, no incentives or bonuses from the taxpayers…",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "frankw1",
                "time": "1 day ago",
                "context": "The words of a eugenicist - just like the Nazis.",
                "good": "2",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "sayitnice",
                        "time": "1 day ago",
                        "context": "Yup, her name was Margaret Higgins Sanger",
                        "good": "1",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "terryyaqui",
                                "time": "1 day ago",
                                "context": "Abortion \"by consent,\" and giving financial incentives for \"voluntarily\" undergoing \"consensual\" sterilization is the ultimate exercise of choice and exercising reproductive control by both men and women.\n\nIncentivized abortion and consensual sterilization are extensions of eugenics by an alternative means!",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "frankw1",
                "time": "1 day ago",
                "context": "My wife and I have a son (adopted from overseas) who was born with a genetic disorder, missing his left lower arm and leg, while his right arm and leg are deformed.  He is a college graduate and today runs his own business remodeling kitchens and bathrooms, as well as flipping houses.  He would have been eliminated prior to birth if you had your way.",
                "good": "2",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "terryyaqui",
                        "time": "1 day ago",
                        "context": "Why adopt from overseas?  Did the U.S. run-out of adoptable orphans?",
                        "good": "0",
                        "bad": "2",
                        "replies": [
                            {
                                "user_name": "frankw1",
                                "time": "1 day ago",
                                "context": "A child needed a home and family, and we gave him one, and you're upset about it?  I also notice that you didn't respond to the substance of my post - which is expected behavior from intellectual midgets.",
                                "good": "0",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "terryyaqui",
                                        "time": "1 day ago",
                                        "context": "So, no U.S. children were in need of a home at that time?",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": [
                                            {
                                                "user_name": "frankw1",
                                                "time": "1 day ago",
                                                "context": "LOL!  You are making some rash assumptions about us, about whom you know nothing other than what I've posted here.  Our family has adopted children whom you would have preferred never been born.",
                                                "good": "0",
                                                "bad": "0",
                                                "replies": []
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "timfmiller",
        "time": "1 day ago",
        "context": "Leftist \"fact checkers\" are entitled snobs that answer to no one b/c no one in the media or government holds them accountable",
        "good": "4",
        "bad": "0",
        "replies": [
            {
                "user_name": "meaveg.",
                "time": "1 day ago",
                "context": "Fact checker is a fancy name for liar.",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "xussbil882",
        "time": "1 day ago",
        "context": "Just another DEMOCRAT looking for way to continue to murdering fetuses freely with out ANY guilt. Wonder why Democrats enjoy sooo much blood on their hands??????",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "thevillageidiot",
        "time": "1 day ago",
        "context": "My question pro choicers can never answer: I saw an interview of a man with a partially severed arm, as a result of a botched abortion.  Was this gentleman a human being before or after his arm was partially severed in the womb?",
        "good": "12",
        "bad": "0",
        "replies": [
            {
                "user_name": "frankw1",
                "time": "1 day ago",
                "context": "A couple of years back, there was a pro-life video made - all abortion survivors.  The theme of the video was \"Look me in the eye and tell me I don't have a right to exist\".  The most powerful pro-life video I've ever seen, which is why the MSM squashed it.",
                "good": "8",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "🧻🚽💩🪠",
                "time": "1 day ago",
                "context": "They would say he was not a human being before he was born, but if he identifies as a woman then she was always a woman, even before she was born. 🤪",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "darrellsdiggenindeep",
        "time": "1 day ago",
        "context": "The GOP needs to get out of the abortion business, it’s literally the only thing keeping this abomination of a party in power right now! Literally every major issue is led by the GOP except abortion. Leave peoples irresponsible decisions between them and their makers!",
        "good": "0",
        "bad": "7",
        "replies": [
            {
                "user_name": "EllenPB",
                "time": "1 day ago",
                "context": "???  I'm a Conservative.  I stand for--and Support--LIFE.  How am I in the abortion business??",
                "good": "4",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "darrellsdiggenindeep",
                        "time": "1 day ago",
                        "context": "I guess I’ll spell it out. There are a multitude of issues that affect peoples “lives” right now, which the left is destroying! Those issues can’t be dealt with sitting on the sidelines like the GOP is right now. The abortion fight will never be won, because most of Americans are for it by a large portion. In the big picture, more can be done actually being in the game. You can stand for whatever you want, but you’ll die on that hill and bring the rest of this country down right with it!",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "EllenPB",
                                "time": "23 hours ago",
                                "context": "Are you a drama coach for Communist-Democrats?",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "inFoSifter",
        "time": "1 day ago",
        "context": "Kessler belongs in a blue state, city & local blue newspaper.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "2Amatters",
        "time": "1 day ago",
        "context": "Kessler is the best that the WaPo can come up with? He is an uneducated partisan hack with very little to show as an accomplishment in his life. Is it too late to abort him under the DEMOCRAT rules?",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "TimeStandsStill",
        "time": "1 day ago",
        "context": "This makes me sick!!",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sayitain'tso",
        "time": "1 day ago",
        "context": "You really have to wonder about the mental state of a doctor that has no problem pulling a baby partially out of it's mother's body, just to the point that they can reach the back of the neck, but before the baby's mouth or nose is exposed, so that they can dismember that child before it can breath, all with the  \"mother's\" consent.  And a lot of horrendous people have no problem with this.\n\nYou also have to wonder about lawmakers that would make a distinction that it isn't murder simply because the fully formed child wasn't given an opportunity to breathe on it's own.\n\nCan this argument be used to justify any murder?  If someone walks up behind another person and covers their mouth and nose, and murders them while doing so, can they then argue, \"The person DEFINITELY wasn't breathing when I stabbed them, so it's not murder, it's just mutilating a corpse.\"",
        "good": "9",
        "bad": "0",
        "replies": [
            {
                "user_name": "dave7976",
                "time": "1 day ago",
                "context": "NO ONE goes to an abortion clinic for healthcare.   A real doctor ALWAYS delivers the unborn child to give it the best chance at life!   9 month ABORTION Is ALWAYS exactly as you describe!",
                "good": "2",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "justaregularguy218",
        "time": "1 day ago",
        "context": "This is the guy that said yesterday that there's no fetal heartbeat. I believe it's the same view Dahmer had. ",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "geopatriot",
        "time": "1 day ago",
        "context": "AOC is living proof that we should never have closed the facilities for the mentally challenged!",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "truthsayer57",
        "time": "1 day ago",
        "context": "Fact checker?? ",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mikemarchese",
        "time": "1 day ago",
        "context": "I don’t care if it happens once a year. These democrats are telling me it’s ok. ",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "theheathn163",
        "time": "1 day ago",
        "context": "A fetus is not a potential life. It is a life with potential.",
        "good": "18",
        "bad": "0",
        "replies": [
            {
                "user_name": "ProudNavVet",
                "time": "1 day ago",
                "context": "Dang!  Excellent!",
                "good": "3",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "greatvoter",
                "time": "1 day ago",
                "context": "Former president Trump was told about the new abortion bill. Trump in a low whisper to his aide: “I thought I paid that bill already!\"",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "faction_of_1",
        "time": "1 day ago",
        "context": "Typical Democrat - wants to have it both ways.  Can't admit to reality.  Can't accept responsibility.  Refuses to held accountable.  Believes they know better, are better, and should tell everyone else what to do, how to think, what they can say, etc.  Egotistical, Arrogant, Snobbish, Condecending, Horrible people.",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ervie",
        "time": "1 day ago",
        "context": "What kind of animal would perform an abortion on a late term baby?\nI always was led to believe that a doctor took an oath to preserve life!",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "usmc!",
        "time": "1 day ago",
        "context": "Kessler looks like a alien.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jeep461",
        "time": "1 day ago",
        "context": "Vote red in November!!",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "frankw1",
        "time": "1 day ago",
        "context": "Kessler is learning a hard lesson: don't ever start down the path of truth about abortion, because you come face to face with the reality of what abortion is: the taking of a human life.",
        "good": "10",
        "bad": "0",
        "replies": [
            {
                "user_name": "ProudNavVet",
                "time": "1 day ago",
                "context": "D'oh!  I'll bet he hates it when that truth comes flying down his path!",
                "good": "4",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "meaveg.",
                        "time": "1 day ago",
                        "context": "All fact checkers do.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "EllenPB",
        "time": "1 day ago",
        "context": "These people are NOT liberals--they are LEFTISTS.  Communists--ALL democrats are, even though they won't admit it.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Crotchety_Old_Dude",
        "time": "1 day ago",
        "context": "WaPoo was once considered a stellar news source.  That was a long, long time ago.",
        "good": "4",
        "bad": "0",
        "replies": [
            {
                "user_name": "ProudNavVet",
                "time": "1 day ago",
                "context": "Going back to at least the days when Ben Bradlee was the Editor in Chief.",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "perogi007",
        "time": "1 day ago",
        "context": "That is the problem with liberal narratives. They can twist and distort the truth all they want but the facts will always be the facts.",
        "good": "9",
        "bad": "0",
        "replies": [
            {
                "user_name": "hamiltonsghost",
                "time": "1 day ago",
                "context": "Having studied the liberal brain for three full minutes, I can assure you facts have no place in the liberal mindset.  Facts are solely a source of fuel for liberal distortion and obfuscation.  Without truth liberals would have nothing to lie about.   Truth and facts are like the healthy host cells that liberal viruses prey on by infecting and replicating within them until they burst out, killing their microbial host.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "necessity",
        "time": "1 day ago",
        "context": "After a woman gets pregnant, a child is born. The only thing to be determined at that point is will the child be born alive or broken into bits?\n\nDems=Aztec priests who sacrifice the most innocent on their religious alter.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "chickenlittle7",
        "time": "1 day ago",
        "context": "another bleating liberal sheep with nothing left but lies",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Mainstream_American",
        "time": "1 day ago",
        "context": "Trump is the most intelligent and effective president in the history of the United States of America and the Progressive Democrat Party is tremendously frightened by his awesome brilliance and his determination to drain the buecratic swamp of criminals in Washington DC ",
        "good": "21",
        "bad": "0",
        "replies": [
            {
                "user_name": "repent165",
                "time": "1 day ago",
                "context": "VERY WELL SAID",
                "good": "6",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "havmydoubts",
        "time": "1 day ago",
        "context": "My son is a helicopter pilot, a gifted artist and musician, has two beautiful children and a loving wife. He was born 3.5 weeks early. Abortion is murder at any stage. I totally agree with the below comment that a fetus is not a potential life but a LIFE with potential. Further more, I have two adopted children who also are thriving in LIFE.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Liberalsgotohell",
        "time": "1 day ago",
        "context": "Strange looking dude",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "noncomposmentis_lyinbiden",
        "time": "1 day ago",
        "context": "Does any lib know which end is up?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "aman260",
        "time": "1 day ago",
        "context": "that's like saying \"oh Bigfoot isn't real, he just happens to be around people in the daytime\"",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "russagrusa825",
        "time": "1 day ago",
        "context": "Once again the arguments are idiotic since they actually only prove that the bill being proposed to limit abortions at 15 weeks (which is what most of the world does) would satisfy more than 90% of the cases ... so what's the argument? Oh ya that whole right to privacy distraction ...",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mk101mk693",
        "time": "1 day ago",
        "context": "Washington Post's & Kessler are part of the Democratic Party.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ImbecileBiden",
        "time": "1 day ago",
        "context": "Facts always get in the way of the dims narratives.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rush55",
        "time": "1 day ago",
        "context": "Compared to to the population of the USA the number of murders committed is \"rare\", but it doesn't make them legal!!!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "daves77",
        "time": "1 day ago",
        "context": "Just how \"late\" can we do abortions on Liberals, since they refuse to accept any limit?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "AndyO020",
        "time": "6 hours ago",
        "context": "The Republican presentation of abortion restrictions needs to be re-framed around what is PERMITTED rather than what is BANNED. ie. - Senator Graham's proposal PERMITS abortions up to 15 weeks. That is what the message should be to appeal to those who have a centrist view on the subject.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Americathebeautiful801",
        "time": "1 day ago",
        "context": "Just look at that pic of him. Somethings not right. 🤪",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bobberrider",
        "time": "1 day ago",
        "context": "For a liberal an obfuscation is not a lie",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Yggvreww",
        "time": "1 day ago",
        "context": "Fact checher = democrat propagandist ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "JustKeith",
        "time": "1 day ago",
        "context": "Moloch appreciates the efforts of (D)s",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "thomascovenant",
        "time": "1 day ago",
        "context": ". . . one of six states without any term restrictions as to when a pregnancy can be terminated.\nI think people hear this and they don't really even bother to consider closely what that actually means in practice. No term restrictions includes the 9th month. It is monstrous.",
        "good": "12",
        "bad": "0",
        "replies": [
            {
                "user_name": "schrödingers.cat=^..^=",
                "time": "1 day ago",
                "context": "Agree",
                "good": "2",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "46isanidiot821",
                "time": "1 day ago",
                "context": "Yet they resist the death penalty for people who have killed children and others.",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "mikeharmon200",
        "time": "1 day ago",
        "context": "European countries don't allow late term abortions.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "MarchoftheS.O.D",
        "time": "1 day ago",
        "context": "He should've used biden's teleprompter.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "c19hoax",
        "time": "1 day ago",
        "context": "If you want an abortion at any stage of your pregnancy all you need to do is waddle down to your local drugstore and get your covid-19 vaccination. In a study 80% of the women that took the vaccination while pregnant their baby came out still birth and I'm guessing it also sterilizes you too so you don't have to go through this problem again",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "DonkeypoxDisease",
        "time": "1 day ago",
        "context": "Groomer poster boy right there. Reminds me of Crazy Eyes Schiff.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mIddleoftheRoad2020886",
        "time": "1 day ago",
        "context": "Quit calling it \"late term\" abortion. It is \"late term\" baby murder.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "intotheabyss",
        "time": "1 day ago",
        "context": "If the Dems don't do late term abortions why are they fighting for the right to do them????",
        "good": "1",
        "bad": "0",
        "replies": []
    }
]