[
    {
        "user_name": "billsinton",
        "time": "31 August, 2022",
        "context": "Cpl. Hunter Lopez - A Hero Who Deserves To Go To Heaven! Thank You For your Sacrifice!\n\nJoey Biden - This is who you killed!",
        "good": "22",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Saint+Sinner",
        "time": "31 August, 2022",
        "context": "These are our truest Heros; Not a basketball player or an entertainer or any politician.",
        "good": "100",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "brooklynnick",
        "time": "31 August, 2022",
        "context": "Rest easy Cpl.  Semper Fi!   Oorah!!",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "marathon11",
        "time": "31 August, 2022",
        "context": "I remember getting messages from the VA during the botched withdrawal telling Vets to get help if they felt suicidal. I never did but got physically ill several times. Heard from several retired military friends they were ashamed. Brandon has blood on his hands. ",
        "good": "64",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "73vet",
        "time": "31 August, 2022",
        "context": "A true American hero.  Another person named Hunter, a true American zero, along with his dad. Let’s Go Brandon. ",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "timr270",
        "time": "31 August, 2022",
        "context": "Oh good a comment section not overwhelmed by Chinese globalist bots. Democrats dishonor these heroes daily.",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "nothingbuta",
        "time": "31 August, 2022",
        "context": "Why was that gate left open despite the intelligence?",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Dispatched",
        "time": "31 August, 2022",
        "context": "Brandon's actions made everything done in Afghanistan left there in vain.",
        "good": "11",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "hh65abc",
        "time": "31 August, 2022",
        "context": "Remember that billions of dollars in cash sent to Iran by Barack, Joe, Hillary, and John? I do. That money was used to supply terrorists in Afghanistan with IED materials. Iran was doing this before and had the blood of U.S. servicemen on their hands and they sent the money anyway. This Marines blood is on the hands of Joe Biden, Barack Obama, Hillary Clinton, and John Kerry. In their eyes the lives of your sons and daughters are expendable and cheap. They hold nothing but contempt for the armed forces.",
        "good": "23",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "getreal319",
        "time": "31 August, 2022",
        "context": "Biden killed this hero!",
        "good": "14",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "sharonmrc",
        "time": "31 August, 2022",
        "context": "What a wonderful young man.  He was definitely a hero. America’s hero🙏🏻♥️",
        "good": "28",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "ftheusa316",
        "time": "31 August, 2022",
        "context": "Yawn. Fox milking this year old story proves how desperate the right is. Trump has sunk the gop. Nothing will overshadow trumps failed insurrection, his plotting to steal the election and his sticky fat orange fingers stealing top secret documents. Nobody cares about 13 dead soldiers from a year ago, Nobody cares about student loans, Nobody cares about your fake boarder crisis.",
        "good": "0",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "j55256",
        "time": "31 August, 2022",
        "context": "Another bad result of the inept Biden Administration.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "D-M-R583142",
        "time": "31 August, 2022",
        "context": "God Bless Cpl. Hunter Lopez’s family & friends. He was a true hero and God is holding him in his arms. They always say God has a reason for everything, but it’s difficult to understand why our wonderful world is suffering so much. Your son is watching over you and is now your guardian Angel. 🦋❤️ Love surrounds you! Please everyone, Pray for peace! Pray for these families that have lost their loved ones that have made the ultimate sacrifice! Rest In Peace Cpl. Hunter Lopez. ",
        "good": "50",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "fair_game",
        "time": "31 August, 2022",
        "context": "It is totally Brandon’s fault to allow these heroes to be killed. An orderly pull out would have saved their lives. How do you console their wives, kids, parents, brothers and sisters for such senseless and preventable losses?",
        "good": "15",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "ithastogetbetter",
        "time": "31 August, 2022",
        "context": "What a horrific lack of leadership.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "redoctober804",
        "time": "31 August, 2022",
        "context": "Biden wants to bail out elite college kids? These are the people that need our assistance... and don't forget those left behind...",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Makeamericasafeagain21",
        "time": "31 August, 2022",
        "context": "God bless him and his family ",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "VikingsMatter606",
        "time": "31 August, 2022",
        "context": "He is all of us...He's American !  God Bless him !",
        "good": "7",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "johne37179",
        "time": "31 August, 2022",
        "context": "13 that are not forgotten and a president that is not forgiven.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "121",
        "time": "31 August, 2022",
        "context": "\"bidumb did this ⬆️\"",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "akko",
        "time": "31 August, 2022",
        "context": "I think the lives that President Biden saved in Afghanistan easily outstrips the lives that were lost. I am sure he bitterly regrets the lives of patriots lost, but he was right to withdraw.\nFor those saying that something else should have been done, you are very conveniently forgetting that the Afghan Army collapsed and that ANY significant action by the US military would have resulted in far greater US deaths.",
        "good": "0",
        "bad": "20",
        "replies": []
    },
    {
        "user_name": "Betwixt-n-Between",
        "time": "31 August, 2022",
        "context": "What an enormous loss not just for his family but for society. They did a great job raising what would become a brave man and a hero! ",
        "good": "119",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "greg3227539",
        "time": "31 August, 2022",
        "context": "Biden",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "#nogascon",
        "time": "31 August, 2022",
        "context": "The tragic deaths of all 13 servicemen is completely on the hands of Mr Biden and no one else. He bungled the withdrawal from Afghanistan and still fails to own it a year later.  This is one of the grounds he should be impeached on.  H is gross incompetence in addition to his corruption involving his son and his entire family should be enough to oust him.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "johnn707",
        "time": "31 August, 2022",
        "context": "On this Labor Day remember all our fallen especially those Left Behind to die in Benghazi , Afghanistan and remember those who are responsible we want Justice",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dl567",
        "time": "31 August, 2022",
        "context": "RIP brother SEMPER FIDELIS. VALHALLA IS YOURS TO BE HAD.",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "slippinjimmy871",
        "time": "31 August, 2022",
        "context": "Sincere condolences to the wonderful parents and loved ones of Cpl. Hunter Lopez, a true warrior hero that sacrificed his life for others. He now stands guard as an angel, lovingly watching over his family, especially his sweet parents. May all who mourn receive the peace and comfort they so need and deserve❤🇺🇸",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "redoctober804",
        "time": "31 August, 2022",
        "context": "Hero's of Kabul ! I hope this keeps going for years to come...We must never forget...",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "WilliamMunny685",
        "time": "31 August, 2022",
        "context": "RIP Hunter- LASD retired",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "anindependentthoughtagain",
        "time": "31 August, 2022",
        "context": "Another hero you brought honor to your fellow Marines and enriched our legacy God bless brother \n\nSemper Fi",
        "good": "11",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "d_james",
        "time": "31 August, 2022",
        "context": "I wonder how many family members of our slaughtered servicemen will be voting democrat any time soon.",
        "good": "13",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "tw1874",
        "time": "31 August, 2022",
        "context": "Where’s Biden and liberals on this NO WHERE!",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "fjb4ever496",
        "time": "31 August, 2022",
        "context": "Biden loved talking to Lopez’s grieving parents. He told them all about his son - Beau and checked his watch 17 times. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Canadian_Muslim",
        "time": "31 August, 2022",
        "context": "I see quite a few Afghan women on social media simping hard for the Taliban",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "stanm",
        "time": "31 August, 2022",
        "context": "Z",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "zackprixel",
        "time": "31 August, 2022",
        "context": "God Bless the PATRIOTIC TALIBAN who kill US Troops that have illegally invaded their sovereign nation.  The only good US Troop inside another mans nation is a dead US Troop.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "truthhurtswhom",
        "time": "31 August, 2022",
        "context": "Joe Biden’s policies led to their death.",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "pappawtom",
        "time": "31 August, 2022",
        "context": "These stories are amazing.  They bring to life those individuals who lost their lives that fateful day due to a decision to suddenly withdraw by a president who is not fit to serve this nation no matter how he won the election.  This young man who made a choice to enter into the military and then proved his worth by his actions over there.  Wow, I look forward to reading these stories as they bring these individuals to life for all of us.",
        "good": "68",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "100JUSTME455",
        "time": "31 August, 2022",
        "context": "As I read through some of the comments...Dems making excuses for Biden and the other side condemning him... \nIt's already been established that he should have done it better...He failed to have a reasonable plan for evacuating equipment and people...He sent troops back to right his wrong but it was too late...",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "OldBird",
        "time": "31 August, 2022",
        "context": "Bless that young man and all those who gave their lives for this country.",
        "good": "12",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "arealldemsdim",
        "time": "31 August, 2022",
        "context": "Marine, America owes you an apology.  In response to your service, bravery and sacrifice.....our nation elected a coward as commander and chief.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "2020Trumpwon",
        "time": "31 August, 2022",
        "context": "To bad to lose a patriot like this, I can quickly think of 10 or so pols that should have gone instead.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "DollyPardon",
        "time": "31 August, 2022",
        "context": "Ukraine just applied for a 2 billionaire student loan",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "eliteliberalslie",
        "time": "31 August, 2022",
        "context": "Thank God for men like Hunter Lopez.  We owe him an enormous debt of gratitude. ",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "my_2_sense",
        "time": "31 August, 2022",
        "context": "Many thanks to Cpl. Lopez and other service men and women who brought credit upon the USA in the midst of this Biden-led debacle, in which Biden overruled his own military.",
        "good": "61",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "blondesantana",
        "time": "31 August, 2022",
        "context": "Tragedies like this happened for 20 years. If it weren't for Biden, they would still be happening today. ",
        "good": "2",
        "bad": "9",
        "replies": []
    },
    {
        "user_name": "hanknc435",
        "time": "31 August, 2022",
        "context": "Man killed saving woman.  So what's new about that?  Happens almost daily.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sidehustle88",
        "time": "31 August, 2022",
        "context": "Remember when the parents whose sons and daughter Joe Biden got killed in Afghanistan - when those hurting parents were pouring their hearts out to \"The President\" - face to face - about the grief they were feeling?\n\nWhat did Joe Biden say?    He rolled his eyes and checked his watch again.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "45twice",
        "time": "31 August, 2022",
        "context": "The U.S. Army, Navy, Marines, and Air Force cannot meet their recruitment quotas because nobody wants Joe Biden as a Commander in Chief and nobody wants to belong to a Military ran by woke Generals and Admirals.",
        "good": "8",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "laowai",
        "time": "31 August, 2022",
        "context": "Thank you for your service and sacrifice Cpl Lopez. You have made your parents and patriotic Americans proud! I salute you!",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tnmtnmn",
        "time": "31 August, 2022",
        "context": "“The president put out a statement earlier today, and as you all probably saw the statement that was released. He named each of the 13 troops who were tragically, tragically killed on that day,\" she explained. \"The president feels deeply about the loss that was suffered one year ago, and as he said in that statement, he feels strongly that we owe their families support for the rest of their lives.”  Thirteen lives reduced to a statement.\n\nBiden was having a busy day making a tape for Jay Leno's show.  Wonder if Biden was checking his watch too.",
        "good": "37",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "adknine",
        "time": "31 August, 2022",
        "context": "Between 2017 and 2021, there were 45 hostile deaths and 63 total deaths (including non-hostile) during Trump’s presidency. In 2017, there were 14 total deaths; in 2018, there were 15; 23 in 2019 and in 2020, there were 11..\n\nHad not JB pulled us out. these kind of numbers would have continued",
        "good": "0",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "Largeshadow034",
        "time": "31 August, 2022",
        "context": "God Bless him. Thanks for your service and sacrifice brother.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "TLTTLT",
        "time": "31 August, 2022",
        "context": "And....Joe checks his watch....a true ‘character’ check......",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "TDubYeah",
        "time": "31 August, 2022",
        "context": "The best of the best.  An American hero.  The beacon of light for our nation, our communities, our families",
        "good": "17",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "JerrytheJoker",
        "time": "31 August, 2022",
        "context": "Real heroes don't get killed",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sidehustle88",
        "time": "31 August, 2022",
        "context": "On the one- year commemoration of Joe Biden's Ambush of 13 United States Soldiers....\n\nNOT ONE BLEEPING WORD FROM THE FRAUD \"COMMANDER IN CHIEF\" IN HIS REHOBOTH BEACH MANSION",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "hoosierlib",
        "time": "31 August, 2022",
        "context": "Why do conservatives only care about the soldiers who died in 2021? They disrespect the soldiers who died during the 20 years of war before that. Are they trying to score political points with the blood of our dead heroes?\n2001: 12 US soldiers died\n2002: 49 US soldiers died\n2003: 48 US soldiers died\n2004: 52 US soldiers died\n2005: 99 US soldiers died\n2006: 98 US soldiers died\n2007: 117 US soldiers died\n2008: 155 US soldiers died\n2009: 317 US soldiers died\n2010: 498 US soldiers died\n2011: 415 US soldiers died\n2012: 310 US soldiers died\n2013: 128 US soldiers died\n2014: 55 US soldiers died\n2015: 22 US soldiers died\n2016: 13 US soldiers died\n2017: 15 US soldiers died\n2018: 14 US soldiers died\n2019: 24 US soldiers died\n2020: 11 US soldiers died",
        "good": "0",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "ptatim",
        "time": "31 August, 2022",
        "context": "No one in my family will be sacrificing their life for a bunch of cave dwellers in Afghanistan thank you the people in Washington all need to be sent to the front lines to get a taste of their own medicine.  My condolences to his family for the criminals in Washington sacrificing him for nothing",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "mar1ne1",
        "time": "31 August, 2022",
        "context": "Semper Fi.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "hoosierlib",
        "time": "31 August, 2022",
        "context": "Reports are that the Taliban possessed some classified US government documents that helped them identify US assets in Kabul during the 2021 withdrawal.\nWonder how they got those classified documents?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "anotherconservativeinexile",
        "time": "31 August, 2022",
        "context": "Once again we read about an incredible young American putting his  life on the line to try and protect others.  The very definition of heroic. \n\nHunter represents all that is great about America. Cpl. Hunter Lopez, that is.  Not the other Hunter.  The Commander in Chief's son represents the worst of America.  A man kicked out of the military. A Commander in Chief who is not fit to lead.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "richardgrande894",
        "time": "31 August, 2022",
        "context": "Too bad Lopez wasn't protecting the USA's borders against the hispanic invasion.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "honestycounts458",
        "time": "31 August, 2022",
        "context": "Col Hunter Lopez is what a hero looks like.\nTo bad we have a President that could care less. ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "DiaperWearerForPres",
        "time": "31 August, 2022",
        "context": "Casualties of the Brandon administration, just awful.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Raderhader",
        "time": "31 August, 2022",
        "context": "That's what a hero looks like!",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "kw4maga",
        "time": "31 August, 2022",
        "context": "Joe Biden did this! Let’s go Brandon!🇺🇸🇺🇸",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "HelloThere799",
        "time": "31 August, 2022",
        "context": "All who serve are HEROES !!!",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "usarmy79romeo",
        "time": "31 August, 2022",
        "context": "uh oh\nMore hate from the left today",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "TheGhostof40",
        "time": "31 August, 2022",
        "context": "This young man was a credit to Gen Z, it's a shame a majority of the of them are ill mannered, free speech deniers, pronoun police, gender dysphoria disorder pushers and more than 20% think they're a member of the alphabet cult which doesn't bode well for the next generation's population numbers.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Bartleby",
        "time": "31 August, 2022",
        "context": "2,400 troops died in Afghanistan and 4,400 died in Iraq.  I don't recall FOX have a weeks long memorial to them like they're doing now for these 13 -- just weeks before the mid-term election.  Does FOX have an agenda here?",
        "good": "0",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "THEGREENMEN",
        "time": "31 August, 2022",
        "context": "This country has always had the few patriots that stands up to say I will.. I will serve..I will sacrifice..I will go where needed..I will do what is needed..they’re names now are forever written down in American History as patriots..God Bless Them!",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bikerchick22488",
        "time": "31 August, 2022",
        "context": "A TRUE AMERICAN  HERO!!",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cvandy1",
        "time": "31 August, 2022",
        "context": "RIP",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Bartleby",
        "time": "31 August, 2022",
        "context": "Yes, righties, people die in wars.  Is this news to you?",
        "good": "0",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "billthomas283828",
        "time": "31 August, 2022",
        "context": "Can’t stand how Fox tries to redirect you to Fox Business on a lot of articles.  If I wanted to read Fox Business I would go there and read…",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ptatim",
        "time": "31 August, 2022",
        "context": "Is Afghanistan or Iraq or Iran or Ukraine or Libya worth your sons life?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "MegaMAGA449",
        "time": "31 August, 2022",
        "context": "My family and I would like to extend my deepest condolences for your brave son, Cpl. Hunter Lopez. Please know we have you all in our Prayers. ",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "badforu246",
        "time": "31 August, 2022",
        "context": "The honor part of this is what they are fighting for, but that has been askewed. In the military they want u to go off and kill people for no reason of your own, but yet when you ask for justice at home, there is none.  Honor certainly has become a matter of perspective, an from my perspective theres not much honor in any of it.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "dosie",
        "time": "31 August, 2022",
        "context": "Rest in peace Cpl. Lopez. You will never be forgotten.  God bless your family and friends as they live each day loving and missing you. Thank you for your heroic actions serving our country. Semper Fidelis.",
        "good": "28",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "CMOdom66",
        "time": "31 August, 2022",
        "context": "Another Hero. God Bless All Of Them.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "richardgrande894",
        "time": "31 August, 2022",
        "context": "Lopez. and nothing of value was lost.",
        "good": "0",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "uerdinger19",
        "time": "31 August, 2022",
        "context": "our great Constitution -freedom of religion or no religion",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "noknews",
        "time": "31 August, 2022",
        "context": "After he saved the girls their parents sold them for food.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Let'sfigurethisouttogether...",
        "time": "31 August, 2022",
        "context": "Just to put things into perspective:\n\nIn the 24 months prior to the Usurper in Chief's failed withdrawal, which resulted in 13 families being ruined, the Taliban, ISIS-K, and al-Qaida killed 13 service members. Yes, that's right, Joe Biden and his administration accomplished in one day what took the Taliban, ISIS-K, and al-Qaida two years to accomplish. One day!",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Riverrat197",
        "time": "31 August, 2022",
        "context": "I volunteer at a VA clonic.   Met a Marine yesterday that was a sniper in Vietnam.  I am sorry this young will not get to grow old and share his heroic stories to future generations.  ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "russternj1000",
        "time": "31 August, 2022",
        "context": "How many US troops kulled in the Middle East in the past year?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "FJB20",
        "time": "31 August, 2022",
        "context": "No Afghan life is worth your own life.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "anamericancorrespondent",
        "time": "31 August, 2022",
        "context": "I want to thank Fox News for the tributes to these American heroes who cost their lives thanks to the ineptitude and incompetency of Joe Biden and the ComDems. One analysis noted that Communist Democrat propaganda mills together only gave that day of infamy and their lives less than a minute of their time on the anniversary of Biden's grandest failure among many Grand failures since taking office. How does one who does such a horrific thing keep from taking his own life from such guilt???",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "ObeseIllegitimo676",
        "time": "31 August, 2022",
        "context": "What a generous soul!",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "eagle66",
        "time": "31 August, 2022",
        "context": "CORRUPT JOE BIDEN ABANDONED AMERICAN CITIZENS IN AFGHANISTAN ",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "marine_raider_jtp",
        "time": "31 August, 2022",
        "context": "RIP, brother!\nPeople just don't understand.\nThank you for all that you have done.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "junkman",
        "time": "31 August, 2022",
        "context": "Treason was punished by hanging, \nWhy is Biden still a living President?",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "russternj1000",
        "time": "31 August, 2022",
        "context": "Unfortunately mistakes were made in the withdrawal but withdrawal was the correct move. Otherwise we could be there another 20 years and still not accomplish anything.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ObeseIllegitimo676",
        "time": "31 August, 2022",
        "context": "It should be obvious from this article that there are noble, heroic, patriotic Hunters in the world who will sacrifice themselves for strangers, then there's the President's son!",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "nickdoszk993",
        "time": "31 August, 2022",
        "context": "These young men and women make me proud to be an American. Your son will always be remembered for saving two children. God bless his soul and God bless your family.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "NWOequalsFail_2022",
        "time": "31 August, 2022",
        "context": "thank you for giving all for our Constitutional Republic 🇺🇸 ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "unc#104",
        "time": "31 August, 2022",
        "context": "A true American hero, living the American dream doing what he loved to do, serving his country and the brothers and sisters who stood with him.\nSo sad he was let down by a disrespectful administration.\nNEVER FORGET,  voting poorly has forever consequences! RIP brother!",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "retiredcop50",
        "time": "31 August, 2022",
        "context": "Kudos to FOX for printing this hero's story, as opposed to Johnny Depp in a space suit.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "hoosiergmaof3",
        "time": "31 August, 2022",
        "context": "Oh young Hero, I will never forget you and the others that fated day. I know my boy, my own Hero, greeted you as you deployed to Heaven, a heaven filled with God's army. ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bobburtch",
        "time": "31 August, 2022",
        "context": "THANK GOD FOR OUR TROOPS...............................We will not forget and we will not forgive the PUPPET POTUS turned his back on troops and left citizens behind.",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sydney335",
        "time": "31 August, 2022",
        "context": "63 brave military personnel were killed in Afghanistan between 2016-2020…moment of silence…hand salute!!!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "marine_raider_jtp",
        "time": "31 August, 2022",
        "context": "I don't need a story to know this Marine was a hero.  \nThere are so many who just don't get it.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "altair13",
        "time": "31 August, 2022",
        "context": "And the man who got him killed remains silent.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "usmc1811m48m60",
        "time": "31 August, 2022",
        "context": "RIP",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cm141",
        "time": "31 August, 2022",
        "context": "Thank you for your service!\nR.I.P.\nCondolences and prayers to loved ones......",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "threedogs",
        "time": "31 August, 2022",
        "context": "It’s just a travesty and a heartbreak to know what these young men and women endured.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "texboy",
        "time": "31 August, 2022",
        "context": "And Biden says \"I did this\"",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Dimsstinkbad635",
        "time": "31 August, 2022",
        "context": "Murdered by Joe Biden and the Dim party. \nPay them back in blood.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "DebraJay",
        "time": "31 August, 2022",
        "context": "This is the picture of a REAL HERO",
        "good": "15",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "paratrooper67",
        "time": "31 August, 2022",
        "context": "Man joins the  Marines, man gets killed in combat, man's mother is sad. What an amazing story, lol lol lol",
        "good": "0",
        "bad": "7",
        "replies": []
    },
    {
        "user_name": "what'sthenextliberalhoax?",
        "time": "31 August, 2022",
        "context": "Only hateful lefties would feel the need to vomit on this young man's article. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "therewasnofraud",
        "time": "31 August, 2022",
        "context": "Fox exploitation. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "GFNER",
        "time": "31 August, 2022",
        "context": "Unfortunatley this hero is another victim of the biden administration.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "randpaulsneighbor",
        "time": "31 August, 2022",
        "context": "There’s blood on Trumps tiny tiny little doll hands!!",
        "good": "0",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "paratrooper67",
        "time": "31 August, 2022",
        "context": "Five hundred American soldiers killed during trump's first  ( and last ) term and probably ten thousand wounded and , gee, what were their names ??",
        "good": "0",
        "bad": "7",
        "replies": []
    },
    {
        "user_name": "david3755",
        "time": "31 August, 2022",
        "context": "Great American hero’s that were lost in  a badly executed retreat. Shame on creepy joe.",
        "good": "12",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "paratrooper67",
        "time": "31 August, 2022",
        "context": "The only justice is that Fox and it's propaganda spewing \" hosts\" are being sued by Dominion for 1.8 billion for defamation",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "jimvmax",
        "time": "31 August, 2022",
        "context": "Am I to understand that Biden said that he did not have time to receive a briefing on the withdrawal plan and did not have time to listen to the findings of what went wrong.  Worst Commander and Chief in American history.  He has called this tragedy the most successful evacuation.  For those who have eyes, see and understand.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "askingforafriend608",
        "time": "31 August, 2022",
        "context": "It’s going to be an ugly bear market through winter.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bethdutton21!",
        "time": "31 August, 2022",
        "context": "He gave his all you can't ask for any more.  Thank you family for raising this hero.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "buckfoejiden336",
        "time": "31 August, 2022",
        "context": "I served in the US Navy about 40 years ago. Nearly all of the men I served with would have put themselves at risk to save the lives of others. It is a part of the definition of being a service member. Thank you, Marine. Well done.",
        "good": "64",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "lbpinflorida",
        "time": "31 August, 2022",
        "context": "BIDEN brings nothing but SHAME on this Republic. But then again, of course, he is a Progressive Democrat..",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "ammomatters!",
        "time": "31 August, 2022",
        "context": "\"This boy was brought up in a time of blood and dying and never questioned a bit of it. He never turned his back on his folks or his kind. I rode with him… and I got no complaints.\"",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "truereality",
        "time": "31 August, 2022",
        "context": "Every American should have to serve at least two years in the Military, it would make our country better.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cortomom",
        "time": "31 August, 2022",
        "context": "Praying for the comfort of this HERO'S family, in Jesus name.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mrdeplorabletoyou4",
        "time": "31 August, 2022",
        "context": "13 Sitting Ducks of Kabul thanks to Joey Loaded Pants.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "susanisaacs",
        "time": "31 August, 2022",
        "context": "Let's go Brandon.  The only thing Joe would attempt to save would be his ice cream cone! 🍦",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Oxymoron",
        "time": "31 August, 2022",
        "context": "Why do government leaders insist on wars, and killing off the best of our young people?  We should have people ages 40 to 55 be in the military!  They at least have lived a portion of their lives! These current women and men in the military have not yet lived their lives!\nAt the very least, Trump NEVER involved us in ant armed conflicts.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jillcg",
        "time": "31 August, 2022",
        "context": "My condolences to Hunter's family and friends. Our country lost too many outstanding citizens a year ago. Our country needs more young people like Hunter to protect and serve both overseas and back home.",
        "good": "33",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "marine_raider_jtp",
        "time": "31 August, 2022",
        "context": "THIS is a hero.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ja1970",
        "time": "31 August, 2022",
        "context": "These are the type of articles we should be reading more of…..true heroes.  Not stories about the traitor Trump.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "DebraJay",
        "time": "31 August, 2022",
        "context": "FUNNY how one can say kind words that others like to laugh, make fun of. to taking someones  pain and joking about it. Lol WONDER why things aren't too good these days, look at your words and fake names THAT SHOULD TELL YOU. Lord please be rid of the evil mouths and typing fingers from ALL PLATFORMS in Jesus mighty name AMEN",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "☕️a",
        "time": "31 August, 2022",
        "context": "An American Hero that represented all Americans of every age, gender and race. Our political leaders fail us all when we lose these brave people. \nSoar High Cpl Lopez. Peace and strength to his family. ",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "CoolhandLuke766",
        "time": "31 August, 2022",
        "context": "Our Young Marine....RIP.\nOur Community (from a Local High School) is still mourning His Loss, a Fine young man, and a great Family! \nHe will be Remembered!",
        "good": "9",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "tamie",
        "time": "31 August, 2022",
        "context": "Our president doesn’t even acknowledge these heroes…….Even Putin payed more respects, just sayin.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "trmp#1",
        "time": "31 August, 2022",
        "context": "God Bless you and your family,  Wow your son set the bar pretty high!  What a brave warrior.\nPraying for you all/\\",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "geo25825",
        "time": "31 August, 2022",
        "context": "Semper fi!",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "holdon",
        "time": "31 August, 2022",
        "context": "now they want to purge the marines of heroes like Cpl. Lopez",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "NoSanctuary",
        "time": "31 August, 2022",
        "context": "Losing his life protecting terrorist supporters is really sad.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "linemanjoe052",
        "time": "31 August, 2022",
        "context": "Semper Fi Marine. When i was your age, a hundred years ago, i was an E-5 in Vietnam. Id be your wing man anytime. God Bless you and yours",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "TimtheMarine",
        "time": "31 August, 2022",
        "context": "God bless, my brother.\n\nSemper Fi ",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "xbidenharris",
        "time": "31 August, 2022",
        "context": "More blood on bidens hands-----RED WAVE IS COMING---VOTE THEM OUT IN 22/24",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "terribletemplar435",
        "time": "31 August, 2022",
        "context": "Biden lied and then heroes died.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "IBeTenBeers",
        "time": "31 August, 2022",
        "context": "They died needlessly due to Biden's ineptness.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "GhostSoulja",
        "time": "31 August, 2022",
        "context": "JOE BIDEN/ BARACK OBAMA DID THIS. DEMAND ACCOUNTABILITY!!!🇺🇸",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "redscouts",
        "time": "31 August, 2022",
        "context": "Joementia killed him.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sfchief",
        "time": "31 August, 2022",
        "context": "Isn't it just DEMOCRAT that the USA sends troops all over the world to fight and DIE, but will not deal with the Mexican Cartels that are murdering our people by the thousands every year with Fentanyl, and opioids?  Vote, every chance you get to end the government support for Mexican Cartels.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "marxismfails395",
        "time": "31 August, 2022",
        "context": "Fair winds and following seas Marine.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "iancooper1965157",
        "time": "31 August, 2022",
        "context": "There is much blood on the hands of our government.  We have no moral authority anywhere in the world.  My heart breaks for this young Marine’s family. ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "firstre",
        "time": "31 August, 2022",
        "context": "What a sad loss— nice going Senile Joe and incompetent Sec Def— sec of State",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "USA.leadstheWay!!",
        "time": "31 August, 2022",
        "context": "I am so proud of our Troops.  For decades they showed the People of Afghanistan how decent people act. They built schools, helped children & showed young Women how the World should be. This will reverberate around the Islamic World. They saw firsthand, were the good guys.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "🦖TheEndisNigh🦄",
        "time": "31 August, 2022",
        "context": "Hero!",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "JOE•HAS•A•LOADED•DIAPER",
        "time": "31 August, 2022",
        "context": "Brandon honored Lopez’s legacy by…\nLEAVING THE REST BEHIND!!!\n😳🙄",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "boompa2",
        "time": "31 August, 2022",
        "context": "Some true Patriots will take action, while others stand back and video........",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "horacepmanure",
        "time": "31 August, 2022",
        "context": "I look forward to the day when Trumpers turn on the military when they seize Trump properties.\n\nJust a matter of time.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "berightnow",
        "time": "31 August, 2022",
        "context": "This is what a real man does when called upon.\n\nThank you Cpl.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Demsarefundamentallywrong",
        "time": "31 August, 2022",
        "context": "RIP Abbey Gate 13!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "judy76",
        "time": "31 August, 2022",
        "context": "Marines are the best of the best!  My Dad and his brother were both Marines.  Its a tragedy that our Government failed these incredible individuals.   My deepest sympathy to their families!",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dingedong",
        "time": "31 August, 2022",
        "context": "A hero this soldier and thanks to the Biden veggie he was killed!",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "EatenByAGrue",
        "time": "31 August, 2022",
        "context": "One of too many deplorable losses.\nMy thanks to everyone who has served.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "reddog21",
        "time": "31 August, 2022",
        "context": "On behalf of veterans I apologize to Hunters family that he did not have a Commander in Chief.   ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "STOP!TheLies",
        "time": "31 August, 2022",
        "context": "A true hero! RIP American Soldier. ",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bigboy711",
        "time": "31 August, 2022",
        "context": "Only in America folks only in America.....Thank you Lopez family for raising such a fantastic young man...!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "_nosferatu_",
        "time": "31 August, 2022",
        "context": "Now who's going to help the Taliban who are fleeing ISIS?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Aeynghus",
        "time": "31 August, 2022",
        "context": "The blood of the 13 is on China Joe's hands.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dingedong",
        "time": "31 August, 2022",
        "context": "Vote Republican!",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "johnnythewalrus",
        "time": "31 August, 2022",
        "context": "We have Men like this, and we have boys the same age that dress in black with black face masks who posture with guns to protect drag show groomers so they can work their \"magic\" on children.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "TotalHypocrisy",
        "time": "31 August, 2022",
        "context": "This brave and honorable young man is from my town. I grieve for every family that has to bury their child. I know from personal experience how devastating that is. Despite the horrific manner in which we left Afghanistan, these young people served with honor to the very end. Let’s hope that we learned something from that abysmal exit so that their lives weren’t wasted. ",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "vetsop1",
        "time": "31 August, 2022",
        "context": "I can tell you as a veteran that has seen combat that nowadays you do not see that heroism from all of our troops. I am proud of all them and back all of them but this is unique. what an awesome young man and a soldiers soldier. this guy would have given his life just for those two girls. but he ended up giving it over a mess that was preventable. we should have been at bagram Air Base because we could see for Miles and we had minefield around it and it would have been so much easier and our soldiers would still be alive today.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "steakfordinner",
        "time": "31 August, 2022",
        "context": "Conservatives said the girls should have died instead of Lopez.  But then again, Lopez was Hispanic.  Do we know if his parents came here legally?",
        "good": "0",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "jyd213",
        "time": "31 August, 2022",
        "context": "It is people like Cpl. Lopez that make this country great! A true hero. Our nation thanks you for your service and sacrifice.  Rest in peace.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "stoneshirt066",
        "time": "31 August, 2022",
        "context": "Heros are for Comic Books...",
        "good": "0",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "alvermeil",
        "time": "31 August, 2022",
        "context": "A remarkable young man. May he rest in peace",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "WhiteRabbit🐇",
        "time": "31 August, 2022",
        "context": "Did you know?\nDemocrats Joe Biden, Chuck Schumer, Steny Hoyer, Bernie Sanders, Tom Dashel \n\nALL DODGED THE DRAFT IN VIETNAM ....they should not be allowed to control the brave men and women in the Military",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Bodger",
        "time": "31 August, 2022",
        "context": "His death is on your hands Biden. \n\n...wrong Hunter.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "nhord",
        "time": "31 August, 2022",
        "context": "our boys go and die for this country, and for other countries, but yet everybody still hates us. even people in this country. this young man gave his life, the ultimate sacrifice. for what??? ",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "psmith1833",
        "time": "31 August, 2022",
        "context": "Heroes indeed, may God continue to bless these Marines, and comfort their families. Semper Fidelis ",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "logicandcommonsense267",
        "time": "31 August, 2022",
        "context": "Tragic loss of these brave American heros.\n\nBiden, Harris, Pelosi, CNN, MSNBC, ABC, CBS, and NBC did not recognize the 1 year anniversary of this tragic event. They all recognized the 1 year anniversary of the great American zero George Floyd.\n\nI hope all active military, reserves, and veterans remember this when they vote in November.",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tornasunder",
        "time": "31 August, 2022",
        "context": "I have nothing but deep respect for this fallen hero, and nothing but contempt for Biden who in my opinion is complicit in these deaths.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "WhiteRabbit🐇",
        "time": "31 August, 2022",
        "context": "why are we paying off Antifa clowns student loans when we have American Heros like this living on the streets",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "war4trump",
        "time": "31 August, 2022",
        "context": "American military leaders forge ahead as liberals bash our sacred Stars and Stripes.\nAs a vet thank you brother and gods speed.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cagop922",
        "time": "31 August, 2022",
        "context": "God bless you and your family.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "packers04",
        "time": "31 August, 2022",
        "context": "My heart goes out to you and your family.  I'm glad Fox is doing these video's to show that 13 brave young men who loved their country will not be forgotten.  Also, it shows the heart wrenching story of what the family is going through.  God Bless your son and your family. He was a true Marine!!",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "MajorTom333",
        "time": "31 August, 2022",
        "context": "What a waste, die for nothing...Thank you joe.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "d'artagnan0962",
        "time": "31 August, 2022",
        "context": "As long as our country produces young men (and women) like Cpl. Lopez there is hope for our country's future. No doubt he is with his brothers on duty now guarding the gates of heaven.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "geez.what.a.load",
        "time": "31 August, 2022",
        "context": "God bless the late Cpl. Hunter Lopez, USMC, and his family.\nGod bless the United States Marine Corp.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "frankrizzo186",
        "time": "31 August, 2022",
        "context": "Wow. He saved 2 girls. 🙄 That was worth his life? And where are these 2 girls now?",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "Ephesians4_32",
        "time": "31 August, 2022",
        "context": "People like this do everything to help others and protect our freedoms, only to have traitors blame our president. I would expect them to honor his sacrifice and be thankful that they are still free.",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "MightyHealthy",
        "time": "31 August, 2022",
        "context": "The Afghanistan evacuation could not have been handled more poorly.\nBrandon dropped the ball bad.\nRemember the choppers landing on top of the embassy, ppl clinging to the outside of airplanes, this articles story, 80 billion worth of army property left behind, this list goes on and on.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "joe-knows-trump-won",
        "time": "31 August, 2022",
        "context": "The military hates Talibiden because they know President Trump won.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "calamagrostis88",
        "time": "31 August, 2022",
        "context": "Plenty of people said that the invasions would never solve the problem of terrorism.  Now the the Taliban are back in power, and the government in Iraq looks very shaky.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "chuckbronson328",
        "time": "31 August, 2022",
        "context": "Biden killed these marines not the Taliban.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Bologna64",
        "time": "31 August, 2022",
        "context": "Your opinion does not lessen that fact that he is a hero in saving those children, and ready to die for our country.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "melzann",
        "time": "31 August, 2022",
        "context": "I salute you and your comrades, Cpl. Hunter Lopez. On behalf of patriots across this land, we apologize for what our country did to you and yours. Rest In Peace, Marine.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "hedgenamedsteve",
        "time": "31 August, 2022",
        "context": "where were the Afghan men, eh? Oh yea, running away.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "idiotculler",
        "time": "31 August, 2022",
        "context": "What a great story, A YEAR AGO.",
        "good": "0",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "jim.bob4000",
        "time": "31 August, 2022",
        "context": "Milking these tragic deaths",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "nickieb",
        "time": "31 August, 2022",
        "context": "Thank You Hunter for your ultimate service. God bless your family- they raised a true Hero!",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "mmmmmiller",
        "time": "31 August, 2022",
        "context": "Over 90 we’re killed during Trump’s reign when he did nothing. How many have been killed since Biden finally pulled the US out? ZERO. (Fun fact: it was never going to be an easy, clean exit and if anyone is to blame for the messy, deadly exit - it’s the military leaders who orchestrated it. Defund the military maybe? Term limits on military jobs?   Onward!)",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "wakko1966",
        "time": "31 August, 2022",
        "context": "R.I.P. Brave Soul",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "oldgolffart",
        "time": "31 August, 2022",
        "context": "I bet his parents are happy no other American soldiers have to die in Afghanistan. \n\nWell done Brandon...you got us out.",
        "good": "0",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "wags1959",
        "time": "31 August, 2022",
        "context": "Rest in Peace.  We thank You for what you have given to all of us.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "shortstuff29957",
        "time": "31 August, 2022",
        "context": "This administration, which then includes every Democrat, turned their back on the innocent people left in Afghanistan and never looked back. There is massive humanitarian horror happening there. I hate to see what all these migrants plan to do here. We need to return to Afghanistan, with allies (if we have any left after Biden's horrid non-leadership) to remove the newly grown terrorism group AND join Ukraine on the ground to stop Russia.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "hif",
        "time": "31 August, 2022",
        "context": "why don't you say something dems",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "awesome000",
        "time": "31 August, 2022",
        "context": "I can bet Baldwin, never served one day defending our country. He’s like Biden, a dodge drafter.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "justadude188",
        "time": "31 August, 2022",
        "context": "The blood of these young outstanding marines is on Biden's hands.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "TEDS.",
        "time": "31 August, 2022",
        "context": "The Lopez Family can exclusively thank The Biden Administration for his Death & the other dozen US Marines. Last year's Afghanistan Pull-Out was a Disgusting display of an Incompetent White House & Their Incompetent Picks for Leadership.\nSemper Fi Marines",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "blackman4trump",
        "time": "31 August, 2022",
        "context": "This is the Hunter we need as a country God Bless him",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Bologna64",
        "time": "31 August, 2022",
        "context": "And yet we are reading your comments on Fox News. You know, the company that decided to do this story -18 months later.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "commielibtrigger",
        "time": "31 August, 2022",
        "context": "Taliban are, for the most part, Afghani.\nIt's their land, their rules.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "AverageAmericanDude",
        "time": "31 August, 2022",
        "context": "That was such a tragic incident, Hopefully the American people never forget it.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "joe-knows-trump-won",
        "time": "31 August, 2022",
        "context": "Fun fact.\nJoe Biden dodged the Vietnam draft by claiming he had asthma, even though he played high school football and worked as a lifeguard, but was more than happy to vote yes on both the Afghan and Iraq war when he was in the Senate.\nHe would later call those two wars \"Illegal and unnecessary.\"",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "F100",
        "time": "31 August, 2022",
        "context": "In the last week Fox has flooded its homepage about Afghan girls. Why is this line of propaganda being pushed now?",
        "good": "0",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "marxismlost",
        "time": "31 August, 2022",
        "context": "Remember when Joey put the TALIBAN in charge of airport security?\n\nThat ended well, huh?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rconlan",
        "time": "31 August, 2022",
        "context": "A hero.  His blood is on your hands BRANDON!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "malbino249",
        "time": "31 August, 2022",
        "context": "RIP Brother Semper Fi",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "crimestopper1",
        "time": "31 August, 2022",
        "context": "Cpl. Lopez was killed by Biden. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "PTFO",
        "time": "31 August, 2022",
        "context": "And then biden gave their families name and addresses to the taliban and they were pulled into the street and SHOT!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "lmw62",
        "time": "31 August, 2022",
        "context": "You raised an amazing young man and a true American Hero.  Thank you and prayers to your family in dealing with his untimely death.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "Berengaria1",
        "time": "31 August, 2022",
        "context": "Thank God for our Young Men, who will do Their duty without Flinching.  This young man is a hero, along with his Brothers & Sisters in the Military.   Our Young Men WILL FIGHT & DO THEIR DUTY, but OUR LEADERS HAVE FAILED THEM & the AMERICAN PEOPLE.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "edwardch",
        "time": "31 August, 2022",
        "context": "Joe did that. How can he sleep at night?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "☠️XterminateTheAlphabets☠️",
        "time": "31 August, 2022",
        "context": "Amerikans, your politicians are sending your children to war to die for the sake of people not living in Amerika.  \nThe very same politicians you vote for are hard at work dividing you. \nWake up.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "F100",
        "time": "31 August, 2022",
        "context": "Only conservative news outlet in the US pushes a return to war. \n>Really makes you think.",
        "good": "0",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "paultaalman695",
        "time": "31 August, 2022",
        "context": "Dear Mr. and Mrs. Lopez:\n\nThank you for your sacrifice. Thank you for your son's service and sacrifice. He did himself, you both, your family, your community and nation PROUD!",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "honorthefallen710",
        "time": "31 August, 2022",
        "context": "Slow Joe keeps telling people this is his son Hunter.........",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "🦖TheEndisNigh🦄",
        "time": "31 August, 2022",
        "context": "That Marine is a Real American Hero, not a fake one like Joe and Hunter Biden.\n\nThey only thing Joe and Hunter need is to go to prison. Joe for Afghanistan and Hunter for corruption.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "gousa515",
        "time": "31 August, 2022",
        "context": "I have so much respect for our military and the sacrifices they make. THEY can see the ineptness of our leaders and politicians ,BUT choose to protect our nation and people who can’t protect themselves . God bless them and their sacrifices.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "xbidenharris",
        "time": "31 August, 2022",
        "context": "joe biden did this.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "lauraed73",
        "time": "31 August, 2022",
        "context": "What a terrible loss.  For all of us.  It hurts to see this.   And it hurts that the other young people were killed.  May God comfort the families and friends of Hunter and the other young people.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "lauraed73",
        "time": "31 August, 2022",
        "context": "They were all so young.  It makes me sick that they were put into a situation like this.  It did not have to happen.  I blame Biden and his incompetent generals.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "commonsenseguns",
        "time": "31 August, 2022",
        "context": "There had never been a single American servicemen death until Joe biden became president.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tongueNcheek",
        "time": "31 August, 2022",
        "context": "He was definitely a hero!",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jdatennessee911",
        "time": "31 August, 2022",
        "context": "So we honor the last ones to die in Afganistan but now ignore all the thousands that came before them. Why? ",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "thinkfirst911",
        "time": "31 August, 2022",
        "context": "Say their names Joe! \nDegan, Kareem, Max, David, Rylee, Jared, Hunter, Ryan, Taylor, Humberto, Nicole, Johanny, and Dylan!",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Gothic20",
        "time": "31 August, 2022",
        "context": "God love him. A true hero you will always be in the eyes of the world, Hunter. ",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bigduck66",
        "time": "31 August, 2022",
        "context": "We are seeing the decades of anti Americanism being taught in our schools at full force!",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "anthropologist2023",
        "time": "31 August, 2022",
        "context": "FOX is covering this like it's the most important military story in American history. But, it's not political, right?! 🙄",
        "good": "1",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "l³a",
        "time": "31 August, 2022",
        "context": "My heart aches for you.  Your son was a hero and I'm so very sorry he didn't make it back Stateside to enjoy life and be with you.  To your son I say: \"Semper Fi-. my brother and know you're handling all St. Peter's gate issues.\"  I too served.  3rd Engineer Bn, 3rd MAR Div, Vietnam '66-'67 - mention this only because I want you to know how so very, very sorry that he is no longer with us, like some of my brothers from the past.  May God lessen your sorrow as he rewards your son in Heaven.  Semper Fi-!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "legalvoter2",
        "time": "31 August, 2022",
        "context": "What a waste, saved them to come here and live off the government.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cm5090",
        "time": "31 August, 2022",
        "context": "Incredible heroes who selflessly served! We must never forget!",
        "good": "9",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "AnewPrincipium",
        "time": "31 August, 2022",
        "context": "I hope you read this article Biden because YOU caused this by a very unplanned and hasty withdrawal. You should have known better. ",
        "good": "11",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "bigduck66",
        "time": "31 August, 2022",
        "context": "What does honor mean to some?\nThe Lord asks that you as Christians put others above yourself. When someone joins the military I think most of them do just that, they put others above themselves! I get upset when people won't stand or burn the American flag and here is why! Those very hero's I just described get an American Flag draped over their coffin in respect of putting others above their own safety. How shallow have we become that we ignore a person giving up their own life to rescue others?  Freedom has always been paid for by people willing to sacrifice their lives to obtain it!",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "garciayalater",
        "time": "31 August, 2022",
        "context": "semper fi brother ",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "athousandpeopleinthestreet",
        "time": "31 August, 2022",
        "context": "By his deeds measure your own...",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Ajswfreedomispriceless",
        "time": "31 August, 2022",
        "context": "This is the reason we STAND for the National Anthem! We take this time to remember our HEROES! This is not a platform for anything else. ",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "john100056168",
        "time": "31 August, 2022",
        "context": "Hunter will always be a very proud & honored part of our community here in the Coachella Valley and will be deeply loved by us all forever.....",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "crushthelies",
        "time": "31 August, 2022",
        "context": "Will Fox News do a story on all of the 2,400 Americans who died in Afghanistan, or just the ones that suit the agenda?  It's a rhetorical question.",
        "good": "0",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "bigduck66",
        "time": "31 August, 2022",
        "context": "The Trolls Hammer Trumps about never severing, but Hello when did Joey serve? Joey has lived off the taxes payers his whole adult life yet the trolls feel Trump is the bad guy! HUH?",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "...ontheFly",
        "time": "31 August, 2022",
        "context": "This is a dead young man. For what cause? For what constitution? For what Liberty? Wake up America. Your boys are expendable. Chuck it up to being a service officer and that’s the job. Dear lord, our nation is a hucksters paradise. This man died to hide failure with more failure. Pin your stars on serving the nation and you will be dead. No hero here. Sorry. This is not serving. This is being a tool for a failed nation. You don’t have to like it. This young man should be alive. ",
        "good": "0",
        "bad": "7",
        "replies": []
    },
    {
        "user_name": "boldar",
        "time": "31 August, 2022",
        "context": "God bless this young man for his heroism and God Bless his family!  His mom and dad are first responders, and continue to sacrifice and serve us.  The family lives in my community and we think about him often.  Our local supermarket still has a memorial arranged recognizing their sacrifice.  A great young man taken too soon, but yet, had a lifetime of goodwill towards others.",
        "good": "7",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Geno2020",
        "time": "31 August, 2022",
        "context": "Thank you for your service and courage. Biden is responsible for his death",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "brucieb",
        "time": "31 August, 2022",
        "context": "Since when did Fox News care about Afghan girls? Or the war in Afghanistan?",
        "good": "0",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "kturner99",
        "time": "31 August, 2022",
        "context": "Pompeo a spy Putins a spy Brenna and Clapper are all spies, maybe all these wise enlightened spies can enlighten us to their global government?? They have spy blood in their veins, from the East to the West- ",
        "good": "0",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "GunsAGoGo056",
        "time": "31 August, 2022",
        "context": "This Marine was a hero.  To bad we did not have a principled person like him, in the White House.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "takeournationback",
        "time": "31 August, 2022",
        "context": "God Bless those in our military....especially since Biden is Commander-In-Chief!!!",
        "good": "4",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "karumba",
        "time": "31 August, 2022",
        "context": "Where’s his Medal of Valor? ",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "steve_o_knows",
        "time": "1 September, 2022",
        "context": "Thank you for doing this. This country owes soldiers a huge debt of gratitude. ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mytwofoxes",
        "time": "1 September, 2022",
        "context": "A good soldier is never forgotten.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "TOMT417",
        "time": "1 September, 2022",
        "context": "Rest In Peace Hero’s ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "anniemohara",
        "time": "1 September, 2022",
        "context": "Gold Star parents, I am so sorry for your loss.  Thank you for raising American heros.  Long may they be remembered!",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "GFNER",
        "time": "1 September, 2022",
        "context": "Another victim of the biden administration.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Pine630",
        "time": "1 September, 2022",
        "context": "Hero are those never make it back",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "idiotculler",
        "time": "1 September, 2022",
        "context": "Right now Fox is running six stories simultaneously about Afghanistan. Maybe the site should be renamed \"the Afghanistan Old News Channel\" or just \"We will pound on this till you all hate Biden as we tell you to\". Bit of a mouthful I guess.",
        "good": "0",
        "bad": "8",
        "replies": []
    },
    {
        "user_name": "johnlkuhn",
        "time": "1 September, 2022",
        "context": "West Point and Naval Academies taught and trained leaders from. both the south and the north.  President Lincoln did not disgrace either graduates fir their contribution to the states involed with the Civil War.  In 1865 both sides were brothers in arms not enemies in war.  Their service was not in vain, instead it confirmed that the union of states was more important to the continued development of our Democratic Democracy.  Lincoln was a Republican who believed all men and women were created equal, as today we all may learn from the past as a reminder that all men and women were created equal in the eyes of our God.  UT would do mire harm to erase either side from what was learn and lost from battles fought for freedom.  Democrats have never understand bravery under fire and now want to erase the strength this country molded between men and women who believed in THE UNION.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "donaldoraymundomartinez508",
        "time": "1 September, 2022",
        "context": "THE BIDEN POLITBUREAU AND HOME GROWN GESTAPO DON'T WANT TO BE REMINDED OF THEIR MISTAKES SO FOR THEM THIS NEVER HAPPENED AND DOESN'T MATTER.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "idiotculler",
        "time": "1 September, 2022",
        "context": "It is September. This story could have been justified last week, but Fox \nneeds to stop this pathetic drumming that ALWAYS avoids discussing \nTrump's Doha agreement with the Taliban (Feb 29, 2020 - see it on the \nState dept. website) which was a surrender negotiated in the absence of \nthe Afghan gov't.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "latinman316",
        "time": "1 September, 2022",
        "context": "Tough men!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "americanapostle297",
        "time": "1 September, 2022",
        "context": "In these challenging historic times that we are witnessing unselfish heroes \nneed to be recognized more than ever.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "buhski",
        "time": "1 September, 2022",
        "context": "Sure wish this \"All American kid\" was as passionate about helping his real countrymen in his own country. Mexico needs these young boys to go fight for their country.  I'm not sure if this young man's family has noticed but the country you left to rot is begging for your help...... We don't want or need your sons to sacrifice for America you need to have them sacrifice for your country so you people can stop exploiting my country.....",
        "good": "1",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "common_sense007",
        "time": "31 August, 2022",
        "context": "RIP Hunter - Praying for his family and friends for comfort and healing,  a true American hero",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rcamerica629",
        "time": "1 September, 2022",
        "context": "RIP, Marine!!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "SonsofAnarchy",
        "time": "1 September, 2022",
        "context": "God Bless your son, and God Bless parents who raised a kid right!",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "aspire188",
        "time": "1 September, 2022",
        "context": "My sincere sympathy and prayers for Cpl. Hunter Lopez's Parents and family. Hero that he is ~ I am sure does not make their suffering any easier.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "saltymarine878",
        "time": "1 September, 2022",
        "context": "Honestly I doubt these young Marines would consider themselves heros. To die for your country is something every Marine is prepared to do. We know when we raise our right hand and swear our oath to this country and the Constitution we may die doing our job. ",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "missmoffet23",
        "time": "1 September, 2022",
        "context": "God bless this young man and the parents that raised him.  Always thankful-always praying for our nation's heros! 🙏🙏🙏😪",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Pickypicky",
        "time": "1 September, 2022",
        "context": "We lost these heroes and nobody hasn't lost their jobs or resigned from it, like Mark Milley.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "pickaside1",
        "time": "1 September, 2022",
        "context": "He is a true hero. We Marines are proud and we mourn for our fallen brother. Semper Fi! ",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "proudmilitaryparents",
        "time": "1 September, 2022",
        "context": "SEMPER FI ",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bigbopper111",
        "time": "1 September, 2022",
        "context": "OUR GREAT HERO JOE BIDEN HELPING OUR SERVICEMEN AND WOMEN BY GETTING THEM HOME BEFORE MORE GET HURT!!!!!",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Pine630",
        "time": "1 September, 2022",
        "context": "Love you shipmates ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "akko",
        "time": "31 August, 2022",
        "context": "Magic doesn’t exist, and the FACT is that if the US Army stepped into the role of the collapsing ANA, the Taliban would have fired BULLETS, RPGs, and deployed IEDs that would have killed hundreds of civilians and a heck more than 13 US troops.\nWe were getting out, the ANA collapsed and we did the best we could without fighting the Taliban, which we couldn’t do, because President trump signed an agreement which guaranteed them an eventual victory and we ALL KNEW IT AT THE TIME.",
        "good": "0",
        "bad": "3",
        "replies": []
    },
    {
        "error": "error"
    }
]