[
    {
        "user_name": "ᏉᎾᏬᎭᎵ",
        "time": "26 October, 2018",
        "context": "Why do I see this not working out as we are told it should?",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "RedCoffee",
        "time": "26 October, 2018",
        "context": "Focused EMP guns or arrays to fry their electronics.  Physics is a wonderful thing.\n\n\"The electro-magnetic pulse generator, or EMP generator, is a device capable of generating a transient electromagnetic disturbance that radiates outward from its epicenter, disrupting electronic devices (or frying, depending on its capacity).\"",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "madjack990",
                "time": "26 October, 2018",
                "context": "And you think they haven't already considered this. Maybe why you don't have a job at DARPA. Pretty much everything electronic used by the military has EMP shielding. What makes you think this tech won't?",
                "good": "3",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "ComeInRangoon",
                "time": "26 October, 2018",
                "context": "Consider the size, MaddJackOff, it's about the size of your nuttlies.  As Larry points out below, its a few components.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "kyyankeefan",
        "time": "26 October, 2018",
        "context": "Michael Crichton (Jurassic Park, etc.) wrote a novel about this years ago.  Check out PREY ... swarms of microbots that develop autonomous intelligence.  Awesome stuff if you're a tech fan.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "AmericanPatriot61",
        "time": "26 October, 2018",
        "context": "Not to be an alarmist, but, if in fact this comes to pass...goodbye, humanity.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "nodakdave",
        "time": "26 October, 2018",
        "context": "John Connor will be proud.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "grigori_yefimovich_rasputin",
        "time": "26 October, 2018",
        "context": "This has arrived at the right time, it seems we have poisoned our environment enough that the insect population has dropped by 75%. Some have measured this by the amount of biomass collected on their windshield on an average day. Maybe in about 1000 years all life on earth will be artificial. I've seen a movie depicting this, including a thousand foot ice sheet covering New York City.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cardrock",
        "time": "26 October, 2018",
        "context": "Read Michael Crichton's \"Storm\" or watch the Black Mirror episode \"Hated in the Nation\"...These things are scary!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "subjectofgov",
        "time": "26 October, 2018",
        "context": "Nuclear power; make electricity too cheap to meter!",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "grigori_yefimovich_rasputin",
                "time": "26 October, 2018",
                "context": "Fukushima; Make the earth and our food source too radioactive to live with.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "dglsp",
        "time": "26 October, 2018",
        "context": "Bots... misnomer, these are sensors for larger centralized intelligence.... singularity, here we come.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "macss",
        "time": "26 October, 2018",
        "context": "And citizens need countermeasures for when they are used here.",
        "good": "8",
        "bad": "0",
        "replies": [
            {
                "user_name": "subjectofgov",
                "time": "26 October, 2018",
                "context": "Good luck with that.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "macss",
                        "time": "26 October, 2018",
                        "context": "Pretty easy for us actually.  Not being in a 3rd world country helps.  We have better electronics.",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "Iwillnotcomplytosocialism",
        "time": "26 October, 2018",
        "context": "And when the world finally runs out of some of the natural resources to build and run all the crap we use,\nwe will revert back to stone age times. And most humans will die off without the ability to feed shelter and clothe themselves.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jo825998",
        "time": "27 October, 2018",
        "context": "Big Brother is on alive and well--and improving his technology all the time.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Athens2",
        "time": "26 October, 2018",
        "context": "You can bet if you are reading about this it is already done and being used.",
        "good": "8",
        "bad": "0",
        "replies": [
            {
                "user_name": "Mostly_Kind",
                "time": "27 October, 2018",
                "context": "Yeah, they look like bugs and birds.  Ornithopters.  Even up close they look pretty realistic.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "error": "error"
    },
    {
        "user_name": "GladObamasGone",
        "time": "26 October, 2018",
        "context": "She always has cool stuff.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "larrysb",
        "time": "26 October, 2018",
        "context": "These are not \"robots\". These are simply ordinary electronic components. A couple of inductors, a couple of resistors, a couple of capacitors. Nothing but complete nonsense.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "grumpycat",
                "time": "27 October, 2018",
                "context": "What? You expected better accuracy from a modern journalist? Even one posting on Fox News? \"Nice small electronic parts! This will be a good pic to scare the readers!\"",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "SquabbyMan",
        "time": "26 October, 2018",
        "context": "\"I'm sorry Dave, I'm afraid I can't do that\"",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "BlackRobeBrigade1",
        "time": "26 October, 2018",
        "context": "Maybe SF could use them to clean up the poop on the sidewalks and streets.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cetanwakuwa",
        "time": "27 October, 2018",
        "context": "And.........\nthe religion of peace is already figuring out a way to use these to kill innocent people.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "FYUalumnus304",
        "time": "27 October, 2018",
        "context": "A lot of POTENTIAL to move from the battlefield and into your living room.  Will \"Little Brother\" need a warrant?",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Good2BTheKing272",
        "time": "26 October, 2018",
        "context": "I remember these pesky little guys in high school.  We called them crabs.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "deetrump",
        "time": "26 October, 2018",
        "context": "their most frightening use is landing on your head and exploding",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "krazyuncle",
        "time": "27 October, 2018",
        "context": "Best way to keep our troops safe -- bring them home, and don't send them in harm's way...",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "john1038154",
        "time": "27 October, 2018",
        "context": "And who thinks making microscopic machines that act and think on their own as a hive-mind and arming them is a good idea?",
        "good": "6",
        "bad": "0",
        "replies": [
            {
                "user_name": "svul8008",
                "time": "27 October, 2018",
                "context": "Check out Black Mirror's episode Hated in the Nation for a truly terrifying near future based on this \"game-changing\" technology.",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "johngielisch",
        "time": "26 October, 2018",
        "context": "This has tremendous potential for good. However it can also be used to spy on people without a warrant. be careful.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mgoodman1",
        "time": "26 October, 2018",
        "context": "Borg",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "shadowmv",
        "time": "27 October, 2018",
        "context": "Search for the short video \"slaughterbots\"...",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mivoyses",
        "time": "27 October, 2018",
        "context": "Many, many years ago I read The Invincible (Polish: Niezwyciężony) a science fiction novel by Polish writer Stanisław Lem, published in 1964.\nStory line: An interstellar space ship called Invincible lands on planet Regis III, which seems uninhabited, to investigate the loss of her sister ship, Condor. During the investigation, the crew finds evidence of a form of quasi-life, born from the evolution of autonomous, self-replicating machines, who millennia ago killed off their creators.\n\nPerhaps we should be paying attention?",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "maranatha1",
        "time": "27 October, 2018",
        "context": "Revelation 9?",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "AliceBowie",
                "time": "27 October, 2018",
                "context": "White Album !\nNo, that was Revolution #9.\nEmily Latella say, \"Nevermind.\"",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "SandmanLogan5",
        "time": "27 October, 2018",
        "context": "Scary. I wanna go back in time.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "error": "error"
    },
    {
        "user_name": "AnonAmous1961",
        "time": "28 October, 2018",
        "context": "If they are going to use drones in swarms, they may as well use hive like neural processing techniques to create a single digital neural net.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "jankney",
                "time": "28 October, 2018",
                "context": "How would they transmit information in that scenario? Stealth and autonomy would still be better.",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "lazer67",
        "time": "27 October, 2018",
        "context": "I guess Raid won't be of any use.",
        "good": "3",
        "bad": "0",
        "replies": [
            {
                "user_name": "PirateSteve841",
                "time": "16 December, 2018",
                "context": "LOL, Maybe a manned 4\" fire hose would be more effective than Raid.  Just Saying",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "OliveLobster",
        "time": "15 November, 2018",
        "context": "Most people would find this exciting, and it is; that is until artificial intelligence (AI) is deployed in mass fashion. That will be frightening as a scenario such as I-Robot could become a reality. I read a piece years ago about AI. The code back then was to the point where it could \"re-create\" itself. What that means is that the programming behind the AI, created a \"child\", which was a version of itself that it wrote without any human intervention. And somewhere around the tenth generation of the code, the scientists were doing some testing whereby the different versions were competing in some type of scenario and had to take turns while doing so. I don't rememeber the exact details, but suffice it to say that one of the \"child versions\" near the 10th generation started cheating. It learned to look out for its own \"best intertest\" and began cheating in the scenario being tested. Now imagine a few thousand or millions of \"child programs\" and what they might do. IE take over the human race or God knows what else. For me the worse case sceneia would be one the robots with the AI deciding it's a \"Democrat\". Me personally? I think the version that \"cheated\" was the first democrat on the upcoming robot world. May God help us, we'll need it.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "redfrog",
        "time": "29 October, 2018",
        "context": "1 question : HOW are these powered and charged ? WATT-up, perhaps.\nEnergous would be a perfect fit here if they aren't already in it. !!!!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "omcoh",
        "time": "17 November, 2018",
        "context": "A swarm of microbot drones and the womens' dorms.  Yeah, that's what I'm talking about.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "BarryJohnson",
        "time": "28 October, 2018",
        "context": "Military technology is always 20 - 50 years ahead of what they claim are the current newest toys.",
        "good": "3",
        "bad": "0",
        "replies": [
            {
                "user_name": "AnudaAnudaDave",
                "time": "3 November, 2018",
                "context": "Nonsense! I was a defense contractor. Uncle Sam would often spec projects  at the present limit of technology with the idea tech in all areas would increase many fold by the time the project was delivered. Only to paint themselves into a corner when the laws of science refused to budge.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "OliveLobster",
                        "time": "15 November, 2018",
                        "context": "You operate in the assumption that your partiuclar program area was the most cutting edge at the time. Additionally, the programs people participate in are defined by their clearance level. That said, eveything's always on a \"need to know basis.\" And as you said, you worked for \"a\" defense contractor and there are many. Therefore you were not aware of every defense project out there, and if you claim you were, then I'm sorry but I don't believe you.",
                        "good": "1",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "AnudaAnudaDave",
                                "time": "16 November, 2018",
                                "context": "The flaw in your argument is that we won the contract; and wouldn't have if your argument held.",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            }
        ]
    }
]