[
    {
        "user_name": "rubiks6",
        "time": "23 August, 2022",
        "context": "Billions of dollars being spent, and for what?",
        "good": "1",
        "bad": "4",
        "replies": [
            {
                "user_name": "Chas57093",
                "time": "23 August, 2022",
                "context": "For the technology that has made your life better. ",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "rubiks6",
                        "time": "24 August, 2022",
                        "context": "What technology would that be? Your answer is nothing more than a red herring. Do you think men would not have invented technologies without space flight?",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "thunker54",
                "time": "23 August, 2022",
                "context": "In 2020, NASA got 0.47% of the national budget. And NASA has produced inventions such as advanced artificial prostheses, insulin pumps, scratch resistant lens for your glasses, laser eye surgery, SOLAR CELLS, wireless headsets, freeze-dried food, cellphone cameras, the CAT scan, infrared thermometers, portable/laptop computers, the LED light, the computer mouse.... heck, even the dustbuster came from NASA.\nIs that enough \"what\" for you?  Because the list goes on....",
                "good": "1",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "rubiks6",
                        "time": "24 August, 2022",
                        "context": "Do you really think these things would not have otherwise been invented?",
                        "good": "0",
                        "bad": "1",
                        "replies": []
                    },
                    {
                        "user_name": "quietsmith",
                        "time": "24 August, 2022",
                        "context": "rubiks is one of our resident anti science creationists, literally anything that has anything to do with science is automatically a waste to them because all science is a conspiracy against Jesus.",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "retirednuke1983",
                "time": "23 August, 2022",
                "context": "Better than spending the money on canceling student loans.",
                "good": "4",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "rubiks6",
                        "time": "24 August, 2022",
                        "context": "It’s a waste either way.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "quietsmith",
                "time": "24 August, 2022",
                "context": "For a creationist who hates science to come in and cry about it apparently.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "justintyme",
        "time": "23 August, 2022",
        "context": "Joe Biden used to be an astronaut.",
        "good": "7",
        "bad": "5",
        "replies": [
            {
                "user_name": "Chas57093",
                "time": "23 August, 2022",
                "context": "He never made it past being a Space Cadet. ",
                "good": "2",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "fordprefec",
                        "time": "23 August, 2022",
                        "context": "Or perhaps a spaced-out cadet.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "KarenAnnJohnson",
                        "time": "23 August, 2022",
                        "context": "He's still a space cadet. His head is filled with it.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "skeff",
                "time": "24 August, 2022",
                "context": "He's the Captain John Gill of the USA.",
                "good": "0",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "fakeitgoodnasa",
        "time": "24 August, 2022",
        "context": "Will Nasa use a similar ‘three foil thick’ lunar lander that was “held together with staples and scotch tape” just like Apollo ?",
        "good": "0",
        "bad": "4",
        "replies": [
            {
                "user_name": "reconsurgeon",
                "time": "24 August, 2022",
                "context": "Those landers performed fabulously!  Thank your MIT and Grumman engineers!",
                "good": "4",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "fakeitgoodnasa",
                        "time": "25 August, 2022",
                        "context": "Indeed, they performed swell both in the desert and on the stage sets.. Now please tell me the specific instructions for human waste storage while they were ‘camping’ on the moon ?",
                        "good": "0",
                        "bad": "2",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "quietsmith",
                "time": "24 August, 2022",
                "context": "Oh there you are :D Wondered how long it would take for one of our resident crazies to show themselves.",
                "good": "2",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "fibonacci1.618",
                "time": "25 August, 2022",
                "context": "The foil belongs on your head.",
                "good": "2",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "dande-man",
                        "time": "26 August, 2022",
                        "context": "Good one",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "joemota580",
        "time": "24 August, 2022",
        "context": "This is a pointless exercise that will accomplish nothing. Another Trump ego trip whose only accomplishment will be to add $Billions to the national debt and provide some made-for-TV-drama. The money and effort would be better spent investing the scientific and technological horsepower towards the transition away from fossil fuels, which would save our children and grandchildren from having to endure the disaster of runaway climate change.",
        "good": "0",
        "bad": "5",
        "replies": [
            {
                "user_name": "reconsurgeon",
                "time": "24 August, 2022",
                "context": "How's that Kool-Aid tasting?",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "earlyprimate",
                "time": "25 August, 2022",
                "context": "Glad you are enjoying all of the technology that has been developed as a result of the Gemini and Apollo missions.  Not to forget the Space Shuttle as well as military tech that drove us to where we are now.\nTrump still living rent free in your brain, BTW this was mission was developed 2 Administrations prior to President Trump.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "joemota580",
                        "time": "25 August, 2022",
                        "context": "I understand and appreciate the technologies developed during the space program, which had a clear strategic national purpose. What we need today are technologies that will speed the successful transition away from fossil fuels. A national program like the space program but dedicated to that purpose would be far more beneficial than sending people back to the moon to perform tasks that robots could perform for 1/10 the cost.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "2ndnlong",
        "time": "23 August, 2022",
        "context": "Glad NASA is finally back in the space business instead of the weather business.",
        "good": "4",
        "bad": "1",
        "replies": [
            {
                "user_name": "ArneSaknussem",
                "time": "25 August, 2022",
                "context": "When were they in the weather business?",
                "good": "1",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "2ndnlong",
                        "time": "26 August, 2022",
                        "context": "Since Gore perverted the agency.  They all wanted in on the Nobel Prize they thought global warming was going to bring.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "ArneSaknussem",
                                "time": "26 August, 2022",
                                "context": "NASA does great work on glboal warming and climate change, but there are many scientists ahead of them for the Nobel.\n\nYou still haven't answered my question about the weather business.",
                                "good": "0",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "2ndnlong",
                                        "time": "26 August, 2022",
                                        "context": "I did and you confirmed it.  You are going for the \"climate isn't weather\" angle but the difference between the two is infinitesimal compared to climate change and manned flight.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": [
                                            {
                                                "user_name": "ArneSaknussem",
                                                "time": "27 August, 2022",
                                                "context": "My apologies, I'm not used to dealing with people who are scientifically illiterate.\nAlso, NASA has learned much more from unmanned flights than it ever will from manned junkets.",
                                                "good": "0",
                                                "bad": "0",
                                                "replies": []
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "letsgetrel",
                "time": "25 August, 2022",
                "context": "Finally? NASA has been doing magnificent space exploration, with missions to Mars, the Sun, and now the James Webb Space telescope.\nAnd they've never been in the \"weather business,\" whatever that means.",
                "good": "2",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "tbone1162",
        "time": "23 August, 2022",
        "context": "Biden started the space program.  U all should know that. He will tell you so. \nHe could also claim being the second Black president and democrats will believe him.  That's a fact!!",
        "good": "3",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "20yeara10guy",
        "time": "23 August, 2022",
        "context": "When dealing with rockets expect it will explode & be pleasantly surprised if it doesn't.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "fordprefec",
        "time": "23 August, 2022",
        "context": "A gigantic waste of money when our national debt is at a record high. We can better use that money to start paying off our debt. If we really need a moon mission, then let private corporations step up and foot the bill.",
        "good": "1",
        "bad": "10",
        "replies": [
            {
                "user_name": "williams33139",
                "time": "23 August, 2022",
                "context": "People like you said that centuries ago about expense when dudes like Chris Columbus set sail.",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "Chas57093",
                "time": "23 August, 2022",
                "context": "Wait. The 70’s called and they want you back. Try researching all the technology the space program has brought the US and the world. Without the space program you would still be talking on a land line and watching a 36 inch console TV. ",
                "good": "2",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "fordprefec",
                        "time": "23 August, 2022",
                        "context": "I lived through the 70s. In the late 60s and early 70s we had a much different economic and political landscape than we have today. Back then we didn't have an out of control debt and we could afford it. We can't now. Our nation is 30.7 trillion in debt and thanks to Biden's misguided economic policies, our economy is in a recession. We simply can't afford to do this right now.",
                        "good": "0",
                        "bad": "1",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "thunker54",
                "time": "23 August, 2022",
                "context": "In 2020, NASA got 0.47% of the national budget. And money well spent considering all the inventions NASA has provided us for our daily lives.\n If you want to focus on wasted money, just take a good look at all the illegals flowing across our southern border.\n Worrying about NASA's budget being too much is like worrying about fixing a leaky faucet while your house is being flooded.",
                "good": "12",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "fordprefec",
                        "time": "23 August, 2022",
                        "context": "I agree that we have a lot of waste in our government, but we have to start somewhere. We have already been to the moon. At this point there is absolutely no pressing need to do so again. Let's use that money for some more immediate priority.",
                        "good": "0",
                        "bad": "4",
                        "replies": [
                            {
                                "user_name": "thunker54",
                                "time": "23 August, 2022",
                                "context": "NASA has produced inventions such as artificial limbs, insulin pumps, scratch resistant lens for your glasses, laser eye surgery, SOLAR CELLS, wireless headsets, freeze-dried food, cellphone cameras, the CAT scan, infrared thermometers, portable/laptop computers, the LED light, the computer mouse.... heck, even the dustbuster came from NASA.\n The money for NASA is NOT \"wasted money.\"\nIf you want to \"start\" somewhere, start where there is the MOST waste, not the least.",
                                "good": "3",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "fordprefec",
                                        "time": "23 August, 2022",
                                        "context": "Look, I'm a dyed in the wool SciFi fan and would like to see space exploration proceed at an accelerated pace. I believe that space exploration is our future, but with the present state of our economy we can't afford it right now. We have a 30.7 trillion-dollar national debt. If that debt continues to grow, we will reach a point where our debt liability will be so high that no one will lend to us. At that point, our currency becomes worthless, and our economy comes crashing down in an event that will make the Great Depression look like a walk in the park. The truly frightening thing is no one really knows when we will reach that point. We could already be very close. We need to start paying down our debt (likely not going to happen under Biden's watch) and then at some point we will be once again able to afford to do these things. Meanwhile, the private sector is our best bet for the future of space exploration.",
                                        "good": "0",
                                        "bad": "2",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "user_name": "chiefsbrat",
                        "time": "26 August, 2022",
                        "context": "If your house is flooding you do worry about the leaking faucet while you address the larger flooding issue. \nArtemis is several billion that can go elsewhere.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "frantisek",
                "time": "23 August, 2022",
                "context": "We can better use the money that is being wasted on \"climate-friendly\" programs by sending it to the aeronautics and space guys.",
                "good": "4",
                "bad": "1",
                "replies": []
            },
            {
                "user_name": "aveinc738",
                "time": "23 August, 2022",
                "context": "And don't forget velcro.  Some people need it to keep their shoes on.",
                "good": "1",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "retirednuke1983",
                "time": "23 August, 2022",
                "context": "It's at a record high because your president lives to give away free money.",
                "good": "1",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "NoNo329",
                "time": "24 August, 2022",
                "context": "Yeah, but at $31 Trillion, and growing by the second, scraping the entire space program in relation to the national debt would be like relieving yourself in a heavy rain squall... not really noticeable.",
                "good": "1",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "reconsurgeon",
                "time": "24 August, 2022",
                "context": "A drop in the bucket compared to waste on social programs and INTEREST ON THE NATIONAL DEBT...",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "quietsmith",
                "time": "24 August, 2022",
                "context": "NASA is a tiny fraction of our budget, if we spent nothing on it we'd barely accomplish anything with terms of debt.",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "realist12345678",
                "time": "24 August, 2022",
                "context": "$93 billion over 13 years.\nThat's about 6 weeks of military budget. \nI think I know where we should be looking to save money...",
                "good": "1",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "dande-man",
                "time": "26 August, 2022",
                "context": "Your are almost right. That money would be better spent on other NASA missions. At 2 billion per launch we could have 4 complete missions at 500 million each for the price of 1 launch. NASA plans about 2 per you so in two years that is 16 missions that will not happen. For that money some examples of missions we could have done are Asteroid capture, missions to explore the planets, missions to address global climate change, research and development of new energy technologies etc. That is where the money should go. Private industry can do a much better job developing the needed heavy lift rockets to get us to the moon.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "dan5047628",
        "time": "24 August, 2022",
        "context": "How much is this moon thing going to cost tax payers?",
        "good": "0",
        "bad": "3",
        "replies": [
            {
                "user_name": "scion890",
                "time": "24 August, 2022",
                "context": "the moon's free ... and has paid off to a very great degree",
                "good": "2",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "dan5047628",
                        "time": "25 August, 2022",
                        "context": "It has made a lot of Corporations wealthy but has only hurt the tax payer.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "quietsmith",
                "time": "24 August, 2022",
                "context": "Here to cry about science again huh?",
                "good": "1",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "dan5047628",
                        "time": "25 August, 2022",
                        "context": "No just Money. Biden is spending enough",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "quietsmith",
                                "time": "25 August, 2022",
                                "context": "Nope, just science, because you hate it :D",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "fakeitgoodnasa",
        "time": "24 August, 2022",
        "context": "Glad to see that space flight fakery is continuing to be launched from Cape Carnival.",
        "good": "0",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "fakeitgoodnasa",
        "time": "25 August, 2022",
        "context": "Google “ heiwaco moontravel “ \n\nIt’s all propaganda folks, time to wake up.",
        "good": "0",
        "bad": "3",
        "replies": [
            {
                "user_name": "penguinsfan87",
                "time": "26 August, 2022",
                "context": "You need to be locked up.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "chiefsbrat",
        "time": "26 August, 2022",
        "context": "Why not do a fully robotic mission?\n\nZero need to place another human footprint on the moon and humans are costly to transport.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "g0disdead",
                "time": "26 August, 2022",
                "context": "We've already done that.  The point of Artemis is to begin the establishment of a long term presence on the moon.  The moon is a great place to launch manned missions to other parts of the solar system from - such as Mars.",
                "good": "0",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "chiefsbrat",
                        "time": "26 August, 2022",
                        "context": "Well, here's the rub. First, the Visa Card is really maxed out.\nSecond, using the moon to assemble a spacecraft and launch it to Mars or beyond, means a lot more work than assembling it in orbit because of the logistics to build a lunar base and staff it, plus the risk of damage to components getting them to the lunar surface.\nIf we were not sucking wind as far as deficit to GDP and debt to GDP and weren't fighting  record inflation, planetary exploration might be a great idea. But right now, it's adding thousand dollar rims to a car we can't afford and getting every package we can from Direct TV when we're having to sell blood to make the mortgage.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "g0disdead",
                                "time": "26 August, 2022",
                                "context": "That would be fine and  dandy if it was correct, but it isn't for a couple of big reasons.\n\nNASA has a net benefit to the economy.  Estimates of their ROI is between 7:1 and 10:1.  The new technology they develop or fund for these types of projects often finds use in the private sector.\n\nThe other reason is more about national security.  If we don't establish a presence on the moon soon, we are going to look up and find the Chinese smiling back at us.  Even Apollo wasn't as much about discovery as it was about a tech demo of our rocket tech for our enemies.",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "nickola13",
        "time": "24 August, 2022",
        "context": "why isn't it landing on the moon????\nkinda gives a little cred to the moon landing being fake. ",
        "good": "0",
        "bad": "4",
        "replies": [
            {
                "user_name": "slacktoad",
                "time": "24 August, 2022",
                "context": "It has no landing craft, it's just a capsule on top of a rocket.  The lunar lander (HLS) hasn't even been built yet.",
                "good": "1",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "fakeitgoodnasa",
                "time": "25 August, 2022",
                "context": "While Apollo was shot on a NV butte in Area 20, NASA is currently ‘perfecting’ their CGI to be similar to their staged fakery back then, yet it will be ‘enhanced’ if you will to wow the public.",
                "good": "0",
                "bad": "2",
                "replies": [
                    {
                        "user_name": "penguinsfan87",
                        "time": "26 August, 2022",
                        "context": "Forget locked up, you need isolated in the Antarctic with no cold weather gear.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "siriusdogstar079",
                "time": "25 August, 2022",
                "context": "Kinda doesn't.",
                "good": "1",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "g0disdead",
                "time": "26 August, 2022",
                "context": "This normal.  See early Apollo missions.  This is a test mission.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "siriusdogstar079",
        "time": "25 August, 2022",
        "context": "Why NASA, shouldn't Space Force be doing this? Their warp drive engines would make the trip so much quicker.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "letsgetrel",
                "time": "25 August, 2022",
                "context": "I assume you are being sarcastic, but sarcasm goes over the heads of most people here.",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    }
]