[
    {
        "user_name": "edgeco1",
        "time": "2 August, 2019",
        "context": "Maybe they can find out who was breaking into Cummings house.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "RubeCork13579",
        "time": "2 August, 2019",
        "context": "Big brother. We are paying now for not listening to McCarthy back then.",
        "good": "6",
        "bad": "0",
        "replies": [
            {
                "user_name": "edgeco1",
                "time": "2 August, 2019",
                "context": "Charlie McCarthy?",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "RubeCork13579",
                        "time": "2 August, 2019",
                        "context": "We listened to Charlie way too much!",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "maga2024beyond",
                        "time": "2 August, 2019",
                        "context": "Paul McCartney",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "mtwallet526",
        "time": "2 August, 2019",
        "context": "This will be crucial law enforcement tool before long. This stuff was tried out in Mexico and recorded a drug cartel killing and followed the criminals till they were caught. This and hi res video surveillance from above will catch on real quick.",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "VeroVeritas",
                "time": "2 August, 2019",
                "context": "The Good. What bout the Bad and the Ugly coming of this?",
                "good": "9",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "mtwallet526",
                        "time": "2 August, 2019",
                        "context": "I'm sure that there will be numerous excuses for using it. More good than bad, you know.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "LRkid65",
        "time": "2 August, 2019",
        "context": "Did not Capt America fight against something similar to this in the movie, but they were flying aircraft carriers. One step leads to next. \nFreaking govt types, all they think of is Big Brother schemes....",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "WarrensSmokeSignal",
        "time": "2 August, 2019",
        "context": "Gets out of backyard pool, looks up, quickly puts clothes back on and goes inside.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "AmericanByTheGraceOfGod",
        "time": "2 August, 2019",
        "context": "“We should not go down the road of allowing this to be used in the United States and it’s disturbing to hear that these tests are being carried out, by the military no less.”\n\nExactly",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "edgeco1",
                "time": "2 August, 2019",
                "context": "I don't see a problem viewing cars, since they are already open to public view, but private property is a whole other matter!",
                "good": "4",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "DaveTues",
        "time": "2 August, 2019",
        "context": "Left now \"oooh such a daaaangerous  idea! Intruding into people's privacy!\"\n\nLeft in power \"We need this to keep people protected.\"",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jiogoku",
        "time": "2 August, 2019",
        "context": "I do not like this, the gov has grown out of control.  Clear violation of the 4th",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "edgeco1",
        "time": "2 August, 2019",
        "context": "The Government should not be able to snoop on your property if it can't be seen from public property by means available when the Constitution was written!",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "iarenot",
                "time": "2 August, 2019",
                "context": "The Constitution also allows for contracts. When you buy your property you enter into implied contracts with both the State you live in and the Fed Gov.\n\nVery few States allow private ownership of real estate. I think in Nevada you can apply for allodial title to property by law, but it may be very difficult and expensive to actually obtain.\n\nIn most States and in most cases the State retains the allodial title to your property and you have surface rights by contract provisions. As your part of the contract you agree to pay property taxes and abide by legislated laws, statutes, ordinances, policies and procedures, and rules and regulations. The State's part of the contract is that The State will defend your surface rights.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "JohnD.",
        "time": "2 August, 2019",
        "context": "Too bad if you don't like it. You voted for Trump so this is what you get.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "autorotator",
                "time": "2 August, 2019",
                "context": "Yeah\nObie would NEVER do anything like this.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "autorotator",
        "time": "2 August, 2019",
        "context": "The right to privacy is the right to self. You \"own\" you. \nYou decide when you want to share you and when you don't. \nIt is really just that simple.",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "mtwallet526",
                "time": "2 August, 2019",
                "context": "Its \"supposed\" to be that way, but...",
                "good": "3",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "bsdetecter424",
        "time": "2 August, 2019",
        "context": "I seem to remember an ancient law against the military doing law enforcement in the US.",
        "good": "11",
        "bad": "0",
        "replies": [
            {
                "user_name": "EverettRobinson",
                "time": "3 August, 2019",
                "context": "These were just tests. If DHS did it instead, would that make you feel better?",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "jalind",
                        "time": "3 August, 2019",
                        "context": "Nope.",
                        "good": "3",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "jalind",
                "time": "3 August, 2019",
                "context": "It's not ancient. It's the Posse Comitatus Act. Has a couple of extremely narrow exceptions in the event of widespread insurrection or total breakdown of a state's government and its law enforcement agencies. This isn't one of them.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "thedixiebomber",
        "time": "2 August, 2019",
        "context": "It's wonderful, the government looks out for our well being. They are kind of like a Big Brother to us. It makes me feel so safe.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "patriotnowandforever",
                "time": "3 August, 2019",
                "context": "\"He loved Big Brother\".\n1984",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "esox07",
        "time": "2 August, 2019",
        "context": "What, does this mean I can't take a leak of my back deck any more????",
        "good": "5",
        "bad": "0",
        "replies": [
            {
                "user_name": "Nuralist",
                "time": "2 August, 2019",
                "context": "No.  You need to build a little brown shack out back.",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "publicbroadcastingsucks",
                "time": "2 August, 2019",
                "context": "Probably not without posting bond later.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "CactusJohn",
        "time": "2 August, 2019",
        "context": "Sounds like a real gas...",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jimfh",
        "time": "2 August, 2019",
        "context": "Can't let this technology get into the hands of a socialistic Democratic president and government, it would be another step into the Big Brother control that the progressive left wants for the USA.  Just think of what freedoms we could lose under the New Green Deal.  Under it's premise, the government could restrict your ability to go about your business because they would control all travel.  Part of their plan is to eliminate the current modes of transport in this country or to make them totally new.  Well in all of those new vehicles they could put GPS technology to know your every move, regulate your speed, and actually divert your destination.  Same holds true of airline service, they could control the entire schedule and make it difficult for the average person to travel anywhere, if we even have it for the common folk any longer they might force you to take a train.  The Green New Deal is not about climate change but about control and progressive leftist are trying to control you, not save the planet.  Most of the know they can't control the weather or climate, but they can control you if you let them.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "C0untryBumpkin",
        "time": "2 August, 2019",
        "context": "Why aren't they testing this where it may actually be useful: Chicago, the southern border, Detroit?  Nothing so exciting as watching Farmer John baling hay in Minnesota.  What a waste.",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "JVanCleef",
                "time": "2 August, 2019",
                "context": "While there may not be anything interesting going on at Farmer John's farm, there's a whole lot that they can test by flying balloons over his property.  Does the surveillance work well?  Can we control where the balloons drift off to in the wind, etc...",
                "good": "2",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "crusade_for_the_truth_reincarnated_III",
        "time": "2 August, 2019",
        "context": "What? Facial recognition, warrentless monitoring of our voice and Internet traffic and automated license plate readers aren't enough?",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "edgeco1",
        "time": "2 August, 2019",
        "context": "At 65,000 it can only see a 450 mile radius circle at most",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "iarenot",
        "time": "2 August, 2019",
        "context": "It is most likely that the purpose of the balloons is secretive and this article is part of a disinformation objective.\n\nWith the exception of mostly old klunkers, the movements of individual cars can be tracked via the cel phone network and their electronic feature systems, i.e. OnStar, Uconnect, etc. Individuals can be tracked the same way through their cel phones. \n\nThe Cel phone is the perfect surveillance device. It's absolute genius! The subject buys the device, pays for the service, keeps the device charged, and takes it with them everywhere they go.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "JVanCleef",
                "time": "2 August, 2019",
                "context": "Proud owner of one of those \"klunkers\".  It's okay though because I always bring my phone with me so they know where  I am.",
                "good": "1",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "autorotator",
                        "time": "2 August, 2019",
                        "context": "I totally avoid Onstar, Uconnect, etc.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "100%PureOrganicallySourcedRabies",
        "time": "2 August, 2019",
        "context": "I do not like this, it upsets me.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "autorotator",
                "time": "2 August, 2019",
                "context": "As the old Bloshevik said: \"If you have nothing to hide, what are worried about?\"",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "Arny.Plumb",
        "time": "2 August, 2019",
        "context": "Well Google would do it if they could, and that would make it alright to the liberals.\n\nFor the record all the technology exists to do this in real time using little more than your cell phone as a tracking device.  It knows where you are at all times.  Who is near you at any time.  Who you call, how long you talk, who you text, the contents of those texts (in the clear as well as encrypted).  All with the smallest amount of access to your phone.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "JVanCleef",
        "time": "2 August, 2019",
        "context": "I'm not suggesting anyone fire their guns up into the air at objects which may be spying on them, but...\n\n\nlol, who am I kidding?  Fire at will.  No, not at William.  At the drone that's spying on your wife in the bathtub.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "OrangeUmbrella",
        "time": "2 August, 2019",
        "context": "Of course your government will Never use these balloons for any other type of \"surveillance.\" Trust Them.",
        "good": "10",
        "bad": "0",
        "replies": [
            {
                "user_name": "bsdetecter424",
                "time": "2 August, 2019",
                "context": "Wait til facebook gets ahold of this.",
                "good": "3",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "mtwallet526",
        "time": "2 August, 2019",
        "context": "Yeah, O K.  You and your vehicle, are tracked nearly all the time right now. Cell phones, security cameras, Traffic cameras, License plate scanners, credit/debit cards, food stamp cards welfare cards, ATM cards. You get my drift. Any sense of privacy went out the window long ago. \n Now, complaining about it being tested doesn't help. It leaves a lot of questions unanswered as usual. And maybe that was the intent of the author.  Orr the government !",
        "good": "5",
        "bad": "0",
        "replies": [
            {
                "user_name": "autorotator",
                "time": "2 August, 2019",
                "context": "and, since nothing \"wrong\" is going on in there, it is time to remove the doors from toilet stalls.",
                "good": "1",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "Arny.Plumb",
                        "time": "2 August, 2019",
                        "context": "Obama did that.  No more gender privacy for you. . . . .",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "FruitFly",
        "time": "3 August, 2019",
        "context": "This technology + armed drones + robot cops + solar power + AI = Skynet. \n\nWinter is coming!",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "esox07",
        "time": "2 August, 2019",
        "context": "Seems to me that this is no different than people flying drones over your house or the government recording every phone call made.  Sure it would a very useful tool in many instances such as tracking criminals or locating missing people, but just like everything else the government runs, it will be miss used and our rights will be trampled.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "andersonfmly",
        "time": "2 August, 2019",
        "context": "Anyone who thinks we aren't already being tracked by government is BUZZZz!!!! ZAP! OUCH! tHAT HuRTS!!! STOP!!! GEEZ, ENOUGH ALREADY!!!... Sorry about that. Now, where were we? Oh yes, as I was saying, wait... Who were you again? Then again, who am I? Great googly-moogly. I WANT MY MOMMY!!!",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "flaxon",
        "time": "2 August, 2019",
        "context": "Don't have a problem with it since I'm a law abiding citizen.  Cameras catch bad guys everyday.....cameras save cops from being unfairly charged.............and this is for the protection of the country not to see if Joe is slipping into his neighbors bedroom when her husband is away.",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "esox07",
                "time": "2 August, 2019",
                "context": "The problem is that it will be miss used like everything else the government runs.  Just like when they were recording every single phone call in the US.",
                "good": "2",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "Soapbox71",
                        "time": "2 August, 2019",
                        "context": "Of course there is that possiblity.  HUMANS are using it.  Humans do inapropriate things all the time and misuse things.  It can either be used for good, or it can be used for evil.  HUMANS are in charge.",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "autorotator",
                "time": "2 August, 2019",
                "context": "Joe ?\n\nIf it won't do that, what's the benefit ?",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "BlueBottle",
                "time": "2 August, 2019",
                "context": "I have a problem with it. It's the law abiding citizens who loses when we lose our constitutional rights to privacy, all because people are afraid. These balloons are a direct results of what the terrorist hoped to accomplish. Reaction out of fear to alter our lifestyle and weaken our nation.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "CaliConservatitve",
        "time": "2 August, 2019",
        "context": "Paranoid much? It's just data capture and not identification and definitely not used for anything in the US for Law Enforcement or monitoring purposes as that's illegal and the government cannot use it to prosecute any cases. The military is testing it for a persistent surveillance system to protect bases in enemy territories abroad. this long term, high altitude platform is less susceptible to being shot down, tampered with or affected by low level weather patterns and it provides a greater safety footprint for troops as it sees farther than current systems. get a life people.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "DamianTD",
                "time": "2 August, 2019",
                "context": "Sure it is. \n\nHow are they \"testing\" it then? Obviously you need to know if it works for its intended purpose.",
                "good": "3",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "CaliConservatitve",
                        "time": "2 August, 2019",
                        "context": "They are testing it by turning it on to see what they see, making sure that it operates at the altitudes that the builder advertised, testing the effects of weather and other things such as temperature fluctuations, how winds affect them. They test the quality of the video and the data link that transmits the data. You can track a vehicle from point A to point B, as long as you don't violate a persons privacy by identifying who they are, by not running their license plate or their address or finding out their name through those queries. They are just making sure that it works as advertised. The Government can legally watch you, they just can't legally do anything to you based upon the principal of expected privacy. Now if you are outdoors committing a crime where anyone can see you and they just happen to see it too, then yes they can affect an action to make an arrest for that crime, just not anywhere where you expect be private, like the inside of your house unless they have a warrant to do so.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "publicbroadcastingsucks",
                                "time": "2 August, 2019",
                                "context": "It is surveillance. And no, they DO NOT have that right. But just try to stop them. Do you honestly believe thete is no way  now to watch you inside your home? Ha! The only thing they may lack is the  reason or the will.\nSoon enough the ability to do that en masse will be available as well.\nUgly world a comin' man. Glad I won't be here. Sorry for those who will be.",
                                "good": "2",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "CaliConservatitve",
                                        "time": "3 August, 2019",
                                        "context": "Wow, the paranoia runs deep with you. You obviously do not understand the laws governing surveillance and yes they DO HAVE the right to collect data, they just can't use it without cause. The data being collected for these tests are simply for ensuring that the systems themselves works. They aren't running plates and addresses and names, they just want to make sure that it works. \nAs for the surveillance systems themselves, yes they can see inside your house; infrared and thermal imaging have been around a long time and it doesn't make much sense for the military to not to be able to see what's inside something when they are trying to perceive a threat and as I said before, Law Enforcement can do it already but they need a warrant to do so.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "autorotator",
                "time": "2 August, 2019",
                "context": "Troops ?  You think ?",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "CaliConservatitve",
                        "time": "2 August, 2019",
                        "context": "We've been using Persistent Surveillance Systems for years for both military and Homeland Security reasons, this is just a new type, if it was being developed for Homeland Security then it wouldn't have been funded or requested by DOD, granted it could eventually trickle down to DHS but it's not on their radar right now. The PSS systems that the military is using now has been able to detect multiple incursions at our forward operating bases, DHS has been using them to detect illegal border crossings and aircraft and vessel incursions in to US airspace and territorial waters and for detecting smuggling activities both foreign and domestic.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "jhempel",
                "time": "4 August, 2019",
                "context": "It is sad to see this generation so willing to throw away freedoms that our ancestors fought and died for. There was a time when U.S. citizens didn't want an overbearing government controlling every detail in their lives. Freedoms are being lost a piece at a time. The ignorant liberal masses will cheer as the totalitarian government takes total control.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "autorotator",
        "time": "2 August, 2019",
        "context": "Are we in 1960 East Germany yet ?",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "bsdetecter424",
                "time": "2 August, 2019",
                "context": "1960 East Germany would be drooling over this.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "iaora",
        "time": "2 August, 2019",
        "context": "what if they are trying out a new way to track bad guys in the country. a 450 mile radius is more than you can drive in 8 hours, plus it is a moving radius being TiVo'd, so in a few hours they have TiVo'd very much. I don't like it but it is going to happen regardless of my like or dislike..........yes the Government is way out of control of the common citizen.................Big Brother is watching us all................",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "autorotator",
                "time": "2 August, 2019",
                "context": "Brave New World ?\n\n1984 ?",
                "good": "2",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "publicbroadcastingsucks",
                        "time": "2 August, 2019",
                        "context": "No. More like .... Hell.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "Nuralist",
        "time": "2 August, 2019",
        "context": "The dogs lean out of the balloon, sniff the air, and can pinpoint a drug truck to within 2 feet.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "100%PureOrganicallySourcedRabies",
        "time": "2 August, 2019",
        "context": "Wow, this isn't creepy and dystopian at all; no sir!",
        "good": "8",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Randall Horton",
        "time": "3 August, 2019",
        "context": "As if we are not under surveillance already!",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "wacojohn647",
        "time": "12 August, 2019",
        "context": "The balloons and equipment were all made/developed in China and until now, mostly used in N.Korea.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Form_America_First_Party_by_2022",
        "time": "5 August, 2019",
        "context": "If you want to deter border crossing and drug smuggling simply follow the USN's process for Sub Detection in WWII. Tether ZP-12 balloons along the border and off shore and equip them with the same surveillance systems in these high altitude balloons.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "EverettRobinson",
        "time": "3 August, 2019",
        "context": "\"'We do not think that American cities should be subject to wide-area surveillance in which every vehicle could be tracked wherever they go,' Jay Stanley, a senior policy analyst at the American Civil Liberties Union, told the British newspaper.\"\n\nSomeone should explain to Mr. Stanley that when you leave your front door, the government has every right to track your location. Whether they do it by a high-altitude balloon or a plain-clothes cop makes no difference.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "jalind",
                "time": "3 August, 2019",
                "context": "Uh - no - wholesale fishing expeditions and wide net casting is not allowed. It's considered invasive as the potential for misuse and abuse abounds, particularly by politicians who have political motives to use spying on political adversaries. Surveillance must have a specific target in mind for a specific reason judicial oversight and approval, the same as a search warrant.",
                "good": "12",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "EverettRobinson",
                        "time": "3 August, 2019",
                        "context": "That's not correct. You have a right to privacy so long as you choose not to enter the public view. The police surveil individuals all the time. Sometime without any good reason at all. They can't break into your house, your computer or your telephone conversations, but they can look in your windows if you leave them open.\n\nIf what you say were true, there wouldn't be any speed traps. There wouldn't be any DUI checkpoints.\n\nYou may not like it, you may consider it invasive, but it's 100% legal.",
                        "good": "5",
                        "bad": "1",
                        "replies": [
                            {
                                "user_name": "tablecloth",
                                "time": "4 August, 2019",
                                "context": "I will say only when it is on public land \nPrivate land is another can of worms\nand most every habitable place on earth is Private land",
                                "good": "1",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "EverettRobinson",
                                        "time": "4 August, 2019",
                                        "context": "You don't own the airspace above your property. That's the law...",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": []
                                    },
                                    {
                                        "user_name": "jcljedi",
                                        "time": "5 August, 2019",
                                        "context": "if it can be seen from public land.... IE high altitudes ........its fair game",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "error": "error"
            }
        ]
    },
    {
        "user_name": "Trumpism",
        "time": "5 August, 2019",
        "context": "Together with the Dems and the police",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Icouldberight",
        "time": "4 August, 2019",
        "context": "ACLU has lost all credibility. I’ll play the percentages; If they’re against it, I’m for it.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "markmaki",
        "time": "4 August, 2019",
        "context": "If they are going to spy on us at mass, they should also spy on other worship services.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ReasonableLoglc",
        "time": "3 August, 2019",
        "context": "Freezing temperatures and balloons don't mix well.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "VintageHouligan",
                "time": "4 August, 2019",
                "context": "neither do airplane propellers lol",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "WattaJerko",
        "time": "3 August, 2019",
        "context": "A test of technology within the borders of the United States where the balloons will not be attacked by some other nation's Air Force and where the terrain is already thoroughly known and understood gens-up so much vitriol from the leftists who are being manipulated by those who are seeking to cut their throats.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "IndyConverter",
        "time": "3 August, 2019",
        "context": "Big brother is watching YOU!!",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "wa5tef",
        "time": "3 August, 2019",
        "context": "Good ole ACLU!  They must stick their nose in anything considered against their liberal views.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "TidesInn",
        "time": "3 August, 2019",
        "context": "Why not tether the same type of balloons over any City willing to fund and manage it themselves! Local Police Departments could direct drones after tracking to bldg's. Drones could Tag any individual that exits the vehicle with paint or other means, that would be detectable by Officers who would be arriving\"Undercover\" at the same location, at the same time! Of course The Atheist Communist Lying Union will be against it.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Sgt_Truth",
        "time": "9 August, 2019",
        "context": "This article has 101 comments. Multiple articles discussing Castro pointing out djt donors have 1000's of comments each. I guess exposing the fact that djt is approving mass surveillance of Americans isn't as attention grabbing as manufactured outrage over someone posting publicly available information.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "M🇺🇸GA!!",
        "time": "4 August, 2019",
        "context": "2 mass shootings yesterday and yet it can’t seem to be stopped with all the current surveillance going on. Seems like all this is just more big brother in our lives to infringe on our rights while providing zero security that actually protects us.",
        "good": "13",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ralbaii",
        "time": "21 December, 2019",
        "context": "Another repeat by the deep state who spies on Americans for our own good supposedly. This is just a repeat of the NSA only in 3 dimensions so when the civil war begins the deep staters in the Pentagon will be able to see thousands of armed bikers approaching Washington D.C. to citizen arrest all the deep state criminals.",
        "good": "0",
        "bad": "0",
        "replies": []
    }
]