[
    {
        "error": "error"
    },
    {
        "user_name": "nordbert",
        "time": "5 September, 2022",
        "context": "#1-3 No government payoff of student loans.",
        "good": "42",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "phillipmckraken69",
        "time": "5 September, 2022",
        "context": "TLDR - we should get more workers.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "LGBTQ_Pride",
        "time": "5 September, 2022",
        "context": "Business could pay real wages, that would attract workers. They love to use supply and demand to excuse low wages, but they refuse to raise them when there is a shortage of labor... even when making huge profits.",
        "good": "2",
        "bad": "21",
        "replies": []
    },
    {
        "user_name": "M.Mc",
        "time": "5 September, 2022",
        "context": "Get rid of liberal policies.",
        "good": "18",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "californiamojo",
        "time": "5 September, 2022",
        "context": "Relying on H1-B’s instead of getting training paths in place is a big reason tech is seeing a shortage.    Short sighted policy",
        "good": "59",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "BOOGE1001",
        "time": "5 September, 2022",
        "context": "If the government would stop handing out money people would work.",
        "good": "70",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "magicmerlin",
        "time": "5 September, 2022",
        "context": "The only real solution to this problem, at least in the short term, is more immigration. Too bad since MAGAs have an entire platform opposed to that.\n\n\"Restaurant owner describes 'unprecedented' struggle to find workers: We've never seen this\" - reads the Fox News chyron. Maybe if MAGAs hated less on immigrants, they'd be able to enjoy a meal served by someone enthusiastic about making a simple living, including getting cheap produce picked by other immigrants happy to work the fields.",
        "good": "1",
        "bad": "16",
        "replies": []
    },
    {
        "user_name": "californiamojo",
        "time": "5 September, 2022",
        "context": "Pay more and make sure compensation keeps up with inflation",
        "good": "4",
        "bad": "7",
        "replies": []
    },
    {
        "user_name": "suzannemetfan077",
        "time": "5 September, 2022",
        "context": "I just love working 12 hour days to help able body people!!! This administration and Obama created the lazy!!!!",
        "good": "25",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "TRUMPISHUMANGARBAGE",
        "time": "5 September, 2022",
        "context": "PRESIDENT BIDEN HAS BUSINESSES BOOMING. SO MUCH THAT THEY CAN'T FIND ENOUGH WORKERS FOR THEIR BUSINESSES GROWTH.\n\n\nTHE FEDERAL RESERVE IS TRYING TO RAISE INTEREST RATES SO ALL THESE PEOPLE WITH JOBS MAKING LOTS OF MONEY STOP SPENDING SO FAST AND FREQUENTLY SO THE SUPPLY CAN CATCH UP TO THE HIGH DEMAND.\n\n\nUNEMPLOYMENT IS THE LOWEST IN THE HISTORY OF AMERICA AND THE US GDP IS THE BEST IN HISTORY.\n\n\nWHAT A CHANGE FROM TRUMPS 2020 RECESSION WHERE BUSINESSES WERE CLOSING DOWN.\n\n\nTHANKS FOR MAKING AMERICA GREAT AGAIN PRESIDENT JOE BIDEN.",
        "good": "2",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "dash1065",
        "time": "5 September, 2022",
        "context": "We are not facing a labor shortage; we are facing a shortage of people that want to do labor. And that is a government induced problem, not a market problem.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "GoldBug",
        "time": "5 September, 2022",
        "context": "Unfortunately most republicans are uneducated and companies don't want to hire them.  We need to just let these people at the border in the country on work permits. That will help a lot.",
        "good": "1",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "nothingbuta",
        "time": "5 September, 2022",
        "context": "Don’t forgive student loans!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "RolloJ",
        "time": "5 September, 2022",
        "context": "How are they living with no job or money?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "pamelacat01",
        "time": "5 September, 2022",
        "context": "The unemployment rate is low, unfortunately so is the employment rate.  Unemployment figures only count those who are looking for work and cannot find it, or have not accepted offers for some reason.  There are millions of working age individuals of sound mind and body who are not seeking work, hence, 11 million unfilled jobs.  Businesses are still closing down due to inability to find workers, and the massive increases in the cost of supplies and other overhead.",
        "good": "124",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "TRUMPISHUMANGARBAGE",
        "time": "5 September, 2022",
        "context": "WHY DIDN'T INFLATION GO UP DURING TRUMPS FAILED TERM?\n\nHINT: INFLATION NEVER GOES UP WHEN THE ECONOMY IS BAD.\n\nWHY: PRICES DON'T RISE WHEN THE DEMAND IS LOW AND PEOPLE DON'T HAVE MONEY. PEOPLE HAVE MONEY AGAIN NOW SO BUSINESSES ARE RAISING PRICES BECAUSE PEOPLE CAN AFFORD IT AGAIN.\n\n\nDUH.",
        "good": "2",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "SubVetLT",
        "time": "5 September, 2022",
        "context": "Give work permits in immigrants",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "OldTexan(UltraMAGA)🍊",
        "time": "5 September, 2022",
        "context": "Legislation...IE: throw more money at it... sheesh. You can't legislate people to work, just cut off the freebees",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "californiamojo",
        "time": "5 September, 2022",
        "context": "Let’s face it.  A lot of the problem is just really poor management",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "gustyrose",
        "time": "5 September, 2022",
        "context": "Companies say they are hiring but they take your application for their tax credit. Waiting forever to be called for an interview. Or company not in a hurry to hire. Every thing done online no proof that they even look at your application.",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "mdg161",
        "time": "5 September, 2022",
        "context": "Pell grants that taxpayers will be bailing out in 5 years. Dont think so. Fool me once shame on you fool me twice shame on me.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "LGBTQ_Pride",
        "time": "5 September, 2022",
        "context": "Businesses will use inflation to excuse their price hikes while making major profits, but won't pay their workers enough to keep pace with inflation... then wonder why people won't work for them 🤨",
        "good": "4",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "stemor",
        "time": "5 September, 2022",
        "context": "Picture in the article shows people lined up outside Detroit airport, and refers to it as DTX.\n\nDetroit is DTW. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jsnyde04",
        "time": "5 September, 2022",
        "context": "Quit paying people not to work…..",
        "good": "21",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "LGBTQ_Pride",
        "time": "5 September, 2022",
        "context": "Supply and demand. Low supply means businesses need to pay more. They refuse, and cry instead for the government to help force people into accepting low wages.",
        "good": "0",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "🥩RareRibeye🍺",
        "time": "5 September, 2022",
        "context": "Throughout my life there is one constant that I never fail to see when it comes to political issues. Politicians always claim to have answers to all our problems, lead us into more problems then come up with solutions to the problems they created. STOP WITH THE HANDOUTS!!!",
        "good": "15",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bearinthewoods441",
        "time": "5 September, 2022",
        "context": "Oh well...good luck with that, you voted for 75 million lazy people living off your dime.... deal with it.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "REDWOLFAMERICA",
        "time": "5 September, 2022",
        "context": "Young Liberals do not work.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mdmckin",
        "time": "5 September, 2022",
        "context": "People capable of working yet refusing to do so need to be pushed out on a frozen lake. Spring will solve the problem. I have no sympathy for them...",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "8448682",
        "time": "5 September, 2022",
        "context": "Open the border. Millions of workers died from Trump spreading Putin's virus.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "rpage",
        "time": "5 September, 2022",
        "context": "The national debt could be solved in one easy move.\nTake all of the Social Security money in the gov account and take it to Vegas and put it all on 13 black.\nSPIN THAT WHEEL!!!!! YEAH!!!!\nOh, 34??!!\nWell, seniors............time to go to work!!!\nProblem solved!",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "rpage",
        "time": "5 September, 2022",
        "context": "You're really insulting our intelligence here.\nEveryone knows that previous passed laws and edicts of past presidents has a direct effect upon what is happening NOW.\nBiden has been an arm chair qtr back.\nAnd, it's way too early in his reign for anything to be making such an impact.",
        "good": "1",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "TRUMPISHUMANGARBAGE",
        "time": "5 September, 2022",
        "context": "PRESIDENT BIDEN HAS BUSINESSES BOOMING. SO MUCH THAT THEY CAN'T FIND ENOUGH WORKERS FOR THEIR BUSINESSES GROWTH.\n\n\nWHAT A CHANGE FROM TRUMPS 2020 RECESSION.\n\n\nTHE FEDERAL RESERVE IS TRYING TO RAISE INTEREST RATES SO ALL THESE PEOPLE WITH JOBS MAKING LOTS OF MONEY STOP SPENDING SO FAST AND FREQUENTLY SO THE SUPPLY CAN CATCH UP TO THE HIGH DEMAND.\n\n\nUNEMPLOYMENT IS THE LOWEST IN THE HISTORY OF AMERICA AND THE US GDP IS THE BEST IN HISTORY.\n\n\nTHANKS FOR MAKING AMERICA GREAT AGAIN PRESIDENT JOE BIDEN.",
        "good": "1",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "donniedouchebag713",
        "time": "5 September, 2022",
        "context": "Fox calling for more GOPQT Guest Workers to take American jobs?\nYUP!",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "lechrenski",
        "time": "5 September, 2022",
        "context": "I stopped reading as soon as the auto-playing fake news video said \"the US is in recession 'officially' now\".",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "u.s.patriot174",
        "time": "5 September, 2022",
        "context": "I’ve been in executive management for 35 years. We have two very real problems now that we didn’t have when I was younger. Most large companies have HR departments and they use software to sift through applications based on their internal requirements. This process leave many, many resumes in digital limbo! We also have a major problem with age discrimination. I’ve seen this first hand, all these HR departments do is look at the year someone graduated high school and they know your age! Workers need to be 62-67 to get benefits and retire, but if your over 50 and looking for work the good luck!!! Companies rarely hire over 50. I think this is a poor decision given that so many younger workers don’t want to work! ",
        "good": "455",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "57234",
        "time": "5 September, 2022",
        "context": "Reduce the amount of govt employees that get paid to harass employers and employee’s. The biggest problem Americans face is the US government and its processes. ",
        "good": "56",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "tyredcynic",
        "time": "5 September, 2022",
        "context": "Get rid of the dole.\nMagically, everyone currently receiving handouts will be searching for gainful employment.\nA miracle, I know.",
        "good": "60",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "APEX_266",
        "time": "5 September, 2022",
        "context": "Wonder how many openings were created by “vaccine” mandates? 🤔",
        "good": "17",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "WalkerGW",
        "time": "5 September, 2022",
        "context": "Lol, can’t complain about low unemployment, so have to manufacture an issue. Poor businesses have to pay more to get high quality workers. Why are we complaining about this. And yes, it is all Biden’s fault.",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "thanatos",
        "time": "5 September, 2022",
        "context": "As Government Benefits (Welfare) Have Gotten Better, & The Usual Jobs Closed Due To The Covid-19 Scamdemic,. Ppl Have Found \"Side Gigs\" That Provide Enough Untaxed Income Along With Their Usual Govt Handouts To Get By, Sometimes Pretty Well!! They Are Expected To Give That Up For Paycheck Jobs??? 😂 Besides, As One Fellow Told Me, Who Knows If The Govt. Will Decide To \"Shut Er Down\" AGAIN???? THE WORKERS ARE THERE!!! Just Settled Into America's NEW REALITY @ \"Making A Living\"!!! ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "belikewater114",
        "time": "5 September, 2022",
        "context": "Here is the only intelligent solution.\nhttps://www.foxnews.com/politics/supreme-court-case-allow-green-cards-entered-us-illegally",
        "good": "0",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "57234",
        "time": "5 September, 2022",
        "context": "The democrats have the answer coming from Mexico. Remember, create the crisis, implement “solution”.  The biggest threat to our economy is the US government. ",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ButchS",
        "time": "5 September, 2022",
        "context": "Cut the government hand outs ",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "wolfgan1",
        "time": "5 September, 2022",
        "context": "IT workers have been working remote since the pandemic.  Many companies are hiring foreign workers to work remotely, so there will be no labor shortage for small companies who are building websites and mobile apps.  But it is worrisome for US to depend on foreign labor in this key area.",
        "good": "82",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "Independent831",
        "time": "5 September, 2022",
        "context": "Trump didn't have all these problems with America.",
        "good": "19",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mpdrew",
        "time": "5 September, 2022",
        "context": "Here’s a novel idea. Stop allowing people to take out immense loans to pay for garbage degrees, like race studies. And, the multiples of other degrees that do zero to actual provide an education for an actual career. Oh wait; we’re about to bail out many of those on our dime. What a joke…",
        "good": "12",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sinned22",
        "time": "5 September, 2022",
        "context": "let's see how about giving pet there driver license back most people don't have a license due to minor misdemeanor ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "special.master",
        "time": "5 September, 2022",
        "context": "Everyone living in mom's basement goes out and gets a job and then moves out like an adult.  We know your are designing a game, writing a screenplay, and recovering from some victimization--but do all that while working at a real job.",
        "good": "12",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Independent831",
        "time": "5 September, 2022",
        "context": "Vote for trump if you want your freedom back.",
        "good": "16",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "rpage",
        "time": "5 September, 2022",
        "context": "It's get'n too muddy in here.\nI'ma go'n!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "FailedTrumpCoup",
        "time": "5 September, 2022",
        "context": "Thank Biden for the plentiful jobs, Fascists!",
        "good": "1",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "fredie",
        "time": "5 September, 2022",
        "context": "I thought they kept telling us job numbers were up, and the point of all these immigrants were to work the jobs Americans don't want?",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "TheRepublicMatters🎬",
        "time": "5 September, 2022",
        "context": "How is this possible when the price for everything is going up considering there aren’t enough workers to keep prices from going up ?!",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Outlaw1967",
        "time": "5 September, 2022",
        "context": "I'm in the low voltage industry,  kids are graduating from tech schools that can't even read a multimeter or tell the difference from an open or closed circuit.  The older guys like myself are retiring early because we have to work twice as hard to pick up the slack for the same pay. Employers love hiring new techs, then wind up firing them as soon as the backlog is cleaned up.",
        "good": "16",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Independent831",
        "time": "5 September, 2022",
        "context": "Get rid of the Democratic party and the problem is solved.",
        "good": "13",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "phil111414",
        "time": "5 September, 2022",
        "context": "There are plenty of people to do the jobs but because of govt handouts they don't need to be \"workers\"..",
        "good": "148",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "TRUMPISHUMANGARBAGE",
        "time": "5 September, 2022",
        "context": "WHY DIDN'T INFLATION GO UP DURING TRUMPS FAILED TERM?\n\nHINT: INFLATION NEVER GOES UP WHEN THE ECONOMY IS BAD.\n\nWHY: PRICES DON'T RISE WHEN THE DEMAND IS LOW. PRICES DON'T RISE WHEN NOBODY HAS MONEY. INFACT THE OPPOSITE HAPPENS LIKE DURING TRUMPS FAILED ECONOMY OF 2020.\n\nWHY WAS GAS PRICES SO LOW DURING TRUMPS TERM: THE PRICE CRUDE OIL WAS SO LOW THEY COULDN'T GIVE THE STUFF AWAY. ALL THE TANKS WERE FULL BECAUSE NOBODY HAD JOBS AND WEREN'T BUYING OIL. \n\nLIKE IT OR NOT, IT'S ALL CHANGED WITH JOE BIDEN.\n\n\nTHANKS JOE!",
        "good": "4",
        "bad": "9",
        "replies": []
    },
    {
        "user_name": "Iyápi-wapásika_hemáčha",
        "time": "5 September, 2022",
        "context": "Why work when the government takes care of you cradle to grave.",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "46vintage",
        "time": "5 September, 2022",
        "context": "Regarding working longer and harder . In B.C. Canada , you work 8 hours at your standard pay rate , 9 , 10 , and 11 are time and 1/2 , 12th hour and beyond , is straight double time . This is the law , and the government tried changing it to 10 hour days at straight time so employers could force you to work 4 tens , The B.C. Federation of Labour took them to court and the Government lost badly . the court ruled that not only do you get overtime after 8 hours , but is a human right won in 1926 and not only can  you  not agree to working overtime for straight time , but your union can not sign it away in your behalf . Some of the local employers are still trying to get people to work 10 hour days at straight time .",
        "good": "4",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "johnn707",
        "time": "5 September, 2022",
        "context": "The real shortage we have in this country is not chicken wood or gasoline it's leadership courage and Common Sense",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "msc3509",
        "time": "5 September, 2022",
        "context": "They dont want to pay. ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "johnn707",
        "time": "5 September, 2022",
        "context": "This Nation needs Devine help and protection. Vote this November. Change is desperately needed. ",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "HarryBaals404",
        "time": "5 September, 2022",
        "context": "There’s no way we have a worker shortage. White House press secretary Karine Jean-Pierre stating last Friday that the U.S. has added \"ten thousand million jobs\" since President Biden took office. ",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cm4206",
        "time": "5 September, 2022",
        "context": "Alot of Companies don't offer Health Insurance.  So they work you part time",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "justicenetwork",
        "time": "5 September, 2022",
        "context": "Develop more AI, replace them all",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "theworld'sbitch",
        "time": "5 September, 2022",
        "context": "why work?? we gots handouts!!",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "hukre",
        "time": "5 September, 2022",
        "context": "The labor shortage is not caused by millions of people dropping dead, but millions of people surviving just fine without the need to work because they receive Biden money, i.e. government handouts. Stop the handouts and people will go back to work in a hurry.",
        "good": "18",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "dl12345a0",
        "time": "5 September, 2022",
        "context": "There is a labor shortage but not for the reasons stated here. The largest part of the labor force is retiring. The pandemic taught people how to survive on less. Also a lot of the jobs are low wage jobs where people are barely making enough to live on.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "DonnyBrook",
        "time": "5 September, 2022",
        "context": "I agree with the Pell Grant legislation. Anything that gets more Americans educated for the kinds of jobs that need workers is a good thing. Also, promoting higher standards for pay and benefits like health insurance will get more people in jobs long term. And I'm gonna say it, immigrants come here eager to work. Let's make that easier. Remember the crops rotting in the fields because there are not enough workers to harvest it?",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "mette",
        "time": "5 September, 2022",
        "context": "This prove US need more educated people and immigrants!",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Independent831",
        "time": "5 September, 2022",
        "context": "America is in a bad state because of Biden and you Democrats. TRUTH.",
        "good": "5",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "linus",
        "time": "5 September, 2022",
        "context": "Bottom line?\n\nAmerica needs immigrants.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "cmon_man",
        "time": "5 September, 2022",
        "context": "Why work when uncle joe will take care of you?  Between social program giveaways and under the table tax free Venmo jobs you make more money than some slob who is on the books 40 hours per week.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "splert048",
        "time": "5 September, 2022",
        "context": "Fire the left and hire Trump!",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "Buh_bye_Democrat",
        "time": "5 September, 2022",
        "context": "Democrat controlling since lockdown. Biden and Democrat Governors called for firing becuase Democrats want everyone to be vaccinated. Democrat owners and CEOs fired many employees for refusing to take vaccine. Great examples are airports and planes that been canceled everywhere.   Many were fired and not coming back. Thanks to Democrats 👍",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "RedCactus",
        "time": "5 September, 2022",
        "context": "1. Don’t vote Democrat\n2. Don’t be a Democrat\n3. Don’t associate with Democrats \n\nDang I should run for President. I just fixed the worlds issues.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Thinger",
        "time": "5 September, 2022",
        "context": "One thing that can fix the shortage\nTrump",
        "good": "11",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "freespeech535",
        "time": "5 September, 2022",
        "context": "GETTING RID OF THE TRASH IN WASHINTGTON D.C. WOULD BE A GREAT START.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mrdna",
        "time": "5 September, 2022",
        "context": "if you're part of the aristocracy, things are going according to plan. Lets go Brandon!",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "smartthink",
        "time": "5 September, 2022",
        "context": "You can’t change the value of work by raising wages. All that does is force a change in price of goods. In other words, inflation. ",
        "good": "4",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "izzy1980",
        "time": "5 September, 2022",
        "context": "Let all Latin American enter to the US 😂",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Lizzy436",
        "time": "5 September, 2022",
        "context": "All you gotta do is stop giving them government money. If they want to survive here they will have to get a job. ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "DirtySanchez122",
        "time": "5 September, 2022",
        "context": "The truth is that skilled workers are moving to countries that offer health care, annual leave entitlements, maternity leave, sensible working hours, a safe environment to raise a family and  work / life balance.\nI left 20 years ago and have never looked back\nOnly the illiterate and unskilled want to migrate to America these days.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "TomNJ1961xx",
        "time": "5 September, 2022",
        "context": "The local Burger King cannot even keep it's dining room open due to lack of workers. Are you kidding?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "studroy52501",
        "time": "5 September, 2022",
        "context": "Try math. 2019 stats showed 10k+ boomers were retiring each DAY. There were 2 years of shutdowns and many illegals heading back south at that time. We have a lot of back fills as we come up to full steam.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mikeymike1978",
        "time": "5 September, 2022",
        "context": "Isn’t it funny that not a single official has said anything about the pay being too low? They have a serious wage shortage in this country that’s the bottom line fix your own roads raise your own farm and then talk to us about how easy we have it to work in these places . There should be a 20k-30k incentive working at these jobs that pay less then 50k a year and I’m being generous.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "andewlongisland",
        "time": "5 September, 2022",
        "context": "You can trip over an illegal. What are they talking about. Sheesh",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "tbear82nd",
        "time": "5 September, 2022",
        "context": "They went to college for free and now have a master's in underwater basket weaving, you are just hiring for the wrong jobs.",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "hat.meister",
        "time": "5 September, 2022",
        "context": "Raise wages so people can spend lots of money on goods and services. Encourage unions. Socialized health care. Taxpayer funded childcare. Profit sharing. Guaranteed benefits. Thirty hour work weeks.  Four weeks paid vacation per year. Less taxes on small business. Inexpensive public transportation. Stop acting like getting the economy going is a big mystery.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Independent831",
        "time": "5 September, 2022",
        "context": "2 great thing's I might add.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "pietryka5",
        "time": "5 September, 2022",
        "context": "#1,2&3 = No more handouts. Get up in the morning and go to work or starve!",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Beard42",
        "time": "5 September, 2022",
        "context": "A living wage, healthcare,  and unions... oh sorry that too \"socialist\" ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "slewis727684",
        "time": "5 September, 2022",
        "context": "Quit giving out so many free hand outs... instead of medicaid people being forced to work, what about forcing the unemployed people to work... oh, my Lord, that makes too much sense... ",
        "good": "4",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "commonsense416",
        "time": "5 September, 2022",
        "context": "Labor participation is still lower than pre- covid. So Mr. Potatohead hasn't created one single job yet, that's impressive Joe. What happened to improving infrastructure and \"shovel ready\" jobs? ",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "toooutspoken1",
        "time": "5 September, 2022",
        "context": "Now why would you work when you can stay home in your pajamas and play video games, become a social media influencer, pretend to work and get paid for doing nothing by the government?",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Enlightened1378",
        "time": "5 September, 2022",
        "context": "3 things ?  I can resolve everything with 1 thing ……. Vote Republican !  End voter remorse !  Save the country !  Strong Republican leadership and resolve.  Restore our respect on the world stage !  All with one simple thing - vote Republican !",
        "good": "12",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "ivanawflitch969",
        "time": "5 September, 2022",
        "context": "The lazy sloths are waiting for those $15 an hr. french fry cook jobs.",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "milretired2",
        "time": "5 September, 2022",
        "context": "One more thing that would help would be to require SNS to report the income made by by US citizen \"influencers\" to the IRS.  Yes, this would mean turning over you SSN to the platform, if you don't want to do that, then get a real job.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Cytherian",
        "time": "5 September, 2022",
        "context": "Quit putting the effect of government ignorance on the employer.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jiminN.Texas",
        "time": "5 September, 2022",
        "context": "this is such a \"duh\" moment.  Fire s large percent of the work force for not \"getting the shot\" and then wonder why there is a worker shortage.",
        "good": "17",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "patriotmel082",
        "time": "5 September, 2022",
        "context": "no Society has ever flourished with a huge and growing parasite feeding off of it",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Cytherian",
        "time": "5 September, 2022",
        "context": "Breed More Entitlement.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Beard42",
        "time": "5 September, 2022",
        "context": "Republicans expect everyone to become a business owner (which is impossible) and think certain jobs aren't worth being paid a living wage... then complain about workers wanting rights... ",
        "good": "1",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "kadal620",
        "time": "5 September, 2022",
        "context": "Cutoff or reduce most welfare/monetary benefits.  Workforce will imediately increase.",
        "good": "15",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "seigfried9001",
        "time": "5 September, 2022",
        "context": "The number one problem is the federal income tax. There's no incentive to work. Get rid of it. ",
        "good": "0",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "accountant1967",
        "time": "5 September, 2022",
        "context": "Its sad when Democrats brag about the low unemployment.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mikeymike1978",
        "time": "5 September, 2022",
        "context": "Yes hard labor for 3rd of the money that these college grads got 20-30k at 125k wow and they did that across the board and all states cost of living isn’t alike wow wow wow ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "toooutspoken1",
        "time": "5 September, 2022",
        "context": "a smart electorate will defeat democrats; the left will not allow that...barefoot and pregnant, so to speak, is how the left wants its citizens...then they can be controlled and brainwashed.",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "gladgrandpalefttheus",
        "time": "5 September, 2022",
        "context": "Pay people a decent wage and benefits and  you'll get all the employees you need. \nWant a nicer car? You pay more. Not much different for people. ",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "jeffreymellinger",
        "time": "5 September, 2022",
        "context": "First you need to find a workforce that ain’t lazy and actually wants to work ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "frankd.d.d.",
        "time": "5 September, 2022",
        "context": "Get a Job so Joe Biden and his Family will be catered to for the rest of their lives .",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "johnnydango648",
        "time": "5 September, 2022",
        "context": "The worker shortage would be corrected if the government would stop \nhanding out freebees. People would have to find a job and support\nthemselves. ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "paulinperth",
        "time": "5 September, 2022",
        "context": "its not just America. Australia is screaming for qualified people. ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Martin__Quinn",
        "time": "5 September, 2022",
        "context": "Things like this happen when you murder  64,000,000 Americans through abortion.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "pullmyfinger499",
        "time": "5 September, 2022",
        "context": "Liberals MUST DINE OUT multiple times each week to keep up with their peers....\nSo here is what EVERY restaurant needs to do....\nOpen ONLY on Friday, Saturday, and early on Sundays....\nDOUBLE the menu prices....Liberals will spend ANYTHING to maintain their \"Social Status\"..... ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "peter-frigate",
        "time": "5 September, 2022",
        "context": "Retirement was an easy choice.  Desantis was forcing workers back early and we were given the option of returning to work or having our jobs given over to IT people in india.  What desantis did not realize was that there was a third option available for many of us.  ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "display2name2",
        "time": "5 September, 2022",
        "context": "A desperate lie. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "TRUMPISHUMANGARBAGE",
        "time": "5 September, 2022",
        "context": "IS MAGA GETTING EDUCATED BY DONALD TRUMP AND FOX NEWS? OMG, LORD HELP US..... PLEASE JESUS, HELP US.",
        "good": "1",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "nothingbuta",
        "time": "5 September, 2022",
        "context": "I’ve got a couple 10 year old Filipino boys for sale! ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "euartogullible",
        "time": "5 September, 2022",
        "context": "I personally think that many people's health was affected by covid.  Everybody just focuses on the people who died, and not on those who survived. There's a lot of people out there with weird impairments from their brushes with covid.  Whether you want to blame them on covid or the vaccines or simply two years of being shut down and people growing fat and lazy, this nation is NOT in as good of physical or mental health as it was before the pandemic.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "frankd.d.d.",
        "time": "5 September, 2022",
        "context": "Joe Biden thinks of people as \" Money Trees \" .",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "frankd.d.d.",
        "time": "5 September, 2022",
        "context": "I wonder how many of Joe Biden's Buses are going up to work in Napa Valley California , at Nancy Pelosi's $100,000,000.00 Vineyard .",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jj_applemeats",
        "time": "5 September, 2022",
        "context": "too many baby boomers. ",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "APROUDAMERICAN!",
        "time": "5 September, 2022",
        "context": "Government, get out of the way!!!!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jessespop95",
        "time": "5 September, 2022",
        "context": "Get a job so Biden can export more of our tax dollars and take care of illegals? No thank you.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "patriotmel082",
        "time": "5 September, 2022",
        "context": "this election unlike the last election needs to be secure no machines paper ballots ID we know by the end of the day who wins not two weeks to figure out who you want to win",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "nosocialism583",
        "time": "5 September, 2022",
        "context": "\"3 things we can do to fix it.\"\nVote in Republicans\nVote in Republicans\nVote in Republicans",
        "good": "17",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "h42b98e00",
        "time": "5 September, 2022",
        "context": "I thought the 3 solutions were going to be mexico, guatemala, and honduras.😐",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "nunyadamnbusiness",
        "time": "5 September, 2022",
        "context": "One step is needed. Stop handing people piles of cash for doing NOTHING. Hunger gets people off their tail ends and to work. ",
        "good": "14",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "gonjajj",
        "time": "5 September, 2022",
        "context": "1) Vote out democrats. 2 and 3, see 1.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "2Ashallnotbeinfringed",
        "time": "5 September, 2022",
        "context": "Wait...what? I was told Biden has created 2 million+ jobs. Have I been misinformed? ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "lamartek2",
        "time": "5 September, 2022",
        "context": "The solutions seem so simple, so WHY is this administration so unable or unwilling to make them happen??  Add to the list stopping extended unemployment and other benefits to those able but UNWILLING to work. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "MikeNess",
        "time": "5 September, 2022",
        "context": "Forget home ownership for a second, because with the boom in housing owning a home is completely out of reach for almost everyone under 30 years old.\nThe average rent prices have increased at a rate of 8.86% per year since 1980.\nGuess how much wages have increased in that same time?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jeaux",
        "time": "5 September, 2022",
        "context": "Move to China Elaine, and take Mitch with you.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "revolution858",
        "time": "5 September, 2022",
        "context": "Missed the 4th thing we can do and what the Democrats have opted for.\nCreate a recession and wait for the layoffs.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "operationpedropan",
        "time": "5 September, 2022",
        "context": "All Crisis manufactured by Biden no name Administration’s communist ,socialist. No one else to blame. Vote Republican, you can only stop socialism. ONLY SOLUTION.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "uniqueusername",
        "time": "5 September, 2022",
        "context": "Worker shortage? Biden just said the economy is stronger than ever before. Something isn’t adding up.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "clay1987",
        "time": "5 September, 2022",
        "context": "The MAGA ideology/dictator culture is making it unbearable for workers.  MAGA using big centralized State government to impose religious zealot beliefs on businesses and all workers/families having varying beliefs/situations.  Hostile work environment.",
        "good": "1",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "johnn707",
        "time": "5 September, 2022",
        "context": "if a 18 year old is not old enough to own a firearm and maybe five year olds aren't mature enough to change their gender",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "timetraveller",
        "time": "5 September, 2022",
        "context": "Wages have not kept up with the cost of living over the past 50 years. That ever-widening gap between wages and cost of living is not an empty void. That ever-widening gap is increasing profit that goes back into the corporation money chest and into the pockets of the CEOs. I know a medical technician that can't even afford the gas for her long commute to work, so she'll sleep in her car near her work during the week. But the doctors who own the practice and benefit off of her labors have recently bought new houses and several new cars. Those doctors wouldn't even be able to diagnose their patients without the expertise that this med tech provides. Here are three solutions to the labor shortage...1. Pay people what they're really worth. 2. Pay people what they're really worth. 3. Pay people what they're really worth.",
        "good": "3",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "shazza1425",
        "time": "5 September, 2022",
        "context": "The best way to build a healthy educated workforce is through affordable healthcare and education, something Republicans are opposed to.",
        "good": "3",
        "bad": "7",
        "replies": []
    },
    {
        "user_name": "cattywampus932",
        "time": "5 September, 2022",
        "context": "NO, more Pell grants.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "lessgovplease",
        "time": "5 September, 2022",
        "context": "I have a solution, stop giving out money. Hunger is a great motivator ",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tmacaroni084",
        "time": "5 September, 2022",
        "context": "Our young people are leaving school and taking a year or two off for different reasons that don't make sense. We have rundown neighborhoods that working class people spend more time down at the basketball court than at a job working. \nOur country needs to go back to enlisting our young into the military to learn discipline and better work ethics. Parents need to be more active in ensuring our young people start out on the right foot and encourage them to take the lower paying jobs to get to the higher paying positions. Stop allowing illegals to take jobs away from American workers.\nAs a manager with 30 employees, Black people are the worst when it comes to attitudes and work ethics.  There needs to be more technical training in school and prepare our people for the workforce. \nBad parenting in our country is the crisis but it is hard to correct when either you come from a one-parent household or both parents work.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Mwp2591",
        "time": "5 September, 2022",
        "context": "Most people work just hard enough not to get fired and get paid just enough money not to quit.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rdhoo",
        "time": "5 September, 2022",
        "context": "Welcome to the Democratic Plantation!",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Strayman",
        "time": "5 September, 2022",
        "context": "End handouts to able bodied working age adults. Problem solved.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "hopeful468",
        "time": "5 September, 2022",
        "context": "Too much common sense in those suggestions",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "kaboomaliberal",
        "time": "5 September, 2022",
        "context": "stop all the government handouts. ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "GotABigPair",
        "time": "5 September, 2022",
        "context": "So many people and opened up small business. I now have a Caucasian lawn service and a Caucasian trash pickup. Before they came around our only garbage option was a monthly dumpster because we live so far out of town.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "purpleman610",
        "time": "5 September, 2022",
        "context": "The problem is the elite colleges have convinced the students that trade skills are beneath them and that they should expect to grad from college and enter the workforce making $300k a year @ entry level",
        "good": "16",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Rampage1977",
        "time": "5 September, 2022",
        "context": "There ia no worker shortage. Govt gives away handout creating lazy, entitled, worthless human beings. Don't feed the animals ring a bell!",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "johnn707",
        "time": "5 September, 2022",
        "context": "Sick and tired of my tax dollar being wasted digging up dirt on Trump while the evidence is blatantly clear against Hillary Obama and Biden",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "RicLeeBat668",
        "time": "5 September, 2022",
        "context": "Here’s one tip. Get rid of Biden!",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "nomos",
        "time": "5 September, 2022",
        "context": "Get the government out. They have no jurisdiction. ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "idontlikeyousir",
        "time": "5 September, 2022",
        "context": "So let me get this straight we have a worker shortage along with record low unemployment? And this guy thinks the solution is more cuts for the rich? Please. Pay your workers a fair wage and work them normal hours and you'll get people.  ",
        "good": "11",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "akuru877",
        "time": "5 September, 2022",
        "context": "75 million on MedicAid.  thats as good as a government hand out to get VOTES. yes, obama has ruined our systems in so many ways. ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Mwp2591",
        "time": "5 September, 2022",
        "context": " I failed math so many times at school, I can’t even count.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "RoadRunner57",
        "time": "5 September, 2022",
        "context": "Run for a political office, there are no education requirements, no licenses, no permits required, just residency, age and citizenship!\nMuch tougher to be a barber, truck driver, real-estate agent, or many other occupations.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "phineas",
        "time": "5 September, 2022",
        "context": "#4, stop the extra COVID 19 payments. This is yet another manufactured crisis from the current administration.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Mk0272",
        "time": "5 September, 2022",
        "context": "They also need to kick a lot of people off SSI. There are far too many people getting a free ride by claiming to be \"disabled\" who are more physically capable than me!",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "trumpcultist606",
        "time": "5 September, 2022",
        "context": "The reason there is a 'worker shortage' is that the economy under Joe Biden is doing GREAT.   Thats the same reason for the inflation, too many people are making too much.",
        "good": "4",
        "bad": "8",
        "replies": []
    },
    {
        "user_name": "timetraveller",
        "time": "5 September, 2022",
        "context": "Wages have not kept up with the cost of living over the past 50 years. Remember when our parents or grandparents could buy a house with the equivalent of one year's salary. Now it would take about the equivalent of 10 year's salary to buy that same house!",
        "good": "7",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "BlueComet",
        "time": "5 September, 2022",
        "context": "We don’t have a shortage of highly skilled highly paid pilots. It’s the low paid entry level copilots and regional airline pilots refusing to work or consider the field for substandard pay, work rules. All employees who have had their pensions stolen and forced into The Federal PBGC program are tired of having their hard earned pension benefits stolen by unscrupulous business management using the bankruptcy laws as a weapon against employees.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Vetalways",
        "time": "5 September, 2022",
        "context": "I would bet if the governments would require employers to hire seniors that care to work on a affirmative action basis instead of their discrimination there would be a increase in employment! As it is seniors are losing and there is a limit as to how low we can go!",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "🇺🇸saynotodempolicies🇺🇸",
        "time": "5 September, 2022",
        "context": "Why I liked trumps policies. “all able-bodied people back to work”",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "RedGoggles",
        "time": "5 September, 2022",
        "context": "Too many young people are on benefits and who wants to work for a woke company or woke military or woke government?",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "idontlikeyousir",
        "time": "5 September, 2022",
        "context": "The net worth of the richest people have skyrocketed under the covid pandemic. All these fatcats have stuffed their pockets with your money from govt payroll loans and told you that you don't deserve squat! And magats will fight to the death for em.",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "triump73",
        "time": "5 September, 2022",
        "context": "\"Their bill, The JOBS Act, would allow Pell Grants to be used at technical schools and community colleges...\"\nWhy do I have to pay for someone to go to school to learn a trade?  I already paid for my education and I don't think its reasonable to expect me to pay for somebody else to go to school.\nIf someone wants to learn to be a programmer, welder, HVAC tech, plumber, electrician, then go to school and learn the necessary skills.  Kindly leave me out of your decision and journey.",
        "good": "4",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "CommonCents$",
        "time": "5 September, 2022",
        "context": "Here are 3 things that will help with the worker shortage.\nStop generous entitlement programs that make it easier not to work.\nStop generous entitlement programs that make it easier not to work.\nStop generous entitlement programs that make it easier not to work.",
        "good": "188",
        "bad": "4",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "kimbramorgan",
        "time": "5 September, 2022",
        "context": "For decades our  country has disparaged  people without a 4 year + degree.  At the   same time certification programs for low paying jobs, like medical assistant,  is silly expensive in some states.   Companies have  been automatically requiring a minimum of a bachelor's degree when it isn't necessary and discounting real time experience.  High school students are often discouraged from vocation school when it is the best track for them and will provide them with a good paying job and no student loan debt. We have ended up with a labor shortage and overwhelming student debt as a direct result of these things. ",
        "good": "216",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "PeterLong",
        "time": "5 September, 2022",
        "context": "Obviously what we need is millions more penniless, unskilled workers from south of the border. ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Thoughtpolice.",
        "time": "5 September, 2022",
        "context": "Stop corporate Bullying. ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "missouririchard",
        "time": "5 September, 2022",
        "context": "I grew up in a broken family that had to struggle fianancially till we were all out of school. By 8-9 years old I was cutting our own grass and trimming the hedges, to try and earn some pennies for my pocket. Having to wait till you are 16 to get a job of any kind, just seemed to keep me broke and poor. The first job was minimum wage, at an ice cream store with a grille, and that meant wages and discounted food. I fully understand child labor laws, but also feel there should be some leeway in letting the poorest of kids to earn enough for shoes and food. I never went to any high school paid events, we never had the money. Work never scared me at all, I was afraid of never being given a chance, to earn my own way. Schools working with parents and bussinesses could employ some younger kids to do light duty work, that helps the kids too.",
        "good": "12",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "BillyBush",
        "time": "5 September, 2022",
        "context": "This was created when trades and manufacturing jobs where demonized by higher federally funded education in jobs thst aren’t supported by employers who actually pay workers for needed jobs. \n\nDegrees in useless college Educations that aren’t supported by Employers who pay the workers are then are hung up on That’s my degree and I’m sticking to it. \nThey where naive and thought the University Sales pitch in professions not supported by real life paying employers was real. Not the federal government bails out this failure instead of the university that lied to the students. \n\nNothing is free. Nothing. So end there the imaginary Free world and require work. 1-2-3 jobs to pay for your own lifestyle ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "idontlikeyousir",
        "time": "5 September, 2022",
        "context": "I've always thought we should do something similar to south korea. When a kid graduates high school they have 2 years of government service. It doesn't have to be military they could do any number of civil functions. They could choose career paths that interest them and get a head start on life everyone profits.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "OliveBulb",
        "time": "5 September, 2022",
        "context": "My son has worked for the same company for 35 years as a heavy equipment operator. He shows up every day, unless it rains, and excavating work can't be done.  There are some who only come to work when they want to.  One young guy calls off for 2 and 3 days every week.  There was a time when someone like that would be fired.  Not anymore.  My son said if it was up to him, every time he came back after a 2- or 3-day hiatus, he'd tell him there wasn't any work for him that day and to come back the next.  He would do that for as many days as he was off that week.  Unfortunately, management won't do that, and he continues to show up only when he wants to work. There is no work ethic in today's young people.  None.",
        "good": "190",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "gonjajj",
        "time": "5 September, 2022",
        "context": "1) Finish school, academic or trade.\n2) Stay out of trouble so you can get a job and work hard.\n3) Marry the mother of your children.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "andrzejls068",
        "time": "5 September, 2022",
        "context": "Very simple --> STOP PAYING PEOPLE TO STAY HOME!.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "JB50CT",
        "time": "5 September, 2022",
        "context": "3 things: No Biden Administration, No Biden Administration, and… No Biden Administration.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "μολωνλαβε",
        "time": "5 September, 2022",
        "context": "There is no labor shortage.  If there are jobs to be filled, we need to stop paying people who don't work.  Problem solved.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "RedGoggles",
        "time": "5 September, 2022",
        "context": "Problem number one HR.  The automated candidate selection process disqualifies people if one term is missing.  NEXT:  experience, employer want years of experience.  If you are not providing it, you will end up where we are now.  I have an AS, BA and MA degree and can not get a job in my chosen field due to lack of experience.  College is not the solution, training is.",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "gem048",
        "time": "5 September, 2022",
        "context": "no more student loan foregiveness",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "lifeinlittlecalifornia-mn",
        "time": "5 September, 2022",
        "context": "Eliminate the Covid shot mandate for the airlines and you can fix that problem.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "fuzz4you",
        "time": "5 September, 2022",
        "context": "Kids need to get out of their parents' basement.  Even John Fetterman's parent did - when he was 45!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "usahaspoliticalcancer",
        "time": "5 September, 2022",
        "context": "Stop paying people to not work, problem solved. Nothing is free, and its time people get used to it once again. \n   ",
        "good": "15",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "DAVseabee",
        "time": "5 September, 2022",
        "context": "While licensing makes sense for doctors and pilots, there seems little reason to force florists, interior designers, cosmetologists, and tour guides to pay hundreds or thousands of dollars and complete extensive educational programs as a prerequisite for work. Indeed, many of these occupational licensing requirements in effect today have become barriers to entry that curtail competition.  \nLicensing WEEDS out all the unqualified individuals claiming to know  their profession. Do you want a beautician/Barber who doesn't know the 1st thing about hair. Do you want a contractor who doesn't know the first thig about building anything. I can list every trade or profession.\nIt appears that Iowa, has restarted training back in the high schools giving the kids the option of learning a trade and earning $$$$ while still in school. It used to be called VOCATIONAL TRAINING. Guys and Girls learn a trade, without the pressure of feeling they have to go to college. \nGet the UNIONS and the Federal Gov't out of our schools. End welfare! Cut back on Medicaid, watch how fast the labor market turns arround.",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "yankeecobber",
        "time": "5 September, 2022",
        "context": "Hey and for the first time in decades union membership is growing ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "coalloadingjohnny",
        "time": "5 September, 2022",
        "context": "First get a physical to see if you are sick lame or lazy. Then no job off to state road garage. Assign a job doing something. Cutting brush picking up trash etc. Then if you find something they can do hire them out to temporary work force ",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jmichaude",
        "time": "5 September, 2022",
        "context": "We need to refine our disability laws. Too many people who can work don't and live off the taxpayer. Problem for some of those people is that they fooled around in public schools and have no basic skills...can't read, can't think, can't write and can't speak respectfully.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "yankeecobber",
        "time": "5 September, 2022",
        "context": "Another sign of recession. Too much work!🤣🤣🤣🤣🤣😂😂",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ballbounces891",
        "time": "5 September, 2022",
        "context": "Here's a thought: Let Canadian snowbirds work when they are down for the winter.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "wtfunbelievable",
        "time": "5 September, 2022",
        "context": "Why do we need a strong labor force to sustain social security if you paid into it all your life? ",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Dynamo",
        "time": "5 September, 2022",
        "context": "Our schools should be focused on teaching life skills instead of CRT and transgender studies.",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bozobidensays",
        "time": "5 September, 2022",
        "context": "When there is a so called \"shortage\" the asking price for labor SHOULD rise. But Joe has so crippled the economy with fuel price spikes that the entire labor market is out of balance with survivable reality. Dump Joe and the labor \"shortage\" will recede as we are allowed to have our economy back",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "missouririchard",
        "time": "5 September, 2022",
        "context": "When harvest time comes and the farmers tell you sorry, we have no workers to get the food from the fields, are the IT workers and those working from home going to jump in the EV's and drive to the middle of the country to work in the field from sunrise till dark? Who are you going to feed, and will there be enough for you too?",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tsgtise",
        "time": "5 September, 2022",
        "context": "All this talk about student loan forgiveness. Instead, offer that money in the form of a scholarship or stipend only for students who attend vocational school or college in a field where there’s a serious worker shortage.",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ballbounces891",
        "time": "5 September, 2022",
        "context": "The socialist solution to this is to pay everyone not to work.",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "roomforyoutoo",
        "time": "5 September, 2022",
        "context": "When the government gives away money and benefits, why work?  Millions of illegals can't be wrong.",
        "good": "8",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "l.a.olman",
        "time": "5 September, 2022",
        "context": "it seems there is a new attitude about working and living,,,,,almost a sense of lower standards, goals and effort to move forward.  Not really motivated to succeed, just sort of like on cruise control. ",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "verysane",
        "time": "5 September, 2022",
        "context": "If one has no education and no allergy to a lot of makeup then a FN presenter is a possible career prospect. Getting to know many of the world's leading fascist on a first name basis is a real plus.",
        "good": "0",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "mr.normal",
        "time": "5 September, 2022",
        "context": "Maybe people shouldn't get paid to not work, does anyone think that should stop?",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "spike97809",
        "time": "5 September, 2022",
        "context": "Part of the problem is all these useless degrees kids are up to their eyeballs in debt for.\nTons of them working at Starbucks, Target, etc.\nThe US needs engineers, IT professionals, etc, not urban studies, sports management folks.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "DJ76",
        "time": "5 September, 2022",
        "context": "\"For even when we were with you, this we commanded you, that if any would not work, neither should he eat.\"  2 Thessalonians 3:10",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "GrannyKracker936",
        "time": "5 September, 2022",
        "context": "Chao is a Communist Chinese spy!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "051314",
        "time": "5 September, 2022",
        "context": "Isn’t she married to McConnell? She was a ‘let’s keep the swamp intact ‘ good old boy hire.  Much like\nManchin’s wife. ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "chatworthy111",
        "time": "5 September, 2022",
        "context": "Made in America, by the government.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "adkdad",
        "time": "5 September, 2022",
        "context": "Biden says the economy is great! Zero inflation no recession! ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "66-68VietnamVet",
        "time": "5 September, 2022",
        "context": "This might sound like a very odd fix, but let's think it through. Individuals on public assistance and not working are not paying into the tax system. Thus, they have no vested interest in how our tax dollars are spent. They vote simply for whoever promises to place another chicken in their pot. Politicians know this. Therefore, politicians who operate in this manner are actually misappropriating our tax dollars for their individual benefit. There is a very simple fix here to stop this growing trend. If an individual is on public assistance and not one hundred percent disabled, require that to stay on the assistance they must also work. The along places more individuals into the workforce. More importantly, it takes away the politician's ability to buy votes through their heartless promises of simply giving away more tax dollars. COVID money was a great example of this. It alone paid people more money to stay home than a lot of them made on the job. Shifting contractual debt from borrowers to taxpayers also takes away the need for a job. A great example of this is the college loan forgiveness program. It is also another attempt to buy votes. IF YOU WANT TO BE ELIGIBLE TO VOTE - YOU MUST BE A TAXPAYER PAYING INTO THE SYSTEM YOU ARE HELPING TO DEFRAUD WITH YOUR VOTES AIMED AT POLITICIANS WHO PROMISE THREE CARS IN EVERY GARAGE, WHETHER YOU WORK OR NOT. ",
        "good": "20",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "joseen",
        "time": "5 September, 2022",
        "context": "Please. Have a degree specializing in programming. All those jobs have been sent to India. That's why Biden dropped his everyone can learn to code story that he presented at the beginning of his tenure. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jcir",
        "time": "5 September, 2022",
        "context": "Competent workers are rare. incompetence is very high right now.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rattlebait",
        "time": "5 September, 2022",
        "context": "Unemployment is higher than the Democrats want people to know.\nMy neighbor works for Pennsylvania counting the working class. He said they are double and triple counting the each person..",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "hera123",
        "time": "5 September, 2022",
        "context": "News flash. If you want more women out there working, subsidize daycare.",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "msgordon1947",
        "time": "5 September, 2022",
        "context": "Many European countries like France are experiencing the same problems in recruiting qualified job applicants.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "trumpcultist606",
        "time": "5 September, 2022",
        "context": "The 'worker shortage' is because young people make more writing software or doing any tech related field than they do bussing tables.  Cheap restaurant owners that layed everyone off are finding no one wants to do that work anymore, the spell is broken.   They need to pay more, or the business they are in is not viable. \nBiden's economy is red hot.   If you feel 'inflation' , you need to step up to a better job like the rest of us.  \n If you are on a fixed income, you better vote Democrat or make your Republican come up with a plan...",
        "good": "2",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "rickthewalker",
        "time": "5 September, 2022",
        "context": "HVAC? My son-in-law got HVAC training, which took only three or so months. Top of his class and got a very good job not too long after. Problem is it is like 10 -12 hour days six days a week and on call some Sundays. And seasonal, so no work or pay during off months. And summer is always the super busy, so no time with family for summer vacations, etc. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "8448682",
        "time": "5 September, 2022",
        "context": "Millions of Americans died from the virus. GOP are still in denial. Millions of migrants could take their place. GOP are racists in crisis. ",
        "good": "1",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "yancy1929",
        "time": "5 September, 2022",
        "context": "rent at 2000 a month houses at an average of 300,000 great future for someone working for 10 a hour after deductions.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "walkingnformation",
        "time": "5 September, 2022",
        "context": "Nobody wants to work with their hands anymore. That's the problem. Everybody wants to sit in an office all day and send emails back and forth. Problem is, that doesn't create anything in the real world.",
        "good": "90",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "Vetalways",
        "time": "5 September, 2022",
        "context": "Locally we have manufacturing plants that had thousands on their payrolls in the 60s and 70s. Then came automation. Owens Corning Fiberglass Newark Ohio about 3000, now about 375. Rockwell Axle/Rockwell International had about 2500, older plant moved to new CNN equipped plant. Kaiser Aluminum had about 1500 employees now down to about 250. That's a lot of jobs where there is no vacancy.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rangobang",
        "time": "5 September, 2022",
        "context": "It’s not a shortage of workers but instead it is a shortage of individuals willing to work for the amount of money being offered.  Workers want to climb the ladder of success but without the associated stress and other hardships.  Also, individuals have no incentive to work when the fed keeps giving them handouts.",
        "good": "13",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "BigBadJohn",
        "time": "5 September, 2022",
        "context": "Here are 3 things we can do to fix it:\n1)  Vote straight Republican in November!\n2)  Don't allow Democrats to cheat (REQUIRE IDENTIFICATION TO VOTE & NO DROP BOXES).\n3)  Vote for Donald J. Trump in 2024!",
        "good": "8",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "mr0",
        "time": "5 September, 2022",
        "context": "1) stop  teaching our children they are all victims of something and entitled to free everything / get out and work for it. ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "adkdad",
        "time": "5 September, 2022",
        "context": "Let colleges underwrite student loans. You will see less people qualify, or many qualify for much less and tuition will come down!",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "hope7677",
        "time": "5 September, 2022",
        "context": "First how about you take away the never ending food stamps, medicaid, and hosting help that people got during covid and still haven't been stopped. People can't even stop them by calling. People won't go to work when it's better for them to stay home or for just one person to work minimum hours to keep the benefits. This has to stop first. They should've made colleges knock down the price of they are charging for their schools (courses) that don't employee anyone! ",
        "good": "13",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "lotusblossum",
        "time": "5 September, 2022",
        "context": "a shortage of people who REFUSE TO WORK! ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "hawaiiancpk656",
        "time": "5 September, 2022",
        "context": "1st thing I'll be doing for America and the worker shortage \nAll RED in November",
        "good": "7",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "Dodger1964",
        "time": "5 September, 2022",
        "context": "This article won’t win any journalism awards!  Not to even mention the vast amount of foreign workers that could be hired immediately shows authors political bias. ",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "adkdad",
        "time": "5 September, 2022",
        "context": "If the fix lies with the government, it will never happen! ",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "hera123",
        "time": "5 September, 2022",
        "context": "What are we doing to get Republican white women working and mothering, like every other demographic. I have two sister-in-laws and two cousins who never worked a day in their life after the kids were born and after the kid were out of the house. Black women already have the highest workforce participation rate of any female demographic.",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "hera123",
        "time": "5 September, 2022",
        "context": "White supremacy is bad for business. The chamber of commerce is calling for doubling legal immigration.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "suphawaii",
        "time": "5 September, 2022",
        "context": "Unemployment is at 3.7%.  Businesses just don't like the fact they can't hire cheap labor anymore.",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "grandma101",
        "time": "5 September, 2022",
        "context": "Cut off the government benefits ",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "PurpleClover",
        "time": "5 September, 2022",
        "context": "Black tv commercial actors don’t have a problem getting hired nowadays ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "GoodCigarsNeverDie-TheyJustGetReincarnated",
        "time": "5 September, 2022",
        "context": "America is nothing like it once was back when I was a younger man growing up in the early 1970s. \nBack then men were men, and we worked hard to advance in life. Not only to provide a better way of life for ourselves, but for our families. That’s back when Americans still done things based on what was \"right and wrong\" - and when principal, ethics, morals, and family value still existed - and those things still stood for something! \nAmericans were ALL \"United\" and we were ALL \"Patriots\" – we were a people that still believed in God and country. We carried our rifles & shotguns hanging in the back windows of our pickups - without having to worry about thieves stealing them to use against us during their crimes. We proudly displayed the United States flag and we stood at attention as the National Anthem played.\nNowadays, men are nothing but simple whine-bags that depend on others for everything. It is sad! ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "patrickhenryone067",
        "time": "5 September, 2022",
        "context": "Colleges brainwashing kids to look down on blue collar workers. ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sapinva",
        "time": "5 September, 2022",
        "context": "Pell Grants just increase the cost of education. Government needs to get out of the education meddling business.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "fastlanez",
        "time": "5 September, 2022",
        "context": "Maybe the women complaining about the fictitious wage gap could start applying to some of the more intense jobs, like in sewer, construction and coal mining ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Wolfcreek243068",
        "time": "5 September, 2022",
        "context": "Stop giving government handouts!  ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "hera123",
        "time": "5 September, 2022",
        "context": "Black women work circles around white women. What are we doing to get republican white women working and mothering like every other demographic.",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "ImNotSureWeNeedToBringGeorgeSorosintoThis!",
        "time": "5 September, 2022",
        "context": "Three words can fix it:\nVote\nOut\nDemocrats",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "letsgobrandon2024871",
        "time": "5 September, 2022",
        "context": "I’ll give you just one thing that can help : Biden’s resignation ",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "saltytaste",
        "time": "5 September, 2022",
        "context": "As Thomas Saul said, \"hunger is the greatest motivator to work\"...  People today have too many safety nets for failure, remove all their government handouts....",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rockingchair109",
        "time": "5 September, 2022",
        "context": "It's more accurately described as  \"workers that are willing to work\" shortage on the part of the youngest generation of American workers. They are way too coddled. \nThey would truly rather die than leave their parent's homes and cushy little computer setups. \nBut time does not stand still. Parents age and die, leaving their little cherubs out there on their own.  Once that happens, their day of reckoning will be here. \nJust teach them how to say \"want fries with that ?\" ha ha ha ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "hera123",
        "time": "5 September, 2022",
        "context": "The Chamber of Commerce is calling for the obvious, doubling and tripling legal immigration.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mark1963",
        "time": "5 September, 2022",
        "context": "Nothing is going to be a easy fix to the situation.  The pandemic has basically put the U.S. on a track that we are not accustomed to and cannot figure how to get out of it.  With a lot of business that shut their doors and stores closing almost on a daily basis.  It is clear we need real leaders in Washington to step in.  Stop with the hand outs and implement not just shevol ready jobs.  But a program where everyone can get back to work.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "TreeToad",
        "time": "5 September, 2022",
        "context": "She had 3 arrows and missed the mark each time. First what is needed is to stop forcing people to get the jab or lose their job then second stop handing out free money and third stop calling half the country enemies of the state and yes, I am talking to you Old Joe. ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "atomic855",
        "time": "5 September, 2022",
        "context": "#1  expand immigration!!!!",
        "good": "1",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "d746655",
        "time": "5 September, 2022",
        "context": "Let's start with \"Government isn't the solution to the problem, Government IS the problem\".  (Thank you Ronald Reagan).  Get government out of the solution business and let market dynamics deal with it. Companies want to make money and need people to do it?  They'll figure out how to find what they need which is what they have done for centuries.  People want to put food on the table, buy smartphones, take vacations?  Well, unless your independently wealthy (or subsidized by government), you need to WORK.  It's that simple.  Don’t have the skills?  Get them.  What a higher paying job?  Earn it, prove you can make more money than you are paid. That’s how the “system” works.  Government is NOT the answer!",
        "good": "15",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "unclestosh336",
        "time": "5 September, 2022",
        "context": "In the world of the socialist dems many people rest from their labors every day and have no intention of ever working. They just sit on their master's planation, waiting for their handouts, in exchange for pulling the \"D\" lever. It's not a life but I guess it's living - barely.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "adkdad",
        "time": "5 September, 2022",
        "context": "Get the government out of the equation. Too many perpetual free handouts, subsidized college loans.",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "walraven",
        "time": "5 September, 2022",
        "context": "This will be the excuse to let the next 1 million illegals into the country",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Wolfcreek243068",
        "time": "5 September, 2022",
        "context": "The unemployment numbers represent low paying service sector jobs, and not high paying manufacturing jobs.  ",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Greg412",
        "time": "5 September, 2022",
        "context": "You left out the most obvious thing and the only thing that really needs to be done, get rid of Democrats.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "LIKEAFOX",
        "time": "5 September, 2022",
        "context": "THREE THINGS THAT CAN FIX AMERICA'S WORKFORCE SHORTAGE:\nREMOVE PUPPET BIDEN AS PRESIDENT AND SEND TO NURSING HOME!\nREMOVE PUPPET BIDEN AS PRESIDENT AND SEND TO NURSING HOME!!\nREMOVE PUPPET BIDEN AS PRESIDENT AND SEND TO NURSING HOME!!!",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "carolinagirl27",
        "time": "5 September, 2022",
        "context": "No worker shortage prior to covid. People got stimulus money and stayed home.\nDon't need training classes. Stop sending benefits. They'll work",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tbanner",
        "time": "5 September, 2022",
        "context": "Here are some better ideas:\nRaise the minimum wage and enact living wage laws\nGive Shift workers to right to a set schedule at least 2 weeks in advance so they can make child-care and other arrangements.\nSubsidize childcare\nPaid Family and Medical Leave\nPaid Holidays\nInvestments in mass transit since many of these workers might not own cars",
        "good": "2",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "indpendantvoter",
        "time": "6 September, 2022",
        "context": "The biggest problem is the libberal f-ers, the sooner the whole bunch of them is gone.",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "murica572",
        "time": "6 September, 2022",
        "context": "America does NOT have a worker shortage. They have a wage shortage. They need to pay more money.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "techsavvy",
        "time": "6 September, 2022",
        "context": "Stop unemployment payouts.....that would help a lot.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "HiThere390",
        "time": "6 September, 2022",
        "context": "Exactly how many non-disabled people are living on Medicaid coverage with no income?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "truthisoutthere783",
        "time": "6 September, 2022",
        "context": "There will be enough \"workers\" if those border gates stay open. Then jobs will be in short supply and pay less. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bobobobo9",
        "time": "6 September, 2022",
        "context": "Most of the jobs needing to be filled require skill training and are English speaking. This is not the 'new immigrant' group from Texas.\n'STEM\" in high schools shoulda been in place 10 years ago.\nEncouraging entering the 'skills' trades shoulda been in place 10 years ago.\nI am remodeling my home. My electrician has a boat to play on.  My plumber has a new truck and a motorcycle to play on. Most of the construction 'workers' show up in newer trucks. These tradesmen are NOT lower income by any means.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "marco878",
        "time": "6 September, 2022",
        "context": "Cut off unemployment and stimulus payments.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rn66",
        "time": "6 September, 2022",
        "context": "Young people don’t want to work. There is no work ethic in them and all they do is stare at their phones. ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "vcdave",
        "time": "6 September, 2022",
        "context": "Quit giving the lazy, \"do-nothing's\" handouts and they will have to work, or starve.\nSimple.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "lloyder722",
        "time": "6 September, 2022",
        "context": "Right now I'm just amazed at lack of competent management. I work as a contractor and the site I work at has several entities. There's regulations and requirements for any expansion and they're always caught unawares. I report my concerns months in advance so they can be proactive yet they ignore or put things off only to make everyone's life miserable at the last moment. The management is relatively young and take on more than their experience would allow and they are played by people that only seem to exist to cause the problems to have something to do yet this managers only want a \"Yes\" man or woman and can't comprehend the full picture. People see this and employees don't respect it and when that happens it's tougher for them to even care anymore and just dial it in. Word gets out and these places have a tougher and tougher time staffing people.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "𝓑𝓵𝓾𝓮𝓶𝓾𝓽𝓽",
        "time": "6 September, 2022",
        "context": "In Saudi Arabia, they have what is called a 'guest worker program'....People from other countries arrive, work for a certain amount of time in various industries and then go home.  I have seen that first hand...It works and works well....The Saudi's don't need future voters like the Democrats do...",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "1357",
        "time": "6 September, 2022",
        "context": "Stop giving able bodied people free money, free housing, free schooling.  In Ocala Florida, the new gig is for young beggars (three of them as of yesterday in one area) with young children about 4 yeas old.  They waved signs and their hands to get your attention.  MEANWHILE, we are building a home and cannot get enough workers to complete a crew.  Jobs posted everywhere, but who wants to work when they can get free stuff?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "westernman094",
        "time": "7 September, 2022",
        "context": " Stop the handouts!  No work ethic in America any more.  People have their hands out expecting government to take care of them.  ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "peters56",
        "time": "6 September, 2022",
        "context": "I’d like to solve that one Pat,\n\nMore immigration \nMore immigration \nMore immigration \n\nDid I win? 😂😂😂",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "stopallimmigration146",
        "time": "7 September, 2022",
        "context": "This is all lies. The anti white jews want open borders so non whites can politically nullify white voters. The government is handing out cash to cause the labor shortage for a few reasons. The first reason is that they need to create wealth so it will exist to pay the interest on the money from debt scam. All money is created when someone borrows it. The borrowed money is erased back to nothing when it is paid back so where does the interest come from? It comes from the gov't creating deficits that will never be paid back. There are other reasons but they are all icing. Money to pay the interest is the cake. \nDeport all the non whites and the business owners will have to pay a living wage. ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "libertarian2008",
        "time": "7 September, 2022",
        "context": "I am sure that big tech and China are already working on replacements for low skill workers.  I have already seen a Wendy's that is using a kiosk to place your orders. I can press the buttons with symbols as well as they can. Don't be surprised the next time you go through a Starbucks drive through if the person taking your order is in India.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jpt86",
        "time": "6 September, 2022",
        "context": "Give people extra unemployment money to stay home and you create laziness! ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "iffartshadteeth",
        "time": "6 September, 2022",
        "context": "kids today want to be tik tok and twitter stars.....they don't want to do real work.    \nmy son-in-law (who works a part-time job as a sports coach) joined our daughter and grand-daughters for a beach vacation that we paid for.    he did nothing....not even throw out his empty beer cans.   for the first two days all he had to say was....i'm on vacation and i don't have to do anything; i can't believe i'm finally out of work.    amazing how his woke a55 miraculously 'missed' any work detail  but shows up for bloody mary breakfasts, truly lunches, and dinners out with his favorite cocktails.   ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ppt",
        "time": "6 September, 2022",
        "context": "Here's an idea - survey the marketplace for skills sought by employers.  Require schools and universities to reveal these stats (# jobs/salary) when kids select majors.  For example, forestry major - 5 openings nation wide, accountant - 50,000 openings nation wide.  \nCurrently, universities encourage useless degrees that don't set graduates up for success or meet the needs of employers.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tgate1",
        "time": "6 September, 2022",
        "context": "Don't tax the rich. Make old people work longer.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "jmmul123",
        "time": "6 September, 2022",
        "context": "Not an uncommon occurrence in the world today. Many countries lack \"employees\". ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "PapaRich853",
        "time": "6 September, 2022",
        "context": "\"With over 10 million unfilled jobs, non-elderly, non-disabled adult Medicaid recipients can be required to work, search for work, or pursue educational opportunities in exchange for their taxpayer-funded benefits\" - I must have been out of touch for a while. When did this become a non-requirement?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "thatchief",
        "time": "6 September, 2022",
        "context": "\"think software programmers, hospital technicians, HVAC specialists, and so on.  \"\nWHAT?  Computer science is a degree that is offered at the most respected universities on the planet.  \nHVCAC specialist is not. \nThese things are not even remotely comparable.  \nThat is the level of the drivel that Fox is currently peddling. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "taskman713",
        "time": "6 September, 2022",
        "context": "First, be honest. This statement\"America is home to one of the most productive, innovative, and resourceful workforce in the world. They are the backbone of our economy and the source of our national prosperity.\" is false. \nOnce we recognized that we are creating unprepared, lazy, entitled workers we can begin to solve the problem",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Signal25",
        "time": "6 September, 2022",
        "context": "Its interesting how the underlying issues are playing out..\nFor decades business has had the luxury of a surplus of workers who tolerated low paying jobs because they could easily be replaced. Pay people a living wage and they will work. \nHigher education loans that sign you up to be a serf for the rest of your working life have dissuaded many from getting the education they need for a lot of positions. The answer, as in the past, was to have well-funded public colleges -  not easy to get loans that just fuel an increasing tuition by colleges.\nAnd lets not forget making immigration harder. There are many tough jobs that native born Americans are not willing to do, particularly things like picking a harvest.\nSo basically, Republican policies have come home to roost - anti-union, anti-education, and anti-immigration have led us here.",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "unomas",
        "time": "6 September, 2022",
        "context": "The worst Secretary of Labor...ever displays why she was the worst Secretary of Labor....EVER !!!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sparky0000007",
        "time": "5 September, 2022",
        "context": "Good Job Biden.  Chasing everyone out of the transportation business.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "1moa",
        "time": "5 September, 2022",
        "context": "Stop mandating the useless \"vax\" and \"boosters\" would make a big difference too.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Reiwa3",
        "time": "6 September, 2022",
        "context": "For the past 20 + years - under a variety of Presidents and Political Parties in power - AMERICA has encouraged it's citizens to stay home and accept free money rather than contribute to the work force and society.\nHow sick is that?\nCommunist Russia and Communist China learned many decades ago that this kind of thing will not work.\nWhy aren't the AMERICAN people and their government smart enough to figure this out?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "donrob",
        "time": "6 September, 2022",
        "context": "With the workforce participation rate at 63%... and corp profits near 25%?  To cry shortage is hardly credible.  We have a business culture of brats who believe if they can't have their cake and eat it too, then they will try to short-circuit the system by bringing in migrants from Guatemala or lobbying for govt regulations that favor their business and stifle competition.  It's time to stop indulging in this big business delusion.  There is no shortage of workers.   In a free market, workers are always available, but you might have to pay them more than Guatemalans obviously...",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "anneb3369",
        "time": "6 September, 2022",
        "context": "Employers share some of the cause.  Company loyalty is nearly nonexistent.  Over scheduling work, staff reductions, routine mandatory overtime variation in work schedules. \n The standard response is don't like leave.  Perhaps that's why positions can't be filled.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "nomore58646",
        "time": "6 September, 2022",
        "context": "The solution is simple. Stop paying people not to work. Let them take one of the millions of jobs available. Take the money you were giving people to stay home and put it towards childcare so nobody has the excuse that they have kids and can’t afford childcare. ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jeremyrnr058",
        "time": "6 September, 2022",
        "context": "This is just the tail end of the cash giveaways, sadly low unemployment isn't going to last much longer.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "johnbt4444471",
        "time": "6 September, 2022",
        "context": "\"One proposal from Senators Rob Portman, R-OH, and Tim Kaine, D-VA, will do just that. Their bill, The JOBS Act, would allow Pell Grants to be used at technical schools and community colleges,\"\nDon't they know Pell Grants can ALREADY be used at community colleges? ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "arkbane",
        "time": "6 September, 2022",
        "context": "There's only one thing we need to do to fix it.  Pay higher wages.  We've finally reached the point where employers can't keep charging higher and higher prices while not raising pay.  Workers today make half what they did, in constant dollars, than they did in the 1950s.  It had to end sometime.  That time is now.  The baby boomers are retiring.  The number of workers available to do the needed work is falling.  The shoe is finally on the other foot.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "carmine24",
        "time": "5 September, 2022",
        "context": "America`s youth has the 13% work ethic, gnome sain?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bradk141",
        "time": "6 September, 2022",
        "context": "It is a good thing that Sleepy Joe is doing everything he can to destroy the economy otherwise we would have a real worker shortage.  With all of the upcoming layoffs there will be plenty workers available.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ryderwriter",
        "time": "6 September, 2022",
        "context": "craftsmen of the 18th and 19th century practiced on the job training, taking on an apprentice to teach the younger worker the necessary skills.  imagine if that were common today, boo was teaching next gen workers the skills they need. What would be the impact on student loans and available workforce?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "soapypb",
        "time": "6 September, 2022",
        "context": "The article makes some good points, but what are the people who aren't working but who could be doing?  How are they supporting themselves?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "stonetalons",
        "time": "6 September, 2022",
        "context": "Another fix. We are short of Registered Nurses. The government needs significantly raise rate at which Medicare participants have to pay increased premiums --- that level is way too low. There are MANY retired nurses who would return to work if this was raised. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "irony",
        "time": "5 September, 2022",
        "context": "The people didn't disappear, they don't want to work. \nJust wait until they completely destroy Oil and Gas, and the millions of jobs that go with it. \nThey have plans to 'destroy', but not a single viable plan to 'replace'. \nIf you haven't been to Venezuela, Welcome. ",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "trumpcultist606",
        "time": "5 September, 2022",
        "context": "Unlike Donald Trump, most people dont have daddy hand them 420 million dollars while evading taxes in the transfer.   They go to college to better themselves, and it usually works.   Yes, theres the Bezos or Gates fellow that do way better without a degree, but for every one of them, there is a million that fall on their face.   A degree works for most Americans.   Its our system.",
        "good": "1",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "vetteacher326",
        "time": "6 September, 2022",
        "context": "How can this be with all the illegals coming to find jobs....LOL",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "liberalitarian",
        "time": "5 September, 2022",
        "context": "Before Ronald Reagan we had a good program that allowed foreign labor to come and go on demand in California agriculture. We should bring that back.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "theantifederalist",
        "time": "5 September, 2022",
        "context": "Scarcity of labor? Look no further than federal spending on \"income security\".\nIn 2021, total federal outlays included:\nSocial Security   $1.1trillion\nMedicare and Medicaid   $1.5 trillion\nNational Defense   $750 billion\nNet Interest on debt   $350 billion\nCommerce and Housing   $300 billion\nEducation, Training, Employment and Social Services   $300 billion\nGeneral Government   $300 billion\nIncome Security   $1.6 trillion\nTotal   $6.2 trillion\nMajor categories of 'Income Security':\nUnemployment Compensation   $400 billion\nFood and Nutrition Assistance   $170 billion\nFederal Employee Retirement and Disability   $155 billion\nHousing Assistance   $90 billion\n'Other' Income Security   $830 billion\n\"Other Income Security\" payments exceeded the entire defense budget by nearly $100 billion. A very large number of people are being paid to stay home. This will have a predictably dire effect on the number of applicants for entry-level work -- why work when the federal government pays you to stay home? It's also likely that 95% or more of these folks vote for the leftists.\nAs you might expect, the culprit here is, once again, the federal government.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "over40victimoffate",
        "time": "6 September, 2022",
        "context": "Seems to me we need some more people.  People who want to work.  I wonder where we can get some?   Oh! ... look!  Gov Abbot is helping a bunch of them get to where they're going in the US right now!   Bring 'em on Govenor!  Send some more!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "t@rdigr@de",
        "time": "5 September, 2022",
        "context": "Unprecedented worker shortage + 'Secretly high' unemployment numbers =  I'm just never satisfied!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Independent831",
        "time": "6 September, 2022",
        "context": "Good luck on your own.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "makes_sense",
        "time": "5 September, 2022",
        "context": "Instead of giving away money to not work provide tax incentives for business to train and hire US citizens ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Andy1213",
        "time": "5 September, 2022",
        "context": "More jobs than workers, thanks Biden...",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "justthefaxs",
        "time": "5 September, 2022",
        "context": "America is facing an unprecedented WILLING-TO-WORK shortage. ",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jackdaripper",
        "time": "5 September, 2022",
        "context": "Cut off all government aid.  Period.  That will force the lazy to get a job.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "liemc",
        "time": "5 September, 2022",
        "context": "#1 thing to fix worker shortage: Tell your adult children, that still live with you, to to get off their fat a--ses & go out & get a job. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mittymo",
        "time": "5 September, 2022",
        "context": "Persons that have degrees in gender studies, feminist theory, ancient Greek, modern dance, geography, music appreciation, philosophy, English literature, archaeology, social studies, etc., from prestigious universities aren't about to accept menial employment. \nBut they want persons that perform that kind of work to pay off their student loans.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "RobertdB",
        "time": "5 September, 2022",
        "context": "If only we had 63 million more people in the country...",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "californiamojo",
        "time": "5 September, 2022",
        "context": "If republicans keep allowing corporations to use immigration to keep wages low, they will keep losing states to the democrats \nOnce they lose Texas , there will be no way to get enough electoral as to win the White House ",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "ThurstonHowellIII457",
        "time": "5 September, 2022",
        "context": "There is no worker shortage. There is a shortage of employers willing to pay more than uncle sam is paying people to not work.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "johnnyfavorite390",
        "time": "5 September, 2022",
        "context": "Yeah, lets all hear what China Mitchs wife has to say.\nI’m sure she has all our best interests at heart. \nFox suqs",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Boomerandrover",
        "time": "5 September, 2022",
        "context": "She's a crook just like her husband and anything she says needs to be investigated to see what sleazy tidbits there are hidden in the bill She's so fond of",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mittymo",
        "time": "5 September, 2022",
        "context": " Democrat governance is a shameful display of arrogance & ignorance.  The only question that remains is how low can they go.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "strongtruefree",
        "time": "5 September, 2022",
        "context": "It's no secret that when you pay people to stay home and not work they will continue to not work until the money stops.  Strategic and planned idiocy utilized to buy votes and seize more power. ",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "carmine24",
        "time": "5 September, 2022",
        "context": "How about you Don`t Work You Don`t  Eat, Problem Solved.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "madsmoker92552",
        "time": "5 September, 2022",
        "context": "It's outrageous, that a pack of cigarettes only costs pennies to make, yet the cheapest cigarettes are 5 dollars a pack. It's the injustice of the century. You wonder why no one wants to work? Well for smoker, you're just gonna steal it all in taxes.",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "lab17",
        "time": "5 September, 2022",
        "context": "Living on the milk supply of the government..I say cut the flow.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "steve1633",
        "time": "5 September, 2022",
        "context": "Legalize pot in more states so the country will have ever more spaced-out zombies looking to be taken care of instead of going to work.",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "mondwolf",
        "time": "5 September, 2022",
        "context": "US productivity has grown over 100% since 1980. CEO pay has grown over 200% since 1980. US company profits have grown 300% since 2012.  \nMeanwhile, The purchasing power of the US dollar has fallen over 100% since 1980. Furthermore US wage growth hasn't grown enough to cover the loss in purchasing power. Housing prices have gone up on avg. 300% since 1997. \nEmployers now look at workers as \"resources\" to be worked for the maximum amount of profit, payed the absolute minimum possible, with the absolute minimum benefits, and to be let go at a slightest drop in company products, or merely to gain a a temporary profit statement.  Stock options encourage CEO to do anything to raise short term profits at the cost of long term stability. Such as the yearly lay-offs of large companies like Boeing every 4th quarter, to raise the yearly profit margin. This is always followed by rehiring attempts in the next quarter.\nThe reason there is a worker shortage is that during Covid, Corporate America gutted their work forces to maintain profit, showed that workers didn't matter to them, and now no ones wants to go back at the same wage  prices with no stability, no quality of life, no hope of retiring, no hope of owning a home, and no hope of a better life for their children.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "quintleo",
        "time": "5 September, 2022",
        "context": "2 factors involved, one of which is going to get worse.\n(1) Aging of the workforce.\nUs Baby Boomers are RETIRING, and not enough younger folks to replace us - coupled with the current generation tending to feel more \"entitled\" and not being willing to work even if they DO land a job.\n(2) lingering effects from the Democrat-pushed (and somewhat Republican accepted) \"unemployment boosts\", that LET a lot of us Baby Boomers retire years earlier than we had planned to.\nIssue one was an ongoing issue BEFORE COVID, and is just going to get worse.\nIssue 2 will take a few years to recover from.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "redhatsgunnaredhat",
        "time": "5 September, 2022",
        "context": "Businesses aren’t entitled to labor. Want workers? Pay for them. The world and laborers owe you nothing ",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "wait!what?520",
        "time": "5 September, 2022",
        "context": "USA just not having enough kids to sustain an artificially created work environment economy (we actually don't need half of the junk out there)! $7 Starbucks coffee when home coffee had for $0.20 cents? Really?!",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "*It_Is_Written",
        "time": "5 September, 2022",
        "context": "** For years I have stated that no more than 1/3 of high school graduates should be allowed into college. 2/3s should be offered vocational training as we need hands-on workers.\n  Instead, we have high schools that promote 100% college attendance with many getting expensive useless degrees with no in-field jobs available.\n  These high school kids are being lied to by Liberal school administrations' that lead many into debt, depression and poverty.\n  Being a retired professional transportation worker, I'm pessimistic about our transportation infrastructure and thus our economy without extensive automation.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "thenakedemperor",
        "time": "5 September, 2022",
        "context": "It’s a myth that the labor shortage is all because of deadbeats who are living off assistance and refuse to work.\nOne major cause is shortage of childcare. One new mom I know of put herself on the waiting list as soon as she knew she was pregnant. 18 months later there are still no openings anywhere. Her employer would not let her work part time so she had to quit her job. Lack of child care is a serious problem and keeps many out of the work force",
        "good": "3",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "justthefaxs",
        "time": "5 September, 2022",
        "context": "\"You deserve more free stuff, and someone else should have to pay for it.  Vote Democrat and we will be sure you get mroe free stuff at the expense of others\"",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "1Rebel007",
        "time": "5 September, 2022",
        "context": "Someone should tell our Liar-in-Chief that, as the article says, we are experiencing the \"[W]orst worker shortage in recent memory.\" He doesn't know that. Biden lied and told us, \"More Americans are working than ever.\" Facts and truth are not his thing.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "slowburn",
        "time": "5 September, 2022",
        "context": "There a good paying jobs that don’t require even one day in college! Why not bring back Tec high schools?  That train students in real today trades I don’t mean teaching them how to push buttons on automated  machine! Students could come out of high school ready to do tasks that we need. The only problem is there would no money for polecats to divert.   ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "concernedveteran316",
        "time": "5 September, 2022",
        "context": "I can answer this in two words \"vote republican\".",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "onlyeng",
        "time": "5 September, 2022",
        "context": "It's a lot easier than that.  Stop paying people to not work.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ruggsy",
        "time": "5 September, 2022",
        "context": "Why? You get more money and benefits from not working. When You do not work you get.. free housing, food stamps and Wic, your kids school is paid for and you get free cash from Tanf.  Some states even give gas cards. Your Utility bills are half price or free. You get your student loans paid off. If you work you loose all of that, your check is Taxed, your money goes to the people not wanting to work. ",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "whatwillyoudoatvarykino",
        "time": "5 September, 2022",
        "context": "No problemo...they're all lined up at the border.   No experience required, will train.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "dicksnow",
        "time": "5 September, 2022",
        "context": "Quit paying people to stay home!!!",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Demsareinherentlyevil",
        "time": "5 September, 2022",
        "context": "Medicaid work requirements for able bodied persons should not “be considered”. They should be an absolute requirement.  Anyone living off of taxpayers without contributing to society is a burden we can’t continue to support.  They do nothing except vote for the fascist leftists because of promises of more money for nothing except their vote.  ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "LRay494",
        "time": "5 September, 2022",
        "context": "We don’t have a ‘worker shortage’, we have a ‘freeloader problem’! Quit handing out taxpayer dollars to everybody who’s to lazy to get their butts out and find work and see how fast those jobs get filled. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bosco33",
        "time": "5 September, 2022",
        "context": "Stop paying people to sit at home sitting on their fat dupa.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "behondrhetoric",
        "time": "5 September, 2022",
        "context": "I agree as long as a policy is in place that allows those on Medicaid to retain thier health benefits if they go to work for employers that fail to provide affordable health insurance. ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Boosnicks",
        "time": "5 September, 2022",
        "context": "Here’s a quick solution……stop handing out government entitlements to people who are capable of being employed.  Who would choose getting a job over free money, especially since people have been trained to expect the government to take care of them?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dukedevil050",
        "time": "5 September, 2022",
        "context": "It’s quite rich for this op-ed’s author, Elaine Chao, to be lecturing Americans on labor shortage issues when her family (invluding her father) has deep ties to the Top leadership of the Chinese Communist Part while operating a shipping business in China.  She’s married to Mitch McConnell - together this couple have done more to ship American jobs to China while extending the influence of China in the U.S.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "gungho",
        "time": "5 September, 2022",
        "context": "Actually the best way to solve the problem is for the government to stop paying people not to work.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "G.B.Texas636",
        "time": "5 September, 2022",
        "context": "Is this a Joke??!!\nIf your not qualified to take the test.\nMake the test easier to get the Unqualified hired.\nWhy test to start with?\nI get it!!\nThis why politicians don’t take tests.\nWhat a concept. Bang",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "trekd",
        "time": "5 September, 2022",
        "context": "Cancel the H1B program\nCancel programs that encourages people to stay home\nMake it a fine on employees to hire illegals\nWatch employers suddenly find workers\nOnce every american that wants a job, finds a job, then allow H1B program to start up again.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "huejayness",
        "time": "5 September, 2022",
        "context": "It's not rocket science. Stop giving free stuff to these dead beats. Eventually they will work or starve ",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "truthhurts1972",
        "time": "5 September, 2022",
        "context": "The current admin doesn't want to fix this they want the situation to get soo bad it destroys the economy and all industry. At the lowest point the government will assume control of all business and require all those receiving any government benefit to work for them... aka forced socialist work farms.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rollsroyce222",
        "time": "5 September, 2022",
        "context": "ELEIMATE UNEMPLOYMENT TO PEOPLE WHO QUIT  ON THEIR OWN, AND NO MORE FREE HAND OUTS PERIOD",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "yfreddig",
        "time": "5 September, 2022",
        "context": "I'm 75 and still working.  Can't tell you what I do but I enjoy doing it.  The benefits of work are too numerous to list here.  Too bad the Left coddles potential workers instead of providing them with incentives.  ",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "imrightyouknowit335",
        "time": "5 September, 2022",
        "context": "We have thousands crossing the southern border looking for work.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Rob254",
        "time": "5 September, 2022",
        "context": "Democrats run the country. There are no problems, just ever increasing challenges…",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "derek01",
        "time": "5 September, 2022",
        "context": "Easy, get rid of Dims and RINO's who foster government dependence to stay in office",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Overdrive",
        "time": "5 September, 2022",
        "context": "Not just workers, the employers are getting gov money also and they are not hiring even though they are running adds. Just watch websites like indeed for few weeks as I have done and some run ads for while and then puts just posted on them over and over. Some never stop even though I apply with experience, No tickets or accidents in over 25 years and with CDL, hazmat and tanker endorsments. Either that or there is age descrimination but they can’t say that. Sometimes I apply late night and before 8:00 am I’m already  getting the generated return about I  was not chosen before anyone in HR could possibly have read it.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "questionsanyone",
        "time": "5 September, 2022",
        "context": "The Lady is right on several fronts but she cannot or will not say the plain truth, our liberal \"safety net\" is far too liberal and plush. We have allowed politicians to expand benefits under the guise of being \"compassionate\" when the real intent was to buy votes. The state licensing is an over- reach for a barber - if he does a bad job, don't go back. If the florist does a poor job, don't go back. Sadly we have become dependents on the nanny state for our health, our income and our decisions as to what vendors are 'acceptable'. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "timbucktwo",
        "time": "5 September, 2022",
        "context": "Elaine Chao is an Elite with close ties to Communist China. Married to Mitch McConnel, as Secy of Transportation under Trump, the Transportation Department's inspector general cited numerous instances where Chao's office helped promote her family's shipping business. Cant Fox find someone else to promote?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dennis2333",
        "time": "5 September, 2022",
        "context": "Elaine, how about curtailing or stopping imports from China? Insist on production here and in friendly countries. It will benefit our workers and our Friends and … hummm…. reduce Chinese green house emissions and reduce dollars available to them for Russian oil and gas. That said, you don’t want to go there do you, Elaine?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "nolealum83",
        "time": "5 September, 2022",
        "context": "Need to reimplement food stamp work requirements for able bodied adults that were suspended when covid hit and we had double digit unemployment.  Now unemployment is hovering around 3.5% and there are 11 million jobs available.  No reason not to reinstate the the work requirements for this program.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "papadeago",
        "time": "5 September, 2022",
        "context": "Everywhere I go throughout my city all I see is 'WE'RE HIRING'.  Everywhere!  In my decades on this earth I never remember anything like this before.  And it all began January 2021 when Biden was planted in the White House with a pen.   ",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Rainmann86",
        "time": "5 September, 2022",
        "context": "Let the illegals work, even in union factories, then watch how fast the border gets closed up when they start taking union jobs for less money!",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "respectfullyold",
        "time": "5 September, 2022",
        "context": "Can ANYONE name even ONE THING that this congress has done \"FOR The People of THIS COUNTRY!?\"",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Zingerman",
        "time": "5 September, 2022",
        "context": "Add to the list work search requirements for able-bodied adults on Food Stamps.  From my (brief) inet research it looks like just about anyone can get Food Stamps in California these days (including young, able-bodied adults).  Don't know about other states, but I imagine it is similar in many of them.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Lightenupfrancis561",
        "time": "5 September, 2022",
        "context": "\"Medicaid work requirements should be considered for able-bodied adults...\".    What!? Are you insane!? You want to require an able-bodied adult to work in order to receive free taxpayer funded healthcare!? Oh, the horror! ",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "DânNguyen",
        "time": "5 September, 2022",
        "context": "Can our graduated students get jobs???",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "101ab",
        "time": "5 September, 2022",
        "context": "The nation doesn't have a worker shortage, it has a shortage of individuals that want to work. When twelve-year-old children buy junk food with an EBT card it sends them a clear message. No need to work if you can get it for free.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "KillerMcGirk",
        "time": "5 September, 2022",
        "context": "Let me guess....raise taxes?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ellmd",
        "time": "5 September, 2022",
        "context": "And the #1 way to bring employees back to the workforce? Cut off the free benefits for the gimmee crowd. The Bible states it plainly, \"If a man will not work, he shall not eat.\" 2nd Thessalonians 3:10.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "shakes123817",
        "time": "5 September, 2022",
        "context": "Easy solution tell Sloppy Joe to quit paying people with taxpayer money to sit home and do nothing!!!!!",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "ladybuckeye",
        "time": "5 September, 2022",
        "context": "Years ago .. after Covid had been around for a while .. President Trump encouraged people to get back to work & school. WHEN have you ever heard Bumbling Biden say anything even remotely similar to that? NEVER! Hiring signs are still everywhere, no matter how Biden tries to brag about job numbers. As a matter of fact, Biden has still not hit pre-pandemic job numbers. There is no worker shortage! There is , however, way too much government freebies & handouts.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "ladybuckeye",
        "time": "5 September, 2022",
        "context": "HIRING signs are everywhere!! Take away the government $$ freebies & handouts and see how fast people get back to work!! ",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "californiamojo",
        "time": "5 September, 2022",
        "context": "Decades of relying on immigration to fill jobs has alienated a lot of people. \nDon’t be surprised when they don’t vote the way you want them to ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ScottHunter09",
        "time": "5 September, 2022",
        "context": "because a $100 sign in bonus is a joke. They don't get full time, and they work  \nfor bottom prices and they left to peruse other things.Honestly those bosses deserve to go out of business \n ",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "indyinde",
        "time": "5 September, 2022",
        "context": "We have neglected technical training for decades, preferring instead to outsource technical jobs to Asia.  There is no incentive for companies to hire US workers when they can hire Indians, Indonesians, or Chinese for half the price.  That is what keeps inflation low.  Inflation in the UK is predicted to hit 20% by next summer, in part because of post Brexit labor cost increases.\nI am wondering if the author knows how many non-elderly, non-disabled Medicaid recipients there are that are not working.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "joeflynn",
        "time": "5 September, 2022",
        "context": "Remember these workers were call “Non essential “ during Covid and told to stay home. The message was we don’t need you, you are expendable non essential. The liberal elites were verbally speaking how they always felt about working class. Now the liberal elites want their slaves back!",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "krx",
        "time": "5 September, 2022",
        "context": "If you are able bodied and out of work six months you go to a labor camp.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "wait!what?520",
        "time": "5 September, 2022",
        "context": "Women joining the workforce (back when) spoiled America to a set number of workers, when women decide to stay home to care for kids cuz babysitters cost too much, a so called \"shortage\" occurs.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "wait!what?520",
        "time": "5 September, 2022",
        "context": "Children (Worker) shortage created by: Poor, Selfish, Gay, Delaying, Environmentally Conscious, Unlucky meeting other (Demographics), Peoples courtship behavior, Divorce Etc. Many countries allow immigration to take up this slack.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "RTZZZ",
        "time": "5 September, 2022",
        "context": "Well that is the answer right there, 75 MILLION people on Medicaid hand outs?   I had no idea...but that is just ridiculous.   OBAMA destroyed this country, Biden is just making sure we never recover.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "LibsCreatedTheUSConsWereLoyalists",
        "time": "5 September, 2022",
        "context": "Roaring economy. Thanks Joe.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "truthinamerica270",
        "time": "5 September, 2022",
        "context": "The recession will solve the lack of workers needed.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ah40",
        "time": "5 September, 2022",
        "context": "-License requirements continue to grow, because government wants them to grow. \n-There is no labor shortage. There is a work ethic shortage. Too many ways to be dependent.\n-As for workforce training grants at community colleges, why not make high school useful first?\n-Attitude is a thing here. As my A/C guy says, I can't find young workers who will stay off their phones.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "thiswayout",
        "time": "5 September, 2022",
        "context": "After collecting unemployment for 2 years maybe their lazy carcasses can get up off the couch and do domething.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "ch3k.ur.r3ality",
        "time": "5 September, 2022",
        "context": "Unemployment has increased. Some corporations have frozen hiring and are planning layoffs. Amazon is shutting down warehouses to scale back distribution operations. \nThese are NOT characteristic of “the most severe worker shortage in memory.” Quite the opposite in fact,",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "evandemic",
        "time": "5 September, 2022",
        "context": "Cancel social security but leave Medicare that will A provide an incentive for the over 65 to work and Ban incentive for employers to hire them since medical costs won’t be a factor for them. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "charliehustleagain",
        "time": "5 September, 2022",
        "context": "I quit due to the worker shortage and taxes. We couldn’t properly staff which meant more work for the rest of us, longer hours, weekends, holidays. And here in CA I was paying over 50% in taxes. Not worth it. ",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "food4thought369",
        "time": "5 September, 2022",
        "context": "Reduce unemployment benefits to ONE WEEK. Go get a job, there are plenty.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "33.333rpm499",
        "time": "5 September, 2022",
        "context": "What does Elaine Chao the Turtle have to do with this article?  Fox taking a swipe at Trump?  ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rlpj",
        "time": "5 September, 2022",
        "context": "If you really want to fix the labor shortage STOP the hand outs!!! Free every thing has to STOP. Back to basics if you want something you have to earn it!!",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "RedGoggles",
        "time": "5 September, 2022",
        "context": "First the government would have to start getting people OFF benefits.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "gunny2879",
        "time": "5 September, 2022",
        "context": "Meanwhile Newscum drains water into the Pacific ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "robertx4",
        "time": "5 September, 2022",
        "context": "How to \"FIX IT\"? OVERHAUL the \"ENTIRE\" Government!!!",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "phoenix2020",
        "time": "5 September, 2022",
        "context": "Heck, everyone knows that the way to end the worker shortage is to completely open the southern border.  Problem solved!",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "GrannyKracker",
        "time": "5 September, 2022",
        "context": "QUIT PAYING PEOPLE NOT TO WORK!!!  Quit promoting Communist Chinese Traitors!!!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Nonlibbysheep21",
        "time": "5 September, 2022",
        "context": "We need to get rid of unions ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "thiswayout",
        "time": "5 September, 2022",
        "context": "Social security depends on more people working than collecting....GO BACK TO WORK!",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "buckhunter",
        "time": "5 September, 2022",
        "context": "Too many not working due to Government handouts!!!!   Wake up folks!!! Cut the free food, free phones, free everything!!! ",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "ubearcat440",
        "time": "5 September, 2022",
        "context": "Maybe have the govt stop handing out taxpayer's money?",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "2012lincoln",
        "time": "5 September, 2022",
        "context": "Biden open borders for fentayl, young girls, killings. NO skill needed just ambition.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "brucegordon",
        "time": "5 September, 2022",
        "context": "  Kids till 26 years old (Obama) Maybe the administration could lower that Kids age to 23 years old?  I know kinda young to expect them to work, BUT it's an emergency. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bookertdied",
        "time": "5 September, 2022",
        "context": "Make the days of being unemployed 2,3,4,5 etc per year and collecting unemployment benefits each time a thing of the past. Able bodied you can draw unemployment once per year that’s it. Now find one of the plentiful jobs out there and Work!",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "teamdaddy394",
        "time": "5 September, 2022",
        "context": "I've got an idea!  How about the government not paying people to sit around on their butts.  Maybe when they get hungry enough, they'll get up and go find a job.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dogsrock749",
        "time": "5 September, 2022",
        "context": "GOVERNMENT isnt the solution to ANYTHING! Quit wasting our money!",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "john_baron",
        "time": "5 September, 2022",
        "context": "I notice that none of her solutions are \"pay better\".",
        "good": "1",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "thiswayout",
        "time": "5 September, 2022",
        "context": "Im retired and could easily go back to my old job...trying not to but come on where are the young ones already?",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "californiamojo",
        "time": "5 September, 2022",
        "context": "It’s funny how the people who are complaining about the work shortages are all convinced it’s because the government peanuts are a better deal. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "thehaunted",
        "time": "5 September, 2022",
        "context": "All the drugs killed all the workers. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "northwoodsmilitia1",
        "time": "5 September, 2022",
        "context": "Stop lying there's no worker shortage and there's no 11 million jobs out there. They been saying the same thing for 2 years.",
        "good": "0",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "bort22",
        "time": "5 September, 2022",
        "context": "When those with money need to pay more for workers, suddenly the free market doesn't look so good to them.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "smithy993",
        "time": "5 September, 2022",
        "context": "Quit handing out free money 💰 ",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "safian",
        "time": "5 September, 2022",
        "context": "rise not die... I'm beginning to dislike computers!",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "max453",
        "time": "5 September, 2022",
        "context": "Duh, stop voting for Democrats.  What do you expect when you pay people not to work, then overregulate and overtax, and issue mandates with no basis in science?",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "krx",
        "time": "5 September, 2022",
        "context": "Labor camps for illegals.  Stop pandering to them.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "johnsoc",
        "time": "5 September, 2022",
        "context": "What Trump wanted to do, bring in the brightest, smartest people to help our country and be good Americans, Dems want what you see know, Dems and China are after the land of America not the people, the illegals they are bringing in are easy to control and destroy.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "sherlockhomeless169",
        "time": "5 September, 2022",
        "context": "HR at many places is a joke.  Ridiculously long applications and psych evaluations with hundreds of questions for a $12/hr job working at a chain of home improvement or grocery stores.  HR has created so much nonsense to justify their job, yet no one just takes the time to meet and evaluate in person.  Heck, most HR probably wouldn't even be able to at this point.  It used to be as a teenager you could fill out a one page application and just interview with the store manager to get a summer job.  Now applying is a job in and of itself for kids seeking work.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Kundiman",
        "time": "5 September, 2022",
        "context": "There is a shortage of people willing to work of low pay....! ",
        "good": "0",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "krx",
        "time": "5 September, 2022",
        "context": "I know!  Let's make all transgender illegals airplane pilots.  There will never be a shortage again.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Dm8764",
        "time": "5 September, 2022",
        "context": "Fourth, stop paying adults not to work. Fifth, don’t make unskilled labor minimum wages higher than employers are economically able to pay.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "MrMalice490",
        "time": "5 September, 2022",
        "context": "You can trust Elaine Chao....after all she is married to esteemed RINO Mitch McConnell.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "melaniatricks4$",
        "time": "5 September, 2022",
        "context": "Me Chao Long Time.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Oceanmajick",
        "time": "5 September, 2022",
        "context": "Base salaries up to 90K.  Selling is the deal then you get a commission and the company has new clients.  Forget it.  These employees sit on their rear ends and make no calls and love their salary.  Give em trouble and they call HR and stir up trouble.  Its hard to fire them.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ed209",
        "time": "5 September, 2022",
        "context": "The only fix that matters: get rid of this dead-from-the-neck-up administration. ",
        "good": "9",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "BLdnM",
        "time": "5 September, 2022",
        "context": "The new fast food robots are actually very good at axing for my order and forgetting the napkins and fries",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "wait!what?520",
        "time": "5 September, 2022",
        "context": "In the USA, only Men worked at one time (relatively). If the USA kept that policy...where would we be? Restricted available talent would be paid more OR prices would not be able to escalate cuz money is not there to do so.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "HughJarse",
        "time": "5 September, 2022",
        "context": "In my industry I've seen post pandemic jobs opening up at pay rates as low as HALF what they used to be.  Address that for a start, employers.\nSecond, remember ageism is just as bad an \"ism\" as racism, sexism, and all the other \"isms\" you can think of, and stop rejecting applicants over 50 because they have \"too much experience\" or are \"over qualified\".\nThird, stop not hiring people for jobs because they might leave when a better job comes along.  Thats ALWAYS been a reality, and research suggests the under 40s are far more prone to it than those over 40.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "observer101",
        "time": "5 September, 2022",
        "context": "FINALLY< someone with a brain....  The \"trades\" are the way forward for many...",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "2ndIDvet",
        "time": "5 September, 2022",
        "context": "A SWAMP monster wants more Government Programs!\nHow surprising LOL",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Obama_is_666",
        "time": "5 September, 2022",
        "context": "Stop with the handouts! ",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Enis.Penalman",
        "time": "5 September, 2022",
        "context": "I left a job that was terrible and didn't pay enough and my spouse supported me during the change. NO HANDOUTS.\nNow my spouse might change jobs for pay and I can support us during that transition.\nNot everything is about HANDOUTS.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "OliveClover",
        "time": "5 September, 2022",
        "context": " It's amazing how many so-called conservatives want to mandate what people are allowed to study in school and what jobs they are allowed to have.\nYou know there HAVE been governments that do that and they weren't democracies. ",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "timesuprinos",
        "time": "5 September, 2022",
        "context": "It's the simplest solution on earth, STOP GIVING HANDOUTS AND PAYING PEOPLE NOT TO WORK!!!! ",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "calpatriot",
        "time": "5 September, 2022",
        "context": "Thank you judge. As for the DOJ and the FBI, why would anyone trust these agencies to do a competent and unbiased investigation. Hopefully, this will stop the leaks. ",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "californiamojo",
        "time": "5 September, 2022",
        "context": "only poorly managed businesses are facing labor shortages \nIf you treat your people well, they will stay and work hard for you\nIf you act like you are doing them a favor, they will move on ",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Drjv1967",
        "time": "5 September, 2022",
        "context": "For starters companies will need to pay more. ",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "mjp58",
        "time": "5 September, 2022",
        "context": "no worker shortage just lazy bums that don't want to work when they can get it all for free.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "fifthdoctor",
        "time": "5 September, 2022",
        "context": "Pay people more.  Train them.  invest in employees instead of maximizing share prices.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "whollyd",
        "time": "5 September, 2022",
        "context": "First thing we could do is stop paying people that could work but won't. The illegals will start working to replace people that won't flip burgers or work customer service jobs. I have a friend that works in a job help center and she says nobody is looking for a job and the few that do don't show up on the first day.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dpcarney46",
        "time": "5 September, 2022",
        "context": "vote republican  this fall and in 2024 , very simple , just go back to pre covid times , 2 yrs is enough of these  clowns , they had there chance ",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "maximus17",
        "time": "5 September, 2022",
        "context": "She may want to bring in the Chinese worker. Do not trust her. She could have ties to the CCP. Trump will solve the problem beginning in 2024.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bidenlost2020810",
        "time": "5 September, 2022",
        "context": "Trump knows big business.  Biden only knows monkey business!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "0100011001010101",
        "time": "5 September, 2022",
        "context": "No problem.  Put those immigrants to work.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "abraham12",
        "time": "5 September, 2022",
        "context": " Quit handing out all the Federal Gov't \"free money.\"  A number of non-working individuals haven't yet spent all of the last groups of checks.\nWhen that's gone, they will go back to work to feed themselves.\nQuit the Fed. Gov't Program to stop the collection of apartment rent that's due.  When people have to actually start paying their rent they will go back to work.\nNeed I go on?",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "smith2you",
        "time": "5 September, 2022",
        "context": "All the talk is like this is a new problem. The shortage of truck drivers has been going on for 15 years. The shortage of pilots in the US is primarily due to an aging workforce and the military not training as many pilots (something we knew was coming, but did nothing about). Etc, etc. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "JeffAlex",
        "time": "5 September, 2022",
        "context": "Elaine Chao is part of the SWAMP along with her husband Mitchell McConnell!",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "pkarol",
        "time": "5 September, 2022",
        "context": "Workforce shortage but 3.5% unemployment ??? Something doesn't add up.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Acloserlook",
        "time": "5 September, 2022",
        "context": "For starters, Dems can stop advocating for abortion which killed over 60 million potential American workers since 1973.  Second, gain control of the southern border and implement an organized immigration program to vet skilled laborers who can fill the gaps.  Thirdly, since Dems won’t do the first two items, elect Republicans who will.  And this can start with the 2022 November elections.  Thank you for voting accordingly to stop the Biden hemorrhage and get America back on track.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "jmyfry268",
        "time": "5 September, 2022",
        "context": "Bring back pensions ",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "squid54545",
        "time": "5 September, 2022",
        "context": "Any Republican who works with Democrats on any bill, will be primaried as a RINO. and trump will run some nut against them",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "justsaid",
        "time": "5 September, 2022",
        "context": "Elaine's article is a great solution. There are labor supply mismatch. Excess 4 year degree graduates who can't find jobs and huge shortage in technical job workers.\nShe should have implemented this when she was the labor secretary. \nObama's presidency had started to bring destruction to this country. One of them is weaponizing the government agencies against political opponents and another is having the Federal government gurantee student loans. This raised student debt massively and resulted in students taking 4 year studies not needed in the job market.",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "whats_happening",
        "time": "5 September, 2022",
        "context": "Eliminate any and all Vax requirements.\nOpen the Keystone pipeline back up.\nBecome an net energy exporter once again.\nThose are the 3 things that need done and businesses will do the rest. ",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "JenNYNY",
        "time": "5 September, 2022",
        "context": "I have NEVER hired anyone because of their degree I always hire people for their attitude and personality and have had a good track record. You can have a degree from  Harvard but if you don't look me in the eye when I talk to you- no thanks.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "redhatsgunnaredhat",
        "time": "5 September, 2022",
        "context": "So illegals aren’t taking our jobs? ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "nooneimportant9513",
        "time": "5 September, 2022",
        "context": "I tell my children they do not need to go to college to be successful in life. We had eight ... on purpose.  \nOne has his masters (business analyst), one has a bachelor(biomedical field), one drives a tow truck, the rest are still in school. \nThe tow truck driver makes the most money and has no school debt and has the opportunity to buy the business....🤔",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "marie72756",
        "time": "5 September, 2022",
        "context": "Over 2 Million illegals a Month and yet still No Workers????",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "safian",
        "time": "5 September, 2022",
        "context": "Pell Grants again? I've seen Pell Grants given to community colleges which went to such trade programs, wait a minute, do you mean that blue collar workers go to a community college and incur college loan debt just like white collar workers?  As for the amount of money, anyone who will admit it will tell you that what the money created was a system in which skills were taught but also restrictions on how many could join those professions because of class size, and suddenly a welder needed to take English literature, writing, and more to compete the training. It became a means to employ those with a degree in Humanities, foreign language, and even mathematics ... the ones who didn't want to teach in k-12 schools or didn't want to work in the private sector. My point, NONSENSE! As for healthcare, because we have Medicare and Medicaid the fees charged have gone up. Please notice what happened when Obamacare was passed, \"We will find out what's in the Bill when it passes\" as stated by a Democrat Nancy Pelosi and what was found out was the costs continued to die even faster, but now select groups were allowed to enter at lower rates which by the way soon caught up with what they paid before. As for healthcare, well, they couldn't handle Covid so we needed a 15 day lockdown! Strange, every time the Democrats and even Republicans throw money at a problem it becomes a more costly problem!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "wait!what?520",
        "time": "5 September, 2022",
        "context": "What would the working environment if Women never decided to join the American workforce (under cutting Men's wages 30-20% and Men being replaced?). The Nation would have had to \"Make Do\". What would USA look like right now?",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "charliebrownbear",
        "time": "5 September, 2022",
        "context": "The three recommendations make sense, and all of them require removing bureaucratic speed bumps. As long as this is the case, no mere mortal man is up to the task of fighting the deep state like Trump, and why with warts and all, the value he brings to making America the economic powerhouse it can become. ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "suzon",
        "time": "5 September, 2022",
        "context": "How are these people making a living???  Are states still paying out unemployment due to pandemic?  Are younger people living with mom and dad?  Everyone seems to need help but no one is actually hiring???  We do not want NATIONAL job centers opening across the country (AOC wants that) or it will become a government “job assignment” center. Is this really what people want…the government to ASSIGN  you jobs???  ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Phantasmagorical",
        "time": "5 September, 2022",
        "context": "I choose not to work.  I choose a lower income.  I choose not to spend money on plastic pumpkins.  I choose not to work for companies who blindly follow government regulations and/or respond favorably to ridiculous minority demands.  Let these companies rot who have not planned their own education and training programs as a preventative measure to the current problem.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "wait!what?520",
        "time": "5 September, 2022",
        "context": "Human shortage? Use to be only Men worked, Then Women joined the work force. Dual family income raised havoc on Single income homes (raised the price of everything). Can never go back to only Men working. Pay daycare forever.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "yankee409",
        "time": "5 September, 2022",
        "context": "The Captain John Smith approach may have some merit. When the colonists at Jamestown refused to work he told them those who didn't work wouldn't eat. ",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Clean95",
        "time": "5 September, 2022",
        "context": "wont change until people who refuse to work start starving. The government has to be paying these people, they're living on something. ",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "RandyRead",
        "time": "5 September, 2022",
        "context": "Get rid of all of the democratic party first. Then put Americans above all others and resume our oil and gas production as well as our coal miners. There's probably 10K or more of those jobs that Americans would like to have back. PUT AMERICA FIRST!!",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Enis.Penalman",
        "time": "5 September, 2022",
        "context": "It's not a worker shortage...people just aren't taking low paying jobs.\nPay more, it's an economic issue, not a government issue.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "silversavior",
        "time": "5 September, 2022",
        "context": "Here is a tip. Pay me in gold and silver and I would feel valued. ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "PencilsDown!",
        "time": "5 September, 2022",
        "context": "How\nabout\nstop\npaying \npeople \nnot\nto \nwork?",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cboy430",
        "time": "5 September, 2022",
        "context": "dems can control people who don’t work and they don’t want you to work. It’s all about control biden worshippers love to be controlled ",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "b52bob",
        "time": "5 September, 2022",
        "context": "The senators should add reducing the number of federal workers.  Adding 87,000 new, cushy, IRS jobs does not help the situation.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "selfdetermination",
        "time": "5 September, 2022",
        "context": "Stop feeding strays...",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "OliveClover",
        "time": "5 September, 2022",
        "context": "So this woman wants an unlicensed cosmetologist putting chemicals on her face .\nThat should turn out well.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "davegreen50",
        "time": "5 September, 2022",
        "context": "This whole throwing money at people and saying \"Here ya go! Be successful!\" is not working and simply opening up where grant money can be spent is not the answer.\nNo, if we're going to make the decision as a society to help people acquire skills and education needed to fill jobs, it needs to be done in a far more rational and efficient way. \nWe need to scrap the entire current system and replace it with a single program that eligible people can sign up for where they are given an aptitude test and then choices of career paths based on the result of that test and the needs of the marketplace. They can then be given the assistance they need to acquire those skills/education and be placed in waiting jobs. If they fail/drop out. They're done for life. Period. No revolving doors.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "terry67760",
        "time": "5 September, 2022",
        "context": "Sounds like to me The Govt. Needs to get out of the way. Eliminate burdensome regulations and requirements and rules. Kick most of those 75 million off Medicaid. ",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "vonsuess",
        "time": "5 September, 2022",
        "context": "Well, I know plenty of people looking for jobs they can't seem to find. The problem seems to be serious felonies and/or the inability to pass a drug screen. I wouldn't hire these people either, regardless of the need for workers...",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "snapdragonfly",
        "time": "5 September, 2022",
        "context": "Stop paying them to stay home.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "brucegordon",
        "time": "5 September, 2022",
        "context": "\"facing an unprecedented worker shortage\"..   NOT so,  we have MILLIONS of new workers coming every year. Unemployment, how so?  \"Never been lower\" how so?  No they are still Kids till (Obama 26 years old)  Anyway when the unemployment runs out those numbers don't count!  Anyway if you never had a job you are not counted as unemployed. \n  Sadly it's not who gets the most votes... It's who count's those votes... Up is down, Down is up, We believe fiction over facts (biden) Stop resisting!",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "redpill513",
        "time": "5 September, 2022",
        "context": "Free post secondary education - community college and trade schools.\nIf we have labor shortfalls in quite a few areas, we need to get AMERICAN labor into the pipeline. Truck drivers, construction workers, welders, plumbers, etc. all in need.\nWhat about all those that previously had to pay for their schooling? Cancel existing loans & provide a tax credit for those that paid their debts in full.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "kwkohensky",
        "time": "5 September, 2022",
        "context": "Why work when there are so many government programs willing to give you money?  ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "deadred01",
        "time": "5 September, 2022",
        "context": "America needs more factories and factory workers. ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "geraghb",
        "time": "5 September, 2022",
        "context": "Stop giving out taxpayer money!",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Quid_Pro_Ho",
        "time": "5 September, 2022",
        "context": "\"The skills gap, as this phenomenon has come to be called, is especially prevalent for technical jobs requiring more than a high school diploma but less than a four-year bachelor’s degree — think software programmers, hospital technicians, HVAC specialists, and so on.\"\nOh, back to Obama's \"teach everyone to code\" nonsense. This guy has no clue what he's talking about.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "19kurt",
        "time": "5 September, 2022",
        "context": "In 2010, Obamacare expanded Medicaid eligibility to healthy, working-age adults living at or slightly above the poverty line. Since then, Medicaid enrollment has ballooned to more than 75 million.  \n Notice a problem there?",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bidenlost2020810",
        "time": "5 September, 2022",
        "context": "The best way to do this is to put Trump back into the driver seat!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "fl350",
        "time": "5 September, 2022",
        "context": "Keep people on free money and threaten to take it away if they don’t vote democrat, \nThat’s the democrat voter base.",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "reaper67",
        "time": "5 September, 2022",
        "context": "stop giving handouts to lazy freeloaders.\nthere ya go, problem solved",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "JimmieJo",
        "time": "5 September, 2022",
        "context": "The government is handing out too much free money to everyone. It needs to stop!  ",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "OliveCocktail",
        "time": "5 September, 2022",
        "context": "For so long as Democrats control government you can't fix anything...everything will only continue to get worse...",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "yelnatsekud",
        "time": "5 September, 2022",
        "context": "I'm a democrat. I don't work. The government provides for me. It's in the constitution. I requested a new Porsche for next year. My vote matters. Vote blue and your vote will too. ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "wait!what?520",
        "time": "5 September, 2022",
        "context": "Americans are getting spoiled, they all want the \"cushy\" high paying jobs (cuz they automatically think they deserve it...\"entitledism\").",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "indurate234",
        "time": "5 September, 2022",
        "context": "Stop subsidizing laziness that way the majority of Democratic Party voters would have to go back to work.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "nomo",
        "time": "5 September, 2022",
        "context": "Do what the Dems have been doing for years.....Lower the qualifications.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "alwaysfreedom",
        "time": "5 September, 2022",
        "context": "College is a waste in most cases.  Degrees in Black Studies, music or art appreciation, etc that come with loans that have no possibility to be repaid should be banned.  Indeed degree mandate non core courses that if stopped would allow a person  to get a business degree in 3, not 4 years",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Eloise849",
        "time": "5 September, 2022",
        "context": "Surprised to find myself agreeing with anything in Fox News. But I do agree with this first point. As a software professional myself, I have almost 40 years experience coming up to the end of my career - NO COLLEGE DEGREE. Your degree ceases to be useful around lunch time on the first day. A college degree does nothing but get you in the door.\nTo train to write code, it can be done with 2-3 months full time training. It is an investment and there are companies already doing this today and keeping the employee under exclusive contract for 2-3 years to recoup their cost. \nIt's time for employers to make a long term commitment to their employees. But I never wasted tens of thousands on a pointless college degree and I now work as an information security engineer with a 6-figure salary. ",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "silversavior",
        "time": "5 September, 2022",
        "context": "So the gov should give workers a wage subsidy of an extra $20 an hour on top of their wages. \nThis will get many off the couch and fully staff everything. Print more currency to pay for it . It doesn't matter at this point. The currency is already dead.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "gerardfischer",
        "time": "5 September, 2022",
        "context": "Young People are  figuring out that a meaningless degree in Social Work at 40 to 80 thousand a year for fours years leads to a 30k/year job, plumbing, AC tech and truck drivers make 80 to 100 K/yr, Biden can cancel Fed student loans but not get them jobs that pay well. Unless your Hunter",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "JaySabarro",
        "time": "5 September, 2022",
        "context": "The amount of damage the filthy liberals brought with their scam lockdowns has cost this country in billions and irreversible harm to the productivity.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Lastchance043",
        "time": "5 September, 2022",
        "context": "Very easy problem to correct. SHUT DOWN THE GOVERNMENT for a few years. ",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "buck12054",
        "time": "5 September, 2022",
        "context": "Fourth and most important thing. The Federal government needs to STOP PAYING PEOPLE TO NOT WORK.\n ",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Daddo813",
        "time": "5 September, 2022",
        "context": "Someone needs to post how many people by state are drawing unemployed checks. ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rckwrd",
        "time": "5 September, 2022",
        "context": "First things first… STOP PAYING PEOPLE TO STAY HOME! Obama’s a traitor and orchestrated this mess for power. #lgbfjb",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "alwaysfreedom",
        "time": "5 September, 2022",
        "context": "75 million on Medicaid.  Utter waste and only breeds generations who will never work",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "pranqster",
        "time": "5 September, 2022",
        "context": "Stop teaching Climate Change.   Stop teaching CRT and gender identity.  Start teaching the American dream of hard work and effort to achieve success.  Nit everyone needs a college education.   Bring back VoTech High Schools.  Adjust tge minimum wage, or offer incentives to businesses in the form of tax credits to hire workers for more menial positions.  That would be a start ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ExodusCalifornia19",
        "time": "5 September, 2022",
        "context": "We have seen this coming for years…thousands of kids walking around with useless degrees and no skills. This all started back in the 80s when they started eliminating trade classes in HS like wood, electrical ,metal and auto shop…",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "RockingHorseGuy",
        "time": "5 September, 2022",
        "context": "Stop paying people to stay home.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "george248",
        "time": "5 September, 2022",
        "context": "Aging workforce, population decline, retirements; An age of decline. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Unlikey",
        "time": "5 September, 2022",
        "context": "Simple start would be getting rid of many of the licensing rules.  In a lot of fields, before you start work, you have to pay fees and jump through hoops, many of which are unnecessary and anti-competitive.  Colorado governor and others are working on removing these obstacles.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "eeyor505",
        "time": "5 September, 2022",
        "context": "I know 2 kids who wanted to live on their own in another  state than their families, first they took to hunting jobs once they both had jobs waiting they moved. They are putting out over $2000 per month on rent and all. They both worked 2 jobs for awhile. One just got layed off from a full time work at home job that she loved but the company couldn’t find enough people in her area that wanted to work. She sometimes put in 12 actual work hours when others that quit just didnt do anything. Neither have taken any government handouts and have found jobs without it. These 2 young people unfortunately found out others in their age bracket prefer the handouts. Anyone on here who says stop the handouts is perfectly correct. Take low paying jobs, work 2 if needed and you will find that you will be promoted when the opportunity cames along.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Sej462",
        "time": "5 September, 2022",
        "context": "It would be interestting if we had figures on the ages demographics and location of people not seeking work. I personally know a lot of people who retired early in the last 2 yrs.",
        "good": "2",
        "bad": "0",
        "replies": []
    }
]