[
    {
        "error": "error"
    },
    {
        "user_name": "rubiks6",
        "time": "19 May, 2021",
        "context": "Every resource available should be utilized to improve the human condition. The Earth was created for Man and given to Man.",
        "good": "5",
        "bad": "18",
        "replies": [
            {
                "user_name": "rubiks6",
                "time": "19 May, 2021",
                "context": "Isn't this natural selection? Isn't this survival of the fittest? Isn't Mankind the fittest animal on Earth? C'mon, hypocrites! Are you now throwing evolution and natural selection out the window? What bovineshtitka!",
                "good": "0",
                "bad": "9",
                "replies": [
                    {
                        "user_name": "watashiwa",
                        "time": "19 May, 2021",
                        "context": "Can you sprint at 60 mph?  Can you swim across the ocean in a matter of weeks?  Can you detect and catch tiny flying insects in the dark with echolocation like the bats?  \"Fittest\" is relative.  It depends on the environment, and there was a time when humans were nearly extinct.",
                        "good": "7",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "rubiks6",
                                "time": "19 May, 2021",
                                "context": "We can do all of those things, if not with our biology then with the machines we invent using our extraordinary minds. We’ve even gone to the Moon. \n\n“... nearly extinct”? We started out as just two people. After becoming millions our population was reduced to just eight. Here we are today, 8 billion and growing fast. By your paradigm, doesn’t “nature” decide the “fittest”?",
                                "good": "0",
                                "bad": "8",
                                "replies": [
                                    {
                                        "user_name": "lycopine",
                                        "time": "20 May, 2021",
                                        "context": "We started out as just two people huh? According to your bible fiction.",
                                        "good": "1",
                                        "bad": "0",
                                        "replies": [
                                            {
                                                "user_name": "rubiks6",
                                                "time": "20 May, 2021",
                                                "context": "I don't know of Bible \"fiction.\" I know Bible fact.",
                                                "good": "0",
                                                "bad": "2",
                                                "replies": [
                                                    {
                                                        "user_name": "beadgBass",
                                                        "time": "20 May, 2021",
                                                        "context": "Who were those people in the land of Nod, East of Eden, where Cain found a wife?\nNeandertals maybe?",
                                                        "good": "2",
                                                        "bad": "0",
                                                        "replies": [
                                                            {
                                                                "user_name": "rubiks6",
                                                                "time": "22 May, 2021",
                                                                "context": "Adams other children. He had many.",
                                                                "good": "0",
                                                                "bad": "1",
                                                                "replies": [
                                                                    {
                                                                        "user_name": "beadgBass",
                                                                        "time": "22 May, 2021",
                                                                        "context": "Buzzzzz -- wrong.",
                                                                        "good": "0",
                                                                        "bad": "0",
                                                                        "replies": []
                                                                    }
                                                                ]
                                                            }
                                                        ]
                                                    },
                                                    {
                                                        "user_name": "lycopine",
                                                        "time": "20 May, 2021",
                                                        "context": "Ah, biblical \"fact\", where serpents and donkeys talk, seas part on the asking, and people live for centuries. All told to you in your English translation copy in some words that hadn't even been invented BC.\nso hilarious 🤣😆\nMake your posts in the religious section and take your hypocrite lies with you while adopting 5 more children...\nLOLOL",
                                                        "good": "1",
                                                        "bad": "0",
                                                        "replies": []
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "user_name": "beadgBass",
                        "time": "19 May, 2021",
                        "context": "Fitness in evolutionary biology is survival and fertility. I'd have to say that cockroaches are MUCH more fit than humans, the way they reproduce.\nLet's hope that your Darwinian fitness is low or zero, because it would be bad for the human race if you passed on those really bad alleles of yours.",
                        "good": "6",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "rubiks6",
                                "time": "20 May, 2021",
                                "context": "I live in the richest city in America. There isn't a single roach in any house or apartment or building here. They've all been wiped out.\n\nCockroaches cannot reconstruct the environment to suit there own needs. They live where they can live and they don't where they can't. Mankind can survive and thrive nearly anywhere on Earth. Mankind makes the Earth his home wherever it suits him. We've even been to the Moon. Has a cockroach ever been to the Moon? \n\nWho cares how many cockroaches there are. Has a one of them ever had an intelligent thought? Ever made music or art or written a book or done mathematics? Has a cockroach ever appreciated the stars in the sky? Your standards are really messed up. How did your mind become so damaged?\n\nDo cockroaches ever risk their lives to save other cockroaches? You're like really stupid. What kind of reprobate mind compares humans to cockroaches? You have psychiatric issues.",
                                "good": "0",
                                "bad": "2",
                                "replies": [
                                    {
                                        "user_name": "beadgBass",
                                        "time": "20 May, 2021",
                                        "context": "Thanks for that.\nYou have proven that cockroaches have greater fitness than you,",
                                        "good": "2",
                                        "bad": "0",
                                        "replies": []
                                    },
                                    {
                                        "user_name": "lycopine",
                                        "time": "20 May, 2021",
                                        "context": "Yeah, you know for a fact there's no roaches where you live huh? You've verified that by constantly inspecting all buildings and outdoor areas. LOLOL.\nWhat a moronic claim.",
                                        "good": "1",
                                        "bad": "0",
                                        "replies": []
                                    },
                                    {
                                        "user_name": "lycopine",
                                        "time": "20 May, 2021",
                                        "context": "Has any roach started a war to destroy another population? Created weapons of increasing horrors, laid waste to vast areas of Earth to benefit itself while others suffer?\nLOLOL\nRoaches are definitely superior to you religious fools...",
                                        "good": "2",
                                        "bad": "0",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "user_name": "sciencerocks",
                        "time": "20 May, 2021",
                        "context": "You are the last person who should be calling others 'hypocrites.'\nYou claim to be a man of God but you are okay with trashing His creation.",
                        "good": "2",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "lycopine",
                                "time": "20 May, 2021",
                                "context": "Whatever did you expect from this ignorant religious fanatic? Science and logic are lost in rubix's religious fantasyland...",
                                "good": "1",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "sciencerocks",
                                        "time": "20 May, 2021",
                                        "context": "True, but that does not mean that science and faith cannot work together in a useful fashion. That is the topic of my next book.",
                                        "good": "1",
                                        "bad": "0",
                                        "replies": [
                                            {
                                                "user_name": "lycopine",
                                                "time": "20 May, 2021",
                                                "context": "Lemme know when it's published. My last reading was Evolving Brains, Emerging Religions by professor Torrey. His very convincing argument showed how hominid brain evolution HAD to lead to the invention of gods and religion. He backed it up with evidence and proof too.",
                                                "good": "1",
                                                "bad": "1",
                                                "replies": []
                                            },
                                            {
                                                "user_name": "rubiks6",
                                                "time": "22 May, 2021",
                                                "context": "The topic of your next book has been written about by countless numbers of people who reject the authority of God’s Word. Books of this sort are a dime a dozen and they’re giving away the extras for free. Couldn’t you find anything worthwhile in the BioLogos bibliographies?",
                                                "good": "0",
                                                "bad": "2",
                                                "replies": []
                                            }
                                        ]
                                    }
                                ]
                            },
                            {
                                "user_name": "rubiks6",
                                "time": "20 May, 2021",
                                "context": "I have no desire to see God’s creation trashed. My desire is that all of the resources God has given Man, which according to God’s Word He has indeed given to us, be used for the improvement of Man’s condition on this Earth. Now, of course, if you don’t believe God and His Word and how He gave the Earth to Man in Genesis 1.26, then these things mean nothing to you. \n\nThe Bible also tells us that this Earth was perfect when it was created but that it was corrupted by the first man’s sin. The Bible tells us this Earth will be destroyed and replaced with a new Earth. I don't suppose you believe those parts of the Bible, either. In case you hadn't noticed, this Earth has vulcanos and earthquakes and landslides and hurricanes and tornados and hail and many ways of trashing the environment and killing many animals and people. You need to complain to your God about trashing His Earth. You do realize that God has already destroyed everything on the surface of the Earth once before in a great worldwide flood, don't you?\n\nI refer you to 2 Peter 3, especially verses 5 - 7. (That is, if you actually believe the Bible.)\n---------------\n\nbtw – I've never claimed to be a \"man of God.\" I simply claim to believe His Word, the Bible.",
                                "good": "0",
                                "bad": "2",
                                "replies": []
                            },
                            {
                                "user_name": "rubiks6",
                                "time": "20 May, 2021",
                                "context": "By the way, in spite of our disagreement, you're the only one here worth arguing with.",
                                "good": "0",
                                "bad": "2",
                                "replies": [
                                    {
                                        "user_name": "lycopine",
                                        "time": "20 May, 2021",
                                        "context": "Now dismissing everyone who shows your claims are false while replying to yourself?\nI'd say you are not the one worth arguing with...",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": [
                                            {
                                                "user_name": "rubiks6",
                                                "time": "20 May, 2021",
                                                "context": "You are dismissed.",
                                                "good": "0",
                                                "bad": "2",
                                                "replies": [
                                                    {
                                                        "user_name": "lycopine",
                                                        "time": "20 May, 2021",
                                                        "context": "Indeed, you are. Right to the smoking section you've been in fear of your whole life for incessant lying hypocrisy.\n\nLOLOL",
                                                        "good": "0",
                                                        "bad": "0",
                                                        "replies": [
                                                            {
                                                                "user_name": "rubiks6",
                                                                "time": "21 May, 2021",
                                                                "context": "What is interesting is that if you look carefully at my original post, you will find there is nothing untoward in it but _you read into it_ what your angry heart wants to see. I would laugh at you if the reality of what you are weren't so sad.\n\nIt is God that hardens your heart and that is the saddest part of all. You have been prayed for today.\n\nThese words apply to sciencerocks as well.",
                                                                "good": "0",
                                                                "bad": "2",
                                                                "replies": [
                                                                    {
                                                                        "user_name": "lycopine",
                                                                        "time": "21 May, 2021",
                                                                        "context": "Again, which of the 10,000+ documented gods do you pray to? And what makes that god different from all the others?\nYour \"observation\" that I have an angry heart is nonsense, since a human heart has ZERO emotions. Emotions are evoked by chemicals and felt by the sensory mechanisms of the body, their existence is  only known through language, another human invention, like gods, souls and spirits.",
                                                                        "good": "0",
                                                                        "bad": "0",
                                                                        "replies": [
                                                                            {
                                                                                "user_name": "rubiks6",
                                                                                "time": "22 May, 2021",
                                                                                "context": "So you are a man without emotions. Got it. \n\nI pray to the true, living God, just as I am speaking to a true, living person right now. While there are many make-believe people, the one I am speaking to is real. While there are many true, living people, there is only one true, living God. There are many make-believe gods. Don’t pray to them. Pray to the true, living God. \n\nHave you the intellect to understand these simple ideas or.is your mind too damaged to think clearly any longer?\n\nLet’s try mathematics. Create in your mind a set that can hold a true, living God and then tell yourself the set is not empty. You may not understand what is in the set but the set is not an empty set. It has one thing in it.",
                                                                                "good": "0",
                                                                                "bad": "3",
                                                                                "replies": [
                                                                                    {
                                                                                        "user_name": "lycopine",
                                                                                        "time": "22 May, 2021",
                                                                                        "context": "and just how do you distinguish what a true living god is and know such is THE only one?\nHave you the intellect to explain such or are you too far buried in the make-believe world of super beings?\n\nLet's use your mathematics analogy as I have far advanced mathematical education.\n\nWhat you have created is in you mind,a concept, and that's where your super being and your \"soul\" resides too. Some people refer to it as their imagination. It has many things in it.",
                                                                                        "good": "0",
                                                                                        "bad": "0",
                                                                                        "replies": [
                                                                                            {
                                                                                                "user_name": "rubiks6",
                                                                                                "time": "22 May, 2021",
                                                                                                "context": "Who said anything about \"distinguishing\"? I simply suggested you recognize his existence. How are you to distinguish his properties if you fail to recognize his very existence? These are mathematical and logical concepts. You should be able to grasp what I'm saying ...\n\n... unless you choose to remain willingly ignorant. In that case, nothing I say will matter. Close your eyes, cover your ears with your hands and sing \"la, la, la\" as loud as you can. When reality smacks you hard in the back of the head, you'll get it.\n\nI do not have the intellect to break through your stubborn ignorance. Sorry. Somebody needs to.\n\nYou have been prayed for today.",
                                                                                                "good": "0",
                                                                                                "bad": "1",
                                                                                                "replies": [
                                                                                                    {
                                                                                                        "user_name": "lycopine",
                                                                                                        "time": "22 May, 2021",
                                                                                                        "context": "OK then, how do I \"recognize\"  the existence of a super being? Or more specifically, since there are 10,000+ documented super beings, how do I recognize the existence of yours?\n\nThe ignorant babbling in your post doesn't help me and your math analogy, I already proved worthless. So, while I keep an open, inquisitive mind, provide a coherent explanation so that I can understand your \"logical, rational\" belief in your super being and recognize such in the manner in which you do.",
                                                                                                        "good": "0",
                                                                                                        "bad": "0",
                                                                                                        "replies": [
                                                                                                            {
                                                                                                                "user_name": "rubiks6",
                                                                                                                "time": "22 May, 2021",
                                                                                                                "context": "How do you recognize the existence of anything? You choose to recognize it. Is English a second language for you? I didn't suggest you recognize my God. I suggest that you recognize the existence of a God (English: indefinite article).\n\nDidn't you take Zermelo–Fraenkel set theory when you were getting that advanced mathematics degree? Don't you remember that symbol \"∃\" that means \"there exists,\" referring to element(s) of a set? Consider a set that contains the Creator of the universe and that that set is not empty. Or does that make your brain explode. Are you capable of holding such a thought? If you are incapable of holding such a thought than you haven't the reasoning skills to hold a conversation with me. Perhaps your college tuition was wasted. More likely, you choose to remain willfully ignorant. Perhaps playing stupid is your defense mechanism when confronted with your own wretchedness and the judgment you are facing, not realizing that God has provide a way for you to walk away from that judgment with a declaration of \"innocent.\" That's too bad for you.\n\nYou can save neither the Earth nor the bats and attempting to do so will not save you. Your Creator offers you salvation for free. Only a fool would choose a bad outcome when he could be saved effortlessly. Stop being a fool.",
                                                                                                                "good": "0",
                                                                                                                "bad": "0",
                                                                                                                "replies": [
                                                                                                                    {
                                                                                                                        "user_name": "lycopine",
                                                                                                                        "time": "22 May, 2021",
                                                                                                                        "context": "Choose to recognize huh? The human brain senses what's in the environment surrounding it with the vast majority of those sensations never making it to consciousness. Recognition is a CONSCIOUS process, then the brain must sort out what it recognizes from past experiences, i.e. memory. Didn't you take basic biology or do you just employ creationism to believe some super being gives humans consciousness? Does biological fact make your head explode?\nConsider a set where thousands of already documented elements reside, e.g. gods, of which ONE created the universe. Now that set is not empty and you cannot determine which of those elements created the universe.\nIf you are unable to consider that example, then you have no mental capacity to have a conversation with me. Perhaps you were educated in Trump University; did you get your tuition back after it was closed for fraud? More likely you are not really educated enough to consider other imaginary creations other than your own and pass that off as everyone's reality. Your imaginary super being neither exists in my reality nor the reality of anyone else. It exists solely in YOUR imagination. Only a fool would believe otherwise.\nStop being a fool.",
                                                                                                                        "good": "0",
                                                                                                                        "bad": "0",
                                                                                                                        "replies": []
                                                                                                                    }
                                                                                                                ]
                                                                                                            }
                                                                                                        ]
                                                                                                    }
                                                                                                ]
                                                                                            }
                                                                                        ]
                                                                                    }
                                                                                ]
                                                                            }
                                                                        ]
                                                                    },
                                                                    {
                                                                        "user_name": "sciencerocks",
                                                                        "time": "22 May, 2021",
                                                                        "context": "You do not speak for me in any way, shape, or form.\nPeriod.",
                                                                        "good": "1",
                                                                        "bad": "0",
                                                                        "replies": [
                                                                            {
                                                                                "user_name": "rubiks6",
                                                                                "time": "22 May, 2021",
                                                                                "context": "I do not speak for you. I speak to you. \n\nPlease read more carefully, Professor.",
                                                                                "good": "0",
                                                                                "bad": "3",
                                                                                "replies": [
                                                                                    {
                                                                                        "user_name": "sciencerocks",
                                                                                        "time": "22 May, 2021",
                                                                                        "context": "You need not speak to me either.\nYou are nothing but a troll.",
                                                                                        "good": "1",
                                                                                        "bad": "0",
                                                                                        "replies": [
                                                                                            {
                                                                                                "user_name": "rubiks6",
                                                                                                "time": "22 May, 2021",
                                                                                                "context": "You certainly need someone to speak to you. You won't listen to the Word of God.",
                                                                                                "good": "0",
                                                                                                "bad": "1",
                                                                                                "replies": [
                                                                                                    {
                                                                                                        "user_name": "sciencerocks",
                                                                                                        "time": "22 May, 2021",
                                                                                                        "context": "I listen to the Word of God more accurately than you. What I don't listen to are your contorted misinterpretations of the Holy Bible.\nMost clerics, theologians, and biblical scholars agree more with me than you.",
                                                                                                        "good": "0",
                                                                                                        "bad": "0",
                                                                                                        "replies": []
                                                                                                    }
                                                                                                ]
                                                                                            }
                                                                                        ]
                                                                                    }
                                                                                ]
                                                                            }
                                                                        ]
                                                                    }
                                                                ]
                                                            }
                                                        ]
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "watashiwa",
                "time": "19 May, 2021",
                "context": "Aren't we supposed to preserve and protect the Earth and all of its creatures?  Man is a primate and Homo sapiens are among the youngest species on the planet.  We are savagely violent to members of our own species, sometimes for no reason. We've also destroyed many other species in the process.  It's not just our world, and for the foreseeable future, it's our only home.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "rubiks6",
                        "time": "23 May, 2021",
                        "context": "“Aren't we supposed to preserve and protect the Earth and all of its creatures?”\n\nDid I suggest otherwise?\n\n“... youngest species on the planet.”\n\nIn fact, Man is the very last species God created. The Earth was created for Man and given to Man and he was commanded to fill the Earth and to subdue it and to have dominion over all of its creatures. \n\nUnfortunately, the first man and his wife introduced sin and death and a curse into the world when they disobeyed God. When Jesus Christ returns as King of the Earth, he will restore many things as they were before Man’s disobedience. Ultimately, this Earth will be destroyed and replaced by a new Earth better even than the first one. \n\nThat is the true narrative.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "letsgetrel",
                "time": "19 May, 2021",
                "context": "Is your arrogance a God given trait?\nJesus was humble.",
                "good": "6",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "rubiks6",
                        "time": "20 May, 2021",
                        "context": "\"Is your arrogance a God given trait?\"\n\nYou'd better believe it! I was created in the image of God.\n\nJesus may have been humble on his first visit to Earth but he won't be on his second!\n\n\"I was in the Spirit on the Lord's day, and I heard behind me a loud voice like a trumpet ... Then I turned to see the voice that was speaking to me, and on turning I saw seven golden lampstands, and in the midst of the lampstands one like a son of man, clothed with a long robe and with a golden sash around his chest. The hairs of his head were white, like white wool, like snow. His eyes were like a flame of fire, his feet were like burnished bronze, refined in a furnace, and his voice was like the roar of many waters. In his right hand he held seven stars, from his mouth came a sharp two-edged sword, and his face was like the sun shining in full strength.\nWhen I saw him, I fell at his feet as though dead. But he laid his right hand on me, saying, “Fear not, I am the first and the last, and the living one. I died, and behold I am alive forevermore, and I have the keys of Death and Hades. Write therefore the things that you have seen, those that are and those that are to take place after this.\"\n– Revelation 1.10 - 19 (ESV)\n\nThere's your humble Jesus. Do your beliefs account for the conquering King Jesus?",
                        "good": "0",
                        "bad": "4",
                        "replies": [
                            {
                                "user_name": "lycopine",
                                "time": "20 May, 2021",
                                "context": "You BELIEVE you were created by some super being because you were coerced from birth to believe it. Many others NOT coerced the way you were DON'T believe your bogus claims.",
                                "good": "0",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "rubiks6",
                                        "time": "22 May, 2021",
                                        "context": "Sir, I was born in an atheist household. When I was older, God Himself coerced me to follow Him and to love Him. I’m sorry He has not done so for you. You must ask Him why you are not chosen by Him. Only He knows.",
                                        "good": "0",
                                        "bad": "1",
                                        "replies": [
                                            {
                                                "user_name": "lycopine",
                                                "time": "22 May, 2021",
                                                "context": "Sir, maybe you can explain just how some super being coerced you to follow and love such. I'm sorry you won't be able to present any proof and your explanation will be illogical. You still haven't distinguished your super being from all the others either. Apparently the only valid point you have is only your super being knows...",
                                                "good": "0",
                                                "bad": "0",
                                                "replies": []
                                            }
                                        ]
                                    }
                                ]
                            },
                            {
                                "user_name": "letsgetrel",
                                "time": "21 May, 2021",
                                "context": "Your Jesus has a split personality.\nMine is humble.",
                                "good": "2",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "rubiks6",
                                        "time": "22 May, 2021",
                                        "context": "Indeed, my Jesus humbled himself to the point of giving his life on the cross and he is the God, King, Ruler of the universe. All glory and honor are due to my Jesus. Every knee shall bow before my Jesus who humbly gave his life for undeserving people. Therefore God raised him to the highest position in the universe. \n\nIs this the Jesus you worship? I sure hope so.",
                                        "good": "0",
                                        "bad": "3",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "lycopine",
                "time": "20 May, 2021",
                "context": "You again with your religious ignorance. Begone lying hypocrite.\nYour arguments belong in the religious section...",
                "good": "1",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "rubiks6",
                        "time": "20 May, 2021",
                        "context": "And you have no arguments at all. Only insults. You are incapable of thinking clearly. You have a mind much like that of an ape. You can no longer think like a man. You've thrown that faculty away.",
                        "good": "0",
                        "bad": "3",
                        "replies": [
                            {
                                "user_name": "lycopine",
                                "time": "20 May, 2021",
                                "context": "Says you and your incoherent babbling. \nReligious beliefs ARE ignorance.\nYou have already PROVEN your hypocrisy.\nSo those are two FACTS about you, NOT attacks.",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "lycopine",
                "time": "20 May, 2021",
                "context": "Every resource huh? There's limited fresh water, limited arable land, limited health care, limited dump space, etc. \nMAGAts like you who would reproduce like bacteria and spread ignorance in the name of your religion are a \"resource\" the rest of us humans can do without...",
                "good": "1",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "rubiks6",
                        "time": "20 May, 2021",
                        "context": "There's limited this and limited that and limited those over there ...\n\nThen we should use our resources WISELY.\nDuh!",
                        "good": "0",
                        "bad": "3",
                        "replies": [
                            {
                                "user_name": "lycopine",
                                "time": "20 May, 2021",
                                "context": "Yeah, like limiting population growth so selfish hypocrites like you can start adopting...\nNow wouldn't that reduce demand for scarce resources?",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "LyinLibs382",
        "time": "19 May, 2021",
        "context": "Uh, corona virus, rabies anyone🤣🤣",
        "good": "3",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "FloridaManis(R)ight",
        "time": "19 May, 2021",
        "context": "Ozzies favorite",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "FloridaManis(R)ight",
        "time": "19 May, 2021",
        "context": "Liberal democrats states are such fools.",
        "good": "4",
        "bad": "2",
        "replies": [
            {
                "user_name": "sickofnews-8646",
                "time": "19 May, 2021",
                "context": "not just liberal states. In Indiana we have rules about the endangered Indiana Bat and there are limited times here that we can not clear forest areas. But we also know who is good for our country and who will destroy our country.",
                "good": "0",
                "bad": "2",
                "replies": []
            },
            {
                "user_name": "lycopine",
                "time": "20 May, 2021",
                "context": "CANCER-vative states are far worse...",
                "good": "0",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "antoniusbloch",
        "time": "19 May, 2021",
        "context": "Batman would approve.",
        "good": "11",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Hangout1967",
        "time": "19 May, 2021",
        "context": "Tiny bat in Maine puts kibosh on \npower line big bat in Washington puts kibosh on Keystone pipe line. What’s the world coming to? We’ve got to do something about these bats.",
        "good": "8",
        "bad": "4",
        "replies": [
            {
                "user_name": "steveberger",
                "time": "19 May, 2021",
                "context": "washington dingbats first",
                "good": "3",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "#LET'S_GO_BRANDON!",
        "time": "19 May, 2021",
        "context": "Whaaat?  Let's us all vote her out asap so we can start cutting those trees, we just let that old bat Pelosi stand in the way of progress as usual.",
        "good": "3",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "n3wtym3",
        "time": "19 May, 2021",
        "context": "White nose syndrome has affected much of America, before.  Pablo Escobar once ran a refuge and preservation farm for them, but it fell apart, years ago.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "FloridaManis(R)ight",
        "time": "19 May, 2021",
        "context": "When China owns U.S. we'll be fighting over these to eat.",
        "good": "14",
        "bad": "6",
        "replies": [
            {
                "user_name": "wadamader4u",
                "time": "19 May, 2021",
                "context": "Stir fry bats.",
                "good": "1",
                "bad": "3",
                "replies": []
            }
        ]
    },
    {
        "user_name": "abraham12",
        "time": "19 May, 2021",
        "context": "There goes the New England electric car program.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "steveberger",
        "time": "19 May, 2021",
        "context": "imagine... a little bat could stop electric cars.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Hondoxp589",
        "time": "20 May, 2021",
        "context": "I don't see the problem here. The time line for tree cutting is in the permit and well known in advance so other construction will continue during the two week pause. Clean energy is an echo warrior agenda so why are they stepping on their own toes?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dan5047628",
        "time": "20 May, 2021",
        "context": "I remember when California dumped all their water out of a reservoir during a drought to save a protected minnow. Liberals will go to any length to save an animal but kill babies by the millions",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "lycopine",
                "time": "20 May, 2021",
                "context": "Ah, another ignorant declaration of someone who dictates their belief when life begins without a shred of evidence or proof, just pure religious opinion..",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "dan5047628",
                        "time": "20 May, 2021",
                        "context": "what part of the truth do you have a problem with?? Did i mention God??\nPlus people that start a conversation with an insult is a person with nothing intelligent to say",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "lycopine",
                                "time": "20 May, 2021",
                                "context": "Insult huh? \"Liberals\" kill millions of babies huh? That's not an insult? Your post is certainly not fact. So using your logic your post is not only UN-intelligent, it is meaningless.",
                                "good": "0",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "dan5047628",
                                        "time": "21 May, 2021",
                                        "context": "85% of Abortions by Liberal is the truth. the truth isn't an insult",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": [
                                            {
                                                "user_name": "lycopine",
                                                "time": "21 May, 2021",
                                                "context": "You pulling \"facts\" out of the sky now? 85%?\nAnd changing your tune from \"killing babies\" to abortion?\nFar as I know, only licensed physicians are allowed to perform abortions and if they were \"killing babies\" they'd be charged with murder. So your first post has ZERO truth too\nWhat's a \"liberal\" anyway?",
                                                "good": "0",
                                                "bad": "0",
                                                "replies": [
                                                    {
                                                        "user_name": "dan5047628",
                                                        "time": "21 May, 2021",
                                                        "context": "Murder isn't an issue with the Godless",
                                                        "good": "0",
                                                        "bad": "0",
                                                        "replies": [
                                                            {
                                                                "user_name": "lycopine",
                                                                "time": "21 May, 2021",
                                                                "context": "Oh. Which of the 10,000+ documented gods are you referring to? And who are you to determine when life begins before you can declare a murder occurs? You can't even define when life begins except with your own opinion.\nGod believers make up their own reality based on years of coercion usually starting at birth.",
                                                                "good": "0",
                                                                "bad": "0",
                                                                "replies": []
                                                            }
                                                        ]
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "msbradley",
        "time": "19 May, 2021",
        "context": "No problem what-so-ever until you lose power for six weeks !",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "fastidious1",
        "time": "19 May, 2021",
        "context": "Let maine freeze so the bats can live.",
        "good": "2",
        "bad": "5",
        "replies": [
            {
                "user_name": "watashiwa",
                "time": "19 May, 2021",
                "context": "It's unlikely they'll freeze at this time of year.",
                "good": "6",
                "bad": "0",
                "replies": []
            }
        ]
    }
]