[
    {
        "user_name": "pkruse24724",
        "time": "1 September, 2022",
        "context": "Bongo Man wants to de-fund the FBI because they held Trump accountable when he stole America’s nuclear secrets? I guess Dan-No believes Trump should have been able to sell them to Russia or the Saudis.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "randy4usa",
        "time": "31 August, 2022",
        "context": "When we have our next Republican President, he or she needs to do a complete purge, starting at the top and going down all the way to the street, if necessary.  Also, must do a way better job than Trump did at picking the top.\nI live a couple miles from the Phoenix field office.  It would be fun to stop by and watch a couple dozen of them carrying boxes to their cars.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "IratusAvis",
        "time": "31 August, 2022",
        "context": "LOL.  Christofer Wray is a Republican appointed by Trump to head the FBI.  Even Trump is starting to give up on lying and has switched to threats.",
        "good": "5",
        "bad": "4",
        "replies": [
            {
                "user_name": "1357",
                "time": "31 August, 2022",
                "context": "He might be a RINO, but honest minds would not try to silence people who smell the corruption.",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "Sleepyjoeisdone",
                "time": "31 August, 2022",
                "context": "What has Biden done for everyday Americans?  Inflation, gas prices, baby formula, disastrous withdrawal from Afghanistan and now women are right back to the dark ages and the Taliban are a continued threat to this country, tanked the stock market, hiding behind the DOJ and FBI, soaring crime across America, refusing to answer reporters' questions, has a press secretary that is the worst ever, won't take a cognitive test, lies about the border mess, on and on.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "bigbaddad60",
        "time": "31 August, 2022",
        "context": "Bongo, you are obnoxious, loud, FOX propagandist and you are calling out bias? Pot, meet kettle.",
        "good": "1",
        "bad": "1",
        "replies": [
            {
                "user_name": "1357",
                "time": "31 August, 2022",
                "context": "I hope you change your mind.  As such, I do not understand how your mentally proscess all the stories published, hearing about bad agents, resignations, and the lack of Democrats facing any consequences.  A reasonable ability to smell would certainly point one in the correct direction.",
                "good": "1",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "Sleepyjoeisdone",
                "time": "31 August, 2022",
                "context": "Afternoon high?",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "turningtxblue",
        "time": "31 August, 2022",
        "context": "The only question now is in when Fox dumps Trump.",
        "good": "3",
        "bad": "2",
        "replies": [
            {
                "user_name": "Sleepyjoeisdone",
                "time": "31 August, 2022",
                "context": "That's rather comical seeing how CNN has dumped half their staff who bashed Trump.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "filiusjm734",
        "time": "31 August, 2022",
        "context": "amazing that a party who thinks hillary should have been jailed for some emails but totally overlook hundred of secret documents kept in an unlocked closet by an ex president......repubs have no shame.....",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "deltron2099",
        "time": "31 August, 2022",
        "context": "Sentient nard Dan bongino joins the sinking ship",
        "good": "2",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "CountK",
        "time": "31 August, 2022",
        "context": "Banana Republics around the world are taking notes from the FBI so they can up their local game.  That agency is corrupt to the core.",
        "good": "3",
        "bad": "4",
        "replies": []
    }
]