[
    {
        "user_name": "mentor397",
        "time": "23 June, 2021",
        "context": "Too bad Seti@home stopped listening.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "yo666",
        "time": "23 June, 2021",
        "context": "The intergalactic freeway is coming you had better get your towel.",
        "good": "6",
        "bad": "0",
        "replies": [
            {
                "user_name": "sgtchemistry225",
                "time": "23 June, 2021",
                "context": "Don't panic.",
                "good": "1",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "yo666",
                        "time": "23 June, 2021",
                        "context": "Thanks for all the fish.",
                        "good": "5",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "spikeit2times",
        "time": "24 June, 2021",
        "context": "All of that is assuming ET's technology is no better than our own. ETs farther away with better tech might be seeing Earth as well. \n\nAnd if ETs are anything like humans; the only thing they're waving at us is pistols (or ray guns).",
        "good": "6",
        "bad": "2",
        "replies": [
            {
                "user_name": "BlueClover",
                "time": "25 June, 2021",
                "context": "I love when they say other life or intelligent life in the universe would need oxygen or water. I'd love to know how they know another life form could come to be in a  chemical setting other than ours.",
                "good": "4",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "quietsmith",
                "time": "25 June, 2021",
                "context": "Compare technology now to 100 years ago. \n\nNow imagine we'd had even 1000 years more of a head start where we'd be. It could easily be 100,000 years in the scheme of things, such a time scale is nothing to the universe. Imagine where our technology will be in a 1000 much less 10,000 years.",
                "good": "12",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "justacitizen$$$",
                        "time": "26 June, 2021",
                        "context": "The problem with this logic is we do have 1000’s of years of technological advances and really there is no faster path to get to future tech than the pace we’re on",
                        "good": "0",
                        "bad": "3",
                        "replies": [
                            {
                                "user_name": "quietsmith",
                                "time": "26 June, 2021",
                                "context": "Compared to even 100 years ago? Yeah, over the last 100 we've come further than we have in the last 2000.",
                                "good": "2",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "justacitizen$$$",
                                        "time": "4 July, 2021",
                                        "context": "The problem with your logic is that expansions are exponential. What I mean is the progress and speed at which we can discover really can’t be done faster than it was done. Reality literally proved it. Coulda woulda shouldas don’t mean anything being hypothetical. Basically your telling god to speed up and he’s already done, you’re too slow",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": [
                                            {
                                                "user_name": "quietsmith",
                                                "time": "4 July, 2021",
                                                "context": "Not hardly :D as when we \"left it up to god\" no progress was made, in fact, progress was loss, western society stagnated for centuries under Christian rule :D",
                                                "good": "0",
                                                "bad": "0",
                                                "replies": []
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "JIMBOC733",
        "time": "23 June, 2021",
        "context": "Getting closer and closer to the truth. I wonder how the religious oligarchies are going to react. Probably hilariously. 🛸 👽 ",
        "good": "5",
        "bad": "3",
        "replies": [
            {
                "user_name": "randy4usa",
                "time": "23 June, 2021",
                "context": "If your view is that those who disagree with you are not scientists, because they reach a different conclusion, and thus not entitled to a voice, then you are a religious zealot, and not a scientist.",
                "good": "2",
                "bad": "4",
                "replies": [
                    {
                        "user_name": "penguinsfan8771",
                        "time": "24 June, 2021",
                        "context": "Religious people should butt out of science.",
                        "good": "5",
                        "bad": "3",
                        "replies": [
                            {
                                "user_name": "thomaswinslow009",
                                "time": "24 June, 2021",
                                "context": "Penguin, Penguin, Penguin. Many great scientist throughout history were religious.",
                                "good": "8",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "randy4usa",
                                        "time": "24 June, 2021",
                                        "context": "Correct, both in the past and still living today, some of the greatest minds in science.",
                                        "good": "6",
                                        "bad": "0",
                                        "replies": [
                                            {
                                                "user_name": "penguinsfan8771",
                                                "time": "24 June, 2021",
                                                "context": "Many of them are able to keep the god nonsense out of their work. There is no evidence any god or gods exist.",
                                                "good": "2",
                                                "bad": "0",
                                                "replies": [
                                                    {
                                                        "user_name": "randy4usa",
                                                        "time": "24 June, 2021",
                                                        "context": "Yet, you are unable to keep anti-God nonsense out of your view and are still unwilling to recognize yourself as a religious zealot.\nGregor Mendel is the father of genetics; before him, the Darwinian idea that change came from somatic causes was THE theory.  Mendel's theory was rejected for decades, because he was a creationist.  The people who refused to allow his theory into the mainstream, were religious zealots.  You do NOT have to reject the existence of God to be a scientist.  If you condition your acceptance of someone as a scientist, that he/she be an atheist, then you are not a scientist, you are a religious zealot.",
                                                        "good": "2",
                                                        "bad": "4",
                                                        "replies": [
                                                            {
                                                                "user_name": "penguinsfan8771",
                                                                "time": "24 June, 2021",
                                                                "context": "God has zero place in this conversation. I'm not religious and I'm not a zealot.",
                                                                "good": "0",
                                                                "bad": "0",
                                                                "replies": [
                                                                    {
                                                                        "user_name": "randy4usa",
                                                                        "time": "24 June, 2021",
                                                                        "context": "You are both religious and a zealot or you would not be opposed to others concluding from the evidence available that the evidence points to the existence of God.",
                                                                        "good": "1",
                                                                        "bad": "4",
                                                                        "replies": [
                                                                            {
                                                                                "user_name": "penguinsfan8771",
                                                                                "time": "25 June, 2021",
                                                                                "context": "There's no evidence a god exists. None.",
                                                                                "good": "0",
                                                                                "bad": "0",
                                                                                "replies": []
                                                                            }
                                                                        ]
                                                                    },
                                                                    {
                                                                        "user_name": "thomaswinslow009",
                                                                        "time": "25 June, 2021",
                                                                        "context": "Face it. Randy has a valid point on your narrow mindedness.",
                                                                        "good": "4",
                                                                        "bad": "1",
                                                                        "replies": [
                                                                            {
                                                                                "user_name": "penguinsfan8771",
                                                                                "time": "25 June, 2021",
                                                                                "context": "I'm not narrow minded you dim bulb. There's no evidence any god or gods exist, therefore I dismiss any god or gods as a possibility.",
                                                                                "good": "1",
                                                                                "bad": "0",
                                                                                "replies": [
                                                                                    {
                                                                                        "user_name": "thomaswinslow009",
                                                                                        "time": "25 June, 2021",
                                                                                        "context": "Not saying there is a god. I'm an agnostic. I'm saying he has a point on your bias on how you judge people. And name calling does not improve your IQ.",
                                                                                        "good": "6",
                                                                                        "bad": "0",
                                                                                        "replies": [
                                                                                            {
                                                                                                "user_name": "penguinsfan8771",
                                                                                                "time": "25 June, 2021",
                                                                                                "context": "I dismissed any gods as existing due to a lack of evidence. If evidence is presented that can be tested, studied and verified, I will examine it.",
                                                                                                "good": "0",
                                                                                                "bad": "0",
                                                                                                "replies": [
                                                                                                    {
                                                                                                        "user_name": "thomaswinslow009",
                                                                                                        "time": "25 June, 2021",
                                                                                                        "context": "On that we are in agreement. No physical evidence anyway.",
                                                                                                        "good": "7",
                                                                                                        "bad": "0",
                                                                                                        "replies": [
                                                                                                            {
                                                                                                                "user_name": "randy4usa",
                                                                                                                "time": "25 June, 2021",
                                                                                                                "context": "Thomas, you sound like someone who is willing to look at all the evidence.  I'd encourage you to look at sites run by Answers in Genesis, Institute for Creation Research, Kent Hovind, et al.  You might be surprised by what you see.  You may find that the preponderance of the evidence points to God, not proof, like the burden of a criminal court, but like the burden of a civil court.  Thanks for your well thought input into this thread.  Cheers, Randy",
                                                                                                                "good": "0",
                                                                                                                "bad": "4",
                                                                                                                "replies": [
                                                                                                                    {
                                                                                                                        "user_name": "sciencerocks",
                                                                                                                        "time": "25 June, 2021",
                                                                                                                        "context": "After 30 years of being an atheist, I came back to faith and later to Christianity. It was not due to evidence. As a scientist I know that there cannot be evidence of God -- science deals with the natural world, not the supernatural. Sending an open-minded person to Gish, AIG, ICR, or Hovind, is a certain way to turn them off to faith. Any science-minded person can easily see what a joke they are.\n\nThere is no evidence for God -- that is why it is called 'faith.'",
                                                                                                                        "good": "4",
                                                                                                                        "bad": "0",
                                                                                                                        "replies": [
                                                                                                                            {
                                                                                                                                "user_name": "randy4usa",
                                                                                                                                "time": "25 June, 2021",
                                                                                                                                "context": "Faith, not blind faith.  One doesn't have to choose between faith and science.  I have met several of those men of science personally, and they are no joke.  I reached my faith through science, not in spite.",
                                                                                                                                "good": "0",
                                                                                                                                "bad": "0",
                                                                                                                                "replies": [
                                                                                                                                    {
                                                                                                                                        "user_name": "sciencerocks",
                                                                                                                                        "time": "25 June, 2021",
                                                                                                                                        "context": "I didn't lose my faith for 30 years because of science, but because of the Church. I came back to faith from deep reasoning, not evidence. I have since found ways to reconcile science and faith, even though I still conduct my research in human evolution and teach the topic at a university level. Unlike Francis Collins, I don't see the genetic code as evidence of God. Rather I see genes and evolution itself as beautiful manifestations of God\nThe anti-science creationists like Gish (whom I've debated on radio) and the others you mentioned miss out on so much of the meaning of God and the Bible. For example, obviously I don't take the book of Genesis literally, as it was clearly written as allegory -- Christ also often talked in parables. Taken as a parable, Genesis makes SO much more sense in the light of human evolution.",
                                                                                                                                        "good": "1",
                                                                                                                                        "bad": "0",
                                                                                                                                        "replies": [
                                                                                                                                            {
                                                                                                                                                "user_name": "randy4usa",
                                                                                                                                                "time": "25 June, 2021",
                                                                                                                                                "context": "Calling Dr. Gish, anti-science is just libel.  I have had classes with him, read his books, knew him personally; he was a solid scientist.  I disagree with your conclusion that Genesis is allegory; it's literal and defensible with science.  The evidence for a young Earth and a literal, world wide flood is massive.  I couldn't believe the Bible, if I didn't believe it's foundational book.",
                                                                                                                                                "good": "0",
                                                                                                                                                "bad": "1",
                                                                                                                                                "replies": [
                                                                                                                                                    {
                                                                                                                                                        "user_name": "sciencerocks",
                                                                                                                                                        "time": "25 June, 2021",
                                                                                                                                                        "context": "As noted above, I debated Gish on public radio. His only argument was an argument of incredulity, which is not a scientific argument at all.\nBut I had encountered Duane Gish many years earlier in South Africa, where he was to give a talk at my then university, the University of the Witwatersrand, Johannesburg. We invited him to view the entire fossil collection we had then (circa 1988) of over 500 early hominin fossils, including the famous Taung juvenile skull. This would have been a very special privilege, as the general public does not often get to see and handle these precious fossils in person. Yet he declined.\nSo when Gish claims that he sees no evidence of human evolution, it is only because he refused to look.",
                                                                                                                                                        "good": "0",
                                                                                                                                                        "bad": "0",
                                                                                                                                                        "replies": []
                                                                                                                                                    }
                                                                                                                                                ]
                                                                                                                                            }
                                                                                                                                        ]
                                                                                                                                    }
                                                                                                                                ]
                                                                                                                            }
                                                                                                                        ]
                                                                                                                    }
                                                                                                                ]
                                                                                                            }
                                                                                                        ]
                                                                                                    }
                                                                                                ]
                                                                                            }
                                                                                        ]
                                                                                    }
                                                                                ]
                                                                            }
                                                                        ]
                                                                    }
                                                                ]
                                                            },
                                                            {
                                                                "user_name": "sciencerocks",
                                                                "time": "25 June, 2021",
                                                                "context": "\"Mendel's theory was rejected for decades, because he was a creationist. \"\n\nThat is complete nonsense. Mendel was never rejected, he was just obscure and unknown. Once his work was discovered it formed the basis of the Evolutionary Synthesis in the 20s, 30s, and 40s in which genetics was combined with natural selection. Nobody cared if Mendel was a 'creationist' and I don't think that term even existed back then.",
                                                                "good": "6",
                                                                "bad": "0",
                                                                "replies": []
                                                            }
                                                        ]
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            },
                            {
                                "user_name": "randy4usa",
                                "time": "24 June, 2021",
                                "context": "That's what I just said.  If you are so determined that you know the answer, that instead of looking for truth, you look for confirmation of your belief, you are not a scientist; you are a religious zealot.  That means that you are unwilling to consider someone else a scientist, because he/she holds beliefs that are different from yours, YOU are a not a scientist.",
                                "good": "2",
                                "bad": "1",
                                "replies": [
                                    {
                                        "user_name": "penguinsfan8771",
                                        "time": "24 June, 2021",
                                        "context": "I have no religion. There's no god or gods that can shown to exist. There's a lack of evidence that proves any god or gods exist so I dismiss all gods as a creation of man. Science is always updating as new information becomes available. Religion is nonsense.",
                                        "good": "0",
                                        "bad": "1",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "Hondoxp589",
                "time": "24 June, 2021",
                "context": "Religion will incorporate new truths into their belief system. It's all a scam and there are always suckers.",
                "good": "1",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "rednek16",
        "time": "24 June, 2021",
        "context": "\"Hiding is not really an option,\" Says Lisa Kaltenegger, director of the Carl Sagan Institute at Cornell University.\n\nBecause everyone knows how easy it is to spot other civilizations in space?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bsmvtacmedic",
        "time": "24 June, 2021",
        "context": "At least Aliens will be better than Biden/Harris! Fact",
        "good": "9",
        "bad": "3",
        "replies": [
            {
                "user_name": "realist12345678",
                "time": "24 June, 2021",
                "context": "So long as they're not fat and orange they'll be ok.",
                "good": "1",
                "bad": "6",
                "replies": [
                    {
                        "user_name": "quietsmith",
                        "time": "24 June, 2021",
                        "context": "So how's it feel that Biden is everything you imagined Trump was?",
                        "good": "2",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "realist12345678",
                                "time": "25 June, 2021",
                                "context": "Honest, hard working, dedicated to the country and not just to his own ego, has a long-term agenda and not a short-term populist do-anything-for-a-vote mindset, respected by the rest of the world instead of being a laughing stock, has a commitment to tackle the big issues like climate change, has got the country moving again with his vaccine rollout instead of saying it will “just disappear”, economy bouncing back, stock market record high.\nAdd to that he’s not obese and he doesn't paint his face.\nYeah feels pretty good so far.",
                                "good": "0",
                                "bad": "5",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "user_name": "spikeit2times",
                        "time": "24 June, 2021",
                        "context": "What do you have against fat (er - I mean curvy) Talaxians? Neelix was a fine outstanding being.",
                        "good": "2",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "dan5047628",
        "time": "24 June, 2021",
        "context": "Call me when they land",
        "good": "3",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "earlwb",
        "time": "24 June, 2021",
        "context": "The problem is that if an advanced civilization came to Earth, they could inadvertently destroy our civilization in the same manner that we destroyed other civilizations on Earth ourselves. Not only just disease, but with technology too.",
        "good": "8",
        "bad": "2",
        "replies": [
            {
                "user_name": "sciencerocks",
                "time": "25 June, 2021",
                "context": "Or they could become a focal point of human unity.",
                "good": "6",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "randy4usa",
        "time": "23 June, 2021",
        "context": "Don't worry, nobody's going to come here looking for intelligent life.",
        "good": "9",
        "bad": "3",
        "replies": [
            {
                "user_name": "ArneSaknussem",
                "time": "25 June, 2021",
                "context": "My dog is very intelligent.",
                "good": "6",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "Hondoxp589",
        "time": "24 June, 2021",
        "context": "\"Life\" as we know it is unique and indigenous to Earth and its unique conditions. \"Intelligence\" as we describe it is a unique behavior of Man who evolved to survive on Earth. \"Intelligent Life\" is the description we give to ourselves, and not a constant of the universe.",
        "good": "4",
        "bad": "7",
        "replies": [
            {
                "user_name": "thomaswinslow009",
                "time": "24 June, 2021",
                "context": "We don't know this yet. Not enough info. Unless you have traveled the galaxy and know something the rest of us don't.",
                "good": "1",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "Hondoxp589",
                        "time": "24 June, 2021",
                        "context": "Unless we are the first to the party.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "thomaswinslow009",
                                "time": "24 June, 2021",
                                "context": "Possible. Someone has to be first!",
                                "good": "3",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "dan5047628",
                                        "time": "25 June, 2021",
                                        "context": "Most ignore the possibility that God wanted us to be the only life in His Universe.",
                                        "good": "0",
                                        "bad": "2",
                                        "replies": [
                                            {
                                                "user_name": "thomaswinslow009",
                                                "time": "25 June, 2021",
                                                "context": "First you must produce evidence that your god even exists.",
                                                "good": "0",
                                                "bad": "1",
                                                "replies": []
                                            },
                                            {
                                                "user_name": "Hondoxp589",
                                                "time": "26 June, 2021",
                                                "context": "Have you ever met a God? Just stories you hear from other people, right? So, do you believe in God, or people who tell you stories?",
                                                "good": "0",
                                                "bad": "0",
                                                "replies": []
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "quietsmith",
                "time": "24 June, 2021",
                "context": "No really, the reason there's a planet capable of supporting life at all is because of how vast the universe is. Play the odds game all you want and the universe will beat it through sheer numbers.",
                "good": "9",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "Hondoxp589",
                        "time": "26 June, 2021",
                        "context": "Your thinking of a roulette table and the odds of a winning number. Who placed the bet?",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "quietsmith",
                                "time": "26 June, 2021",
                                "context": "No, I'm thinking that even if you say \"it's one in a billion!\" that a planet will even be the correct distance from a star to support life then you're looking at just one galaxy, that's hundreds of planets.\n\nThere are billions of galaxies.",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "BlueClover",
                "time": "25 June, 2021",
                "context": "As we know it, correct. Intelligence as we describe it, also correct. And I agree 100% it may not be a constant of the universe. The universe could have be teeming with current and past intelligent life, just may be that we may be unique in what we need to survive and very unintelligent in comparison.\nThere just is no way of knowing at this time.",
                "good": "5",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "dan5047628",
        "time": "28 June, 2021",
        "context": "No landing, no proof no ET. \nReminds me of the theory of Evolution.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dan5047628",
        "time": "25 June, 2021",
        "context": "I think sci fi is a great TV past time. The Stargate SG1 series and its spin offs were some of my favorites but still just make believe.\nMost ignore the possibility that God wanted us to be the only life in His Universe.",
        "good": "1",
        "bad": "8",
        "replies": []
    },
    {
        "user_name": "Hearsedriver",
        "time": "27 June, 2021",
        "context": "I believe the words of the Bible. I also believe the words of the ancient Buddhist monk scriptures. Hopefully in the next life we won’t be recognized as the Portland of the universe.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "alpgini",
        "time": "24 June, 2021",
        "context": "\"We have received and seen the signals from the earth human \"The Bachelor\" series. Ploggrzz! Set light weapons to disintegrate this earth planet! They're too stupid to live!\"",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Hondoxp589",
        "time": "26 June, 2021",
        "context": "Some people think the \"world\" was created by a God who breathed life into Man. Some think the universe is a soup of chaos that spontaneously spawned life in the right conditions. Both prospects are very difficult to prove, or dismiss. But here we are! Pass the mustard.",
        "good": "2",
        "bad": "0",
        "replies": [
            {
                "user_name": "GunsnBible",
                "time": "28 June, 2021",
                "context": "The funny thing is both require faith even if one is dead wrong.  Its a lot easier to believe in a Supreme being that loves you than it is that we got here by accident.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "Hondoxp589",
                        "time": "29 June, 2021",
                        "context": "I think it is better to know, or not know. I don't believe in anything.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    }
]