[
    {
        "user_name": "patriotperson",
        "time": "21 hours ago",
        "context": "Did the study mention that over half later wish they hadn't had the surgery or that almost 1 in 3 kill themselves?",
        "good": "16",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "hervoice",
        "time": "21 hours ago",
        "context": "Should be arrested for mutilating children undergoing natural changes during their teen years, and doesn't science tell us their brains are not fully formed until 25? All adults involved should be prosecuted.",
        "good": "16",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "voting4trump2024",
        "time": "21 hours ago",
        "context": "If I had a dollar for every gender out there I would have 2 dollars and a bunch of counterfeits!",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "wilecoyote",
        "time": "19 hours ago",
        "context": "Can't legally get a tattoo, but they can let someone permanently mutilate them with surgery?  What have we allowed to happen?",
        "good": "6",
        "bad": "0",
        "replies": [
            {
                "user_name": "wfcvoter",
                "time": "18 hours ago",
                "context": "Tattoo or tanning salons!",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "bilf",
        "time": "21 hours ago",
        "context": "Implants for 14 YO boys who want to look more girlish, and mastectomies for 14 YO girls who want to look boyish? How about those 'teachers,' 'doctors,' and Democrats who think that they are improving lives of those warped by current Democrat gender 'science?' ~ Teachers, leave them kids alone",
        "good": "12",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ratman823",
        "time": "19 hours ago",
        "context": "Maybe this whole \"trans\" thing is just another version of eugenics...",
        "good": "2",
        "bad": "0",
        "replies": [
            {
                "user_name": "wfcvoter",
                "time": "18 hours ago",
                "context": "It will certainly cut down on overpopulation!",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "conservativenation",
        "time": "21 hours ago",
        "context": "Can’t wait to see the number of people that vote for Oz in Pennsylvania who also supports this insanity!!",
        "good": "0",
        "bad": "2",
        "replies": [
            {
                "user_name": "captbob642",
                "time": "18 hours ago",
                "context": "Not true.",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "wfcvoter",
                "time": "18 hours ago",
                "context": "Where did you get that idea?",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "treetrolly989",
        "time": "22 hours ago",
        "context": "This whole transgender push actually has zero to do with transgenders. It's just another way for liberals to divide. They don't care about equality, rights for transgenders, etc. The more divisive issues the can create, the more we are divided. It's ALL ABOUT division.\n\nLiberals hate Americans, the Constitution, and free market capitalism. They destroyed our economy with the lockdowns and measures like the ACA and immigration amnesty. The “Affordable” Care Act has been nothing short of a disaster. My health insurance bill is up to $450/month. (Compare this to my $25/month auto insurance from Insurance Panda or my $10/month renters insurance from Homesite -both private enterprise!)\n\nAll men should use the men's bathroom and all women should use the women's bathroom.\n\nThis kind of stuff could not be made up in a National Lampoon comedy (when they made good comedies). Our society needs a reality check. People just have too much time on their hands. Time for a new political party.",
        "good": "3",
        "bad": "0",
        "replies": [
            {
                "user_name": "conservativenation",
                "time": "21 hours ago",
                "context": "Almost nothing to do with division! It’s about power. Plan and simple. The goal is to A) give people a disability or B) make someone a special minority or C) make a person an outsider, a grifter.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "voting4trump2024",
        "time": "21 hours ago",
        "context": "You can't drink alcohol before you are 21 because you are too young. You can't vote until you are 18 because you are too young. You can't buy a hand gun until you are 21 because you are too young. You can't buy a rifle until you are 18 because you are too young. \n \nNow democrats are encouraging young kids to change their gender without parents consent and even make changes to their own bodies when they are not old enough or mature enough to make those decisions. democrats want to be able to talk with kindergarteners about their privates instead of teaching them something that would be useful to them later in life like reading, writing, arithmetic, history, and science!",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "TheCentralScrutinizer622",
        "time": "21 hours ago",
        "context": "Will American's be strong enough to destroy the woke-ness?\nWill many keep caving and bowing to the Marxist and Socialist?\nThis is the puzzle that needs solved.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bobobobo9",
        "time": "18 hours ago",
        "context": "Yeah, most 14 year olds  don't know what they want for dinner. Gender 'selection' is just too much for them to handle.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bidenisadisgrace",
        "time": "18 hours ago",
        "context": "The mentally unstable indoctrinating our youth.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Tunafish995",
        "time": "18 hours ago",
        "context": "Sum CBS up in one word SICK !",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "namesdonthurt",
        "time": "19 hours ago",
        "context": "Maybe they should just be put down.  Just get rid of the bad genes.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "libsbcrazy423",
        "time": "1 hour ago",
        "context": "One quick question for any that support this insanity\nWhy is it that the vast majority of these people with what are obvious mental health issues killing themselves after having this life altering surgery or are drug addicted or seriously depressed?\nFact the majority of post surgery trans people regret having to surgery\nThat's something the left doesn't want to discuss",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ccat1281",
        "time": "18 hours ago",
        "context": "Parents it's time to TEACH AND STAND UP FOR YOUR CHILDREN and shame on you all if you don't.  And when they kill themselves and or have lifelong problems,  you are ultimately the one that is to blame for not protecting your child from the evil forces that be.",
        "good": "4",
        "bad": "0",
        "replies": []
    }
]