[
    {
        "user_name": "GoodCigarsNeverDie-TheyJustGetReincarnated",
        "time": "26 September, 2022",
        "context": "If they spy on my browsing habits, they'll be disappointed when they realize they don't find anything useful.",
        "good": "6",
        "bad": "0",
        "replies": [
            {
                "user_name": "MAMGAA",
                "time": "21 hours ago",
                "context": "Oh but they do. Every bit of your browsing habits are useful to companies.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "redstatered",
        "time": "26 September, 2022",
        "context": "when you walk around any store you are being tracked.  they know what you looked at and how long.  Good luck america",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "wpontius632",
        "time": "26 September, 2022",
        "context": "Opt-out all you want, they will still collect your data.  Studies have shown that a high percentage of companies, apps and programs continue to collect data even after you opt-out.",
        "good": "4",
        "bad": "0",
        "replies": [
            {
                "user_name": "MAMGAA",
                "time": "21 hours ago",
                "context": "Yup, don't \"opt out\" and instead actively BLOCK them with things like Firefox and uBlock extension.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "muttdog316",
        "time": "26 September, 2022",
        "context": "There should be no such things like these electronic cookies it is a invasion of privacy period! A law is needed to stop them!",
        "good": "6",
        "bad": "0",
        "replies": [
            {
                "user_name": "ResseAble",
                "time": "26 September, 2022",
                "context": "Republicans wouldn't stop that, because it helps capitalism.",
                "good": "0",
                "bad": "2",
                "replies": [
                    {
                        "user_name": "Youvotedforthis994",
                        "time": "27 September, 2022",
                        "context": "There's a Republican under your bed, Cupcake. Call someone who cares.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "Toyman0",
                "time": "26 September, 2022",
                "context": "Fat chance of that happening.  Our elected officials in Congress are being paid off by these companies to make sure that kind of law is never enacted.",
                "good": "10",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "hwyrick",
        "time": "26 September, 2022",
        "context": "Massive Data Repository, Bluffdale, UT.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rkasa",
        "time": "27 September, 2022",
        "context": "Don't do anything on your phone you would not do in front of your mother.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "johnbt4444471",
        "time": "26 September, 2022",
        "context": "\" Advertisers love cookies because they help customize the ads you see.\"\n\nNobody I know even looks at the ads.",
        "good": "13",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "gripetroll",
        "time": "26 September, 2022",
        "context": "The joy of listening in on your phone while it’s still off.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "nonotrush",
        "time": "26 September, 2022",
        "context": "There is no such thing as a \"good cookie\" when it comes to privacy. Reason is, every cookie records info and all info transferred someplace for some purpose, all of which can and does effect your privacy. If you want privacy, you have to opt in for a less functional, less user friendly browser. There's a bunches of them, so I really do not wish to list them. If you want your privacy bad enough, just search and you will find some. Beware, it can be a big project to be hidden, super big if you are serious about it.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "diktheduk",
        "time": "26 September, 2022",
        "context": "By all means use AdChoices and WebChoices to more narrowly define exactly what ads that they can target you with.  You don't like an ad for laundry detergent , but forget to block an ad for underarm deodorant? Guess what ads are going to to bombard your browser. They like it when you help them target their ads for them. Makes the business model much more profitable. Easier to sell for a larger cash inflow with lower costs.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "2displayname",
        "time": "27 September, 2022",
        "context": "They would be so disappointed in me.  Work, home sleep.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "GKerry",
        "time": "2 days ago",
        "context": "I gave up on controlling any ads.I just grit my teeth when I load a page,  count to 5 and then shut off my internet ! It used to be easier. Now android makes you go thru multiple steps to turn internet on/off. There's also airplane mode, but it shuts off incoming text and calls also\nI try to NEVER use apps because apps take up extra resources on the phone, and they often advertise to you in ways you can't stop them.    In version 10, I was elated that I gained ability to shut an app off from the internet altogether ! Unfortunately, I had to upgrade to a 5G phone. Now in Android 12  we're back to NOT being able to control internet at the APP level.  There really does need to be some laws about giving users certain controls over their phone.  For now, it's 1,2,3,4,5...off.Of COURSE, the fact we can even turn off internet is a blessing! That's a dinosaur from the days when everyone got charged per kilobyte.\nI don't know if there was a law in place that required ability to turn off internet or if they just did it out of practicality. I suppose airplane mode will always exist. But that's like removing a kidney with a sledgehammer when you'd much prefer a scalpel.\n It can definitely get worse....Try turning off internet to your Xbox and you have nothing but a paperweight!  \nI suppose, when it gets to the point of  being unacceptable, I'll have to pay someone to root my phone and load an alternate operating system...but I'm not quite there yet.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "alibangbang",
        "time": "1 day ago",
        "context": "Tik tok info about you goes to China. They are filtering it and collect all pertaining to US military.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "fld11",
        "time": "1 day ago",
        "context": "Opting out normally has the opposite effect. It just a matter of reversing the link buttons by the tracking software. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "MAMGAA",
        "time": "21 hours ago",
        "context": "LoL, the number of trackers on Fox News is staggering and yet they are the ones who are going to tell me how to protect myself? Even their advise is trash in regards to just downloading an app that blocks trackers from companies that AGREE to let you do it.\n\nDo yourself a favor, use  the duckduckgo browser or Firefox browser and install uBlock extension.\n\nDon't just \"opt out\", actively BLOCK the trackers.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "justwonderingoutloud",
        "time": "2 hours ago",
        "context": "Use Brave browser and get paid for it.",
        "good": "0",
        "bad": "0",
        "replies": []
    }
]