[
    {
        "user_name": "kgc67",
        "time": "7 September, 2022",
        "context": "Show me a rising, indoctrinated, woke, young American and I'll show you the future of socialism.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "0x88",
        "time": "7 September, 2022",
        "context": "If there is no guaranteed employment at the end of the training program, it's all just hot air, which is exactly why we have trillions of dollars worth of student debt. After reading the article, all I feel is a bunch of hot air and empty promises.",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "JamesMarlow854",
        "time": "7 September, 2022",
        "context": "Such  technical educational programs are a much better choice than college for many young people teaching lifetime skills.   ",
        "good": "43",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cranston84snord",
        "time": "7 September, 2022",
        "context": "Most young people need these courses that are based in reality",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "retortinform",
        "time": "7 September, 2022",
        "context": "If you are poor or a minority, try to get a college degree if you can. make sure it’s one in high demand.\nIf you can’t, a trade is also a choice, especially in plumbing, electrical, or AC, etc. \nBut if you can, stick with college. Do high tech. I hire those for $200,000 at the very least, in either coast, if you have Comp Sci. More if you have a masters or ML or data science. \nIf you are poor or a minority, don’t skip a year. You won’t be back. Stick with it. Your future self and your family will thank you for it.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "thebige797",
        "time": "7 September, 2022",
        "context": "In high school I attended Würzburg American high school located on the Army base. I was there for 2 years and had options for \"work study\". I did Small engine repair, X-Ray tech, Hospital administration and welding.  Although I did not follow any of those vocations I can honestly say it was a great opportunity preparing me for the workplace and developing a work ethic.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "enoughiswaytoomuch",
        "time": "7 September, 2022",
        "context": "99% of kids should be looking at vocational schools instead of college.. our country is actually in a shortage of skilled labor.  ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "diccus",
        "time": "7 September, 2022",
        "context": "Not in Dem States like California. They defunded Metal shop, wood shop, auto mechanics, drivers ed, etc. Kids graduate and can't read a tape measure. Not only don't they have any skills, but they also can't read or write. Gotta teach the important stuff like CRT. ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "michaelwinner",
        "time": "7 September, 2022",
        "context": "pass.  I'd rather hire a well educated immigrant than a vocational woke american student.",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "Phasepilled",
        "time": "7 September, 2022",
        "context": "I will just hire a Catholic Mexican with a GED, they atleast work hard. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "nothingbuta",
        "time": "7 September, 2022",
        "context": "I suggest teens read the book So You Wanna Be A Ho by Velvet Jones! ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "nosocialism583",
        "time": "7 September, 2022",
        "context": "Trade schools are great!  We have one that works with the local college.  It's a great program for kids.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "MoreyAmsterdamn",
        "time": "7 September, 2022",
        "context": "Is there a truck driver training institute? ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "hh65abc",
        "time": "7 September, 2022",
        "context": "Most construction goes to illegals because contractor's can charge the going rate for labor and pay their south of the border employees less. ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "askjask",
        "time": "7 September, 2022",
        "context": "they need facts. why do they keep mentioning colleges as if that is the only choice? where was manufacturering? how many jobs will be available when they finish. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Liberty-over-fear",
        "time": "7 September, 2022",
        "context": "My employer (a major shipbuilder) has been doing a HS vocational program for a few years now. ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "turkeybird",
        "time": "7 September, 2022",
        "context": "It's about time!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Spudnut",
        "time": "7 September, 2022",
        "context": "Politicians running for office should spend their war chest in local communities making a difference. Maybe build trade schools maybe feed the homeless show us they know how to spend our money then we vote. \nRemember Georgia spent 500 million dollars two years  ago sending someone’s neighbor to Washington…what a waste. ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "canyonoflight",
        "time": "7 September, 2022",
        "context": "When I was younger, this was called On The Job Training, and it did not require a Government Program.  Just go to work at a job!",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "coasty50",
        "time": "7 September, 2022",
        "context": "After almost 50 years of being told they needed to go to college, they are finally brining back Shop classes into schools. It took Educators fifty years to bring back what is known to work! What's next, seperating classes of girls and boys so they learn better as has been known for generations?\nBetter late than never I guess. ",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "RisingsonTwo",
        "time": "7 September, 2022",
        "context": "KaChava is Kacaca",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "j.j.jingleheimerschmidt",
        "time": "7 September, 2022",
        "context": "Despite having enjoyed a unique, at times very lucrative 32-yr. career in the entertainment business, if I had to do it all again, I would never have gone to college, preferring to have done the trade route.\nI don't have the math chops to have been my absolute favorite career choice of Metallurgy, but I would have enjoyed being a machinist or welder.\nHeavy equipment operation and logistics would also have been fun.\nToo bad I was at an impressionable age when my parents poo-pooed such a notion as they looked down on such (ewwwwww) blue-collar existence.",
        "good": "24",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "candace666",
        "time": "7 September, 2022",
        "context": "Does this apply to all students or just minorities ?",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "jmontysko",
        "time": "7 September, 2022",
        "context": "About 30 years too late. ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mc130ip",
        "time": "7 September, 2022",
        "context": "The local high school here partnered with the local community college and is offering a program for seniors where the kids work 1/2 day getting qualified as a firefighter.  It's a great deal for those who have decided to go into community service, lets them graduate as a certified firefighter and set themselves up for a job as a junior firefighter in any city or county in the state.\nWe need more programs like this.  These \"non college\" jobs are essential also.",
        "good": "63",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "LibAggravator",
        "time": "7 September, 2022",
        "context": "CTE not CRT. ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Where'sAmerica?",
        "time": "7 September, 2022",
        "context": "Obama took this away.   please don't forget.  during his time it was the push, college for everyone and very little work.   it NEVER MADE SENSE ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "fmtt6938",
        "time": "7 September, 2022",
        "context": "I don’t question the concept of vo-tech programs and what is being sold by the media to the general public as an opportunity to pursue a meaningful career path as a young adult. I will however challenge the hypothesis that vo-tech has a history of producing an irreplaceable blue collar workforce. My experience is that vo-tech was often used as an alternative for those underachievers who chose not to apply themselves to a typical science or math curriculum, or in many cases were a distraction in class for any number of reasons, the least of which was not personal conduct. I fully support the concept being sold and have personally see. great outcomes. We only need to ensure it doesn’t become yet another avenue, or dumping ground, for those disruptive young adults who choose not to apply themselves in a normal class setting. ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "justgoaway",
        "time": "7 September, 2022",
        "context": "I went to. Vo-Tech school in the 70’s. It was a school where we had both academic classes and shop or business classes and we received two diplomas. One from our home high school and one from the tech school. Students in business majors who had enough school credits and were age appropriate were allowed to have a full time job while still in school. They were monitored by the school. Those in shops were able to work on job projects the school was involved in such as car repairs, small construction jobs, electrical and engineering, etc. I majored in Data Processing and was going to go to college to further my education in the field but the first year of college was what I learned in three years of tech school so I didn’t go. They wouldn’t allow us to skip the first year of college and why spend all that money only to repeat what I already knew. I was able to get a good job in Data Processing right out of high school. I always advocated for more high schools to be Vo-Tech schools. You had to maintain a C or better grade to go to and stay in them. It was a win win for those who were easily bored just sitting in a classroom and listening to “theory” all day long. ",
        "good": "41",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "MoreyAmsterdamn",
        "time": "7 September, 2022",
        "context": "The best part of college is the girls in short skirts ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "faucisucks184",
        "time": "7 September, 2022",
        "context": "Just teach them to be Fruits that will go a long way",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "DERBY401",
        "time": "7 September, 2022",
        "context": "THIS IS MUCH NEEDED! ",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jt^",
        "time": "7 September, 2022",
        "context": "Construction jobs are going mostly to illegals in my state,  and Joe Biden's economy will kill jobs  until we have a Republican in office.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rebelyell606",
        "time": "7 September, 2022",
        "context": "Nothing new about this -- we've had Vo-Tech/Trade schools going at least as far back as the 60's - guess the \"everybody must go to college\" crowd was unaware....",
        "good": "22",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "airborneveteran675",
        "time": "7 September, 2022",
        "context": "4 years of mandatory service in the military will give these kids a shot at success too. Unfortunately 75 percent of the population is ineligible to serve due obesity and mental issues. ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "flydoc100ret",
        "time": "7 September, 2022",
        "context": "What a great idea and a lot less costly than an expensive four year college.  I wish I had it, then i might not have wasted three semesters in college.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bloviatethis",
        "time": "7 September, 2022",
        "context": "Locally the high school has set up a welding program and a drone program partnering with local businesses.  About time when I look at what is being paid for those trade type fields...a\nmotivated kid can be just as successful as a college graduate... not all but, quite a few.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Umayinhalemyfumes",
        "time": "7 September, 2022",
        "context": "CTE in high schools in my area of eastern PA area are a joke. I spent 20 years teaching in CCs and they are the only place I see real CTE occurring. Most high schools in my area of the western suburbs of Philly are geared to sending as many students to college as possible. That's how high schools here measure their success. That's how parents measure their success. Any student who doesn't go to college is viewed as a loser. 99% of the students in these high schools go to a traditional college. CTE is viewed as a dumping ground for losers. I am not saying this is right just that it is the reality today.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tw1874",
        "time": "7 September, 2022",
        "context": "Omg the useless liberal history Professors and the useless Arts Professors and the useless gender studies Professors won’t have a job if the High Schools do this !! It’s great !!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jo825998",
        "time": "7 September, 2022",
        "context": "\"It's what many people still think of as \"vo-tech\" or vocational-technical education.\"\nJust call it what it is. It's vo-tech in a new wrapper. It is still vo-tech. And, it's a good thing. These people won't need their student loans forgiven.",
        "good": "19",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "goldspecie208",
        "time": "7 September, 2022",
        "context": "Retired engineers, or at least engineers with 10 or more years of experience should be teaching high school math, physics, and chemistry courses.  Many students become frustrated with these courses because they don't see how what they learned is applied.",
        "good": "15",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rgr434",
        "time": "7 September, 2022",
        "context": "No everyone is better off going to college the biggest successful world individual found their calling while a college and they didn’t finish collage this type of school gives the opportunity to find out your calling your pasión your grove in life ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Sleepyjoe312",
        "time": "7 September, 2022",
        "context": "If you don’t waste tens of thousands of dollars on a piece of paper you’re a failure. At least that’s American culture today. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "goldspecie208",
        "time": "7 September, 2022",
        "context": "Tool and die makers is an excellent vocation.  They were so highly regarded and needed during WW2 that they were not allowed to participate in combat.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jervan7979",
        "time": "7 September, 2022",
        "context": "Technical education is where it's at...it's not in college....Them smart kids forget you can learn and know anything online..but to actually put your hands into the real world..you wont have much success without your feet in the real world also. Go for it. Save your money & TIME",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "notwiternofarcebook",
        "time": "7 September, 2022",
        "context": "not really need though,most of these have been available for years now",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "djkx420",
        "time": "7 September, 2022",
        "context": "finally a good headline",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cysflorida",
        "time": "7 September, 2022",
        "context": "here in pinellas county florida they have been doing this since the 70's  the libbies came in in the late 80's and early 90's to shut it down and for years was dead.  when i was at northeast high school they had a massive program  construction related including AC masonry electical etc.  and a auto mechanics that had a 10 bay garage.  you could get your car worked on for a small fee plus the parts.  all of the school grounds maintenance was done under contractor supervision. i know some students looked down on them but there were 100's of kids who were never going to make it at college getting serious hands on training and basic high school diplomas.  they shifted some of the schools to satelite programs and one of the high schools had a massive computer lab that kids all over the county could apply to,  cant remember them all.    then libbies tried shutting them all and forcing everyone back to the college only track.  which only creates more failure in my opinion.  drove by that old high school a while ago and notice they have a huge culinariy building out front.   dont know if the other stuff is still there out back but these were successful programs that kept graduation numbers high and produced numbers of skilled labor.   the clinton era department of education did serious damage to these programs.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "UltraMagaMike",
        "time": "7 September, 2022",
        "context": "why would they need college and the debt if they get Tech skills",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "lastfloridian",
        "time": "7 September, 2022",
        "context": "Question; Since many college loans were \"forgiven,\" if I get a loan to go to a prestigious\ncollege, do I have to pay it back? It seems only fair that I should not have to. therefore,\nI am going to apply for a loan big enough to purchase my first house, along with my\ncollege tuition.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Enlightened1378",
        "time": "7 September, 2022",
        "context": "My years in college to become a CPA would have been cheaper and quicker with a hands on program instead. When i graduated college I knew theory but not application. I had to take a specialized course to study for the cpa exam and once hired again I only knew theory and had to be taught the application !!  I support specialized programs - absolutely. ",
        "good": "16",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "blep01",
        "time": "7 September, 2022",
        "context": "U can shuv you're dang edumacation rite up you're keister Libby's. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "blep01",
        "time": "7 September, 2022",
        "context": "This part will drive Fox News bigots crazy, \"Female students are interested in automotive training, for example — and there are options for differently abled students as well.\" ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "budsrq1",
        "time": "7 September, 2022",
        "context": "This is not new, It's what we had 45 years ago and was called Vo-Tech. My dad taught HVAC  night class to the adults. My wife teaches 11th grade nursing at the Suncoast Technical College which used to be the Vo-Tech.",
        "good": "18",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "juize",
        "time": "7 September, 2022",
        "context": "Just change the word & replace w/ another to mean the same thing!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tomiron",
        "time": "7 September, 2022",
        "context": "A smart High Schooler would leave the corrupt, rotten school system and get a GED and be done with the stinking schools.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ConservativeView",
        "time": "7 September, 2022",
        "context": "President Trump suggested that HS graduates should have a technical career first so they can have a job to help get them through college , also to have a back up career .\n    But no reason to learn anything while Joe gives forgiveness to college debt.  \n   ",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "medville56",
        "time": "7 September, 2022",
        "context": "Do white kids get to apply?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "johnn707",
        "time": "7 September, 2022",
        "context": "Rid government guarantees from student loans.  Make schools guarantee those loans instead. This will force the schools to hold a vested interest in their graduates' capabilities to pay back those loans.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "beenthere361",
        "time": "7 September, 2022",
        "context": "Vo-Tech!!!!",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jippa",
        "time": "7 September, 2022",
        "context": "This will simply never fly. All the jobs offered here require you to work and our youth refuses to subject themselves to such outdated and barbaric concepts",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "[=0====0=]",
        "time": "7 September, 2022",
        "context": "Isn’t this what Sally Struthers is for?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "MarkTwainWasRight",
        "time": "7 September, 2022",
        "context": "America doesn't need one more college graduate with an expensive, useless degree that we have to forgive..  We need more plumbers and electricians. \n\nThis is a welcome change..",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cjsteel",
        "time": "7 September, 2022",
        "context": "what was old is new again. . work study was great ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "hat.meister",
        "time": "7 September, 2022",
        "context": "When I was in high school the counselors would tell kids with less than exceptional grades to consider the Regional Occupational Program, or ROP. It was a great option that got kids into manufacturing jobs and construction and welding and soldering and all kinds of hands on stuff.\nAs the reds cut funding for educational programs and the dems pushed youth into tech fields and sent labor overseas demand for ROP fell. Manufacturing was done in China and Vietnam, we imported Mexicans for construction, Asians from India flooded our tech markets pushing out Americans.\nMake no mistake: Destroying ROP in favor of overseas markets was no failure. It was a deliberate act perpetrated by Republicans, Democrats, Wall Street, and multinational corporations to profit off of a changing economic landscape at the expense of Americans.\nStop blaming each other. This mess is everyone's fault. Stop worshipping Qrange, Fox, Q, and politicians that are bad for America. Join the union and bargain collectively. Teach your kids how to handle a jigsaw and make them get jobs early. Demand living wages. Buy American.\nLove thy neighbor.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "BluePlane",
        "time": "7 September, 2022",
        "context": "This concept  is really nothing new.  However, removing the perceived stigma if you will is.  America needs skilled carpenters, stone masons, electricians, machine operators, CDL Drivers, utility workers and more to keep the Country moving forward.  Well done.",
        "good": "7",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "johnbravado056",
        "time": "7 September, 2022",
        "context": "When they going to start the live off the government planning. How to survive in a socialist democrat society and get paid for doing nothing ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "factu-al",
        "time": "7 September, 2022",
        "context": "Sounds like some of the programs that were available when I went to high school 50 years ago.  They might have had different names, and some things have changed technologically, but the goals was the same - prepare those who are qualified and want a college education for college.  Prepare those who are not qualified (and yes there are students that are not qualified for a college-education)  or do not want a college education for a different career.  We had horticulture, automotive, beautician, technical electronics, and a host of other non-college bound vocational programs.   It worked.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "RiNOHunter536",
        "time": "7 September, 2022",
        "context": "The college only model is dying.  If you are a parent you are doing you children an unbelievable disservice by not helping them explore CTE.   When was the last time you saw a plumber etc starve?  The answer is never.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "CyanTurtle",
        "time": "7 September, 2022",
        "context": "High school graduation should be in the 10th grade. 11th and 12th grade they should be going to on school campus votechincal school with a second graduation with honors for a certification in something. Why not? I didn't learn how to read until the 3rd grade because this is when it was taught. Today our children are reading in grade K and some before that. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "logika",
        "time": "7 September, 2022",
        "context": "The better way for education. Need more of this.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "PapaRich853",
        "time": "7 September, 2022",
        "context": "How long until this is labeled racist. Lets face it, I didnt see one mention of an aspiring rapper program.",
        "good": "3",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "plate583",
        "time": "7 September, 2022",
        "context": "Not everyone needs to know how to solve an advanced calculus equation.  Sometimes you just really NEED someone to fix that leaking pipe or you NEED the person who is going to connect the wires properly, you know… so the house doesn't burn down. ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "djohnson",
        "time": "7 September, 2022",
        "context": "The problem with education is that they like to keep the Masters, PHD's in a little club, There is a lot of technical personnel who has the COMMON SENSE EDUCATION, to hold a Masters or PHD. Companies and society just don't want to pay up for experience.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "howaboutthem",
        "time": "7 September, 2022",
        "context": "don't forget to pay your own bills",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "who'son1st",
        "time": "7 September, 2022",
        "context": "I graduated from a Vo-Tech high school in 1998. I took 4 years of automotive classes while there. I opened an automotive service and repair business a year later. Now I have 7 employees and make around $300k a year. There's opportunity and value getting a jump on trades if your high school offers classes for them. There's even more opportunities available if your high school offers in depth training similar to technical colleges like mine did. I hire a high school senior every year from the same high school I attended. The kid usually gets $15 per hour and works about 26 hours per week while getting credit towards graduation through the school to work program. Some of the top automotive technicians in the county got their start in my shop. ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "kingcobra",
        "time": "7 September, 2022",
        "context": "We've had them. Nothing new called ROP. Regional Occupational Program.\nIt works!!!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "toxicmoe502",
        "time": "7 September, 2022",
        "context": "Nice job Joey.\nAlso make sure they graduate with no debt.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "disturbanceintheforce",
        "time": "7 September, 2022",
        "context": "Wonder how many of these kids have their hands for the ten grand?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "c.r.m.",
        "time": "7 September, 2022",
        "context": "And are one of those things highschoolers can jump into finding their transgender side???",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "chiefdeputy62",
        "time": "7 September, 2022",
        "context": "I love how liberals invent new names for old stuff. when I started 9th grade we had \"work experience program\" and as long as we carrying a B available and were getting all our credits we could leave and go to work at a paying job. I did that 9th thru 12th. my first job after graduating midterm I made more a year than my former teachers.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "TraitorJoeBiden",
        "time": "7 September, 2022",
        "context": "Then they can pay for Joe Biden's grandkid's college loans",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "nmeast",
        "time": "7 September, 2022",
        "context": "“New program”?  I attended a state certified vocational school, on my high school campus, back in the early 70’s.  The courses were part of my high school curriculum and are listed, right on my report cards. This “idea” is not “new”.  I got my state certification, when I completed the course, and sat for the certification test and passed it. ",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "coalloadingjohnny",
        "time": "7 September, 2022",
        "context": "If you enjoy what you do it’s almost like never working a day in your life. If you don’t like it quit. It beats being miserable every day of your life ",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "steve977",
        "time": "7 September, 2022",
        "context": "When schools dropped tech ed, they kept art and music classes. There is zero reason to teach art in school. It is a useless skill that will only encourage kids down a path of failure in life. Replace art with a 2nd math class",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "GOLDENJET9",
        "time": "7 September, 2022",
        "context": "Wow, someone realized that going to college isn't for everyone......duh......",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bewolff7",
        "time": "7 September, 2022",
        "context": "Where are the American students ?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bigfootakadarryl",
        "time": "7 September, 2022",
        "context": "College is not for everyone, skilled labor is not for everyone.  BOTH offer good careers and we have people suited for both paths.  Better to learn to be a welder and have a career then force yourself to go to college and get a gender identity degree and have NO career and lots of debt.  We need to stop all funding and loans for degrees that will never get you a job.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dontavious",
        "time": "7 September, 2022",
        "context": "So they're doing what every school used to do. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "hobbcee",
        "time": "7 September, 2022",
        "context": "As much as he was loved, JFK came up with this \"everybody gotta go to college\" thing and it stuck.   The \"college\" career path isn't for everyone.   Someone has to dig the ditch.  Public education systems that recognize this are ahead of the game.  How 'bout we teach them all to READ first!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "laura1956",
        "time": "7 September, 2022",
        "context": "My grandson attends a vo-tech school as a junior in the welding/fabrication career.  He is LOVING school - the first time he's been able to say this in a very long time.  The school takes a hands-on approach to education and it fits him well.  We are thrilled for him!!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "growapair",
        "time": "7 September, 2022",
        "context": "Hope for the MAGA offspring. Even you can get a job, maybe.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "justaprophet",
        "time": "7 September, 2022",
        "context": "It's nice to see that schools are actually focusing on students for a change and how to help them be successful as opposed to Union indoctrination and cultural shaming.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "more2x4",
        "time": "7 September, 2022",
        "context": "I started in a \"Work Experience\" program in Jr. high. Today I'm retired after a successful career in upper management guiding over 1500 employees and grossing over $500,000,000 per year in profits. By the way, I also fix my own toilets if broken. Support Mike Rowe and his foundation, we can't live without blue collar workers!",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "boydjonesiii",
        "time": "7 September, 2022",
        "context": "Too little in terms of construction, for every 5 workers leaving the industry only 3 are entering. The lack of workforce at least in the Midwest (Chicago, MSP, & Des Moines) and southwest (phoenix) is scary and the actual new hires do not last long. Plus it’s still the leading career for suicides.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "FreedomRulz792",
        "time": "7 September, 2022",
        "context": "Go get a skill and then when you have invested your whole life into something the government will come along and say give me your money, and close your business all in the name of public health for a fake virus !!!",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "T-rant-ula",
        "time": "7 September, 2022",
        "context": "Mike Rowe has been the leading advocate for this.  The student debt crisis exists largely because of large institutions who perpetuate the myth that college is for everyone.  Nearing retirement, I can say with a straight face that I have had a pretty good life despite no pedigreed piece of paper.  Mentors good and bad, lessons learned along the way.  If I could encapsulate it to pass along I would share it without reservation.",
        "good": "36",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mrhearsay",
        "time": "7 September, 2022",
        "context": "High schools need to require a civics class and a personal economics class by graduation. One does not need a graduate degree to have a successful life. That is one thing the colleges does not want a person to know.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Jim_Bridger",
        "time": "7 September, 2022",
        "context": "We have the same approach and programs instituted in western Michigan.  Our local high-school has two sections: those who choose college and those who choose vocational tech.  My son took advantage of both curriculum paths before he went to university for his engineering degree.  My daughter, though changed her major, took advantage of the medical/nursing path.  Truely a Win-Win program.  ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mtwallet526",
        "time": "7 September, 2022",
        "context": "Making darned good livings without the debt. Self sufficient. Motivated. Awake,not woke.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "laughingoutloud",
        "time": "7 September, 2022",
        "context": "I have a college degree and a career.  My husband is a construction sub-contractor.  He makes four times the money I make.  End of story.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "2Afreedom258",
        "time": "7 September, 2022",
        "context": "My Son was in school. Chased an opportunity to work on internet cable/splicing. 5 years now. Now a supervisor making 45 bucks an hour and all the hours he wants to work. Just bought a new house and asked for nothing. 26 years old and killing it. Did it all on his own. Gives me hope. ",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "FlyEagle515",
        "time": "7 September, 2022",
        "context": "For thousands of years, children learned a trade, usually from their father or other family member, in order to be productive adults. Then, the lie of college as being the linchpin of success was sold to three generations post-WWII. Now, the idea of trade skills has returned. Solomon said there is nothing new under the sun.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sea_biscuit",
        "time": "7 September, 2022",
        "context": "First in the region? I am guessing just in Tn? We've been pushing this for years, through CTAE and working with the Department of Labor to allow students to work in their chosen pathways. A large amount of students are graduating before the age of 18, so it creates challenges but the DoL was able to answer our questions and even give relevant guidance. \nIt's a great program and those kids are going to run the world one day.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "noneyer",
        "time": "7 September, 2022",
        "context": "High school students can tell you all about the inside of a computer but cannot do basic math in their heads.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "hammer888",
        "time": "7 September, 2022",
        "context": "The real shot at success for these students is if we get rid of liberal teachers and their unions…",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "realist67",
        "time": "7 September, 2022",
        "context": "Voc-Tech schools began as apprenticeships back in the beginning when students were sent by their parents to a Master of a trade to learn that trade, if the parents didn't already have a trade for them to learn like farming. In more recent times when a formal school education was mandated by governments this method of training fell by the wayside and eventually voc-tech schools came into existence to fill the gap. They varied by  community along with the courses offered based on the needs of the community. A Voc-Tech education is a great way to learn a trade and get ahead.  Today both Voc-Tech and traditional high-schools offer college level AP courses that give college credit and students can skip many of the \"101\" level courses. Though like myself I went to college after 20+ years in the computer industry and enjoyed the review of basic stuff I knew and helped my GPA with an easy A in the class along with the ability to devote time to helping my generally younger classmates. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "adkdad",
        "time": "7 September, 2022",
        "context": "Just imagine if colleges and universities focused on what they could do to lower tuition! ",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "LETSGOBRANDON....!!!!!",
        "time": "7 September, 2022",
        "context": "Much more preferred that mutilations and drag parties! Seems learning a job skill to build America IS important ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "whowuddathunk",
        "time": "7 September, 2022",
        "context": "YES high-schoolers, hurry up and get your good-paying, technical skilled jobs so you can start paying back my kids college loans for the degrees they recieved in music and history.  They don't make much and now they have 2 new cars and a great big house to pay for.  Thanks for being so thoughtful for getting good paying jobs so you can subsidize my kids lifestyle as well as yours!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "SmokeySmokerson",
        "time": "7 September, 2022",
        "context": "Local company has taken this one step further, they work with kids that have dropped out of high school.  They give them a menial job, work with them to get their GED, send them through trade school, and have a job in their trade field waiting for them when they graduate.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "CassC",
        "time": "7 September, 2022",
        "context": "Put Mike Rowe in charge of Education or Labor and the problems will disappear.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dizmayed",
        "time": "7 September, 2022",
        "context": "I took \"shop\" classes during Jr High school & High school, I've been making six figures for years, I make more than my Managers and the company Engineers without the student debt and without the stress! \nI've literally have taught management how to read a blueprints, Their job depends on my making them look good! 🤣",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "kilroy772",
        "time": "7 September, 2022",
        "context": "Learning to Do\nDoing to Learn\nEarning to Live \nLiving to Serve   \n FFA Motto sums up the basic premise of technical training and still true after all these years.\nThanks for the article",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "imsmarterthanyou873",
        "time": "7 September, 2022",
        "context": "The teacher's union and the democrat party will want to put an end to that. ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "pez149",
        "time": "7 September, 2022",
        "context": "Why are people acting like this is something new?\nVo-Tech high schools have been available to students for over 50 years...\nLet's give credit where credit is due...",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "biglycovfefe666",
        "time": "7 September, 2022",
        "context": "When the child of a Trump supporting family turns 18 they basically are left with three choices:\nHomelessness, prison, or the military",
        "good": "0",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "frankw1",
        "time": "7 September, 2022",
        "context": "With colleges and universities pricing themselves out of the middle class market, this is definitely the wave of the future.  While there will always be a need for college degrees in STEM fields, little outside of that realm is worth the cost without substantial scholarship money. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "winnersnotwhiners",
        "time": "7 September, 2022",
        "context": "EXCELLENT!  ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "red-flag-all-libtards",
        "time": "7 September, 2022",
        "context": "What about a degree in pronoun creation. I hear that's pretty hot among the young and senseless crowd. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "robal",
        "time": "7 September, 2022",
        "context": "Our learning disabled son did a 10-week work session at a hospital in the kitchen during his senior year in special ed. They hired him upon graduation and over 21 years later he’s still working there",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "boydjonesiii",
        "time": "7 September, 2022",
        "context": "I don’t think a lot of people understand the requirement college has become in the past decade. 35% of all job openings now require a bachelors degree, that percentage was 16% in 1973. 75% of all new jobs now require a bachelors degree which is has increased 33% over the past two decades. The unemployment rate for those with bachelors degrees is half that compared to those with no degree. The whole landscape has changed compared to when majority of y’all were growing up",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mug7219",
        "time": "7 September, 2022",
        "context": "It's good to see some kids wanting to do something besides be the next influencer, gamer or slacker",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "booley13",
        "time": "7 September, 2022",
        "context": "Take it a step further and allow low level inmates to build low income housing.  The inmates work and learn in a construction trade which can help them from going back to crime and a worthy homeless person may get a fresh start too.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sirbuck707",
        "time": "7 September, 2022",
        "context": "New?  There is a vocational trade school in every county (88 of them) in the state of Ohio that was built in the late 60s.  I know because I graduated from one in 1973.  There is a partnership with local employers to ensure that the trades being taught are filling the pipeline of what the employers need to run their businesses.  We attended our local high school for grades 9+10, then for our junior and senior years, we left our local high school and attended the vocational school to learn our trades.  It was rare for a vocational school grad to not become employed in their respective trade upon graduation.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "displayname69076",
        "time": "7 September, 2022",
        "context": "Onlyfans is how the youth is getting ahead after highschool. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "boompa2",
        "time": "7 September, 2022",
        "context": "I bet they don't offer a degree in Middle Eastern Basket Weaving. You have to go to a worthless 4 year and spend 150 grand for that one!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "lukendixie",
        "time": "7 September, 2022",
        "context": "Sounds like a better wayvto go than most of the college educations nowadays and without the stifling debt.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "opticalillusion",
        "time": "7 September, 2022",
        "context": "And yet Biden wants them to pay for the college loans of others. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Nanrob",
        "time": "7 September, 2022",
        "context": "A step back in time in the 60’s my city had technical schools for boys and girls where they learned trades and were ready to work right out of high school.   College is not for all, and honestly the cost is not a value ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "md1983",
        "time": "7 September, 2022",
        "context": "These kids can go on to get good paying jobs and pay off the student loans of their liberal classmates. ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ptatim",
        "time": "7 September, 2022",
        "context": "Want to raise your standard of living ten-fold?  Get big Government warmongers, globalists, regulators and busybodies out of your government.  Make them go out and do useful work instead of living off the people like parasites.  Start by shutting down the IRS and defunding 2/3rds Washington  ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "frank-rizzo981982",
        "time": "7 September, 2022",
        "context": "The bottom line, they don't have SQUAT without knowing  READING ,WRITING and ARITHMETIC !!!!!!!!!!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Disenchanted524",
        "time": "7 September, 2022",
        "context": "Our district has been doing this for years... mostly republicans on the board.  Kids can graduate as a veterinarian tech, pharmacy tech, attain a real estate license.  They have many options than they did even 6 years ago.   In middle school if they take advanced classes it counts as high school credit and advanced high school credits count towards college hours.  As a high school freshman our daughter is in advanced geometry and biology which are subjects sophomores are usually enrolled in taking.   It’s about time other states are following Texas and actually teaching jobs skills while in high school ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Fhugh484",
        "time": "7 September, 2022",
        "context": "Someone is making cover for public schools. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "nodemsallowed",
        "time": "7 September, 2022",
        "context": "Much more useful than CRT and gender studies, which prepare you only to be a victim.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "smh@loserlibs",
        "time": "7 September, 2022",
        "context": "Nothing new. Been around for decades. VoTech vocational technical schools are made for high school students. ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "superdelegate",
        "time": "7 September, 2022",
        "context": "This same idea could be used with our prison system to lower recidivism.  If they are set up to succeed, they will be less likely to return to crime.  Instead of shortening sentences, use the extra time to train them, and give them a fresh start. ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "divisifiedfarm",
        "time": "7 September, 2022",
        "context": "This is a diversion from proper education. The goal of school is to give the student basic skills in math, English. science, history, geography, etc. The student's greatest benefit comes from apprenticeship skills and technical know how from those who develop and use it every day. This new mistake will only drain the taxpayer and provide lesser skills and innovation. No more play time from mature students. Equity and CRT in productive work is a loser from the get go. ",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "darmonx",
        "time": "7 September, 2022",
        "context": "It baffles me how Google, Microsoft, Meta, and Amazon fight to keep bringing in H1B Visas from China and India mostly six figure incomes, when there is a slew of high school kids already in this country dying to develop themselves into becoming a tech talent.  Good job on those involved in getting projects like these going.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "food4thought369",
        "time": "7 September, 2022",
        "context": "I went to HS in the mid 70s. We had these programs at that time. Did the federal education geniuses get rid of it? ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sandbagger2u",
        "time": "7 September, 2022",
        "context": "Good idea. Long time coming. No political agendas or doomed to failure.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cwal701",
        "time": "7 September, 2022",
        "context": "Still trying to control the job market by using certificates of clout.  Experience matters, you don't need a piece of paper on the wall for a good paying job or to be successful.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tbanner",
        "time": "7 September, 2022",
        "context": "Such a nice endorsement of taxpayer funded PUBLIC education by Fox.  Refreshing. ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "DoRealWork",
        "time": "7 September, 2022",
        "context": "Preparing Real Workers ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dhm51",
        "time": "7 September, 2022",
        "context": "The son of a friend of mine wanted to be geologist, that was his dream. Our high school offered several trade classes incuding welding, which he took. when he graduated with scholastic honors he also had certifications in two different types of welding. He went to college, became a geologist and never had a penny of debt - his welding skills paid for it.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "susieb340",
        "time": "7 September, 2022",
        "context": "The people interviewed act like tech programs in high school are some great new discovery. When I was in school, one could earn a technical diploma by going that route. As a veteran teacher, I have seen first hand how hundreds of kids have struggled and/or dropped out because the powers above decided one day that everybody needed to be college ready and tech programs were no longer important. Teachers for years have been trying to tell these people that schools need a healthy balance of both. I would like to say this article cheers me, but knowing about all the kids that lost chances over the last several years makes it more bitter than sweet. ",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "DRLA",
        "time": "7 September, 2022",
        "context": "Dems spearheaded the removal of vo-tech in the 80s sayng it pigeonholed kids that should go to college. Those who got good vo-tech training got great jobs and many are already retired. Good luck getting a good repairman now. $$$$$",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "what'sthenextliberalhoax?",
        "time": "7 September, 2022",
        "context": "But I just took a third job to fund their Pell grants. ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "HaroldBaker",
        "time": "7 September, 2022",
        "context": "In public schools in Lancaster Pennsylvania they have litter boxes for the fur kids and the let boys into the girls bathroom and locker room so tell me what’s that teaching them ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "iloveamerica🇺🇸",
        "time": "7 September, 2022",
        "context": "This is what needs to be taught in school. You making students take calculus, French, biology to graduate. Now if you want to be a doctor, a language translator, a math professor take the classes. But if you know, and just want to join the average work force, these subjects should not be forced upon a student. I took calculus and retired from the work force of over 38 years, I have never had to use no more than adding and subtracting, and I never spoke a day of Spanish to anyone during those 38 years, and now. But I was forced to take those classes!!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "gun-rights-texan",
        "time": "7 September, 2022",
        "context": "Any program that allows kids not to enter the indoctrination centers called universities is a good thing.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "SusanK",
        "time": "7 September, 2022",
        "context": "I had a life long career from Vocational school training,  and not 1 dollar in school loans,  it's where the money is at",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Pinball-Wizard",
        "time": "7 September, 2022",
        "context": "Vocational training is great, it helped me get a job in engineering by age 24, no college tuition ever and was making a lot more money than a lot of people with a college degree, and some companies will pay for your college tuition if you promise / I guess sign a contact? that you will work for them at least X many years before you go to a different company, some places will do that and later you can take more training and keep moving up to where you want to be or the best job that you qualify for, get your foot in the door first and give it your best shot.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mantlebuck413",
        "time": "7 September, 2022",
        "context": "Kind of what high schools were supposed to be doing for decades. CTE works CRT hurts kids. Schools have been wasting our kids lives on CRT and not getting them ready for jobs.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "threedogs",
        "time": "7 September, 2022",
        "context": "It is only when college became “the only way” that this country began to lose its way. \nMuch like cattle, the left steered the public toward their concentration camps of Marxist theory, and these free-market-hating, money-demonizing leftists had a clear path to creating little bots while pocketing a lot of that green stuff they hate so much.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mtn69man",
        "time": "7 September, 2022",
        "context": "This is what I have been advocating for the last 5 decades.   Not everyone is \"wired\" for a college degree.   A lot of people are more naturally attuned to working with their hands in the construction, automotive and aircraft repair, manufacturing, agricultural, and many other fields.   People who would fair much better in a trade school setting than in a Political Science or Women's Studies class.   And even IF the world is ever successful at getting everything switched over to \"renewables\", there will still be a need for those kinds of jobs.   Putting a battery in a car will not negate the need for a mechanic to service or replace the moving parts of that vehicle.   Unless we find a way to do away with all residential and business climate control or to keep our meat and vegetables fresh we'll always need refrigeration and heating/cooling techs.   There will always be a need for Plumbers, Carpenters, Bricklayers, etc.\n\nGoing back to offering good \"Vo-Tech\" classes with summer apprenticeships in high school and post-high school would allow many to find their niche, before spending gazillions on a college degree that in many cases is worthless, and leads many into careers that are not really fulfilling for them.\n\nWe need to help people find jobs in which, at the end of the day, they can say, like me, \"I found a job that I enjoy so much that I have never \"worked\" a day in my life.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "fedupwiththenews",
        "time": "7 September, 2022",
        "context": "I would agree with offering free CTE for college grads who can’t pay their loans. They can learn a trade and pay off their own loans. WIN -WIN.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rider54",
        "time": "7 September, 2022",
        "context": "Keep the federal government out of these programs so they stay on track for success ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tbanner",
        "time": "7 September, 2022",
        "context": "In the early 80s we still had Vo-Tech and I remember about 1/4 of my Junior and Senior HS Class would leave early each day to go to another campus for training in various trades.  That is the way to do it for kids who aren't college material -- 2 full years of foundation in HS with everyone else, then split the final 2 years keeping them in regular school for core subjects English, Math and Science and then Vocational for the remainder in the trades.  Sadly, a lot of these programs were cut in the Reagan years. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jinglehimerschmidt",
        "time": "7 September, 2022",
        "context": "Good. The trades are the backbone of the country. I hope they target the ones smart enough not to buy into all the woke nonsense the public schools are pushing.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "robertfalls57",
        "time": "7 September, 2022",
        "context": "I am a graduate of Penta County Vocational High School. I earned a regular high school diploma from my own high school and also a 2 year Volcational High School diploma from a joint five county vocational high school.  My choice was Industrial Electronics, which I love.  I have made a good living since I graduated in 1975.   I am currently retired, but would recomend vocational high school for anyone that wants a good paying job.  I topped out making in excess of a $120K without a college degree.  It can be done without paying for it, but only working for it.  I was able to retire at 59 and still able to enjoy life. ",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "conservativenation",
        "time": "7 September, 2022",
        "context": "No. None of this until we can start graduating kids with a basic knowledge of the essentials first. The schools in this country are a disaster. Adding extra to a proven, broken system is not the correct direction. ",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "missouririchard",
        "time": "7 September, 2022",
        "context": "Nothing teaches near as well as on hands experience doing the actual job. All of the science classes in school, made far less impression on me, than actual scientific events that happened right in front of me. Seeing puppies and kittens born is one thing, but at 18 in High School I had to help pull a dead calf from a Dairy cow, to save the cow. We found a dead bird, and curious, carefully dissected it and took it to school for show and tell in 4th grade in Formaldehyde, and nearly was expelled from grade school.  I have built a lake from scratch, from working with the equipment operators, to soil and conservation experts, and fishery people to create a stable fish popoulation. I am not a degreed scientist, just someone very curious about a vast number of things. My son is the scientist and doctor, I guess I rubbed off on him. The more exposure to more and different things that you try, the greater the chance of finding something you really enjoy doing, and not one for just the money, for when the glitter of the gold wears off, the job then becomes just a chore.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "a1007",
        "time": "7 September, 2022",
        "context": "A fabulous approach to our current society ..my son says as a college graduate ,he would have been happier and just as gainfully employed if hed had a technical education",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ferr3312",
        "time": "7 September, 2022",
        "context": "I have been teaching CTE certification classes for the last decade. It’s a great program where I work and getting better every year. Great things are happening in schools despite that blowhole Randi Weingarten. ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "what'sthenextliberalhoax?",
        "time": "7 September, 2022",
        "context": "The ONLY degrees that should be placed on the burden of taxpayers are the essential jobs needed to serve those taxpayers. \n-nurse and doctor \n-social work, psych, mental health\n-child care and education",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "kaytmay544",
        "time": "7 September, 2022",
        "context": "Absolutely  best news to give trade skills to schools. Colleges are hugely overrated  and the education that is its results are egregiously over priced!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "povet019",
        "time": "7 September, 2022",
        "context": "Not every kid needs to go to college and rack up student debt!  Every kid preparing for adulthood needs a career they can build upon….CTE is the way to go!  Colleges have turned into Woke establishments and I wouldn’t recommend any of my kids going unless, in writing they could prove they are not indulging into Marxist idiology…even then, I’d be hesitant!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "PR001",
        "time": "7 September, 2022",
        "context": "I have a college education and I think these programs are amazing. Even in my field, the majority of what I do i learn it \"in the field\". ",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "45twice",
        "time": "7 September, 2022",
        "context": "Biden Energy Sec. Says California is “In the Lead” on Energy…. Meanwhile Governor Newsom is Begging People to Not Use Appliances to Avoid Blackouts. Laila",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "notaconjustamerican",
        "time": "7 September, 2022",
        "context": "This isn't new FoxNews. My highschool was doing this 15 or more years ago. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cyman528",
        "time": "7 September, 2022",
        "context": "Every high-school and Community College in the United States should include these types of courses. We already pay for these facilities and educators. Let's ensure the majority of our children have a bright future with excellent skill sets and well paying jobs. 😎",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "what'sthenextliberalhoax?",
        "time": "7 September, 2022",
        "context": "In NY we had BOCES. But since the push to send high dollars in support of BigU and non employable grads, not much availability at Boces anymore. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mikey707",
        "time": "7 September, 2022",
        "context": "SCROC, Southern California Regional Occupational Center was a very good start for me. \nStarted Summer between 10 and 11th grade, took Architectural drafting, and aircraft mechanics classes at Northrop University. After a few jobs, ended up at Northrop, retired at 56 and living the good life,....... Mike Rowe is correct; American's can pull themselves up by their bootstraps. ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "45twice",
        "time": "7 September, 2022",
        "context": "Knowing the difference between a Rembrandt and a Van Gogh doesn't help you earn a living.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "noneyabusiness055",
        "time": "7 September, 2022",
        "context": "These kids should actually be entering vocational by 10th grade.  In the 12th they can do an internship for their diplomas instead of taking useless classes like piano, choir, art,  ALGEBRA, etc.\nInstead teach them real world skills. ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "chazatl",
        "time": "7 September, 2022",
        "context": "This is it exactly. My friend in HS while everyone else went to college and spent 100k he spent about 1000 bucks to learn hvac and now runs his own business earning more than most of those people. \nIt’s hard work but he didn’t need a college education. College is not for everyone. ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "divisifiedfarm",
        "time": "7 September, 2022",
        "context": "A lose lose. The State Schools continue their destruction of Post America.  People can't read and do math now. Next they'll learn how to do an illiterate, substandard job at work. What a joke. ",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "joetheplumber423",
        "time": "7 September, 2022",
        "context": "These programs have been around for 60 years. The only difference is now colleges are seeing the money in it, so they are wanting to stick their noses in this for profit. ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Cindyzzz",
        "time": "7 September, 2022",
        "context": "That should be available to all high school students. In our area, the kids take AP classes and earn college credits. My son started college with over a semester worth of college credits and all the basics out of the way. They also offered paid internship opportunities for some of the students with a local computer company. My sons worked there and made money in his senior year. They will hire him f/t after college too. This is all good stuff for the high school kids.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "denofrage165",
        "time": "7 September, 2022",
        "context": "This Year my kids started at a New Vocational Charter school.  The Pilot School has been going strong down south and they finally built one near my home town.  This is what we have needed for Years. The Middle school students do multiple 6 week modules where all classes are focused on a certain career field. The 1st module has been Medical. So the Math, English and Science lessons have a medical theme to them. In six weeks the should be able to take vitals and be fully CPR trained.  Then they move on to another field such as Culinary Arts.  By the end of Middle school they should have a good overview of every trade and as high schoolers they can focus on one and move forward with training. So when they graduate they can move into the Workforce. Or choose to continue into college.  Working in the Cabinet industry myself. The need to train up the next generation is imperative.  Schools like these are so important in giving our kids a Chance to make a better lives for themselves and allow them to be proud of what they do for a living.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "psyop37a",
        "time": "7 September, 2022",
        "context": "I’ll do Defense Against the Dark Arts, Herbology, and Potions",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Highway661",
        "time": "7 September, 2022",
        "context": "The guy on the right of the thumbnail must've been held back a few times....",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jakelakota",
        "time": "7 September, 2022",
        "context": "Right so they can get out there and work and pay for the liberals who refuse to pay their college debt.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "nchomeboy",
        "time": "7 September, 2022",
        "context": "While this is great and there needs to be more of it, it is nothing new.  Back in the 60's when I was in high school these type programs were already in place, and had been for several years.  Kids who either didn't want to go to college or who couldn't were able to go to school in the morning and then leave to go work in a field of interest.  The businesses loved it because many of these kids would go to work fulltime with these companies when they graduated and during the summers.  The kids got paid a fair wage while in school and had jobs waiting when the graduated.  I know many who eventually started their own businesses.  Knowing how to do something that other people will pay you to do for them is one of the surest ways of making a good living and working as much as you want at something you enjoy doing.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bruinsfan4ever",
        "time": "7 September, 2022",
        "context": "Education and innovation are leading indicators of a society's rise or fall. We need LOTS more like this guy.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cacctus",
        "time": "7 September, 2022",
        "context": "Our daughter is a school Administrator and is in charge of the CTE program in her district here in Texas. I am so glad to see that schools are finally realizing that not all kids are meant for college. There are many trades that provide solid careers and good salaries…many that are well into six figures. ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "civilwar2020",
        "time": "7 September, 2022",
        "context": "This is nothing new. Programs like this have existed for decades, in some form or another. What is new, is the current generation has no interest in working and making it in their own. Public schools are instilling into the minds of young people the government is going to take care of them and rich people will pay for it. All they have to do in life is be nice, pay homage to minorities and vote democrat and a life of luxury awaits them. ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "what'sthenextliberalhoax?",
        "time": "7 September, 2022",
        "context": "University is 3k in Europe. 20k in the US. \n\nThe fleecing of Americans. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "LAMConstitutionalist",
        "time": "7 September, 2022",
        "context": "Excellent!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bobg.628",
        "time": "7 September, 2022",
        "context": "Three of my high school buddies got college degrees, one ended up driving a truck and ran a metal recycling business, one became a tool and die maker and tow truck owner operator, and the other one was a draftsman. ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "azjeff21",
        "time": "7 September, 2022",
        "context": "I went into a trade/apprenticeship program with the Refrigeration/Pipe-fitters union for the five year program after working all day. When I left I was making over $85K a year with overtime. It allowed me to retire at 55 from that industry and now I own a real estate home inspection firm with 3 employees. I have ZERO STUDENT DEBT!!!!! Is it for everyone?? No it’s not because you have to want to work and provide for your family. My stepsons school has a similar program and he is in the Veterinarian sciences program. I’m so proud he chose this path instead of gender studies lmao. Talk with your kids college isn’t for everyone and if you take a degree program that has no useable skills don’t expect hard working people to pay it. ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Anony_Mouse",
        "time": "7 September, 2022",
        "context": "My Shipyard partnered with a local Vo-Tech to have them teach their welding students what we require for Submarine overhaul. It's been a great benefit for both of us. We get kids that already know how to weld (to our standards) & they get a great career. ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Intel1",
        "time": "7 September, 2022",
        "context": "This has been in effect for the last 40 years.  This is nothing new.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Cindyzzz",
        "time": "7 September, 2022",
        "context": "In high school, students need to take the college route w AP classes or go to Vo tech to learn a trade for free or sign up for the military and parents need to be proactive in guiding their kids to make a decision their first or second year of high school- so important! ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "southernly",
        "time": "7 September, 2022",
        "context": "High schoolers have always had a shot. There are tons of high paying skill based jobs that don't require a piece of paper telling everyone that you spent loads on an education. ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "oldsalt68",
        "time": "7 September, 2022",
        "context": "I remember the days when I had to compete for a trade job. Now  days it's hard to fill skilled trade positions. Most companies are paying extremely well for a skilled worker.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "HotLava",
        "time": "7 September, 2022",
        "context": "This along with basic economics gives kids a good chance",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Dolphins22",
        "time": "7 September, 2022",
        "context": "I believe that more than 50% of the students today would benefit more from Votec than these colleges that indoctrinate and don’t teach!  ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ronzabonz",
        "time": "7 September, 2022",
        "context": "The most impactful lesson I learned in all the years of public schools happened my senior year when an economics 101 teacher started the class by going over how to read the stock section of the Wall St Journal. Each student picked a dozen stocks with an imaginary sum of money and tracked the performance all year. What an eye opener that was and proved to me that investing in the future of the country and the world is a sure way to grow your money.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "NotCornPop",
        "time": "7 September, 2022",
        "context": "Before the government and teachers unions ruined our educational system, children were encouraged to choose a career path of their liking.  Things like shop class, home economics, career prep etc.  Not everyone wanted to go to college. Eventually the liberals decided that everyone should go to expensive colleges to be indoctrinated into becoming woke liberal democrats. That also created a real shortage of middle class, hard working, skilled professionals and a labor shortage. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "what'sthenextliberalhoax?",
        "time": "7 September, 2022",
        "context": "Taxpayers fund BigU 10s of thousands per student, so that BigU can fund their multi million dollar sports complexes, pay coaches multi million dollar salaries, and pay 10s to 100s of thousands for political speakers. \n\nThe fleecing of Americans.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "yelnats",
        "time": "7 September, 2022",
        "context": "My parents forced me to go the college prep route in H.S..  After H.S. they realized I was not college material so I was enrolled in Lincoln Technical Institute to learn the HVAC trade.  I plied the trade for a couple of years before receiving a letter from then president lbj. While in the Army I learned to be a cook which served  me well in subsequent years in food service management as well as large family gatherings.  I used the G.I. bill to obtain a B.A. in business and in later years I paid for my M.B.A.   I’ve been self employed for the last 40 + years, first as the owner of a trucking company then as a residential remodeling contractor.  My combined vocational, military and college education experiences have  given me and my family a decent life.  The point is vocational training and/or college can both provide a decent life style.  ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "what'sthenextliberalhoax?",
        "time": "7 September, 2022",
        "context": "When government gets a hospital bill, they go through it and cross off what they feel you did not need. They pay about 20 cents on the dollar. \n\nBigU sends their bill to the government, and they say yes master here is every penny you demand. ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jwave062",
        "time": "7 September, 2022",
        "context": "Wait, you mean a gender studies degree doesn't ensure a good paying job?",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "RJR57",
        "time": "7 September, 2022",
        "context": "This was standard teaching in the 70s. BEFORE you graduate 8th grade!",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "123redlight379",
        "time": "7 September, 2022",
        "context": "It’s not new, we did it in the 70’s and it worked. Probably why the extreme leftist liberal Democrat wanted it stopped .",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "demsworstnightmare571",
        "time": "7 September, 2022",
        "context": "Too many kids come into the industrial work force today without the basic skills that it requires. I've seen so many college students come in as temp workers during the summer and quit because they can't read a tape measure. They also look down on manual labor as if it's for peasants. That's a big part of the problem. ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "thenakedemperor",
        "time": "7 September, 2022",
        "context": "This is good for those who know what they want to do, but these programs start as early as early as 8th grade and some kids feel pressured to pick something and are funneled into a program for which they might change their mind in a couple of years. \nSchools do need to incorporate more exposure to real world jobs in their curriculum. Kids graduate and have no idea what different careers involve. ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "woozerdog",
        "time": "7 September, 2022",
        "context": "College is overrated,  the trades are underrated.   Both can pay just as much, with a smaller cost for training in the trades.  ",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "texas4ever",
        "time": "7 September, 2022",
        "context": "As a cte teacher it all depends on the director. Our budget is getting cut because she wants to look good. But it hurts the students. ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "noneyer",
        "time": "7 September, 2022",
        "context": "Aurther C Clarke the si fi writer retired to Siri Lanka.  He designed their education system.  Everyone who graduates high school can make simple drawings do simple carpentry, plumbing and electircal.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "redav143",
        "time": "7 September, 2022",
        "context": "We need apprenticeships to replace college. \nTake 5 yr to learn on the job everything you need, instead of paying to learn what won’t be of use. \nKids won’t have student loan debt. They will have the practical advantage.\nCompanies get better workers in the long run at lower cost.\nIf you are a part of HR or hiring decisions, insist on skipping the 3rd party hiring agencies and universities. Go to local high schools and offer paid on-the-job training. Look for the best work ethics, not the flashiest test scores. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ABC12",
        "time": "7 September, 2022",
        "context": "Jobs are just like anything else, demand for a given job and supply for it.  ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "gigiof11",
        "time": "7 September, 2022",
        "context": "Votec really works, but it must be  in backed by School boards and the programs aren't  cheap. 2 of my grandchildren are the products of a Votec education, one finished her high school with not only her CNA, but also an LPN.  The 4 year high school program was worth it.  Our grandson wanted to be an electrician so his years in high school Votec were in cooperation with the Electrical  Workers Union and our local school system. When he graduated he was within a few months of becoming a full-time   journeyman...so yes I am 100% for any votec program, all trade unions should get on board as well as state and local school boards",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ddt305",
        "time": "7 September, 2022",
        "context": "Sounds good until they let the need for diversity outweigh the need of the students.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "iddybiddy2",
        "time": "7 September, 2022",
        "context": "You can get a student loan from the Federal Government to fund that Technical School.  And many do.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "wisconsinconservative751",
        "time": "7 September, 2022",
        "context": "The great college sham, a useless option for many. Unless you have a clear path for what college will teach you, i.e. Engineer, Med school, avoid the expensive waste land.  Take a look at life and decide what you want to be doing for the rest of your life.  We don't need college educated baristas. \nWe do need Plumbers, construction work, CNC operators, nursing assistants, junior accountants etc.  All which pay well without being in debt.  ",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "justmorecrap",
        "time": "7 September, 2022",
        "context": "It's about time that some schools start going back to this concept. I don't care if you call it votech, cte, or what, kids aren't all headed for college after they graduate high school. They have got to have some way to make a living besides flipping hamburgers. Having programs that put a young person in the position of being able to go straight out after high school and at least earn a basic living while they learn a career is Paramount to projecting success. We had a multitude of different vocational paths at both my middle school and high school. Everything from printing, yes I'm that old, to automotive, to agriculture, to air conditioning, etc. Now with so much health and IT career opportunities, I'm sure you could add in a whole host of training curriculums related to those as well. I have a friend at work whose son graduated about 10 years ago, with his basic HVAC certification and a two-year degree from taking the college level courses. Now he is mid-level management at a moderate size HVAC company at the age of twenty-eight. That's called opportunity, and taking advantage of said opportunity....\nHandouts and patronizing slogans like, 'just learn to program', is not opportunity, and nothing that can be taken advantage of..",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "beacon1384",
        "time": "7 September, 2022",
        "context": "College is certainly not for everyone. Trade school was the best thing that ever happened to me, after developing an interest in building, I went on to a 40-year career, with 30 years making very good money as a project manager.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "henway685",
        "time": "7 September, 2022",
        "context": "If i had it all to do over again, I would have gone to trade school and not college.  ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Marinemom806",
        "time": "7 September, 2022",
        "context": "This is a great article and a better program.  Unfortunately until parents and employers realize that a college degree is not essential for many of the jobs nor for career/life success, things will not change.  Signed, first generation CPA/MBA  ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jakelakota",
        "time": "7 September, 2022",
        "context": "Nothing wrong learning a trade and charging a snobby liberal with a useless degree $100 an hour as a plumber",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "getsomecommonsense",
        "time": "7 September, 2022",
        "context": "Real answers here. We need to see more of this. Universities are clearly failing students. Students have degrees that do not provide careers. Students attending universities are strapped with loans and tuition that they cannot afford! This makes sense!",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "noneyer",
        "time": "7 September, 2022",
        "context": " My father could add subtract multiply and divide four columns of numbers in his head.  I can't, the pocket calculator did it for me when I was 11 years old.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "noneyer",
        "time": "7 September, 2022",
        "context": "My former supervisor was married with a child a rent a full time job and a part time job at age 18.\nToday 18 year olds' sense of success comes from their video game saves.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Colo805",
        "time": "7 September, 2022",
        "context": "what happened to teaching them to read, write and math skills?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "oxbow526",
        "time": "7 September, 2022",
        "context": "Being self employed is NOT a walk in the park.  With the occupational education offered and with some additional education some can achieve a professional license and start their own company. \n ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "VegasMike",
        "time": "7 September, 2022",
        "context": "So basic. It’s amazing that as a society we have to relearn this. That we need to train, hands-on, not just teach from books. All schools need programs like this. Are you listening teachers and educators? All students need vocational training opportunities. ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "redsoxman",
        "time": "7 September, 2022",
        "context": "Everything old, is new again.  While the content of \"CTE\" classes has changed, the concept harkens back to the 50s, 60s and 70s--with classes like Home-Ec  and various \"Shop\" and mechanics classes as course electives.  This is literally not rocket science.  It's unfortunate that the educational community for decades has brainwashed every student into thinking a four-year college degree, in sometimes dubious majors, is an absolute prerequisite to making a living and decent quality of life.  Too many students have been sold this false bill of goods and with the skyrocketing cost of higher education, students and parents are reevaluating career and educational options.  Rightfully so. ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Dangerwillrobinson942",
        "time": "7 September, 2022",
        "context": "CTE or Vocation School. Been the same for over 30 years. I hope parents and Advisors finally see the value and not discourage it like they always have. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ClaudeBalls779",
        "time": "7 September, 2022",
        "context": "How about we make college the measure of success? I got my bachelors degree while on active duty and my graduate degree after. Yet today I am reluctant to recommend college for most young people. America needs technicians and tradesman and we need to encourage youth to pursue careers in those fields. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sipius22",
        "time": "7 September, 2022",
        "context": " Perfectly timed to coincide with Biden taking us back to the 70's.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ed209",
        "time": "7 September, 2022",
        "context": "Followed my parents advice and went to college. Got degrees, worked 40 years and retired. Was asked to then work for a CTE to build relationships with area employers. \n\nIf I had to do it again, I'd take the trades a lot more seriously, and would recommend it to many students. Lots of options, improved pay and for many, good work/life balance. The young people who are now plumbers, for example, are laughing all the way to the bank and when work is done for the day...they go home...period. ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "softballbatman",
        "time": "7 September, 2022",
        "context": "I hope it’s true most kids I see look like walking dead. Too much trouble to get to school bus",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "leppes",
        "time": "7 September, 2022",
        "context": "These programs are nothing new.  The only difference has been a loss of focus and the understanding of their value.  If only half of liberal arts majors had gone down this path they'd be in much better shape since these are the types of jobs they probably ended up in anyway.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "read4all",
        "time": "7 September, 2022",
        "context": "The NY mom is right - there is a stigma attached to vocational/tech/trades education. My district has a mandatory college prep class where students practice filling out forms, and even making college banners. Kids going into the military or right to work are embarrassed and made to feel less.Even Biden swore to the teachers union he would \"regulate the tar out of alternative\" education. ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "hecortez",
        "time": "7 September, 2022",
        "context": "National Alliance Of Businessmen did this back in the 70's and it worked really well, then the Federal Government took away funding and it feel apart. Some people are not interested in college, yet still need a future!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "fear_the_munk",
        "time": "7 September, 2022",
        "context": "They shouldn't be screwing around with this, they should be learning a skill so they can get a good job in the trades working for me.  College should be only for people with the intellectual horsepower to earn a degree and do something useful with it.  Most people can do just fine unclogging drains and hammering nails and mowing lawns.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "iddybiddy2",
        "time": "7 September, 2022",
        "context": "For over 30 years, The Doe Fund has led the charge against homelessness and recidivism by providing economic opportunity, career training, and supportive services to homeless and formerly incarcerated men.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "NobodyLikesMe201",
        "time": "7 September, 2022",
        "context": "Kids better do such because a lot of the  better jobs like engineering design have been outsourced to India, etc. where people work a lot cheaper.  Kids need jobs that have to be done here!",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ABC12",
        "time": "7 September, 2022",
        "context": "My teen son does not have the same aspirations as my daughter, the COVID zoom years really did damage to kids his age.  From those years, he think school is a joke and liberal teachers are jokers.  Maybe he can try VOC first, then college if he want.  I was against VOC idea but changed my parenting style to fit him.  ",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "muckt",
        "time": "7 September, 2022",
        "context": "Until our government quits allowing Corporate Lobbying and allowing themselves to be bought off by Corporate donors there's not a lot of need for our young people to prepare for a job.\n   Our trade agreements need to be dismantled and industry and jobs forced back to this country. Monopolies broken up, no more conglomerates and small to large businesses encouraged to start up and compete. This would bring ingenuity into the marketplace and home grown industry would make us less dependent. The energy market is one such area, whether it's better, cleaner forms of energy the goal would be to diversity and use all forms of energy together.\n   If you have good jobs with  national pride you unite the citizens, you give a avenue for our future work force and you make productive/high character individuals.\n   Our entitled elite at the top of this criminal pyramid created all of this for the sake of greed. Corporate America has no business in our representation, get yhem out and represent the interest of the citizen and this nation.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "doe67",
        "time": "7 September, 2022",
        "context": "I've been pushing trade schools for years. Stay away from colleges and liberal indoctrination ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Lucky_Farmer",
        "time": "7 September, 2022",
        "context": "I went to college and became a CPA and CPP.  When my father needed help on the farm I retired early to help out.  I have to say I enjoy farming more than the 9 - 5 office grind. I used to get a sense of satisfaction when I hit the total button and everything balanced BUT the sense of satisfaction I feel when I see the rows of a new crop coming up is way better.  ",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ampat",
        "time": "7 September, 2022",
        "context": "So what we are saying here is that the government school education is inadequate? Thanks for finally admitting that you are wasting the taxpayer’s money!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "demsaretheenemy515",
        "time": "7 September, 2022",
        "context": "I Hope So..They Have A Lot Of Loans To Pay Off.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "saltdispenser",
        "time": "7 September, 2022",
        "context": "Hey look everyone. The US is now attempting to do what Europe has done for 75 years. ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "speakmind124",
        "time": "7 September, 2022",
        "context": "I would rather my tax dollars be spent on these programs than paying off college loans.  Teach a kid a lucrative skill and they will earn their own way.  ",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "oldhappycamper",
        "time": "7 September, 2022",
        "context": "Our younger son got additional heavy equipment training after HS.  It cost us $18K, and was well spent.  He now makes about $35/hr as a crane operator - with no debt.  This is absolutely a trend we need to encourage.",
        "good": "12",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "buildbackbrandon",
        "time": "7 September, 2022",
        "context": "I’d call it a success to just get them out of their parents basement!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "biscuitcrux",
        "time": "7 September, 2022",
        "context": "\"The outdated term \"vo-tech\" tends to call forth outdated images, said Troester.\nWhat comes to mind for many when they hear that is \"woodshop settings,\" she said, along with a \"hands-on, minds-off\" mentality.\"\nThe \"hands on, minds off\" mentality was brought to us by elitist academicians who are/were clueless about skilled trades, and who had a simple-minded inability to coordinate their physical actions with their intellectual abilities, that's all.\n Those of us in the skilled trades can handle both - at the same time. There's been a steady shortage of auto mechanics (and all skilled trades) since I began my career many years ago, and after 47 years I was never without a job.\n Some folks still think that mechanics, carpenters, electricians and plumbers are the low-hanging intellectual fruit, yet they can't fix their own cars, repair (or build) their homes, wire in a ceiling fan, or plumb their leaky pipes. I knew a cheapskate accountant once that had to hire a locksmith to replace his door locks because he was incapable of doing it himself.\nI can do all the above, and I'm just a lowly high school graduate. I'm not afraid of hard physical labor, either...maybe that's also a factor. How many post holes have YOU dug, professor? LOL (ever had a calloused hand before? ;)    ",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sipius22",
        "time": "7 September, 2022",
        "context": "The liberals and their media propaganda machine are indoctrinating youths to believe that being a google coder, or a tik tok star is all there is.  ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "KipK",
        "time": "7 September, 2022",
        "context": "Work hard and help pay the elite college student loans",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Bubba'sAgenda",
        "time": "7 September, 2022",
        "context": "I thought teachers were suppossed to only teach math, reading, science........The rest the parents have right?  ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "beardoMD.",
        "time": "7 September, 2022",
        "context": "Wow, teaching kids useful skills and trades benefits them more than teaching them they are a victim or they can change their gender whenever life gets tough.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "politicaltheatre",
        "time": "7 September, 2022",
        "context": "Not every student is an expert at \"Test Taking\". \nTrade Careers offer so much. Good pay, and  learned skills that can help start up a Business, or steady employment.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dumnorix",
        "time": "7 September, 2022",
        "context": "Is it me or did this article give the impression this CTE concept is completely new?  My oldest son just graduated from a tech high school and experienced (or had available) all that was referenced here.  One week was academic while the next was, \"shop week.\"  A student that showed aptitude got a co-op job as a second semester junior and senior.  This lead to job opportunities right after graduation.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dude19",
        "time": "7 September, 2022",
        "context": "Thats right  Just say no to liberal colleges ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "YouKiddingMe",
        "time": "7 September, 2022",
        "context": "When I was in high school, we had auto shop, metal shop, woodworking shop, home-ex classes, sewing classes... why they did away with these hands-on courses I don't know, but it definitely shows these days. Kids can't make change, can't write or understand cursive, don't have music class, nothing. So what exactly do these kids get? CRT. BLM. Gender identity. Wonderful.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Magua",
        "time": "7 September, 2022",
        "context": "College is overrated. We should have more trade schools as does the E.U.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Putrid_Dimocrap_cesspool_lying_cheating_",
        "time": "7 September, 2022",
        "context": "yep, associates degree in 'Mime' or Arctic husbandry.......",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ozyalaha",
        "time": "7 September, 2022",
        "context": "Math classes required to read gram scales are required in NYC public schools.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bort22",
        "time": "7 September, 2022",
        "context": "I think it's great to have an alternative for those not smart enough for college.",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "ProudLegalAmerican",
        "time": "7 September, 2022",
        "context": "Where have the US educators and teachers been all these years?  Most Asian countries have this kind of program many decades ago.  It's called \"Vocational Training\"!  I bet that many graduates in Electrical Engineering degrees can't even do the electrical wiring in his/her parents' home or their own homes!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "saltymarine878",
        "time": "7 September, 2022",
        "context": "Nothing new here.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ILTH",
        "time": "7 September, 2022",
        "context": "We need more of this. Public schools are afraid of this and call it \"tracking\".",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "xyzxyzxzy",
        "time": "7 September, 2022",
        "context": "They are doing this in my grandsons HS. I think its a great idea. He will come out of HS with a marketable skill and nothing prevents him from going to college if he chooses to after HS or  later but he has a skill.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rbrooks66",
        "time": "7 September, 2022",
        "context": "Another example; Intel is building 2 new IC Chip FABs in Arizona and an entire new FAB complex in Ohio. TSMC also building a FAB complex in Arizona and Samsung is expanding their Chip manufacturing in Texas. This is a huge opportunity as there are nowhere near enough qualified FAB Technicians. I have an AS degree in Electronics, but a Tech School degree will do just as well. I earn a very good 6-figure income, have great benefits and have a substantial amount in 401K. If 4-year college is your dream, go for it but there are great opportunities also in Trade Schools and Community College.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "06dakota",
        "time": "7 September, 2022",
        "context": "come on man....a technical education is nothing compared to a degree in diversity, womens studies, race, and gender equality.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "slightlydusty",
        "time": "7 September, 2022",
        "context": "European countries have been doing this for quite a long time.  Realizing that everyone is not an academic Germany's program allows students to opt for taking a trade curriculum around the 8th grade.  ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "blkpwdr835",
        "time": "7 September, 2022",
        "context": "Kids today really need better guidance...From Home. \nParents quite often are the ones who are locked into their kids going to college. Kids are rarely involved in vocational type skills while growing up because parents seem to be too busy serving themselves, and it's much easier to keep you kids on their computers. My grandson is a senior this year. That's all they talk about. Like many his age, he's on the computer all day and has never had a single blister on his hand from work. He will most likely be one of the millions who ends up with a degree in a flooded job market and ends up with work that never required a college degree.\nVocational skills seem to be better income producers than most degrees. But this requires work. We seem to have taught our kids how Not to work.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "phillycsteak",
        "time": "7 September, 2022",
        "context": "The school district I taught in pioneered this type of program about 10 years ago. Not for all kids, but a great way to engage kids in education that is meaningful to them and has real world applications. \nA by-product of these programs turned out to be a reduction in discipline problems and failure rates. If a student failed to maintain expectations they would be dropped from the program. \nToyota literally gave the district a campus they were leaving. The program, Ignite, now servers students from multiple school districts and, after some growing pains, has become very successful. \nThere are good things happening in public education.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bibledetectivejm_👁‍🗨",
        "time": "7 September, 2022",
        "context": "The world needs ditch diggers too\n~Judge Smales",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Donnelly832",
        "time": "7 September, 2022",
        "context": "excellent idea!",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Bidenblows429",
        "time": "7 September, 2022",
        "context": " Nothing new about this......but there should be more of these.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "buthow",
        "time": "7 September, 2022",
        "context": "Meanwhile china is investing in higher education. Way to cons. Bunch of backward thinking hill folk",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rrpost",
        "time": "7 September, 2022",
        "context": "It begs the question, what had they been doing before?",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bob908",
        "time": "7 September, 2022",
        "context": "The problem with this narrative is that for every one of these high-school vocational programs (which are good), the school district hires one additional teacher, and 12 more administrative fat-cats to do public relations to market their \"new idea\", which has been around since at least the 1950's when the movie \"Grease\" was set.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "wheezer923",
        "time": "7 September, 2022",
        "context": "The real problem with this is it works well. The students get well paying jobs. Then they face paying for classmates who went to college, lived beyond their means, and got the President to write off their debts, leaving it to their hardworking classmates to pay.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "safian",
        "time": "7 September, 2022",
        "context": "More nonsense. While vocational education was originally included in public education as a means to teach those not academically inclined the present illusion that these programs are as good as they are promoted is questionable. While I even participated in a number of such courses, not a complete immersion, what is presented and what is actually available is often a problem due to costs. The typical offerings are done with students spending half time in one school and being bussed to another place for the vocational program. In some cases the students are even required to attend school year round, not bad, but transportation becomes costly to a school district. My point? The present arrangement of local schools, small and with a limited budget, makes it a problem for those students, however, Urban school districts with money being thrown at them would seem to cover such costs, but then there are the remedial programs in such places. Money is always in short supply, perhaps because of politics and when such solutions emerge it is often with another administrative structure in which those at such places are paid a premium for their services, again money is required so the siphon from smaller districts is heard. Of course the other problem, not acknowledged, is what happens to the student if the vocational education pathway chosen folds in a community or if there is an oversupply of such students for a limited number of jobs.  ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jbible",
        "time": "7 September, 2022",
        "context": "So many of my High School Students think that just because they have a degree they are going to earn 100K a year. They are clueless and they are not getting the right education to put the in high paying jobs. CTE is a wonderful alternative, especially for kids who are not great students, but have drive, ambition, the ability to learn skills and can actually talk to people without getting anxiety. All my courses are CTE and articulated with the local Community College for certification.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "leekianiss",
        "time": "7 September, 2022",
        "context": "Trades are the future. College is not worth the price anymore. Men will take advantage of these opportunities. Women will still borrow to go to college and earn useless degrees, then cry for a bailout.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "milehiconservative",
        "time": "7 September, 2022",
        "context": "Meh.. It's still \"vo-tech\"..but there's nothing wrong with that.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "wolfgan1",
        "time": "7 September, 2022",
        "context": "Good cause!  Many people have educated themselves online as well such as graphic design and computer programing.  These are skills that must grow on the job and the professional training has got them started.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "EngineerRetired",
        "time": "7 September, 2022",
        "context": "Question:  Why do you need a propane carbon fueled torch to work on an electric car? ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "BabyBoomer838",
        "time": "7 September, 2022",
        "context": "My construction company of over 30 years cross training program eliminates %40 of our labor force. \nThe company has made these adjustments to compensate for hyper inflation and corporate tax increases.\nIt’s unfortunate that only about 1 out of 10 can follow instructions and think on their feet. \nPrograms like OJT and others have been eliminated and most employers won’t take the financial risks to hire unqualified job candidates for a in house training program. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "swk1301",
        "time": "7 September, 2022",
        "context": "Excellent!!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bochanghan",
        "time": "7 September, 2022",
        "context": "Any program to keep kid ready for life is great, but how much lazy now aday kid react to cope with the new program, HUNGRY KID can not learn is garbage. When we were poor, hungry in third world country, we learn very hard to be success, even with half day school (not enough school) we work half a day at 11 years old in evil (my heaven) sweat shop, but it save our life and keep our education continue.\nCome here I always ask myself, why people here did not success when they have eveything ready for them, just work little harder, you can get your dream come true.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "1948patriot279",
        "time": "7 September, 2022",
        "context": "As a founding member of a JTED (Joint Technical Education District) that was approved by the voters and included the 11 school districts in the County, I'm proud of our work. Statewide test scores improved by 4 points for students who had one or more JTED classes vs. those that didn't. \nI asked one of the Superintendents why JTED wasn't mandatory given those results and he said, \"That would take a change of culture.\"  What did he think his job was?\nOne student, enrolled in the automotive mechanic courses, told our Board, \"Before JTED I couldn't understand any math. Now I get A's because knowing how to figure out the volume of an engine cylinder, made math more understandable.\"",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jeffersonspaceplane",
        "time": "7 September, 2022",
        "context": "Hmmmm.  High school and the word shot used in the same sentence.  Maybe say High School students have a strong chance…",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "loveusaflag",
        "time": "7 September, 2022",
        "context": "Not everyone enjoys reading poetry and going to college.  ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ladypatriot934",
        "time": "7 September, 2022",
        "context": "Love this story!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tsglover",
        "time": "7 September, 2022",
        "context": "Not all students are fit or well qualified for college and should have other avenues towards gaining employment.  We have neglected the CTE type of training for too long.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "EngineerRetired",
        "time": "7 September, 2022",
        "context": "No one needs a socialist college degree to be a decent person and a successful worker.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "daretoquestion",
        "time": "7 September, 2022",
        "context": "A career instead of a crushing debt for a worthless degree. Sounds terribly logical to me.  At least Joe won't be there trying to win votes by forgiving student loans using our money!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "RobertGCline",
        "time": "7 September, 2022",
        "context": "Cool beans!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "vfl1951",
        "time": "7 September, 2022",
        "context": "We had vocational tech classes back when I was in high school in the 60s and it proved to be very successful for many.   Why they ever decided that everyone should go to college and do away with vocational skills courses is beyond me.  I'm so glad to see them bring them back.  There's a tremendous shortage of skilled workers and it will take a long time to replace the lost generations.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ILuvAmerica!!",
        "time": "7 September, 2022",
        "context": "I tell my boys and their friends all the time it ok to learn a trade. Do it when your young and then maybe open your own business later in life. College is not for everyone. ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "marine1976",
        "time": "7 September, 2022",
        "context": "Had same type of programs back in the 70's...they called it Work Experience. What a novel concept...",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "EngineerRetired",
        "time": "7 September, 2022",
        "context": "High Schools got rid of skills classes and now we have generations  of people who cannot wire an outlet.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "scott186",
        "time": "7 September, 2022",
        "context": "What you mean that getting loans for 100,000 dollars for a gender fluid basket weaving dance theory is not the way to go, when you end up working at McDonald's and need the taxpayers to bail you out? Who would have thought. ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "c19hoax",
        "time": "7 September, 2022",
        "context": "If you want to really help the school system and help your community just take your kids out of school because then they lose funding and then this public school system goes away your kid could learn a lot more on the street",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "lcb982",
        "time": "7 September, 2022",
        "context": "Using the metaphor “a shot” may not be the most appropriate for an article about high schoolers.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "selkie614",
        "time": "7 September, 2022",
        "context": "Better than a college degree.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "rtrim",
        "time": "7 September, 2022",
        "context": "No matter how many engineers, computer geeks and AI people we have, we'll always need plumbers, welders, pipe fitters, HVAC workers, etc.  Has anyone paid an electrician lately?",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "babybison2020#",
        "time": "7 September, 2022",
        "context": "Need plumbers, electricians and heating and air… small contractors, etc. there is too long of a wait to get scheduled appointments. Stop hiring readily available cheaper immigrants that have no training, can walk away and never finish the job. We need to give our American kids the opportunity to explore these fields and their careers as businesses owners! ",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jorgan1964",
        "time": "7 September, 2022",
        "context": "This is far from \"New\". It was the norm for decades up until the mid 80's when it was decided that everyone \"Must\" attend college. Schools around the country turned 18 year old's into ATM's & Piggy Banks. There is not a thing wrong with college. If, you are smart enough, can afford to go and get a useful degree. Unless degree fields & studies have been invented by schools to keep the cash coming in. \"STEM\" studies are becoming a thing of the past in America because \"It' tooo Hard\" for baby. We lower the bar and it's still too hard.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "winstonwolf488",
        "time": "7 September, 2022",
        "context": "One of the stupidest things done in US education was to remove industrial arts classes from high schools and force kids at an early age to choose between going to a vocational school or stay on a college track. A lot of kids were never exposed to trades and either bombed out in college or never gained a marketable skill as a result.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "technicaltype",
        "time": "7 September, 2022",
        "context": "It is the one size fits all people and government pushing college degrees for all that caused the current student loan crisis.  I believe that also caused the irrational preconceived stigma concerning vocational technical schools.  We did not all come from the same mold, not a homogeneous population; as much as the government would like us to be.\nIf a new wrapper helps this take off, so be it.  Skilled, hands-on people are in high demand and make a good income.\nMy father, a high school graduate, was a farmer all his life; that worked for him.  After high school I went to a two-year college, took night classes to earn a BS while being employed full time.  That worked for me, now retired.  My younger brother took a one-year electrical course and still runs his own electrical business; that worked for him.  Our differences make us stronger as a nation.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "want2believe_ts-13",
        "time": "7 September, 2022",
        "context": "As a college prof, I'd estimate at least 1/3 of incoming freshman would have been better served by a technical education.  It's a shame so many still look down upon it. ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Brandonisevil",
        "time": "7 September, 2022",
        "context": "Obama got rid of vo-tech at high school levels.  He said they weren’t necessary and a waste of money.  Every child has to go to college instead.   That worked out well!",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "BarneySays225",
        "time": "7 September, 2022",
        "context": "All the CTE schools appear to be run by conservative governors who value the happiness and future of their children. They concentrate on building a state their child will be safe, educated and have a future. California on the other hand has drag queen performances in kindergarten, liars for leaders and a future of black outs. Oregon, homelessness that is devastating their cities, and a drug epidemic.  ",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "zarkastic",
        "time": "7 September, 2022",
        "context": "A lot of the trades have been looked down on as 'Blue Collar' professions that only beer drinkers or 'good ole boys' want because they are not smart enough to get into college.  That's why nobody talks about them very much.   While college is pushed for the elites who can buy a degree even if they can't make the grades.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "HMBS",
        "time": "7 September, 2022",
        "context": "High school students have always had a strong shot at success.  ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "winterwarrior",
        "time": "7 September, 2022",
        "context": "Homeschoolers are effectively entrepreneurs.  My homeschooled sons went on to get their bachelors and master's degrees and now have successful careers and relationships.  While your kid was smoking pot out back with their high school teachers, my sons were building a foundation of stone.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "20yeara10guy",
        "time": "7 September, 2022",
        "context": "Learn a trade skill, kids. It'll come in more handy than a sheepskin more often than not. It certainly worked well for me.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "billyb",
        "time": "7 September, 2022",
        "context": "Sounds very similar to a program I attended in the 80's called Job Corps.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jaytara",
        "time": "7 September, 2022",
        "context": "It's called dual enrollment.  It's been around since 1955.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "turnminnesotared",
        "time": "7 September, 2022",
        "context": "I love this!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jhdrifter",
        "time": "7 September, 2022",
        "context": "I worked for the town I grew up in in the 80’s thanks to a state sponsored program for high school students. Was the best thing I ever did. Not only did I learn about all aspects of town maintenance, I also earned my licenses for electrical, water and sewer system maintenance, how to advertise and vet bids for extensive work beyond the scope of normal operations, basic life skills, and how to relate to the public. ",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "CLEANHOUSE2022",
        "time": "7 September, 2022",
        "context": "$10 to $15 dollars an hour jobs... and with BIDENFLATION in High Gear that $10 to $15 dollars gets eaten up and leaves you with pennies!",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "daretoquestion",
        "time": "7 September, 2022",
        "context": "Thank God there's CTE to step in and make up for the abysmal failure of public school teachers to teach kids the fundamentals of reading, math, and science. Without CTE these kids would turn out to be lifelong dependent Democrats.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jakesaysso",
        "time": "7 September, 2022",
        "context": "Laughable that this is considered a great new concept.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "xan222",
        "time": "7 September, 2022",
        "context": "Yeah, in my days in school it was called Vocational Tech and Work Study. Same thing just more choices",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "CornPopPonySoldier",
        "time": "7 September, 2022",
        "context": "👏🏼❤️.      Maybe there’s been enough gender studies to figure out that there’s only two…..",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "dougmh",
        "time": "7 September, 2022",
        "context": "Bravo!  Community Colleges across the country have partnered with local businesses the create curriculums that provide qualified workers from the get go.  Also apprentice programs that can lead to new small businesses that can grow as big as the energy and savvy owner has vision. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rambletamble",
        "time": "7 September, 2022",
        "context": "There are things some won't do or can't do that others can or are willing to. Stop playing video games and put the smart phone down and get to work.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Downgoesfrazier",
        "time": "7 September, 2022",
        "context": "I think this is an awesome program.  So many kids need other opportunities other than the same old college route to find a career.   Many kids just aren’t interested in college, but are ready to work and learn a trade.  Kudos to the states that offer these types of programs.   All states should have something like this partnered with the schools and local trade businesses.  ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "missdonna",
        "time": "7 September, 2022",
        "context": "Awesomness!",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "aznativeog",
        "time": "7 September, 2022",
        "context": "High schools should be educating kids on trades. There is so much many to made in trades, instead of pushing college. ",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "totherightofgoldwater",
        "time": "7 September, 2022",
        "context": "Wait, there's only one black in the pictures.  You can't have a program without blacks.  But then again, this IS about work.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "wheresmygop",
        "time": "7 September, 2022",
        "context": "These are good programs, but my kids will still be going to college.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "TexanBoiling357",
        "time": "7 September, 2022",
        "context": "Charter schools, Tech vocational school, learning to run and start up a business. Little debt, earning right away. Who needs a worthless indoctrination from a University. Not every kid needs to go to college, and most Academic Majors are worthless. We need programs like this in every High School in America. Randi is having a meltdown, she hates kids !!",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "twalters1214",
        "time": "7 September, 2022",
        "context": "I love this! Some kids just aren't meant for a college degree, especially in something where there are no jobs. When I was in high school, way too many years ago, I learned skills that enabled me to have a job upon graduation. Didn't get rich but I was always able to support myself. ALL high schools should have these programs.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ranger231674",
        "time": "7 September, 2022",
        "context": "High school students have a strong shot at success with career technical education: 'A win-win'\nGreat stuff... let's back up a bit though and start by just keeping the schools open and letting kids attend class in person.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sendit080",
        "time": "7 September, 2022",
        "context": "\"We have thousands [of students] take our classes, testing out CTE by taking one class.\"\nWhen I was in school it was called simply 'shop' and required but then the folks on top started thinking we don't need such neanderthal education, now ya got 20 somethings flippin burgers for minimum instead of welding at $50/hour. Smart, very brainy.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "aimeeward",
        "time": "7 September, 2022",
        "context": "I’m so glad to see this happening. I went to a high school that had a votech offering mechanics, office skills (this was the early 80s), nursing, accounting, and computer science. My boyfriend of the time learned welding and was ready to hit the market. They graduated with in-demand marketable skills but were toward the bottom in class ranking because it was assumed everyone was going on to college. Lower class ranking means lower chance of getting into college.\nI hated college. I cut every class where the prof didn’t take attendance. I was a bright kid, but it was all D’s and F’s for me. After 2 years my parents bought me the best executive assistant school in the Northeast, and I had straight A’s and was on the dean’s list. There were businesses that would hire only graduates from that particular school.\nKids, go for it. Parents, get it through your thick skulls that college isn’t the ticket to a better life that it used to be.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "go2urroom",
        "time": "7 September, 2022",
        "context": "Schools in my area have recently started offering Burger Flipping 101, and Advanced Burger Flipping 201. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "connel",
        "time": "7 September, 2022",
        "context": "This is a great program and these folks need to be reminded that when they get their first paychecks a portion of taxes is going towards paying the tuition of a gender studies grad that spent 4yrs and $200K sipping Starbucks and debating the merits of men playing womens sports. ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "islanderws",
        "time": "7 September, 2022",
        "context": "CTE or any vocational career is far better than sending your kids to Liberal brainwashing colleges. A high paying job is also guaranteed waiting for your kids when they complete apprenticeship training.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dizmayed",
        "time": "7 September, 2022",
        "context": "Just like the good ol' days! \nNot everyone wants to wear \"Dockers\" and pressed shirts, Teach your kids how to work with their hands! \nHard physical work gives satisfaction of accomplishment! Learn all you can at every job, take those skills on to the next job.\nDegrees can't compare to experience!",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "KamalaCackles",
        "time": "7 September, 2022",
        "context": "Joe Biden called and said teacher's unions fought against trade and tech schools for decades. Hold teachers accountable for their failures and arrest parents who keep their kids home from school or drop them off late. ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "smithy993",
        "time": "7 September, 2022",
        "context": "We had these years ago in my HS, that is why I became an electrician.  I make 90k a year and have never had student debt. ",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bobsrule99271",
        "time": "7 September, 2022",
        "context": "But most “educators” won’t embrace this concept!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Justmyopinion629",
        "time": "7 September, 2022",
        "context": "It’s about time technical careers again get an informational boost!  A university degree isn’t the only way, and many times detrimental, to a productive, contented, lucrative life. ",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dneaster",
        "time": "7 September, 2022",
        "context": "A good education is fine,but a tradesman,can always find work,and keep a roof over their heads,and food on the table!! ",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Buffman610",
        "time": "7 September, 2022",
        "context": "I have been in Workforce Development field for over 20 years. This CTE is the only thing i have seen that really works and will make a difference. WFD has become another stream which money passes through will little outcome, it has become to political and in a lot if areas trying to do more than they are designed for. Congress needs to take the WIOA dollars and revert them into developing more CTE that is a better way ti use tax payers dollars, and have states continue to do Labor Exchange, Trade and veterans services with some oversight on CTE schools and training outcomes ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "RockinInTheCLE",
        "time": "7 September, 2022",
        "context": "Post-WWII, vo-tech was huge.  That was before the powers that be started pushing \"college for everyone\".   Glad to see CTE making a bit of a comeback.  ",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "yankeefarmer214",
        "time": "7 September, 2022",
        "context": "I believe another reason young people don’t go into trades anymore is you need a “certification” to use the porta-potty. Whatever happened to OJT?? Within a week the foreman could tell if one was worth keeping on the crew. Now, new hires need certifications and then, if they suck, you can’t fire them. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jfca",
        "time": "7 September, 2022",
        "context": "What's so NEW about this program? Had the same thing (different name/acronym) in high school during the early 70s. Today, KIDS DON'T WANT TO WORK! Stay at home & play videos!",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bwahahhhaaaahhhhaaaaaa",
        "time": "7 September, 2022",
        "context": "good",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "john84",
        "time": "7 September, 2022",
        "context": "My area has been doing this for a while. My biggest complaint is that this one thing caused our property taxes to go up 40%. We used to have one of the lowest costs of living in the nation. Now our taxes are starting to look like blue states... And they just raised them again recently to renovate and build new schools.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dan5047628",
        "time": "7 September, 2022",
        "context": "Excellent. What we see coming out of colleges is mostly an utter failure so learn a trade and educate yourself. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cantthinkofone",
        "time": "7 September, 2022",
        "context": "Why can't folks agree that we're all not the same?  As a society we need folks whose talents and skills lean toward trades and we also need the other folks who have the interest, talents and skills to become doctors, attorneys, engineers etc.  Each side, if you want to call it that, serves the needs of the other.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "BigJoeNCornPop",
        "time": "7 September, 2022",
        "context": "Not a new concept. All of that was removed from schools due to lack of funding. Funny how they now boast as if they thought of it.  ",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ConcernedNana",
        "time": "7 September, 2022",
        "context": "Wow, this is the best news I’ve seen in a long time. This program should be at the top of the list for the Federal Government’s education dept.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "610flyer",
        "time": "7 September, 2022",
        "context": "So they finally figured out we need people in the trades, a gender studies degree won’t build a house or fix a sink",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jasonduke",
        "time": "7 September, 2022",
        "context": "Much kudos to this program.  ",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "beeconservative",
        "time": "7 September, 2022",
        "context": "This is the kind of program that has been needed for a long time. There used to be some similar programs in HS but they were done away with mostly during the Obama years, because he said that every person must have a college degree. We knew then he was wrong. How many children lost their way because they were not offered programs that helped them excel in areas of interest to them?",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "hereforthecomments70",
        "time": "7 September, 2022",
        "context": "My son is a Junior in HS.  He is dual enrolled. He attends our local Career and Technology Center for Criminal Justice and Homeland Security for half the day and takes college level classes the 2nd half.  He's learning a valuable skill and his ultimate goal is to be a Detective. #backtheblue",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "labrador13",
        "time": "7 September, 2022",
        "context": "Go to a Trade School and learn specifically how to do a certain job; join the Military; get into construction or the oilfield where they will teach you OTJ. I did all 3 of those jobs. Made $75K in construction for 15 of my 22 years in that field. Worked the oilfield my last 10 years before retiring—made $100K every year starting with year one. Retired w no debt. Regular college is for doctors, dentists, lawyers, the medical field. Anything else and you’re wasting your earning years and building debt someone else will have to pay off. ",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "grumpers",
        "time": "7 September, 2022",
        "context": "flippin' burgers not cuttin' it for ya? 6 smelly roommates...and their 'friends' eating your food, wearing your clothes, and leaving pet hair in your bed?\nMaybe....you could learn a trade that will actually make you self-sufficient!\nour local Jr college has a 2yr program that will prep you for MRI/CT tech certification.\nSo what? what will that do for me, you ask?\nfor one, you'll be working indoors, in a clean, professional setting...helping people.\nand then there's the pay. our local hospital pays techs $60/hr, with all the OT they can accept. Most tech make $4000/week.\nyou read that right, a week, not a month.\nAnd, we're paying a $20,000 sign-on bonus when you get hired.\nwhy are you still here, get to it!",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "nothingnewundertheson777",
        "time": "7 September, 2022",
        "context": "I took welding in highschool. I ended up getting my GED and went offshore. I liked the industry and gravitated towards the drilling side. I worked my way up to Offshore Installation Manager. I spent 35 years mostly abroad in oil and gas. I won't mention compensation but I was able to send 4 to private school and college. The 5th is in international school. He can go to any university in the world but if he chooses one in Singapore I'll pay for it. No way would I send him to an American university to face liberal indoctrination.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "lew09",
        "time": "7 September, 2022",
        "context": "New??? This has been happening \"out on the sticks\" for the last 40 years.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "stillkickin",
        "time": "7 September, 2022",
        "context": "It was called SHOP CLASS when I went to school, learned woodworking, welding, auto mechanics, drafting, it was priceless. WORTH MORE THAN FIRST 2 YEARS OF COLLEGE.",
        "good": "2",
        "bad": "0",
        "replies": []
    }
]