[
    {
        "user_name": "whateveralready136",
        "time": "1 September, 2022",
        "context": "A former president? I don't think so.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "odelcid",
        "time": "1 September, 2022",
        "context": "Give Hillary a ring!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "J1971125",
        "time": "1 September, 2022",
        "context": "Libs love to sweep Hillary's classified docs storage/shredding under the rug.",
        "good": "23",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "vol_in_socal899",
        "time": "1 September, 2022",
        "context": "Brennan?  Really?",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "anycapp",
        "time": "1 September, 2022",
        "context": "People have gone to jail for possessing less. Google it.",
        "good": "2",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "saynotocons4c",
        "time": "1 September, 2022",
        "context": "Each day, someone at Fox turns against Trump.  Last week it was Bret B, and Brit Hume, this week it was Steve Doocy.",
        "good": "2",
        "bad": "8",
        "replies": []
    },
    {
        "user_name": "Ithinktherefore",
        "time": "1 September, 2022",
        "context": "Clinton was cleared for two reasons, one was that she HAD an approved SCI level room in her home, and two, she was cleared because there was no \"criminal intent\".. she was just careless. \n\nIn Trumps case he had SCI docs with no approved SCI level room, and he obviously knew he wasn't allowed to have them because he was asked for over a year to return them.. after an official NARA request followed by FBI visit, subpoena's and then he LIED to the FBI and DOJ that he didn't have documents left.. all BEFORE the search warrant, that's criminal intent all day long.",
        "good": "5",
        "bad": "17",
        "replies": []
    },
    {
        "user_name": "eustatius25",
        "time": "1 September, 2022",
        "context": "I can name 2. Clinton and Obama.",
        "good": "12",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "But…",
        "time": "1 September, 2022",
        "context": "Anyone else except (name any democrat).",
        "good": "11",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "thefatladysong",
        "time": "1 September, 2022",
        "context": "Sharing a cell with Clinton, Obama, Comey, Clapper, etc.?",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "timpruitt376",
        "time": "1 September, 2022",
        "context": "Atlantic article: ‘\"f it were anyone else’ possessing classified documents like Trump, ‘they’d be prosecuted\"\n\nUhhhh...  You mean like Hillary?",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "TheOldHammer",
        "time": "1 September, 2022",
        "context": "You mean prosecuted likely Hilary who had them where they were accessible to anyone who could hack her network?",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dropartist",
        "time": "1 September, 2022",
        "context": "\"..However, Serwer claimed that the Comey standard for Clinton no longer \napplied because of a law Trump signed that enhanced the punishment for \nmishandling classified documents...\"\n\nAs of January 2018 - President Trump signed into law, making it a felony (upgraded from a misdemeanor) to mishandle classified documents punishable by up to 5 years in prison.\n- 18 U.S.C. 1924.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mike12395",
        "time": "1 September, 2022",
        "context": "I’m good with both Hillary and Trump doing prison time for their mishandling of classified documents. Maybe 1 month per document. Hillary had 6, and Trump is well over 300.",
        "good": "2",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "Johnniebucko",
        "time": "1 September, 2022",
        "context": "Hillary did not have top secret files.  She had a mainframe in her bathroom and was using personal email on secret/government back and forth but she was brought in several times and questioned plus her mainframe, phones, computers were gone through.  She did not hide stuff and say she didn't have it.  She didn't steal top secret files and keep them in a resort/hotel.  Someone will be questioning his family as to whether his sons and partners read those papers.  They're taking fingerprints off the papers.  ",
        "good": "1",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "nicksorokin",
        "time": "1 September, 2022",
        "context": "So now we have a political propogandist in Adam Serwer ‘declaring’ in the anti-Trump Atlantic that Trump unequivocally committed a crime. He is sounding like a self-anointed King or Emperor. Governors and presidents, and so do Kings in other lands, make declarations in cases like emergencies. Our founding fathers declared independence through the Declaration of Independence. Declarations are recognized when they come from the most important people in government, not from  pundits. \nThen this Serwer condemns Trump for committed a crime, but we see no references to actual statutes that apply. What desperation on the part of the haters!",
        "good": "19",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "owlslayer",
        "time": "1 September, 2022",
        "context": "lol.....anti American rag",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mRNAsecretoflife=life",
        "time": "1 September, 2022",
        "context": "Murdoch has said Trump is done in the NY Post...Now...\nDonald Trump appears likely to be indicted, according to former Fox News legal analyst Andrew Napolitano, for a crime the former president believes should be punishable by death.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "RedneckRandy337",
        "time": "1 September, 2022",
        "context": "Trump appears to be losing contact with this universe. Defending himself against the Doc-a-Lago scandal he says he thinks the FBI searched Mar-a-Lago, including the desk in his office, “looking for Hillary Clinton emails.”",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "conservativeoak",
        "time": "1 September, 2022",
        "context": "Atlantic staff writer Adam Serwer get you head out of the sand. How about Hillary Clinton? Smashing Blackberrys;  government computer in a bathroom; lying about and funding (with taxpayers money) Russian collusion.\nAnybody else, really! Go live on the moon!",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "fiddlesticks462",
        "time": "1 September, 2022",
        "context": "Bias on display.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "midwestmotherofnine",
        "time": "1 September, 2022",
        "context": "But she WASN'T prosecuted.  \nSo again - the liberal mainstream media is lying.",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "chrisrobin601",
        "time": "1 September, 2022",
        "context": "It is clearly about politics. Nothing to do with law, all about a political hit on Trump by Biden and Obama DNC. They are desperately trying to distract from Biden's terrible performance and cratering polls.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Shell4trump761",
        "time": "1 September, 2022",
        "context": "Like Hillary and bill Clinton and Obama!  Right and Hillary was not a president!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "motorheadforlife",
        "time": "1 September, 2022",
        "context": "Trump will be indicted. Just a matter of time.",
        "good": "2",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "7thcav758",
        "time": "1 September, 2022",
        "context": "Are you aware that Clinton misplaced  the nuclear football for three months and did not report it to the secret service. It was only found out when it was time to perform schedule code change and he couldn't produce it. What was done concerning this? Nothing.",
        "good": "26",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "IndependentExRepublican",
        "time": "1 September, 2022",
        "context": "Hillary Clinton was a complete criminal; therefore, Donald Trump gets to be a complete criminal too.\n\nLook at the low state that the Republican Party has driven itself to so that they can defend the Orange Traitor.",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "mRNAsecretoflife=life",
        "time": "1 September, 2022",
        "context": "50% of patriotic Americans want to see Trump prosecuted for WH documents - Bloomberg News",
        "good": "1",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "suphawaii",
        "time": "1 September, 2022",
        "context": "The FBI found top secret documents in Trumps' desk drawer in Trump's office.  Trump passports were in that same drawer.  That throws out any claim that Trump didn't know about top secret documents. It also reinforces the possibility he was or planned to use the classified documents for nefarious purposes.",
        "good": "2",
        "bad": "11",
        "replies": []
    },
    {
        "user_name": "Johnniebucko",
        "time": "1 September, 2022",
        "context": "He should have been indicted by now instead of playing games with a judge he nominated.  He chose her even though she's in a different district.  She's located in Ft. Pierce, which is outside Palm Beach Counry.  That is unfair and she should have recused herself being from outside the area.",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "slummingit",
        "time": "1 September, 2022",
        "context": "Difference is Trump was president and could declassify whatever he wanted to. Clinton had no justification, excuses, or authority",
        "good": "3",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "entertainmeclowns",
        "time": "1 September, 2022",
        "context": "They can’t help but to display a fundamental ignorance of the law.\n\nCrossfire hurricane records lol.\n\nSimple fact:  Commander in Chief Clause trumps Espionage Act.  Presidential Records Act trumps general statutes over government property.\n\nAnother fake Russia Russia Russia political attack.  Like the peoples socialist workers party.  And I see why so many partisans don’t value their degrees. 🇺🇸🇺🇸🇺🇸",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dks12",
        "time": "1 September, 2022",
        "context": "I think he would have been indicted by now. If they had anything.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "IndependentExRepublican",
        "time": "1 September, 2022",
        "context": "Thomas Webster sentenced to 10 years in prison for his role in the January 6th insurrection.\n\nLook at the lows that the Republicans allow themselves to fall to for the Orange Traitor.",
        "good": "0",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "rar49795",
        "time": "2 September, 2022",
        "context": "If Trump declassified the stuff before he left office then what is the FBI looking for maybe papers on how they colluded with the DNC??????",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Decolonization",
        "time": "2 September, 2022",
        "context": "no one above the law.  indict him, NOW.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "TheRepublicMatters🎬",
        "time": "2 September, 2022",
        "context": "It looks like this is going to be a big motivator for the right to come out in droves in support of the former president.",
        "good": "6",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "semperfi63",
        "time": "2 September, 2022",
        "context": "Has a single Democrat ever been prosecuted for anything?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Jus'Aksin",
        "time": "1 September, 2022",
        "context": "Five Democrat Failed Hoaxes:\n·      Democrat Hoax #1 – Fake Russia Collusion – FAILED\n·      Democrat Hoax #2 – Fake Impeachment # 1– FAILED\n·      Democrat Hoax #3 – Fake Impeachment # 2 – FAILED\n·      Democrat Hoax #4 – Fake January 6th Insurrection – FAILED\n·      Democrat Hoax #5 – Unjustifiable FBI Raid on Mar Lago – FAILED",
        "good": "19",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "atlasshrugged288",
        "time": "2 September, 2022",
        "context": "It's pathetic the double standard, but not surprising.  So, I guess if Trump used bleach and a hammer, or sent classified documents to an unsecured server, they'd have left him alone?  Yeah, I didn't think so.",
        "good": "11",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "snapdragonfly",
        "time": "2 September, 2022",
        "context": "So the old Hill is saying she should be prosecuted.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ptatim",
        "time": "2 September, 2022",
        "context": "(((Adam Serwer)))\n\n2% of the population 100% of the subversion in chaos",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Mangie835",
        "time": "1 September, 2022",
        "context": "Secretary of State cannot declassify anything, plus Hillary was using the information to get donations to her foundation. President can declassify everything ",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "ThisMessageViolatesCommunityStandards",
        "time": "2 September, 2022",
        "context": "The comparison between Hillary and Trump is absurd. \n1) First and foremost: Trump had a right to declassify documents. Hillary did not.\n2) Hillary put classified documents on a server that could be hacked, guarded by nobody. Trump had whatever documents he had in a locked room in a mansion guarded by secret service.\n3) Trump kept those documents (probably mostly notes of meetings) for his personal records, and probably for his defense against more political witch hunts. Hillary kept her server to avoid open record laws.\n\nThere is every difference in the world. Hillary should have been charged and tried. Not doing so means charging Trump is an unequal application of the law.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "cuttinthroughit",
        "time": "2 September, 2022",
        "context": "First, it is really funny for a Dem to try and argue that the justice department sees Trump as \"special\" so they won't prosecute him.  What alternate reality is he living in?  Second, if it is prosecutable then do it.  Let's all stop comparing how politicians are treated.  Trump didn't pack his boxes and probably wasn't even there when the boxes were packed up.  I'm in the DoD and classified info is treated a specific way and there are laws.  Those laws are almost never followed by elected politicians.",
        "good": "79",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "handabove",
        "time": "2 September, 2022",
        "context": "Trump declassified the documents.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "arcanaknight",
        "time": "1 September, 2022",
        "context": "He's not wrong, but it's not exactly news. This is America; everyone knows that the rich and/or powerful don't face the same justice system as the rest of us.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Ireckon",
        "time": "2 September, 2022",
        "context": "Left wing unAmerican liberal Democrats have hollered wolf so many times against Trump that if he ever does commit a crime no one will likely ever know for sure if he did or not. Never in my long life have I ever seen an American political party so openly obsessed with trying to destroy the political future of one individual. Wonder why that is?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "oblongata",
        "time": "2 September, 2022",
        "context": "It's amazing anyone believes that, this time, the same people who launched the Russia collusion coup against Trump with false evidence and illegally obtained warrants is telling the truth.",
        "good": "34",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "offgridx",
        "time": "2 September, 2022",
        "context": "The documents were unclassified",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Jus'Aksin",
        "time": "1 September, 2022",
        "context": "The leaking from the democrat DoJ to the lib media has begun,...what a surprise.  But that's not \"misinformation\",... we must believe it's fact.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bigbopper111",
        "time": "2 September, 2022",
        "context": "TRUMP IS GUILTY OF TREASON!!!!\nWHAT WAS HE GOING TO DO WITH THAT TOP- SECRET MATERIAL?\nSELL IT THE HIGHEST BIDDER???",
        "good": "0",
        "bad": "7",
        "replies": []
    },
    {
        "user_name": "geogryzhukov",
        "time": "2 September, 2022",
        "context": "Thomas Webster’s prison sentence is the longest so far among roughly 250 people who have been punished for their conduct during the riot on Jan. 6, 2021. The previous longest was shared by two other rioters, who were sentenced separately to seven years and three months in prison.\nWebster, a 20-year NYPD veteran, was the first Capitol riot defendant to be tried on an assault charge and the first to present a self-defense argument. A jury rejected Webster’s claim that he was defending himself when he tackled Metropolitan Police Department officer Noah Rathbun and grabbed his gas mask outside the Capitol on Jan. 6.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "princessroxana",
        "time": "2 September, 2022",
        "context": "I love little libbie hypocrisy.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "RedneckRandy337",
        "time": "1 September, 2022",
        "context": "Were it not for Trump’s elected position he would have never qualified to hold the access he was granted. And we are now seeing the results of granting such an unqualified individual access to the nation’s most sensitive information.",
        "good": "1",
        "bad": "14",
        "replies": []
    },
    {
        "user_name": "JAZZY",
        "time": "2 September, 2022",
        "context": "Ket word \"Knowingly\"",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Jus'Aksin",
        "time": "1 September, 2022",
        "context": "The democrats got the incriminating evidence they were afraid of removed from Trump's home before the midterms and before it could be made public.  That was the real reason for the raid.  Everything else is cover,..especially if it is coming from the corrupt DOJ and liberal fake news media.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "OrderofCincinatus",
        "time": "2 September, 2022",
        "context": "Hillary Clinton, Bill Clinton, GWBush, Barack Hussein Bin Laden (36 MILLION documents, stored in a furniture warehouse in Chicago).   I bet old Jimmy Carter even has Top Secret documents amongst some of the documents he took from the White House.  Why doesn’t the media report how many top secret documents those men have in their possession? Why aren’t they asking about the documents other living presidents have in their possession?  And why is it okay for those presidents Hillary, and Comey, to have secret documents at all?",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "forrestgs",
        "time": "2 September, 2022",
        "context": "James \"Paid-off\" Comey refused to prosecute Hillary Clinton KNOWING she committed the exact same felony of keeping top secret classified documents on a NON-secure personal laptop, which were also found emailed to Weiner's wife's laptop and others who did not have any security clearance. Hillary later destroyed the laptop to cover the evidence.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "privatecityzen",
        "time": "2 September, 2022",
        "context": "How did he get them out to begin with? Did he load 33 boxes of documents into the escalade and just drive away with them? Isn't the escorted out by agents? Did he take one box at a time and secretly and without notice in the shadows, remove them to his home and if so why? If he was attempting to do something nefarious, wouldn't he have shredded them after copy and distribution?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "earthling66",
        "time": "2 September, 2022",
        "context": "Ya, Trump never gets looked at. Sewer must be high again.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "conservativesareright214",
        "time": "2 September, 2022",
        "context": "What a short, convenient loss of memory the liberal media has, or is it outright lying?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "larry876",
        "time": "2 September, 2022",
        "context": "I give as much credence to what the Atlantic prints as I do Mother Jones or the Rolling Stone. None.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "ricardosorentino",
        "time": "2 September, 2022",
        "context": "\"If it were anyone else\" but former President Donald Trump who had mishandled sensitive documents, \"they would be prosecuted.\"\n\nTell me again why Hillary WASN’T prosecuted for far more document and email security breeches, even after destroying evidence she had previously been told to preserve and turn over? Liberal media is surprised on why they are referred to as ‘fake news’?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Jorah.Mormont",
        "time": "2 September, 2022",
        "context": "Hmmm so Trump is already guilty. Heard this story a thousand times.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Wempy",
        "time": "2 September, 2022",
        "context": "Hillary's email server was hacked... but NO damage assessment was requested??  I know, she didn't mean to. 😢",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "girlscout1",
        "time": "2 September, 2022",
        "context": "Hillary worked hard to protect our national security interests?  \nHow did Benghazi happen?",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "freesouthafrica",
        "time": "2 September, 2022",
        "context": "BIDEN FOR FENTANYL",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "billtell391",
        "time": "2 September, 2022",
        "context": "President Trump declassified those documents, and they were nothing. There was nothing in those documents that needed classified status anyway.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "foxgood",
        "time": "2 September, 2022",
        "context": "Democrats are sick and obviously lacking any conscience, they will do or say anything to promote their narrative.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "christian478",
        "time": "2 September, 2022",
        "context": "I would be willing to bet every former president took classified documents when they left office.",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "freesouthafrica",
        "time": "2 September, 2022",
        "context": "BIDEN FOR CRIMINALS",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Dilligaf-666",
        "time": "2 September, 2022",
        "context": "How do they know that President Trump possessed \"classified documents\"??",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rocketman91",
        "time": "2 September, 2022",
        "context": "Uh, the FBI said classified information got onto Hillary's email server.  She wasn't prosecuted.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "maxx1676263",
        "time": "2 September, 2022",
        "context": "Hillary Clinton was hacking classified White House computers--after she lost to Trump--while holding no official US Government position. This being the second time as she was caught with an unprotected classified computer at her home address said to have been breached by no less than 3 foreign enemies. Then she proceeded to destroy subpoenaed Emails, phones, computers and laptops.\n Bleaching over 30,000 emails and having her assistants smashing hard drives AFTER the subpoena was already issued and still able to rub it in everyone`s face? \nIt must be great to OWN the FBI,,CIA,,DOJ and the IRS.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "freesouthafrica",
        "time": "2 September, 2022",
        "context": "Why is Hillary Clinton not in Prison already   ?\n\nBecause of corrupt DEMOCRATS",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "criticalthinking919",
        "time": "2 September, 2022",
        "context": "What did these \"secret\" documents pertain to?   Not Nuclear secrets the Rag Dims have pushed.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "PeterLong",
        "time": "2 September, 2022",
        "context": "Wow, it doesn't get any more partisan than to call black white, night day. Once upon a time, The Atlantic was a respected magazine.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "criticalthinking919",
        "time": "2 September, 2022",
        "context": "Isn't part of the Kennedy assassination still \"secret\"?  LOL",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "markk.",
        "time": "2 September, 2022",
        "context": "The democrats, in conjunction with the American deep state, are trying to change this nation from a free republic into a socialist democracy. From there, they will push us towards an outright communist dictatorship. This is evident. They proclaim that whoever disagrees with them is an \"enemy of the state\" and all the while accuse true patriots of being a fifth column. This is no longer about political disagreements. This is now about the soul of the nation. Obama promised \"change you can believe in\", and I urge you all to believe what he said.",
        "good": "9",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "freesouthafrica",
        "time": "2 September, 2022",
        "context": "MANDELA'S REAL LEGACY \n\nFamily heartbroken after kidnapped boy's mutilated body found in veld\n2h agoNtwaagae Seleka\n\nNews24 SA",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "civilwarisinevitablenow",
        "time": "2 September, 2022",
        "context": "Simply not true and proven not true.  Sandy Berger removed documents from the Whitehouse and Library of Congress and then destroyed them.  He got a stern talking to.  Sandy Berger was not a President.  Not even close.  I am tired of the CONSTANT nonstop lies from Democrats.  They cant open their mouths without lying.  This is a nonstop witch hunt for political attack alone.",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "baronhydron",
        "time": "2 September, 2022",
        "context": "The president declassified all those documents so this is all pure political nonsense during a midterm election, Trump had a top secret clearance and he declassified those previously stamped classified material about which we know almost nothing.",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "hat.meister",
        "time": "2 September, 2022",
        "context": "This is such a smooth and chilled out way that fox is throwing Qrange man under the bus. They want nothing to do with Qrange, but they can't just write him off because even though fox is not an American owned corporation, most of their handouts from red politicians originate here. Still, it's funny seeing Qrange go down.",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "jcschulle",
        "time": "2 September, 2022",
        "context": "The big difference is intent. What did Hillary Clinton intended to do with the digital documents she allegedly possessed in her computer, and what did Trump intend to do with the actual paper documents he possessed in his mansion? Did Hillary want to sell those documents to the highest bidder? Did Trump want to either sell the documents or try to use them as a way of either blackmailing or getting back at people that he hated? I propose that Trump's reason for keeping these documents was nefarious in nature. His narcissistic and egocentric personality pushes him in ways that are never for the good of the country but for his own purposes of self aggrandizement.",
        "good": "2",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "dannymax",
        "time": "2 September, 2022",
        "context": "Comparing Clinton's way of handling her situation...pouring bleach on her electronics and smashing them with a hammer to Trumps situation...most likely not even aware what was in those boxes, AND the fact that he is a previous POTUS (which certainly ranks him far above an ex SOS) is like comparing Atilla The Hun to a shoplifter!",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "childofthe70s",
        "time": "2 September, 2022",
        "context": "she kept the docs on an unsecure server that any good hacker or even someone who isn't so computer savvy could have gotten to them, but because they could not prove \"clearly intentional and willful mishandling of classified information.\" she skated.  well yeah that's ok but to keep docs that you claim (not proven yet) were the same were kept in a locked room in a building that is more secure that the average bank is somehow worse, and he should be prosecuted and jailed? PAALEASE!\nthe one thing missing in this whole thing are \"FACTS\"!!",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jjsbriglia",
        "time": "2 September, 2022",
        "context": "Like Hillary said when asked about papers & server what is the big deal !!!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "gm1974",
        "time": "2 September, 2022",
        "context": "The Atlantic staff writer Adam Serwer declared on Wednesday \"if it were anyone else\" but former President Donald Trump who had mishandled sensitive documents, \"they would be prosecuted.\"   Well well mr. sewer, I guess your political bias seems to forget good old hilary who had quite a few top secret emails, but comey said that No \"reasonable prosecutor\"  would prosecute her.",
        "good": "22",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "frankb137",
        "time": "2 September, 2022",
        "context": "I totally agree if it was anyone but a former president they should be prosecuted, Hillary isn't a former president, Trump is.  So according to this clowns argument Hillary should be prosecuted?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "threedogs",
        "time": "2 September, 2022",
        "context": "Remember when Bill Clinton was found to have presidential documents in his sock drawer?",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "9mmCure",
        "time": "2 September, 2022",
        "context": "\"\"It is illegal to ‘knowingly’ remove ‘such documents or materials without authority and with the intent to retain such documents or materials at an unauthorized location.’\"\n\nTwo words: \"Hillary Clinton\".",
        "good": "36",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "MTLJACKET",
        "time": "2 September, 2022",
        "context": "When the FBI gives Secretary Clinton and gang a free pass and then the FBI gives President Trump an investigation . . . it should raise some eyebrows / really question what is happening on both party sides.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "valuecreator2",
        "time": "2 September, 2022",
        "context": "Embarrassing tripe...",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "soreloser433",
        "time": "2 September, 2022",
        "context": "No law should apply for \"the god\"\nHe said he could shoot someone in the 5th Avenue and [these people here] will still vote for him",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "yaGetWhatYouVoteFor",
        "time": "2 September, 2022",
        "context": "Anyone else wouldn't be the President packing to leave ... so yes, they would be prosecuted because they should never have had access.\n\nRead Article 2 of the Constitution.  You think the president isn't special; that article spells out otherwise.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mea1222",
        "time": "2 September, 2022",
        "context": "Sid Blumenthal was in neck deep in Libya and in direct communication with Hillary. That's why Hillary kept classified confidential info in her personal possession, she must've been sharing it with Sid.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "frommakassar",
        "time": "2 September, 2022",
        "context": "And one thing's for sure: Those Communists never care about the average American worker.  Mr Trump most innocently readies papers to clog the sanitary system at Mar-A-Lago so Joe the Plumber can have a job, and all they know is to cry 'treason'!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "patsfor6",
        "time": "2 September, 2022",
        "context": "Bottom line he illegally took documents, then lied about it, lied about returning them and is still trying to cover it up.  Obstruction at best, treason at worst.  Lock him up!",
        "good": "3",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "MrsSmith67",
        "time": "2 September, 2022",
        "context": "The FBI should be investigated for evidence tampering by removing the files from their boxes and strewing them across the floor for the sole purpose to take a picture for the purpose of posting on the internet.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "threedogs",
        "time": "2 September, 2022",
        "context": "Remember Sandy Berger, Clinton acolyte who shoved National Archive documents into his socks and pants to try to cover for the Clinton crimes?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "democratcrusher260",
        "time": "2 September, 2022",
        "context": "Hey Atlantic…Hillary Clinton wasn’t prosecuted for possessing classified materials",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "notstupid72",
        "time": "2 September, 2022",
        "context": "so all he has to do is destroy the docs and he will be okay like HILLARY CLINTON RIGHT ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jeffh987",
        "time": "2 September, 2022",
        "context": "Seems the liberal media is forced to keep Trump at the top of their agenda in order to make news and ratings. On the other hand, they are forced to keep Hillary in the news in order to keep her relevant.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jjsbriglia",
        "time": "2 September, 2022",
        "context": "Where are Obama's papers that he claimed were being digitized & why are Joe Biden's papers being stored in a Delaware school where China is a big donor &  anyone can get to them what is he hiding???",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ezp334",
        "time": "2 September, 2022",
        "context": "The last 3 presidents have left the White House with classified documents and nothing was ever said an none were ever charged! Hillary ripped off a server and computers loaded with top secret documents and she wasn’t prosecuted. Obama had his attorney general meet with bill Clinton on a crowded airport runway to assure him that they would coverup Hillary’s crimes so no one could tape their conspiracy conversations. Nothing from the press on that treasonous criminal coverup!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "pumpintrump",
        "time": "2 September, 2022",
        "context": "How DARE Fox say that Trump is no better that Hillary.  I guess Fox thinks we should lock them both up.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "redcone",
        "time": "2 September, 2022",
        "context": "The only reason he was raided is political.  Dems are still trying to find something that will stick to him to disqualify him from future presidential races.  They Spied on him during last campaign, they impeached over a lie initiated by his opponent and the DNC backed by the DOJ, they attacked publicly shamed anyone that supported him.  The list goes on.  To think that only DT would not be investigated for documents is absurd.  Look at Hillary, look at Joe and his son Hunter, look at Pelosi and her husband Paul all have been given a freeeeeeeee passsssss to serious evidence that warrant investigations.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jacksone",
        "time": "2 September, 2022",
        "context": "Emails were subpoenaed by the Congress, after which Hillary Clinton destroyed them, rather than turn them over. That’s a crime.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "al42929",
        "time": "2 September, 2022",
        "context": "Adam Serwer has a memory problem. Must have dementia like Joey.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rolltide#1",
        "time": "2 September, 2022",
        "context": "DOJ and FBI employees lied to social media companies about Hunters laptop. To FISA courts I could go on forever with examples. The point is I'd believe a snake trying to feed me an apple over our government.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ajb50",
        "time": "2 September, 2022",
        "context": "A fundamental difference is that Trump was president and possessed the broad authority to declassify the information.  Hillary did not have that authority and she knowingly kept and transmitted it on an insecure server where an adversary would not even need to be in physical contact with the information to take it.",
        "good": "44",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "newshound834",
        "time": "2 September, 2022",
        "context": "Just like Hilary was?  Oops, I forgot!!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dazedandbemused",
        "time": "2 September, 2022",
        "context": "Hillary Guilty, got a pass. Trump Not Guilty get the full force of the DOJ and FBI! NO bias here.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "chjanedoe443",
        "time": "2 September, 2022",
        "context": "If it were anyone else, it would either be brushed aside or hidden as much as possible - like Hillary.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "schiffhead",
        "time": "2 September, 2022",
        "context": "This is just another 'Russia Gate' - completely ridiculous, 'Trumped-up' falsehoods.",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "teapartyexpress",
        "time": "2 September, 2022",
        "context": "Not only did Hillary have highly classified documents on her unsecure server at home, she knowingly destroyed phones and hard drives that was subpoenaed! But then... What difference does it make?",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "otcannon1",
        "time": "2 September, 2022",
        "context": "They keep showing that same picture of the documents, but no one can validate where it was taken.  ...except the person who took it!  hmm....  Nothing shady there.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "teemail",
        "time": "2 September, 2022",
        "context": "If you don't want to reference Clinton's past actions how about referencing Obama's past and current actions? Why is no one talking about the 33 million docs he took for his Lie-Barry? When asked for them back he basically told the archive folks he would give them back when he was ready to.",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "vet69",
        "time": "2 September, 2022",
        "context": "Did other presidents removed documents when they left - yes. Did they give them back when ask - yes. Did trump remove documents when he left -yes. Did he he give them back when asked - no.",
        "good": "2",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "PurplePin",
        "time": "2 September, 2022",
        "context": "Atlantic magazine had endorsed Trump in 2016 and 2020. Now they want want him prosecuted. Oh wait…. Am I becoming just as demented as 10% Joe?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "4dembos",
        "time": "2 September, 2022",
        "context": "Hillary destroyed evidence and they are looking for evidence not hidden by Trump. This is what you call left-wing hypocrisy. Accuse others of doing the same as they do.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "checkingnewsofday",
        "time": "2 September, 2022",
        "context": "Well duh none of us were the president either.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tacticaldave",
        "time": "2 September, 2022",
        "context": "Who knew that a cabinet-level officer is entitled to more prosecutorial discretion that the President?  At least an adversary would have to physically go to Mar-A-Lago to gain access to the documents.  The Chinese could steal whatever they wanted from Hillary's unsecured server with a few keystrokes from the other side of the planet.",
        "good": "20",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "lester719",
        "time": "2 September, 2022",
        "context": "Unfortunately, Clinton was not president, ever (thank God) and she was not entitle to have such documents in her possession, FBI and DOJset precedent when they didn't touch her....",
        "good": "19",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "lovegodncountry",
        "time": "2 September, 2022",
        "context": "obama had how many tapes that he took with him without anyone to review them. kept them in a drawer, just saying",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "govtgetout",
        "time": "2 September, 2022",
        "context": "To be clear, the photo shared by the FBI showing “classified documents “ DOES NOT show classified documents. It shows document covers/ jackets that say “classified, secret, top secret etc...no proof that there are ANY classified documents in that photo!",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "upnorth1201",
        "time": "2 September, 2022",
        "context": "The funniest part of this deflection is that MAGAs wanted Hillary in JAIL for her misuse of documents. But jailtime aside, can't even admit Trump was wrong to take the documents. Yet they want to talk hypocrisy?  \n\nFor MAGA's its not that Trump was wrong too and nobody should be charged. Its Trump is completely innocent, but also look at what Hillary did. You guys are funny.",
        "good": "1",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "PurplePin",
        "time": "2 September, 2022",
        "context": "Oh no! If it wasn’t for these documents the Atlantic magazine would be endorsing Trump for 2024  - based on the 40 year high inflation, record amount of fentanyl brought into our country by millions of illegals and 10% Big guy’s China corruption.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "edara",
        "time": "2 September, 2022",
        "context": "President Roosevelt's \"Four Freedoms\":\n\nFREEDOM of SPEECH\nFREEDOM of WORSHIP\nFREEDOM from WANT\nFREEDOM from FEAR",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "billinmd619",
        "time": "2 September, 2022",
        "context": "Mrs. Clinton was the Secretary of State trying to schedule a meeting with the Pentagon to discuss getting a seat at the table to consider drone strikes. The fact of drone strikes was (and may still be) Top Secret, even though they are regularly shown on TV. Her documents were not marked \"Classified.\" This was investigated, and Trump's own people have had access to the details. As Comey, who wrecked her bid for the presidency, said, \"No prosecutor would bring this case.\"\n\nTrump? What is his business with Top Secret documents in his desk? He is a private citizen.",
        "good": "1",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "PopeyeWasaRollingStone",
        "time": "2 September, 2022",
        "context": "How many excuses are people going to make for this guy? And why would you?",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "lovegodncountry",
        "time": "2 September, 2022",
        "context": "hillary distroyed phones, computers so she could hide the facts that she made up the false accusations about russia. she was the one that ordered the fake dossier.",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "ssummons",
        "time": "2 September, 2022",
        "context": "Hillary Clinton was never a POTUS. If someone could make it clarify the limits of a POTUS authority to declassify, or even just that there are limits, then this is a shorter conversation.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "blueisthenewblack",
        "time": "2 September, 2022",
        "context": "pelosi and joe \"squinty\" biden don't really care if there is a \"prosecution\" of Pres. Trump, they just wanna keep slinging the mud at him for the midterms and 2024, that's the real goal of all this Jan. 6 hearing BS and FBI search warrants.....  Want to see it stop?  Vote straight republican in Nov. and in 2024.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "wilmafingerdu",
        "time": "2 September, 2022",
        "context": "I long for the day when socialist, \"progressive\", democrat party becomes a mere footnote in history!",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "biggun90",
        "time": "2 September, 2022",
        "context": "it almost seems like it's us against them...",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "CavalryScout57",
        "time": "2 September, 2022",
        "context": "Mr. Serwer is a lot like many on the left, he loves to comment on issues about which he knows NOTHING. \n\nHe says   \"It is illegal to ‘knowingly’ remove ‘such documents or materials without authority and with the intent to retain such documents or materials at an unauthorized location.’ The photograph of documents emblazoned secret removes any ambiguity as to whether Trump was in possession of classified documents. If it were anyone else, they would be prosecuted,\"\n\n\"It is illegal to ‘knowingly’ remove ‘such documents or materials without authority...\"  Trump Was the authority at the time these items were removed.\n\n\"with the intent to retain such documents or materials at an unauthorized location.\"  Sorry, but the DOJ had reviewed the location, suggested a better lock, which Trump provided, and the items were under guard by the Secret Service.   \n\n\"The photograph of documents emblazoned secret removes any ambiguity as to whether Trump was in possession of classified documents.\"  Sorry again Mr. Serwer, but I have SF 703s, 704s, and 705s around the house here, mementos of my time as a Security and Intel NCO in the Army.  Again you got nothing.\n\nWhat he apparently does not know, is that the President has full authority to declassify anything he wants, and the the SF 703 (Top Secret), SF 704 (Secret), SF 705 (Confidential), does not mean much once the items are declassified.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dbh12768",
        "time": "2 September, 2022",
        "context": "Ahh but it is alright to keep documents on a server in your basement. When told you have to turn over the server and your gov't cellphones. You can wipe the server clean and smash the cellphones.  I hope people begin to understand that the law for Trump are enforced different compared to other politicians on the left.",
        "good": "39",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "fortytwo",
        "time": "2 September, 2022",
        "context": "Except for Hillary, who was merely \"careless!\"",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "B.G.",
        "time": "2 September, 2022",
        "context": "So any trained seal can publish in a magazine now... good to know, for all of those Libs refusing to work these days. 🤦‍♀️",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "preston622",
        "time": "2 September, 2022",
        "context": "How many times did the DOJ/FBI say they did  not know where it was when asked the location of the Hunter Biden hard drive?",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "YoSemite652",
        "time": "2 September, 2022",
        "context": "Prosecution for a misdemeanor is a lot different than for a felony. Hillary would have been looking at a $1500 fine and a stern talking to.  Trump changed the law and then broke it... committing a felony.",
        "good": "0",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "FutTheWuk002",
        "time": "2 September, 2022",
        "context": "You mean like Hillary... WHOOPS!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "moltenart815",
        "time": "2 September, 2022",
        "context": "First of all, if you believe that President Trump personally packed those boxes while leaving the Whitehouse, you're delusional. By the way, when is Sleepy Joe going to go visit the U.S./ Mexican border???????",
        "good": "7",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "RonGod666",
        "time": "2 September, 2022",
        "context": "\" \"If It Were Anyone Else, They’d Be Prosecuted.\" \"  Which is what I believe Comey said about Clinton.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "pwd2018",
        "time": "2 September, 2022",
        "context": "President Trump had the power to declassify documents and used it to declassify those he took with him.   Documents are not relabled when they are declassifed so the pictures the FBI and DOJ staged are just  more Fake news.\n\nClinton had no such power to declassify...",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "kamsxckswillys",
        "time": "2 September, 2022",
        "context": "We might as well stop commenting.. TDS is so strong they will never see their own hypocrisy and double standards.  But, one was president with unchallegable declassification authority, the other was sec of state.  ( See ruling on judicial watch v press Clinton)",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "aviator792",
        "time": "2 September, 2022",
        "context": "The woke mind virus at work. It precludes rational thought.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "2l84all933",
        "time": "2 September, 2022",
        "context": "Clinton didn't have documents. She had emails threads on a personal server that were sent to her. Big difference.",
        "good": "0",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "lessgov123",
        "time": "2 September, 2022",
        "context": "Clinton worked hard at selling influence and making the Clintons richer!",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "bettertimesahead",
        "time": "2 September, 2022",
        "context": "If Biden, Clinton or Obama did what they claim Trump did, nothing would be said or done about them.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "darrellsdiggenindeep",
        "time": "2 September, 2022",
        "context": "Marian Santos ( Hillarys foreign maid) alone should have sent Hillary straight to jail!",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "nocetverum",
        "time": "2 September, 2022",
        "context": "lock 'em all up in the same cell for 30+ years, they can compare notes",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "vetteacher326",
        "time": "2 September, 2022",
        "context": "If it were anyone else, except Hillary of course. She doesn't count. We actually know people died because of her disclosures.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "OrangePin",
        "time": "2 September, 2022",
        "context": "The Atlantic: \"A photo of the documents emblazened \"Secret\" removes any ambiguity.....\"\n-Except those are NOT photos of the documents, they are photos of folders, which have been confirmed to be mostly empty. Lol.....",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "LawBurger",
        "time": "2 September, 2022",
        "context": "As expected. A big fat nothing burger. The Biden administration will go down in history as the biggest joke ever. So will his department of justice. Time to get rid of the FBI. They are a useless organization, to say the least.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "nbf1861",
        "time": "2 September, 2022",
        "context": "Where’s this clown been for the last 7 yrs?",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "roger30353",
        "time": "2 September, 2022",
        "context": "The Atlantic article belongs in the national enquirer.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "maga-prez",
        "time": "2 September, 2022",
        "context": "I don't get it.  Trump stole top secret documents, admitted to it and everyone knows it.  If it were anyone else they'd be in jail by now.",
        "good": "2",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "Mr.BillK",
        "time": "2 September, 2022",
        "context": "Seems liberals love to ignore inconvenient truths. Teddy Kennedy know how to drive and Hillary never had a server. What a wonderful world it must be.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "poisonrose",
        "time": "2 September, 2022",
        "context": "They are Deathly afraid of Trump!\nNews for you Liberals, Every Dog has their day",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "siskiyoucountyjunior",
        "time": "2 September, 2022",
        "context": "If it was anyone besides Trump mishandling classified documents in a residence where he often hosts foreign (often from hostile nations), it would be Trump and his followers demanding they be prosecuted.\n\nAlso, that fat, draft dodging New York City liberal hasn't even been prosecuted",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "blazerswampthing293",
        "time": "2 September, 2022",
        "context": "It is really amazing how much the dems completely ignore reality to attack Trump.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "donnamckenzie",
        "time": "2 September, 2022",
        "context": "If it were anyone else....well I mean except for Hilary Clinton :)....they would be prosecuted.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "hounds",
        "time": "2 September, 2022",
        "context": "Who reads the Atlantic, and who cares what their opinions are.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "stepmiller",
        "time": "2 September, 2022",
        "context": "This is rather disingenuous, this request has nothing to do with classification or not, they are asking for an independent third party to decide what the DOJ can have and what they can't. So why would they even mention classification or not.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "fifthtenn",
        "time": "2 September, 2022",
        "context": "Yeah, who prosecuted Hillary for having classified documents on her laptop illegally and destroyed it?  Democrats always want to say the other party is doing what they are doing and lying about it.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "MrB759",
        "time": "2 September, 2022",
        "context": "John Brennan-that's enough for me !",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "uuzoo",
        "time": "2 September, 2022",
        "context": "Really? Why hasn't Hillary been prosecuted for all her crimes? Once again, a hypocrite.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "pac8",
        "time": "2 September, 2022",
        "context": "Non president Hillary knowingly used Bleach Brite & a Hammer \n\nCorrupt DC FBI keeps planting evidence on President Trump",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "63danny",
        "time": "2 September, 2022",
        "context": "Of course, obeying laws and the Constitution doesn't apply to the elitists.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "usampc",
        "time": "2 September, 2022",
        "context": "President Trump can keep any documents he wants. The President has the power to declassify what ever he wants to. These Democrat jokers are just throwing darts against the wall to see what sticks. Biden and the other criminals know that their days of getting away  with murder will be over if Trump is re-elected. He will pursue them like they have him. It will be glorious to watch.",
        "good": "3",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "veryoldcop202",
        "time": "2 September, 2022",
        "context": "Guess the courts will make the final decision on charges and the voters will make their decision known in Nov .",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "woody420034",
        "time": "2 September, 2022",
        "context": "Dude, it's called double standard.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "knighttemplar",
        "time": "2 September, 2022",
        "context": "The guy at the Atlantic is not Serwer….that’s a misspelling….it’s Sewer",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "brandonjohns",
        "time": "2 September, 2022",
        "context": "Adam Sewer, a sewer is where his articles belong.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "wolfman0802",
        "time": "2 September, 2022",
        "context": "Amazing how much Dems completely forget about their massive indiscretions that make Trump look like Mr. Rodgers...",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "J.KirkTiberius",
        "time": "2 September, 2022",
        "context": "The naive opinion piece by the Atlantic refuses to acknowledge one vitally important detail: Donald Trump was PRESIDENT OF THE UNITED STATES when he was in possession of said documents. All other members of the Executive Branch were absolutely beholden to him and they had zero authority except that which he delegated to them.\n\n\"Anyone else\" who would have been in possession of such documents absolutely would and should be prosecuted unless they were acting with explicit Executive authority. Donald Trump required no explicit executive authority because he embodied ALL Executive Authority: explicit, implicit, express, implied. \n\nThe intelligence apparatus and the Administrative State have no constitutional legitimacy. \n\nThe accusations being lodged against the 45th President of the United States are illegitimate and carry no weight of authority.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ConservativeRus",
        "time": "2 September, 2022",
        "context": "\"The photo of classified documents at Mar A Lago is clarifying in that we now know we are not really arguing about whether Trump broke the law but whether he should get away with it because he is Trump\" Couldn't have said it any better",
        "good": "2",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "repblicoftexas",
        "time": "2 September, 2022",
        "context": "Hilary was not/never President. Trump was. He had privilege's as president that she did not.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "dtree",
        "time": "2 September, 2022",
        "context": "[However, Serwer claimed that the Comey standard for Clinton no longer \napplied because of a law Trump signed that enhanced the punishment for \nmishandling classified documents.]\n\nGotta admit Trump kind of self-owned on that one.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "OleAbeLinc",
        "time": "2 September, 2022",
        "context": "If Trump had not taken all of those classified documents. We would not have the discussion. \nIf he lied about any other documents in his possession that’s obstruction of Justice. If anybody else does that they will get indicted. \nHe’s a regular American citizen with some privileges that are a part of when his contract expires. \nSo, he gets a pension, an expense account and security. \nNow, he’s subject to getting indicted because his place of residence is Mar A Lago. \nStop using childish excuses for the former most powerful person in the world. He needs a competent attorney who will not jeopardize their future to lie for him. Wanted Help Needed to handle legal matters for Trump for the rest of his life.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Leeving",
        "time": "3 September, 2022",
        "context": "Of course those idiots are going to support their own handling of Clinton's numerous crimes. Has the DOJ or FBI followed through on any of her obvious lies and corruption. Trumps been Impeached twice without committing an impeachable offense. And has been under investigation for the last 7 years while the Dems try to find anything close to criminal behavior. \n\nThe DOJ and FBI have even committed criminal offenses to help Clinton frame Trump of get him kicked out of office. They supported Clinton's Russia hoax for several years. They've lied about having evidence (in plain sight) and have spied on him and done everything they could to keep Trump from being successful. Is that why the Dems are mad at him? Because he was still able to get things done in-spite of the efforts of Dems against him?",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "StaffHerb",
        "time": "3 September, 2022",
        "context": "The difference is that he was the President of the U.S. and had full authority to declassify the documents.  Hillary did not.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "TripleYourTDSmeds",
        "time": "3 September, 2022",
        "context": "How about ONLY Trump would be tried and/or  convicted for this....",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "alupchuk",
        "time": "3 September, 2022",
        "context": "The fbi has full well demonstrated political bias for 6 years and has no place in America as a law enforcement organization. The fbi belongs in china or russia where the government attacks political opposition !",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "vulgarian256",
        "time": "3 September, 2022",
        "context": "Bombing a Children's \nhospital to own the libs... This is why you're losing. America is tired of this right to wing insanity. Even Alaska and Kansas reject your 'red wave' fascist agenda.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "OrderofCincinatus",
        "time": "3 September, 2022",
        "context": "Question: Barack Hussein Bin Laden took over 30 MILLION documents when he left the White House.   They are stored in an abandoned Furniture Warehouse in Chicago.  Out of 30 Million documents how many are top secret documents?   Who is guarding that warehouse?   Who has access to that building?   Do they have Level 2 Security clearances?  Why hasn’t the DOJ looked into the Obama Documents?   Or are they afraid that because he’s a black man they don’t want to cause a scene over 30 Million documents that may have US secrets embedded in them?  If the FBI found top secret documents from 13 boxes at Mara-Lago, what will they find at the Rooms to Go Furniture Warehouse?",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "xtdp555",
        "time": "3 September, 2022",
        "context": "Still no answer, what classified docs did Obama take  when he left office?  How many, and like Trump did he un-classify them.  Surely he took all the docs on Fast-n-Furious to protect his minions that refused to testify before Congress.",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "yukon76928",
        "time": "2 September, 2022",
        "context": "I guess he forgot about HClinton, Obama, GBush jr, BClinton,and the many others that have done exactly what Trump whaled done.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "vandriver",
        "time": "3 September, 2022",
        "context": "I can't stop laughing.....  Hillary should be in jail for compromising classified document using a private server (which excluded from the government backup servers) for official Secretary of State business. Obama and Bill both took massive numbers of classified documents with them when they left the White House. (Common knowledge in circles that handle highly classified material.) I don't hear anything about them being investigated. Only President Trump. Someone the Democrats failed to scandal embarrass out of running. Someone Democrats failed impeach. Twice. Someone Democrats (I include Chaney as one) failed to 'convict' in the 6 January hearings. The attacks just keep on coming because Democrats are afraid of Trump. Why? Because his goals empower Americans to do for themselves without being dependent upon the government.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "nononsense589",
        "time": "3 September, 2022",
        "context": "Yep, truth! Hillary and all the dems get away with so many crimes and they Are untouchable.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Nauticus97",
        "time": "3 September, 2022",
        "context": "Sure thing Adam Sewer.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "SqualidFavelaLeftist",
        "time": "2 September, 2022",
        "context": "If Cankle The Hut wasn't proscecuted why should anyone else be?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "papap719",
        "time": "2 September, 2022",
        "context": "Good thing this “writer” feels like an expert and can tell us commoners what to think…",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "socialismthedeathknelloffreedom",
        "time": "3 September, 2022",
        "context": "A double standard and libs try justifying it, ho hum.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "donnamckenzie",
        "time": "3 September, 2022",
        "context": "Witch Hunt 102",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "snowflakebrad",
        "time": "3 September, 2022",
        "context": "Are we just going to ignore the fact that Trump got a huge polling boost on election eve when Comey reopened the Clinton investigation (and found nothing)?  Any political analyst would acknowledge Trump would have lost without Comey's help.  \n\nMeanwhile, Trump hasn't been charged either.  He's been searched, because after he lied, and lied again, that was the only way the FBI (led by his own appointed FBI director!) could get the documents back.  And he won't be charged, only because everyone's afraid of what his whack-job supporters might do.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Mr.PaulKersey",
        "time": "3 September, 2022",
        "context": "Every ex presidents has a scif, why would they need that if they didn’t have classified documents ????? \nThat tells u they do😂😂😂😢",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "shazza1425",
        "time": "3 September, 2022",
        "context": "If you think Clinton should be prosecuted, why not Trump. What aboutism is so lame.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "prisonfortheorangetraitor",
        "time": "3 September, 2022",
        "context": "Trump's FIXER Barr just destroyed every excuse Trump made for stealing those documents.   And John Bolton said he's not surprised at all that Trump stole those documents.  And he suggested they should look in other properties that Trump owns because they'll probably find stolen docs there too!",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "lg5599",
        "time": "3 September, 2022",
        "context": "I saw an interview by a Democrat Strategist that when asked if Trump will be indicted, said no way.  Hillary kept classified documents on a server that could be easily and probably was hacked into by China and Russia and had her maid, who didn't have any clearance, have access to the most secret classified material having her print it out.  Trump had documents that were protected in a locked room and guarded by 24 hours the secret service.  Plus, although not proven, Trump is saying that he declassified them, which although we may not like that, he has every right according to our laws.  There will never be trial, as liberals, like the FBI and DOJ, do not want the other side to give defensive testimony.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "mackeyall",
        "time": "3 September, 2022",
        "context": "I agree 100 % with this article's headline. Why because our leadership both republican and democrat are afraid of trump, mainly because his supporters are unpredictable. They monitor social media traffic, post here on fox and other news outlets. they know prosecute him and the maga maniacs might just start a war.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "aeroengr",
        "time": "3 September, 2022",
        "context": "Trump was the president.  As such he had the authority to declassify anything he wanted to.  Clinton never had that authority.  He took declassified documents that still had classification markings on it.  She ordered her staff to illegally remove the classification markings, scan the documents, and email them to an unsecure server.  He did nothing wrong.  She should be in prison.  If you believe otherwise, you are wrong.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "attiwkramz",
        "time": "2 September, 2022",
        "context": "Sew(r)er seems to have forgotten about Hillary's uninvestigated and unpunished misdeeds.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cchatel",
        "time": "3 September, 2022",
        "context": "If Donald is being investigated, it's because he thinks he's above the law and keeps breaking it. Russia did interfere with the 2016 election, Donald did ask the head of state of Ukraine to find dirt on his political opponent, he did ask an election official to \"find\" him the votes he needed, he did send a mob to the Capitol and he did bring boxes of classified documents to his home, illegally. He deserves the attention the justice system is giving him.",
        "good": "1",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "enormusrichard",
        "time": "3 September, 2022",
        "context": "The Atlantic is Pravda.  Basically a comic book of leftist propaganda.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Ltbear",
        "time": "3 September, 2022",
        "context": "Talk about selective reasoning…\nIf Trump broke the law he should pay. This requires evidence presented in a court where witnesses can be cross examined. Not selected information leaked to the left leaning msm.\nStandard Dem playbook.\nAs for Hillary….are you kidding me? Actually caught dead to rights and no consequences.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "daved63187",
        "time": "3 September, 2022",
        "context": "The photograph used to \"prove\" Trump possessed Secret and Top Secret documents was staged. The Secret and Top Secret document covers were paper clipped onto documents. One would think that Secret and Top Secret documents would have the covers permanently affixed (stapled) onto them.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dannyray1125",
        "time": "3 September, 2022",
        "context": "From the news reports I gather there were empty folders and framed Newsweek magazines, where’s the beef.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "whistler86553",
        "time": "3 September, 2022",
        "context": "It is ridiculous that Trump hasn’t been arrested yet. It just goes to show that laws are not applied evenly in the USA. One set of rules for billionaire ex-presidents and another set for the rest of us.",
        "good": "3",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "VotersRemorseonsteroids3.0",
        "time": "3 September, 2022",
        "context": "YEP! just like Hillary.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "centristinterest",
        "time": "3 September, 2022",
        "context": "Hillary was called to the carpet for storing secure documents on her personal server. She had to stand before a congressional review for over a year. In the end, the DOJ under Trump decided that she didn't break the law. However, where is the conservative chants to \"Lock Him Up!\" The rule of law is the rule of law.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "PurplePin",
        "time": "3 September, 2022",
        "context": "Dems = zero character, zero credibility, 100% corrupt, anti-America, anti-God",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "coasty50",
        "time": "3 September, 2022",
        "context": "People forget that during the Clinton Presidency no one had a security clearance for the entire first term and most of the second. Hillary wouldn't allow the staff to be cleared and refused herself. This came out when an FBI agent retired and nothing was done about it.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sammmmm",
        "time": "3 September, 2022",
        "context": "\"Serwer addressed comparisons to Clinton and dismissed them as Republican hype.\"\n\nOf course he did.\nAnything that addresses possible Dem wrong doing is dismissed by the majority of MSM as simply Republican hype, regardless of the basis or proof.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "bigroowa",
        "time": "3 September, 2022",
        "context": "Barak Obama left office with 30,000 pages of documents to cash in on an offer from Netflix to write his story and was not challenged, so lets talk about equal justice?",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "creativeweasel",
        "time": "3 September, 2022",
        "context": "Hillary's destruction of evidence wasn't a felony offense. It was a matter!",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Nam1971815",
        "time": "3 September, 2022",
        "context": "This is what happens when justice is not equal. Let the facts come out first, all of the facts not the dribble of leaks.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "wellsley",
        "time": "3 September, 2022",
        "context": "Donald trump was destroying classified records in his office at mara Lago.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "wellsley",
        "time": "3 September, 2022",
        "context": "But her emails: In an inventory from the Justice Department unsealed by a judge Friday, the government detailed that interspersed with Trump’s personal belongings were 48 empty folders with classified banners as well as another 42 empty folders that were labeled “return to staff secretary/military aide,” according to the filing.\n\n\nThe majority were found in Trump’s office, rather than the storage room at Mar-a-Lago.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cchatel",
        "time": "3 September, 2022",
        "context": "I trust the FBI and the justice system. I don't believe a word out of Trump's mouth.",
        "good": "1",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "freedomof76",
        "time": "3 September, 2022",
        "context": "LOL Hillary never stole documents like Little Donnie the one term loser did.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "shazza1425",
        "time": "3 September, 2022",
        "context": "At the time, Clinton was Secretary of State with top level security clearance, Trump was an ex-president with no security clearance. What exactly do you think Trump intended to do with hundreds of pages of classified documents.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "musashi1953",
        "time": "3 September, 2022",
        "context": "The photo was of document COVERS no documents were in them.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Disillusioned759",
        "time": "3 September, 2022",
        "context": "I still don't get it. What was his reason to take classified documents with him? And if he did by mistake then what was objection to return these documents? Is he trying to hide something? If so what is it? The whole thing looks so childish to me.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "-politiceon-",
        "time": "3 September, 2022",
        "context": "It's NOT \"anyone else\"... it was the PRESIDENT who DECLASSIFIED those documents and then took with him, and that is HIS right! The American President has TOTAL authority to declassify documents, without any process, without any permission from anyone, by just saying the words. And that's exactly what Trump did, he declassified all the documents that he took with him from the White House. The raid on his home was ENTIRELY UNJUSTIFIED.\nHillary Clinton committed a crime, she was not President, she did NOT have any opportunity to declassify those emails, and she used an UNSECURED email server that was in fact hacked by foreign governments including China and Russia. She ACTUALLY compromised classified and top secret information. It's a completely different matter. When she received a subpoena for those 30.000 emails, she not only deleted them and used bleachbit on her server, she also had her mobile phones and laptops destroyed with a hammer. So, there was absolutely no question about \"intent\"... you don't do that stuff accidentally.\nAs Comey admitted, Hillary was guilty, but he somehow absurdly concluded that no \"reasonable prosecutor\" would indict her... which was of course wrong, many were ready. She got off the hook, in large part thanks to Trump-hater and top FBI agent Peter Strzok(who promised to \"stop\" Trump), who took the FBI plans to charge her for \"gross negligence\"(a defined crime) and changed the wording to \"extremely careless\"(not a defined crime).",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "aeliusgalenus",
        "time": "3 September, 2022",
        "context": "Trump cost China over $500 billion (pre-Bidenflation $).  Beijing's orders to Xiden are clear:  use all resources at your disposal to harass and otherwise disable Trump from entering the White House again.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "myrightsoutweighyouremotions",
        "time": "3 September, 2022",
        "context": "Meanwhile in real news, the US economy is still on course for a recession with the Fed planning another major hike next week…. Biden’s economy is killing it, or should I say us!!! Oh, and let’s not forget that the US Treasury is  refusing to release Hunters docs, because Dems aren’t demanding them only Republicans!! Smoke and mirrors, smoke and mirrors",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "eraser",
        "time": "3 September, 2022",
        "context": "Clinton torched her garage to get rid of evidence",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Overthecliff...",
        "time": "3 September, 2022",
        "context": "Declassified by then-president Trump or empty folders - neither of which is a crime to possess (BTW - I could assemble twenty or thirty Secret and Top Secret folders and spread them over my floor for a staged photo in about as long as it takes to type this comment...)",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mijefe1",
        "time": "3 September, 2022",
        "context": "Dayuuum? Who knew you could be hypocritical about being hypocritical when there looking in the mirror and seeing a hypocrite.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "offon495",
        "time": "3 September, 2022",
        "context": "If Trump Did Anything Out Of Line  They Would've Already Had Him In Shackles...\nHopefully, If He runs,,& Wins Again He Won't Be such A gentlemen As He Was with hillary & not Go After Her for Her Actions With russiagate,  80k emails blackberries and bleached computers destroyed after receiving subpoenas to save all those things for review",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Truth_Betold",
        "time": "3 September, 2022",
        "context": "Under Democrat you're prosecuted for just being a Republican.......\"welcome to our banana Republic...!!!",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "mccracker",
        "time": "3 September, 2022",
        "context": "The big difference, Trump was POTUS and could declassify all that info if he wanted. Hillary was only bureaucracy head and probably didn't even have clearance for all the intel she was selling.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mplunkett",
        "time": "3 September, 2022",
        "context": "If it were anyone else they would already be in the federal pen.\nOr worse.\nBut sure everybody picks on Trump, poor baby.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "grillmasterp",
        "time": "3 September, 2022",
        "context": "He broke no law. Trump de-classified it all as he can as president.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "pmorgan012156",
        "time": "3 September, 2022",
        "context": "The informant (aka-mole) probably planted the documents in question and therefore I don't see how the authorities can charge President Trump with anything but it looks like the Demo Party is going to do it anyway.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "grrey",
        "time": "3 September, 2022",
        "context": "Trump is holding Democrats sensitive information. Democrats want it back. Joe, Hillary, Nancy, etc. They don't want these out in public.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mortauxconservateurssansvaleur",
        "time": "3 September, 2022",
        "context": "Cons are anti-law enforcement and support their treasonous leader while crying about a \"stolen\" election.  They are anti-American. \n\nNo wonder all federal agencies tasked with protecting America have identified conservatives as the greatest threat to the well-being of our Nation.  Cry, cons, cry!",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "⭐𝗥𝗜𝗚𝗛𝗧⭐𝟰⭐𝗔𝗠𝗘𝗥𝗜𝗖𝗔⭐",
        "time": "3 September, 2022",
        "context": "Okay so Adam Serwer's comments highlight how completely detached from reality or devoid of honesty & integrity the left truly is. Does this guy really not know what Hillary did? Does he really not know that Obama left with over 3-MILLION documents & REFUSED to let them be reviewed, so no one knows what he took? Where is Corrupt Hillary & Shady Obama's raid & prosecution?",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "bennieblancofromcleveland",
        "time": "3 September, 2022",
        "context": "This reminds me that Hillary also came in several million votes AHEAD of Trump.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "northwestmike",
        "time": "3 September, 2022",
        "context": "Hillary Will Sell Any Thing She Can Get Her Hands On",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "offon495",
        "time": "3 September, 2022",
        "context": "i think we ALL KNOW If they would have even the smallest, infinitesimal sliver of evidence that Trump had done something wrong.....he'd Already be charged, in shackles, & then perp walked through the DC Capitol with pelosi and schumer holding the leash",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "mccracker",
        "time": "3 September, 2022",
        "context": "I want to see whats in these documents. I bet he grabbed proof of the Russiagate fiasco internal workings, along with some concrete proof of Democrat deepstate treason. I guess we will see.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "johnnyknows",
        "time": "3 September, 2022",
        "context": "Trump didn't go back to the White House and remove documents classified or \nunclassified. He left office and retained many items. As President he had the power to declassify even Top Secret documents anything he deemed fit. Now 18 months later \nthey want to re-litigate? If it's in Trumps possession and he claimed to have declassified\nthen the issue is moot. The real reason is the DOJ is trying to recover Crossfire Hurricane files.\nI remember that Trump made public statements about declassifying many documents.\nWhat needed to be done is to send someone to change all the markings on all of those files.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "schweisshund215",
        "time": "3 September, 2022",
        "context": "I am pretty sure I know what is going on. The DoJ now knows that Trump has the smoking gun evidence that the election was rigged. They do not want the American public to be aware of it, so they are going to try everything within their power to make sure these documents never see the light of day.  That is why they will not allow a neutral party to review them.",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "mwillytaylor",
        "time": "3 September, 2022",
        "context": "Hillary didn't have classified documents. Especially after her minions destroyed them",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mickeyflynn",
        "time": "3 September, 2022",
        "context": "So Trump fanboys will stick with their go to argument: Hillary did it.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "bigdave121",
        "time": "3 September, 2022",
        "context": "What Hillary did was far worse that what they are claiming Trump did.  I'm not saying that what Trump has done with these documents is ok, but there is clearly a double standard in how the FBI is treating Trump compared to Hillary.  The concept of equal treatment under the law has been thrown out the window and many of us no longer trust or respect the FBI or the DOJ.  They are clearly agents for the democrat party and not the Constitution of the United States.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "leftisnotright676",
        "time": "3 September, 2022",
        "context": "Yeah Brennan Hillary did everything perfectly. Go back to fantasy island",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "lksdallas",
        "time": "3 September, 2022",
        "context": "It's worse what Hillary did, she WAS NOT NOR WILL EVER BE PRESIDENT, the documents were on an unsecured server in an unsecured location.   De-classified or not, Trump was President and they were under secure lock.   He can declassify documents, Hillary cannot.   She's the one that should have been prosecuted.  However, Democrats can get away with murder.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "CommonCents$",
        "time": "3 September, 2022",
        "context": "The Atlantic staff writer Adam Serwer declared on Wednesday \"if it were anyone else\" but former President Donald Trump who had mishandled sensitive documents, \"they would be prosecuted.\"\n\nAdam Serwer clearly is biased.  Not well informed. But then again......that's todays \"\"professional journalism. Corrupt. There is a direct link between how Hillary Clinton handled (illegally) classified information.  Hillary had a file server in her residence full of \"\"digital\" classified info that officials highly believe was hacked. (not a well protected server at that) Trump had \"\"paper\"\" classified documents at his residence.  That \"\"facts\"\" are.... both public officials had classified information that should not have been at their homes. One person gets a free pass.  The other person gets nailed to the wall.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "chasrad1",
        "time": "3 September, 2022",
        "context": "Serwer is typical of the media. He doesn't have a clue and thinks that he can sell us swampland as waterfront property. The reality is that LOTS of former public officials left office with LOTS of classified documents in their possession. I can think of a couple former Directors of Central Intelligence and a couple congressmen that had been part of the House Permanent Subcommittee on Intelligence right off the top of my head. None of them were prosecuted and I think that is why Comey let Hillary slide. They took documents that were rightfully in their files when they had them stored in appropriate office cabinets. They kept them when they left office because they wanted them for reference should they ever decide to write a book. They never gave the classification angle a thought. I suspect that the Trump situation is similar except that Garland hates Trump and associates Trump backers with keeping him off the Supreme Court. So he is out to get Trump if there is any way he can figure out how to do it.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "oldctanky",
        "time": "3 September, 2022",
        "context": "Depends on if they are a former president or not, how they would be treated. That's why they wrote the Presidential Records Act",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "eagledown",
        "time": "4 September, 2022",
        "context": "If the left wants Trump in jail for wrong doing then so be it nut Hillary and others better already be in orange waiting for him",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rikemans",
        "time": "4 September, 2022",
        "context": "Trump was a president.  Hillary wasn't.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "CoachDMS",
        "time": "4 September, 2022",
        "context": "Just ask yourself, If a Democrat politician had top secret folders at their golf club/house, would you call for an investigation or say, hey they can do what they want?  We are a nation of Laws not men. Trump should not, under any circumstance had top secret documents after he was no longer the President.  That is quite simple.  He also, the great hypocrite signed a law that increased the penalty for mishandling secret documents, but it seems he broke that law.  By the way, the FBI is led by a man appointed by Trump.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "miketexan",
        "time": "4 September, 2022",
        "context": "Let's see. One person has an unsecured server, which could have been and likely was accessed by villain's, the other empty file folders marked \"top secret\" in a locked room in a house protected by the secret service. It is fun watching  these 'reporters' have to twist themselves into pretzels to concoct a story.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "waggledancer",
        "time": "4 September, 2022",
        "context": "I guess according to Democrats, hammering and destroying classified documents under subpoena, is not destroying classified documents.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Eloise849",
        "time": "4 September, 2022",
        "context": "When you have been stopped for speeding - hands up anyone who got off by saying \"look at him, he was speeding too\".",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "quitbeinganidiot",
        "time": "4 September, 2022",
        "context": "Trump at a rally after he won:\n\nCrowd: \"Lock her up!  Lock her up!\".\n\nTrump: \"Forget about it.  That was before the election, now we don't care.\"",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "milo123",
        "time": "4 September, 2022",
        "context": "Serwer forgets that Hillary smashed 2 cellphones, and erased 30,000 emails.  The DOJ shows a photo that could have been taken anywhere and say, look over here.  Serwer also forgets the track record the DOJ has with Trump.  The fake Russian hoax and the Obaama/Brandon administration caught spying on the Trump team.  Selective amnesia runs deep in Serwer's cranium.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mudust",
        "time": "4 September, 2022",
        "context": "trrum should have gotten advise from Hillary how do destroy evidence",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tiredofit1228",
        "time": "4 September, 2022",
        "context": "Hillary had classified documents on an easily hacked into server. Trump supposedly had classified paper docs. You can't hack into paper docs. You can hack into electronic docs and in Hillary's case it happened.\nWhich is worse? Which was less secure?",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "quitbeinganidiot",
        "time": "4 September, 2022",
        "context": "All these words just to admit that Trump is guilty.",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "picker420379",
        "time": "4 September, 2022",
        "context": "I'm tired of Hillary. What difference, at this point, does she make?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "LeCharpentier",
        "time": "4 September, 2022",
        "context": "\"One of the first things we must do is to enforce all classification \nrules and to enforce all laws relating to the handling of classified \ninformation,\" Donald Trump in September 2016\n\nI guess he just forgot.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "markt57",
        "time": "4 September, 2022",
        "context": "Question of the day: What does the term \"Previously Classified Document\" mean?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "fathomsix364",
        "time": "4 September, 2022",
        "context": "Trying to point out the inherent and legal privileges that Trump had as President is \nfutile to impress upon intentionally deaf ears. \n\nThe treatment that Hillary was afforded by Comey and the FBI is miles apart from the \ntreatment leveled against Trump by Garland and the FBI. The democrat party owns \nthe FBI because the democrat party funds the FBI and keeps the FBI as its own\nprivate Gestapo. \n\nIn America, that shouldn't be so, but this is not the Land of the Free anymore. It's the burgeoning home of a red backdrop as a vicious and vindictive President vilifies half\nthe country in a hate filled diatribe that further divides the Nation.   It's plain, it's obvious,\nBiden is a war mongering president akin to a demagogue like Hitler.\n\n.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "fathomsix364",
        "time": "4 September, 2022",
        "context": "Reading the comments here illustrates the fundamental differences between democrats\nand republicans.  We will never agree because we have different values and different\nIQ's.  These differences will never be reconciled with words.  Nobody is listening and\nnobody wants to listen.   All this waiting around for the other side to see the light is a \nwaste of time.\n\n.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "conservative0419",
        "time": "4 September, 2022",
        "context": "Neither the FBI or DOJ has announced, one way or the other, if the classified documents they found had the standard stamp of \"Classified by ____________; Declassify on __________.\" That's an omission that could be construed as a lie. I'd love to know the answer to that.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "bubbalouie546",
        "time": "4 September, 2022",
        "context": "Leave it to a liberal to say prosecute Trump but not Clinton.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ronbro42",
        "time": "4 September, 2022",
        "context": "It's all rhetoric until the proper authorities decide what happened and proof about the so called \"classified documents\".  I smell a rat here and bottom line is, they must prove they were classified and he indeed brought them in.  I suspect it could be a setup on a grand scale with Trump being the fall guy.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Karleen",
        "time": "4 September, 2022",
        "context": "As POTUS, he had the power to declassify. Didn’t anyone go to school and learn?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "oldtimer548",
        "time": "4 September, 2022",
        "context": "So, Trump changed the law to make the punishment more explicit, then got caught in it?",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "redzonedog755",
        "time": "4 September, 2022",
        "context": "There is no doubt that the FBI is corrupt. So now what do we do?",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "CounterRev22",
        "time": "4 September, 2022",
        "context": "Let's do the prosecutions chronologically... First Hillary, then Obama...",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "MarkZistate",
        "time": "4 September, 2022",
        "context": "well, most people arent Presidents of America get attacked by Communist backed Democrats and Militarized arms of government like the IRS",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "americansupporter12345",
        "time": "4 September, 2022",
        "context": "Ignorance should be PAINFUL!The President can DECLASSIFY WHAT EVER HE CHOOSES,No cabinet member has said AUTHORITY...Hillary was NOT the President!",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "avatarofpan",
        "time": "4 September, 2022",
        "context": "I am glad to see that Republicans are coming to understand that blindly backing law enforcement is not the best policy. Perhaps it is time to hold them accountable for their actions and start demanding equal Justice under rational laws? Just asking.",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "r.w.b!!also460",
        "time": "4 September, 2022",
        "context": "Clinton \"worked tirelessly\" to protect national security. Yep, they were broke when Bill left the white house and when Hillary became secretary of state, they became multi-millionaires.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Lbeh",
        "time": "4 September, 2022",
        "context": "DJT may be indicted, but this story will pale to insignificance, because of the newly published peer-reviewed study out of Itajai demonstrating a 92% mortality rate reduction in COVID19 in regular ivermectin users. A study with tens of thousands of patients. Recall how the Leftist media said ivermectin was useless and all those families trying to beg hospitals to give ivermectin to their loved ones were pathetic. DJT was trying to get America to use inexpensive generic medications right from the start, but the Left stream media wanted to embarrass him by denouncing the efficacy of these medications. The truth leads a wretched life, but it never dies.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ArcticLatitude",
        "time": "3 September, 2022",
        "context": "Hillary did commit a crime and she should have been prosecuted.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "fathomsix364",
        "time": "4 September, 2022",
        "context": "Pointing out the inequities between how democrats and republicans are treated is\na joke because it's obvious but no one corrects it.  Democrats are allowed special \nprivileges and their friends in the courts allow it and condone the practice.\n\nEvery citizen saw how special Hillary was treated by Comey.  It was so blatant that\nit struck a nerve and made you wince in disgust.  It was like watching the O.J. Simpson\ntrial all over again: Obvious guilt, but incredible, biased treatment by a jury of \nSimpson's peers.  Same with Hillary.  Biden and Obama's FBI is also Hillary's, obviously.\n\n.\n\n.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "textuf",
        "time": "4 September, 2022",
        "context": "If DOJ intended to prosecute Trump they would have already done it…..this is all about desperate democRATS & the Midterms.",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "art2021",
        "time": "4 September, 2022",
        "context": "Adam Sewer? Perfect name for a sewer brain.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "plainfieldtanner",
        "time": "4 September, 2022",
        "context": "liberals can't tell the truth to save their lives",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "fathomsix364",
        "time": "4 September, 2022",
        "context": "Trying to point out the inherent privileges that Trump had as President is futile to\nimpress upon intentionally deaf ears.  The treatment that Hillary was afforded by\nComey and the FBI is miles apart from the treatment leveled against Trump by \nGarland and the FBI. \n\nThe democrat party owns the FBI because the democrat party funds the FBI and \nkeeps the FBI as its own private Gestapo.  In America, that shouldn't be, but this is \nnot the Land of the Free anymore.  It's the burgeoning home of a red backdrop as\na vicious and vindictive President vilifies half the country in a hate filled diatribe to \nthe Nation.\n\n.",
        "good": "1",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "textuf",
        "time": "4 September, 2022",
        "context": "TDS is incurable",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "clivee",
        "time": "4 September, 2022",
        "context": "Most Fortune 500 Companies have secure Data and Document systems where sensitive Company Financial and Intellectual property is secured and only people with certain clearance are allowed to view and and most certainly are not allowed to “take documents home” or even allowed to print them out. \n\nYes, the most powerful man in the world, the self described “Greatest Presidency”  the World has seen, had no systems in place and people just wondered in and out with documents and nuclear plans as if these were just newspaper clippings.\n\nEverything was just scattered on the floor, no secure hardcopy control and no formal methods utilised.\n\nDonnie could have accidentally given Kim, US plans for the Defence of Japan or South Korea and Donnie would not have even known this.\n\nOr the Gardener at Mar O Largo, using recycled paper for wrapping the Spring seedling in discovered that they contained Nato’s Policy in the Balkans.\n\nDonnie was and still is a danger to the Republic!\n\nChaos follows this guy around wherever he goes.\n\nHe is just so sloppy and undisciplined!\n\nJ Edgar Hoover would have loved to tap his phone and listen in!\n\nImagine giving the Nuclear Coded to this guy. \n\nRussia is lucky they are still around!\n\nBut then again, Hillary warned us all!",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "foxisgreatamericannews",
        "time": "4 September, 2022",
        "context": "When ever Dems accuse a republican for what they repeatedly do far more egregious with zero consequence I'd say it's laughable hypocrisy but in reality it's just really sad how corrupted the FBI DOJ and IRS have become under Dem leadership.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Geordie935",
        "time": "4 September, 2022",
        "context": "Dear Mr SEWER you just assumed Trump mishandled documents and it is an assumption. Get your head out your rear and TRY being an impartial “journalist” instead of an opinionated pratt",
        "good": "5",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "schweisshund215",
        "time": "3 September, 2022",
        "context": "No Republican has ever threatened my life, my job, or my family if I refused to take the Covid 19 experimental vaccine",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "georgemurphy479",
        "time": "4 September, 2022",
        "context": "Too bad Trump can't run against Crooked Hillary.   However I hope he gets to clean Biden's clock in 24.  Biden will be changing his diapers by then and drooling all over the teleprompters.    Bright days are coming my Conservative friends.  Work hard and stay on top of the crooked Dems and we will have our country back in 2024 with Ron DeSantis in the wings for another 8 years!!!!!",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "error": "error"
    },
    {
        "error": "error"
    }
]