[
    {
        "user_name": "Oly54",
        "time": "1 February, 2022",
        "context": "Not new NEWS, the American people knew it was a coverup. Just like Hunter and the Ukraine, and Tara Reid, Let’s Go Brandon.",
        "good": "20",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "Libsaresheepletoo",
        "time": "1 February, 2022",
        "context": "Fraudci stayed on to clean up his mess.",
        "good": "7",
        "bad": "0",
        "replies": [
            {
                "user_name": "evag",
                "time": "1 February, 2022",
                "context": "Fauci made a ton of money creating this monster and even more money now. He needs to stand trial immediately, tell us about the monster \"he\" created and how to end it!",
                "good": "3",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "politicalzoo",
        "time": "1 February, 2022",
        "context": "Trump was right... MSM coudn't allow that.\nHere we are.",
        "good": "6",
        "bad": "1",
        "replies": [
            {
                "user_name": "earthnative",
                "time": "1 February, 2022",
                "context": "With nearly 6 million deaths worldwide, and counting",
                "good": "4",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "aagar",
                "time": "1 February, 2022",
                "context": "When will American legal system quit facilitating and enabling MSM deliberate lies ?",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "captunderpants",
        "time": "1 February, 2022",
        "context": "It’s amazing that so many people fought so hard to cover up the truth yet the truth remains. It’s stands to reason that when it comes to the electoral process the lies run deeper; why wouldn’t they. ",
        "good": "10",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "VikingsMatter606",
        "time": "1 February, 2022",
        "context": "Science is a tool. One can't betray science, that would be impossible. The people behind the science has betrayed mankind namely China and the W.H.O. now our pres.",
        "good": "12",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "politicalzoo",
        "time": "1 February, 2022",
        "context": "heads need to roll and we need to make sure this never happens again after midterms",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "allwayscorrect373",
        "time": "1 February, 2022",
        "context": "The Democrats and China were working together and screwed up.",
        "good": "6",
        "bad": "0",
        "replies": [
            {
                "user_name": "geldissimo",
                "time": "1 February, 2022",
                "context": "Not just screwed up but unleashed a world-wide holocaust.",
                "good": "3",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "commentoftheday",
        "time": "1 February, 2022",
        "context": "Oh Boy! Can't wait for the Olympics. \n[sarc.]",
        "good": "4",
        "bad": "0",
        "replies": [
            {
                "user_name": "evag",
                "time": "1 February, 2022",
                "context": "Not watching and boycotting the sponsors. Wish there was a petition to sign to show how many Americans will also watch \"Not one minute\" of it. Anyone know of a petition to sign?",
                "good": "2",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "tazilon664",
        "time": "1 February, 2022",
        "context": "Money drives \"science\" today.  It is no longer science.  It is government funded propaganda.  Research the history of anthropogenic global warming research back in the early 90s when Al Gore was vigorously pushing the scam.  He flat out said those who didn't publish the results he wanted would be cut off from funding.  Research scientists quickly caught on as they saw some of their friends being defunded.",
        "good": "24",
        "bad": "2",
        "replies": [
            {
                "user_name": "nopenotme854",
                "time": "1 February, 2022",
                "context": "not new.\nthis is as old as humans first formed clans, then tribes, then nations.",
                "good": "3",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "unconservative",
                "time": "1 February, 2022",
                "context": "Keep hitting that pipe. It's great how you guys have an elaborate conspiracy theory for everything, yet you leave important details out like the fact that Donald Trump fired a whole department of people whose job it was to study and stop viruses around the world from reaching America. Wiping out this whole government department happened long before Covid was discovered or a 'lab leak' was ever possible and it's the whole reason America was caught with their pants down. Stop taking Fox's word for it and read something.",
                "good": "1",
                "bad": "6",
                "replies": [
                    {
                        "user_name": "rickyricardo",
                        "time": "2 February, 2022",
                        "context": "So you're saying our government would have saved us from the virus it created in a lab, if it was only bigger.  Riiiiiight.......",
                        "good": "1",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "sciencerocks",
                                "time": "2 February, 2022",
                                "context": "There was no virus created in a lab that is the least bit relevant to the Covid-19 pandemic. \n\nNot one.",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "sciencerocks",
                "time": "1 February, 2022",
                "context": "Do a Google Scholar search on anthropogenic global warming.\nNot a regular google search, but a 'Google scholar' search. You'll find thousands of peer-reviewed papers from around the world, quite independent of American funding.\nIn other words, you just lied.",
                "good": "0",
                "bad": "2",
                "replies": [
                    {
                        "user_name": "rickyricardo",
                        "time": "2 February, 2022",
                        "context": "The U.S. is increasing aid worldwide for the purpose of climate study.  Those governments are drinking the kool aid, and getting the message on climate, green projects, birth control, oil bad, solar good, you name it.  This is all liberal/green propaganda.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "sciencerocks",
                                "time": "2 February, 2022",
                                "context": "Lol. Nice try, but I don't share your paranoia. I just understand the science that goes WAY over your head.",
                                "good": "0",
                                "bad": "1",
                                "replies": []
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "texfever",
        "time": "1 February, 2022",
        "context": "Just like objective journalism, objective science is DEAD.",
        "good": "3",
        "bad": "2",
        "replies": [
            {
                "user_name": "geldissimo",
                "time": "1 February, 2022",
                "context": "Fauci lied...people died.",
                "good": "4",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "Cyclopsprime",
        "time": "1 February, 2022",
        "context": "Anyone who isn't brainwashed knew what happened.  Called it from the beginning.  Democrats are no longer Americans.  Act accordingly.",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "iamalreadytaken144",
        "time": "1 February, 2022",
        "context": "Treason",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jonar",
        "time": "1 February, 2022",
        "context": "My suggestion is simple, prove it wasn't a lab leak.",
        "good": "8",
        "bad": "0",
        "replies": [
            {
                "user_name": "5thgenpatriot",
                "time": "8 February, 2022",
                "context": "Post of the Day Award! 🇺🇸",
                "good": "1",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "oldreliable",
                "time": "6 March, 2022",
                "context": "If they were working on this stain of COVID then logically it was a lab leak.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "RobertLedford647",
        "time": "1 February, 2022",
        "context": "China 🇨🇳 OWES the World a Quadrillion Dollars in damages to the millions of victims — PAY UP CCP ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "strangeworldfox",
        "time": "1 February, 2022",
        "context": "\"When they show that science could create something so malicious, this is a very big obstacle for the scientific community because it actually proves that science can do something that could be very violent and wrong,\"\nPlease meet \"Little Boy\" and \"Fat Man\" - been there done that. So that argument holds no water now...",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "SeekHim",
        "time": "1 February, 2022",
        "context": "They seem to shut down any scientist or doctor that doesn't agree with their agenda or narrative and then promptly label them misinformation!",
        "good": "11",
        "bad": "3",
        "replies": [
            {
                "user_name": "beadgBass",
                "time": "2 February, 2022",
                "context": "The guy is a physicist, not a virologist or even a biologist, who admits he has no scientific backing for his claim.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "SeekHim",
                        "time": "2 February, 2022",
                        "context": "There are PLENTY of doctors and scientist that have been shut down or taken off social media for their expert analysis or observation because it didn't align with the narrative and agenda of the left.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "retired00z",
        "time": "1 February, 2022",
        "context": "You don't need to be a college educated \"Virologist\" to figure out where this virus came from??  Goes to show even \"esteemed scientist's\" can be silenced using threats, money and politics.  Another loss for society:  Integrity.",
        "good": "19",
        "bad": "3",
        "replies": [
            {
                "user_name": "sciencerocks",
                "time": "1 February, 2022",
                "context": "Maybe you DO need to be college educated to understand that virtually all of the scientific literature from around the world points to a zoonotic evolution of the coronavirus in the wild.",
                "good": "1",
                "bad": "6",
                "replies": [
                    {
                        "user_name": "retired00z",
                        "time": "2 February, 2022",
                        "context": "OH BALONEY and you know it.  Two (2) Virologists that questioned Dr. Fauci's assertions about the \"open market\" being the initial contamination point in emails did a complete 180 after receiving multi million dollar grants from the NIH.",
                        "good": "1",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "sciencerocks",
                                "time": "2 February, 2022",
                                "context": "There are scientists around the world who have come to the same conclusion of zoonotic origins, irrespective of NIH grants. And, frankly, I know how grants work, and I do not believe your lies about \"did a complete 180 after receiving multi million dollar grants from the NIH.\" That is just a stupid lie.",
                                "good": "0",
                                "bad": "1",
                                "replies": [
                                    {
                                        "user_name": "retired00z",
                                        "time": "2 February, 2022",
                                        "context": "You are a \"bold\" keyboard warrior calling me liar.  Something you wouldn't get away with face to face.  I suggest you read up on the various articles that have been published over the last several days.",
                                        "good": "1",
                                        "bad": "0",
                                        "replies": [
                                            {
                                                "user_name": "sciencerocks",
                                                "time": "2 February, 2022",
                                                "context": "I don't type anything I wouldn't say in person.",
                                                "good": "0",
                                                "bad": "1",
                                                "replies": []
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "error": "error"
    },
    {
        "user_name": "andewlongisland",
        "time": "1 February, 2022",
        "context": "That was the idea. Criminals aren't going to tell on themselves. ARE THEY!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jghoosier",
        "time": "1 February, 2022",
        "context": "Why would there be such a concerted effort to squash the possibility of a Wuhan Lab leak?? Take names of those who are doing that, chances are they all have something to hide!!",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jghoosier",
        "time": "1 February, 2022",
        "context": "To all those watching the Olympics:  China  is the Country that most likely murdered your family or friends.  Enjoy!!!",
        "good": "2",
        "bad": "0",
        "replies": [
            {
                "user_name": "evag",
                "time": "1 February, 2022",
                "context": "Absolutely not watching and encourage everyone from doing the same!",
                "good": "1",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "srqmom5",
                "time": "1 February, 2022",
                "context": "and why wouldn't they take this wonderful opportunity to spread more pain and suffering by spreading another virus via the Olympics?\nI am sorry for the athletes but we need leadership that will stand up to China and make them accountable. ",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "HappyWhiteMale",
        "time": "1 February, 2022",
        "context": "Once again we will find Trump was right and the Dems and Fauci lied.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jsmith001",
        "time": "1 February, 2022",
        "context": "WE KNOW IT CAME FROM A LAB!! The pathetic attempts by the left to cover it up confirmed that for us 2 years ago.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "kalvinotterton",
        "time": "1 February, 2022",
        "context": "Democrats put signs on their lawns saying \"We believe in SCIENCE!\" They should add \"…but only the SCIENCE allowed by Democrat politicians.\"",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "abe2006395",
        "time": "1 February, 2022",
        "context": "There is so much cover up on the subject of Covid",
        "good": "8",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "gregini",
        "time": "1 February, 2022",
        "context": "The world knows it came from the lab in Wuhan no doubt.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "13f82d",
        "time": "1 February, 2022",
        "context": "It was made doubly obvious when there was no pursuit of information regarding the wild bats that allegedly carried the transmissible virus. No reports of species or frequency of infection, or even the locations of infected populations. Pretty clear that all agencies knew from the start that there were no infected, wild bats.",
        "good": "21",
        "bad": "4",
        "replies": [
            {
                "user_name": "themexicelt009",
                "time": "1 February, 2022",
                "context": "Not quite correct. There is a whole cave with bats that carry coronaviruses including sars and sars-2. The issue is that they don't directly infect humans unless they first naturally mutate in an animal that can spread it to humans after it infects them and mutates to attack human cells. These evolutions are minor, and involve incremental changes to the spike protein, and the issue is that sars-cov-2 has a spike protein that is more complex and capable of compromising so many human cell types than it would be if it had merely two-hopped from a bat to a single animal transmitter to humans. And they have found no viable animal carrier, which is a huge hole in the 'naturally evolved' hypothesis. This is a virus that was definitely born in nature, but was intentionally manipulated to be more infectious to humans than it could ever naturally be.",
                "good": "10",
                "bad": "2",
                "replies": [
                    {
                        "user_name": "5thgenpatriot",
                        "time": "8 February, 2022",
                        "context": "I’m of the same opinion.",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "ABS500",
        "time": "1 February, 2022",
        "context": "Whenever you say something but the mainstream media, Facebook, twitter label you misinformation that means you know for sure what you say perfectly correct",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "NoMas2525",
        "time": "1 February, 2022",
        "context": "Of course they were ignored while Fauci and Biden, through layers of trusts, made millions on Pfizer stock. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "eyeswideopen1944",
        "time": "1 February, 2022",
        "context": "FAUCI'S MOST MEMORABLE ACHIEVEMENT --- HE KILLED MILLIONS ALL OVER THE WORLD through his unauthorized/banned experiments and unauthorized funding of same in WUHAN (& elsewhere)...(& he tried to cover it up !!!!!!!!!!!!!!!)",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "timetofish",
        "time": "1 February, 2022",
        "context": "When you go after a man that controls $50 billion in medical grants, don't expect the people who depend on those grants to help.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bradjohnson2",
        "time": "1 February, 2022",
        "context": "Ah, the misinformation of yesterday is today's truth.  But it served its purpose.  To quote Harry Reid, \"He didn't win did he?\"  Despicable.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dan3367",
        "time": "1 February, 2022",
        "context": "there is no reason to covid vaccinate anyone under the age of 20..... most in that age bracket die from the flu. not covid. ",
        "good": "9",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "goa✟lips",
        "time": "1 February, 2022",
        "context": "It's a pity that Biden shut down the churches, otherwise faith healers would have conquered the virus already.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dontdrinkdakoolaiddummy",
        "time": "1 February, 2022",
        "context": "It wasn’t leaked, it was released on schedule.",
        "good": "8",
        "bad": "2",
        "replies": [
            {
                "user_name": "evag",
                "time": "1 February, 2022",
                "context": "What you say is very thought-provoking. What schedule do the Dems have about this? Why leak the lab leak now, less than a week from the Olympics in Beijing? What other agenda does it serve?",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "Mjm98",
        "time": "1 February, 2022",
        "context": "When Trump called it the Cuba virus and the Wuhan virus, he was attacked and called a racist!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ConservativeView",
        "time": "1 February, 2022",
        "context": "If you listened to any talk radio show last year you already knew this.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "americafirstalwaysandforever845",
        "time": "1 February, 2022",
        "context": "The TRUTH ALWAYS COMES OUT... and when its clear what happened, and who COVERED IT UP, heads should roll, and bodies should be thrown in PRISON.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "GreenBottle",
        "time": "1 February, 2022",
        "context": "The only question I have on the subject is: Would it have made any difference in the virus spread, mutations, treatments or how the medical community treated the population? This is purely a political & criminal search for what happened, of little or no use to the medical business at hand.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "contagion1000",
        "time": "1 February, 2022",
        "context": "The Chinese claim the corona virus came from bats…the Chinese must have small peckers to have sex with bats!",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "ehbuggh369",
        "time": "1 February, 2022",
        "context": "Because the DemocRATs didn’t want to hear the truth….  \nLike everything thing they do…",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "horace123",
        "time": "1 February, 2022",
        "context": "That is all I have seen.  A massive betrayal of science.",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "Tenshi",
        "time": "1 February, 2022",
        "context": "Apparently COVID-19 was a Communist Chinese TEST to see how many people could get killed and affected, then find out what it would do to the World's economy.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "DownUnderKiwiRoo",
        "time": "1 February, 2022",
        "context": "The Wuhan lab was\nexperimenting with “gain of function” which is a fancy name for developing a nasty virus.  The most likely scenario is that they succeeded but had lax safety procedures.  Fauci discouraged this interpretation as it might fan “conspiracy theories” and thereby “discourage science”. But in fact it appears from the  Rand Paul questioning that Fauci had encouraged the experimentation all along, even to the point of positively advising grants.  Rebel News of Canada disproved the wet market theory, by very clever journalistic investigations.  While Trump Trump was in power, it was politically advantageous to accuse him of xenophobia, when he suggested any Chinese connection.",
        "good": "3",
        "bad": "0",
        "replies": [
            {
                "user_name": "lycopine",
                "time": "1 February, 2022",
                "context": "Rand is a quack and lying politician",
                "good": "0",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "slowburn856",
                        "time": "1 February, 2022",
                        "context": "Rand needs get his eyes checked.  He can't see the truth.",
                        "good": "1",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "lycopine",
                                "time": "1 February, 2022",
                                "context": "He wouldn't recognize truth if he saw it anyway...",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "goa✟lips",
                "time": "1 February, 2022",
                "context": "Oh yes, those top scientists at Rebel News.  Color me impressed.",
                "good": "0",
                "bad": "1",
                "replies": []
            },
            {
                "user_name": "oldreliable",
                "time": "6 March, 2022",
                "context": "That idiot Fauci said it was worth the risk for science, tell that to the millions who have died!",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "vazilia",
        "time": "1 February, 2022",
        "context": "America created this problem America policies in Congress created this problem and sold out America to China America should have worked with our neighbors to provide them with the economic wealth instead of China if we had done that we would not have to worry about the borders no one will be crossing the borders because then those countries would be like China because there would be no need to come to America for work",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "goa✟lips",
                "time": "1 February, 2022",
                "context": "All that happened because of capitalism.  Don't get me wrong, I love a free market economy.  But our ties to China are driven by market forces.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "JbKhHater665",
        "time": "1 February, 2022",
        "context": "Kinda like they did Trump when he said it and said CHINA VIRUS. Dr Fauci gave $$ to Wuhan Lab. For Gain - of-  Function on corona sar-2 and lied under oath about it. That’s illegal, treason and firing squad type lies to cover for communist ",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Truckers_will_save_us",
        "time": "1 February, 2022",
        "context": "Nothing new here.  I don't understand FOX news and why it's so passive and scared.  FOX is trying to have it both ways.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "TiredofalltheBS334",
        "time": "1 February, 2022",
        "context": "Of course it leaked from the lab! FJB, too.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "libsrwankers",
        "time": "1 February, 2022",
        "context": "Lab owners like Dr Frankinfauci were not letting that cat out of the bag. Well, maybe an infected one",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "fleshtipjackhammer",
        "time": "1 February, 2022",
        "context": "Funny how Fox doesn't want you D A Repubs to know Laura ingraham's poster child for anti Vax has died of Covid 19. The Washington State Trooper. Darwin's Theory at work.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "eternalperspective",
        "time": "1 February, 2022",
        "context": "The consequences of this are so grave that those who have perpetuated the myths in an effort to hide the truth and their complicity should be subjected to punishments fitting the crime. A death penalty should be the minimum punishment - the only question being the method of execution. Extreme? Well, Fauci alone might actually be responsible for at least a half million deaths.",
        "good": "8",
        "bad": "2",
        "replies": [
            {
                "user_name": "goa✟lips",
                "time": "1 February, 2022",
                "context": "I'm thinking Trump should face the gallows first.",
                "good": "0",
                "bad": "6",
                "replies": [
                    {
                        "user_name": "1776no1619",
                        "time": "1 February, 2022",
                        "context": "I think you should.  You're a societial disease; the type that infects civilizations and ushers in the end.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "eternalperspective",
                        "time": "1 February, 2022",
                        "context": "Oh? I didn't realize you were capable of thought. Pssh. Trump didn't create the virus but you're so mentally warped and psychologically damaged by visceral hatred of your strawman, you can't see that. I thought I had you muted. How'd you get around that?",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "legitscientist",
        "time": "1 February, 2022",
        "context": "There was a couple peer reviewed papers that explained this right at the start of COVID in The USA. I download them luckily. These where scrubbed from Academic Sources and a few scientific journals. Nucking Futty. \n\nLots of these Scientific Journals are not ran by Real Scientist. It is a real problem, because many of the ding-dongs running some of the most prestigious journals are woke to all hell.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "politicalzoo",
        "time": "1 February, 2022",
        "context": "Democracy dies in darkness wasn't a warning... it was a battle call.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Truckers_will_save_us",
        "time": "1 February, 2022",
        "context": "And we believe climate research from the same funding system and the same types of research people.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "goa✟lips",
        "time": "1 February, 2022",
        "context": "Stick it to the libs!  Lick doorknobs at Costco",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "aagar",
        "time": "1 February, 2022",
        "context": "If you succumb to the pressure to cover up a lie, you are part of the cover-up ! How could all major scientists decided to collude with Fauci and his boss ?????",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "nopenotme854",
                "time": "1 February, 2022",
                "context": "same as always.  been this way for as long as humans formed societies.\neventually, the truth comes out. sometimes it takes centuries.",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "humanish",
        "time": "1 February, 2022",
        "context": "It was done to derail trump this was a dem and the commie chinese colab",
        "good": "4",
        "bad": "1",
        "replies": [
            {
                "user_name": "evag",
                "time": "1 February, 2022",
                "context": "I traveled to China in 2019 before Covid. They very clearly told us that they are a Third World Country and they want to overtake us, America. This phony lab leak is perfect-- it brought us and the rest of the world to our knees-- so much death, illness, lost businesses. They are alot closer to overtaking us now. Trump put them on notice and could have been stronger; Biden and is family are \"owned\" by the Chinese. Someone has to come to power in the US and get very tough with the Chinese.",
                "good": "1",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "humanish",
                        "time": "1 February, 2022",
                        "context": "They should have heeded McArthur",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "Shawne",
        "time": "1 February, 2022",
        "context": "The pendulum can not swing back fast enough.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "2beagles",
        "time": "1 February, 2022",
        "context": "I want to see Fauci's head on a post sticking out of the ground in front of the White House. That little man is pure evil for what he has done. Fauci has blood on his hands and he needs to pay.",
        "good": "2",
        "bad": "0",
        "replies": [
            {
                "user_name": "goa✟lips",
                "time": "1 February, 2022",
                "context": "You seem like a nice person.",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "slowburn856",
                "time": "1 February, 2022",
                "context": "Down boys down , he's spoken about you in hearings in front of Congress .",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "tooliedude",
        "time": "1 February, 2022",
        "context": "The origin should be investigated, without restriction. Hannity wrote an article on FOX about 18 months ago regarding the origin and several Americans were sick with what later was found to be Covid before the mass event in Wuhan. So yea, no holds barred investigation should be done.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "10thofnever",
        "time": "1 February, 2022",
        "context": "Thank you Dr. Rand Paul for exposing what others ignored, refuted, scoffed at.\nwho just buried their heads in sand.",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "RedPopcorn",
        "time": "1 February, 2022",
        "context": "Years ago, bill gates kept rambling on about a global pandemic, now we have one. Hes great at predicting the future",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sep51",
        "time": "1 February, 2022",
        "context": "C'mon Tony, time to fess up to helping create this US/CHINA pandemic. ",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "SureShot217",
        "time": "1 February, 2022",
        "context": "Huge story!  Only 2hrs old I imagine plenty of posters will join soon.  Too busy with crime and Russia currently.  But here's my comment: F Fauci!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rubiks6",
        "time": "1 February, 2022",
        "context": "\"The heart is deceitful above all things, and desperately wicked: who can know it?\"\n– Jeremiah 17.9 (KJV)",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "lycopine",
                "time": "1 February, 2022",
                "context": "Geezus is a false idol\n\nLogic 101",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "burpinBud",
        "time": "1 February, 2022",
        "context": "No need to implant chips in Dems' heads, they're already brainwashed..",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "burpinBud",
        "time": "1 February, 2022",
        "context": "Go in as a journalism student come out as an engineer of mass hysteria...",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Goyim880",
        "time": "1 February, 2022",
        "context": "There are so many hoes in America, on the CCP's \"pay-roll\"...",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "oharriet",
        "time": "1 February, 2022",
        "context": "Of course they were silenced. Do you really think Emperor Fauci wanted his gain of function testing revealed OR any attention paid to his yearly salary???",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "thatParrotsDead",
        "time": "1 February, 2022",
        "context": "if science used the Covid model the earth would still be flat.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "c.character",
        "time": "1 February, 2022",
        "context": "It's population control at it's finest, while blaming disease infested bats. And we wonder why abortions are legal, again just population control at it's finest.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "donrob",
        "time": "1 February, 2022",
        "context": "You mean Fauci is not science but a betrayer of science?  What an amazing plot twist.  Props to the writings.  Covid has been a heck of a show!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "resist46",
        "time": "1 February, 2022",
        "context": "Everyone silencing the scientists including Fauci should be in prison. Lying to us for going on 3yrs is beyond disgusting.",
        "good": "4",
        "bad": "0",
        "replies": [
            {
                "user_name": "33.333rpm499",
                "time": "1 February, 2022",
                "context": "Yes, many people including scientists and doctors have been unable to speak out.  It is quite shocking.",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "coldwaterintheface",
        "time": "1 February, 2022",
        "context": "Here come the tin hat brigade.  How entertaining!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "thinking498",
        "time": "1 February, 2022",
        "context": "well well well. not surprised. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "yo666",
        "time": "1 February, 2022",
        "context": "All to cover for the Chinese",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "SureShot217",
                "time": "1 February, 2022",
                "context": "What a travesty Beijing is hosting winter Olympics in a few days.  Go America!  Gotta support the home team regardless.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "politicalzoo",
        "time": "1 February, 2022",
        "context": "This is what happends when Democrats abandon all principles to get rid of the scary orange man.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "contagion1000",
        "time": "1 February, 2022",
        "context": "This is more proof that the Communist Democrats have sold America’s sovereignty to China for money.   When it comes to China and their violations of international law, the Communist Dems always turn a blind eye!",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "10thofnever",
        "time": "1 February, 2022",
        "context": "That was quite a well timed release of a bio-weapon.",
        "good": "5",
        "bad": "1",
        "replies": [
            {
                "user_name": "dan42day",
                "time": "1 February, 2022",
                "context": "Yes, just in time to install a CCP puppet in the White House.",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "RedPopcorn",
        "time": "1 February, 2022",
        "context": "Why was the spanish flu of 1918 called the spanish flu?",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "tooliedude",
                "time": "1 February, 2022",
                "context": "Spain was the only nation that wrote about the flu and how serious it was. It originated in Kansas, and the dough-boys from America spread it all over the world.",
                "good": "0",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "33.333rpm499",
                        "time": "1 February, 2022",
                        "context": "Just a Democrat theory that has appeared since COVID.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "RedPopcorn",
                        "time": "1 February, 2022",
                        "context": "Of course it was Americas fault to democrats like you who hate America",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "thatParrotsDead",
                "time": "1 February, 2022",
                "context": "why is Havana Syndrome OK considering it is new also?",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "chrisblitzer2",
        "time": "1 February, 2022",
        "context": "You will comply.  You will be assimilated.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "RedPopcorn",
        "time": "1 February, 2022",
        "context": "Americans are told by the CCP  through their American puppets, the democrat politicians, democrat media and CCP puppet dr fauci, we are not allowed to question the origin",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "stoneface1",
        "time": "1 February, 2022",
        "context": "Nothing that anyone who knew of the existence of the Wuhan lab didn't already know for the past two years.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "1982corvette",
        "time": "1 February, 2022",
        "context": "I am a survivor of the CHINA flu and may my generation and the next never forget how they lost friends and relatives . ALL involved should pay a heavy price",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "shadowbannedagain335",
        "time": "1 February, 2022",
        "context": "Dr. Ronen Shemesh.\n\nHe actually sounds reasonable:\n\nJune 2020:\n“We really don’t know where this virus came from - that’s the truth. The two possibilities is that it was a chance transmission of a virus...the other possibility is that it was an accidental release of the virus from a laboratory,” he said.\n“One of the possibilities is that an animal host was infected by two coronaviruses at the same time and COVID-19. The same process can happen in a petri-dish.\n“In other words COVID-19 could have been created from that recombination event in an animal host or it could have occurred in a cell-culture experiment.\n“I’m certainly very much in favour of a scientific investigation. Its only objective should be to get to the bottom of how did this pandemic happen and how do we prevent a future pandemic.”",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "naturelovercd142",
        "time": "1 February, 2022",
        "context": "As much as Fauci, a scientist,  denied the lab leak theory the more I believed it. Why else would a scientist absolutely quash other theories unless they want to hide sometime. Just like the Biden administration does.",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "SagittariusA*",
        "time": "1 February, 2022",
        "context": "Reminds me of the time Galileo was imprisoned for publishing his science. ",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "lycopine",
                "time": "1 February, 2022",
                "context": "That's what self righteous truth claiming religious geezus morons do.\nIt only took 500 years for them to pardon Galileo.",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "davo1334",
        "time": "2 February, 2022",
        "context": "Fauci funded it, lied about it and covered it up, with the help of “go along with it to get your grant money” whores.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Malakie457",
        "time": "1 February, 2022",
        "context": "Fauci IS the modern day equal of Dr. Mengela and both the nazi and Japanese evil circles that experimented on humans during wwii.\n\nAs far as I am concerned ANY so called scientists or doctors involved in this kind of work, should be take down a thrown in the deepest pit we can find on the planet.\n\nDoing what they have done and continue to do, WILL extinct mankind if it continues..  what happens when fauci and his evil circle release a REAL fatal deadly virus that kills 50% or more in just days, then starts mutating quickly?  \n\nBecause unless this gain of function garbage is stopped, it WILL HAPPEN and by the time the world finds out, it will be far far too late to stop it the next time.",
        "good": "1",
        "bad": "1",
        "replies": [
            {
                "user_name": "lycopine",
                "time": "1 February, 2022",
                "context": "No different than research on other weapons of human destruction. \nMachine guns, napalm, chemicals, fission and fusion, etc.",
                "good": "0",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "shadowbannedagain335",
        "time": "1 February, 2022",
        "context": "Lord Matt Ridley was Chairman of Northern Rock bank which failed due to mismanagement. He violated the Parliamentary Code of Conduct by not disclosing financial conflicts of interest\n\nHe co-wrote a book reviewed by the LA TImes:\n\n\"In reality, however, “Viral” is a laboratory-perfect example of how not to write about a scientific issue. The authors rely less on the scientists doing the painstaking work to unearth the virus’ origin than on self-described sleuths who broadcast their dubious claims, sometimes anonymously, on social media. In the end, Chan and Ridley spotlight all the shortcomings of the hypothesis they set out to defend.\n...\nYet if the authors were truly concerned with the origin of COVID-19, they would give proper due to the prevailing scientific judgment about it: that COVID was “zoonotic,” spilling over from infected animals to humans via natural contact the way most viruses known to science have reached humankind. As virologists reported this summer, the emergence of SARS2 bears unmistakable signatures of those prior zoonotic events. Chan and Ridley, however, pay insufficient attention to the scientific consensus, or to the significant research findings around which it has coalesced.\n\nNo evidence whatsoever has ever been produced for any of these versions. All that remains is an argument based on unsupported conjecture and the absence of evidence: Why don’t we know more about the work at the Wuhan Institute, unless the Chinese government is hiding its guilt?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "g8orz617",
        "time": "1 February, 2022",
        "context": "Powerful people have been highly successful for years with the fear mongering of global cooling, err, global warming,  err, climate change claims and when their claims fall through, they just change the name till the name fits anything they predict.  There are many, many scientists who's studies do not support climate change in any form.  They are shunned, get no funding, are ridiculed, ignored, etc. all in efforts to push a political agenda.  It is the same thing with the pandemic and the leaking of the Chinese virus.\nNotice that both climate change and covid acceptance results in restrictive rules as a way to control culture and society.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "lycopine",
                "time": "1 February, 2022",
                "context": "Ooooo, so many ACC contradicting studies, eer, like ZERO that have any merit, the rest thoroughly debunked...",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "FedUpWithLibsBS",
        "time": "1 February, 2022",
        "context": "We have reached morally corrupt. This is same as Jews turning on other Jews in holocaust times thinking they would be insulated. These scientists who did that to others even feeling they were credible are irredeemable. We deserve better than that. We also deserve to have a media that questions all bad actors, not just republicans. ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "thunker54",
        "time": "1 February, 2022",
        "context": "Said that from the beginning when Fauci was insisting it was bat soup. It was a bio-weapon the Chinese were developing when it prematurely got loose.",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "chiefsbrat",
        "time": "1 February, 2022",
        "context": "When a theory cannot be fully explored, when prophylactic and therapeutic treatments are dismissed without study, and when the safety or effectiveness of a treatment cannot be examined, you are not following science.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ptol352",
        "time": "1 February, 2022",
        "context": "The Wuhan Lab was an obvious suspect.   And the proximity to the lab was clear evidence.   Despite all the evidence lab workers becoming I'll early on, researchers deleting evidence, past publications and reports that they were working on modified coronavirus, Chinese government obviously thinking the lab leak was a plausible theory enough to issue safety directives...  \"No Evidence\" was repeated over and over.  \n\nThere is more than enough evidence to determine civil liability in a court of law.  And there should be lawsuits.\n\nAnd there is still absolutely no evidence of a zoonotic infection being the proximal cause of the pandemic.",
        "good": "0",
        "bad": "1",
        "replies": [
            {
                "user_name": "joday",
                "time": "1 February, 2022",
                "context": "The ill reports were probably mistakes or made up info. There was no one sick in the Wuhan lab in December 2019 and January 2020, and they all tested negative for Covid antibodies.",
                "good": "1",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "djpnino",
        "time": "1 February, 2022",
        "context": "Evil is as evil does.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "actb",
        "time": "2 February, 2022",
        "context": "We must shut down gain of function research globally. Just like nuclear weapons.",
        "good": "0",
        "bad": "1",
        "replies": [
            {
                "user_name": "goodwillwin",
                "time": "4 February, 2022",
                "context": "Nuclear weapons are good at shutting things down.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "SureShot217",
        "time": "1 February, 2022",
        "context": "These three whistleblowers will have their mettle tested in the days to come and hopefully set the issue on fire.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "seenitallnow",
        "time": "1 February, 2022",
        "context": "It was always about the money. Just like climate research, you are told what your conclusions must be before you even begin if you want the grant money, no matter what the research says, or you are cut off from the money. Dr. Mengele Fauci had control of the governments purse strings so you told whatever lie he told you to tell or your money was cut off.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "joday",
        "time": "1 February, 2022",
        "context": "It is fine to investigate in depth about a lab leak. But it has been 2 years focused on the Wuhan lab, and focused ONLY on the Wuhan lab. There are many more US labs that are more capable and much better funded than the Wuhan lab. There have been no one sick, nor any lab shutdowns at the Wuhan lab (this we know). Yet, there was a shutdown of the Fort Detrick lab in July 2019 shortly before the Covid outbreak in December. To shut down a huge lab is A BIG DEAL. Yet, all those who clamor for more investigations into the Wuhan lab, are totally silent on investigating Fort Detrick or the many other US labs. So what is the problem?????",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "chillymciceman",
        "time": "2 February, 2022",
        "context": "Leftist elites lie and are traitors. Not surprising.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "yomamasmama",
        "time": "2 February, 2022",
        "context": "At 2:13 i felt my heart drop, he said, \"like the 9-11 Commission.\" And we all remember that...\"LEST WE FORGET.\" That is sort of like the mindset of today.. 99.9999% of people blindly following MSM for life changing decisions, which we already knew was deeply corrupted, fear and hatred of all muslims, afraid to disagree, Bush#1 calling for a NWO, Bush#2 saying, \"If you ain't with us, you're against America. i could go on and on some more but you should do that on your own. We have forgotten to THINK.",
        "good": "0",
        "bad": "1",
        "replies": [
            {
                "user_name": "lycopine",
                "time": "6 February, 2022",
                "context": "that's a known fact as roughly half the country believes man was created 6000 years ago according to the bible.\nIt's more like brainwashed to religious nonsense.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "beadgBass",
        "time": "1 February, 2022",
        "context": "Two years ago, the first sequencing of SARS-CoV-2 demontrated that it was \nnot bioenginered and that it was a zoonotic disease that evolved in the \nwild. Every publication of sequencing of the coronavirus has confirmed \nthat, as reviewed in a September issue of the journal Cell.\nCould it have leaked from a lab? Possibly, but it certainly wasn't created there.",
        "good": "6",
        "bad": "6",
        "replies": [
            {
                "user_name": "thunker54",
                "time": "1 February, 2022",
                "context": "Bio-engineering is not necessarily creating a virus. It's modifying an existing one to achieve specific goals. Notice that the COVID virus has been orders of magnitude less lethal to Asian races.\n A LOT of what they said \"two years ago\" has been proven wrong now. Remember Fauci saying that masks did no good? Remember when he said \"no evidence of communal transmisson?\"\n The blind trying to lead the blind.",
                "good": "1",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "beadgBass",
                        "time": "1 February, 2022",
                        "context": "I am well aware of what bioengineering is. Of course it is modification; nobody thought they would have started from scratch. But there were no \"theys\" involved. The novel coronavirus clearly evolved in the wild.\nAs for \"two years ago,\" please note the reference I cited was from September of 2021.\nAs for Fauci, I never really paid much attention to him, as anybody could see that the pandemic was a very fluid situation.",
                        "good": "3",
                        "bad": "1",
                        "replies": [
                            {
                                "user_name": "ptol352",
                                "time": "1 February, 2022",
                                "context": "Clearly did not evolve in the wild is what is the truth.  There is absolutely no way this evolved in the wild.",
                                "good": "1",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "beadgBass",
                                        "time": "1 February, 2022",
                                        "context": "I've read the scientific literature. You've made a random speculation.\nWho has the upper hand?",
                                        "good": "3",
                                        "bad": "0",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "ArneSaknussem",
                "time": "1 February, 2022",
                "context": "Thank you. Finally somebody who gets it from the perspective of genetics rather than politics.",
                "good": "7",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "thunker54",
                        "time": "1 February, 2022",
                        "context": "Not politics. It's using genetics to weaponize a virus. Similarly to using gas during WWI or nerve agents in later history. You can use genetics and bio-engineering as a means of achieving power.",
                        "good": "1",
                        "bad": "1",
                        "replies": [
                            {
                                "user_name": "beadgBass",
                                "time": "1 February, 2022",
                                "context": "You and your focus on Fauci shows that politics is your only interest here.\nYes, genetics CAN be used, but ALL the genetic evidence from independent sources around the world show that the novel coronavirus is a zoonotic disease evolved in the wild.",
                                "good": "2",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "ptol352",
                "time": "1 February, 2022",
                "context": "That's simply not true.  It looks very much like a modified coronavirus.",
                "good": "2",
                "bad": "2",
                "replies": [
                    {
                        "user_name": "beadgBass",
                        "time": "1 February, 2022",
                        "context": "To whom? Not to the scientific community around the world who have studied it down to the last detail.",
                        "good": "3",
                        "bad": "1",
                        "replies": []
                    },
                    {
                        "user_name": "quietsmith",
                        "time": "6 February, 2022",
                        "context": "No, it didn't. A leak is possible, but if it were engineered, it would show signs of that and in fact it shows signs of the opposite.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "shadowbannedagain335",
        "time": "1 February, 2022",
        "context": "Dr Roland Wiesendanger is a physicist.  Great.\n\nThe professor says the fact that no animal host has been found, safety concerns about the lab, and the fact that researchers were involved in controversial 'gain-of-function' research to make viruses more infectious to humans all confirm his view.\nBut others have slammed his 'research' - saying it is unscientific, relies on newspaper reports and YouTube videos as sources, and point out that he is not a virus expert.\n...\nDr Wiesendanger openly admitted to German media that he has no 'scientific basis' for believing the virus escaped from the Wuhan lab.\nBut he insisted that there is plenty of 'circumstantial evidence' that suggests a lab leak is the most likely explanation.\n'I am 99.9 percent certain that the coronavirus came from the laboratory,' he told German newspaper ZDF.\n\nSeriously?  I've looked into the first 3 \"scientists\" and it's no wonder nobody took them seriously.\n\nWho's next?",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dan5047628",
        "time": "1 February, 2022",
        "context": "President Trump announced it on TV and the Liberal media tried to cover it up",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "whaler829",
        "time": "1 February, 2022",
        "context": "Science is based on proven theories and logic. . . not on politics. Politics got involved in the Investigation of the Wuhan laboratory. . so proven theories and logic were absent. It is very apparent that the virus was leaked from the lab and Dr. Fauci knew about it but covered it up due to political motives not scientific principles. Fauci is tainted and dirty.",
        "good": "0",
        "bad": "2",
        "replies": [
            {
                "user_name": "dan5047628",
                "time": "1 February, 2022",
                "context": "Scientist Lie every day to protect their Grants, reputation and the narrative of their unproven theories.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "lycopine",
                        "time": "1 February, 2022",
                        "context": "Says you and your imagination.\nEinstein git plenty of grants for publishing relativity didn't he?\nNewton got some too for his Principia Mathematica too right?\nGot any proof of your imaginary claim? I thought not. Just as you HAVE ZERO proof of your fictional god geezus...\n\nLOLOL",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "nepawoods",
                        "time": "1 February, 2022",
                        "context": "When scientists lie, they get caught, and they lose their grants and reputation.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "quietsmith",
                        "time": "6 February, 2022",
                        "context": "There there, science is just one big mean conspiracy against Jesus, you keep telling yourself that.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "quietsmith",
                "time": "6 February, 2022",
                "context": "Science is based on the best available evidence and a theory in science means something else. In science the word theory is an explanation based on a huge amount of evidence.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "DockRat",
        "time": "2 February, 2022",
        "context": "Wuhan was selling bat body parts to the wet markets",
        "good": "0",
        "bad": "1",
        "replies": [
            {
                "user_name": "goodwillwin",
                "time": "4 February, 2022",
                "context": "Might just have been someone dumpster diving behind the lab.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "boxcar4444",
        "time": "2 February, 2022",
        "context": "China and the Democrat Army is in bed together",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "MrRash",
        "time": "1 February, 2022",
        "context": "The real problem is an investigation into a lab leak will be taken as proof that the Corona virus unleashed intentionally. This is a very dangerous idea and one that shouldn't believed by anyone without proof. It's also why so many conspiracy theorists want it investigated in the first place - to pacify paranoid and chaos driven minds. Like the world needs more people believing these Qanon style hypothesis'. To what end? How will it help? The situation is so out of hand and FOX is fanning the flames to sell views. One thing we know for sure and that is we will most likely never know the truth with any degree of certainty.",
        "good": "2",
        "bad": "1",
        "replies": [
            {
                "user_name": "DockRat",
                "time": "2 February, 2022",
                "context": "I'm convinced it was released to create a conflict with Donald Trump. \nTariffs are not talked about anymore. We make less of our own products we use than ever before. The politicians have made more money on investments they influence.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "yosemitesteve",
        "time": "7 February, 2022",
        "context": "Scientists have long been corrupted by money, fame, and power just like politicians.  The pandemic has just brought it out into the open.  Now the question is will the exposure of the corruption change the way these scientists act or will it make them double down and dig in to try and preserve their power and fame and money.  Its a rhetorical question because we are already seeing that the corrupt are digging in and continue with their lies not only about where the virus came from but also their responses to it.  It makes it very difficult to believe any of them.",
        "good": "1",
        "bad": "1",
        "replies": [
            {
                "user_name": "tomsummer",
                "time": "12 February, 2022",
                "context": "all about the power and money",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "Flash-laser-rifle-trooper",
        "time": "21 February, 2022",
        "context": "Lets consider the facts, and the idea, together.  They would have us believe, that in roughly 40,000 years of continuous human habitation in the area now known as \"China\", alongside bats and pangolins, that a virus randomly mutated and jumped from animal to human.  Not just any virus, but a virus that just HAPPEND to have been studied at a globally funded high level virology laboratory in the EXACT SAME city the outbreak occurred, with the same types of mutations they were TRYING to engineer, and that ALL of this was entirely coincidental and in NO WAY related to what was going on at the big global virology lab.  Just...one, big...well timed, co-winki-dink.  C'mon man!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dan5047628",
        "time": "10 February, 2022",
        "context": "No new article for 10 days??\nGuess they figured out most people don't believe anything a Government scientist says. \nKind of like when Liberals are talking, who listens?.",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "lycopine",
                "time": "11 February, 2022",
                "context": "Better than listening to bible babblers whose sum total scientific knowledge consists of a 6000 year old Earth and their godly creationism \nLOLOL",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "dan5047628",
                        "time": "11 February, 2022",
                        "context": "Hate will consume you. I will pray for you",
                        "good": "1",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "lycopine",
                                "time": "11 February, 2022",
                                "context": "We've seen your hate in full throttle, denigrating scientists, using coercion to indoctrinate people to your imaginary religious beliefs, generalizing how \"liberals\" are so stupid and ruinous of the country, etc. That makes you a hateful and lying hypocrite. You can't even follow your own commandment: thou shalt not lie.\nOh, and prayers don't work either.",
                                "good": "0",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "tomsummer",
                                        "time": "12 February, 2022",
                                        "context": "can't we all just get along...you'll never drink beer together...just let it go",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": [
                                            {
                                                "user_name": "lycopine",
                                                "time": "12 February, 2022",
                                                "context": "that would be easy, except for the fact that these arrogant self righteous truth claimers continue their assault on non believers with coercion and indoctrination while lying about it. The USA is not a theocracy of geezus followers.",
                                                "good": "0",
                                                "bad": "0",
                                                "replies": [
                                                    {
                                                        "user_name": "tomsummer",
                                                        "time": "12 February, 2022",
                                                        "context": "so...thats a hard no?",
                                                        "good": "0",
                                                        "bad": "0",
                                                        "replies": [
                                                            {
                                                                "user_name": "lycopine",
                                                                "time": "12 February, 2022",
                                                                "context": "It's a hard no when such people support and/or engage in mandating their religious beliefs by passing laws, such as the teaching of biblical creationism as a science in public schools. It's also a hard no when posters like dan-fan apply their religious beliefs directly to me and others such as declaring their god is the one and only and we'd all better believe or burn for eternity as he's done in numerous other threads. And I'll go a step further based on his moronic belief that all scientists lie for grant money, climate change is a decades long conspiracy and hoax and the Earth is 6000 years old.",
                                                                "good": "0",
                                                                "bad": "0",
                                                                "replies": []
                                                            }
                                                        ]
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "rubiks6",
        "time": "10 February, 2022",
        "context": "Wow. 10 days no science. I suppose Fox should eliminate the section.",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "quietsmith",
                "time": "10 February, 2022",
                "context": "I'm sure you can find a way to be completely wrong about everything somewhere else.",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "dan5047628",
                "time": "10 February, 2022",
                "context": "Science??? \nI thought this was the Comedy section.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "rubiks6",
                        "time": "10 February, 2022",
                        "context": "Aha. You’re such a comedian.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "lycopine",
                                "time": "11 February, 2022",
                                "context": "Oooo, you're such a self righteous arrogant truth claimer with ZERO. evidence....",
                                "good": "0",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "rubiks6",
                                        "time": "11 February, 2022",
                                        "context": "You must get exhausted. It takes a lot of effort to maintain constant anger.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": [
                                            {
                                                "user_name": "lycopine",
                                                "time": "11 February, 2022",
                                                "context": "Not hardly. My diaphragm gets sore laughing at your bible babble. It's even more sore because of your seriousness of believing in the imaginary",
                                                "good": "0",
                                                "bad": "0",
                                                "replies": [
                                                    {
                                                        "user_name": "dan5047628",
                                                        "time": "11 February, 2022",
                                                        "context": "Keep laughing, your day of judgement is coming",
                                                        "good": "0",
                                                        "bad": "0",
                                                        "replies": []
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "user_name": "lycopine",
                        "time": "11 February, 2022",
                        "context": "Nah, that's the religious section...",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "gar009",
        "time": "4 February, 2022",
        "context": "One world order, a dream of every Marxist ",
        "good": "2",
        "bad": "0",
        "replies": [
            {
                "user_name": "dan5047628",
                "time": "7 February, 2022",
                "context": "and Satan",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "harrie35",
        "time": "7 February, 2022",
        "context": "The Chinese government was deflecting to the wet market theory before they had any proof that was where it came from. that should tell you that the Chinese government is trying to cover this up and because of our weak government, mainly the U.S., the true origins this virus will never be unveiled.",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "tomsummer",
                "time": "12 February, 2022",
                "context": "two years ago, when I saw the picture in the news of dozens of backhoes moving dirt to build China virus hospitals, I knew it was bad and everything afterward was lies",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "alkhobar966",
        "time": "6 February, 2022",
        "context": "Plausible does not mean Probable!",
        "good": "0",
        "bad": "1",
        "replies": [
            {
                "user_name": "yosemitesteve",
                "time": "7 February, 2022",
                "context": "It does when there is an overwhelming and growing amount of evidence that supports it.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "error": "error"
                    }
                ]
            }
        ]
    },
    {
        "user_name": "dan5047628",
        "time": "7 February, 2022",
        "context": "President Trump told us in the beginning this thing came out of Wuhan China and no one wanted to here it.",
        "good": "2",
        "bad": "0",
        "replies": [
            {
                "user_name": "lycopine",
                "time": "8 February, 2022",
                "context": "Yet it's HEAR. And trump told us it would magically disappear in the summer heat of 2020 while he downplayed it's virulence. \nGot a response to that? Or did your lysol treatments paralyze your vocal chords?\n\nLOLOL",
                "good": "1",
                "bad": "2",
                "replies": [
                    {
                        "user_name": "quietsmith",
                        "time": "8 February, 2022",
                        "context": "Works both ways.\n\nTrump said things that the left didn't want to hear that were true :D",
                        "good": "1",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "lycopine",
                                "time": "8 February, 2022",
                                "context": "Of the few truths he did say, true. Compared to the thousands of lies he's told and continuing BIG LIE of massive voter fraud only proves what Rubio and Cruz called him in the GOP debates:\nA lying con man and pathological liar.",
                                "good": "1",
                                "bad": "1",
                                "replies": [
                                    {
                                        "user_name": "quietsmith",
                                        "time": "8 February, 2022",
                                        "context": "Which doesn't change the point.\n\nThe left spent 2020 basically doing everything they could to obfuscate the fact that Trump was right about where the virus came from and when he tried to shut down shut down travel from China, they called him a racist for it. \n\nFor you see, calling it the China Virus meant the left couldn't sit around blaming Trump for it :D",
                                        "good": "1",
                                        "bad": "0",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "user_name": "dan5047628",
                        "time": "10 February, 2022",
                        "context": "Its what your science gods told him",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "lycopine",
                                "time": "10 February, 2022",
                                "context": "Yeah, right. The science gods told him to blurt out to them \"let's see if disinfectant can be used as a treatment because I saw how it just knocks out the virus from the body\". Or his other \"scientific\" babble about treating C19 with UV light because he saw how it works in the bathroom.\n\nThat's your former ignoramus for a president...\n\nOh, and the REAL scientists have ZERO evidence of a the virus leaking from the Wuhan lab. They do have a mountain of evidence pointing to a zoonotic origin. \nBut you'd never believe that. It had to come from your god.\n\nLOLOL",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "wilko",
        "time": "6 February, 2022",
        "context": "Establishment science is just as self-serving and corrupt as the government public health agencies many of these scientists are part of.",
        "good": "4",
        "bad": "1",
        "replies": [
            {
                "user_name": "alkhobar966",
                "time": "6 February, 2022",
                "context": "Thank science for the device and communication you are using to post your idiocy!",
                "good": "0",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "dan5047628",
                        "time": "7 February, 2022",
                        "context": "we do, he was commenting on the liars",
                        "good": "1",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "lycopine",
                                "time": "8 February, 2022",
                                "context": "Not many of them compared to religious fanatics",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "sixdelta",
        "time": "3 February, 2022",
        "context": "\"Conspiracy Theory\" = potential alternative explanation to the mathematically-unlikely, official MSM narrative. A \"Conspiracy Theory\" MUST NOT be allowed to challenge the official narrative, no matter how unlikely the official narrative; accordingly, the MSM coordinates their 4am talking points!",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "MadDawg66",
        "time": "5 February, 2022",
        "context": "The Silence of the Scams!",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "rubiks6",
                "time": "5 February, 2022",
                "context": "Unfortunately, they are neither silent nor silenced.",
                "good": "1",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "lycopine",
                        "time": "6 February, 2022",
                        "context": "And too bad your religious beliefs can't be either even if they do reside in your imagination...",
                        "good": "0",
                        "bad": "2",
                        "replies": [
                            {
                                "user_name": "dan5047628",
                                "time": "7 February, 2022",
                                "context": "You hope",
                                "good": "1",
                                "bad": "0",
                                "replies": []
                            },
                            {
                                "user_name": "rubiks6",
                                "time": "7 February, 2022",
                                "context": "Whatever, dude. Get a grip.",
                                "good": "1",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "lycopine",
                                        "time": "7 February, 2022",
                                        "context": "whatever,dude. You do need a grip on reality though not what's in your imagination",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": [
                                            {
                                                "user_name": "rubiks6",
                                                "time": "7 February, 2022",
                                                "context": "It’s time for you to be silenced. B’bye.",
                                                "good": "0",
                                                "bad": "0",
                                                "replies": [
                                                    {
                                                        "user_name": "lycopine",
                                                        "time": "8 February, 2022",
                                                        "context": "toodle-doo daydreamer....",
                                                        "good": "0",
                                                        "bad": "0",
                                                        "replies": []
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "user_name": "quietsmith",
                        "time": "8 February, 2022",
                        "context": "Creationism is a scam :D",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "DarwinIsStillRight",
        "time": "10 February, 2022",
        "context": "Did omicron escape from a lab in South Africa? What lab did Delta escape from in India? There are trillions more viruses existing and mutating in the wild than have never been seen in a lab, let alone escaped from one.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "yosemitesteve",
                "time": "10 February, 2022",
                "context": "Omicron and delta and the new \"stealth\" omicron are variants of the original COVID virus, which is becoming more probable that it escaped from the Wuhan lab.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "lycopine",
                        "time": "11 February, 2022",
                        "context": "About as probable as cream and coffee unmixing itself",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "yosemitesteve",
                                "time": "11 February, 2022",
                                "context": "Then highly probable because cream does settle out of coffee over time.  Thanks for making my point.",
                                "good": "0",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "lycopine",
                                        "time": "11 February, 2022",
                                        "context": "Yeah, right. The probability is a googleplex raised  to a googplex seconds in time..calculate that",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": [
                                            {
                                                "user_name": "yosemitesteve",
                                                "time": "11 February, 2022",
                                                "context": "Do I really need to explain to you how solids, the cream, in suspension will come out of suspension if left undisturbed?",
                                                "good": "0",
                                                "bad": "0",
                                                "replies": [
                                                    {
                                                        "user_name": "lycopine",
                                                        "time": "11 February, 2022",
                                                        "context": "Do I really have to explain to you that at the molecular level that doesn't happen? Ever heard of  Brownian motion?",
                                                        "good": "0",
                                                        "bad": "0",
                                                        "replies": [
                                                            {
                                                                "user_name": "yosemitesteve",
                                                                "time": "11 February, 2022",
                                                                "context": "You were talking about a simple solution of coffee and cream and now your going down to random molecular motion that will keep a minute amount of the cream in suspension.  For the practicality of the example I was correct, but technically you are right.",
                                                                "good": "0",
                                                                "bad": "0",
                                                                "replies": [
                                                                    {
                                                                        "user_name": "lycopine",
                                                                        "time": "11 February, 2022",
                                                                        "context": "The probability number i posted was your first clue.",
                                                                        "good": "0",
                                                                        "bad": "0",
                                                                        "replies": []
                                                                    }
                                                                ]
                                                            }
                                                        ]
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "dan5047628",
        "time": "7 February, 2022",
        "context": "So, Scientist never lie?? Ha",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "lycopine",
                "time": "8 February, 2022",
                "context": "Rarely. Religious fanatics lie all the time",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "quietsmith",
                "time": "8 February, 2022",
                "context": "Aren't you the one that says life has been around about 6500 years and that we don't know how old the earth is?\n\nYou want to know who the liars are?\n\nThe people who told you those things.",
                "good": "1",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "lycopine",
                        "time": "8 February, 2022",
                        "context": "That's fan-dan. YEC all the way, believer in talking serpents and donkeys, seas that part on command and centuries old humans.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "quietsmith",
                                "time": "8 February, 2022",
                                "context": "I wish I still had the thread from a long defunct message board system of YECs screaming at each other over which YEC model was more accurate :D",
                                "good": "0",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "lycopine",
                                        "time": "8 February, 2022",
                                        "context": "Their imaginations are as good as 5 year olds, aren't they?",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "user_name": "dan5047628",
                        "time": "10 February, 2022",
                        "context": "God doesn't Lie",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "quietsmith",
                                "time": "10 February, 2022",
                                "context": "Ah, but people don't you those things.\n\nAnd those people lied to you. \n\nI don't mean they told you a 'different interpretation' of evidence or  something like that.\n\nI mean they looked you square in the face and told you something they knew was not true. There's not a single solitary major young earth creationist organization out, not a single one, that isn't aware they are lying to you.",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            },
                            {
                                "user_name": "lycopine",
                                "time": "11 February, 2022",
                                "context": "Which god? There's over 10,000 documented ones. And how would you know if any god lied?",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "nasaengineer",
        "time": "10 February, 2022",
        "context": "What's next? The mainstream finally recognizes at least 4 stiffened animals were used to create this virus?  I mean that science came out early in 2020 but was called crazy and a conspiracy theory.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "skybolt05",
        "time": "4 February, 2022",
        "context": "This is what happens in the liberal mind.   Truth no longer matters.   The left believes that being self absorbed is the correct state of mind.   The words “truth” and “science” have been soiled and no longer have objective meaning.",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "lycopine",
                "time": "4 February, 2022",
                "context": "Compared to the CANCER-vative mind that is self-absorbed in arrogant self-rghteous religious truth claims...",
                "good": "0",
                "bad": "1",
                "replies": []
            },
            {
                "user_name": "goodwillwin",
                "time": "4 February, 2022",
                "context": "Pride, envy, greed, gluttony, sloth, lust and rage are the ideals and destruction of the fool.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "rubiks6",
        "time": "4 February, 2022",
        "context": "Welcome to the real world of science. A scientist is just as likely to say whatever he/she thinks is most expedient as to speak the truth.",
        "good": "0",
        "bad": "2",
        "replies": [
            {
                "user_name": "nepawoods",
                "time": "4 February, 2022",
                "context": "If anyone has proved themself to be just as likely to say whatever he/she thinks is most expedient as to speak the truth, it's you.",
                "good": "1",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "rubiks6",
                        "time": "4 February, 2022",
                        "context": "Yet, you can’t defend the scientists from the accusation of corruption, can you?",
                        "good": "0",
                        "bad": "2",
                        "replies": [
                            {
                                "user_name": "nepawoods",
                                "time": "4 February, 2022",
                                "context": "Just like you can't defend your Bible from the accusation of being nothing more than a collection of lurid and depraved campfire stories invented and told by bronze age goat herders.",
                                "good": "1",
                                "bad": "1",
                                "replies": [
                                    {
                                        "user_name": "rubiks6",
                                        "time": "4 February, 2022",
                                        "context": "I don’t think the Bible or God were discussed in the article. The corruption of scientists and the scientific establishment are what the discussion is about. I know it’s hard for you but try to stay on topic. You seem quite distracted by thoughts of the Bible and of God. Perhaps you should consider why you have God on your mind so often.",
                                        "good": "1",
                                        "bad": "0",
                                        "replies": [
                                            {
                                                "user_name": "nepawoods",
                                                "time": "4 February, 2022",
                                                "context": "LOL.  Everyone knows what motivates you to attack scientists.  Don't pretend otherwise.",
                                                "good": "1",
                                                "bad": "0",
                                                "replies": [
                                                    {
                                                        "user_name": "rubiks6",
                                                        "time": "4 February, 2022",
                                                        "context": "You speak for everyone?\n\nMy motives are not hidden. Do you disagree with my motives? Since you say my motives are obvious, can you state them?",
                                                        "good": "1",
                                                        "bad": "0",
                                                        "replies": [
                                                            {
                                                                "user_name": "lycopine",
                                                                "time": "6 February, 2022",
                                                                "context": "Easily, convert the heathen and spread the gospel in any devious fashion you can, that is what you do. Examples abound of your arrogant self righteous truth claims to deny science and replace it with your religious beliefs.",
                                                                "good": "0",
                                                                "bad": "0",
                                                                "replies": [
                                                                    {
                                                                        "user_name": "rubiks6",
                                                                        "time": "6 February, 2022",
                                                                        "context": "OMGoodness! Wanting people to escape Hell. Such a terrible thing!\n\nListen — you just carry on and burn in Hell. I cannot save you. You’re just too smart.",
                                                                        "good": "0",
                                                                        "bad": "1",
                                                                        "replies": []
                                                                    }
                                                                ]
                                                            }
                                                        ]
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "lycopine",
                "time": "4 February, 2022",
                "context": "Go bow, pray and pay tribute to your god and god leaders...",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "quietsmith",
                "time": "6 February, 2022",
                "context": "Yes yes, this must mean that your ideas about how science is one big mean evil conspiracy against Jesus are correct.",
                "good": "0",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "yosemitesteve",
                        "time": "7 February, 2022",
                        "context": "Some of it is.  \nResearchers depend on grants from governments, societies, institutions such as colleges and universities, and wealthy individuals for funding.  If the research doesn't show what is expected or desired then the scientists can expect that some of their funding will be pulled. This is a very strong incentive for the researchers to try and push their findings in a way that will provide the best benefit for themselves and their research, which is not always the best for science or the people.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "quietsmith",
                                "time": "7 February, 2022",
                                "context": "Oh the old \"they just want grants!\" this is hysterical.\n\nIf all they cared about was money, they would quit research immediately. Private industry gives more money and better hours. Nobody goes into research to get money or an easy job, as that's the opposite of what you'll get.",
                                "good": "0",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "yosemitesteve",
                                        "time": "10 February, 2022",
                                        "context": "Firstly, I didn't say that all they cared about is money.  I pointed out where their money comes from. If they were just after making large sums of money I am sure that they could do far better in the private sector, but that rarely comes with the notoriety and public prestige that comes with doing research in a \"public\" setting, ie. major universities or hospitals, especially if they are the department head.  This can be a major driving factor why some go into research, to get a paper published with their name on it.  \nSecondly, most lead researchers have staffs and undergrades who do most of the late night work and the tedious jobs of comparing and compiling results, and yes I've been around many people who do research in many areas from electrical engineering to physics so I do know what I am talking about.\nThirdly, I don't discount or diminish what good researchers do.  I am merely pointing out what it takes for them to be able to do their work and the pressures that they can face and that some can be swayed to provide the desired results.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": [
                                            {
                                                "user_name": "quietsmith",
                                                "time": "10 February, 2022",
                                                "context": "Ha, no, sorry :D Anyone who tries the 'they just want their grants' is talking out of their rear no matter how they try and twist it. The peer review process exists for a reason and again, no matter how hard you try.\n\nThe money is in the private sector. :D \n\nOh? You've been around people who do research? Fascinating, because I actually work in it, and see what happens.",
                                                "good": "0",
                                                "bad": "0",
                                                "replies": [
                                                    {
                                                        "user_name": "yosemitesteve",
                                                        "time": "11 February, 2022",
                                                        "context": "So you are a researcher, then let me ask where does the funding come from for the work you do?  Grants?  University endowments? Trusts left by alumni? The funding for your time and research has to come from somewhere because I highly doubt that you are working for free and research in either the public or private sectors is very expensive.  Second question.  What happens to that funding if your research is found to be wrong or faulty?  Does it not get withheld or revoked?  \nAgain I am not trying to diminish or discount the work of good researchers, either public or private.",
                                                        "good": "0",
                                                        "bad": "0",
                                                        "replies": []
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "tomsummer",
        "time": "12 February, 2022",
        "context": "humanity is lost...build the ark",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "marksman10",
        "time": "9 February, 2022",
        "context": "Big sale next week; scientists for sale cheap. They will say anything you want as long as they are paid to say it. Close out on used tobacco scientists.  ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "goodwillwin",
        "time": "4 February, 2022",
        "context": "Similarly, it is very difficult for legislators to introduce responsible spending bills since any such restriction on the behavior of the ruling powers would negatively impact vote-baiting spending initiatives.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "rubiks6",
                "time": "5 February, 2022",
                "context": "Every politician is by nature in a conflict of interest. This is why it is impossible to have good politicians.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "lycopine",
                        "time": "6 February, 2022",
                        "context": "what's a \"good\" politician? There certainly are ones that are focused on honesty and work for the benefit of the USA.",
                        "good": "1",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "dan5047628",
                                "time": "7 February, 2022",
                                "context": "One that follows the path that Jesus Christ gave us,",
                                "good": "0",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "lycopine",
                                        "time": "7 February, 2022",
                                        "context": "says you and your imaginary geezus and that \"path\"",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": []
                                    },
                                    {
                                        "user_name": "quietsmith",
                                        "time": "8 February, 2022",
                                        "context": "People tried doing what the Bible says for centuries. \n\nThen we decided burning people alive wasn't nice.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "4drepublic725",
        "time": "6 February, 2022",
        "context": "The reports that the lab dispersal of the virus would have put a damper on hosting the Olympic Games to be sure. Yet the US still participating, Let’s Go Brandon and support you’re Chicomm handlers...",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Iclimbedthemountain",
        "time": "12 February, 2022",
        "context": "This was a far too great an opportunity for radical progressives to controll the populations of much of the world.\nThey were not about to pass that up.\nLook where we are now ...",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "billtobin914",
        "time": "7 February, 2022",
        "context": "Long ago, our politicians lost the public's trust due to their willingness to lie at the drop of a hat and to be totally self-serving.  More recently, our media lost our trust for the exact same reasons.  Now, due to covid, we know the same is true for our so-called scientists.  Doctors are following suit along with the pretend scientists and want to put politics over actually taking care of patients.  We are running out of people and institutions we can trust. What happens to this country when there is nobody left that any of us trust?",
        "good": "0",
        "bad": "1",
        "replies": [
            {
                "user_name": "reconsurgeon",
                "time": "7 February, 2022",
                "context": "This is a well-trod story of fascism and tyranny - leaders co-opt any formerly-trusted group (like doctors, lawyers, judges) first, since common people may follow them into servitude.  Our Founders warned us to always speak truth to power, lest We the People bow to oppression and servitude to those who do not deserve it...",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "mikehunt659",
        "time": "20 February, 2022",
        "context": "Still just as likely to have come from nature.  Where is the smoking gun?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "msgordon1947",
        "time": "3 February, 2022",
        "context": "Why were the scientist ignored about the origins of the virus? It can't be for just one simple reason. Those that applied the pressure to suppress the origins of covid should be charged with war crimes in the international world court.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "sciencerocks",
                "time": "4 February, 2022",
                "context": "A physicist who admits he has no biological argument, but just a hunch, can be dismissed.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "rubiks6",
                        "time": "4 February, 2022",
                        "context": "This is your world of science all throughout this article, Dr. Anthropologist. Science is rife with liars, corruption, conspiracies, bribery, ego-building, and every other evil that men do.\n\nI believe in science, I love science, but I surely don't believe scientists. When the Bible and the \"natural\" world seem to offer conflicting evidence, I give priority to the Word of Gᴏᴅ and definitely not to the word of Man.\n\nYou've got your priorities mixed up, mister. You teach heresy and lead others to Hell. You do this for tenure and reputation, grants, and a paycheck. You value being honored by men rather than being honored by Gᴏᴅ. You are as shameful as the Pharisees. They were full of good deeds, too.\n\nThere is nothing that I could ever see or hear that would make me question the most obvious reading of Gᴏᴅ's Word.\n\nYou actually think you're smarter than Gᴏᴅ. Wow.\n----------\n\n\"... funding was also a motive ...\"\nNooooooo. Say it isn't so.\n----------\n\n\"For in six days the Lᴏʀᴅ made the heavens and the earth, the sea and everything that is in them, ...\"\n– Exodus 20.11a (NASB) (Emphasis added.)\nThese are the words Gᴏᴅ the Holy Spirit inspired Moses to write. Not some other words. Their meaning is plain. If you deny these words, you deny the Holy Spirit that inspired them. If you twist these words, you become a liar. Gᴏᴅ, the Holy Spirit cannot lie.",
                        "good": "0",
                        "bad": "2",
                        "replies": [
                            {
                                "user_name": "lycopine",
                                "time": "4 February, 2022",
                                "context": "You mean the word of YOUR god. There's plenty of others better than yours",
                                "good": "0",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "rubiks6",
                                        "time": "4 February, 2022",
                                        "context": "He is your God, too. He is your Creator and sustains your life. You will worship Him.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": [
                                            {
                                                "user_name": "lycopine",
                                                "time": "5 February, 2022",
                                                "context": "totally wrong rubbish6.\nMY god is YOUR creator and also the creator of YOUR god. YOU will worship him or MY god will send you to your god's h3ll which MY god created too for believers in false idols like you.\nAnd you cannot prove otherwise.\nYOU are wrong and I am right.",
                                                "good": "0",
                                                "bad": "0",
                                                "replies": [
                                                    {
                                                        "user_name": "rubiks6",
                                                        "time": "5 February, 2022",
                                                        "context": "You’re babbling. B’bye.",
                                                        "good": "0",
                                                        "bad": "0",
                                                        "replies": [
                                                            {
                                                                "user_name": "lycopine",
                                                                "time": "5 February, 2022",
                                                                "context": "actually, it was you who was babbling and have been every time you bring up your arrogant self righteous truth claim that your god is the one and only.\nBecause it is NOT.",
                                                                "good": "0",
                                                                "bad": "0",
                                                                "replies": [
                                                                    {
                                                                        "user_name": "rubiks6",
                                                                        "time": "5 February, 2022",
                                                                        "context": "Says you.",
                                                                        "good": "0",
                                                                        "bad": "0",
                                                                        "replies": [
                                                                            {
                                                                                "user_name": "lycopine",
                                                                                "time": "5 February, 2022",
                                                                                "context": "says you, since you have already declared YOUR god is the one and only. And more than once I might add...",
                                                                                "good": "0",
                                                                                "bad": "0",
                                                                                "replies": [
                                                                                    {
                                                                                        "user_name": "rubiks6",
                                                                                        "time": "5 February, 2022",
                                                                                        "context": "The one and only true, living God (there can be only one) is, of course, everyone’s God. This is a logical tautology. Of course, He is my God. Am I not part of “everyone”? So are you. The God that created you is your God, whether or not you choose to acknowledge Him.",
                                                                                        "good": "0",
                                                                                        "bad": "0",
                                                                                        "replies": [
                                                                                            {
                                                                                                "user_name": "lycopine",
                                                                                                "time": "6 February, 2022",
                                                                                                "context": "It is your stated opinion, taught to you by someone else, that there is only one god. You have ZERO proof of the existence of such. And the FACT that you declare there is has ZERO logic or reason to support your arrogant self righteous truth claim either. Further, you go on to declare the Earth was created by your god and is less than 6000 years old and other assorted biblical nonsense.\nAll that is absolute FACT, whether or not you accept it, those FACTS will not CHANGE.",
                                                                                                "good": "0",
                                                                                                "bad": "0",
                                                                                                "replies": []
                                                                                            }
                                                                                        ]
                                                                                    }
                                                                                ]
                                                                            }
                                                                        ]
                                                                    }
                                                                ]
                                                            }
                                                        ]
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "chinasucksjoe",
        "time": "4 February, 2022",
        "context": "Ask yourself why did so many scientists  get caught flat footed when for 30 plus years  they have studied pandemics and  have even worked  with Sars and  aids and such. This whole situation  our government  has  covered up and  lied to Americans  about it. ",
        "good": "0",
        "bad": "1",
        "replies": [
            {
                "user_name": "nepawoods",
                "time": "4 February, 2022",
                "context": "Scientists came up with vaccines very quickly.\n\nAsk yourself why Trump disbanded the NSC's Global Health Security and Biodefense unit, responsible for pandemic preparedness, in May 2018.",
                "good": "3",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "chinasucksjoe",
                        "time": "4 February, 2022",
                        "context": "science  has been studying  this type of viruses for years and they New exactly what happened.  Anyone with any experience  with infectious disease a knew what it was and how it happened.  They New masks wouldn't work atleast the ones they gave to the masses.  Find yourself a video of what it does to your lungs then go look at old viruses and plagues",
                        "good": "0",
                        "bad": "1",
                        "replies": [
                            {
                                "user_name": "skihunter",
                                "time": "6 February, 2022",
                                "context": "knew",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "user_name": "yosemitesteve",
                        "time": "7 February, 2022",
                        "context": "The Trump admin disbanded and restructured the NSC's Global Health Security and Biodefense unit because it had become bloated and dysfunctional under Obama admin. reaching a total of 400+ scientist, which many agreed that was far to many. They did not disband the pandemic response unit, which was a lie put forth before the election by leftist activist.  In fact the Trump admin did not fire any of them, some quit in protest while others were put into different positions.  Source: USA Today fact check",
                        "good": "0",
                        "bad": "1",
                        "replies": [
                            {
                                "user_name": "nepawoods",
                                "time": "7 February, 2022",
                                "context": "\"They did not disband the pandemic response unit\" ... They did, according to the USA Today fact check that you cited.  Two quotes from that source you cited:\n\n\"In May 2018, former national security adviser John Bolton restructured Trump's National Security Council and disbanded the global health unit.\"\n\n\"The Directorate of Global Health Security and Biodefense was disbanded under Trump's then-national security adviser John Bolton.\"",
                                "good": "0",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "yosemitesteve",
                                        "time": "8 February, 2022",
                                        "context": "\"The Directorate of Global Health Security and Biodefense was disbanded under Trump's then-national security adviser John Bolton. But Trump didn't fire its members.\"  Source USA Today fact check.  Meaning that the team was still there, as I stated above.  Be sure to include and read the entire statement.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": [
                                            {
                                                "user_name": "nepawoods",
                                                "time": "8 February, 2022",
                                                "context": "It doesn't matter that he didn't fire them.  He kept them on, doing other things.  And many left voluntarily, and predictably, after he disbanded the unit.",
                                                "good": "0",
                                                "bad": "0",
                                                "replies": [
                                                    {
                                                        "user_name": "yosemitesteve",
                                                        "time": "9 February, 2022",
                                                        "context": "They were doing the same thing under a different department and leadership, and yes it does matter because #1 the left lied about The Trump admin firing everyone in that unit and #2 it means that the experience and knowledge that they possessed remained at the disposal of the Trump admin.",
                                                        "good": "0",
                                                        "bad": "0",
                                                        "replies": []
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "goodwillwin",
                "time": "4 February, 2022",
                "context": "And now, HIV has suddenly had a very startling mutation.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "❤DEFENDTHEINNOCENT!",
        "time": "26 February, 2022",
        "context": "Well, liberals hate truth being spoken ....so..... ya know..... this isn't a surprise. 🤔😉",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "f16bmathis423",
        "time": "28 February, 2022",
        "context": "Trust your government and scientists. They are here to protect you and keep you safe. For your protection. You should not question their commands. There is nothing to see here, move along...",
        "good": "0",
        "bad": "0",
        "replies": []
    }
]