[
    {
        "user_name": "wiserthen",
        "time": "12 September, 2022",
        "context": "Trump just arrived in DC — the place where he launched an Insurrection & the place he stole nuclear documents from. He made no prior announcement & the media was caught off guard.",
        "good": "1",
        "bad": "2",
        "replies": [
            {
                "user_name": "irondumpling",
                "time": "12 September, 2022",
                "context": "Where did you hear that? The other voice in your head?",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "wiserthen",
        "time": "12 September, 2022",
        "context": "Is it possible that he can be indicted before the special master does whatever?",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "trommo",
                "time": "12 September, 2022",
                "context": "yes",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "wiserthen",
        "time": "12 September, 2022",
        "context": "On May 6, 2021, NARA asked Donald Trump to return missing documents. on May 9, 2021, Donald Trump was filmed leaving Florida with dozens of boxes, bound for Bedminster.",
        "good": "0",
        "bad": "2",
        "replies": [
            {
                "user_name": "AccessDenied343",
                "time": "12 September, 2022",
                "context": "So you really believe the NWO is going to do great things for mankind and the planet. And the democrats should be applauding that. Think it through.",
                "good": "0",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "trommo",
                        "time": "12 September, 2022",
                        "context": "assuming you have a point here, why would we look to a pathologically lying narcissistic con-man to save us?",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "AccessDenied343",
                                "time": "12 September, 2022",
                                "context": "Since the NWO wants to rule the planet, why wouldn't they support Trump if he's so corrupt? They need to crush all nations to have a One World Government. Therefore Trump should be their man. Explain that.",
                                "good": "0",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "trommo",
                                        "time": "12 September, 2022",
                                        "context": "sorry, i have no idea what you're talking about. have a nice day.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "wiserthen",
        "time": "12 September, 2022",
        "context": "There's only one reason Trump is in DC right now ... he'll be appearing before a grand jury this week. ",
        "good": "0",
        "bad": "1",
        "replies": [
            {
                "user_name": "arcanaknight",
                "time": "12 September, 2022",
                "context": "There's other possible reasons: he could be there to go to Walter Reed hospital.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "hapki259",
        "time": "12 September, 2022",
        "context": "Can you even truth the Department of Democrat justice in reality it the Democrat department of injustice base on Democrat one party rule of liars.\nGiven lawyers and FBI/KGB Gestapo lie in court the people who did it got rewarded by Democrat for NONE served time for lying before fed court that caused injustice warrants for political ends and put people in Jail base fraud warrant gotten by lying before a Democrat judge. \nThe fact the Department of Democrat. injustice is leaking ideas base for political distortion for the Democrat brainwashed voter who is immoral given they are secular. \nWhy is the Democrat department is leaking to justify a fraud warrant to raid candidate for President and putting in the warrant the WORD espionage with secret Service surrounding trump at all times.  Who do do Espionage with the Secret Service right there.  The democrat department of lying justice could ask the secret service to pick up boxes they wanted so could not be base boxes for the achieve and it non criminal status.  Base on NON Criminal Status 30 FBI/KGB thugs spent 9hrs broke into safe and being the Democrat perverts they are went through his Wife bed room and took 3 passports and would let his Lawyer watch what they did and cover up cameras all to hide what they were doing being liars.  \nIf it lie it comes from DC Democrat departments to overthrow the Constitution and have fraud elections like do in all communist countries. This judge is being intimidated to pick Democrat person for lies ",
        "good": "1",
        "bad": "1",
        "replies": [
            {
                "user_name": "trommo",
                "time": "12 September, 2022",
                "context": "i'm curious, what language did you write this in before pushing it through Google translate?",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "cadetbonespurs094",
                        "time": "12 September, 2022",
                        "context": "My analysis says Russian.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "lucidatious283",
                "time": "12 September, 2022",
                "context": "Can't tell if Putin wrote this or Tucker......",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "wiserthen",
        "time": "12 September, 2022",
        "context": "I'm not saying Trump is in D.C. tonight to turn himself in because of a sealed indictment. I'm saying IF Trump was in D.C. to turn himself in because of a sealed indictment, it would look a LOT like this.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Crscrsbrgr",
        "time": "12 September, 2022",
        "context": "Go straight to he((, Amanpour.  You have NO \"standing\" for such a demand.  As in, NONE!",
        "good": "1",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "wiserthen",
        "time": "12 September, 2022",
        "context": "DOJ’s key argument in response to the S.D. Fl. special master decision was that it impedes a current and very serious investigation. What better way to demonstrate just how serious they are than to indict Trump on Monday morning?",
        "good": "3",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "wiserthen",
        "time": "12 September, 2022",
        "context": "**  Trump randomly flying into Dulles tonight in a golf uniform without his Red Hat and no secret service in the photo and being greeted by the Sheriff on the tarmac is really weird. And I can't tell on the video if his hands are behind his back. ",
        "good": "0",
        "bad": "1",
        "replies": [
            {
                "user_name": "irondumpling",
                "time": "12 September, 2022",
                "context": "TDS",
                "good": "1",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "trommo",
                        "time": "12 September, 2022",
                        "context": "Trump Detainment Syndrome",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "PurpleFlower",
        "time": "12 September, 2022",
        "context": "The last time you could trust the FBI was when it was a Quinn Martin Production.",
        "good": "1",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "gbs88670",
        "time": "12 September, 2022",
        "context": "I find it interesting that no one mentions WHO appoints the \"Special Master\". That is not mentioned anywhere in any story. Does anyone have an idea? Is it the DOJ, FBE Biden, AG or a democrat lacky? ",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "donalddumpprofessionalvictim",
                "time": "12 September, 2022",
                "context": "Whoever makes GQP losers cry more about it 😭😭😭",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "malphilos",
                "time": "12 September, 2022",
                "context": "The judge.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "HoodoooVoodooBlood",
        "time": "12 September, 2022",
        "context": "Joe is the Alpha. Donald is the Beta. The Special Master is Donald's Special Master Beta.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "pkruse24724",
        "time": "12 September, 2022",
        "context": "What’s there to be ‘transparent’ about? Trump stole Top Secret documents — probably to sell to our enemies — and the FBI retrieved them. Judge Cannon’s ruling has been universally panned as being clueless. Lock Trump up!",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "proudultramaga!!!",
                "time": "12 September, 2022",
                "context": "OMG! You sound like a tin foil hat person who watches MSNBC ",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "arcanaknight",
                "time": "12 September, 2022",
                "context": "I doubt he took those documents to sell them. He's such a narcissist that he might have just taken them so he could brag about having them. That doesn't rule out them getting their hands on those files though because of the disregard with which he treated their security and storage.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "zekeyboy1",
        "time": "20 September, 2022",
        "context": "Trump demanded a special master and won. He asked for Raymond Dearie and won. Now his legal team is upset that Dearie is asking for evidence of what he claims to have declassified and is setting aggressive deadlines.\nWhat a clown...",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "KMFN13",
        "time": "12 September, 2022",
        "context": "Perhaps he could list out what he believes was taken that is priveledged or personal. Why shouldn't the burden of truth lie with the one who feels they've been aggrieved. Has he looked to see if anything important to him was missing? Or is it easier to just whine?",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "malphilos",
        "time": "12 September, 2022",
        "context": "Ok, as a federal prosecutor he knows this:\n\"..., because the transparency wasn’t there when they executed the warrant, when they secured the warrant, when they went through Mar-a-Lago.\"\nis BS. They don't make public announcements about filing for a warrant or in advance of conducting a search.\nThis is desperation, as evidenced by: \"Host Trey Gowdy remarked, \"I think she is tired of the leaks.\"\nSo we want transparency except when we don't want transparency. And the taint team is good except we can't trust the taint team.\nMAGA double speak.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "proudultramaga!!!",
        "time": "12 September, 2022",
        "context": "FBI went to try and find any evidence about their role in rigging the 2020 election. Common sense would tell every one this!!",
        "good": "0",
        "bad": "1",
        "replies": [
            {
                "user_name": "malphilos",
                "time": "12 September, 2022",
                "context": "If he had such evidence, why didn't Trump present it instead of trying 61 times to pass off empty nonsense?\nCommon sense.",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "lucidatious283",
                "time": "12 September, 2022",
                "context": "Qommon sense is not what you think it is Qtip.....................",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "i-see-you",
        "time": "12 September, 2022",
        "context": "This call for transparency is nothing more than a major deflection to take our attention away from what we already know, which is: hundreds of records marked classified and possibly many more missing from empty classified envelopes. Trump deserves due-process like anyone else but when it comes to national security (and a possible criminal investigation) the US's top law-enforcement - who have since been demonized and vilified as an attempt to shift blame and focus, needs to be left alone to do its job. You want transparrancy, wait for the indictments. Trump and the Right are not the victims here, our National Security is. ",
        "good": "5",
        "bad": "1",
        "replies": [
            {
                "user_name": "Toro68",
                "time": "12 September, 2022",
                "context": "Spot on!  The evidence of a serious felony committed by Trump and his henchmen is irrefutable and shows a huge danger to National security. Put all the perpetrators of this security breech in prison now and get started on trying to assess the damage to the American intelligence gathering network and effort.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "trommo",
        "time": "12 September, 2022",
        "context": "Tolman: \"There used to be a time when you really took the word of the DOJ\"\nyou mean when Barr was covering for Trump's numerous crimes?",
        "good": "3",
        "bad": "3",
        "replies": []
    }
]