[
    {
        "user_name": "4cx35000c",
        "time": "15 May, 2021",
        "context": "Swamp gas.",
        "good": "23",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "un57145",
        "time": "15 May, 2021",
        "context": "Curious on why the Military has not tried to engage these objects, if they were Russians or Chinese we would have...maybe they have and were unable too? The Oceans are vast and mostly unexplored...could that be their point of origin?",
        "good": "6",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "Goodgolly",
        "time": "15 May, 2021",
        "context": "We might have some in Congress.",
        "good": "110",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "Thatswhatsheuttered",
        "time": "15 May, 2021",
        "context": "Cool...the end is near",
        "good": "16",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "demsrcommietraitors",
        "time": "15 May, 2021",
        "context": "I'm not the least bit concerned with \"UFOs\".\n\nBut the communists in the Democrat party and the White House have got me riled up pretty good.",
        "good": "205",
        "bad": "8",
        "replies": []
    },
    {
        "user_name": "claymatthews11",
        "time": "15 May, 2021",
        "context": "Maybe they’re the space lasers Marge has been yapping about?",
        "good": "4",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "njordr",
        "time": "15 May, 2021",
        "context": "If they were hostile or a \"security threat\" then with all the stupid s_t ours and other world leaders do, I'm sure we would have learned it by now in very spectacular ways.",
        "good": "11",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "bigmikegalaxy",
        "time": "15 May, 2021",
        "context": "Now I'm probably wrong.  Just going out on a limb here.  But isn't it even slightly possible that what they've been witnessing is merely an anteater on crack?  The shape fits.  The odd movements.  And as fast and fierce as they are naturally ....Just sayin.  \"It's possible\"",
        "good": "3",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "rwday",
        "time": "15 May, 2021",
        "context": "Yawn!!!!!!!!  Click.",
        "good": "2",
        "bad": "7",
        "replies": []
    },
    {
        "user_name": "LibtardsAreToBlame",
        "time": "15 May, 2021",
        "context": "Well it would be pretty arrogant to think we’re the only ones in this universe",
        "good": "140",
        "bad": "9",
        "replies": []
    },
    {
        "user_name": "GenoNavy",
        "time": "15 May, 2021",
        "context": "Both Jesus and Mary ascended into the heavens.  Jesus will return and possibly is about to complete his promise.  With God all things can happen.",
        "good": "15",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "sigsauer911",
        "time": "15 May, 2021",
        "context": "If there is not a coordinated effort to identify and eliminate this threat, then it is not a threat. It is the military.",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "samalderson341",
        "time": "15 May, 2021",
        "context": "Why are navy pilots the only ones seeing UFO's",
        "good": "7",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "everyday",
        "time": "15 May, 2021",
        "context": "It's always a fuzzy, rain soaked infrared or night vision. The night vision ufo blinks every 5 seconds, just like an airplane. Why would a ufo blink?",
        "good": "16",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "outlaws",
        "time": "15 May, 2021",
        "context": "Someone's in the know, we certainly aren't.",
        "good": "18",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "outlaws",
        "time": "15 May, 2021",
        "context": "Wouldn't doubt that there's an underwater base for elites to escape the coming apocalypse.",
        "good": "8",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "redskunk1",
        "time": "15 May, 2021",
        "context": "Let’s summarize:  since Joe Biden has been in office the US has been tested by adversaries such as Russia, China, Iran, N Korea and the drug cartels  .... and now even the aliens in the UFOs are challenging the weak illegitimate president.   What’s next?",
        "good": "94",
        "bad": "8",
        "replies": []
    },
    {
        "user_name": "RobVG50",
        "time": "15 May, 2021",
        "context": "Imagine if the US had their technology.  Maybe some day we will.",
        "good": "21",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "nationalist1919",
        "time": "15 May, 2021",
        "context": "Why didn't he make contact with them?",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "theantifederalist",
        "time": "15 May, 2021",
        "context": "We can be thankful for the fact that, notwithstanding evidence of \"vastly\" superior technology, none of these craft/objects have shown aggressive intent. I suppose that suggests that most of them are probes, simply gathering information. What actions that might bring about at a later time, one can only guess at.\n\nI wonder if we have tried to communicate with any of these objects, and if so, whether any have responded. I don't suppose the government would be very forthcoming with that information.",
        "good": "655",
        "bad": "18",
        "replies": []
    },
    {
        "user_name": "ursopc",
        "time": "15 May, 2021",
        "context": "Didn’t Schwarzenegger fight an alien that looked a lot like Maxine Waters in the Predator?",
        "good": "247",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "abetterdaycoming",
        "time": "15 May, 2021",
        "context": "Is there something there..yes... Is it a threat to us in any way..  most likely...  Will we soon find out whether from Earth or somewhere else... Not unless they're ready to divulge their identities..",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "zekepit",
        "time": "15 May, 2021",
        "context": "UFO'S are simply observing how we \"could\" of been...",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "chumley111",
        "time": "15 May, 2021",
        "context": "Isn't it strange given today's technology, high tech equipment and all the crystal clear pictures that are guaranteed.......EXCEPT......any picture of a UFO or Bigfoot!\nThen pictures are taken of other things with the same equipment and crystal clear is the norm!",
        "good": "22",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "philly805",
        "time": "15 May, 2021",
        "context": "You'd think UFOs would eventually want to say hi.",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "darryl9430139",
        "time": "15 May, 2021",
        "context": "Are they saying the UFO’s brought covid with them?\nThen why is covid money being used to investigate them????",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "doesn'thavetobethisway",
        "time": "15 May, 2021",
        "context": "Ever get the feeling we're being prepped for a big reveal by the government?",
        "good": "142",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "Gettinfedup",
        "time": "15 May, 2021",
        "context": "NOT saying aliens don’t exist. But they probably us. Us as in what we call humans as we pass by them on the streets. They/we have technology far greater than what they let on. If we have an alien invasion DONT be surprised it’s our own people killin us as we run to our governments for safety! ",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "erbappalachia",
        "time": "15 May, 2021",
        "context": "Explanation canbe found here, have to read alot to find it. formypeople.org",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "DesertStormTrooper",
        "time": "15 May, 2021",
        "context": "Can fly 13,000 mph? Must get great gas mileage.",
        "good": "7",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "chuckolat42",
        "time": "15 May, 2021",
        "context": "UFO, unidentified flying object, no where in that does it say anything about Aliens. It just means that the person or persons that saw it/them didn't know what it/them were. Way to many people jump from UFO to Alien Spaceship without any kind of evidence. Sounds just like Dems saying if there is a problem with the government that it is Trumps fault.",
        "good": "17",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "BluePopcorn",
        "time": "15 May, 2021",
        "context": "Crack is wack.",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "summertimebluesgoss",
        "time": "15 May, 2021",
        "context": "Why don’t they just land and introduce themselves?",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "PimpDaddyDavid",
        "time": "15 May, 2021",
        "context": "Who cares. If they can travel space then we are just a stupid reality show for them. Or a zoo for them to look up close. Because we have a certain group of people who are beyond stupid. ",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "chumley111",
        "time": "15 May, 2021",
        "context": "To a military pilot.....If you see a UFO shoot it down..\nTo those in the woods.....If you see a strange animal or Bigfoot.....SHOOT IT!!\n\nThis is not hard!",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "trump2024!!311",
        "time": "15 May, 2021",
        "context": "Are all unexplained things \"blurry\" in color? Why didnt they scramble jets to see this? No better cameras to look at this? Shady...",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "deputykent",
        "time": "15 May, 2021",
        "context": "I hope this is a bus to pick up all BLM, ANTIFA members and Maxine Waters. Of course we must remember Waters won't board without a few Sky Marshalls sacrificed to ride along. Or maybe this is just some life form that wants to rescue the homeless from our racist country.",
        "good": "12",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "fangflyer2",
        "time": "15 May, 2021",
        "context": "The Ten Lost Tribes of Israel?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "steve1633",
        "time": "15 May, 2021",
        "context": "So the UFO's are a security threat.  And what are you going to do about it?  Earthquakes and volcanoes are security threats also, as are lefty Democrats.  Schyeete happens.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "CyanBox",
        "time": "15 May, 2021",
        "context": "Has any one alerted Tucker Carlson about the UFOs?  His people are trying to find him to bring him back from were he came.",
        "good": "2",
        "bad": "7",
        "replies": []
    },
    {
        "user_name": "VeroVeritas",
        "time": "15 May, 2021",
        "context": "I guess that's why he's now a former \"Navy Pilot\"\nSame old boring page-filler story with the same old pic. \n(A sunlight reflection, always show as a negative image so it's not so obvious!)\nDUH?\n\nClean your cockpit canopy and be aware that sunlight reflection on the canopy and overheard display are UFO's\nGeeez!\nNo wonder he's an ex-pilot! \nAll you have to worry now is for which airline he will fly...\n\nFor all UFO addicts and conspiracy theorists and in need of finding a meaning in their empty lives: \nSearch Youtube \"F16 over the shoulder\" and see all for yourself!\nThat may help you to snap out of it!",
        "good": "1",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "sigsauer911",
        "time": "15 May, 2021",
        "context": "Can somebody tell me why everyone is using cameras front the 1950’s to capture these ?????",
        "good": "14",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "makeminefreedom228",
        "time": "15 May, 2021",
        "context": "Strange that they fear our ships and planes. Any species with a technology that advanced shouldn't fear anyone.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "gamblerlv836",
        "time": "15 May, 2021",
        "context": "The only reason they're not landing on earth is because they know we're in a pandemic. It is in all of the newspapers, most probably the Martian Express too",
        "good": "7",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "Power_Is_Work_Over_Time",
        "time": "15 May, 2021",
        "context": "Nothing is being done, because nothing can be done. \nObserve and learn is what we are stuck with, like it or not. \nImprove our surveillance equipment, and try to figure out if we have any options.\nRight now we have no options.",
        "good": "664",
        "bad": "14",
        "replies": []
    },
    {
        "user_name": "mic56700",
        "time": "15 May, 2021",
        "context": "Evidence of advanced races is all around us. If people would only open their eyes and minds.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "ricardoh180",
        "time": "15 May, 2021",
        "context": "I have no doubt something is flying around out there but I don't understand not having a picture of something that was happening every day. Is the government holding back?",
        "good": "23",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "YSONEGATIVE948",
        "time": "15 May, 2021",
        "context": "If we cannot identify them then surely they too cannot identify us.",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "beefeater70",
        "time": "15 May, 2021",
        "context": "Why doesn't anyone just fire on them to see what happens?",
        "good": "7",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "Blood_on_Dems_Hands",
        "time": "15 May, 2021",
        "context": "Aliens live among us. They call themselves Democrats.",
        "good": "12",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "BfloBob682",
        "time": "15 May, 2021",
        "context": "With the tech being observed they could have blown us up by now. Probably the Federation scoping to see if Erf is ready to join. Smart money says not. ",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "GoldFlask",
        "time": "15 May, 2021",
        "context": "Citizens will believe that a orange fruit can put out orange spray paint. Yet they will not believe in Jesus. Madness.",
        "good": "13",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "wolfgan1",
        "time": "15 May, 2021",
        "context": "May be people on Mars would call our helicopters there CFOs as well.  Hope when we got there we will be friendly to them and do no harm.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "PurpleGlasses",
        "time": "15 May, 2021",
        "context": "The Government is getting closer to releasing the truth about these objects.  Which is 1) They are real and 2) They have no clue what they are or where they come from.  Many theories out there.  From unknown natural phenomenon, undersea creatures, dimensional shifts, aliens from another galaxy, high tech drones from a rival nation, etc.  They just don’t know.",
        "good": "106",
        "bad": "8",
        "replies": []
    },
    {
        "user_name": "curiousgeorge899",
        "time": "15 May, 2021",
        "context": "See the footage of the one submerging in the ocean? Wow!! Hard to explain.",
        "good": "8",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "BlueBattery",
        "time": "15 May, 2021",
        "context": "unidentified?.....we should be knowing all air traffic, from a humming bird to a mig jet....",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "yfreddig",
        "time": "15 May, 2021",
        "context": "If they're a threat to security, they've yet to exercise it.  Let's concentrate on the real threat to security sitting in The White House.",
        "good": "463",
        "bad": "19",
        "replies": []
    },
    {
        "user_name": "CA2020",
        "time": "15 May, 2021",
        "context": "I'll take the word of Naval aviators any day of the week over the opinions of folks on the Fox message boards.\n\nThese cats are exceptional at identifying targets so if they say its something they can't explain, then you better believe its something out of the ordinary.",
        "good": "72",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "kadore7",
        "time": "15 May, 2021",
        "context": "By the time you see it whatever is going to happen has, but I still would like to go 13,000mph.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Joemomma033",
        "time": "15 May, 2021",
        "context": "The true masters of earth",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "whatnowcornpop",
        "time": "15 May, 2021",
        "context": "On a freaky scale this is right up there with \"Tales of Brave Ulysses\" by Cream.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "libsrnuts855",
        "time": "15 May, 2021",
        "context": "any alien smart enough to get here probably wouldn't...illegals excepted",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "AllYourBaseRBelongToUs",
        "time": "15 May, 2021",
        "context": "UFO doesn't mean little green or gray men.  It just means we don't know what they are.",
        "good": "20",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "skyad99",
        "time": "15 May, 2021",
        "context": "Why would the government deny this for years and claim anyone who saw a UFO was crazy and the switch to admitting they exist?  They are setting us up for something and probably not anything good.",
        "good": "32",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "wwolfe99",
        "time": "15 May, 2021",
        "context": "After listening to someone from the 'woke' population speak.  It's not hard at all to believe that smarter beings exist.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "oilfieldgreasemonkey",
        "time": "15 May, 2021",
        "context": "They're our times foo-fighters!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "LivFreOrDi215",
        "time": "15 May, 2021",
        "context": "If all this is True... they are Warning the Earth ...\nWe are destroying each other .... and it must Stop!",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "funkhowser",
        "time": "15 May, 2021",
        "context": "13,000 MPH is nothing.  Biden is promising 21,000 MPH air travel.",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "liagg272",
        "time": "15 May, 2021",
        "context": "Read the 1970 book \"Invisible Residents\" by the late Ivan Sanderson. The volume of eyewitness reports of this phenomenon dating back to the 1700's is staggering.",
        "good": "28",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bootystank",
        "time": "15 May, 2021",
        "context": "Let’s hope the “visitors” are antiCommunist. ",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jonjon_of_jonjon",
        "time": "15 May, 2021",
        "context": "When I was 14, I saw a UFO. It was saucer shaped and had blue designs on a white background. I was startled, because when it flew directly overhead, it made absolutely no sound. That was the last time I talked back to my Mom in the kitchen.",
        "good": "490",
        "bad": "32",
        "replies": []
    },
    {
        "user_name": "Josor",
        "time": "15 May, 2021",
        "context": "Did anyone consider that it might be some of Maxine Waters' wigs that blew off?",
        "good": "27",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "america1st1204",
        "time": "15 May, 2021",
        "context": "They're probably here to find out once and for all if Big Foot and The Loch Ness Monster really exist.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "DocJLK",
        "time": "15 May, 2021",
        "context": "Are they craft/vehicles?   I doubt that.  Could they be something like a hologram ",
        "good": "3",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "aerionflux",
        "time": "15 May, 2021",
        "context": "Of all the footage of UFO's since the invention of the camera, not one picture is clear enough to absolutely say; \"That Mr. President, is clearly not of this earth.\" \n\nOh, and I don't mean Joe Biden*, I mean a real president.",
        "good": "29",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "YourCar’sExtendedWarranty",
        "time": "15 May, 2021",
        "context": "They’re conditioning the population for the reveal",
        "good": "50",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "william018",
        "time": "15 May, 2021",
        "context": "Think China",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "ringo789",
        "time": "15 May, 2021",
        "context": "If it’s of superior intelligence then we can be certain it is not from the Democrats. ",
        "good": "21",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "applesfromearth",
        "time": "15 May, 2021",
        "context": "Oh boy, now here's another story for the loonie right to start conspiracy theories with.  MTG will no doubt use this story to refresh her jewish space laser theory.  QAnon followers will find something to tie the UFOs to pedophiles.  They will probably say the left is colluding with aliens to strengthen their Kabal.  Fox really should avoid reporting on such things considering how gullible and childish their viewers are.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Chris.T562",
        "time": "15 May, 2021",
        "context": "If I was a foreign Country I would be regularly using Unmanned drones for surveillance of all important U.S. locations. Frankly, I would just assume they are!",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rfvette",
        "time": "15 May, 2021",
        "context": "\"A former Navy pilot says he witnessed UFOs flying in restricted airspace off the coast of Virginia nearly every day for two years beginning in 2019.\"\n\nCan this guy Identify anything at all? Get him some glasses.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "sargejohn362",
        "time": "15 May, 2021",
        "context": "Well if they're a security threat , they must be Democrats...",
        "good": "13",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "jfw1953175",
        "time": "15 May, 2021",
        "context": "If it is *space aliens* they are probably up there watching the USA and laughing their butts of at a people dumb enough to elect *Cornpop and Trixie*...",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "justmyopinion713",
        "time": "15 May, 2021",
        "context": "There are things happening in our country currently that even 20 years ago would be considered insane. Our Justice Dept and FBI are openly corrupt, our courts are compromised, people in power suddenly change their opinions. I'm becoming concerned that the aliens ARE here and controlling the highest order of government.",
        "good": "153",
        "bad": "8",
        "replies": []
    },
    {
        "user_name": "midlandkid",
        "time": "15 May, 2021",
        "context": "What I don’t understand is ..if we can see the surface of Mars perfectly clear...well is this the best we can do to see these things?",
        "good": "8",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "americanfirst841",
        "time": "15 May, 2021",
        "context": "These objects are likely Earth People from underwater Atlantis.",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "BluePopcorn",
        "time": "15 May, 2021",
        "context": "This is why I stopped watching Tucker and Fox news.  Too much garbage about UFOs and to many  Democrats on their channel.",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "PurpleSushi",
        "time": "15 May, 2021",
        "context": "A few observations:\n1) The 100 g maneuvers the aircraft make are incompatible with life. Therefore they are unmanned.\n2) The aircraft, if weaponized, would not be able to carry much payload, so the threat potential is most likely limited to reconnaissance. \n3) If the aircraft are from another world it is highly unlikely they wouldn't be able to maintain the supply chain needed to engage in a sustained conflict, so their mission would likely be one of scientific exploration and not military.",
        "good": "6",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "well..bye",
        "time": "15 May, 2021",
        "context": "They just come to record our uncivilized society that they watch on a weekly series called, “What will the stupid earthlings do this week?” Watch as Joe Biden, the President of the most powerful country in earth, is told not to speak to reporters because he has no idea what he’s saying.",
        "good": "20",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "earlofoil",
        "time": "15 May, 2021",
        "context": "Oh boy I see another Democrat lockdown coming-----",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "NoDisplayName404",
        "time": "15 May, 2021",
        "context": "considering our nearest galactic \"neighbor\" is several hundred thousand light years away, it seems doubtful the UFOs are extra-terrestrial, unless they have (as some suppose) a way to travel as fast as a thought........ or, maybe telepathic projection of a physical object?  i agree that we pretend they're not real at our peril.",
        "good": "8",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "well..bye",
        "time": "15 May, 2021",
        "context": "Yeah, because we don’t have anything better to worry about in our society right now, so we better focus on E.T. and Alf.",
        "good": "3",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "Temp43060",
        "time": "15 May, 2021",
        "context": "The Democrats could turn this into a major crisis irh little effort.  Sacrafice of personal freedoms and massive tax increases all tequired to overcome the UFO threat.",
        "good": "17",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "Jesusforpresident679",
        "time": "15 May, 2021",
        "context": "I don’t think that you can use the word “credible” and “alien” in the same sentence.  Unless you are speaking of illegal aliens.  Then it’s a credible threat. ",
        "good": "21",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "MissTawse",
        "time": "15 May, 2021",
        "context": "An alien invasion....................yea, we would probably be better off under Martian rule than Biden and his socialist losers.",
        "good": "21",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "LochNessMonster",
        "time": "15 May, 2021",
        "context": "Hopefully they don't say \"Take me to your leader\"",
        "good": "14",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "GoldTrumpet",
        "time": "15 May, 2021",
        "context": "Sounds like a job for our Space Force. Go get em guys!!",
        "good": "4",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "Kodakmoment499",
        "time": "15 May, 2021",
        "context": "United States Space Command. \"Klaatu Barada Nikto.\"",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jeff_w_",
        "time": "15 May, 2021",
        "context": "Marty and Doc mean you no harm.  They just need some plutonium for the flux-capacitor.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "owenmarshall976",
        "time": "15 May, 2021",
        "context": "'IF' they decide to attack, and we don't have the technology to effectively defend against them, then what? Do we call Will Smith?",
        "good": "26",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "lilbob2",
        "time": "15 May, 2021",
        "context": "ee",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "kycolonel73",
        "time": "15 May, 2021",
        "context": "For an alien culture that far technologically advanced what do we have that they could possibly want?  In fact if they look around our planet right now they'll put up a giant \"Danger ahead, keep out\" sign a couple of light years away from Earth!",
        "good": "13",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Gettinfedup",
        "time": "15 May, 2021",
        "context": "If people weren’t so caught up in drama and bring trump and Biden into this and look for truth instead of DRAMA ! They’d realize humans themselves yes HUMANS have mastered anti-gravity! And known how to use anti-gravity since the 40’s! Not saying aliens don’t exist! It’s possible we reverse engineered to find that out! But when an alien invasion happens and it gets blamed on the aliens... well u can speculate from there on.... ",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ivangort",
        "time": "15 May, 2021",
        "context": "Claiming UFO's are a security threat is one thing but since none are known to have attacked anyone I would venture to guess they are benign.  Want to prove their existence once and for all?  Shoot one down if you can.  Doesn't mean some one sitting in their backyard pulling out a gun and shooting at them either.  Better make sure a stray bullet doesn't kill someone.  Because I doubt you'll be able to hit one even if you tried. I think 99% can be proven to be anomalies in nature that can be explained. I would also bet a jet firing a missile or gun couldn't hit one one either.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "ohyou812",
        "time": "15 May, 2021",
        "context": "Green lives matter!",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "overpoweredlevels",
        "time": "15 May, 2021",
        "context": "do we call them \"aliens\" or \"interstellar people\"?",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "No,notaJoke!",
        "time": "15 May, 2021",
        "context": "It looks harmless like a speck of dirt or insect on the lens. Try shooting it next time to see if it's real.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "azneocon",
        "time": "15 May, 2021",
        "context": "All these aliens suddenly appearing.  The occupants are all wearing t-shirts asking slow Joe to please let us in!  They are showing up here and not other places.  Must of heard about all the free stuff we are starting to give away.",
        "good": "12",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "myopinionisasgoodasyours",
        "time": "15 May, 2021",
        "context": "People have been talking about UFOs for decades and it's been blown off by the government UNTIL they need something to distract America.",
        "good": "16",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cjsteel",
        "time": "15 May, 2021",
        "context": "are they going to raise taxes for this real threat like they want to for global warming?",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "wwolfe99",
        "time": "15 May, 2021",
        "context": "If you had been living in a capsule all your life where the climate was controlled and was the same everyday, your entire existence.  Would you land on a planet that had no control over the atmosphere?\nPelosi must be an alien. lol",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "conservativepulpet",
        "time": "15 May, 2021",
        "context": "Cowshite. It's always some grainy oil black and white gun footage of UFO's. That was used in the Korean War. 30 years ago we could read the mint mark on a dime from space. When they start producing film in at least 1080P that you can see it's not from this world, I'll take a look.",
        "good": "12",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "davepk",
        "time": "15 May, 2021",
        "context": "I had dinner with J. Allen Hynek, then the former scientific advisor for Operation Blue Book, in 1974. While he had some hair-raising stories to tell, his public evaluation of UFO phenomena was that there are aerial events we cannot explain, that are beyond our capabilities. But, whether or not these are of extraterrestrial origin is not a conclusion he was willing to make. \nNearly 50 years later, it sounds like the US military has come to about the same conclusion. Not much progress on this question since Blue Book.",
        "good": "160",
        "bad": "14",
        "replies": []
    },
    {
        "user_name": "PurpleWeights",
        "time": "15 May, 2021",
        "context": "Kamala Harris is going to find the root cause of why these aliens are coming here and send money to their planet to fix the problem,",
        "good": "19",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "justmyopinion713",
        "time": "15 May, 2021",
        "context": "Upspeak people are aliens",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "overpoweredlevels",
        "time": "15 May, 2021",
        "context": "its okay,  jeff goldblum and will smith will save us.",
        "good": "3",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "clandock",
        "time": "15 May, 2021",
        "context": "I still doubt it is of extraterrestrial origin.  Alien life probably exists, but just given the vast distances involved it seems unlikely that any ET artifact has ever made it to Earth.\n\nAnd if they somehow figured out how to break the light speed barrier, then there is no point in worrying, because their technology would simply annihilate us if that is what they wanted.",
        "good": "27",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "makeminefreedom228",
        "time": "15 May, 2021",
        "context": "Our military has managed to take a few out. Maybe that's why they keep their distance.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "seattle13024",
        "time": "15 May, 2021",
        "context": "Good thing they don't show any signs of aggression.  Because they could wipe out humans in no time.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "TerenceO'Neil",
        "time": "15 May, 2021",
        "context": "When I see a clear image of a UFO, with an alien waving at me with his little green hand, I’ll believe in life on other planets; every single image and video so far presented, was taken with a 1987 disposable camera",
        "good": "19",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Pastwasbetter",
        "time": "15 May, 2021",
        "context": "Little Green Men Lives Matter (LGMLM)",
        "good": "11",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "HarryBaals404",
        "time": "15 May, 2021",
        "context": "Kamala giggled ",
        "good": "19",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "newthings",
        "time": "15 May, 2021",
        "context": "How can these things maneuver at high speed, hover and turn instantly?Ever watch a cat chase a red laser dot?  Maneuvering at high speed, hovering and turning instantly? Zero mass can do all these things. I believe the pilots are seeing a 3-D version of the red laser dot and the pilots are the cat.  Think military target spoof.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "earlofoil",
        "time": "15 May, 2021",
        "context": "\"Imagine a technology that can do 600 to 700 G-forces, that can fly 13,000 miles an hour, that, that can evade radar and can fly through air and water and possibly space, and oh, by the way, has no obvious signs of propulsion, no wings, no control surfaces and yet still can defy the natural effects of Earth’s gravity.\n\"That’s precisely what we’re seeing,\" Luis Elizondo said.\n\nAnd the Aliens let you live----so what is the problem",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "overpoweredlevels",
        "time": "15 May, 2021",
        "context": "apparently our satellites can't see them,  only \"military\" pilots lol",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "KilgoreTrout272",
        "time": "15 May, 2021",
        "context": "It's probably the pedophile, Communist lizard people from the basement of a basement-less pizza parlor.",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "🧇altereggo🧇",
        "time": "15 May, 2021",
        "context": "What’s up with Aliens and their penchant for Anal Probing?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "TheBenightedworldofDems",
        "time": "15 May, 2021",
        "context": "It’s cool to fantasize about the possibility of alien life, we may have seen UFO’s, but, we have never seen alien life. So until we do, or find a crashed UFO...I choose not believe there is any",
        "good": "4",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "mauler43",
        "time": "15 May, 2021",
        "context": "In 2007, I saw one of these objects while on patrol as a police officer for a large city. A colonel in the US Air-force, had stopped his vehicle in front of me got out and watched this object with me. For about 30 seconds we watched it jump around the sky right above a CIA facility before it shot straight up and out of view in a matter of seconds. While watching this object, I was about to radio in to dispatch over what I was seeing, when this colonel advised me to re-think that course of action telling me that in his position in the Air Force he had seen hundreds of these objects over the year’s, and me putting a call out on the air over what I was witnessing would do nothing but get my name on a list that I probably wouldn’t want to be on. I thought this through for a second and decided he was probably right. So we enjoyed the show the colonel wished me a goodnight and off we went in different directions. Only thing that I wished happened was that I wished smartphones would have been around then, this object was only about 50 feet above the roof of this two story building it was above, as close as I was to this object it would have made for highly detailed photos and video of it.",
        "good": "37",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "justmyopinion713",
        "time": "15 May, 2021",
        "context": "Maxine, Nancy and Chuck are aliens... there's no other explanation",
        "good": "13",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "fascisttrump",
        "time": "15 May, 2021",
        "context": ". . yawn . . .these are just earth crafts from the future - probably some history project - maybe even holograms projected into the past . . .not a threat; we'd already be enslaved by them if they were.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "amsdadtodd1",
        "time": "15 May, 2021",
        "context": "A report on UFO's is part of a COVID relief bill? That's what Democrats want to do with their thin, temporary majority?",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "CV60",
        "time": "15 May, 2021",
        "context": "I doubt they’re manned due to the extreme dynamics.  My guess is advanced monitor drones being controlled from a central location (e.g. mother ship, planet/moon, cloaked locale).  Given the technology stated, that pretty much eliminates nationstate origin.  If these occurrences are legit, one would think the authors would show their hand sooner or later. The when is the real deal.",
        "good": "24",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "Zeon3",
        "time": "15 May, 2021",
        "context": "So far the aliens have not offered Hunter a job or bribe money so Joe is not interested.",
        "good": "20",
        "bad": "2",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "jo48",
        "time": "15 May, 2021",
        "context": "Whatever it is, it has to either land or go into orbit. Our military should have recorded that event.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "florida-girl",
        "time": "15 May, 2021",
        "context": "Don’t worry LT. These things have fled Earth.  Not much intelligent life left here anymore. Plus the intelligence life left here is well stocked with ammo.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "kulas",
        "time": "15 May, 2021",
        "context": "what's puzzling is with hundreds of sightings there have been no clear picture/video of UFO's, or nothing released to the public. They're usually blurry images from far away which makes them mysterious even more.",
        "good": "4",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "privatedata",
        "time": "15 May, 2021",
        "context": "Keep focusing on pink haired transgenders throwing  tantrums in public or on tik tok . Don't forget our other huge issues we need to solve too like killing all the livestock so they can't cut the cheese or not letting men compete in women's sports .",
        "good": "9",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "WhereisJohnGalt?",
        "time": "15 May, 2021",
        "context": "\"former\" Lt.... Once an officer....always an officer unless he got a dishonorable discharge? It is amazing how stupid journalists are these days. That profession is worse than lawyers any more...",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "GoldBasketball",
        "time": "15 May, 2021",
        "context": "Harry Reed has been informed and will return shortly with an answer on all of this.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bartlrv",
        "time": "15 May, 2021",
        "context": "The speed of light is way, way faster than 13,000mph. So, why don’t we use our most advanced laser weapons and shoot one down?",
        "good": "4",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "helloitsmeagain",
        "time": "15 May, 2021",
        "context": "It’s AWESOME!!!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jtmojave",
        "time": "15 May, 2021",
        "context": "There real I’ve seen them 😊",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "GoldBasketball",
        "time": "15 May, 2021",
        "context": "AOC has locked herself in the bathroom.",
        "good": "13",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Pastwasbetter",
        "time": "15 May, 2021",
        "context": "Maybe it’s that Nero Guy from Star Trek that’s changing our climate.  Let’s blast him with our carbon usage. ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "well..bye",
        "time": "15 May, 2021",
        "context": "Stacey Abrahms looks like one of the Predators that Arnold didn’t get. Scarier too.",
        "good": "10",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "xxbuckox",
        "time": "15 May, 2021",
        "context": "Now when these things begin to take place, straighten up and raise your heads, because your redemption is drawing near.”",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "overpoweredlevels",
        "time": "15 May, 2021",
        "context": "maybe they stopped for some gas and realised we were all out of gas",
        "good": "7",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "SubsonicWarthog",
        "time": "15 May, 2021",
        "context": "This has been a problem since Eisenhower. The MJ12 was created to investigate these craft.",
        "good": "5",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "45saloser",
        "time": "15 May, 2021",
        "context": "Probably Obama, Hilary & Biden's fault.\nRight, MAGAbillies?",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "misternh",
        "time": "15 May, 2021",
        "context": "The intentional blurry pics is what makes me think it's our technology. Hundreds in our restricted airspace, and not 1 attempt to shoot any down. I'm thinking we have secret underwater naval bases that they come from.",
        "good": "4",
        "bad": "5",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "williewonka12345",
        "time": "15 May, 2021",
        "context": "Just another illegal looking for a way in.",
        "good": "11",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "creek7",
        "time": "15 May, 2021",
        "context": "If it's alien technology there is zero point in even being worried about it, they can destroy us with a snap of their little fingers.",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "GoldWrench",
        "time": "15 May, 2021",
        "context": "Well intelligent life designed it so that rules out humans",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "steve009",
        "time": "15 May, 2021",
        "context": "Well, as a species since we obviously are incapable of loving one another with all the killing we do to each other, we might as well turn this beautiful planet over to some other cosmic Life-form and let them do what we can’t.",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "xxbuckox",
        "time": "15 May, 2021",
        "context": "they would be wise to keep their distance so liberal culture doesn't poison them too. its our most destructive WMD.",
        "good": "12",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "saysomething56",
        "time": "15 May, 2021",
        "context": "These strange movements which we get all excited about are for what tactical reason ? What would an enemy or an Alien state achieve by them ? Just like our justice system if you have no motive you have a major hole in your case.  To me the lack of a clear image is a huge question mark. We have clear images of the moon, of galaxys, or micro organisms but no clear picture of something allegedly flying off our coast ?",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "nicksj",
        "time": "15 May, 2021",
        "context": "The earth may be their version of a national park, where they come to watch the local animal population.",
        "good": "14",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "earlofoil",
        "time": "15 May, 2021",
        "context": "I think--Lt. Ryan Graves--just used up his 12 1/2 minutes of fame---",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "kilobravo556",
        "time": "15 May, 2021",
        "context": "\"Imagine a technology that can do 600 to 700 G-forces, that can fly 13,000 miles an hour, that, that can evade radar and can fly through air and water and possibly space, and oh, by the way, has no obvious signs of propulsion, no wings, no control surfaces and yet still can defy the natural effects of Earth’s gravity. \n\nYou just described a hologram.",
        "good": "33",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "BidenAin'tPOTUS",
        "time": "15 May, 2021",
        "context": "lol They are a  \"security threat\"? \"...a technology that can do 600 to 700 G-forces, that can fly 13,000 miles an hour\" no they are the top of the food chain. Clearly there is nothing we can do to stop them.  They come and go as they please, kind of like we do when we're in our back yards not worrying about the ants busy living out their short violent existences.",
        "good": "37",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "trebor593",
        "time": "15 May, 2021",
        "context": "To All UFO’s out there: There’s a big White House where some very bad people live. The old man who lives there and calls himself “President” is really bad. Can y’all do us earthlings a favor and make them all disappear? While you’re at it there’s a few others that you can pickup as well....you’ll recognize them easily - they wear masks, call themselves democrats and like to talk non-stop in front of any microphone.",
        "good": "16",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "rebelrick",
        "time": "15 May, 2021",
        "context": "FOO FIGHTERS",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "constitutionalvalues",
        "time": "15 May, 2021",
        "context": "I could care less about the aliens just as long as no one takes them to meet Joe Biden.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ClaudeBalls779",
        "time": "15 May, 2021",
        "context": "The real security threat sits in the White House",
        "good": "17",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "marchmckinney",
        "time": "15 May, 2021",
        "context": "Whack.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "xxbuckox",
        "time": "15 May, 2021",
        "context": "“And I will show wonders in the heavens and on the earth, blood and fire and columns of smoke. The sun shall be turned to darkness, and the moon to blood, before the great and awesome day of the Lord comes. And it shall come to pass that everyone who calls on the name of the Lord shall be saved. For in Mount Zion and in Jerusalem there shall be those who escape, as the Lord has said, and among the survivors shall be those whom the Lord calls.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "randy1946",
        "time": "15 May, 2021",
        "context": "Let's face it, something unusual is happening in our skies and oceans. Is it a threat? We don't know, but we should not ignore it. UAPs (ie. the new name for UFOs) have been seen and reported for many years, even in antiquity, but military and commercial pilots who reported such encounters faced the end of their careers. Even civilians who reported such encounters were scoffed at and ridiculed. Now, even military pilots are encouraged to report such incidents, so the stigma of reporting them is being removed. Thus, we're likely to see more reports in the future.",
        "good": "19",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "andydufresne1966",
        "time": "15 May, 2021",
        "context": "From the article:\n\n\" ... A former Navy pilot says he witnessed UFOs flying in restricted airspace off-the-coast-of-Virginia nearly every day for two years beginning in 2019 ...\"\n\nMany of these now bona fide sightings seem to come from three isochronal locations:\n\"off-the-coast-of-Virginia\"\nSan Diego \nnuclear power plants\nApparently, these unidentified aerial phenomena have the capability to submerge and travel at hundreds of knots below the surface of the ocean, according to just-revealed observations from the U.S. Navy.\n\nSo what's the common denominator for the three aforementioned locations?\nWell, first of all, Newport News, Virginia is home to the the most lethal submarines in the world - nuclear-powered submarines, equipped with nuclear warheads - to say nothing of the shipyard's other destructive ships.\n\nSecond, San Diego can also claim equal bragging rights.\n\nBoth locations are home to ships that are more than capable of nuclear destruction - many times over.\n\nKeyword: nuclear",
        "good": "8",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "bornntruecitizen",
        "time": "15 May, 2021",
        "context": "wow...Chinese delivery to Mars.  let's see 2 from column A. 1 from column B.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "GoldWrench",
        "time": "15 May, 2021",
        "context": "humans are about to learn they are just ants, gonna be hilarious",
        "good": "9",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "EDDY99",
        "time": "15 May, 2021",
        "context": "This is so funny from Fox News. Many  Fox News readers and Trump voters will think the ETs voted for the Dems",
        "good": "1",
        "bad": "7",
        "replies": []
    },
    {
        "user_name": "🇺🇸🙏",
        "time": "15 May, 2021",
        "context": "It’s a shame that we can’t trust anything our government tells us anymore.",
        "good": "16",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "Dour",
        "time": "15 May, 2021",
        "context": "Kirk and Scotty drunk again while Spock is always on spores.  Of course this is going to happen.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cassiopeian",
        "time": "15 May, 2021",
        "context": "Let's get back to the report from the national intelligence director and secretary of defense mentioned here due out next month on unidentified ariel phenomena.\nWill it be released to the public or placed on a shelf at the Pentagon?",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "xxbuckox",
        "time": "15 May, 2021",
        "context": "what ever color they are the DNC is looking forward to exploiting them.",
        "good": "12",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "rfloyd399",
        "time": "15 May, 2021",
        "context": "How embarrassing would it be if an alien landed here and said \"Take me to your leader\"? (and yes, it would have been equally embarrassing if it happened last year",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "coolhandluke603",
        "time": "15 May, 2021",
        "context": "seen hundreds. some are threats, some are not. most would scare the daylights outta the average human. ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "republican_reading_fox_news",
        "time": "15 May, 2021",
        "context": "watching and waiting. It probably takes a long time to get a battlecruiser to our system",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "duke@648097",
        "time": "15 May, 2021",
        "context": "Interesting subject. I don’t like the fear based ideology. Let’s find out what it is we are seeing. I don’t understand the video and pictures are not that clear. With now day technology should be able to get very clear pictures. The navy,  Air Force and satellite should be able to get excellent video or pictures",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "GoldWrench",
        "time": "15 May, 2021",
        "context": "how will humans respond when they learn they are just lab rats?  Probably not very well",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "nicksj",
        "time": "15 May, 2021",
        "context": "Humans have been broadcasting radio signals into space for over a hundred years, so they could be picked up anywhere out to a distance of a hundred light years.  Any advanced civilizations living or traveling within that radius could have intercepted them and come to investigate.  By now we're probably an interstellar tourist attraction like a nature reserve.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "67VietVet68",
        "time": "15 May, 2021",
        "context": "\"has no obvious signs of propulsion, no wings, no control surfaces and yet still can defy the natural effects of Earth’s gravity.\"\n\nCommon sense tells me that an anti-gravity machine could do all those things.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "lightenupfrancis643",
        "time": "15 May, 2021",
        "context": "Maybe they've come to help natural selection along and they'll take out the weak links in our society which are the liberals of course. Hey, one can hope.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "atrahasis",
        "time": "15 May, 2021",
        "context": "The UFO's are here to make sure our barbaric warrior human species NEVER leave this solar system",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "DiggerDave",
        "time": "15 May, 2021",
        "context": "A security threat? And what do you think you’d do about it?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Putter",
        "time": "15 May, 2021",
        "context": "Solar balloon",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "eaa2016439",
        "time": "15 May, 2021",
        "context": "If they are a security threat, get out the white flags or we're toast! We have nothing to match those capabilities",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "johnc199",
        "time": "15 May, 2021",
        "context": "Perhaps they are watching to make sure that we don’t have technology\nbreakthroughs that that don’t want us to have, where we might be a threat to them. Then it sayonara baby. We won’t be allowed that technology because we can’t be trusted to use it responsibly.",
        "good": "2",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "rwac",
        "time": "15 May, 2021",
        "context": "Just grainy pictures is all we see. I'll believe it when something is shown that makes sense or it can be touched or it lands and a being gets off of it and says howdy.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jackjohn",
        "time": "15 May, 2021",
        "context": "It just seems awfully coincidental that all the videos we have of these things--so far--are taken from miles away. Whatever they are, they never seem to come flying near the camera's location, or where any details can be made out. They're always at such a distance that no one can begin to make out any features or get an idea of size.\n\nWe always seem to be where they aren't.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "DirtyHobo",
        "time": "15 May, 2021",
        "context": "Ryan Graves tells '60 Minutes' the unidentified objects are a security threat… How do you know they’re a security threat when you don’t know what they are?",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "InquiringMinds2Kno!",
        "time": "15 May, 2021",
        "context": "The US government know about this since 1953.. in fact Eisenhower is the one that gave the order that the people must never be told... \nFear of loss faith in religion, economic collapse. And human's hostile nature.. if.we cant get along with other cultures, colors of humans how can we get along with other worldly beings without being hostile which may doom mankind. Also these Other worldly beings promised to help with human development by showering us with technology especially when it was realized humans had developed nuclear technology we possessed something dangerous  that could doom mankind and destroy the earth. Not.to mention would throw off the balance of the solar system If nuclear weapons were used..  putting the whole solar system in peril.\nIt may sound far fetched by think about this cleverly. Look how far advancement developed in the past 50 years. It took humans thousands of years to discover fire and to build. Is it a coincidence how far we advanced since 1953???",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "rcamerica629",
        "time": "15 May, 2021",
        "context": "I guess the \"Plan B\" for all the world's problems, water shortages, fuel shortages, and morons in political office is to blame aliens, eh?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "schach",
        "time": "15 May, 2021",
        "context": "Tucker Carlsen is extremely  impressed with this grainy, far off in the distance,  black & white 2019 gun camera footage that does zip to prove an extra terrestrial  vehicle or superior intelligence aliens.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jcwade0129",
        "time": "15 May, 2021",
        "context": "This is most likely supernatural. God's letting out Satan's leash a bit as we rush headlong into the end times. This may well be the explanation given when Christians are raptured by the millions.",
        "good": "3",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "GoldWrench",
        "time": "15 May, 2021",
        "context": "It will just be nice when humans are put in their place as a tier 2 species",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "PurpleCloud",
        "time": "15 May, 2021",
        "context": "Thousands of years ahead in technology. Thank God their  not like BLM or Antifa.",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "coolhandluke603",
        "time": "15 May, 2021",
        "context": "the type of technology these craft use they can’t touch down on earths surface or they ground out. they gotta b in water air or on “stone”. ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bowfishslayer614",
        "time": "15 May, 2021",
        "context": "Lets just hope these aliens like to eat liberals",
        "good": "12",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "CATSGOFOR9",
        "time": "15 May, 2021",
        "context": "I doubt they are a bigger threat than what is left of the Republican Party",
        "good": "1",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "PottedHousePlantPresidentSaysWhat?",
        "time": "15 May, 2021",
        "context": "Maybe these aliens can insert some common sense or intelligence into the fascist democrats,  start with xiden",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tcfan",
        "time": "15 May, 2021",
        "context": "So another planet is looking for another habitable planet just like our explanation of Mars hmmmm sounds like Mars is a list cause then ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "GoldWrench",
        "time": "15 May, 2021",
        "context": "have you seen those youtube videos where people drive through ghettos with dash cams for entertainment? this is the alien equivalent\n\nwe are like violent apes with down syndrome to them",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "soldtothehighestbidder",
        "time": "15 May, 2021",
        "context": "Why do the news weekend editors always publish the some OLD stories ?",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "kingjulian",
        "time": "15 May, 2021",
        "context": "if its a security threat there is nothing anyone could do about them if they were not made on earth, so just hope they are friendlies.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tttt695",
        "time": "15 May, 2021",
        "context": "Ok, I'm starting to get concerned.",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "jddr",
        "time": "15 May, 2021",
        "context": "There are resources under the water they want",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "OccamsRazor807",
        "time": "15 May, 2021",
        "context": "I think they will wait to contact us until someone intelligent is in office",
        "good": "13",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "earnrespect",
        "time": "15 May, 2021",
        "context": "Emphasis on \"former\" Navy pilot. \"Saw UFO everyday for two years in restricted airspace.\" This guy has taken too may G's over the years.",
        "good": "3",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "americafinest",
        "time": "15 May, 2021",
        "context": "What kind of stupidity are these people? We can't even regularly go to the Moon and these \"aliens\" could come and visit us. Clearly, they have superior intelligence and technology FAR ABOVE earthlings.\n\nYou think they are a security threat? REALLY, that stupid?",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "PeterBravo545",
        "time": "15 May, 2021",
        "context": "The Bible say that there will be signs in the last days. The last days are the days that started when Christ came. From that time until He returns for His TRUE church are called the last days.",
        "good": "11",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "hi-powerp35",
        "time": "15 May, 2021",
        "context": "Illegal aliens. wonder if their here for the welfare. Or the chance to vote Democrat?",
        "good": "11",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "GoldWrench",
        "time": "15 May, 2021",
        "context": "Republicans will be begging for illegal aliens once the real aliens land",
        "good": "1",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "OrangePuzzle",
        "time": "15 May, 2021",
        "context": "Sure hope their Caucasian!",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "americafinest",
        "time": "15 May, 2021",
        "context": "For some reasons, I think these aliens would LOVE conservative women, don't you agree?",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "steve009",
        "time": "15 May, 2021",
        "context": "Hope they have voter ID’s could get messy,",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "hatedem",
        "time": "15 May, 2021",
        "context": "Do not worry they are just coming for free health care and to vote Democratic in future elections.",
        "good": "12",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Dour",
        "time": "15 May, 2021",
        "context": "I am just surprised fox \"experts\" are not claiming this is bigfoots private plane returning Elvis.",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "liberalitarian",
        "time": "15 May, 2021",
        "context": "We all have cameras now. Why can't anyone get a clear image of a UFO? Why does anyone get excited about a blurry spot in their field of view?",
        "good": "18",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "ssbn632873",
        "time": "15 May, 2021",
        "context": "They are ours. This is why Trump established the Space Force. If you will notice, Biden hasn't said a word about it and has no plans to cancel the program.",
        "good": "21",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "paulrevere210",
        "time": "15 May, 2021",
        "context": "If it was another country we would be lamp shades. This leaves either extraterrestrial or made in America. If it was not of this earth they would have made some contact, unless they are scout drones relaying information back to the other civilization. The most likely scenario is Made in America. There hasn’t been whistle blowers so it’s extremely insulated with only deep state people knowing about it. Presidents and politicians change to often and wouldn’t have knowledge of the technology. The government will stage an invasion as a means of control. ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "🧇altereggo🧇",
        "time": "15 May, 2021",
        "context": "They haven’t landed here yet , because they respect our immigration laws.",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "thomjefferson",
        "time": "15 May, 2021",
        "context": "I don't see the threat or at least that there is something that needs to be done.  We these capabilities, they could have already wreaked havoc but haven't.\nWe're probably a refueling stop and there are probably no organic life forms in the vehicles.\nAs long as we don't shoot at them, they'll probably leave us alone.",
        "good": "19",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "xxbuckox",
        "time": "15 May, 2021",
        "context": "The coming of the lawless one is by the activity of Satan with all power and false signs and wonders,",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "americafinest",
        "time": "15 May, 2021",
        "context": "Have you ever wondered if these aliens procreate the same way we do or more advanced?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "thenospinguy612",
        "time": "15 May, 2021",
        "context": "Funny how everyone has a camera with a crazy amount of megapixels but all of the ufo footage looks like it's from the late 60's...Maybe there are, maybe there aren't...I don't know.",
        "good": "6",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "liberalitarian",
        "time": "15 May, 2021",
        "context": "You want to learn about UFOs? Read last week's New Yorker.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "scribles2970",
        "time": "15 May, 2021",
        "context": "He's right they already took his brain.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "cassiopeian",
        "time": "15 May, 2021",
        "context": "They want to be seen, they want us to talk about their presence and advanced technology.\nWhat comes next?",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bill.burn",
        "time": "15 May, 2021",
        "context": "That’s what all the Jewish space lasers are for.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "WhatDoesItReallyMean215",
        "time": "15 May, 2021",
        "context": "I'll bet that Biden can explain it !",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Registered_Independent",
        "time": "15 May, 2021",
        "context": "The important question here is; are they Liberal or Conservative?",
        "good": "15",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "americafinest",
        "time": "15 May, 2021",
        "context": "OMG, these \"aliens\" would dominate and slave the Earth, make us becoming a battery for their electricity.\n\nOoh, scary!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "americafinest",
        "time": "15 May, 2021",
        "context": "Talking about aliens, do you know that China JUST LANDED a rover on Mars. I am sure it will seek and destroy our rover there, don't you think?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "GlennyBoy",
        "time": "15 May, 2021",
        "context": "It’s China.Spying.Looks like something  we’ve never seen before because we haven’t.China has made huge military strides.Maybe even these vehicles are part of their latest arsenal.find a way to capture",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "powr2people",
        "time": "15 May, 2021",
        "context": "Maybe they’ll come save from killing and hating each-other.",
        "good": "1",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "toomanywars",
        "time": "15 May, 2021",
        "context": "Of all possibilities, the ones suggesting they are secret US research tech things is pretty high on the list.  They wouldn't be telling even US military pilots about them except when absolutely necessary.",
        "good": "8",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "kj401231",
        "time": "15 May, 2021",
        "context": "🤣a real (tangible) threat, huh. 😂🤣😂 Prototypes have to be flown somewhere I guess. 😂Has this Naval whoever seen our Southern Border...",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "RedProcessor",
        "time": "15 May, 2021",
        "context": "They have to take peek at us, because we are unheard of, in any universe\n\nWhy on earth would we share technology with countries who are hostile to us? \nThen we sell our companies to them, give them H1b visas, expand anchor baby policies",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jojowasaman2",
        "time": "15 May, 2021",
        "context": "Personally I think we're being 'punked' by the military.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "americafinest",
        "time": "15 May, 2021",
        "context": "Is there any chance these aliens have Aryan blood?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jimwick",
        "time": "15 May, 2021",
        "context": "Everyone remember that mirage filmed recently where it looked like a super tanker was floating hundreds of feet in the air?\n\nAtmospheric distortions bend light and cause the human eye to perceive things which are not actually happening.\n\nAlso, the human brain is EXTREMELY susceptible to manipulation and getting tricked. That’s why street magic works. Obviously, Chris Angel isn’t a wizard. He uses various tricks and a knowledge of how the human brain perceives the world to trick the eye of the target into experiencing and seeing something that isn’t happening.\n\nCouple atmospheric distortions, physical science which may not be well understood by researchers yet, and the human brain’s tendency towards imagination and “filling in the blanks”, and voila: aliens, or secret government conspiracy technology etc.\n\nIs it statistically a certainty that life exists elsewhere in the universe? Yes. Is it a statistical impossibility that multiple alien space faring races would swoop by our backwater solar system just to buzz Navy ships? Also yes. Do people believe in WAY crazier things than aliens? Also yes.",
        "good": "12",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "CyanToast",
        "time": "15 May, 2021",
        "context": "we are being lied to.\n\nagain.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "DDay854",
        "time": "15 May, 2021",
        "context": "Something to consider… a certain foreign government has spent a record amount of $ on increasing their military and space capability. The exorbitant number of Long March 5B rocket launches (and satellites in orbit). The unconventional warfare this government has unleashed on the US at every level of government and education system. Their massive and agile manufacturing capability. The leaps in technology stolen while producing nearly every tech gadget in the world. The lies, deceit, and hidden agendas.  That said, now look at the evidence of these UAE’s. Movements that impossible with our tech. Speeds and turns deemed impossible. Entering the water of the oceans without a splash. Video of the objects being ‘shakey’ like the spot of a laser trying to hold still despite the emitter being far away and mounted on a possibly moving platform. Now… you know we have 3D hologram laser projector technology. Been doing that for years. All it would take is 3 lasers converging on a targeted point to raster a 3D image that, under the right conditions (at night and with a low layer of fog/clouds over the water perhaps), would appear as a solid object. These UAE’s are simple shapes. Spheres, pyramids, cubes, etc.  those are FAR easier to project a hologram of than a complex shaped vessel of some kind. And since lasers are involved, these objects appear to glow by emitted light. It’s possible what appears as emitted light is really light reflected by a converged set of rastering set of laser beams. Individual beams could be nearly invisible, but when converged to create an object would become visible. Especially when converging into a thin fog layer like one of the videos the Navy shop took. It is possible the large number of satellites launched by this country could contain RGB laser emitters with precision aiming, stabilization, tech to synchronize with other satellite based emitters, and rastering capability (like most modern movie theaters now use to project the screen). This would explain the super fast motions and turns on a dime without slowing down.  And entering water without a splash. Think about it, this tech exists today. And deploying such a tech for unconventional warfare would be a massively effective psychological weapon against an enemy already paranoid, full of anxiety, destabilized, and infighting. Know any countries that fit these descriptions?  ",
        "good": "7",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "art0fwar1776",
        "time": "15 May, 2021",
        "context": "TR-3B Black Triangle – Code Name: ASTRA",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "americafinest",
        "time": "15 May, 2021",
        "context": "Are these aliens carnivore or herbivore? I bet they eat red meat!",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "reasonnotfeelings",
        "time": "15 May, 2021",
        "context": "Even they seem to be staying away from blue cities....",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "TTrump2024",
        "time": "15 May, 2021",
        "context": "There have been ufo's for decades and I don't ever recall hearing a ufo attacking us earthlings.  But I'm sure it's possible.  Maybe they are just toying with us like a cat does to a mouse before it kills it..",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "¥?#*!",
        "time": "15 May, 2021",
        "context": "Hey dims, I know it’s there, but I don’t see it… Where is the racism?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Scyra",
        "time": "15 May, 2021",
        "context": "Maybe the Democrats have been taken over and their bodies used as suits. You ever look closely at a democrat? It's like they aren't even human anymore, they move weird too. Pelosi needs to glue herself back together especially or she's going to fall out of her skin soon.",
        "good": "8",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "ssbn632873",
        "time": "15 May, 2021",
        "context": "By the way, it is not going into the water, it is going below the horizon which makes it appear to enter the water.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "jugernaut100",
        "time": "15 May, 2021",
        "context": "Everytime i hear this i remember that movie Independence Day with Will Smith.   The scene with liberals on top of the building chanting we love you, come in peace.  Then BOOM...aliens take them out.  Hahahhahhaa",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "nonotrush",
        "time": "15 May, 2021",
        "context": "Personally I don't believe in aliens from another world. Single reason that I believe holds water is, that the closes plants to earth's solar system are over 15 light years away. Simply too far to reach us in any usable timeframe... Well unless they have warp engines, which I do not believe in either. Now I could believe in earthly UFO's, built by man. Built a few myself when I was active in R/C.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jason86911968107",
        "time": "15 May, 2021",
        "context": "Im pretty sure if they really wanted to do something, they would have by now. They have the technological advantage over us, and probably have the capability to access whatever databases they wanted to, but most likely don't see the need as they will see us as inferior to them and not as advanced. The worst thing we could do is see them as a threat, and start something we don't know we can finish or not.",
        "good": "187",
        "bad": "7",
        "replies": []
    },
    {
        "user_name": "GoldWrench",
        "time": "15 May, 2021",
        "context": "Human beings are about to learn they were a lab experiment, going to be hilarious",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ziggynik",
        "time": "15 May, 2021",
        "context": "They'll feed us and eat us. ",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "americafinest",
        "time": "15 May, 2021",
        "context": "Lower class of human is afraid of the unknowns and worship these unknowns as God. \n\nWhat class are you?",
        "good": "2",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "nmeast",
        "time": "15 May, 2021",
        "context": "\"security threat\"?  What, exactly, does this Navy pilot think our military, or any military on this world, is going to do about it?  If they are an \"alien being\" capable of crossing who knows how many millions of miles of space, their technology is light years ahead of ours and no weapon we have, is going to do anything to them.",
        "good": "13",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "heylookmorevotingballots",
        "time": "15 May, 2021",
        "context": "These things have been around for awhile.  In WWII they were called Foo Fighters.  Swarmed bomber groups and fighter formations.  The 50s and 60s were the same.  Because they mainly observed and tested our capabilities the government(s) left them alone.  No need to panic the populace.  Hollywood and radio showed how the population could be spooked.  No need to let everyone know that there is an actual thing watching us.  \n\nThink of what we do to our own animals out in the wild.  We observe and tag them.  Seem interesting doesn't it?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "RoRo400",
        "time": "15 May, 2021",
        "context": "Deluded pilot",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "owl1966",
        "time": "15 May, 2021",
        "context": "Even if these aren't US craft or technologies; It might be smart of DOD to imply that they \"possibly could be\". This would further discourage any outside threats.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rockstarrn",
        "time": "15 May, 2021",
        "context": "Alien Lives Matter!!! go loot a Footlocker now!!! ",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "GoldAirBalloon",
        "time": "15 May, 2021",
        "context": "While UFOs are security threat, UVOs (Unidentifiable  Voting Objects) are democracy threat.",
        "good": "14",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "beeshaggn460",
        "time": "15 May, 2021",
        "context": "...well, the neck of U.S. is already firmly under the boot of 'domestic' terrorist-aliens in the form of dim-socialists and their 'dear party of the donkeys' ...could being under the boot/control of inter-galactic aliens be any worse?!?...especially when the inter-galactic aliens have superior intellect and technology, areas where the corrupt dim-socialist aliens can't even compete on a grade school level...",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "DistrustYourGovt",
        "time": "15 May, 2021",
        "context": "The discovery of alien life would change everything. It might be the only thing that truly unites humanity and ends this media-driven push towards tribalism and the constant race-obsessed celebration of skin color. We’re regressing socially as a species. Save us ET.",
        "good": "16",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "reasonnotfeelings",
        "time": "15 May, 2021",
        "context": "One day, we will find out that Elvis was flying it, with Michael Jackson as copilot.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "188645-70Govt",
        "time": "15 May, 2021",
        "context": "Area 51 has been taken over by aliens.  They attempted to convert Joe Biden with their mind-meld technology, but they abandon the task, because they found Joe didn't have one.",
        "good": "35",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "Derholmz282",
        "time": "15 May, 2021",
        "context": "I have no idea what they are, but UFOs  have been seen forever.  One would think out of the thousands of sightings, perhaps just once a friendly contact, public landing, crash in a populated area or even attack would have occured.  Probability would seem to say so.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "seriousrain",
        "time": "15 May, 2021",
        "context": "People have known about UFOs for well over 50 years and now you’re going to call them a security threat ... i think you’re a little late if that were a true security threat something would’ve happened by now and doesn’t appear to be so.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "hogslayer950",
        "time": "15 May, 2021",
        "context": "cool, maybe they will come and wipe us out",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "GoldWrench",
        "time": "15 May, 2021",
        "context": "I'm sure we are just a safari expedition for many of these beings",
        "good": "8",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "8barrel370",
        "time": "15 May, 2021",
        "context": "democrats are our biggest security threat",
        "good": "20",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "chalone344",
        "time": "15 May, 2021",
        "context": "I am not convinced these are \"alien\". I 100% admit this is anecdotal, but I have an uncle who is truly a brilliant man and in the early 70's joined the Navy to get in their nuclear program. He excelled at all of his studies and passed all of the required tests to be able to work in the highest and most complex areas of military nuclear research.Anyway, when he quit working for the military in the early 80s he took a civilian job in nuclear power. A few years ago while we were having a conversation, he mentioned that in the 60s and 70s they had made many major advancements in nuclear power and research and to that date (over 50 years later) the commercial nuclear industry hasn't managed to get anywhere close to the advancements they had already achieved before he had even joined the nuclear program. Of course mentioned that he couldn't discuss specifics, but after working over 30 years in the commercial nuclear industry, it was frustrating to know of better ways to generate and manage nuclear power, but he couldn't share it because it was classified.He was talking about governmental technology from +40 years prior and the commercial market was no where close to being as advanced. This tech defies logic, but who knows what they have developed in secret research facilities and, potentially, our enemies have stolen and refined.  This looks like Sci-Fi, but it very well could be advanced military technology. It wouldn't surprise me at all.",
        "good": "167",
        "bad": "21",
        "replies": []
    },
    {
        "user_name": "tomcalabrese",
        "time": "15 May, 2021",
        "context": "Defund the aliens!",
        "good": "8",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "americafinest",
        "time": "15 May, 2021",
        "context": "I am scared, patriots. Our conservative women are pretty, fertile and subservient. Of course, aliens will try to possess them first. I am hiding my women as we speak!",
        "good": "0",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "mwelch",
        "time": "15 May, 2021",
        "context": "hopefully they take over the American government. Anything's better than the Biden admin.",
        "good": "15",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "aztel19",
        "time": "15 May, 2021",
        "context": "Oh good lord only ignorant people call them a security threat. If they want to blow us up don’t you think they could have already? Give me a break. ",
        "good": "6",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "ss202sl827",
        "time": "15 May, 2021",
        "context": "Security threat? We don't know what they are(UFO), but we know they're a threat?",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "gunsnguitars",
        "time": "15 May, 2021",
        "context": "They are not extraterrestrials.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "steve009",
        "time": "15 May, 2021",
        "context": "Undocumented ET’s or as Democrats say, “voters”",
        "good": "12",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "tomcalabrese",
        "time": "15 May, 2021",
        "context": "Build a space wall!",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rockstarrn",
        "time": "15 May, 2021",
        "context": "First alien \"Let's go down and destroy them\" Second alien \" already taken care of we planted BLM and Critical Race Theory they will implode soon\" ",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "GoldWrench",
        "time": "15 May, 2021",
        "context": "I saw a UFO as a child in midday, it was there nearly motionless for about 10 minutes and then gone. I didn't feel panicked but I did feel utterly powerless.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ctpjr11",
        "time": "15 May, 2021",
        "context": "Probably probes who haven't been able to find intelligent life on our planet.  Looking in the DC area is not really where to look for intelligent life I have to believe.",
        "good": "33",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tomcalabrese",
        "time": "15 May, 2021",
        "context": "Alien lives matter!",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "FWC",
        "time": "15 May, 2021",
        "context": "These objects have been around for eons. The only difference is that we now have the technology to video and move through the sky among them. \n\nThe bottom line is that if they actually meant us harm they would done exactly that a long time ago.",
        "good": "235",
        "bad": "7",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "error": "error"
    },
    {
        "user_name": "SH155",
        "time": "15 May, 2021",
        "context": "I had a flying saucer land in my back yard last week. A little man came out and said \"Take me to your leader\".  I said to him \"This is the United States. We have no leader at the moment\". He got back in his space ship and left. True story!!",
        "good": "30",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dreamofsiargao",
        "time": "15 May, 2021",
        "context": "More grainy pictures, ho hum. Wake me up when you actually have some evidence.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tomcalabrese",
        "time": "15 May, 2021",
        "context": "Will aliens have to wear masks!",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "americafinest",
        "time": "15 May, 2021",
        "context": "If these aliens were real, they probably would destroy us a long time ago. I am more afraid of domestic terrorists such as militia/whitesupremacist/ProudBoy/OathKeeper...You feel the same way, right?",
        "good": "1",
        "bad": "11",
        "replies": []
    },
    {
        "user_name": "nythreefer",
        "time": "15 May, 2021",
        "context": "The way the military and the government have been acting about UFO's the last few weeks is really similar to how they behaved when they were developing the stealth bomber and encouraged UFO conspiracies as a cover. I think they're working on something and giving it a cover screen.",
        "good": "27",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "edweirdo121",
        "time": "15 May, 2021",
        "context": "you know when our military starts openly talking about UFO activity that they're trying to distract us from something.",
        "good": "12",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "BlueBee",
        "time": "15 May, 2021",
        "context": "Maybe Biden's wife will bake them cookies .",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rommazntz",
        "time": "15 May, 2021",
        "context": "I am working on simular technology.  Next paycheck I'll have enough tinfoil to begin beta testing.  These aliens don't know what they're in for. ",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "youputz",
        "time": "15 May, 2021",
        "context": "they could be a secret US technology,",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "stargazer709",
        "time": "15 May, 2021",
        "context": "see any pink flying elephants too. Typical drunk navy pilot.",
        "good": "1",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "kimball",
        "time": "15 May, 2021",
        "context": "They should have shot it down to find out what's in it.  You know, kinda like Pelosi said. ",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "StarBurst77",
        "time": "15 May, 2021",
        "context": "Seeing them every day for two years and no one has a focused picture of them? We can watch our rockets clearly go into space for many miles with a telescopic lens, but not one photo of these things. ",
        "good": "13",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "spiffer26",
        "time": "15 May, 2021",
        "context": "I'm pretty sure Waters and Pelosi aren't human.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "LocoLopez",
        "time": "15 May, 2021",
        "context": "It's all a bunch of nonsense.  If the US government had evidence of an alien civilization I doubt  if they could  keep it secret for long.   Don't you think if there was such a thing they would visit other countries too?   With everyone and their brother walking around with a cell phone camera yet no one took a undisputed photo or video of a UFO?    \nJust hype so these so called UFO experts can sell books , seminars, documentaries etc.",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "americafinest",
        "time": "15 May, 2021",
        "context": "I am sure those aliens love President Trump. Don't you think, everybody does?",
        "good": "5",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "americafinest",
        "time": "15 May, 2021",
        "context": "By any chance, shall we call these alien \"Ra\"? After all they build pyramids to store grain 5000 years ago, according to Ben Carson, our most famous black neurosurgeon?",
        "good": "1",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "tomcalabrese",
        "time": "15 May, 2021",
        "context": "Have you seen Maxine WAters?   She either an alien or Red Fox. Incarnate",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cece",
        "time": "15 May, 2021",
        "context": "Word got out that the borders open.  And the added plus: Joe'll pay them for doing nothing. Win-win.",
        "good": "11",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Melater57",
        "time": "15 May, 2021",
        "context": "When are the World baseball championships? It's team Jupiter stealing signs.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "grannyclampett",
        "time": "15 May, 2021",
        "context": "\"are a security threat\"\n\nPredictably, potentially preposterous.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tomcalabrese",
        "time": "15 May, 2021",
        "context": "Put our VP Harris in charge of finding out what is going on.   Wait she must be in charge alrtbecause nothing is being dine",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "special1",
        "time": "15 May, 2021",
        "context": "You'd think, after seeing a UFO nearly every day, that a photo would be good.  Fuzzy videos are unacceptable when nearly everyone has a high def camera on their phones.  Take decent pictures!!  Is this the best that our defense system can do, photographically?  Really??",
        "good": "21",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "gd6770",
        "time": "15 May, 2021",
        "context": "So just assuming for the moment these are not of this world, in all of these encounters there has been no hostilities. We send probes into space and to planets to learn, it's reasonable to assume if there was another race out there that they would do something similar. It would be prudent to not attempt to bring one down. Perhaps make an attempt to communicate.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "8barrel370",
        "time": "15 May, 2021",
        "context": "if I wanted to see a UFO I'd watch Psaki speak",
        "good": "10",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Dour",
        "time": "15 May, 2021",
        "context": "Bigfoots own the majority of the largest companies and international corporations and international organizations behind the scenes.  They utterly control the stock markets around the world.\n\nThis is just their kids hover car they let them fly around in.  \n\nAnd Bigfoots are actually Chinese and Mexican.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "GoldWrench",
        "time": "15 May, 2021",
        "context": "I saw a UFO as a child in midday, it was there nearly motionless for about 10 minutes and then gone. My brother and I still talk about it but our childhood friend that was with us died in a car accident some years later. I didn't feel panicked but I did feel utterly powerless. That was over 30 years ago and even as a child I had to reframe how I thought about myself and my existence.\n\nI'm glad people are finally discussing this stuff openly.",
        "good": "259",
        "bad": "14",
        "replies": []
    },
    {
        "user_name": "jojowasaman2",
        "time": "15 May, 2021",
        "context": "If nothing else, the military is preparing us to start seeing these things.",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dnvn888",
        "time": "15 May, 2021",
        "context": "Washington just doesnt want to admit we cant do anything about them",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rudyrudefoquer",
        "time": "15 May, 2021",
        "context": "Darn. Mexican Cartel's are getting clever...",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sn0wynights",
        "time": "15 May, 2021",
        "context": "Notice they only give us glimpses and tiny shreds of information? It's distraction material to get Americans to look away from what Democrats are doing to our country. Don't let them fool you. If they were actually being transparent, there would be a press release to reveal ALL of the information they have gathered that still remains top secret to today. Instead we get tidbits of blurry images and low level testimonies. Which means it's merely been used for decades as a way to excite us and take focus off of them while they continue to destroy our nation and people. Wanna know what's REALLY going on with aliens? Take back our country and find out what they have really been hiding from us. Otherwise, focus on what really matters, your LIVES and the LIVES of your loved ones. And all of your futures that are being taken away RIGHT NOW.",
        "good": "11",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "Dour",
        "time": "15 May, 2021",
        "context": "Best military technology in the world, and what is shown to fox is grainy pictures from not fully functioning 1930 camera gear, taken by a blind drunk using the force.\n\nBut, eh, fox conservative followers will buy it.",
        "good": "6",
        "bad": "6",
        "replies": []
    },
    {
        "user_name": "parkerds980",
        "time": "15 May, 2021",
        "context": "If these are fighter like that means there must be a mother ship that carries them.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "45saloser",
        "time": "15 May, 2021",
        "context": "In the alien's defense, they never tried to overturn any of our elections.",
        "good": "3",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "stargazer709",
        "time": "15 May, 2021",
        "context": "i will worry when one of the aliens is riding a white horse,",
        "good": "7",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "GreenPuzzle",
        "time": "15 May, 2021",
        "context": "What is going on with the media so regularly reporting on UFOs?  When you see the media focusing on something week after week, they have an agenda, and it is not good.  The media makes and drives news that supports their mission.  \n\nReminiscent of the days when grocery store lines always  had a big eyed picture of an alien with a flying saucer, Enquiring minds want to know what the main stream media is up to!",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "mrcoffee73471",
        "time": "15 May, 2021",
        "context": "Seems like these are non-biological objects with artificial intelligence.  If they were to try communicating with us, they would probably not have that capability.  It's likely they would have a savant for mobility, observation, and collecting data but nothing more.  There is no telling how long they've been around, perhaps through millennia but who knows.  If they've been around that long, I don't think their intention would be to cause harm.",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "stargazer709",
        "time": "15 May, 2021",
        "context": "sharknados maybe,",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Jkrash",
        "time": "15 May, 2021",
        "context": "It’s just a matter of time",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mandyalaska",
        "time": "15 May, 2021",
        "context": "UFOs have been around for a very long time.  The only reason they're a \"threat\" is because we don't know when they're going to be where.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "americafinest",
        "time": "15 May, 2021",
        "context": "I think the mothership is hiding in the Dark Side of the Moon, shield up and cloak up! I wish they speak Klingon because surely, the Federation can defeat them.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "philly805",
        "time": "15 May, 2021",
        "context": "Did you know that UFOs planted Jesus?",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "keysdisease",
        "time": "15 May, 2021",
        "context": "100’s of sightings but still no photos. Just more Bigfoot and Nessie.",
        "good": "3",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "👌DemusStultus",
        "time": "15 May, 2021",
        "context": "This whole “disclosure “ thing by the pentagon stinks to high heaven.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "skiptrace",
        "time": "15 May, 2021",
        "context": "Luke, I'm your father.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cynic378",
        "time": "15 May, 2021",
        "context": "Clearly there is something going on that needs to be understood. I am less concerned about extraterrestrials than I am about foreign governments.",
        "good": "8",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "netsteodosio",
        "time": "15 May, 2021",
        "context": "It is overwhelming to me that all that was said in the Bible is happening and I a believer is witnessing it! Just a reminder, the Bible did not mention any other planet in the galaxy that has humans living on it, except for our planet earth! And yet, it mentioned something about what Satan the prince and the deceiver in chief has planned to further deceived the left behinds, that the millions and hopefully billions of people that will be raptured when Jesus returns are all swallowed and taken by the UFO’s! UFO’s are becoming news now a days and the sightings are becoming frequents! Another reminder that I want to share, Jesus in the gospel of Matthew, told us  guard our faith, because in the last days of human history, Satan will do everything in his power to deceived people, including those who knew  Jesus! We all should be praying fervently and without ceasing! And yet, we all wish for a revival for our beloved country, I do believed that our Jesus is still in the business of hearing our prayers and answering them! He do not desire that anyone should perished, but that everyone should come to repentance and accept His gift of forgiveness. He did all the hard works for us alll, almost 2,000 years ago, in that cross of Calvary! ",
        "good": "8",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "rockstarrn",
        "time": "15 May, 2021",
        "context": "At least they are practicing social distancing ",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "knowthetruthbeforeyoupost",
        "time": "15 May, 2021",
        "context": "Is our country, the only one that reports  see UFO’s?",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "americafinest",
        "time": "15 May, 2021",
        "context": "President Trump, DO SOMETHING! Make a statement, anything, your people are scared, Sir!",
        "good": "2",
        "bad": "3",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "zenrage",
        "time": "15 May, 2021",
        "context": "Another bad \"amazing\" UFO video.  Look at the waves on the water.  The dark vs light area is the shadow of the ship.  The \"UFO\" is bobbing on the waves.  It is not in the sky.  Pay attention to the camera movements, both the targeting camera and the camera filming the video screen.  The crews basketball or something went overboard.  Where is the non-targeting system camera footage from the deck?  None of the crew thought to pull out their cell phone and take a video of the aliens?!?!  Case closed.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "rikzak",
        "time": "15 May, 2021",
        "context": "Maybe these things are non-physical material but rather observational technology with no physical properties as we understand and cannot harm us. In other words, the real threat is yet to come or is on its way.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "mindbender43",
        "time": "15 May, 2021",
        "context": "\"Ryan Graves tells '60 Minutes' the unidentified objects are a security threat\".\n\nOnly if they're democrats.",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "ZipStorm",
        "time": "15 May, 2021",
        "context": "But does it have mass?  Perhaps it is sophisticated projections.  ",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "starsrecyled",
        "time": "15 May, 2021",
        "context": "They seem to have capabilities similar to a patent US10144532B2 awarded to the US Navy in 2018. Hmm...",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "j.dunn",
        "time": "15 May, 2021",
        "context": "They have been manipulating our gene pool and creating hybrid creatures for thousands of years",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "rexkarrs",
        "time": "15 May, 2021",
        "context": "for over 165 million years the dinosaurs ruled the earth they had an unfortunate demise the best thing the aliens could do is wipe out the entire human race and let the animals take over till the sun burns out hopefully that is their plan",
        "good": "2",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "GoldPumpkin",
        "time": "15 May, 2021",
        "context": "Foolish people will believe anything except the Word of God!",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "🇺🇸🙏",
        "time": "15 May, 2021",
        "context": "Great... just what we need, more illegal aliens.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "omnipresent330",
        "time": "15 May, 2021",
        "context": "If ever there's a war and it comes to choosing between liberals and extra-terrestrials, I would go with the latter any day and twice on Sunday.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "wantthetruth,bro",
        "time": "15 May, 2021",
        "context": "Had a dream the other night about these buggers.  Dreamt they'd been watching us for years and completely understood the dynamics of Earth's politics and, in particular, the US.  They understood the key role America played in maintaining peace and were resting easy when Trump was \"cracking the whip\", so to speak.  Then we 'brain farted' and elected Biden and America's ray of hope was snuffed out almost overnight.  \n\nTo give this world any chance of survival, one by one, the perps and bad actors were being met with a horrible punishment at the hands of these beings from space.  Pelosi, Schumer, Romney, Schiff, McCain, AOC, Taliban, Omar....the list is long and the penalty for their evil deeds was severe.  Some were able to \"see the light\" in time and repent.  But most were so bent on destroying the Constitution and the greatest nation the world has ever known that they took their ignorance and hatred to their grave.\n\nThe result was profound and it was quick.  Shades of \"The Day the Earth Stood Still\", Americans got our country back from the asylum and, for the first time since Man invented weapons, the world was at peace.  These guardians of humanity patrolled the Earth until humanity could take control.  Then they were gone with the promise to return if we ever needed them again.\n\nToo bad it was just a dream.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "GoldWrench",
        "time": "15 May, 2021",
        "context": "I don't know about aliens but UFO's are very much real, I always wondered if they weren't probes or cameras for beings in another dimension or perhaps planet. It's interesting that people immediately think of them as vehicles which I suspect is a reflection of Americans obsession with their cars.",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "zenrage",
        "time": "15 May, 2021",
        "context": "Earthlings are stupid and gullible.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mommasworry",
        "time": "15 May, 2021",
        "context": "This article is old news along with a few  videos that have been absolutely worn out ......what will be new is in a few weeks when that congressional  \"Report\" is due out one way or the other......these UAP's have been observed and photographed for the longest ...but no real electronic backup data to go with them ...till the last 10 years  from state of the art frontline Navy sensors made it possible ........the objects are not secret ....the ability to track and record them as of now is ...... our enemies are watching how we do things and what we make public ....which they do not ...I surmise that our adversaries are having the same issues with these UAP as we are",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "stargazer709",
        "time": "15 May, 2021",
        "context": "i might say its little green men but that would be a racist comment,",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "williambayer025",
        "time": "15 May, 2021",
        "context": "What people are failing to mention or recognize is that any entity --- foreign, domestic, or alien --- that has such superior technology, is probably also capable of using drones that we might mistake for insects, to spy on everything it wants to spy on, up close and in detail anywhere, any time, and carry out various functions. \n\nSo it's not the things that are seen buzzing around in the sky that pose the real threat --- it's the things we barely notice that are right next to us, looking like everyday Earth objects, that pose the real threat.",
        "good": "69",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "whathasbecomeofus",
        "time": "15 May, 2021",
        "context": "They are laughing at us so hard that they can't land!",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "LastAmericanPatriot",
        "time": "15 May, 2021",
        "context": "They should have taught him science and not gender studies.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "PurpleBowtie",
        "time": "15 May, 2021",
        "context": "Maybe they will land and take Senile Joe, Laughing Hyena, Pelosi, AOC, and Chucky for a long ride out this universe— wouldn’t that be great?",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "americafinest",
        "time": "15 May, 2021",
        "context": "Why didn't God tell us about these aliens, he should have, right?",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "JackieBermejo",
        "time": "15 May, 2021",
        "context": "The US government needs to tell the truth. Thing is they have lied themselves into a corner and they obviously don't know how to get out of it. So now that everyone has a cell phone and UFO videos that the military took got leaked out, they have to admit that something exists. They have to address this issue. All the years of them ridiculing people who have seen them. Belittling them and publicly humiliating them. The US Government needs to wipe the egg off of their faces, and come clean with the facts to the American public.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "lakegirlaz",
        "time": "15 May, 2021",
        "context": "I will never click on another AOC article again. I know this is the UFO article but it’s as close as I could come to AOC. She is getting far too much attention and by giving her name recognition alone and the amount she brings in from fundraising, she could find herself as speaker of the house or in the senate.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "cassiopeian",
        "time": "15 May, 2021",
        "context": "I'm still waiting for Biden to keep his campaign promise to cure cancer if appointed POTUS.\nLying dog face pony soldier!",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "sheriff32",
        "time": "15 May, 2021",
        "context": "Thank God for the aliens. They’re the only beings keeping our military in check.",
        "good": "0",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "americafinest",
        "time": "15 May, 2021",
        "context": "We got it, everything is a threat to these cons! EVERYTHING, starting with the DEM!",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "RobVG50",
        "time": "15 May, 2021",
        "context": "Curious to know what planet or galaxy they're from.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "fnkneeonmyneck",
        "time": "15 May, 2021",
        "context": "Whatever you do DON'T MAKE THEM MAD!",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "marbella434",
        "time": "15 May, 2021",
        "context": "My suspicions are now confirmed:  GLBTQRRSSSSSS ETC. come from another dirty planet.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "stargazer709",
        "time": "15 May, 2021",
        "context": "green lives matter,",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Tells_it_like_it_is",
        "time": "15 May, 2021",
        "context": "The UFOs realize it's a very weak Administration right now.  Best time for them to strike.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "retireddist1b",
        "time": "15 May, 2021",
        "context": "The answer is so simple and yet man's ego can't accept it.   The written history of man is not based on myth at all.   Propulsion is no problem if you can control gravity and without gravity there are no G-forces to contend with.   Mankind just doesn't have any control of gravity yet, but apparently other beings do.",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "osamequin",
        "time": "15 May, 2021",
        "context": "I still think it's a reflective optical thing going on.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "snake1970",
        "time": "15 May, 2021",
        "context": "Flew helicopters and planes for 36 years and looked for 2 items. A UFO and Bigfoot. Never saw one.",
        "good": "3",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "Dour",
        "time": "15 May, 2021",
        "context": "The best non-fully operational camera equipment 1930s can provide.  And the Cameraman is demon who was summoned by union-teacher democrat who is doing lines of coke on a underage Mexican immigrant girl forced into slavery by cannibalistic demarcates who promised not to serve her for dinner to the said demon.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "𝓑𝓵𝓾𝓮𝓶𝓾𝓽𝓽",
        "time": "15 May, 2021",
        "context": "UT Oh.....👽  we've been caught.....",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "JoseMAGA",
        "time": "15 May, 2021",
        "context": "It is ALWAYS fuzzy photos and videos - never clear ones! ... as Elon Musk has pointed out, in these times everyone has super-pixels jammed cell phones you'd think at least one of these shots will be clear.  (And, particularly, with the military having super-zoom equipment!)\n... don't bother us until you get at least one clear shot!\n\nThey should REQUIRE people to take training and be certified in not wobbling a shot and in focusing before they are allowed to own a cell phone!",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "westrider",
        "time": "15 May, 2021",
        "context": "It is very surprising that there isn't more public interest in what are now frequent confirmed sightings of these UFOs.  One has to wonder just what they are doing here and what is their ultimate purpose.",
        "good": "3",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "redinabluecity",
        "time": "15 May, 2021",
        "context": "When alien abductions of humans cease, then I could be persuaded they are not a threat.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "beefy8888",
        "time": "15 May, 2021",
        "context": "\"security threat\"?\n\nthats the wrong attitude to have when you are technologically out matched.\n\ni would be extremely nice, until we find their weaknesses.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jeffhere",
        "time": "15 May, 2021",
        "context": "maybe if we ask our alien overlords to send the dems, hardened criminals and terrorists (including antifa and blm) to another planet, we could have it pretty good here. \n\nSo what? let them watch. They could have destroyed all by now if they wanted to.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "khunbob",
        "time": "15 May, 2021",
        "context": "Please, Please...don't be demorats invading! We have enough of lifeless ones here on earth!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "falcoc",
        "time": "15 May, 2021",
        "context": "Liberal \"men\" are already lining up for the probing procedure.",
        "good": "7",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "responsiblevoter",
        "time": "15 May, 2021",
        "context": "These recent information releases from the Navy and other military (much more than ever before!) may indicate something more is coming fairly soon. Perhaps something big. I'll certainly be watching.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "$trumpidity",
        "time": "15 May, 2021",
        "context": "Look no further. The world has seen an alien in its true form: the hybrid orange panda clown in the circus white house of the past 4 years.",
        "good": "1",
        "bad": "9",
        "replies": []
    },
    {
        "user_name": "teaman654",
        "time": "15 May, 2021",
        "context": "Why do these UFOs only appear at night?  Videos are always fuzzy.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "xiden262",
        "time": "15 May, 2021",
        "context": "Unidentified flying Russians",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Treyncoop",
        "time": "15 May, 2021",
        "context": "May be a holographic image?",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ghostbuck",
        "time": "15 May, 2021",
        "context": "buzzing passenger aircraft faster than the speed of sound isn’t very friendly especially if your family is on one.\n\nHovering 700’ above the deck of a battleship isn’t very friendly, especially if  you’re commanding one.\n\nEntering into a Two Circle Fight (maneuver for tactical advantage) isn’t... wait my old man was a fighter pilot and would 100% of thought playing with a UFO would be a blast - so we’ll that one pass\n\nBut my point is this:  showing me how you can dominate me only instills fear and terror... which isn’t very friendly at all.",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Sons_of_the_Republic",
        "time": "15 May, 2021",
        "context": "We are at the end of the church age, time for the great tribulation, Mark of the Beast and the son of perdition to appear which controls the whole world. Seems there is a connection with this UFO's and what is about to be revealed.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Ericmp",
        "time": "15 May, 2021",
        "context": "If these things were such a security threat they would have attacked by now. Not to mention we are no match against them or their technological. Let’s be real about this, they found a way to fly who knows how many light years yet we can’t even send someone back to the moon because we “lost” the technology.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ccorwin",
        "time": "15 May, 2021",
        "context": "I'm calling the Biden Administration our biggest security threat!",
        "good": "11",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "insight3152",
        "time": "15 May, 2021",
        "context": "Woke up one night and definitely saw a UFO in my bed.  Yep right there beside me. Not sure how that unidentified female object got there, but I figured it was time to start cutting back on the tequila.",
        "good": "25",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "turbo4",
        "time": "15 May, 2021",
        "context": "Now that China and the US are landing on Mars looks like aliens are getting ready to remove the threat.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rayj785",
        "time": "15 May, 2021",
        "context": "Liberals are the reason the aliens won't talk to us.",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "troyman",
        "time": "15 May, 2021",
        "context": "They may very well be unidentified objects but they are not from another planet. There is absolutely zero evidence of there being life on another planet much less there being flying objects from such life on another planted. There has never been a truly aggressive attack by these so called UFOs.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "NeverWoke",
        "time": "15 May, 2021",
        "context": "Of course, this is the real deal. They've been here for a long time. I'm was a skeptic like most but everything changed with The Lights Over Phoenix (circa 1997). The Governor of Arizona who witnessed the event stated a decade later, it was not from this world after jesting at a press conference the day after the event so as to calm any public fears. First hand testimony of both US & USSR ex-military officials citing disabled ICBM's are on record. It's the Fermi Paradox. Why haven't we had contact with aliens? More than 2 trillion galaxies in our known universe, each with billions of stars and earth like planets. I believe they are Von Neumann probes. May not contain sentient beings. AI from an advanced civilization, perhaps a million(s) years ahead of us, a speck in cosmic time. Scientists have always been afraid to stick their necks out. Peer and funding pressures. It's their livelihood. Anyway, standby. P.S. It's not about \"us\". Never has been. Copernican Principal. Don't worry, the many theism (perhaps not deism) religions of the world will simply change their delusional dogmas.",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "bustygalore",
        "time": "15 May, 2021",
        "context": "With two billion cell phones out there with video cameras we can do better than this but I'm not optimistic at all !!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "richardtaster",
        "time": "15 May, 2021",
        "context": "Fox News,home for hard hitting UFO stories.When reading about UFO’s,read it on Fox first! 😩",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "thongor1",
        "time": "15 May, 2021",
        "context": "They are just here to rubber neck. They have been assured that our planet is one big car crash, just waiting to happen......",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "stephenjohnson_1",
        "time": "15 May, 2021",
        "context": "My son, daughter in law, wife, and grandkids saw 35 UFOs  fly over out house last year around 12:00 midnight during the summer. No idea what they were or are, but they were flying at a very high altitude with no sound. They seem to fly in formation, then seemed to stop and hover, before moving again at a high rate of speed and disappearing in different directions. It was other worldly watching this.",
        "good": "9",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "nocommies",
        "time": "15 May, 2021",
        "context": "If we can talk them into taking the liberals...to their own planet that they can mess up without effecting normal people...dare to dream...",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Tells_it_like_it_is",
        "time": "15 May, 2021",
        "context": "These UFOs are running out of gas in their failed attempt to look for intelligent life in the White House since January.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "MEGA2020",
        "time": "15 May, 2021",
        "context": "These are American made aircraft.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "whteshark55",
        "time": "15 May, 2021",
        "context": "\"We'll make great pets!\"",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "wonmug",
        "time": "15 May, 2021",
        "context": "Anything that tracks that perfectly is just a bug on the lens.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "belikewater114",
        "time": "15 May, 2021",
        "context": "So. It's way past time for the US government to open up the books on 'Operation High Jump'.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "trilobyte998",
        "time": "15 May, 2021",
        "context": "I think the obvious explanation is electricity.The universe is filled with MASSIVE currents of electricity linking all 'bodies' together at some level.IF an alien civilization knew how to harness these currents and their properties,there's no telling what they could be able to do.They wouldn't need conventional fuels to travel.And if they were that advanced,there would definitely be no need to spend much time here,except maybe to observe what's happening with 'homo sapiens' and where we're at technologically.Seriously.Planets and space have electrical circuits that possibly could be manipulated by 'some' advanced society.If we could develop something that could do this,space travel would be like a walk in the park.It's not so outlandish as it sounds.Look at Star Trek.Warp speed.That was then.And how many have said art imitates life.It COULD be a reality for some society out there.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "plinkety",
        "time": "15 May, 2021",
        "context": "Well we can be reassured for sure these aliens are not dimocrats. \nThey have superior power and technology and yet are not out to oppress our individual rights and free speech.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ConservativeView",
        "time": "15 May, 2021",
        "context": "I think it’s Bezos on his hover board.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Logical1and1is2",
        "time": "15 May, 2021",
        "context": "Wake up people… These are mediums… My personal opinion these are demons. All you have to do is take a look at second Thessalonians. Lying signs and wonders… How do you think they’re going to explain the Christian population just vanishing from thin air?? The aliens took them! Then it gives the world the perfect reason to unite as one! For peace and safety! The Bible also speaks of that.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Jaguarized076",
        "time": "15 May, 2021",
        "context": "These UFOs have harness resources available in dark energy for propulsion and are using dark matter as their transport layer.  That's why they appear to be defying the laws of physics.  The laws of physics in dark energy and matter are different than those we have so far discovered.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dogjaw988",
        "time": "15 May, 2021",
        "context": "There is something fishy going on here. Our military forces would shoot at a threat. But they don't. I'd like to know why they don't think they're a threat.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Trump-DeSantis-2024",
        "time": "15 May, 2021",
        "context": "Security risk? They can’t identify them. They object Las or beings haven’t aggressed in any way. They know nothing of these UFO’s, but in true human fashion, they fear the unknown and love their fear mongering.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cmtmjj2009",
        "time": "15 May, 2021",
        "context": "AI probes.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "captron680",
        "time": "15 May, 2021",
        "context": "No idea what is out there but I am now convinced that something is and its not a balloon or weather phenomenon. Is it some top secret ????/military something or ??? we have no idea. The bottom line is this, if the government exhibits to much public \"concern\" it will/could create world panic, but at the same time I believe the world governments are actually very concerned. The fear of a totally inept world wide military level of world protection would likely exist and this is a chilling thought!! What is out there??",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "redinabluecity",
        "time": "15 May, 2021",
        "context": "When alien abductions of humans cease, then I could be convinced they are not a threat.",
        "good": "0",
        "bad": "0",
        "replies": []
    }
]