[
    {
        "user_name": "RED1812",
        "time": "7 September, 2022",
        "context": "Sounds like a good thing to have a special prosecutor for after the election in November.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "tiredofthis3",
                "time": "7 September, 2022",
                "context": "Why?  I think he needs a special defense lawyer.  He's been caught stealing and lying.  ",
                "good": "2",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "bilf",
                        "time": "7 September, 2022",
                        "context": "How is it stealing when Trump, like every president has the highest clearance granted by the voters and no presidential clearance has never been revoked, even when the impeached perjurer confessed obstruction and perjury against Paula Jones on TV. Even Bill Clinton still has the highest clearance - though not his 'wife.'",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "tiredofthis3",
                                "time": "7 September, 2022",
                                "context": "He took them home to his country club rather than returning them to the National Archives as had been requested.  He returned some and had his lawyer sign legal documents saying all had been returned.  More documents were found in his possession during the search.  If he didn't intend to steal these documents, then why not just return them when asked?  Why did he lie about it?  Why keep them in a facility where foreign nationals roam around instead of in secure facilities as required?  If he had presidential clearance which has never been revoked, as you say, then there was no need to keep them in his personal possession.  ",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "foxtchecker",
                "time": "7 September, 2022",
                "context": "culling out the RED in US...",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "boonie78724",
        "time": "7 September, 2022",
        "context": "Could it be the only thing dangerous in Mar-a-Largo the night of the raid was the FBI?",
        "good": "6",
        "bad": "4",
        "replies": [
            {
                "user_name": "DamnItJimImJustACountryDoctor!",
                "time": "7 September, 2022",
                "context": "No.\nWondering anything else?",
                "good": "2",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "ShadyJ",
                "time": "7 September, 2022",
                "context": "The search warrant was executed in Broad daylight.",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "friendnotfoe119",
                "time": "8 September, 2022",
                "context": "Right. How about unguarded top secret classified US government documents floating around a hotel? shouldn't that be considered dangerous?",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "foxtchecker",
        "time": "7 September, 2022",
        "context": "FOX has buried this story again..",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "DamnItJimImJustACountryDoctor!",
        "time": "7 September, 2022",
        "context": "Nuclear secrets are just the same as library books, right Marco???",
        "good": "4",
        "bad": "2",
        "replies": [
            {
                "user_name": "bilf",
                "time": "7 September, 2022",
                "context": "So the FBI is also leaking library books to Democrat press \"members?\" Nineteen Eighty-four is a cautionary tale, not a Democrat press reporter instruction manual.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "DamnItJimImJustACountryDoctor!",
                        "time": "8 September, 2022",
                        "context": "Why should Trump be given a pass for breaking the law?",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "ArcticLatitude",
                "time": "7 September, 2022",
                "context": "Nothing has been proven or asserted, it's all heresy and unverifiable.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "DamnItJimImJustACountryDoctor!",
                        "time": "8 September, 2022",
                        "context": "We all know that the reporting must be true.\nTrump is just this crazy that he'd have nuclear docs.",
                        "good": "0",
                        "bad": "1",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "rvsnavely",
        "time": "7 September, 2022",
        "context": "Hildog was leaked and shared, in unsecured  server, hidden in a closet.. So What about Trump, except the socialist do not want him running for President again and will tell any lie, plant any false information  and do anything to stop him.  ",
        "good": "2",
        "bad": "1",
        "replies": [
            {
                "user_name": "tryingthisout",
                "time": "7 September, 2022",
                "context": "Socialist……drink!",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "midwestfoxhound",
        "time": "7 September, 2022",
        "context": "What information has been leaked?  If not for Trump we would not even know a search warrant was executed.  If not for Trump we would have never seen the affidavit.   Without armed assaults against the FBI and MAGA outcry we would not know what inventory was removed.\nWhat \"leak\" has occurred from DOJ or FBI? ",
        "good": "8",
        "bad": "8",
        "replies": [
            {
                "user_name": "noneofyourbz",
                "time": "7 September, 2022",
                "context": "exactly, it was sealed and trump made a stink about \"releasing\" the warrant.... he had a copy he could have published,... this is trump making a stink because he got caught \nanything he left laying around unprotected he will claim was planted",
                "good": "2",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "bilf",
                "time": "7 September, 2022",
                "context": "The leaks, multiple, from FBI Democrats to Democrats at the Wa Po unless like woodie and bernie - the Dem 'reporters' are lying by omission, again. ",
                "good": "0",
                "bad": "2",
                "replies": []
            },
            {
                "error": "error"
            }
        ]
    },
    {
        "user_name": "paladinm",
        "time": "7 September, 2022",
        "context": "\"If there are skeletons in the closet, the FBI will find them.  And if not, they will put some there!\"",
        "good": "6",
        "bad": "0",
        "replies": [
            {
                "user_name": "tiredofthis3",
                "time": "7 September, 2022",
                "context": "His own lawyer says they should have expected to find some there, so ....",
                "good": "2",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "kfrasier5",
                "time": "9 September, 2022",
                "context": "If the documents were planted by the FBI, then what did Trump mean when he said he'd declassified them?",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "foxtchecker",
        "time": "7 September, 2022",
        "context": "Trump demands that US be told all that has been found, for he does not know what he left scattered around his mansion.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "wtf1960",
        "time": "7 September, 2022",
        "context": "If its Trump related the doj and fbi can't keep a secret but when its biden they can keep it completely quiet for 4 years",
        "good": "2",
        "bad": "1",
        "replies": [
            {
                "user_name": "friendnotfoe119",
                "time": "8 September, 2022",
                "context": " It was Trump that brought the search to our attention because he thought he could spin the situation to his advantage and rile up his base with claims of persecution by the Deep State. Shows how little respect that he actually has for them. This time even they realize that stealing and lying about classified, top secret documents isn't ok. MAGA, blah, blah, blah. What a joke. ",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "bilf",
        "time": "7 September, 2022",
        "context": "The Democrats at the FBI have permission from a Democrat president (Biden) to help with the Democrat bloodbath in Nov. Whether this will succeed remains to be seen. Sometimes Democrat election tampering, backfires. I hope it does, this time.",
        "good": "2",
        "bad": "2",
        "replies": [
            {
                "user_name": "tiredofthis3",
                "time": "7 September, 2022",
                "context": "Trump isn't running for office now and he hasn't made any announcements in the future.  If doing so protects him, how do we hold leaders accountable?  Personally, I vote for candidates and not parties.  I do question this leak in particular, however, because it is so high level that very few could know about it.  I wish everyone could keep their mouths shut and just let the process play out.  Trump has a right to defend himself, but I sure don't see how he can win in this case regardless of what was in those classified documents he was hiding.  He lied and he's been caught.  He should pay the price.",
                "good": "0",
                "bad": "2",
                "replies": [
                    {
                        "user_name": "bilf",
                        "time": "7 September, 2022",
                        "context": "Excellent non response to my post about FBI Democrat employees of 'president' Biden trying to tamper with the November election this year. Good Democrat reading ability, you have a fine Democrat 'education.'",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "bloodymess753",
                                "time": "7 September, 2022",
                                "context": "Nobody cares what you think. ",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "tryingthisout",
        "time": "7 September, 2022",
        "context": "Hey Marco Rubio… keeping Top Secret documents related to a foreign government’s nuclear readiness still sound like a “storage issue”?",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "ArcticLatitude",
                "time": "7 September, 2022",
                "context": "It's all hearsay nothing has been presented as proof....photos\nthat only show cover sheets and leaks to the press......this is\nwithout merit.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "notalibtard!",
        "time": "13 September, 2022",
        "context": "I'm not saying that Trump is not guilty, and in all honesty I'd rather have Desantis be the republican candidate for president, but in saying that I just can't trust the FBI after the Hillary email server thing, and the false Russia collusion narrative.   ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "joseph2276",
        "time": "8 September, 2022",
        "context": "Rubio is concerned about FBI information about what was in boxes but not about Trump having kept top secret nuclear info at his residence.  Wonderful. ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "PurpleFlower",
        "time": "7 September, 2022",
        "context": "My conjecture can be as good or bad as anyone else’s. Maybe there is mention of Iran’s or North Koreas nuclear readiness in documents. Maybe a mention of who should build Australia’s nuke subs, US, or France? If what they were after was a national defense issue, you would think they would have acted with more urgency.",
        "good": "2",
        "bad": "1",
        "replies": [
            {
                "user_name": "ArcticLatitude",
                "time": "7 September, 2022",
                "context": "Nothing can be worse than the US government agencies going political and\nbeing used to eliminate the opposition using all venues under the guise of\nlaw enforcement and national security.",
                "good": "1",
                "bad": "1",
                "replies": []
            },
            {
                "user_name": "joseph2276",
                "time": "8 September, 2022",
                "context": "they had no way of knowing what was in all 15 or whatever boxes. They suspected and asked and asked and finally raided.  So you think they should have raided earlier? Cant win here at Fox. ",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "foxtchecker",
        "time": "8 September, 2022",
        "context": "US cares less of what rubio thinks..",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "repost52",
        "time": "7 September, 2022",
        "context": "They keep referring to nuclear secrets of an un-named country. Wouldn't the country have to be named in order for these to be actual nuclear secrets?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ArcticLatitude",
        "time": "7 September, 2022",
        "context": "All the predawn raids and bogus accusations by the DOJ from \n2016 - September 2022 have been orchestrated by the Democrats in the\nDOJ, FBI and Biden administration sitting in the West Wing.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Doodreally",
        "time": "8 September, 2022",
        "context": "But, but Grassley and Hunter!!!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "theam",
        "time": "7 September, 2022",
        "context": "Always carry, be mentally and physically prepared to use deadly force when democrat operatives arrive at your home to deprive you of life or liberty without probable cause.  ",
        "good": "2",
        "bad": "0",
        "replies": []
    }
]