[
    {
        "user_name": "james_from_nc048",
        "time": "9 September, 2022",
        "context": "There is this pesky thing called the 1st Amendment.  Protects the right of free speech and free association.  So they may not like what he says or who he talks to, but the moment they try to punish him they are in the wrong.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "Teacher124351",
                "time": "9 September, 2022",
                "context": "Does not apply in the military, it is however a one way street.",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "Duty1st",
                "time": "9 September, 2022",
                "context": "The Supreme Court has long held that the First Amendment's protection of free speech, assembly, and petition logically extends to include a “freedom of association.\" Generally, this means we have the freedom to associate with others who have similar political, religious, or cultural beliefs. \nThey always forget that we do not have to accept these \"criminals\".",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "fover",
        "time": "9 September, 2022",
        "context": "I absolutely do not agree with white supremacy or racially motivated extremism... but isn't it strange that only \"right wing\" extremists are caught.  I mean... aren't there a bunch of left wing extremists to go after out there?  Like maybe Abortion activists that destroy pro-life health centers, and BLM and Antifa supporters that riot, burn and destroy anything whenever possible???",
        "good": "5",
        "bad": "0",
        "replies": [
            {
                "user_name": "nukesforever🇺🇸536",
                "time": "9 September, 2022",
                "context": "🤫",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "edwinalmondo",
        "time": "9 September, 2022",
        "context": "Called Opinion.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jim0987654321",
        "time": "9 September, 2022",
        "context": "anything that Rolling Stone reports on I dismiss it, reduce to the ridiculous or minimize it.\nyou can't go on believing this kind of media anymore",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "jackjack180a",
                "time": "10 September, 2022",
                "context": "But you only can believe Tucker Carlson ",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "antiantifa853",
        "time": "9 September, 2022",
        "context": "People don't hate blacks because of the color of their skin. They hate them because the way they act and their criminal behavior. ",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "jackjack180a",
                "time": "10 September, 2022",
                "context": "The keyword is THEY!!! Burn any cross lately?",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "1sparky",
        "time": "9 September, 2022",
        "context": "They allow this behavior on social media but ban the truth about covid and hunter Biden ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "chiefsbrat",
        "time": "9 September, 2022",
        "context": "He's a gem.\nCircumstances seem odd. If he's at Bragg, his background should already have been vetted. He did have a DUI this summer, so maybe a follow up snagged this.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "richardkittyhawk",
        "time": "10 September, 2022",
        "context": "The locals call Fayetteville, NC Fayettenam.  It has always seemed like a trashy city.  Lots of soldiers get into trouble there.  As for the soldier, I am not really surprised about it.  Everyone is taught the rules upon entering the military.  You have to be careful who you associate with and what you do or you can get into some real trouble.",
        "good": "0",
        "bad": "0",
        "replies": []
    }
]