[
    {
        "user_name": "greenmonster",
        "time": "9 September, 2021",
        "context": "You know what the real problem with all of this nonsense is?  I saw a documentary where several physicists finally revealed that no matter how fancy a spaceship or fancy a telescope or transportation systems the physical human body flesh cannot withstand space travel and that within a year to year and a half we would be hopelessly crippled and unable to pilot the ship or even be physically able to continue the mission... This is supported by recent visits to the space station where astronauts stayed a year or year and a half upon arrival back at Earth after 18 months in space they were unable to walk nearly blind and physically crippled.... Yet we have all of these Star wars and Star Trek nuts that say well a 13-year mission to planet x would be wonderful if we could travel at light speed and spend 13 years in space which our bodies can't handle",
        "good": "7",
        "bad": "9",
        "replies": [
            {
                "user_name": "chessplayer",
                "time": "9 September, 2021",
                "context": "Great point! The only space trip I ever thought would be interesting is a trip to the moon. In my mid 50s now and not wealthy so chances are not in my favor, lol.",
                "good": "3",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "jose9056",
                "time": "9 September, 2021",
                "context": "You need to read beyond the Inquirer.  Yes, vision changes have been documented.  Some may be permanent.  Vision changes also occurred in dive bomber pilots in WWII.  That problem was solved by the G-suit.  Of course, those changes were short term, but the cause was also fluid shift.  Current research also supports a reverse fluid shift compared to what those pilots experienced.  (Black-out are what one usually refers to from negative G, but red-outs are also known.)   The solution may be a as simple as a special space suit, or there may be pharmacologic solutions.  I would favor a mechanical solution to the problem over drugs. \n\nNothing from ISS supports the assertion that humans cannot live in micro-gravity for long periods with suitable adaptations.",
                "good": "5",
                "bad": "1",
                "replies": []
            },
            {
                "user_name": "SgtSnake999",
                "time": "9 September, 2021",
                "context": "It was once held as truth that the \"physical human body flesh\" could not withstand exceeding the speed of sound. I put it to you also a study of occupants of a static, non-rotating (to produce artificial gravity) space station, is not to be considered the final test. Even Skylab had artificial gravity from rotation, with a run by one of the astronauts on the inside walls filmed. \n\nThat said, I agree that the search for another planet doesn't matter at this time, unless we have the ability to actually GO there.",
                "good": "1",
                "bad": "2",
                "replies": []
            }
        ]
    },
    {
        "user_name": "MichieDeF",
        "time": "9 September, 2021",
        "context": "So this is the DB that took Pluto away from all of us middle aged folk. Now he wants to replace it with some other supposed mass and take the credit? Pound sand, pal. Give us Pluto back and no one gets hurt",
        "good": "131",
        "bad": "9",
        "replies": [
            {
                "user_name": "hrt2hrt",
                "time": "9 September, 2021",
                "context": "Pluto remains among my planets, but Biden is not my president.",
                "good": "86",
                "bad": "4",
                "replies": [
                    {
                        "user_name": "lycopine",
                        "time": "9 September, 2021",
                        "context": "Pluto is the name of a celestial body, but who is your president? Bolsanaro?",
                        "good": "0",
                        "bad": "1",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "TooWellToAttend",
                "time": "9 September, 2021",
                "context": "Please step-away from the asteroids!",
                "good": "8",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "Femadurkadur",
                "time": "9 September, 2021",
                "context": "Even worse his name is Michael Brown ",
                "good": "8",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "rmr769911",
                "time": "9 September, 2021",
                "context": "Pluto is and will always be, can’t change it in my book.",
                "good": "12",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "laurele",
                "time": "9 September, 2021",
                "context": "He didn't take Pluto away except in his head. Reject the IAU definition and join the majority of planetary scientists who still consider Pluto--and all dwarf planets--to be a planet.",
                "good": "1",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "wy66",
                "time": "9 September, 2021",
                "context": "The trouble is, if you define Pluto as a planet, you must also add hundreds if not thousands of similar bodies in the Kuiper Belt.  It wasn't one scientist who did this.  By definition, a planet must meet three criteria.  1) It must be spherical.  2) It must orbit its star.  3) It must clear its orbit of debris.  Pluto meets the first two but not the third, like many other of its neighbors in deep space.  Pluto is still an amazing celestial body.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "lycopine",
                        "time": "9 September, 2021",
                        "context": "Item 3 is quite nebulous. How is the debris field measured? There remains plenty of debris orbiting all planets.",
                        "good": "1",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "wy66",
                                "time": "10 September, 2021",
                                "context": "Yes, but there is no debris in their orbit that orbits the sun.",
                                "good": "0",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "lycopine",
                                        "time": "10 September, 2021",
                                        "context": "there is plenty of debris in all Solar system planetary orbits, which by definition, orbit the Sun. Just because it is not readily visible doesn't mean it's not there.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": [
                                            {
                                                "user_name": "wy66",
                                                "time": "10 September, 2021",
                                                "context": "You know, I think I'll go with Drs. Thaller, Oluseyi, and Plait have said.  You know, the ones with a Phd in astronomy...",
                                                "good": "0",
                                                "bad": "0",
                                                "replies": [
                                                    {
                                                        "user_name": "lycopine",
                                                        "time": "10 September, 2021",
                                                        "context": "Oh, OK. Ask them and they'll tell you there is debris, just not enough to measure for removal of condition 3. My question was about the condition itself and how \"debris\" is determined for it.\nYou left out professor Lawrence Kraus too.,",
                                                        "good": "0",
                                                        "bad": "0",
                                                        "replies": []
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "error": "error"
    },
    {
        "user_name": "HarryMybalzich",
        "time": "9 September, 2021",
        "context": "How do people get these useless jobs studying things that don't make a bit difference to anyone?? Looking for planet nine and getting paid to do that? Can I get paid to look for Jimmy Hoffa when I go to the golf course or the Lost City of Atlantis in my inground pool?",
        "good": "43",
        "bad": "21",
        "replies": [
            {
                "user_name": "BuckFoeJiden",
                "time": "9 September, 2021",
                "context": "Your lack of understanding doesn't render their efforts useless. The math and observations which predict this possibility would be conclusively validated should they find the planet actually exists. Thus; there would be greater confidence in that math in later use.",
                "good": "14",
                "bad": "21",
                "replies": [
                    {
                        "user_name": "DissidentAmeriCan-notAmeriKantz",
                        "time": "9 September, 2021",
                        "context": "Follow the science? It may be there, it may not be there, it may have once been there, it may one day return or not return. I am asking Joie, for a 20 million grant to study these and other inconsequential sciences.",
                        "good": "11",
                        "bad": "6",
                        "replies": [
                            {
                                "user_name": "BuckFoeJiden",
                                "time": "9 September, 2021",
                                "context": "Non Sequitur",
                                "good": "0",
                                "bad": "2",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "user_name": "Bullmstff",
                        "time": "9 September, 2021",
                        "context": "Well.... I guess this scientist was not black, if you are correct.",
                        "good": "8",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "BuckFoeJiden",
                                "time": "9 September, 2021",
                                "context": "I don't understand your statement, it makes no sense what so ever.",
                                "good": "0",
                                "bad": "5",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "user_name": "HarryMybalzich",
                        "time": "9 September, 2021",
                        "context": "Seems like they could find a different topic to validate the math with than something that doesn't matter to anyone..",
                        "good": "5",
                        "bad": "2",
                        "replies": [
                            {
                                "user_name": "BuckFoeJiden",
                                "time": "9 September, 2021",
                                "context": "Just because it doesn't matter to you does not mean that it doesn't matter to anyone.",
                                "good": "2",
                                "bad": "1",
                                "replies": [
                                    {
                                        "user_name": "HarryMybalzich",
                                        "time": "9 September, 2021",
                                        "context": "Ok, so explain how it could matter. Other than to provide someone a useless job?",
                                        "good": "2",
                                        "bad": "2",
                                        "replies": [
                                            {
                                                "user_name": "BuckFoeJiden",
                                                "time": "9 September, 2021",
                                                "context": "If you don't already understand that, me explaining it to you would be futile. But, I'll try.\n\nWould you be happy if you found out that an asteroid was about to crash into Earth and probably will destroy all life on it? Then you find out that it could have been avoided if we had known it was there earlier? The same science that they are using to predict the existence of this mass is used to predict and find such a mass.",
                                                "good": "3",
                                                "bad": "3",
                                                "replies": [
                                                    {
                                                        "user_name": "HarryMybalzich",
                                                        "time": "9 September, 2021",
                                                        "context": "That might be true but it seems a lot more likely that the pursuit of a planet nine is because someone thinks it's fun to look for it and if they do find it, they can write a paper on it and make a lot of money on something that doesn't make any difference to anyone.",
                                                        "good": "2",
                                                        "bad": "2",
                                                        "replies": [
                                                            {
                                                                "user_name": "BuckFoeJiden",
                                                                "time": "9 September, 2021",
                                                                "context": "I knew that you would be too obtuse to understand, that was obvious from the start. Run along now child, your entertainment value has ended.",
                                                                "good": "2",
                                                                "bad": "3",
                                                                "replies": []
                                                            }
                                                        ]
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "user_name": "676",
                        "time": "9 September, 2021",
                        "context": "Suppose your analysis is correct.  What actual benefit would it have to the average human being when we still don't have a clue of everything in our own oceans?",
                        "good": "5",
                        "bad": "2",
                        "replies": [
                            {
                                "user_name": "BuckFoeJiden",
                                "time": "9 September, 2021",
                                "context": "Your reference to our oceans is irrelevant to this topic. The actual benefit would be that it puts a finer point on the tools used in predicting and pinpointing celestial objects which can't be observed directly by current tools. This in turn would make travel within our solar system less uncertain. This ability will be needed as humans move further and further out into space.",
                                "good": "3",
                                "bad": "5",
                                "replies": [
                                    {
                                        "user_name": "676",
                                        "time": "9 September, 2021",
                                        "context": "The only thing that makes it irrelevant, TO YOU, is the fact that you can't discuss the merits of spending only a fraction of the money on ocean exploration verses the money that would be spent on travel into the abyss.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": [
                                            {
                                                "user_name": "BuckFoeJiden",
                                                "time": "9 September, 2021",
                                                "context": "non sequitur",
                                                "good": "0",
                                                "bad": "0",
                                                "replies": []
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "user_name": "samiamgreeneggsandham",
                        "time": "9 September, 2021",
                        "context": "I thought math and science was racist. . .",
                        "good": "2",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "BuckFoeJiden",
                                "time": "9 September, 2021",
                                "context": "To some people, perhaps.",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "user_name": "planomike",
                        "time": "9 September, 2021",
                        "context": "Nice post and spot on.",
                        "good": "0",
                        "bad": "1",
                        "replies": [
                            {
                                "user_name": "BuckFoeJiden",
                                "time": "9 September, 2021",
                                "context": "Thanks",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "HawaiiFive-Oh",
                "time": "9 September, 2021",
                "context": "Look at the VP, Kamala.  She gets paid for doing nothing. ",
                "good": "59",
                "bad": "2",
                "replies": [
                    {
                        "user_name": "RenewCountry'sFoundation",
                        "time": "9 September, 2021",
                        "context": "You're wrong she is doing everything she can do to support the destruction of America.",
                        "good": "11",
                        "bad": "1",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "TheJackal454",
        "time": "9 September, 2021",
        "context": "Did he find AOC's brain out there too?",
        "good": "39",
        "bad": "4",
        "replies": [
            {
                "user_name": "seabeesw2(scw)",
                "time": "9 September, 2021",
                "context": "It would have to exist in order to be found.",
                "good": "15",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "enosh1",
                        "time": "9 September, 2021",
                        "context": "Truth is that there are other similar bodies that revolve around out Sun, but they are in the same scientific category as Pluto.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "SgtSnake999",
                "time": "9 September, 2021",
                "context": "That was the \"black hole\" mentioned.",
                "good": "7",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "HawaiiFive-Oh",
        "time": "9 September, 2021",
        "context": "If you get the chance, look at Saturn through a telescope.  If the planet is angled the right way, you can see the rings. It's awesome and beautiful to see. ",
        "good": "56",
        "bad": "0",
        "replies": [
            {
                "user_name": "SgtSnake999",
                "time": "9 September, 2021",
                "context": "The rings of Saturn was the first thing I thought of when the idea there has to be a planet 9 due to where the cluster of asteroids is. Where is the unseen planet or moon that caused the rings of Saturn if that is the case?",
                "good": "1",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "planomike",
                        "time": "9 September, 2021",
                        "context": "The 62 Saturn moons we have found caused the dust and small debris to form the rings.",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "rubiks6",
                        "time": "9 September, 2021",
                        "context": "Researchers have stated they have no idea how the rings of Saturn formed. Computer models indicate they should dissipate in just a few thousand years. Perhaps they were created by fiat for our observational benefit.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "lycopine",
                                "time": "10 September, 2021",
                                "context": "did your imaginary god create them with dust from noah's fictional boat?",
                                "good": "0",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "rubiks6",
                                        "time": "11 September, 2021",
                                        "context": "No. The true, living God merely spoke them into existence three days after He created the Earth. \n\nI suppose you think Saturn’s rings emerged, like the rest of the universe, from nothing at all that billions of years ago. \n\n\"Ex nihilo nihil fit.\" \n— Parmenides (Famous Greek philosopher)\n\nBy the way — Time is not an operand  in the equation, e = m c ². Billions and trillions of years will never produce matter and energy from nothing.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": [
                                            {
                                                "user_name": "lycopine",
                                                "time": "11 September, 2021",
                                                "context": "Says you. Oh, and c is the velocity of light, and by definition velocity  is distance divided by time, making time an operand. \nAnd beyond the event horizon of a black hole lies another universe and from that other universe matter comes in to our universe, i.e. something from nothing.\n\nGood try though.\n\nWhat did your imaginary say to talk things in to existence? Did you hear voices in your head?",
                                                "good": "0",
                                                "bad": "0",
                                                "replies": [
                                                    {
                                                        "user_name": "rubiks6",
                                                        "time": "11 September, 2021",
                                                        "context": "You should stick to thinking about Donald Trump because you’re better at thinking about him than you are at thinking about physics.",
                                                        "good": "0",
                                                        "bad": "0",
                                                        "replies": []
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "enosh1",
                "time": "9 September, 2021",
                "context": "Certainly is. The same goes for Jupiter with its moons suspended about its massive body.",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "pattypat",
                "time": "9 September, 2021",
                "context": "Saturn was the first planet I saw through my first telescope as a kid. I'll never forget that first time. Totally awesome.",
                "good": "8",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "jbt8889",
                "time": "9 September, 2021",
                "context": "AOC said it’s called little planet!!!",
                "good": "1",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "lycopine",
                        "time": "9 September, 2021",
                        "context": "The OOFF** believes astrology will find planet 9...\n\n**obese orange faced fuhrer",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "a-black-dude",
                "time": "9 September, 2021",
                "context": "It’s epic.",
                "good": "2",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "rubiks6",
                "time": "9 September, 2021",
                "context": "Saturn will be angled the right way for another decade \nor so. \n\nJupiter is more fun because, if you’re patient, you can see its moons moving, even with a low quality telescope.",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "Bobnjoanie",
        "time": "9 September, 2021",
        "context": "Your 15 minutes are up, give it a rest. ",
        "good": "8",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "DissidentAmeriCan-notAmeriKantz",
        "time": "9 September, 2021",
        "context": "We want Pluto, we want Pluto, Hey Michael Brown didn't you die in Fergusson MO?",
        "good": "31",
        "bad": "3",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "txfeller",
        "time": "9 September, 2021",
        "context": "Will Musk be signing people up for a visit?",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "canpwrtrio",
        "time": "9 September, 2021",
        "context": "It's just beyond comical to me that anyone pays any attention to these dimestore \"astronomers.\" Pluto is a planet, just as God made it. Period.",
        "good": "27",
        "bad": "5",
        "replies": [
            {
                "user_name": "FudgeFactor700",
                "time": "9 September, 2021",
                "context": "and it's beautiful too.",
                "good": "7",
                "bad": "1",
                "replies": []
            },
            {
                "user_name": "raginafalange",
                "time": "9 September, 2021",
                "context": "If Pluto is a planet then there are like 30 planets in the solar system.  and none of them required a god",
                "good": "0",
                "bad": "10",
                "replies": [
                    {
                        "user_name": "laurele",
                        "time": "9 September, 2021",
                        "context": "So what? There is no scientific merit to the concept that the solar system cannot have \"too many planets.\" It has whatever number of planets it has. Dwarf planets are simply a subclass of planets, as intended by planetary scientist Alan Stern, who coined the term back in 1991.",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "gv71",
                "time": "9 September, 2021",
                "context": "And the Earth is at the center of the universe.  Just as God made it.  Period. /",
                "good": "1",
                "bad": "9",
                "replies": [
                    {
                        "user_name": "lycopine",
                        "time": "9 September, 2021",
                        "context": "and you know this because one of 10,000+ documented gods told you?",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "guyfawkes1105",
                "time": "9 September, 2021",
                "context": "Planet is just a definition.  I doubt God has an opinion whether the mass created is called a planet or dwarf planet.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "hrt2hrt",
        "time": "9 September, 2021",
        "context": "For me, it will always be:\n\nMy Very Elegant Mother Just Sat Upon Nine Pies.  Pies for eternity!",
        "good": "18",
        "bad": "0",
        "replies": [
            {
                "user_name": "old.cav.guy",
                "time": "9 September, 2021",
                "context": "My Very Educated Mother Just Served Us Nine Pickles",
                "good": "7",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "doseas",
                        "time": "9 September, 2021",
                        "context": "Many Vicious Elephants May Jump Somewhere Up Near Pluto",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "uramoron",
        "time": "9 September, 2021",
        "context": "Neptune is full of gas, kind of like everyone in the Biden administration.",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "enosh1",
        "time": "9 September, 2021",
        "context": "Looking for another cold dark planet deep in space? I can think of a few places in Washington where that search might be successful.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "HawaiiFive-Oh",
        "time": "9 September, 2021",
        "context": "My asteroids are killing me.",
        "good": "2",
        "bad": "0",
        "replies": [
            {
                "user_name": "GreenCandy",
                "time": "19 September, 2021",
                "context": "Do you have asteroids, Randy asks of his cousin, hoping for some video fun.... No, cousin replies happily... but my father does!",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "peterq292",
        "time": "9 September, 2021",
        "context": "Interesting that Neptune is a non solid gaseous planet.  Let’s not land anything there, okay?",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "af_vet",
        "time": "9 September, 2021",
        "context": "If the planet exists (based on gravity impact data of surrounding objects) and it cannot be seen, it might suggest an object that absorbs light.  Artificial object?",
        "good": "4",
        "bad": "2",
        "replies": [
            {
                "user_name": "Fncisnumber1",
                "time": "9 September, 2021",
                "context": "It only has to be dirty enough to be unable to reflect enough visible light to be easily seen.  ",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "cal2177",
        "time": "9 September, 2021",
        "context": "Got to keep that grant money coming in.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "reallypeople",
        "time": "9 September, 2021",
        "context": "There will always be someone who holds a view contrary to the expansion of human knowledge. Thanks goodness for humanity that the opposite is also true. Humans made it out of caves, but some still remain in their basements.",
        "good": "23",
        "bad": "0",
        "replies": [
            {
                "user_name": "chessplayer",
                "time": "9 September, 2021",
                "context": "Funny and true!",
                "good": "10",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "sciencerocks",
                "time": "9 September, 2021",
                "context": "Making it into caves was one of our ancestors' greatest achievements.",
                "good": "2",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "FMCDH489",
                        "time": "9 September, 2021",
                        "context": "Unfortunately some cave person felt sorry for the BIDEN lineage standing out in the rain, looking up like turkeys, and brought them in!",
                        "good": "0",
                        "bad": "1",
                        "replies": [
                            {
                                "user_name": "lycopine",
                                "time": "9 September, 2021",
                                "context": "and even more unfortunately, some mutation created CANCER-vatives, the disease killing America, and everything else.",
                                "good": "0",
                                "bad": "1",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "user_name": "YetHereYouAre",
                        "time": "16 September, 2021",
                        "context": "And millennials still in their parents basement is one of our biggest disappointments.",
                        "good": "0",
                        "bad": "1",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "lycopine",
                "time": "9 September, 2021",
                "context": "and churches...",
                "good": "1",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "rubiks6",
                        "time": "9 September, 2021",
                        "context": "liposuction. \n\nJust sayin’.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "lycopine",
                                "time": "10 September, 2021",
                                "context": "rubix, a six sided mutation with no brain..\njust sayin'",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "Ghutter610",
                "time": "10 September, 2021",
                "context": "lets call it planet Claire in honor to the B52s",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "mrmacktitties",
                "time": "3 October, 2021",
                "context": "we live in man made caves",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "Winkwinkboom",
        "time": "9 September, 2021",
        "context": "We was Taught a song to remember the names of the planets wow",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "AntonChigurh",
        "time": "9 September, 2021",
        "context": "Science on Fox is an oxymoron ...",
        "good": "2",
        "bad": "12",
        "replies": [
            {
                "user_name": "tightlines",
                "time": "9 September, 2021",
                "context": "As opposed to you ...just a simple moron?",
                "good": "11",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "old.cav.guy",
                "time": "9 September, 2021",
                "context": "so, which gender are you?",
                "good": "5",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "jqpublicus",
        "time": "9 September, 2021",
        "context": "This whole Planet 9 thing is beyond idiotic. Neptune, the planet furthest from the Sun, was discovered 1846. 1846. With the rudimentary devices of the day. Today, they find planets in other star systems, including a suspected one in the Andromeda Galaxy, 27,000+ light years away. But they can't find Planet 9. Whatever, chief. Keep stealing the grant money.",
        "good": "3",
        "bad": "0",
        "replies": [
            {
                "user_name": "Fncisnumber1",
                "time": "9 September, 2021",
                "context": "The problem is the models suggest something is there. It’s the only thing that explains the behavior of objects we can see.  ",
                "good": "1",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "⭐Dukie-UltraMAGA",
                        "time": "9 September, 2021",
                        "context": "The models said 20 million of us were gonna die of Covid in six months.   Models can be wrong.",
                        "good": "2",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "smokeg",
                                "time": "9 September, 2021",
                                "context": "Excellent point. And speaking of planets, you might want to add the climate change models as well.",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "user_name": "jqpublicus",
                        "time": "9 September, 2021",
                        "context": "You're incorrect in stating that Planet 9 is the only thing that explains the odd orientation of a limited number of Kuiper Belt objects.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "chessplayer",
        "time": "9 September, 2021",
        "context": "Disney’s Pluto is upset to hear the planet he was named after is toast.",
        "good": "4",
        "bad": "0",
        "replies": [
            {
                "user_name": "oldesalty",
                "time": "9 September, 2021",
                "context": "I recently read that an 11 year old girl named the planet after the dog.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "BlueHat",
        "time": "9 September, 2021",
        "context": "How's jesus? Probably not to thrilled.",
        "good": "1",
        "bad": "7",
        "replies": []
    },
    {
        "user_name": "landofmakebelieve",
        "time": "9 September, 2021",
        "context": "Planet 9 is on Stacey Abraham’s backside.",
        "good": "3",
        "bad": "0",
        "replies": [
            {
                "user_name": "⭐Dukie-UltraMAGA",
                "time": "9 September, 2021",
                "context": "No, that's the moon.",
                "good": "1",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "smokeg",
                        "time": "9 September, 2021",
                        "context": "Dare I say it...black h*le.",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "bloviatethis",
        "time": "9 September, 2021",
        "context": "Well, we need Elon Musk to send a deep space probe out there I guess...",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "PurpleToast",
        "time": "9 September, 2021",
        "context": "It was a crime against humanity to demote Pluto.\n\nPLUTO IS A PLANET, ALWAYS HAS BEEN, ALWAYS WILL BE.",
        "good": "33",
        "bad": "5",
        "replies": [
            {
                "user_name": "SuperDago_Surfer",
                "time": "9 September, 2021",
                "context": "Nice thought from our childhoods, but unfortunately science says otherwise. Trust the scientific method.",
                "good": "6",
                "bad": "9",
                "replies": [
                    {
                        "user_name": "rubiks6",
                        "time": "9 September, 2021",
                        "context": "“Science” doesn’t make definitions. Scientists do. Those are people who often change their minds. Learn the difference. It’s an important distinction.",
                        "good": "3",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "SuperDago_Surfer",
                                "time": "10 September, 2021",
                                "context": "Neither science or scientists define or prove anything, nature does. Science exists as a method to discover how nature operates, and the method is for everyone.\n\nThe point of the scientific method is so that it can be repeated by anyone under the same circumstances and the same experiment will produce the same results because nature defines the result, not the scientists or science.\n\nScientists and science does not change its mind. What happens is that when humanity discovers new facets within a given study that the true nature of \"nature\" unfolds with more information. It's not a matter of mind changing, it's about exploration and discovery.",
                                "good": "1",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "rubiks6",
                                        "time": "10 September, 2021",
                                        "context": "Definitions are about language, i.e. communication and they are created by the users of language, which are people. “Nature” could not care less about man made definitions. \n\nYou are correct about the nature of “proof” but you are incorrect about the nature of “definitions.”\n\nAs for “scientists,” they are human beings who make mistakes, lie, are greedy, self-centered, and, yes, they change their minds. Scientists are subject to the same flaws as are all human beings.\n\nAs for “science” changing or not changing its mind, science doesn’t have a mind to change. “Science” is not a person. Only persons have minds. Science is a collection of knowledge seeking endeavors, data and measurements, hypotheses an conclusions (which can sometimes be false) and, yes, it is various methods for seeking to increase knowledge. Science is certainly not a person and does not have a mind.",
                                        "good": "1",
                                        "bad": "0",
                                        "replies": [
                                            {
                                                "user_name": "SuperDago_Surfer",
                                                "time": "10 September, 2021",
                                                "context": "That's too philosophical for me on the internet. That's some hanging out at the coffee shop talk with face-to-face humans convo. \n\n\"Debating\" on the internet is tedious, especially when there's no debate or argument here.\n\nI went to kindergarten, grade-school, middle-school, high-school, community college, and finally CalState University. Every life science course I took explained science to me the way I explained it to you. I'm going to rely on my California public education when it comes to looking at science, what it does, how it does it, and what it's for.\n\nIf you need to win, then, you win. Go for it, dude. 👍\n\nGood talk.",
                                                "good": "1",
                                                "bad": "0",
                                                "replies": [
                                                    {
                                                        "user_name": "rubiks6",
                                                        "time": "10 September, 2021",
                                                        "context": "All those wasted public funds and you still don’t know what science is. What a shame. Neither of us “wins.”  We both would have won if you had actually learned something. \n\nThere are many stupid smart people in the world. Are you one of them?",
                                                        "good": "1",
                                                        "bad": "0",
                                                        "replies": [
                                                            {
                                                                "user_name": "SuperDago_Surfer",
                                                                "time": "10 September, 2021",
                                                                "context": "No, really... You totally win the prize. Nice job.\n\n🏆🏅🏆🥇🏆",
                                                                "good": "1",
                                                                "bad": "0",
                                                                "replies": []
                                                            }
                                                        ]
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "⭐Dukie-UltraMAGA",
        "time": "9 September, 2021",
        "context": "Non-solid, gaseous planet.  I think I saw one of those this morning, orbiting Earth.  We call them clouds.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Fncisnumber1",
        "time": "9 September, 2021",
        "context": "First, no one said Pluto isn’t a planet, including Brown. However, since they discovered that there are hundreds of these small bodies orbiting the sun, including 3 so far, that are close to the size of Pluto, they decided to put them in a new category, and the “dwarf planet”, was “born”. However, like the “Name a star”, nonsense, you can call them, anything you like.  ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "BlueCloud",
        "time": "9 September, 2021",
        "context": "Is Ed Wood making a movie about it?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ohmitysmiter",
        "time": "9 September, 2021",
        "context": "I hope they ask for permission before they start probing Uranus….",
        "good": "28",
        "bad": "1",
        "replies": [
            {
                "user_name": "chessplayer",
                "time": "9 September, 2021",
                "context": "Good one!!",
                "good": "2",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "lamontcranstonthethird",
        "time": "9 September, 2021",
        "context": "\"Today I have instructed Starfleet to send the Enterprise on a search mission to find planet 9. I am confident that Mr. Spock can solve this problem. After all, he did survive death on the Genesis planet.\"\n\n--Joe Biden",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "skinflintstone",
        "time": "9 September, 2021",
        "context": "Why does he hate dwarfs?",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "EatenByAGrue",
        "time": "9 September, 2021",
        "context": "Maybe Kamala is on her way there to investigate",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mariokiefer",
        "time": "9 September, 2021",
        "context": "Pluto **identifies** as a planet, therefore . . .",
        "good": "17",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "cal2177",
        "time": "9 September, 2021",
        "context": "They will milk grant money until they are forced to admit, \"We can't find it. Sorry. No refunds.\"",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "lockupjoeandthehoe",
        "time": "9 September, 2021",
        "context": "Justice for Pluto! Planet Status' matter!",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "PurplePlanet",
        "time": "9 September, 2021",
        "context": "This guy wants to probe Uranus. Be very careful.",
        "good": "2",
        "bad": "0",
        "replies": [
            {
                "user_name": "thanksalatte",
                "time": "9 September, 2021",
                "context": "Oh, there it is lol!",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "rmr769911",
        "time": "9 September, 2021",
        "context": "Pluto is and will always be, can’t change it in my book.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "proamerican211",
        "time": "9 September, 2021",
        "context": "Don’t worry Pluto you’re still a planet. Screw this guy.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "guyfawkes1105",
        "time": "9 September, 2021",
        "context": "It would not surprise me if what the mass they deduce to exist is a singularity--the stairway to the next plane of existence.  If it was a planet, they would have seen it by now.",
        "good": "2",
        "bad": "0",
        "replies": [
            {
                "user_name": "dan42day",
                "time": "9 September, 2021",
                "context": "That would definitely be an interesting find. Six earth masses is pretty small for a black hole, but it is plausible.",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "marvinshort1953",
                "time": "9 September, 2021",
                "context": "I'm leaning more towards a plurality so I can both go.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "Leetware1",
        "time": "9 September, 2021",
        "context": "#Justice for Pluto. ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mtnman389",
        "time": "9 September, 2021",
        "context": "I just wish they would find s habitable planet.  Maybe, just maybe all of Hollywood and the left would keep their promises and move when Trump wins again.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "dan5047628",
                "time": "9 September, 2021",
                "context": "Liberals never keep heir promises",
                "good": "2",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "ferrousmike2",
        "time": "9 September, 2021",
        "context": "Clyde Tombaugh was robbed.",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "cal2177",
                "time": "9 September, 2021",
                "context": "Amen!",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "constructionist1776",
        "time": "9 September, 2021",
        "context": "So we can now identify exoplanets, light years away but we can’t find a hypothetical tenth planet (Pluto is still number 9) in our own solar system?  Is this guy for real?  Who signed off on his doctorate work, Isaac Asimov?",
        "good": "3",
        "bad": "0",
        "replies": [
            {
                "user_name": "why101",
                "time": "9 September, 2021",
                "context": "It's about grant $$$",
                "good": "1",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "constructionist1776",
                        "time": "9 September, 2021",
                        "context": "Of course it is and as Fauci has already proven those in charge of making grants don’t really care what you do with it as long as the paperwork is filled out correctly.  You can probably get a grant to study how much money is wasted on frivolous grants.",
                        "good": "2",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "bigchuck55",
        "time": "9 September, 2021",
        "context": "They could make a low budget sci-if movie from this story: Planet 9 From Outer Space. ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "annK56🇺🇸Trump",
        "time": "9 September, 2021",
        "context": "I learned Pluto was a planet in school  …….I still name Pluto as a planet…..of course that was back when they didn’t discriminate against planets ",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cal2177",
        "time": "9 September, 2021",
        "context": "I can't believe that with the technology we have today of detecting deep space objects, red shifting, and particles, they can't find planet 9 which is virtually on top of us compared to other objects that have been discovered. Something seems fishy to me.",
        "good": "11",
        "bad": "3",
        "replies": [
            {
                "user_name": "amtrakusa",
                "time": "9 September, 2021",
                "context": "It's just Heaven, they'll keep keep looking but it's on the spiritual plane so it will never be seen.  Just like dark matter/energy.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "cal2177",
                        "time": "9 September, 2021",
                        "context": "And string theory.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "lycopine",
                                "time": "9 September, 2021",
                                "context": "and the Higgs boson, and black holes..\n\nWait!! Those have been found!!!",
                                "good": "2",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "blahdeeblah",
        "time": "9 September, 2021",
        "context": "A giant ball of gas.  Like Washington DC",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "jp111",
                "time": "9 September, 2021",
                "context": "A black hole like Al Sharpton",
                "good": "3",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "DDay854",
        "time": "9 September, 2021",
        "context": "This object has been speculated to be either a gas giant planet or even a small black hole. If it were a small black hole, could our solar system have been a binary star system at some point in which the Sun’s companion went nova billions of years ago spreading all of the heavier elements we’ve found in our solar system and leaving the clack hole remnant?  And if this thing is a black hole, could it’s proximity and motion towards (and away) from earth while orbiting the sun be the cause of our perceived ‘speeding up of time’?  Wouldn’t we experience time dilation from its extreme gravity as it’s orbit brings it closer to Earth? And then time constriction as it moves away? Only a theory, but maybe it’s something to ponder?",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "why101",
        "time": "9 September, 2021",
        "context": "Me thinks he is lobbying for more grant money....which supplements his personal income....follow the $$$",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "lamontcranstonthethird",
        "time": "9 September, 2021",
        "context": "Biden: \"Today I have instructed the Enterprise to search out this planet, with Captain Kirk leading the mission I believe it will succeed.\"\n\nReporter: \"umm, Star Trek is a TV show sir.\"",
        "good": "3",
        "bad": "0",
        "replies": [
            {
                "error": "error"
            }
        ]
    },
    {
        "user_name": "privatejoker",
        "time": "9 September, 2021",
        "context": "Have Bernie take a look around.  He might find something right there in his neighborhood.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tiredofitallstill",
        "time": "9 September, 2021",
        "context": "Sounds like he watched the movie Doppelgänger (1969)",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rmaeker",
        "time": "9 September, 2021",
        "context": "How can you take something that is...turn it into something that isn't...call it something else...and then look for a replacement of the first thing...??\n\nDunno...",
        "good": "5",
        "bad": "0",
        "replies": [
            {
                "user_name": "bloviatethis",
                "time": "9 September, 2021",
                "context": "LOL... There is always among the activities often identified as characteristic of science are \nsystematic observation and experimentation, inductive and deductive \nreasoning, and the formation and testing of hypotheses and theories.  Something missing when politics gets involved...",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "why101",
                        "time": "9 September, 2021",
                        "context": "Politics are always a factor even amongst scientist...but that goes up exponentially when politicians start talking \"follow the science\"..with politicians it's never the science...rather votes, power and $$$",
                        "good": "2",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "bloviatethis",
                                "time": "9 September, 2021",
                                "context": "We are agreed then, there is no science when politics directs it...",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "cal2177",
        "time": "9 September, 2021",
        "context": "They can detect asteroids in deep space by measuring shadows and light bending but can't find an object 6 times the size of earth. Nope. Not buying it.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "79USMC",
        "time": "9 September, 2021",
        "context": "Pluto is a planet because it is a sphere. Asteroids and comets are not spheres. There is no middle ground between the three. When a mass becomes large enough to becomes a sphere, it is a planet. What did you accomplish by saying Pluto is not a planet. Do you feel better now, does it help you sleep better at night, or did you get rich off of it?",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "mrmacktitties",
        "time": "25 September, 2021",
        "context": "like a tree or bush, fence or wall, a gun or a cannon whats the size limit for a planet?  so is a 20 millimeter a gun or a cannon? and whats the sound of one hand clapping????????????",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "wyattg",
        "time": "17 September, 2021",
        "context": "Pluto is Planet 9.\nMichale Brown is a leftis liberal who could not accept the fact that an American discovered a planet.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "michaelperm",
        "time": "18 September, 2021",
        "context": "Are they still thinking it is retrograde orbit?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "SagittariusA*",
        "time": "10 September, 2021",
        "context": "Pluto is a planet!",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "alex50",
        "time": "14 September, 2021",
        "context": "Michael Brown must be a Democrat and Pluto a Trump fan!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "YaCan'tfixstupid203",
        "time": "12 September, 2021",
        "context": "If we can ship Pelosi and the rest of the radical democrats to this planet they could populate it with as much stupid they want and it wouldn't effect us here on earth",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "laurele",
        "time": "9 September, 2021",
        "context": "The appropriate term for a hypothetical but as yet undiscovered planet is “Planet X,” with “X” referring to the unknown, not the number 10. In August 2018, scientists at the Planetary Science Institute published a letter requesting this undiscovered planet be referred to by the neutral term “Planet X.” I urge the media to do just that when covering this issue.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mrmacktitties",
        "time": "25 September, 2021",
        "context": "is pringles really a potatoe chip or a rec onstututed potatoe product",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "mrmacktitties",
        "time": "3 October, 2021",
        "context": "bush and tree thing so how much mass do you need to be a planet when does a chunk of rock stop being a astoroid and start being a planet????????????????????????????????????????????",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "laurele",
        "time": "9 September, 2021",
        "context": "Mike Brown did NOT lead the demotion of Pluto in 2006. He actually had nothing to do with it. It was done by 4% of the International Astronomical Union (IAU), most of whom are not planetary scientists, and was opposed by an equal number of planetary scientists in a formal petition. The debate over Pluto's status and planet definition remains ongoing. Most planetary scientists prefer the geophysical definition over the IAU one. The geophysical definition does not require orbit clearing as a condition for planet status and includes dwarf planets as a subclass of planets. According to this definition, our solar system has a minimum of 13 planets and counting.\nMike Brown is not and never has been a member of the IAU. He did not take part in the vote. However, he is obsessed with the idea that he \"killed Pluto\" and uses that as a brand to pursue money and fame. He was one of a team of three who discovered the planet Eris in 2005. The other two co-discoverers, David Rabinowitz and Chad Trujillo, reject the IAU planet definition and demotion of Pluto. Rabinowitz even signed the 2006 petition of planetary scientists who opposed it.\n\nBrown deliberately refers to this hypothetical but undiscovered planet as \"Planet Nine\" to promote himself and his own agenda and pretend the debate over planet definition is over when that is far from the case. It is very sad to see a scientist mislead the public for his own personal gain.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "canadianbacon986",
        "time": "9 September, 2021",
        "context": "Nibiru",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "avast",
        "time": "12 September, 2021",
        "context": "I think they should have Jeff Bazos and Batgin go out there and look for it.  Maybe stop at Pluto for the night and get a good start in the morning.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "RedPlane",
        "time": "12 September, 2021",
        "context": "I got planet 9 right here in me pants!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dan5047628",
        "time": "9 September, 2021",
        "context": "Not sure why the Atheist haven't gotten up in arms over naming celestial bodies after Religious figures.  I'm guessing its because none of them were in the Bible.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Bullmstff",
        "time": "9 September, 2021",
        "context": "The Voyagers 1 and 2 was and is one of mankind's greatest achievements in scientific exploration... second to none.\nImagine plotting a course through our galaxy with a trajectory against the magnitude of space, distance, gravitational waves and the orbits of our planets...\nokay... and now states like Virginia want to eliminate accelerated mathematics  \nfrom the states high schools because black children are not able to compete in them, therefore those classes are RACIST !\nwell, just maybe take some of that money for RESEARCH and figure out a way to teach those children to solve mathematical equations...\nthen that money will be justified.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "righttheleft",
        "time": "14 September, 2021",
        "context": "Planet Pelosi, cold and gassy.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "randy4usa",
        "time": "11 September, 2021",
        "context": "If he thinks he can gain forgiveness for demoting Pluto, by offering us a substitute, he's wrong.",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "heinrichkroll418",
                "time": "15 September, 2021",
                "context": "You got that right.  There will be no absolution for this cold-hearted devil, in this life or the next",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "20see20",
        "time": "15 September, 2021",
        "context": "Just guessing, but we may find several \"hypothetical Republicans\" living there. In other words, a dead planet...",
        "good": "0",
        "bad": "1",
        "replies": [
            {
                "user_name": "scion890",
                "time": "20 September, 2021",
                "context": "and your parents decided NOT to terminate your pregnancy? such a shame . . .",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "dan5047628",
        "time": "9 September, 2021",
        "context": "Most of what we are told about space is Hypothetical",
        "good": "3",
        "bad": "3",
        "replies": [
            {
                "user_name": "planomike",
                "time": "9 September, 2021",
                "context": "That is wrong on so many fronts I don't know where to begin.  You should learn science and the scientific method so you don't make these comments.",
                "good": "1",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "HarryMybalzich",
                        "time": "10 September, 2021",
                        "context": "So you know what constitutes “most” to know that it’s wrong?",
                        "good": "1",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "planomike",
                                "time": "10 September, 2021",
                                "context": "Your comment is a typical talking point I see over and over.   Here's a question, is the composition of other planets, stars, galaxies hypothetical?  Another one, is the distance to other stars and galaxies hypothetical?  Are blackholes hypothetical?  If you answer yes to any of these, you are incorrect.",
                                "good": "1",
                                "bad": "1",
                                "replies": []
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "danew",
        "time": "9 September, 2021",
        "context": "Remember (probably not) how we learned the order of the planets in the 50's?   Some Men Vote Every Month Just Sitting Under Neptune's Porch.",
        "good": "0",
        "bad": "0",
        "replies": []
    }
]