[
    {
        "user_name": "B9dKitty",
        "time": "10 April, 2019",
        "context": "Lots of trustworthy, American \"hood-citizens\" cant wait for these.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "oncewascool",
        "time": "10 April, 2019",
        "context": "What are they delivering??? Just a picture of the search engine?",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "cms75",
        "time": "10 April, 2019",
        "context": "I wonder how many will be shot out of the sky?  If you don't think people will make sport out of destroying these things you would be a true clown.",
        "good": "6",
        "bad": "0",
        "replies": [
            {
                "user_name": "Polian",
                "time": "10 April, 2019",
                "context": "In Canberra? Probably not many at all.",
                "good": "3",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "RichLando",
                "time": "10 April, 2019",
                "context": "Since it would be a Federal crime I think not many after the first few.",
                "good": "5",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "foxtex",
        "time": "10 April, 2019",
        "context": "I was raised in a house with no A/C, that had a well for water.\nFrom that time, I have watched tech advance until.. shockingly, one day I was able to purchase, and own my very own Personal Computer. An incredible thing.\nThen came \"Satellite Phones\", that you carried in a bag, they were rather large, and very cumbersome.\n\nNow my Smart phone, is small, light weight, and has more processing power than my first computer, far more.\nToday I read of drones that can deliver items you order, over the internet, using a mobile device.\nI love technology, I just hope I live long enough to see the next few amazing things that are coming in the future.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "MtbMan",
        "time": "10 April, 2019",
        "context": "Craigs mom's Bush.....    This is how it begins.  That poor woman.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "BlueToast",
        "time": "10 April, 2019",
        "context": "My neighbor kept flying his drone over my house at night, my scoped pellet rifle ended that little game.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "governmentisafailure",
        "time": "10 April, 2019",
        "context": "I'm wondering whether drone delivery will be much more expensive that a normal delivery. I'm not sure how much these commercial delivery drones cost, but it has to be much more than the small drone I can buy. Buying the drone. Training people to keep it flying. Recharging the drone. Drone down time for repairs or maintenance. All of that times thousands of drones in a drone delivery squadron. Somehow keeping them all flying 11 hours a day? I think this type of service is going to be niche and much more expensive than waiting one or two days for your Amazon Prime delivery.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "btrahan66",
        "time": "10 April, 2019",
        "context": "It will be many years before \"everyone\" can get a service like this.  For now it will only be available in more affluent communities where they are less likely to be vandalized.  This is incredibly cool though, and if humans in general were more trustworthy, it could become the norm.",
        "good": "2",
        "bad": "0",
        "replies": [
            {
                "error": "error"
            }
        ]
    },
    {
        "error": "error"
    },
    {
        "user_name": "texgeekdude",
        "time": "10 April, 2019",
        "context": "I'm surprised that Australia, with its excessive regulations, would be the first country to get this service.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Pencil0007",
        "time": "20 April, 2019",
        "context": "When they figure out manned drones are easier to protect and have a much greater carry capacity and don't reduce jobs those mini drones will be quickly replaced for shipping items... as will cars. Thats not to say there isnt a good use for those tiny drones for some things... but I'm counting on the bigger things becoming the prefered method of delivery... the ones you can actually fly inside. There will come a point where we will have to redefine the word \"drone\".",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "gammarider",
        "time": "10 April, 2019",
        "context": "And what do they do after multiple reports of stolen packages swiped from front yards?",
        "good": "2",
        "bad": "0",
        "replies": [
            {
                "user_name": "Unbiased0001",
                "time": "10 April, 2019",
                "context": "Exactly.  Listen for the buzz, hone in, free products all day long.  The thieves are drooling already.",
                "good": "2",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "Hippopotomonstrosesquippedaliophobia",
                "time": "11 April, 2019",
                "context": "The packages are place on the roof.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "error": "error"
    },
    {
        "user_name": "StupidPeople101",
        "time": "12 April, 2019",
        "context": "I dare you to fly over my property.  Go ahead, Make My Day.",
        "good": "6",
        "bad": "0",
        "replies": [
            {
                "user_name": "OliveBone",
                "time": "15 April, 2019",
                "context": "You do not own or control the airspace over your property.\nShooting down a delivery drone would knock a big hole in your wallet.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "StupidPeople101",
                        "time": "15 April, 2019",
                        "context": "Way wrong answer.  Better look it up.",
                        "good": "1",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "dp2010",
        "time": "12 April, 2019",
        "context": "It's an April Fool's joke, just late with the delivery.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "OrangeWrench",
        "time": "11 April, 2019",
        "context": "I think having your own attack drone is one answer.  No guns, no fire, just a liberal loony playing with his new drone.  I'd be so sorry, so sorry.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ameriborn",
        "time": "12 April, 2019",
        "context": "Boycott all drove deliveries. People need good jobs.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "bemuuused",
                "time": "18 April, 2019",
                "context": "Agreed. I don't even use the self-checkout lanes. Puts people out of work.",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "bemuuused",
        "time": "18 April, 2019",
        "context": "I can't wait to shoot down my first Amazon drone.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "pantoss",
        "time": "11 April, 2019",
        "context": "Horrible idea, soon looking up a beautiful blue sky will be something we refer to doing in the \"good ole days\". Enjoy the view while you can.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "GreenFlask",
        "time": "10 April, 2019",
        "context": "We couldn’t get Bin Laden with a drone.  What makes you think I’m going to trust one to deliver my new iPhone.",
        "good": "2",
        "bad": "0",
        "replies": [
            {
                "user_name": "notlib1",
                "time": "11 April, 2019",
                "context": "Cell phones require a signature...",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "Unbiased0001",
        "time": "10 April, 2019",
        "context": "Target practice?  Especially when they fly over another persons personal residence...  (It has to have a camera and be remotely operated so there are a whole bunch of privacy issues that will surely be violated.)",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "stevenscott63",
        "time": "11 April, 2019",
        "context": "I don't see this working out well. There will be too many issues with this type of delivery service.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Momi104",
        "time": "11 April, 2019",
        "context": "wait till the seagulls hear about this one.",
        "good": "6",
        "bad": "0",
        "replies": [
            {
                "user_name": "bemuuused",
                "time": "18 April, 2019",
                "context": "All the hawks in my neighborhood are going to have a strong opinion about these drones.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "jobu2u",
        "time": "13 April, 2019",
        "context": "We in Arizona call that \"skeet with prizes\".",
        "good": "13",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bumpskier58",
        "time": "21 April, 2019",
        "context": "Here's your new set of wine glasses delivered right to your front door.......\n\n\nFrom 50 feet up.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Pencil0007",
        "time": "20 April, 2019",
        "context": "On the other hand.... very large remote controlled shipping drones might just work.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Unbiased0001",
        "time": "10 April, 2019",
        "context": "7AM to 8PM.  Unbelievable.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "don50oh",
        "time": "14 April, 2019",
        "context": "Hey ! Where those wing we ordered coming from ? \" Outback\"",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "legrandfromage",
        "time": "10 April, 2019",
        "context": "They busted a local kid in my city for doing dope delivers by drone. He used a money transfer app then made the drop. It apparently worked for a while until drone crashed in to a yard off a DEA home owner.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jmichaelj",
        "time": "13 April, 2019",
        "context": "When that $5 cup of coffee just won't cut it any longer and you just gotta have that $15 cup, Google to the rescue. . .",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "john1038154",
        "time": "11 April, 2019",
        "context": "They're gonna lose a lot of drones.  Free stuff if you can clip that flying toy, guys.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Independentvoter1221",
        "time": "10 April, 2019",
        "context": "open season....lol this will be costly adventure..",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "notlatereither",
        "time": "12 April, 2019",
        "context": "The word of the day boys & girls is \"highjack\" … Can you say that?",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "patrioticvideo",
        "time": "11 April, 2019",
        "context": "Just turn on any cheap radio jammer and, bam, free stuff!",
        "good": "5",
        "bad": "0",
        "replies": [
            {
                "user_name": "gt46l",
                "time": "11 April, 2019",
                "context": "Likely they would fly preprogrammed journeys based on gps coordinates.  If gps (or any radio comms) weren't available, it would fall back to inertial guidance, and probably just return to base on its own.  The only radio piece would be communicating to home base to provide status and location, but not to receive realtime flying directions for a delivery, of which it would only have one per flight.  You could laser it though, and kill the flight computer or props.",
                "good": "4",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "Hippopotomonstrosesquippedaliophobia",
        "time": "10 April, 2019",
        "context": "Have fun with that with all the restricted airspace in the US. Even if you fly below 300 feet.",
        "good": "7",
        "bad": "0",
        "replies": [
            {
                "user_name": "notlib1",
                "time": "11 April, 2019",
                "context": "My drone has a database of regulated airspace that gets updated regularly that allows the flight plan to work around them automatically.  \nThe drone isn't the problem here, it's dropping packages with a string in the front yard that seems to be a issue.\nIn the US, drones are considered aircraft, anyone wanting to take a potshot, would be met by the FBI since they have GPS accordance of last known location.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "EverettRobinson",
                        "time": "11 April, 2019",
                        "context": "I wouldn't be so sure. The GPS coordinates may give the location of the drone, but they won't give the coordinates of the shooter. In a populated area, that could be quite a number of people. Making suspects out of everyone is never in the interests of law enforcement.",
                        "good": "6",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "pantoss",
                                "time": "11 April, 2019",
                                "context": "These drones will have HD cameras and GPS, take a pot shot and your face will be on the 6pm news.",
                                "good": "3",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "EverettRobinson",
                                        "time": "12 April, 2019",
                                        "context": "A guy taking a potshot at a drone would fill maybe 20 pixels of a frame, which isn't enough to make an identification. (That's assuming the camera was pointed in the correct direction.)\n\nWhat would be on the 6 p.m. news is a blurry fuzzball.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": [
                                            {
                                                "user_name": "pantoss",
                                                "time": "12 April, 2019",
                                                "context": "you're assuming zero improvement in camera tech... not likely",
                                                "good": "0",
                                                "bad": "0",
                                                "replies": [
                                                    {
                                                        "user_name": "EverettRobinson",
                                                        "time": "24 April, 2019",
                                                        "context": "Are you anticipating HDx10 cameras anytime soon? The only ones with cameras like that is the military, not Google.",
                                                        "good": "0",
                                                        "bad": "0",
                                                        "replies": []
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "4mcdago",
                "time": "11 April, 2019",
                "context": "That is the part that concerns me.  How are commercial UA pilots supposed to make a living if that happens? I guess becoming a drone pilot for amazon is the answer.  No way not happening.  Airspace is a serious thing that must be what is holding them up from doing this, the technology it there.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "Hippopotomonstrosesquippedaliophobia",
                        "time": "11 April, 2019",
                        "context": "One of the big problems with drones is that you can lose control of it for a number of reasons.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "Icgr8r",
        "time": "21 April, 2019",
        "context": "I have enough google trying penetrate my life and dont need it overhead as well.  They will add heat sensors, listening devices and cameras to detect everything about each delivery because that is what google does.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "azulthedefiler",
        "time": "21 April, 2019",
        "context": "People are gonna need actual skills soon!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "RobertWalker",
        "time": "6 May, 2019",
        "context": "Think though, what else will these drone be doing as the deliver packages?",
        "good": "0",
        "bad": "0",
        "replies": []
    }
]