[
    {
        "user_name": "dan5047628",
        "time": "20 January, 2022",
        "context": "It isn't the decision to test this rock for signs of life that made me Laugh, it was their belief that it came from Mars. Ha Ha ha ha ha ha ha ha ha ha",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "geneighty",
        "time": "15 January, 2022",
        "context": "Maybe, Maybe not.  I suspect that remnants of very primitive life will ultimately be found, not only on Mars but also on the moon.  But they won't be indigenous but from debris of asteroid collisions with primitive earth.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "yeppers516",
        "time": "15 January, 2022",
        "context": "This is just as scientific as spin the bottle.",
        "good": "3",
        "bad": "4",
        "replies": [
            {
                "user_name": "dan5047628",
                "time": "20 January, 2022",
                "context": "well said",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "sciencerocks",
        "time": "15 January, 2022",
        "context": "Gotta love the dynamics of science as we dig into the finer points of nature. It is a fascinating universe we live in.",
        "good": "10",
        "bad": "0",
        "replies": [
            {
                "user_name": "dan5047628",
                "time": "20 January, 2022",
                "context": "??? They claim that they have a rock form mars, its laughable.",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "MeOneGoodEye🏴‍☠️",
        "time": "14 January, 2022",
        "context": "Dinosaurs really got wiped out by a rock.\nThey shoulda picked paper..",
        "good": "6",
        "bad": "0",
        "replies": [
            {
                "user_name": "sciencerocks",
                "time": "15 January, 2022",
                "context": "For once I won't take the scissors to one of your comments.",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "sudynym",
        "time": "18 January, 2022",
        "context": "Darn.  I was hopin that penguins relocated here from Mars.  That would explain their walk.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "rubiks6",
        "time": "15 January, 2022",
        "context": "Once again, I must remind some folks …\n\nAbiogenesis doesn’t happen.",
        "good": "1",
        "bad": "9",
        "replies": [
            {
                "user_name": "letsgetrel",
                "time": "15 January, 2022",
                "context": "And yet here we are, living proof that it does.",
                "good": "8",
                "bad": "3",
                "replies": [
                    {
                        "user_name": "rubiks6",
                        "time": "15 January, 2022",
                        "context": "You are mistaken. We are not here by abiogenesis. \n\nWe are a demonstration of the Living God. Life only comes from life.",
                        "good": "1",
                        "bad": "6",
                        "replies": [
                            {
                                "user_name": "letsgetrel",
                                "time": "15 January, 2022",
                                "context": "By definition, God is a matter of faith. God is supernatural and not subject to scientific evidence. Even with God, life still had to come from non-life as the planet was devoid of life when it formed.",
                                "good": "5",
                                "bad": "1",
                                "replies": [
                                    {
                                        "user_name": "rubiks6",
                                        "time": "15 January, 2022",
                                        "context": "Who told you God is not subject to scientific analysis? Again, you are mistaken. Again, you create a false dichotomy between science and faith. \n\nLife only comes from life. The first life on Earth came from God, who has life and is life. When God created the lifeless Earth, He did not cease to exist. He imparted His life to the creatures He created. Life only comes from life.",
                                        "good": "0",
                                        "bad": "2",
                                        "replies": [
                                            {
                                                "user_name": "beadgBass",
                                                "time": "15 January, 2022",
                                                "context": "So what life did God come from?",
                                                "good": "1",
                                                "bad": "0",
                                                "replies": [
                                                    {
                                                        "user_name": "rubiks6",
                                                        "time": "15 January, 2022",
                                                        "context": "God is eternal. He came from Himself.",
                                                        "good": "0",
                                                        "bad": "1",
                                                        "replies": [
                                                            {
                                                                "user_name": "beadgBass",
                                                                "time": "15 January, 2022",
                                                                "context": "How convenient for your argument.",
                                                                "good": "3",
                                                                "bad": "1",
                                                                "replies": []
                                                            },
                                                            {
                                                                "user_name": "nepawoods",
                                                                "time": "15 January, 2022",
                                                                "context": "What does it mean for something to come from itself?",
                                                                "good": "1",
                                                                "bad": "0",
                                                                "replies": [
                                                                    {
                                                                        "user_name": "rubiks6",
                                                                        "time": "16 January, 2022",
                                                                        "context": "\"What does it mean for something to come from itself?\"\n\nWhich words didn't you understand? I can state it no more plainly than I have. I did not come from myself. Therefore I cannot fully wrap my head around it. God simply exists in an eternal state. Keep in mind that the concept of \"eternal\" does not mesh well with concepts of time, similar to the idea of infinite and the idea of \"number.\"\n\n\"Come from\" is a poor choice of words but I have no better words to convey the idea. Some ideas are hard to express with limited human languages. \"Eternal\" is one of those ideas.",
                                                                        "good": "0",
                                                                        "bad": "2",
                                                                        "replies": [
                                                                            {
                                                                                "user_name": "beadgBass",
                                                                                "time": "16 January, 2022",
                                                                                "context": "\"Keep in \nmind that the concept of \"eternal\" does not mesh well with concepts of \ntime, similar to the idea of infinite and the idea of \"number.\"\nOkay, I'm good with that. So why can't you comprehend that the word \"day\" in English mistranslations of the original text, does not mean a 24 hour day?",
                                                                                "good": "0",
                                                                                "bad": "0",
                                                                                "replies": [
                                                                                    {
                                                                                        "user_name": "rubiks6",
                                                                                        "time": "16 January, 2022",
                                                                                        "context": "There is nothing in the text of Genesis 1 to indicate that each day made up of an evening and morning and counted with an ordinal number is anything other than a 24-hour day. You give me some biblical reasoning that days in Genesis 1 are anything other than 24-hour days and I will consider it. Otherwise, I will take God's Word at its most obvious meaning.",
                                                                                        "good": "0",
                                                                                        "bad": "1",
                                                                                        "replies": []
                                                                                    }
                                                                                ]
                                                                            }
                                                                        ]
                                                                    }
                                                                ]
                                                            }
                                                        ]
                                                    },
                                                    {
                                                        "user_name": "geneighty",
                                                        "time": "15 January, 2022",
                                                        "context": "God is infinite, no beginning and no end. He is spirit, thus no material parts. He is pure truth, love and knowledge.",
                                                        "good": "0",
                                                        "bad": "0",
                                                        "replies": [
                                                            {
                                                                "user_name": "beadgBass",
                                                                "time": "15 January, 2022",
                                                                "context": "I have no problem with that. I have a HUGE problem with people who contort that into an argument against abiogenesis.",
                                                                "good": "0",
                                                                "bad": "0",
                                                                "replies": []
                                                            }
                                                        ]
                                                    }
                                                ]
                                            },
                                            {
                                                "user_name": "letsgetrel",
                                                "time": "15 January, 2022",
                                                "context": "Who told me? What kind of ignorant question is that?\nScience is the study of the natural universe. God is supernatural, and thus by definition is outside of the realm of science. Science does not have the tools to probe and dissect God, and we shouldn't even want it to. There is nothing false about that at all.",
                                                "good": "1",
                                                "bad": "0",
                                                "replies": [
                                                    {
                                                        "user_name": "rubiks6",
                                                        "time": "16 January, 2022",
                                                        "context": "\"God is supernatural ...\"\n\nEverything is supernatural. God created everything and God sustains everything. That makes everything supernatural.\n\nYour terms \"natural\" and \"supernatural\" are artificial terms without well-defined meanings. Are you a materialist?",
                                                        "good": "0",
                                                        "bad": "2",
                                                        "replies": [
                                                            {
                                                                "user_name": "letsgetrel",
                                                                "time": "16 January, 2022",
                                                                "context": "Natural and supernatural have very clear meanings.\nThat you blur them shows the very sad state of your thinking.",
                                                                "good": "1",
                                                                "bad": "0",
                                                                "replies": []
                                                            }
                                                        ]
                                                    }
                                                ]
                                            },
                                            {
                                                "user_name": "nepawoods",
                                                "time": "15 January, 2022",
                                                "context": "Are we talking about two completely different things when we use the word \"life\" here?\n\nBiological life is made of matter, behaves according to ordinary laws of physics, reproduces, dies, etc. \n\nWhen you say God has life, what sort of \"life\" are you talking about?",
                                                "good": "1",
                                                "bad": "0",
                                                "replies": [
                                                    {
                                                        "user_name": "rubiks6",
                                                        "time": "15 January, 2022",
                                                        "context": "What is “life”? Well I think I’m in good company when I say I do not have a clear, concrete definition. When an animal lies dead on the ground, what distinguishes it from the living one standing beside it? If the animal died just moments ago, even many of its cells are still functioning but it is dead. What has changed? Why isn’t the T-bone steak in my refrigerator alive?  It has all the biochemicals of life including DNA. Why is it not alive. If you can provide coherent answers to these questions, I too will provide you with an answer to your question.\n\nBiological life requires purposeful information. That kind of information is not material in nature.",
                                                        "good": "0",
                                                        "bad": "2",
                                                        "replies": [
                                                            {
                                                                "user_name": "beadgBass",
                                                                "time": "15 January, 2022",
                                                                "context": "\"Biological life requires purposeful information.\"\n\nNo, it does not.",
                                                                "good": "0",
                                                                "bad": "0",
                                                                "replies": [
                                                                    {
                                                                        "user_name": "rubiks6",
                                                                        "time": "16 January, 2022",
                                                                        "context": "---------------------------------------\n\"Biological life requires purposeful information.\"\n\nNo, it does not.\n---------------------------------------\n\nThere is no biological life form known that doesn't have purposeful information encoded in DNA and/or RNA sequences.\n\nHow do you think you formed? Arms, legs, eyes, ears, heart, liver, etc. all formed in your mother's womb based on instructions (i.e. purposeful information) contained in your DNA. Are you an elementary school child and do not know these things? Did an elephant ever give birth to a turtle? Did a jellyfish ever become a seahorse? These creatures are different from one another and reproduce after their kind based on the information in their DNA. Didn't you know?",
                                                                        "good": "0",
                                                                        "bad": "0",
                                                                        "replies": [
                                                                            {
                                                                                "user_name": "beadgBass",
                                                                                "time": "16 January, 2022",
                                                                                "context": "You are WAY behind.\nDNA is not information. That is a much used metaphor, but DNA is neither information nor purposeful. You and atheist Richard Dawkins would get along well with you selfish-gene concept.\n\n\"Did an elephant ever give birth to a turtle?\" Comments like that just show that you do not take biology the least bit seriously.",
                                                                                "good": "1",
                                                                                "bad": "0",
                                                                                "replies": [
                                                                                    {
                                                                                        "user_name": "rubiks6",
                                                                                        "time": "16 January, 2022",
                                                                                        "context": "\"DNA is not information.\"\n\nDo you have all your fingers and toes in the right place? Can you tell me how they got there? Do you think all your cells just got lucky and ended up where they are?",
                                                                                        "good": "0",
                                                                                        "bad": "1",
                                                                                        "replies": [
                                                                                            {
                                                                                                "user_name": "beadgBass",
                                                                                                "time": "16 January, 2022",
                                                                                                "context": "Highly evolved chemical reactions honed by natural selection.\nThat is how they got there.",
                                                                                                "good": "1",
                                                                                                "bad": "0",
                                                                                                "replies": [
                                                                                                    {
                                                                                                        "user_name": "rubiks6",
                                                                                                        "time": "16 January, 2022",
                                                                                                        "context": "How were those chemical reactions controlled?",
                                                                                                        "good": "0",
                                                                                                        "bad": "0",
                                                                                                        "replies": [
                                                                                                            {
                                                                                                                "user_name": "beadgBass",
                                                                                                                "time": "16 January, 2022",
                                                                                                                "context": "Largely self-control using principles of physics.",
                                                                                                                "good": "0",
                                                                                                                "bad": "0",
                                                                                                                "replies": [
                                                                                                                    {
                                                                                                                        "user_name": "rubiks6",
                                                                                                                        "time": "16 January, 2022",
                                                                                                                        "context": "One after another, your responses are so vague as to be close to meaningless. \n\nThe DNA in living creatures contains language more sophisticated than any computer language. Look up “DNA” in Wikipedia. I’m finished with this line of discussion.",
                                                                                                                        "good": "0",
                                                                                                                        "bad": "0",
                                                                                                                        "replies": [
                                                                                                                            {
                                                                                                                                "user_name": "beadgBass",
                                                                                                                                "time": "16 January, 2022",
                                                                                                                                "context": "The responses are also correct.\nI don't need to look up DNA in Wikipedia. My PhD is in zoology so I am quite familiar with DNA already, and Wikipedia is so often wrong.",
                                                                                                                                "good": "0",
                                                                                                                                "bad": "0",
                                                                                                                                "replies": [
                                                                                                                                    {
                                                                                                                                        "user_name": "rubiks6",
                                                                                                                                        "time": "17 January, 2022",
                                                                                                                                        "context": "“My PhD is in zoology …”\n\nAnd now I know you are a liar — unless you got your PhD over 100 years ago. The readers here know that DNA is a code, a language. A person with a PhD in zoology would not be so ignorant about DNA. Now the other readers also know that you are a liar. \n\nI will not waste my time having conversations with you any more, liar.",
                                                                                                                                        "good": "0",
                                                                                                                                        "bad": "0",
                                                                                                                                        "replies": [
                                                                                                                                            {
                                                                                                                                                "user_name": "beadgBass",
                                                                                                                                                "time": "17 January, 2022",
                                                                                                                                                "context": "You are the liar. You are the one who said you were finished with this discussion. Instead, you went on to make yourself look more foolish.\nDNA was not well known 100 years ago, after Miescher's discovery of it some decades earlier. But 100 years ago was the beginning of the Modern Evolutionary Synthesis  when Mendelian genetics were coupled with the Darwin/Wallace hypothesis, now theory, of evolution through natural selection.\nDNA came to prominence in the early 1950s with the discovery of the the double helix structure by Rosalind Franklin, as published by Watson and Crick.\nYet to this day, in information theory, DNA is still not technically information, and in language theory it is still not a language.\nSo I have been totally honest with you all along.",
                                                                                                                                                "good": "0",
                                                                                                                                                "bad": "0",
                                                                                                                                                "replies": []
                                                                                                                                            }
                                                                                                                                        ]
                                                                                                                                    }
                                                                                                                                ]
                                                                                                                            }
                                                                                                                        ]
                                                                                                                    }
                                                                                                                ]
                                                                                                            }
                                                                                                        ]
                                                                                                    }
                                                                                                ]
                                                                                            }
                                                                                        ]
                                                                                    }
                                                                                ]
                                                                            }
                                                                        ]
                                                                    }
                                                                ]
                                                            }
                                                        ]
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            },
                            {
                                "user_name": "grannyclampett",
                                "time": "15 January, 2022",
                                "context": "ROTMFFLMMFAO !!!",
                                "good": "1",
                                "bad": "1",
                                "replies": [
                                    {
                                        "user_name": "sciencerocks",
                                        "time": "15 January, 2022",
                                        "context": "Give him a break. He is a confused old man, but very devoted to his faith and unconventional beliefs, and I kinda like him for that.",
                                        "good": "1",
                                        "bad": "0",
                                        "replies": [
                                            {
                                                "user_name": "nepawoods",
                                                "time": "15 January, 2022",
                                                "context": "But he doesn't argue honestly.  He deflects and denies what he knows to be logical and rational when he's afraid it's poking holes in his fairy tale.",
                                                "good": "3",
                                                "bad": "0",
                                                "replies": [
                                                    {
                                                        "user_name": "sciencerocks",
                                                        "time": "15 January, 2022",
                                                        "context": "My point is that he does not know how illogical and dishonest he is. But making fun of his delusions does not help the broader arguments for rationality.",
                                                        "good": "0",
                                                        "bad": "0",
                                                        "replies": []
                                                    }
                                                ]
                                            },
                                            {
                                                "user_name": "rubiks6",
                                                "time": "15 January, 2022",
                                                "context": "Cheers, SR. LTNS\n\nWhat you call confusion is simply the Word of Gᴏᴅ.",
                                                "good": "0",
                                                "bad": "2",
                                                "replies": [
                                                    {
                                                        "user_name": "sciencerocks",
                                                        "time": "15 January, 2022",
                                                        "context": "No, it is your gross distortion of the Word of God.\nYou stick to your narrow misinterpretation of God's word in one Book of the Holy Bible, but you completely ignore the glorious words of God written in sedimentary layers and all of nature.\nI find that sad.",
                                                        "good": "1",
                                                        "bad": "0",
                                                        "replies": [
                                                            {
                                                                "user_name": "rubiks6",
                                                                "time": "16 January, 2022",
                                                                "context": "The \"sedimentary layers\" don't contradict the Word of God in any way whatsoever. You misinterpret the sedimentary layers just as you misinterpret the written Word of God, even though they both speak plainly.\n\nPlease look up the word \"sedimentary.\" There was, I think, a flood described in the Bible. By the very terms you choose the truth is revealed to you but you cannot see past Satan's delusion. How do you think millions of animal and plant fossils were formed? They were buried rapidly. Is that so hard to figure out? Dude, the \"sedimentary layers\" totally support the biblical narrative. The \"fossil record\" totally supports the biblical narrative. \n\nTo you, God's wisdom is foolishness. People like you are described in many places in the Bible. You think you're smarter than God.\n\n----------\nThen the Lord answered Job from the whirlwind and said,\n“Who is this who darkens the divine plan\nBy words without knowledge?\nNow tighten the belt on your waist like a man,\nAnd I shall ask you, and you inform Me!\nWhere were you when I laid the foundation of the earth?\nTell Me, if you have understanding,\n– Job 38.1 - 5 (NASB)\n----------",
                                                                "good": "0",
                                                                "bad": "1",
                                                                "replies": [
                                                                    {
                                                                        "user_name": "sciencerocks",
                                                                        "time": "16 January, 2022",
                                                                        "context": "I have literally led excavations through thousands of sedimentary layers. You are the last person in the world who should be telling me to look up the word \"sedimentary.\"",
                                                                        "good": "1",
                                                                        "bad": "0",
                                                                        "replies": [
                                                                            {
                                                                                "user_name": "rubiks6",
                                                                                "time": "16 January, 2022",
                                                                                "context": "sed·i·men·ta·ry\n\nadjective\n\nrelating to sediment.\n\nGEOLOGY(of rock) that has formed from sediment deposited by water or air.\n—————\n\nPerhaps the biblical flood? Hmmmm?\n\nWhat’s really ridiculous is that you reject the Word of God but you have no good reason. The geological, archeological, and biological evidence all support the biblical narrative. Your concern is how believing God would effect your career, your relationships. You value the respect of men more than you value the respect of God. You are a Pharisee. You appear so religious and you are such a pillar of the community but inside you are dead. \n\nA person who has been enlivened by the Holy Spirit does not reject the Word authored by the Holy Spirit. The saddest part is that you seem to truly believe the lies you tell yourself.",
                                                                                "good": "0",
                                                                                "bad": "2",
                                                                                "replies": [
                                                                                    {
                                                                                        "user_name": "sciencerocks",
                                                                                        "time": "16 January, 2022",
                                                                                        "context": "\"Perhaps the biblical flood? Hmmmm?\"\nNope. Absolutely not. There would not be neatly stratified layers in a massive flood.\n\nOtherwise, you are unbearably conceited and egotistical to write about me that way. Not to mention totally wrong. You do not know me.\n\n\"Your concern is how believing God would effect your career, your relationships.\" I DO believe God, and it hasn't affected my career or my relationships in any ways other than positively.\nGod has revealed to me and others the details of our evolutionary path, far beyond what we can glean from an allegory in the Holy Bible.\n\nI thank Him for that divine revelation every single day.",
                                                                                        "good": "1",
                                                                                        "bad": "0",
                                                                                        "replies": []
                                                                                    }
                                                                                ]
                                                                            }
                                                                        ]
                                                                    }
                                                                ]
                                                            }
                                                        ]
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            },
                            {
                                "user_name": "skepticny",
                                "time": "16 January, 2022",
                                "context": "//We are not here by abiogenesis.//\nAt one time the earth was without life. Agreed?\nThen at one time it has life? Agreed?\nABIOGENESIS HAPPENED\nCreationists think ABIOGENESIS happened by magic without presenting one shred of verifiable evidence. On the other hand there is plenty of EMPIRICAL EVIDENCE of NATURAL processes that can lead to promodial life or protocells.",
                                "good": "2",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "rubiks6",
                                        "time": "16 January, 2022",
                                        "context": "No, abiogenesis did not happen. Life came from life. Life came from the living God.\n\nThere is no evidence that life can develop from non-living materials without the input of something already living. Origin of life researchers have made no real progress, though they have put forth a great many conjectures. The more researchers discover about how life works, the more apparent the intractability of the problem of origin of life becomes. Origin of life research is fraught with “chicken or egg” dilemmas. The answer is, the chicken. God created it.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": [
                                            {
                                                "user_name": "quietsmith",
                                                "time": "17 January, 2022",
                                                "context": "\"NUH UHHHH! God dun it!\"",
                                                "good": "0",
                                                "bad": "0",
                                                "replies": []
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "user_name": "rubiks6",
                        "time": "15 January, 2022",
                        "context": "Once again, your wrong premises lead you to a wrong conclusion. Was it not Charles Lyell who said the processes we observe today inform us about the past? What you observe today is that life only comes from life. You can show no counter example. \n\nYour use of the word “proof” is very unscientific.",
                        "good": "3",
                        "bad": "8",
                        "replies": [
                            {
                                "user_name": "letsgetrel",
                                "time": "15 January, 2022",
                                "context": "There is a lot of debate in scientific circles these days on the use of the word \"proof,\" but that is another matter for scientists, not creationists.\n\nCharles Lyell was indeed a proponent of uniformitarianism. Although he remained a devoutly Christian man, he led to the move to separate science from faith. That was the end of 'natural theology' in science. Why? He was a historical geologist looking for evidence of the Noachian flood. What he and his colleagues found was completely contrary to the Book of Genesis. It suited their science to be objective, rather than try to shoehorn the natural world into biblical accounts.",
                                "good": "5",
                                "bad": "1",
                                "replies": [
                                    {
                                        "user_name": "rubiks6",
                                        "time": "15 January, 2022",
                                        "context": "You create a false dichotomy when you put science against faith. As a biblical creationist, I have no difficulty interpreting geologic and archeological evidence in the light of biblical revelation. \n\nYou seem to confuse “evidence” with “worldview.”",
                                        "good": "3",
                                        "bad": "4",
                                        "replies": [
                                            {
                                                "user_name": "letsgetrel",
                                                "time": "15 January, 2022",
                                                "context": "I never put science against faith. I think they are complementary views.\n\n\"I have no difficulty interpreting geologic and archeological evidence in the light of biblical revelation.\"\nWell, actually you do. I'm a geologist so I know that there is zero evidence for a global flood in historical times. That is what Lyell found out in the 1830s. You are bit behind on your geological studies.\nAs for archaeological evidence, how do you interpret Acheulian stone tools such as the Acheulian hand axes?",
                                                "good": "1",
                                                "bad": "0",
                                                "replies": []
                                            }
                                        ]
                                    },
                                    {
                                        "user_name": "rubiks6",
                                        "time": "15 January, 2022",
                                        "context": "By the way — you still, still, STILL cannot seem to distinguish between “science” and “scientists.” How long will you remain simple-minded? Until you develop some basic thinking skills, your arguments remain bankrupt.",
                                        "good": "2",
                                        "bad": "4",
                                        "replies": [
                                            {
                                                "user_name": "letsgetrel",
                                                "time": "15 January, 2022",
                                                "context": "Science is the process of investigating the natural world. Yes, it is a colloquialism to say \"science has discovered\" this or that, but most people have the basic thinking skills to know what that means. You apparently do not.\nHere is a distinction between \"science\" and \"scientists\": God is outside the realm of science, but not outside the comprehension of scientists. There are many scientists, including Charles Lyell and myself, who are strong people of faith -- but they didn't use science to find that faith.",
                                                "good": "4",
                                                "bad": "0",
                                                "replies": [
                                                    {
                                                        "user_name": "nepawoods",
                                                        "time": "15 January, 2022",
                                                        "context": "Just a short while ago someone mentioned the principle of charity, which states that if you're arguing with someone and they make a statement that can be interpreted in more than one way, you interpret it in the way that makes the most sense.\n\nrubiks6 always does the opposite.  Say \"science has discovered\", and he assumes the worst, nitpicking over a common figure of speech, just so he can call you \"simple-minded\".",
                                                        "good": "0",
                                                        "bad": "0",
                                                        "replies": []
                                                    },
                                                    {
                                                        "user_name": "rubiks6",
                                                        "time": "15 January, 2022",
                                                        "context": "Obviously I d know the distinction because I found it necessary to point it out to you. \n\nWhen you ascribe to “science” ideas that belong to scientists, you are attempting to lend credibility to your statements which are actually the ideas of fallible men. (Also, men who often disagree.) Authority is not a basis for truth. Popularity of an idea is not a basis for truth. I would accept your colloquial use of the term “science” if you did not abuse it.  You make statements that begin like “Science says …” as if that made your statement a fact. It does not. You may make a statement like “Some scientists say …”. That would most likely be a true statement.",
                                                        "good": "1",
                                                        "bad": "1",
                                                        "replies": []
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            },
                            {
                                "user_name": "beadgBass",
                                "time": "15 January, 2022",
                                "context": "\"What you observe today is that life only comes from life. You can show no counter example.\"\nIt is entirely possible that abiogenesis still occurs on Earth. The chances of us witnessing it are extremely slim, as the new life would be quickly subsumed by the abundantly evolved existing life.",
                                "good": "5",
                                "bad": "1",
                                "replies": [
                                    {
                                        "user_name": "rubiks6",
                                        "time": "15 January, 2022",
                                        "context": "How convenient for your argument. \n\nThere are many things that are logically possible but which are not reality.",
                                        "good": "2",
                                        "bad": "5",
                                        "replies": [
                                            {
                                                "user_name": "beadgBass",
                                                "time": "15 January, 2022",
                                                "context": "Actually it is terribly inconvenient for my argument, as we have to look to other planets for more examples of abiogenesis.",
                                                "good": "2",
                                                "bad": "0",
                                                "replies": [
                                                    {
                                                        "user_name": "rubiks6",
                                                        "time": "15 January, 2022",
                                                        "context": "Life on Earth is not an example of abiogenesis. Life on Earth comes from the Living God. \n\n“… we have to look to other planets for more examples …”\n\nIndeed, and those looking are coming up short - the topic of this article. How will you support your argument when no life is found anywhere except here on Earth. I propose that the evidence thus far supports my claim. Abiogenesis does not happen. There are no examples of abiogenesis. Life only comes from life.",
                                                        "good": "2",
                                                        "bad": "3",
                                                        "replies": [
                                                            {
                                                                "user_name": "beadgBass",
                                                                "time": "15 January, 2022",
                                                                "context": "Of course Earth is an example of abiogenesis. It was a lifeless planet, and then there was life. It was pretty boring  for a few billion years, with nothing but bacteria, but it got better.",
                                                                "good": "1",
                                                                "bad": "0",
                                                                "replies": []
                                                            }
                                                        ]
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            },
                            {
                                "user_name": "nepawoods",
                                "time": "15 January, 2022",
                                "context": "\"You can show no counter example.\"\n\nGive me a universe like ours, without life, and several billion years, and the ability to monitor what's happening in all the oceans ponds and puddles of every one of trillions of trillions of planets.  Then, and only then, does \"You can show no counter example\" carry any weight.",
                                "good": "0",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "rubiks6",
                                        "time": "15 January, 2022",
                                        "context": "Sorry, nepawoods, but my statement is absolutely factual. You can provide no counterexample t the statement, “life only comes from life.” What weight you choose to give the statement is your own business but your subjective opinion does not reflect reality. You should stick with facts.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": [
                                            {
                                                "user_name": "nepawoods",
                                                "time": "16 January, 2022",
                                                "context": "Your statement is factual and irrelevant.  I can provide no counterexample, and you can provide no relevance.  What is the relevance of mankind, in his short existence and limited ability to observe, not having observed some microscopic event that happened at some distant past point in time, somewhere on one of trillions of trillions of planets?  Explain the relevance.\n\nIf observation of an event should be expected if it occurred, then lack of observation becomes relevant.  That's not the case here at all.",
                                                "good": "0",
                                                "bad": "0",
                                                "replies": []
                                            }
                                        ]
                                    }
                                ]
                            },
                            {
                                "user_name": "quietsmith",
                                "time": "17 January, 2022",
                                "context": "I'm sure if you keep screaming loudly enough you can block out the evidence. :D",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "grannyclampett",
        "time": "14 January, 2022",
        "context": "Guesswork. Always guesswork.",
        "good": "1",
        "bad": "6",
        "replies": [
            {
                "user_name": "spinynorman262",
                "time": "15 January, 2022",
                "context": "And now we all know why you failed out of your science classes.",
                "good": "6",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "grannyclampett",
                        "time": "15 January, 2022",
                        "context": "\"Science\" is not \"science\" unless it can be confirmed.",
                        "good": "0",
                        "bad": "6",
                        "replies": [
                            {
                                "user_name": "thunker54",
                                "time": "15 January, 2022",
                                "context": "Science isn't absolute, it's the study to understand the world and universe we live in. Most of science is theory. Once the theory becomes \"confirmed\" it becomes a law. But most of science isn't \"confirmed\", it's collecting evidence to help us prove, or disprove, a theory. \n Science once held that the universe circled the Earth. But as we learned more, we discovered that wasn't true after all. \n Science is ever evolving.",
                                "good": "5",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "spinynorman262",
                                        "time": "15 January, 2022",
                                        "context": "I don't think that scientists use the term 'law' anymore, but otherwise I'm with you.",
                                        "good": "2",
                                        "bad": "0",
                                        "replies": [
                                            {
                                                "user_name": "thunker54",
                                                "time": "15 January, 2022",
                                                "context": "Really? Interesting. When I was studying physics in college back in the 70's they taught \"laws.\" Like the physics law of \"conservation of energy\" and the \"laws of thermodynamics.\"\n But it's been many moons since college now, so definitions may have changed. Again just demonstrating that nothing in science is an absolute.\n If you show repeated successful predictions of the intersection of describing what happened and explaining what happened enough, they called it a \"law.\"\n But you're probably right. Newton's \"law\" of gravity\" and \"Newton's laws of motion\" we now know to actually just be close approximations. \n Really I think it's more semantics than anything else.",
                                                "good": "1",
                                                "bad": "0",
                                                "replies": []
                                            }
                                        ]
                                    },
                                    {
                                        "user_name": "grannyclampett",
                                        "time": "15 January, 2022",
                                        "context": "\"Science once held that the universe circled the Earth.\"\n\nActually, it was human interpretation of \"the science\" that did so.",
                                        "good": "0",
                                        "bad": "1",
                                        "replies": [
                                            {
                                                "user_name": "thunker54",
                                                "time": "15 January, 2022",
                                                "context": "Once again you are using a faulty definition of \"science.\" You are using it as the absolute truth. Science is NOT the absolute truth. It's the study trying to determine the truth.\n By your definition here, mankind could NEVER discover the \"why\" something happens. It would only observe and report that something did happen and never understand why.",
                                                "good": "2",
                                                "bad": "0",
                                                "replies": [
                                                    {
                                                        "user_name": "grannyclampett",
                                                        "time": "15 January, 2022",
                                                        "context": "By your (apparent) definition, any conclusion as to the \"why\" following an observation can be made without the existence of \"facts\" and be stated as \"scientific truth\" when, in fact, it is simply nothing more than \"opinion\".",
                                                        "good": "0",
                                                        "bad": "1",
                                                        "replies": [
                                                            {
                                                                "user_name": "thunker54",
                                                                "time": "15 January, 2022",
                                                                "context": "No that's not what I said. You observe what is in the physical world and try to understand why it occurs. That's USING science to develop a \"theory.\" If your observations agree with your predictions often enough it becomes a \"law\" - at least when I was studying for my physics degree in the 70's. But even the \"laws\" we develop aren't necessarily absolute and can change. We went for hundreds of years believing Newton's \"laws of motion\" were cprrect. Einstein, and his theory of relativity, showed that Newton's laws were very good approximations at non-relativist speeds. However as the velocity approaches the speed of light Newton's laws totally break down.\n That's what science is about. You formulate a hypothesis to explain what you observe but you can NEVER call the reality itself \"science\" as you want to do. Science is the process of developing a theory and attempting to explain it in terms as you understand them. But science is ever-changing. NOT like you trying to say the Copernicus misinterpreted the \"science of the universe.\"\n Science is the process of developing a theory. It is NOT what the reality may be, and in his case what it turned out not to be as he thought. The truth and reality is the end goal, science is a tool to get there. \n You cannot \"confirm\" science as you said. You can only try to \"confirm\" the conclusion your draw by USING science.\n \n But enough. I can see nothing will satisfy you when it comes to science. So you just keep on believing as you wish - be i",
                                                                "good": "0",
                                                                "bad": "0",
                                                                "replies": []
                                                            },
                                                            {
                                                                "user_name": "sciencerocks",
                                                                "time": "15 January, 2022",
                                                                "context": "I rarely agree with Richard Dawkins, but when he undermined the idea of \"why questions,\" it hit a note with me. There are very few good 'why' questions in looking at the big picture, and none in science.",
                                                                "good": "0",
                                                                "bad": "0",
                                                                "replies": []
                                                            }
                                                        ]
                                                    },
                                                    {
                                                        "user_name": "zanelittlegray",
                                                        "time": "17 January, 2022",
                                                        "context": "thunker54 I read somewhere once decades ago that science answers \"how\" but not why and philosophy delves in the \"why\" of things.\nDo you agree?\nIf not, then thoughts?",
                                                        "good": "1",
                                                        "bad": "0",
                                                        "replies": [
                                                            {
                                                                "user_name": "thunker54",
                                                                "time": "17 January, 2022",
                                                                "context": "Yes, that better conveys what I was trying to say.  Thanks.",
                                                                "good": "0",
                                                                "bad": "0",
                                                                "replies": [
                                                                    {
                                                                        "user_name": "zanelittlegray",
                                                                        "time": "18 January, 2022",
                                                                        "context": "U R welcome, glad to help.\nAre you a Christian?",
                                                                        "good": "0",
                                                                        "bad": "0",
                                                                        "replies": [
                                                                            {
                                                                                "user_name": "thunker54",
                                                                                "time": "18 January, 2022",
                                                                                "context": "Yes!  Unlike a what a lot of people seem to believe, Christianity and science are not exclusive.",
                                                                                "good": "0",
                                                                                "bad": "0",
                                                                                "replies": [
                                                                                    {
                                                                                        "user_name": "zanelittlegray",
                                                                                        "time": "18 January, 2022",
                                                                                        "context": "That is so true!\nI like both the young Earth creationism and Dr William Lane Craig's old Earth view that agrees with mainstream science.\nI like both views because it shows the Bible to be a robust place for competing theories and a springboard for scientific inquiry.",
                                                                                        "good": "0",
                                                                                        "bad": "0",
                                                                                        "replies": []
                                                                                    }
                                                                                ]
                                                                            }
                                                                        ]
                                                                    }
                                                                ]
                                                            }
                                                        ]
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            },
                            {
                                "user_name": "spinynorman262",
                                "time": "15 January, 2022",
                                "context": "Okay, so you never took a science class. If you had, the first thing you would have learned is that science is a process. By testing hypotheses, we confirm (support) or disprove potential statements about the natural world.",
                                "good": "4",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "error": "error"
    },
    {
        "user_name": "fakeitgoodnasa",
        "time": "14 January, 2022",
        "context": "More far-fetched fakery by the likes of Nasa et al.",
        "good": "2",
        "bad": "7",
        "replies": []
    },
    {
        "user_name": "ScooterB",
        "time": "20 January, 2022",
        "context": "There is no possible way Science can know for a fact that this asteroid originated on Mars and was “bounced off” Mars and landed here.\n\nPossible yes. Proof not even close.\n\nIf they claim the mineral and or chemical content matches samples or readings from Mars they would have to assume Martian rock component ratio is unique to Mars alone.\n\nThe Scientific Method is open to and welcomes theories as a basis to explore and refine our knowledge. It also requires that before anything can be established as a fact that said claim must be something that can be observed  and independently verified in a controlled environment.\n\nWe can do repeat independent analysis of the chemical and mineral composition in a controlled environment and we can do independently verifiable repeat Carbon dating in a controlled environment.\n\nProof that it came from Mars and how many millions of years ago is far beyond meeting any level of even an accurate probability.",
        "good": "2",
        "bad": "0",
        "replies": [
            {
                "user_name": "rgervais",
                "time": "9 March, 2022",
                "context": "I agree completely",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "lifeinthenolane",
        "time": "1 February, 2022",
        "context": "Wonder what the rock is worth?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Brylcream_Boomer",
        "time": "20 January, 2022",
        "context": "Boy can you imagine how HARD the planet has to get hit to send debris scattering out into space? Some super being was playing snooker....Eight ball in the corner pocket.....",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "gulfvetm60",
        "time": "20 January, 2022",
        "context": "Oxygen and Hydrogen are pretty common throughout the universe ,so it is not a big deal to find that as water. the big deal is that life could spontaneously come into being by mixing chemicals, to which the answers is now, and has been proven to be, NO.",
        "good": "1",
        "bad": "0",
        "replies": []
    }
]