[
    {
        "user_name": "libsrnuts201",
        "time": "20 May, 2021",
        "context": "If your look close at the pictures you can see the ChiComs building artificial islands that are for peaceful purposes only.",
        "good": "26",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "coop-atroop-a",
        "time": "20 May, 2021",
        "context": "Very nice job.  Rooting for your people, not your oppressive ideological government.",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "TRUMPMAGA2022,23...24,25,26,27,28,29,30,,,",
        "time": "20 May, 2021",
        "context": "Looks like the cnn fake propaganda...",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "alex50",
        "time": "20 May, 2021",
        "context": "Ominous accomplishment for USA to deal with, unfortunately.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "TRUMPMAGA2022,23...24,25,26,27,28,29,30,,,",
        "time": "20 May, 2021",
        "context": "Looks like a Beijing Briben foto opportunity...",
        "good": "5",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "philly805",
        "time": "20 May, 2021",
        "context": "I still don't understand why China doesn't put a man on the moon, 50 some years after we did.",
        "good": "3",
        "bad": "0",
        "replies": [
            {
                "user_name": "🐧thereisagod2⭐",
                "time": "20 May, 2021",
                "context": "Because we didn't put a man on the moon that's why!!!",
                "good": "2",
                "bad": "7",
                "replies": [
                    {
                        "user_name": "jp853",
                        "time": "20 May, 2021",
                        "context": "You know how we know that we did? Even the Soviet Union begrudgingly said that we did.",
                        "good": "1",
                        "bad": "1",
                        "replies": []
                    },
                    {
                        "user_name": "philly805",
                        "time": "20 May, 2021",
                        "context": "I see the flag on the moon with my telescope.",
                        "good": "1",
                        "bad": "1",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "foxfun",
                "time": "20 May, 2021",
                "context": "Seems a bit pointless and if someone didn't make it back?  Mars is the new frontier.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "philly805",
                        "time": "20 May, 2021",
                        "context": "The moon will be the launching pad to Mars.",
                        "good": "1",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "foxfun",
                                "time": "20 May, 2021",
                                "context": "That is debate able and has been debated.",
                                "good": "0",
                                "bad": "1",
                                "replies": [
                                    {
                                        "user_name": "philly805",
                                        "time": "20 May, 2021",
                                        "context": "A lot of stuff on here is redundant.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "blasto",
        "time": "20 May, 2021",
        "context": "We did this 20 years ago. They stole our technology and did the same thing we did ....they also created the COVID-19 virus in their labs paid for by Dr. Fauci.",
        "good": "61",
        "bad": "15",
        "replies": [
            {
                "user_name": "bftsplk81",
                "time": "20 May, 2021",
                "context": "And Bill Gates and Soros",
                "good": "22",
                "bad": "3",
                "replies": [
                    {
                        "user_name": "OliveBulb",
                        "time": "20 May, 2021",
                        "context": "Also it's fake, but also it's real but it's just like the flu. But that's okay because we have \"the liberal vaccines\" that we should thank Trump for, but also they're killing everyone and they contain tracking chips from Bill Gates.",
                        "good": "3",
                        "bad": "5",
                        "replies": [
                            {
                                "user_name": "bftsplk81",
                                "time": "20 May, 2021",
                                "context": "Is Engrish your first language Chicom troll?",
                                "good": "1",
                                "bad": "1",
                                "replies": [
                                    {
                                        "user_name": "blasto",
                                        "time": "20 May, 2021",
                                        "context": "Russian is his first language.",
                                        "good": "0",
                                        "bad": "1",
                                        "replies": [
                                            {
                                                "user_name": "OliveBulb",
                                                "time": "21 May, 2021",
                                                "context": "Non, je parles seulement l'anglais et francais.",
                                                "good": "1",
                                                "bad": "0",
                                                "replies": [
                                                    {
                                                        "user_name": "blasto",
                                                        "time": "21 May, 2021",
                                                        "context": ".....oh, it’s Pepe Le Pew and his white flag, never mind.",
                                                        "good": "0",
                                                        "bad": "1",
                                                        "replies": []
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            },
                            {
                                "user_name": "lycopine",
                                "time": "20 May, 2021",
                                "context": "Trump vaccines = injecting disinfectant",
                                "good": "1",
                                "bad": "1",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "maryah",
                "time": "21 May, 2021",
                "context": "China has the ability to manufacture virus weapons.",
                "good": "3",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "error": "error"
    },
    {
        "user_name": "fakeitgoodnasa",
        "time": "20 May, 2021",
        "context": "China had better keep their 'Mars rover' on the opposite side of Devon Island, far away from Nasa's...",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "lili489",
        "time": "20 May, 2021",
        "context": "Now officially a Red planet...",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "democratsrfascists",
        "time": "20 May, 2021",
        "context": "Wonder how much stolen technology got them there?\n\nChina is the enemy of the world.",
        "good": "31",
        "bad": "10",
        "replies": [
            {
                "user_name": "rogermckindly",
                "time": "20 May, 2021",
                "context": "that is exactly what I was thinking when I got to the comment section",
                "good": "8",
                "bad": "3",
                "replies": []
            }
        ]
    },
    {
        "user_name": "dolemite1000",
        "time": "20 May, 2021",
        "context": "Well, it's only a matter of weeks until Mars will need to lock down.  Thanks China!",
        "good": "40",
        "bad": "9",
        "replies": []
    },
    {
        "user_name": "jp853",
        "time": "20 May, 2021",
        "context": "Two weeks after the warranty is up on the thing it will self destruct so they better get their work done quick.",
        "good": "8",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "jethdlr",
        "time": "20 May, 2021",
        "context": "Hey it looks like Hunter on crack...oh it is just a red rock...",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "thomas46",
        "time": "20 May, 2021",
        "context": "Boy that Mars sure does look great. Can hardly wait to go there and implode on the dry -155 degree beach.",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "$trumpidity",
        "time": "20 May, 2021",
        "context": "Somewhere in the GOBI desert.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "wayright984",
        "time": "20 May, 2021",
        "context": "OK I know it's not just me... photos look shopped.",
        "good": "9",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "73vet",
        "time": "20 May, 2021",
        "context": "Probably waiting to shoot down the NASA helicopter. ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "philly805",
        "time": "20 May, 2021",
        "context": "China doesn't seem to be as super-duper as it's made out to be.  China my be merely factories of slave child labor and a bunch of good technology steelers.",
        "good": "13",
        "bad": "5",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "thered,whiteandtheblue!",
        "time": "20 May, 2021",
        "context": "Ohhhh we rand on pranet thats coror of red robster craw!",
        "good": "9",
        "bad": "3",
        "replies": [
            {
                "user_name": "foxfun",
                "time": "20 May, 2021",
                "context": "That was a little funny in 1970",
                "good": "3",
                "bad": "5",
                "replies": [
                    {
                        "user_name": "thered,whiteandtheblue!",
                        "time": "20 May, 2021",
                        "context": "Ohh come on!!! Righten up rittle bit! It was a rittle funny",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "dazedandconfused150",
        "time": "20 May, 2021",
        "context": "You kidding me?\n\nThat’s Palmdale CA",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "LetRride",
        "time": "20 May, 2021",
        "context": "How long before they start building an island?",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "TRUMPMAGA2022,23...24,25,26,27,28,29,30,,,",
        "time": "20 May, 2021",
        "context": "That's the Sahara desert 🏜",
        "good": "3",
        "bad": "2",
        "replies": [
            {
                "user_name": "LarryLarry",
                "time": "20 May, 2021",
                "context": "Maybe the Gobi ??",
                "good": "3",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "lifer1",
        "time": "20 May, 2021",
        "context": "Joe Biden would fit right in with the Chinese leadership. He stole everything he has, too.",
        "good": "13",
        "bad": "3",
        "replies": [
            {
                "user_name": "lycopine",
                "time": "20 May, 2021",
                "context": "Yeah, just like the bushes and trumps",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "lifer1",
                        "time": "20 May, 2021",
                        "context": "Hmmm, let's examine that, shall we?\n\nGeorge HW Bush\nBorn to family wealth (His father, Prescott, was in banking and also fought with the AEF in WW1)\nEnlisted in the Navy out of high school to fly torpedo bombers, becoming one of the youngest combat pilots in WW2, earning the Air Medal (with 3 ribbon devices) and the Distinguished Flying Cross\nPost war, graduated Yale in 2.5 years, majoring in economics and minoring in sociology\nMoved to west Texas and co-founded an oil drilling company\nAt age 42, he won a seat in Congress\nIn 1970 he was appointed US ambassador to the UN\nIn 1972 he became chair of the RNC\nIn 1976 he became Director of the CIA\nIn 1980 he was elected VP\nIn 1988 he was elected President\nGeorge W Bush\nBorn to family wealth\nGraduated Yale in 1968 with a BA in history\nGraduated Harvard Business in 1975 with an MBA\nNoted bibliophile\nAdmitted \"average\" student (77) in high school/undergrad, enjoyed drinking and carousing\nTX Air National Guard from 1968-1974\nStarted his own oil exploration business in 1977, merger with larger conglomerates in 1984 and becoming chairman\nIn 1989 led a group of investors to buy the TX Rangers baseball team, selling his interests in 1998, making $15M on an $800K investment\nGovernor of TX from 1995-2000\nElected President in 2000\nDonald Trump (To be continued)...",
                        "good": "0",
                        "bad": "1",
                        "replies": [
                            {
                                "user_name": "lifer1",
                                "time": "20 May, 2021",
                                "context": "Donald Trump\nBorn to wealth (father prospered in Queens real estate development)\n1968 graduates Wharton Business with a BA in economics. Claimed several times to have finished first in his class but no evidence exists he made the honor roll...\nObtaining several draft deferments, the board eventually found him fit but he was later deemed 4-F from bone spurs\nDuring and after Wharton, worked for his father's real estate company, becoming president in 1971\nIn 1978 he shifted his interests from Queens middle class housing to Manhattan real estate and construction\nTrump built a luxury real estate empire, marketed heavily under his name, eventually expanding into casinos and golf resorts\nWell known for heavily leveraging his business interests to expand his empire and personal wealth\nAlso well known for protecting his personal assets through strategic bankruptcies when a business venture, notably his casinos, fail\nConsidered by many, prior to his foray into politics, a master marketer of himself and ostentacious living\nMany varied business ventures, books, media appearances, and co-producer and host of various editions of The Apprentice\nOften asked during interviews whether he would run for office. Ironically, the commentators assumed he was a Democrat\nInsults his way to the Republican nomination in 2016\nElected President\nYou can say all you want about the Bushes and Trump. What can't be disputed is that they worked for their success.",
                                "good": "0",
                                "bad": "1",
                                "replies": [
                                    {
                                        "user_name": "lifer1",
                                        "time": "20 May, 2021",
                                        "context": "Trump may be an unseemly character (ahem). And it's hard to imagine him (or anyone) building a Manhattan real estate empire from scratch (he didn't) or without help from some sketchy characters to navigate the NYC cesspool absolutely dominated by a long and corrupt legacy of Democrat politics.\n\nIf NY AG Letitia James actually brings charges against the Trump organzation (and, by proxy Trump himself), I would expect Trump to hire an army of lawyers to ensure that *every* New York Democrat politician gets exposed for their systemic corruption, since that's the only way a Cuomo, De Blasio, Schumer, Vance, or any person of significance in that cabal (sure, toss Giulliani in the mix, too) can advance is by sharing dirt together as a kind of mutually assured destruction blood pact. Consequently, I would expect any efforts to bring charges that stick will be delayed until after Trump has passed. Just spit-balling.\n\nThe resumes of any of these figures absolutely destroys Joe Biden's credentials. And it's not even close. All three understand how to work. Biden understands how to profit exclusively and only from other people's work and taking credit for himself. And sure, Trump's exploitation of the Central Park rink's contractors was terrible. So sue him (he's used to it)...",
                                        "good": "0",
                                        "bad": "1",
                                        "replies": []
                                    },
                                    {
                                        "user_name": "lycopine",
                                        "time": "20 May, 2021",
                                        "context": "Don John Trump. He and his siblings were appointed as board directors of a shell company created by daddy Fred.  They were \"experienced\" in business as infants and drew a salary that Fred used as tax deductions. The company purchased equipment to \"maintain\" daddy Fred's apartment empire by selling the equipment at marked up prices to another of Fred's shell companies. That's money laundering. Don-John claimed he only \"borrowed \" $1 million and swiftly paid it back. In reality, it is thoroughly documented he received well over $400 million and paid back ZERO.\nThird wife Melania entered the USA as a tourist and violated her tourist visa by taking US paying modeling jobs. When caught boyfriend Don-John used his connections to get the visa changed, married her, allowing free access to USA citizenship for her entire family. After the 2016 election, Don-John instituted an immigration policy to prevent exactly what he aided his girlfriend to do. Lying hypocrisy. \nTrump University closed for fraud. Trump foundation closed for fraud. \nAnd plenty more....",
                                        "good": "0",
                                        "bad": "1",
                                        "replies": [
                                            {
                                                "user_name": "lifer1",
                                                "time": "20 May, 2021",
                                                "context": "Hmmm, I find it fascinating that you seem to have so many FACTs on Trump that one would think NYC prosecutors would want to pounce on. Is Trump likely very dirty from playing in Manhattan real estate? I'm pressed to imagine how one can survive that shark tank without having a few graveyards of skeletons, so you don't see me trying to canonize the guy. Does he know how to work (both literally and figuratively)? Absolutely.\n\nLunch Pail Joe? Not so much.",
                                                "good": "0",
                                                "bad": "1",
                                                "replies": [
                                                    {
                                                        "user_name": "lycopine",
                                                        "time": "20 May, 2021",
                                                        "context": "The NYC and state prosecutors are still working on it, so your claim is again false. \nHow does Don-John \"work\"? If i was making money as a board director since infancy, then handed $400 million i would be playing like he has all his life.",
                                                        "good": "0",
                                                        "bad": "0",
                                                        "replies": []
                                                    }
                                                ]
                                            }
                                        ]
                                    },
                                    {
                                        "user_name": "lycopine",
                                        "time": "20 May, 2021",
                                        "context": "None worked in any traditional sense of the word. Don-John was a democrat, pro-choice and a close friend of the Clintons too.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": [
                                            {
                                                "user_name": "lifer1",
                                                "time": "20 May, 2021",
                                                "context": "So neither of us will step forward as character witnesses. But Trump has made payroll and understands how to build things and make businesses work. It doesn't simply get handed to him.\n\nThere's plenty of question marks about Trump/Clinton/Epstein connections. If they can be fleshed out, nail every last one of them. Just don't pick and choose, you know? When it comes to crimes, I don't see teams, I see criminals. It is injustice when the innocent get punished and the guilty go free. So stop looking for the party affiliation before determining whether or how hard to prosecute.",
                                                "good": "0",
                                                "bad": "1",
                                                "replies": [
                                                    {
                                                        "user_name": "lycopine",
                                                        "time": "20 May, 2021",
                                                        "context": "Where do you see me picking party affiliations? A false statement.\nDon-John was handed over $400M yet claimed only one and paid it back too. Blatant lie.",
                                                        "good": "0",
                                                        "bad": "0",
                                                        "replies": []
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            },
                            {
                                "user_name": "lycopine",
                                "time": "20 May, 2021",
                                "context": "Hmmm, let's look at more underlying FACTS, shall we?\nGranddaddy Prescott, created shell bank, the Union Banking company, to launder money for the nazi war industry, specifically tge Thyssen Corp. After congressional investigations it was shut down AFTER millions were made.\nSonny GHW as VP under Ronald \"I don't recall\" Reagan, sold weapons to Hussein in Iraq, including dual use technology and WMDs.\nGrandchild \"W\" was admitted to Yale because of his parents connections through Skull and Bones and his prep school, barely graduated with a C- GPA. \nDaddy VP used his position to get \"W\" in to TANG bypassing a hundreds long waitlist to avoid any possibility of combat in VN.\nHis wings were removed because he failed to obey the CO and get the mandatory physical.\nHis first \"oil\" company, Arbusto, expertly drilled dirt and went bankrupt. The second, Spectrum, did the same causing \"W\" to beg daddy for another bailout. The Saudis were enlisted through lifelong budsy prince Bandahr to purchase Spectrum for 3 times its value to create Harken and \"W\" was given a directorship position and massive salary for one annual meeting.\nI can also show the BushWalker dynasty dates back to the Civil War, where the Walker family's profits and bankroll were based on war.\nAnd plenty more. So keep your rosy view of the Bush crime family to yourself and look deeper as I have",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "error": "error"
    },
    {
        "user_name": "OlivePlane",
        "time": "20 May, 2021",
        "context": "Good to see China making use of that US technology that Clinton and Obama gave them.",
        "good": "5",
        "bad": "3",
        "replies": [
            {
                "user_name": "4cx35000c",
                "time": "20 May, 2021",
                "context": "And Hunter sold them.",
                "good": "1",
                "bad": "2",
                "replies": []
            }
        ]
    },
    {
        "user_name": "willlandru",
        "time": "20 May, 2021",
        "context": "Maybe the Chinese can give a shout out to NASA and US aerospace companies since it was their intellectual property that they stole to make this all possible.",
        "good": "57",
        "bad": "8",
        "replies": []
    },
    {
        "user_name": "mtwallet526",
        "time": "20 May, 2021",
        "context": "Now that China is getting some $600 billion a year from America, Again. They can afford space exploration. While the USA, spends borrowed money on such luxuries. And the saddest part is, is that they are doing it all on American technology.",
        "good": "76",
        "bad": "12",
        "replies": [
            {
                "user_name": "JOEgets10%888888888888",
                "time": "20 May, 2021",
                "context": "Using our technology sold to them by democrats, the democrats are waiting in line to sell us out!!!!",
                "good": "47",
                "bad": "13",
                "replies": [
                    {
                        "user_name": "jerkinp",
                        "time": "20 May, 2021",
                        "context": "Sold by both parties who wanted help the corporations make money selling \nproducts and service in China including dual purpose technology. China's various  surveillance tech came from US, Canada, Europe and Australia.",
                        "good": "3",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "OrangeFries",
                        "time": "20 May, 2021",
                        "context": "China doesn't buy American technology. They simply steal it.",
                        "good": "9",
                        "bad": "3",
                        "replies": [
                            {
                                "error": "error"
                            },
                            {
                                "user_name": "maryah",
                                "time": "21 May, 2021",
                                "context": "Yes, Matlab, pro/E industrial software was cracked by Chinese hackers.",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "user_name": "NonyoBiz",
                        "time": "20 May, 2021",
                        "context": "Soldhell !!!1  You mean stolen",
                        "good": "0",
                        "bad": "1",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "maryah",
                "time": "21 May, 2021",
                "context": "Yes, as far as I know, the industrial software for designing the rover was developed in the United States, such as PTC's Pro/E software and Matlab software. China uses American industrial software to design and simulate the Mars rover.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "Easyburner",
        "time": "20 May, 2021",
        "context": "See, stealing other people's technology is paying off...",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "kornfed151",
        "time": "20 May, 2021",
        "context": "Let’s go find them and be the first to discover life on another planet!!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "geoffarnold",
        "time": "20 May, 2021",
        "context": "When the SEC inexplicably approved the sale of Lenovo laptop computer production to China, we sold them micro-miniaturization technology which helped their fledgling space program.\n\nNow, nearly 30 years later, we are seeing the results again and again.\n\nThis is just the latest result of that sale.",
        "good": "41",
        "bad": "7",
        "replies": [
            {
                "error": "error"
            },
            {
                "user_name": "lycopine",
                "time": "20 May, 2021",
                "context": "It was IBM that sold their Thinkpad line to china, and it wasn't 30 years ago. China renamed it Lenovo. The technology was already outdated, a commodity, and unprofitable.",
                "good": "3",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "maryah",
                        "time": "21 May, 2021",
                        "context": "That's because IBM feels that personal computers are unprofitable. So sold a Chinese company. But look at the effect of this Chinese company using American Thinkpad. Lenovo's personal computers sold in China are not as good as HP and Dell.",
                        "good": "1",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "lycopine",
                                "time": "21 May, 2021",
                                "context": "That's what transnational outfits do, unload money losing operations.",
                                "good": "1",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "foxfun",
        "time": "20 May, 2021",
        "context": "My big wonder is.  Is someone thinking that mining can be done on mars?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "exnhilo",
        "time": "20 May, 2021",
        "context": "Time for a game of Red Rover!  \nI hope our rover goes over and tears theirs apart!  We were there first!  Haha....",
        "good": "24",
        "bad": "12",
        "replies": [
            {
                "user_name": "alneil028",
                "time": "22 May, 2021",
                "context": "Yeah, we can have a Battle Bots duel to show on American TV.  Place your bets, now!",
                "good": "2",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "exnhilo",
                        "time": "27 May, 2021",
                        "context": "Ahemmm....I like me some battlebots....ahemmm...reckon da be sum good watchin....",
                        "good": "0",
                        "bad": "1",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "13thjuror",
        "time": "20 May, 2021",
        "context": "China also reported 90,920 COVID-19 cases to date.  90,920.  ",
        "good": "2",
        "bad": "0",
        "replies": [
            {
                "user_name": "BigPapaD",
                "time": "20 May, 2021",
                "context": "That doesn't seem realistic.  China has a population of 1.398 Billion people.  That's more than 3 times the size of the US.  Wuhan has a population of something around 12 million people.  That's just slightly more than the population of Georgia.  Given that the state has had  865,234 cases, Wuhan likely had well more than that alone.  I think we both agree...... China is a liar.",
                "good": "0",
                "bad": "2",
                "replies": []
            }
        ]
    },
    {
        "user_name": "ohu812",
        "time": "20 May, 2021",
        "context": "China moves ahead as we worry about boys being girls and white guilt or some other such nonsense.",
        "good": "6",
        "bad": "0",
        "replies": [
            {
                "user_name": "macquarie",
                "time": "20 May, 2021",
                "context": "Are you really sure they are on Mars not in a Chinese film studio?",
                "good": "1",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "LyinLibs382",
                        "time": "20 May, 2021",
                        "context": "Might have just hacked our rover.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "ohu812",
                        "time": "20 May, 2021",
                        "context": "Maybe. But, we are bogged down with race theory and micro aggressions, while their military is growing stronger than ours.",
                        "good": "1",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "macquarie",
                                "time": "20 May, 2021",
                                "context": "I don't disagree with you...\nBUT...\nEverything they have, they have stolen from others. \nTheir education system does not teach them to think, to reason, in inquire. \nIt just teaches them the questions and the answers, never what is in between the two.\nIn reality, many of the Chinese males including those in their military are \"soy boy\"... emasculated by the consumption of soy products. They are also the product of single child families and have a very strong filial duty which means when push comes to shove, will have little inclination to die and leave their folks struggling in their old age.\nAll is never what is seems with the Chinese believe me, I have lived there a number of years.\nThis is why we need to question whether this Chinese Mars rover is real or not.",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "mrgod2u",
        "time": "20 May, 2021",
        "context": "Just how long will a Chinese Rover made in China last on the Red Planet?\nWell it's was made in China, how long do your Chinese made things last? LOLS!",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "JoeLied2000DiedLOLdemdems",
        "time": "20 May, 2021",
        "context": "Anyone else see that fortune cookie? One of the chinese \"scientist\" must have dropped part of his lunch while prepping the set.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "LyinLibs382",
        "time": "20 May, 2021",
        "context": "Headline should read sends back IT’s pictures. They sure weren’t the first pictures  that were sent back from Mars.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "gotstuff",
        "time": "20 May, 2021",
        "context": "FAKE!! Everything from China is FAKE .... these are probably from the same Studio that Commie Jackie Chan makes all his Fake Kung Foolie movies.",
        "good": "4",
        "bad": "2",
        "replies": [
            {
                "user_name": "qta",
                "time": "20 May, 2021",
                "context": "well the covid 19 was not fake",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "lovethattrump",
        "time": "20 May, 2021",
        "context": "You all can thank the Hussein for the rise in chinese technology. He advanced it faster than any other president with help from GE and Google.",
        "good": "16",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "giancarlo70",
        "time": "20 May, 2021",
        "context": "“Damn it! Joe just traded top secret rocket technology to the Chinese for a knockoff jitterbug cellphone and cheap set of pots.......”\n\n🤦🏻‍♂️🥴❌👨🏻‍🦳",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "citizen953",
        "time": "20 May, 2021",
        "context": "It's a rover killer tracking down US rover.",
        "good": "2",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "Fncisnumber1",
        "time": "20 May, 2021",
        "context": "If they used Chinese parts, things may not go well.  ",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Shoehorn",
        "time": "20 May, 2021",
        "context": "One vawy small step",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ursusopinari",
        "time": "20 May, 2021",
        "context": "Would really like to see the American rover send its drone to fly over the Chinese lander, holding a sign that says \"Welcome to Mars!  'Bout time y'all got here!\"",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bocacheekah",
        "time": "20 May, 2021",
        "context": "China hasn’t invented anything since the noodle. They steal and copy.",
        "good": "6",
        "bad": "3",
        "replies": [
            {
                "error": "error"
            }
        ]
    },
    {
        "user_name": "BdawgRise",
        "time": "20 May, 2021",
        "context": "I have a hard time believing this is real and not Chinese propaganda.",
        "good": "3",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "giancarlo70",
        "time": "20 May, 2021",
        "context": "Joe-“Maybe we should shoot Rosie up there for the whole lbgst thing?”\n\nStaff-“Uh, sir, we don’t have that kind of technology yet to carry that much load”\n\nJoe-“..........”",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "macquarie",
        "time": "20 May, 2021",
        "context": "I remember seeing the video of the first Chinese space walk...\nYou could hear the 'astronaut' ( I use that term lightly) ask if he should 'get in the water now'. Then you can see bubbles come from him and the studio lights reflecting on parts of him. For some strange reason, the earth behind them when they are supposedly in space never seems to move correctly....\nI wonder what studio the Chinese are filming the Mars rover in???",
        "good": "2",
        "bad": "3",
        "replies": [
            {
                "user_name": "LyinLibs382",
                "time": "20 May, 2021",
                "context": "They better hope that manure they send over here quality wise isn’t anything like they send to Mars. That’ll be one short mission, if so.",
                "good": "1",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "giancarlo70",
        "time": "20 May, 2021",
        "context": "Dems ❤️🇨🇳\nDems❌❤️🇺🇸\nDems=💩💩💩",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "irishfreedom888",
        "time": "20 May, 2021",
        "context": "We pay 73.9 million per DAY in interest only payments to China . That’s every day we pay them 73,900,000 just in interest. Kind of embarrassing to call them stupid knowing we owe them 1.11 trillion dollars we had to borrow to run our government. And now Biden wants to add two trillion more to our debt. Don’t say too many bad things about China, we’ll be knocking on their banks door again soon.",
        "good": "10",
        "bad": "0",
        "replies": [
            {
                "error": "error"
            }
        ]
    },
    {
        "user_name": "bribing-Bidens",
        "time": "20 May, 2021",
        "context": "These are fake photos, people. These photos may have been taken in an elaborate Mars surface filming studio somewhere in China. Just look how clean their rover, not a speck of dust or sand on it. And, if these are real photos, then this is the biggest achievement for China to brainwash their citizens. So why they have to blur out both sides of the photos",
        "good": "4",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "Dtock76",
        "time": "20 May, 2021",
        "context": "China has surpassed the US so quickly it is amazing and shows us our so called democracy is flawed. While       \nwe have fraudulent elections here they don’t even bother with them. Look at their economy and technology! China will be the first to land a man on Mars the red planet 🇨🇳.",
        "good": "8",
        "bad": "6",
        "replies": [
            {
                "user_name": "BigPapaD",
                "time": "20 May, 2021",
                "context": "It sounds to me like you should move to China.  You are one of their best supporters!",
                "good": "3",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "Dtock76",
                        "time": "20 May, 2021",
                        "context": "I’m just saying that they may have a better way.",
                        "good": "3",
                        "bad": "1",
                        "replies": [
                            {
                                "user_name": "BigPapaD",
                                "time": "20 May, 2021",
                                "context": "Maybe in your world.  But in mine, I see them as oppressive.  Theirs is an intelligent and hardworking people.  Yet the government seems to think they know better and go to extreme efforts to control thought.  If you disagree with them, you are imprisoned and/or executed.  It frustrates me that we in the US buy so much from China.  The profits from these purchases have funded their military and their space program.  And in time, I believe both will be used against us.  With that said, currently their technology is not equal to ours.  However through intellectual property theft, that is quickly changing.  Frankly, the Chinese leadership are not to be trusted.  These are not good and decent people.",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "JoeLied2000DiedLOLdemdems",
                "time": "20 May, 2021",
                "context": "And the first noodle house and laundry.",
                "good": "1",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "Dtock76",
                        "time": "20 May, 2021",
                        "context": "...staffed by Americans. They don’t do that work any more. Many Chinese in America are highly educated and prosperous.",
                        "good": "1",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "JoeLied2000DiedLOLdemdems",
                                "time": "20 May, 2021",
                                "context": "Pssst . chinese chinese not American chinese . Now get some rest xi",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "error": "error"
    },
    {
        "user_name": "alwaysright1",
        "time": "20 May, 2021",
        "context": "Wow... oh wait!! Isn't that a tank running over a college student?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "giancarlo70",
        "time": "20 May, 2021",
        "context": "“Should we wake him up?”\n\n“Nah, don’t even tell Joe, it won’t make a difference and he’ll be confused”",
        "good": "6",
        "bad": "2",
        "replies": [
            {
                "user_name": "macquarie",
                "time": "20 May, 2021",
                "context": "For some reason your comment made me think about not waking Hitler up on D-Day... \nWe all know the result of that action.",
                "good": "0",
                "bad": "1",
                "replies": []
            },
            {
                "user_name": "lycopine",
                "time": "20 May, 2021",
                "context": "If the OOFF** was told, he'd think NASA was probing the sea...\n\n**obese orange faced fuhrer",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "lagerfeld1",
        "time": "20 May, 2021",
        "context": "If the Chinese screws in their spacecraft are anything like the Chinese screws that I bought at the hardware store, the heads will snap off before you can tighten them completely.",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Señorita-Fox",
        "time": "20 May, 2021",
        "context": "Photoshopped ?",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "rubiks6",
        "time": "20 May, 2021",
        "context": "Still no signs of life?",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "dividedwefall133",
        "time": "20 May, 2021",
        "context": "The Chinese rover is expected soon to meet up with the U.S.'s rover. I hope that the U.S. rover is wearing a mask when it turns over all the scientific work it has completed to the Chinese. ",
        "good": "7",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "texas112",
        "time": "20 May, 2021",
        "context": "Probably carried the China virus to Mars. Way to go Chinese!",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "prdog",
        "time": "20 May, 2021",
        "context": "Well there goes the neighborhood. ",
        "good": "9",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "veej157",
        "time": "20 May, 2021",
        "context": "Copy...copy...copy..    anything original?    aside from a virus to use against us",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "believenoone",
        "time": "20 May, 2021",
        "context": "I bet they stole the technology to do it.",
        "good": "15",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "Sleepydwarf",
        "time": "20 May, 2021",
        "context": "That's years of stealing our secrets and Obama's help.",
        "good": "12",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "realist12345678",
        "time": "20 May, 2021",
        "context": "Well done China!\nCredit where credit is due. \nThe more exploration vehicles that are out there, the better.\nAnd for those who are saying it's just a copy of our latest one, no, it's not.\nA simple look at the photo will tell you that.",
        "good": "0",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "liberalsaretheworst190",
        "time": "20 May, 2021",
        "context": "All built by 6 yr olds",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "#LET'S_GO_BRANDON!",
        "time": "20 May, 2021",
        "context": "Earth has reddish clay that look a lot like Mars.  Studio Mars.",
        "good": "6",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bear_creek_angus",
        "time": "20 May, 2021",
        "context": "Are they dispersing their new virus on Mars yet or are they waiting until Elon lands?",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "enterusernamehere",
        "time": "20 May, 2021",
        "context": "Actually, if you look closely you can see these are just photos from the atoll they converted to a military base in the south pacific.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "philly805",
        "time": "20 May, 2021",
        "context": "You can thank Hunter Biden for selling China a spare rover.",
        "good": "9",
        "bad": "1",
        "replies": [
            {
                "user_name": "lycopine",
                "time": "20 May, 2021",
                "context": "And thank Reagan for secretly arming Iran...",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "philly805",
                        "time": "20 May, 2021",
                        "context": "Those weapons are probably rusting somewhere now.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "lycopine",
                                "time": "20 May, 2021",
                                "context": "They weren't when hundreds of thousands of people were being slaughtered. \nAnd selling weapons to an avowed enemy is treason too.",
                                "good": "0",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "philly805",
                                        "time": "20 May, 2021",
                                        "context": "So Hunter Biden gets a pass because Reagan was evil.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": [
                                            {
                                                "user_name": "lycopine",
                                                "time": "20 May, 2021",
                                                "context": "Since when did Hunter sell a Mars rover to China per your false post?",
                                                "good": "0",
                                                "bad": "0",
                                                "replies": [
                                                    {
                                                        "user_name": "philly805",
                                                        "time": "20 May, 2021",
                                                        "context": "3 years ago.",
                                                        "good": "0",
                                                        "bad": "0",
                                                        "replies": [
                                                            {
                                                                "user_name": "lycopine",
                                                                "time": "20 May, 2021",
                                                                "context": "Oh. Your claim is not backed by any evidence. Mine is.",
                                                                "good": "0",
                                                                "bad": "0",
                                                                "replies": [
                                                                    {
                                                                        "user_name": "philly805",
                                                                        "time": "20 May, 2021",
                                                                        "context": "How nice.",
                                                                        "good": "0",
                                                                        "bad": "0",
                                                                        "replies": [
                                                                            {
                                                                                "user_name": "lycopine",
                                                                                "time": "20 May, 2021",
                                                                                "context": "Thank you for proving my 👉",
                                                                                "good": "0",
                                                                                "bad": "0",
                                                                                "replies": []
                                                                            }
                                                                        ]
                                                                    }
                                                                ]
                                                            }
                                                        ]
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "error": "error"
    },
    {
        "user_name": "nancysdentureadhesive",
        "time": "20 May, 2021",
        "context": "We had a mission just this amazing back in 1997!",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "CyanFlame",
        "time": "20 May, 2021",
        "context": "They'll share images from their rover but not of the lab.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "CyanFlame",
        "time": "20 May, 2021",
        "context": "Our rover should give theirs a virus",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "bikerun",
        "time": "20 May, 2021",
        "context": "Seems like the US landed another rover on Mars, curtesy of China.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "bsnoone828",
        "time": "20 May, 2021",
        "context": "Oh goody, except the US landed Pathfinder on Mars almost 25 years ago and sent pics back.",
        "good": "5",
        "bad": "1",
        "replies": [
            {
                "user_name": "lycopine",
                "time": "20 May, 2021",
                "context": "The JPL Viking Probe did that in 1976 so you are a little behind in history",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "simplystateit",
        "time": "20 May, 2021",
        "context": "The photo from Zhurong Mars rover isn’t even in color. Question..: the photo broadcasted at the local Chinese mall... did their rover landing also include a helicopter/drone to snap the photo, and in color?",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "stop_lying1234",
        "time": "20 May, 2021",
        "context": "With the amount of $$ they've made off of covid they'll be the first to the SUN I hope",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "qta",
        "time": "20 May, 2021",
        "context": "it looks like the background of an old movie. Godzilla!!! oh sorry that was Japan",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "thered,whiteandtheblue!",
        "time": "20 May, 2021",
        "context": "Harbor Freight Tools would be proud that their rover landed",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "toomanywars",
        "time": "20 May, 2021",
        "context": "Never knew that the Soviets were the first to land on Mars.  Certainly there was no enthusiasm for western media to broadcast the success during the cold war.",
        "good": "0",
        "bad": "2",
        "replies": [
            {
                "error": "error"
            }
        ]
    },
    {
        "user_name": "unctxiii",
        "time": "20 May, 2021",
        "context": "Then there were more than I expected so soon!!!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "GreenTooth",
        "time": "20 May, 2021",
        "context": "Hoax. Photos were probably taken in Mongolia. Rover made with scrap parts sourced on Alibaba.",
        "good": "9",
        "bad": "5",
        "replies": []
    },
    {
        "user_name": "PurpleDog",
        "time": "20 May, 2021",
        "context": "Are they looking for a place to set up a Chinese restaurant?",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "zulu302291",
        "time": "20 May, 2021",
        "context": "Them thar Chinamen are good at using our technology.",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ehwtfynot",
        "time": "20 May, 2021",
        "context": "Has anyone other than China confirmed the landing is real or is this just another of their many hoaxes.  Will they soon release a photo of people hovering on Mars just as on Earth?",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "duraman",
        "time": "20 May, 2021",
        "context": "If the Chinese rover would have landed close to the U.S. rover and took a picture of it, you would see \"Made in China\" stamped on the side.",
        "good": "6",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "GoldPlane",
        "time": "20 May, 2021",
        "context": "these images clearly show Martians to be black (not green).",
        "good": "5",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "jimr1961",
        "time": "20 May, 2021",
        "context": "Wanna bet it tries to shoot down NASA's drone?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Freedomlover223",
        "time": "20 May, 2021",
        "context": "China is like a big scab on the earth.",
        "good": "6",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "SwordofDamocles1",
        "time": "20 May, 2021",
        "context": "I hope the Martians are vaccinated.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "razecs",
        "time": "20 May, 2021",
        "context": "The China bot will hunt down our bot and zap it. Biden will then call Xi....\n\n\"Hi Master Xi? Yes, this is Joe.....no....Joe Biden.....the president of the america.....never mind. I called about the thing. Yes, the Mars thing. Come on man, that's not fair.....well we didn't get in your way.....we were....ok, ok I'm sorry. We'll just send another one.....ok.....ok.....I love you too\"",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "it's-ame,mario!",
        "time": "20 May, 2021",
        "context": "Cool. Hopefully the radar shows us something about the interior of the planet. Maybe It will find water underground.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "theblackronin",
        "time": "20 May, 2021",
        "context": "This was made possible by the contributions of the Clinton Crime Family. ",
        "good": "12",
        "bad": "0",
        "replies": [
            {
                "user_name": "lycopine",
                "time": "20 May, 2021",
                "context": "The Iranian weapons program was jump started by Reagan's secret sales too. And daddy Bush helped Hussein in Iraq build those WMDs...",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "cj134",
        "time": "20 May, 2021",
        "context": "If the two ever find each other in that vast Martian desert they may multiply.\n\"A whole new world, a whole new world\", they'll be together.\nWhat we have now on Mars are two lonely droids one with a toy helicopter scanning the surface unaware of each other, even their masters keep it a secret from them, will they discover the greatest thing to ever happen on Mars in a million years or will they find each other in that vast martian wasteland?",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "1stAmendment2019",
        "time": "20 May, 2021",
        "context": "Great..now Mars has corona virus.",
        "good": "5",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "ThatOneHumanBean413",
        "time": "20 May, 2021",
        "context": "That rover will drive 20 miles under the speed limit with it's blinker on. ",
        "good": "22",
        "bad": "2",
        "replies": [
            {
                "user_name": "unctxiii",
                "time": "20 May, 2021",
                "context": "Indeed it is a funny world",
                "good": "2",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "metoounlessyouaccusealib",
        "time": "20 May, 2021",
        "context": "China will still be deploying rovers while Elon has built a Mars Base of thousands of people",
        "good": "5",
        "bad": "1",
        "replies": [
            {
                "user_name": "JohnGreen11",
                "time": "20 May, 2021",
                "context": "We'd better get to work or they'll beat us to it & try to claim it.",
                "good": "3",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "Hondoxp589",
                "time": "20 May, 2021",
                "context": "China Joe will send the EPA to conduct a 10 year environmental impact study on SpaceX's Star Base, effectively shutting them down.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "protrump",
        "time": "20 May, 2021",
        "context": "Are we looking at stolen American Technology on display here?  This all looks a little like  copy cat stuff.",
        "good": "7",
        "bad": "1",
        "replies": [
            {
                "user_name": "it's-ame,mario!",
                "time": "20 May, 2021",
                "context": "How so? Making robots isn't that hard. It's just expensive to launch the to another planet.",
                "good": "3",
                "bad": "3",
                "replies": []
            }
        ]
    },
    {
        "user_name": "gozerisinthefridge",
        "time": "20 May, 2021",
        "context": "If that rover is anything like my Chinese weed-wacker, it won't be taking many more pictures...",
        "good": "3",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "thefallen#13262",
        "time": "20 May, 2021",
        "context": "Made in China , won't last a week .",
        "good": "4",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "theraven666",
        "time": "20 May, 2021",
        "context": "So now I suppose we'll learn if Covid can survive in the harsh Mars atmosphere as well as it did on Earth.",
        "good": "4",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "usthunder",
        "time": "20 May, 2021",
        "context": "They should broadcast the first BattleBots on Mars.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ThatOneHumanBean413",
        "time": "20 May, 2021",
        "context": "I wonder if their rovers data is encrypted. If not hijack it and joy ride on the surface of Mars. ",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "OliveHammer",
        "time": "20 May, 2021",
        "context": "Thank God there aren't any roads that they would have to drive on",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "InProvidence",
        "time": "20 May, 2021",
        "context": "They released COVID virus into the Martian atmosphere to study how it morphs over time there.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "tokenposter",
        "time": "20 May, 2021",
        "context": "We better be careful, the planets could fall like dominoes to communist expansion...",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dwsoregon922",
        "time": "20 May, 2021",
        "context": "Always running 2nd or third, but mostly last. How's it feel China? There is always a \"been there , done that\" coming from this side.",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Sbatti",
        "time": "20 May, 2021",
        "context": "Always wonder how SpaceX would ever get one of those rockets of theirs to land upright on the moon.  Turns out they plan to rent a landing spot at the upcoming China/Russia lunar base.",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "davidcjones45622",
        "time": "20 May, 2021",
        "context": "Another decade and PRC will dominate Earth orbit, lunar colonization and deep space exploration.",
        "good": "1",
        "bad": "1",
        "replies": [
            {
                "user_name": "firstnlast",
                "time": "20 May, 2021",
                "context": "i project the PRC will not be in existence in a decade..",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "davidcjones45622",
                        "time": "20 May, 2021",
                        "context": "Posters with childish screen names post the dumbest things.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "notnowdarnit",
        "time": "20 May, 2021",
        "context": "How did China get American technology?",
        "good": "3",
        "bad": "0",
        "replies": [
            {
                "user_name": "lerenard",
                "time": "20 May, 2021",
                "context": "Diversity hiring and illegal hacking.",
                "good": "2",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "YaCan'tfixstupid203",
                "time": "20 May, 2021",
                "context": "Hacking into our computer's",
                "good": "2",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "statescrew",
        "time": "20 May, 2021",
        "context": "China is advancing rapidly do to their ability to be great hackers. But then , the world gives it to them as well and they give the world a virus.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "lerenard",
        "time": "20 May, 2021",
        "context": "Zhurong is going to challenge Perseverance to a duel at high noon. I wonder which one will draw its laser gun first?",
        "good": "4",
        "bad": "0",
        "replies": [
            {
                "user_name": "maryah",
                "time": "21 May, 2021",
                "context": "The United States and China are fighting with each other. It is better to develop a time machine to change the history. That's more interesting.",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "grizzlybear",
        "time": "20 May, 2021",
        "context": "And who took the picture?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "shaun'sheartbeat",
        "time": "20 May, 2021",
        "context": "Where is my opinion?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "shaun'sheartbeat",
        "time": "20 May, 2021",
        "context": "Bacteria on Mars = Life\nHeartbeat on Earth = TERMINATED",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "maryah",
        "time": "21 May, 2021",
        "context": "The competition between the United States and China focuses on science and technology. As far as I know, the Chinese Communist Party Congress has also increased its funding support for science and technology and the number of graduate students in school. The United States and China have engaged in a science and technology war. This may be a good thing. Because world peace does not want to see a nuclear war between the United States and China. The United States and China may cooperate. Cooperate in time weapons, anti-gravity aircraft, quantum information encryption, and artificial intelligence.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "Twocats2",
        "time": "20 May, 2021",
        "context": "I'm sick of looking at rocks and more rocks. How about starting a base for once and give people something they can say their tax dollars built. And please pick up your trash as you go NASA, SpaceX, China, Russia, and who ever else.",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "shaun'sheartbeat",
        "time": "20 May, 2021",
        "context": "Heartbeat in USA = TERMINATION\nBacteria on Mars = LIFE",
        "good": "3",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "shaun'sheartbeat",
        "time": "20 May, 2021",
        "context": "Find bacteria on Mars and it's LIFE!  Detect a heartbeat on Earth and it is not... Hmmm strange?",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dan5047628",
        "time": "20 May, 2021",
        "context": "Dirt and Rocks cool, same thing we found. Who would have guessed.",
        "good": "3",
        "bad": "0",
        "replies": [
            {
                "user_name": "djohnson",
                "time": "21 May, 2021",
                "context": "But there's planted a flag, THIS PLANET BELONG THE CHINA. NOT TRESSPASSING.  Trespassers will be shot.",
                "good": "1",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "maryah",
                        "time": "21 May, 2021",
                        "context": "Yes it is. China wants to build a space empire. Now China has the ability to send a spacecraft to any planet in the solar system and take pictures of remote-controlled vehicles for landing.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "djohnson",
        "time": "21 May, 2021",
        "context": "I hope the chinese thank America , with all that the chinese  have stolen , it made this possible.",
        "good": "3",
        "bad": "0",
        "replies": [
            {
                "user_name": "maryah",
                "time": "21 May, 2021",
                "context": "Scientific development seems to have reached a bottleneck. As long as the solar system is the moon and Mars, people on earth can invade. Beyond the solar system, humans cannot conquer.\nChina sees the backwardness of American technology. Chinese media reported that the development of U.S. aerospace technology was halting, so China caught up with the United States. The United States does not like to keep science and technology secret as much as China. Therefore, American science and technology have been stolen by China, and China will not thank the United States for sharing knowledge. Apart from stealing science and technology from other countries, they will not innovate at all. China just copied American science and technology.",
                "good": "3",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "firstnlast",
        "time": "20 May, 2021",
        "context": "probably fake like everything else from china..",
        "good": "4",
        "bad": "1",
        "replies": [
            {
                "user_name": "dan5047628",
                "time": "20 May, 2021",
                "context": "and NASA",
                "good": "0",
                "bad": "3",
                "replies": []
            }
        ]
    },
    {
        "user_name": "lerenard",
        "time": "20 May, 2021",
        "context": "Red Planet. Red Rover.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "OliveHat",
        "time": "20 May, 2021",
        "context": "Made in china? Hopefully the battery on it will last.",
        "good": "2",
        "bad": "0",
        "replies": [
            {
                "user_name": "statescrew",
                "time": "20 May, 2021",
                "context": "It should , after all , they probably pilfered it.",
                "good": "2",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "SueStewart951",
        "time": "20 May, 2021",
        "context": "Photo shopped ",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "SueStewart951",
        "time": "20 May, 2021",
        "context": "Probably bring back a new bug. Virus that is. ",
        "good": "2",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "dune272",
        "time": "20 May, 2021",
        "context": "Headlines should read \"Stolen American technology puts China rover on Mars\"",
        "good": "6",
        "bad": "0",
        "replies": [
            {
                "user_name": "dan5047628",
                "time": "20 May, 2021",
                "context": "Stolen??? Bill Clinton gave them our missile guidance technology",
                "good": "4",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "Hondoxp589",
        "time": "20 May, 2021",
        "context": "Like it or not, China is proving efficiency in space exploration. They may have copied some technology but their rocket, and probe design is home grown. The three part space probe; orbiter, lander and rover are first. It is also important to note they stuck the landing on their first try. This should be a signal to America to step it up or get left behind.\nAnother option would be to combine our efforts like we did with the Russians. If we want to get to Mars we need to settle our differences on Earth first.",
        "good": "8",
        "bad": "2",
        "replies": [
            {
                "user_name": "dan5047628",
                "time": "20 May, 2021",
                "context": "6000 years of civilization and it hasn't happened yet",
                "good": "3",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "maryah",
                "time": "21 May, 2021",
                "context": "Is it difficult to land on Mars? As long as they have mastered the basic rocket launch technology and flight trajectory adjustment technology, any country can do it. Maybe you think the difficulty lies in the few minutes the probe enters the Martian atmosphere. If high-temperature-resistant and high-temperature resistant materials are developed to protect the Mars rover, it will not be difficult. Any country can do it.",
                "good": "1",
                "bad": "2",
                "replies": [
                    {
                        "user_name": "Hondoxp589",
                        "time": "24 May, 2021",
                        "context": "Yes, it is very very difficult to land on Mars. Success rate is less then %40.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "lerenard",
        "time": "20 May, 2021",
        "context": "There's something zhurong with this whole China-Mars scenario.",
        "good": "2",
        "bad": "1",
        "replies": [
            {
                "user_name": "carlbastos",
                "time": "21 May, 2021",
                "context": "What is zhurong. I'm Chinese, is this supposed to a stupid pun like kungflu? ",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "cocobird",
        "time": "21 May, 2021",
        "context": "Chinese Americans who struggled to migrate to US now become ?????\n\nMany other Americans think that they are \"Chinese spies\" but most of their children cannot even speak Chinese. Many Chinese in China now think them are traitors.",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "maryah",
                "time": "22 May, 2021",
                "context": "As Americans, we must love America. So we need Americans who love America. \nThose Chinese came to the United States. They should love America. The vast majority of Chinese-Americans love America. As long as a few Chinese learn American science and technology, they join communist China. This kind of behavior is shameful. But communist China praised such traitors. \nTherefore, it is necessary to strengthen the legal sanctions against traitors.",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "dan5047628",
        "time": "21 May, 2021",
        "context": "I foresee Chinese forced labor camps on Mars in 30-40 years.\n Work or be thrown out into the atmosphere.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "Notmuchtimeleft1",
        "time": "23 May, 2021",
        "context": "Wonder what the Biden family made on their China investments? ",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "raptor02",
        "time": "24 May, 2021",
        "context": "Ya well been there, done that, bought the t-shirt USA!!!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "maryah",
        "time": "22 May, 2021",
        "context": "This is the most dangerous time in United States! Whites must stop racial discrimination between Asian-Americans and other ethnic groups. Since the outbreak of COVID-19 in the United States, there has been racial discrimination in this country. United States is divided! This behavior must be stopped.     \n       Although Chinese Uighurs practice forced labor. But 85% of Uighurs still agree to accept the rule of the Chinese Communist Party. Racial discrimination and ethnic division will only prevent us from fighting communist China. All Americans must unite to fight against communist China.",
        "good": "0",
        "bad": "6",
        "replies": [
            {
                "user_name": "dan5047628",
                "time": "24 May, 2021",
                "context": "Americans need to get our Blacks and white Liberals under control first. The are way more dangerous then China",
                "good": "1",
                "bad": "0",
                "replies": []
            }
        ]
    }
]