[
    {
        "user_name": "alexsc085",
        "time": "1 September, 2022",
        "context": "Really now! Who’s fault is this? We all allowed the takers to outnumber the givers..Now they rule….",
        "good": "3",
        "bad": "1",
        "replies": [
            {
                "user_name": "thechityousay",
                "time": "3 September, 2022",
                "context": "We didn't allow anything.\nThe takers just took.\n\nOr as We like to say\" WE Was robbed\"",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "HLN",
        "time": "1 September, 2022",
        "context": "Newt Gingrich….. a very smart guy.",
        "good": "5",
        "bad": "4",
        "replies": [
            {
                "user_name": "jdmarvel",
                "time": "1 September, 2022",
                "context": "NOT!!",
                "good": "2",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "error": "error"
    },
    {
        "user_name": "Dave24242",
        "time": "1 September, 2022",
        "context": "Trump stole government property and outright lied to the DoJ about his returning it and his full cooperation....and the corruption of the DoJ that is the problem.  Newt is slimy partisan hack!  At least FoxNews has a solitary voice in Steve Doocy who understands and has the courage to admit to such.",
        "good": "6",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "rotordiskpilot",
        "time": "1 September, 2022",
        "context": "Apparently the DOJ is in panic mode due to the recent resignations and whistleblowers coming forward.  Somebody's burning the midnight oil drafting yet another propaganda news article of condemnation against Trump because the DOJ and FBI have apparently gone the way of lamestream media.  Just think, if this leftist regime could pull off an election deception and somehow manage to do anything better than President Trump there could have been a chance the American populace would go along with something \"better\".  But the reality is this leftist activist group in DC is running around with their hair on fire still trying to get Trump.  They haven't had time to think about anything else which is why our border is still unsecure.  They can't stop thinking about Trump!  Seems the left's alignment with terrible agendas and ideologies is there identity.  So, here comes the leftist liberal activist drama team trying yet again to set up election deception 2.0 or whatever they can to keep power and control...and cling to their terrible agendas and ideologies.",
        "good": "22",
        "bad": "4",
        "replies": [
            {
                "user_name": "nathanforrest",
                "time": "1 September, 2022",
                "context": "Maybe, but Trump still took stuff that did not belong to him.  That is called stealing and it is a crime.",
                "good": "10",
                "bad": "10",
                "replies": [
                    {
                        "user_name": "let'stalk",
                        "time": "1 September, 2022",
                        "context": "Read the Presidential Records Act - - you will quickly realize how ignorant your post is.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "rotordiskpilot",
                        "time": "2 September, 2022",
                        "context": "You mean the documents he declassified?  Y'all seem to not be aware of that part.  The smell of leftist desperation is getting stronger by the day.  But y'all keep doing what you're doing.  It's only making Trump more electable because the left just can't contain their insanity and desperation.",
                        "good": "5",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "marky750",
                                "time": "3 September, 2022",
                                "context": "Catch up son.  Trump already admitted he didnt declassify anything.  Nobody can look at boxes, waive their hand and say 'declassified'.  There are procedures that have been in places for decades.   He will soon be peeing in a stainless steel sink/toilet bowl combo and eating honey buns from the prison commissary.",
                                "good": "0",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "rotordiskpilot",
                                        "time": "3 September, 2022",
                                        "context": "You're nervous aren't you?  We can tell by the outlandish rhetoric but it's safe to say you probably aren't going to watch President Trump's Save America rally tonight are you?  Keep up the creative writing efforts.  I'm sure someone somewhere appreciates them.  Thanks for stopping by!",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "user_name": "trkyhntr",
                        "time": "4 September, 2022",
                        "context": "So when do you think Garland will bring him up on that charge?",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "drhoot",
                        "time": "7 September, 2022",
                        "context": "Evidence, brother, evidence otherwise your venting hyperbolic nonsense!",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "minnower",
                "time": "1 September, 2022",
                "context": "This article is Newt at his usual. Obfuscate and lie. Nobody would obtain a subpoena to search Trump's beach house if Trump did not steal documents.",
                "good": "0",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "patnsal",
                        "time": "2 September, 2022",
                        "context": "You’re kidding, right? You can’t possibly be so naive to believe that. Democrats will stop at nothing, nothing, nothing, in order to keep Trump from running.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "marky750",
                                "time": "3 September, 2022",
                                "context": "Trump has done everything to stop any chance of him being elected for anything.",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "bulldog22",
                "time": "2 September, 2022",
                "context": "The Democrats are so focused on destroying Thump that they fail to see that DeSantis is a much more of a threat to them & their policies than Trump. DeSantis will do everything Trump would have done plus go after them on the social issues which Trump generally avoids. Woke companies, CRT, liberal school boards & teachers unions will be on the DeSantis agenda.",
                "good": "2",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "bulldog22",
                        "time": "2 September, 2022",
                        "context": "PS. DeSantis could serve eight years while Trump would be limited to one term.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "marky750",
                        "time": "3 September, 2022",
                        "context": "Charlie Criss will be sending DeSantis back to his hovel.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "bb7777",
        "time": "1 September, 2022",
        "context": "Newt the creator of the swamp.  Probably the worst thing that has ever happened to the American people.\nHe sleeps well on his pile of lobbyists money while we all have to kill ourselves for mere pennies.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "PeterG",
        "time": "1 September, 2022",
        "context": "Let’s face it … Garland is still upset that he’s not on the Supreme Court so he’s taking it out on his nemesis.",
        "good": "22",
        "bad": "4",
        "replies": [
            {
                "user_name": "challenger4016",
                "time": "1 September, 2022",
                "context": "Sure. He's upset that Mitch McConnell prevented him from being on the Supreme Court, so he's taking it out on McCon. . .  \n\nWAIT a minute! Garland and Wray and the FBI and the DOJ are ALL just following the Rule of Law here. If Trump were anybody else (like you or me), he would be sitting in a jail somewhere right now. If anything, Garland et al are treating Trump with too much deference because he's a former president!\n\nI encourage you to get serious. These are inflammatory times, but we can turn the heat down if we all really think deeply . . . and communicate thoughtfully. Trump doesn't deserve the adulation that he's been getting; his ardent followers (the \"semi-fascists\" that Biden referenced) are better than that.",
                "good": "6",
                "bad": "10",
                "replies": [
                    {
                        "user_name": "plumbob1234619",
                        "time": "1 September, 2022",
                        "context": "nonsense.",
                        "good": "1",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "challenger4016",
                                "time": "1 September, 2022",
                                "context": "Can you write more? Why is it nonsense? What part of it is nonsense? If it's nonsense, what is \"sense\"? The more specific and comprehensive you are, the better.",
                                "good": "0",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "r.w.b!!also460",
                                        "time": "1 September, 2022",
                                        "context": "Were the DOJ and FBI messed up is when they started lying and lied about the Russian Collusion Hoax. \"Fact\" Once you start down a path of corruption and lies it's hard to take the straight and narrow. They have no choice but to keep lying to cover up their bias, and lies and corruption.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": [
                                            {
                                                "user_name": "challenger4016",
                                                "time": "1 September, 2022",
                                                "context": "Thanks for the specifics. How did the DOJ and FBI lie about the Russian conspiracy and collaboration \"hoax\"? Lots of available facts and evidence out there to discuss! Looking forward to it.",
                                                "good": "0",
                                                "bad": "0",
                                                "replies": []
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "user_name": "let'stalk",
                        "time": "1 September, 2022",
                        "context": "Did you say the same about Hillary???",
                        "good": "0",
                        "bad": "1",
                        "replies": []
                    },
                    {
                        "user_name": "smokeyj",
                        "time": "2 September, 2022",
                        "context": "So you are so dedicated in the DOJ following the Rule of Law.  That is hilarious as it seems the rule of law only applies when you hate conservatives and wish to see them indicted. Unfortunately, you are ok with clinton and comey mishandling classified docs and leaking classified info to people without clearances.  Very duplicitous of you. Slow joe called half of Americans semi-fascists and all you leftist liberals are ok with that.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "you'reallselfishidiots",
                "time": "1 September, 2022",
                "context": "Except trump didn't stop him. McConnell did. Trump wasn't even a politician yet. Do you ever get tired of being wrong?",
                "good": "1",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "PeterG",
                        "time": "2 September, 2022",
                        "context": "I didn’t mention anyone in particular. You jumped to the wrong conclusion.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "cumpari",
                "time": "1 September, 2022",
                "context": "Thank God he is not.",
                "good": "1",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "marky750",
                "time": "3 September, 2022",
                "context": "Who is his nemesis?     Is doing the job you were hired to do taking something out on a criminal?",
                "good": "1",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "PeterG",
                        "time": "4 September, 2022",
                        "context": "Like they should have done to Hillary, right ?",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "drhoot",
                "time": "7 September, 2022",
                "context": "Right on PeterG===the very fact of Garlands revenge tour---the man is a very evil individual that would cross the line as a trusted public servant and perhaps bring down our whole Democracy.  ",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "Toro68",
        "time": "1 September, 2022",
        "context": "Gingrich is part of the most corrupt, lying media outlet in American history. This media is complicit in creating hate and misery in our citizenry. Of course, it's all for making money. Viewers are lured in by fake sensationalism and lies. Some unstable viewers even become violent as they trashed our Capitol and attacked policemen. A few sick media consumers even become mass killers. Advertisers pay big bucks for eyeballs. The shouting, lying commentators like Gingrich get fat fees and lucrative compensation deals.",
        "good": "12",
        "bad": "13",
        "replies": []
    },
    {
        "user_name": "dorakichi",
        "time": "1 September, 2022",
        "context": "Hahahahahahahahahahahahaha!!!!!!!!!!!!!!!!!!!!!!",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "monga1",
        "time": "1 September, 2022",
        "context": "He's blaming every Republican cause he didn't get on Supreme Court.",
        "good": "16",
        "bad": "4",
        "replies": [
            {
                "user_name": "you'reallselfishidiots",
                "time": "1 September, 2022",
                "context": "Looks like Tucker must have given you your marching orders. Lol.",
                "good": "2",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "marky750",
                "time": "3 September, 2022",
                "context": "Got any quotes from him or are you just parroting as trained?",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "usefacts",
        "time": "1 September, 2022",
        "context": "The Hunter Biden coverup is all you need to know to understand just how corrupt this administration is. Starts with DOJ and FBI. Brandon is not just the worst President ever, the the worse US Citizen!",
        "good": "2",
        "bad": "2",
        "replies": [
            {
                "user_name": "grazer",
                "time": "1 September, 2022",
                "context": "He makes Benedict Arnold look good, not just Jimmy Carter.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "yabbadabbadu",
                        "time": "1 September, 2022",
                        "context": "Donnie makes the Pillsbury Doughboy look emaciated.",
                        "good": "0",
                        "bad": "1",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "marky750",
                "time": "3 September, 2022",
                "context": "what coverup?  Rudy G. Has a copy of the hard drive with all the proof.\n\nMaybe Rudy is hiding it at Mar a Lago.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "usefacts",
        "time": "1 September, 2022",
        "context": "Well yes, there is corruption in the DOJ and the FBI. Garland has an ax to grind. He was passed over for the Supreme Court. You don't think that impacts his judgement??? Putting such a person in the Attorney General  slot is just an indication of what's going on in this administration. Corrupt to the core. Brandon has no problem with such issues; his whole family is corrupt.",
        "good": "6",
        "bad": "0",
        "replies": [
            {
                "user_name": "yabbadabbadu",
                "time": "1 September, 2022",
                "context": "He was passed over, like Donnie was passed over for Pope.",
                "good": "0",
                "bad": "2",
                "replies": [
                    {
                        "user_name": "smokeyj",
                        "time": "2 September, 2022",
                        "context": "Umm, he is not a justice of the supreme court so guess he was passed over.  LOL",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "marky750",
                "time": "3 September, 2022",
                "context": "What crimes is he prosecuting that didn't happen?",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "trkyhntr",
                        "time": "4 September, 2022",
                        "context": "OK, fair question.  Now answer this one.  What crimes is he actually prosecuting?",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "marky750",
                                "time": "5 September, 2022",
                                "context": "Since no Grand Jury has yet handed down an indictment on any of a variety of potential crimes.  You can't just say \"Monday.  Let's pull something out of the hat to prosecute\".\nSo, back to you, what crimes is he prosecuting that didn't happen?",
                                "good": "0",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "trkyhntr",
                                        "time": "6 September, 2022",
                                        "context": "The obvious answer is \"none.\"  Since there have been no charges filed,  there is no prosecution.  Therefore he seems to have a case in search of evidence.  Any evidence.  Prosecution until he thinks he has a case will be in the news media.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": [
                                            {
                                                "user_name": "marky750",
                                                "time": "6 September, 2022",
                                                "context": "yeah, sure.  Hey, since you have been turned anti America, when you leaving?",
                                                "good": "0",
                                                "bad": "0",
                                                "replies": [
                                                    {
                                                        "user_name": "trkyhntr",
                                                        "time": "6 September, 2022",
                                                        "context": "I have been an American since I was born. Never been turned.",
                                                        "good": "0",
                                                        "bad": "0",
                                                        "replies": [
                                                            {
                                                                "user_name": "marky750",
                                                                "time": "6 September, 2022",
                                                                "context": "So they have told you.",
                                                                "good": "0",
                                                                "bad": "0",
                                                                "replies": []
                                                            }
                                                        ]
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "tps4999",
        "time": "1 September, 2022",
        "context": "Imagine if this hack Garland had made it to the Court. Jesus did we dodge a bullet there.",
        "good": "4",
        "bad": "3",
        "replies": [
            {
                "user_name": "dimebagdonnie",
                "time": "1 September, 2022",
                "context": "Didn't the Supreme Court reject all of tRumps election fraud cases?",
                "good": "4",
                "bad": "2",
                "replies": [
                    {
                        "user_name": "muaddib015197",
                        "time": "1 September, 2022",
                        "context": "No.\nThey refused to hear them....so they were not ever seen.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "challenger4016",
                                "time": "1 September, 2022",
                                "context": "Why did they refuse to hear them?",
                                "good": "0",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "smokeyj",
                                        "time": "2 September, 2022",
                                        "context": "Because the supreme court refused to become embroiled  in anything that would give the impression that they would have swayed an election.  Not so with our vaunted fibbies as they waded hip deep in the last election and did indeed change the outcome of the POTUS election with the suppression of the hunter biden laptop.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": [
                                            {
                                                "user_name": "challenger4016",
                                                "time": "2 September, 2022",
                                                "context": "As I read about it, it seems that SCOTUS refused to hear the cases because the merits of the cases weren't worth considering. As to not wanting to sway an election, the election already happened. It wasn't about that for SCOTUS.",
                                                "good": "0",
                                                "bad": "0",
                                                "replies": [
                                                    {
                                                        "user_name": "smokeyj",
                                                        "time": "3 September, 2022",
                                                        "context": "Yep, it was like after we went through weeks of counting hanging chads in Fl. the election had not been called by the electoral collage.",
                                                        "good": "0",
                                                        "bad": "0",
                                                        "replies": [
                                                            {
                                                                "user_name": "challenger4016",
                                                                "time": "3 September, 2022",
                                                                "context": "smokeyj, I think we're both right:-). From what I can research, SCOTUS turned down Trump's election fraud cases first on December 8, 2020 but then (maybe for the last time) on February of 2021. The electoral college was counted and certified on December 14, 2020. \n\nThat said, it appears that SCOTUS didn't find the case constitutionally valid, so it wasn't about not wanting to influence the election. “The State of Texas’s motion for leave to file a bill of complaint is denied for lack of standing under Article III of the Constitution,” the Supreme Court’s order reads. “Texas has not demonstrated a judicially cognizable interest in the manner in which another State conducts its elections. All other pending motions are dismissed as moot.”",
                                                                "good": "0",
                                                                "bad": "0",
                                                                "replies": []
                                                            }
                                                        ]
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "muaddib015197",
                "time": "1 September, 2022",
                "context": "no doubt about it.....a big PHEW!",
                "good": "1",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "HPIL",
        "time": "1 September, 2022",
        "context": "amerika's Present Elite Ruing Class are Fighting for their Jobs / Careers ..\n   Fortunately, Mid-Terms will Thwart This\n        and the 20204 Election will ....\nTime for America to Put a FORK In amerika For GOOD ! ",
        "good": "1",
        "bad": "1",
        "replies": [
            {
                "user_name": "yabbadabbadu",
                "time": "1 September, 2022",
                "context": "Thanks Boris",
                "good": "1",
                "bad": "2",
                "replies": []
            },
            {
                "user_name": "marky750",
                "time": "3 September, 2022",
                "context": "When are you leaving?",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "HPIL",
                "time": "5 September, 2022",
                "context": "Lady Justice is CRYing \nover what amerika Garland is Do'ing to America Justice",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "Notsofast809",
        "time": "1 September, 2022",
        "context": "If Newt Gingrich doesn't say things like this, he won't get on Fox.",
        "good": "7",
        "bad": "7",
        "replies": [
            {
                "user_name": "murica572",
                "time": "1 September, 2022",
                "context": "anyone who has their eyes open are saying it.",
                "good": "1",
                "bad": "2",
                "replies": []
            }
        ]
    },
    {
        "user_name": "ilovetheconstitution008",
        "time": "1 September, 2022",
        "context": "'Contract on America' Newt 'The Grinch Who Screwed the Middle Class'? I assume this is a joke.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "gesunde",
        "time": "1 September, 2022",
        "context": "Looking forward to seeing Garland impeached in January along with the most incompetent President of all time JOE BIDEN",
        "good": "4",
        "bad": "2",
        "replies": [
            {
                "user_name": "yabbadabbadu",
                "time": "1 September, 2022",
                "context": "You're going to have to wait, in the meantime the hate filled fat effffff will be in multiple court settings - for our entertainment.",
                "good": "2",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "challenger4016",
                "time": "2 September, 2022",
                "context": "And what has Joe done that warrants impeachment?",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "gesunde",
                        "time": "2 September, 2022",
                        "context": "If you feel Joe Biden has done a great job then you should keep supporting him but I am of the opinion that he has put our country in grave danger with his open border policies, weakening of our military, the reckless withdrawal from Afghanistan that got 13 marines murdered, our financial system is in disarray, high inflation, high oil and gas, use to be energy independent and now back to begging Saudi Arabia to produce more. Depleting our strategic reserves and selling IT to the Chinese. Our country more divided than ever and yes, I blame him as he is the President of the United States. A tyrannical and totally partisan Justice department and a corrupt F.B.I.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "challenger4016",
                                "time": "2 September, 2022",
                                "context": "Thanks for that. I don't see anything that warrants impeachment, but I respect your position. \n\nI do not support Biden in 2024 unless he actually is the strongest Democrat. But I'm definitely against Trump. How about you? If Trump were the Republican candidate, would you vote for him?",
                                "good": "0",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "gesunde",
                                        "time": "2 September, 2022",
                                        "context": "OK. He might be impeached by the House IF the Republicans take over but most certainly not convicted in the Senate. If Every president that lied and had corruption on their coat tails was impeached, then every president would be impeached for sure",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": [
                                            {
                                                "user_name": "challenger4016",
                                                "time": "2 September, 2022",
                                                "context": "I agree that IF Republicans retake the House, they would VERY likely impeach Biden, regardless of actual merit of the case. RE your \"If every president\" sentence, you're probably right! That said, has Biden done anything to warrant the charge of \"treason, bribery, or other high crimes and misdemeanors\"? I don't think so, but I'm open to learning more.",
                                                "good": "0",
                                                "bad": "0",
                                                "replies": [
                                                    {
                                                        "user_name": "gesunde",
                                                        "time": "3 September, 2022",
                                                        "context": "I really feel that we all need to understand the extent of the Hunter Biden Laptop. There seems to be so much information on there that implicates his father but no sense in speculating until there is an agreement to release it all. Should the Republicans take the house in November, no doubt that Laptop will be front and center along with the owner",
                                                        "good": "0",
                                                        "bad": "0",
                                                        "replies": [
                                                            {
                                                                "user_name": "challenger4016",
                                                                "time": "3 September, 2022",
                                                                "context": "What I've read about that laptop suggests much ado about nothing when it comes to Joe. The emails from Burissma are suspect because Russians hacked Burissma and could have stolen the email identification signatures, thus being able to send fake emails that look authentic. And the few emails suggesting that Joe met with Hunter's business contacts are worded in such a way as to be oblique . . . and easily dismissable on Joe's side. But I agree with you that a thorough investigation should be done.",
                                                                "good": "1",
                                                                "bad": "0",
                                                                "replies": []
                                                            }
                                                        ]
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "marky750",
                "time": "3 September, 2022",
                "context": "In a kangaroo court of red criminals?     What would your Articles  Impeachment say?",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "john.lee.pettimore",
        "time": "1 September, 2022",
        "context": "“Wray will never be able to fix the FBI, which is badly broken despite having some of the greatest men & women working there!”\n\n~ President Donald J Trump, Dec. 10, 2019",
        "good": "1",
        "bad": "1",
        "replies": [
            {
                "user_name": "yabbadabbadu",
                "time": "1 September, 2022",
                "context": "\"I will build a great, great wall on our southern border, and Mexico pay for that wall. Mark my words.\" \"If you look at Saddam Hussein, he killed terrorists. I'm not saying he was an angel, but this guy killed terrorists.\" \"I look very much forward to showing my financials, because they are huge.\" \"She does have a very nice figure... If [Ivanka] weren't my daughter, perhaps I'd be dating her.\" \"You could see there was bloody coming out of her eyes. Blood coming out of her wherever.\"",
                "good": "1",
                "bad": "1",
                "replies": []
            },
            {
                "user_name": "marky750",
                "time": "3 September, 2022",
                "context": "who broke it.?",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "yabbadabbadu",
        "time": "1 September, 2022",
        "context": "Too late Newt, Donnie and his defense attorney Bar own that title, now it's time for you to get back to marriage counseling - the thing you know \"best.\"",
        "good": "2",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "cumpari",
        "time": "1 September, 2022",
        "context": "With 6 years persecution It's crystal clear that the swamp is scared in their pants of Trump coming back. They know that Trump is serious about cleaning the rampant America's corruption. But providence is helping Trump standing tall and fighting back. This drives the swamp MAD.",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "grazer",
                "time": "1 September, 2022",
                "context": "No one can say he's not a fighter.",
                "good": "0",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "yabbadabbadu",
                        "time": "2 September, 2022",
                        "context": "Exactly, he's a grifter.",
                        "good": "0",
                        "bad": "1",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "yabbadabbadu",
                "time": "1 September, 2022",
                "context": "How much has Donnie fleeced from you? BTW, your grammar is spectacular - exactly how American's perceive today's cultists.",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "challenger4016",
                "time": "2 September, 2022",
                "context": "Do you not see how corrupt Trump is? Just look at everything he's done and said. All the lies, insults, bullying, misogyny, crimes and blatant immorality. You think HE is a saint, and the longtimers in the federal government are automatically CORRUPT?",
                "good": "0",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "dazedandconfused150",
                        "time": "2 September, 2022",
                        "context": "No big Trump fan but the Dems with the help of the media and the FBI were on a witch-hunt  to impeach him the day he took office \n\nThat’s hard to forget \n\nIn my opinion anyone who was ok with that or just wanted to overlook it has a real problem",
                        "good": "2",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "challenger4016",
                                "time": "2 September, 2022",
                                "context": "Can you say more about that? The help of the media and the FBI? Why do you believe they wanted to impeach him from the day he took office?",
                                "good": "0",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "smokeyj",
                                        "time": "2 September, 2022",
                                        "context": "Well, guess what, peter strozk was fired and lisa paige resigned for attempting to do that very thing.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": [
                                            {
                                                "user_name": "challenger4016",
                                                "time": "2 September, 2022",
                                                "context": "Were they attempting to impeach Trump? I believe they were fired because of the optics of their text messages, not because of any non-existent actions attempting to impeach.",
                                                "good": "0",
                                                "bad": "0",
                                                "replies": [
                                                    {
                                                        "user_name": "smokeyj",
                                                        "time": "3 September, 2022",
                                                        "context": "No, they were fired for the appearance of trying to sway an election and using government equipment and services to accomplish that task.  Fortunately, they failed in the process.",
                                                        "good": "0",
                                                        "bad": "0",
                                                        "replies": [
                                                            {
                                                                "user_name": "challenger4016",
                                                                "time": "3 September, 2022",
                                                                "context": "smokeyj, I believe you are incorrect with that info, but I'm open to being wrong. What is your source? Could you tell us where you read that? Thanks.",
                                                                "good": "0",
                                                                "bad": "0",
                                                                "replies": []
                                                            }
                                                        ]
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "user_name": "smokeyj",
                        "time": "2 September, 2022",
                        "context": "And you think they are not.  Wow, I have a bridge I would like to sell you.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "challenger4016",
                                "time": "2 September, 2022",
                                "context": "If you are so convinced that all federal officials are corrupt WHILE TRUMP IS NOT, where's your evidence of either? Can you support either of those points of view? (If you can't, I'm definitely not interested in that bridge!:-)",
                                "good": "0",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "smokeyj",
                                        "time": "3 September, 2022",
                                        "context": "Again, you try without success to twist my words.  No where did I say All federal officials are corrupt.  You cannot support any of your views either so I guess we are at a stalemate.  You have your opinion and I have mine.  I have stated before that if Trump is guilty, then he should be prosecuted but so should others.  Equal justice for all under the law.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": [
                                            {
                                                "user_name": "challenger4016",
                                                "time": "3 September, 2022",
                                                "context": "Sorry. Didn't mean to twist your words. I CAN support my view that Trump is corrupt; can you support your view that many federal employees are corrupt and need to be replaced?",
                                                "good": "0",
                                                "bad": "0",
                                                "replies": [
                                                    {
                                                        "user_name": "smokeyj",
                                                        "time": "4 September, 2022",
                                                        "context": "How about those fbi agents who falsified the fisa request.  how about those fbi agents and the magistrate who approved the search warrant.  How about biden and his actions along the souther border (not prosecuting federal laws) how about biden and his exit from Afghanistan leaving all those Americans behind. How about biden and his handling of our fossil fuel debacle.  How about biden and his 10% for the big guy as indicated on hunter's lap top.  Just to name a few.  Now you can have the opportunity to support your view on Mr. Trump's corruption.",
                                                        "good": "0",
                                                        "bad": "0",
                                                        "replies": []
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "marky750",
                "time": "3 September, 2022",
                "context": "who did tRump persecute?  I think Scott Pruitt was allowed to stroll away.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "fascisttrump",
        "time": "1 September, 2022",
        "context": "Ole’ NEWTY!!! Good to hear from you, LOL!!  Where ya been?!",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "stellabystarlight",
                "time": "1 September, 2022",
                "context": "If only you had a 1/4 of Newts intelligence........",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "yabbadabbadu",
                        "time": "2 September, 2022",
                        "context": "If only you had 1/3rd of Newt's marriage counseling.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "yabbadabbadu",
        "time": "1 September, 2022",
        "context": "Newt is not even the 'most corrupt' Con in American history, Donnie has you outpaced no matter how much you try.",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "smokeyj",
                "time": "2 September, 2022",
                "context": "Trump is still living rent free inside your head.  TDS has really affected you this morning.",
                "good": "0",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "yabbadabbadu",
                        "time": "2 September, 2022",
                        "context": "TDS is the poster who needs to respond to every perceived slight of his savior. Embrace it, it will be with you until death or dementia sets in. You TDS filled cultists aren't very good reading clocks.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "GreenSword",
        "time": "1 September, 2022",
        "context": "Amazing how corrupt this government is!!!!...What do they have to hide!!!",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "challenger4016",
                "time": "1 September, 2022",
                "context": "Can you say more? What specifically do you see as corrupt? What would the government be doing if they were NOT corrupt? Why do you believe this?",
                "good": "2",
                "bad": "2",
                "replies": [
                    {
                        "user_name": "lordbyron",
                        "time": "1 September, 2022",
                        "context": "Ummm.. read the article and you’ll get some of your specific examples..  And if you don’t see the OBVIOUS corruption -then you’re part of the problem... or not too bright",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "challenger4016",
                                "time": "7 September, 2022",
                                "context": "lordbyron, I'm much more interested in digging deep than taking these FoxNews articles as facts. What do YOU see as obvious evidence of how corrupt this government is? Let's discuss, applying evidence, logic, reason, and respect to the discussion! ",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    },
                    {
                        "user_name": "GreenSword",
                        "time": "1 September, 2022",
                        "context": "Why you interested...???",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "challenger4016",
                                "time": "1 September, 2022",
                                "context": "I'm interested because I view fully supported conversations helpful. With snarkasm alone, nothing ever gets resolved, but with a full conversation, people understand each other better.",
                                "good": "1",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "GreenSword",
                                        "time": "1 September, 2022",
                                        "context": "That's amazing...almost sounds like you are reasonable...almost...",
                                        "good": "0",
                                        "bad": "1",
                                        "replies": [
                                            {
                                                "user_name": "challenger4016",
                                                "time": "1 September, 2022",
                                                "context": "Well, let's discuss some more and see if we can BOTH use reason, logic, facts, and mutual respect as our guiding principles!",
                                                "good": "0",
                                                "bad": "0",
                                                "replies": [
                                                    {
                                                        "user_name": "GreenSword",
                                                        "time": "1 September, 2022",
                                                        "context": "What happened Coward...did ya kinda go away???..Maybe hide behind the FBI???...baaaaahaaaaa...they certainly have a lot of guns now don't they?????",
                                                        "good": "0",
                                                        "bad": "1",
                                                        "replies": [
                                                            {
                                                                "user_name": "yabbadabbadu",
                                                                "time": "2 September, 2022",
                                                                "context": "When in doubt, Deny, Deride and Deflect - the Donnie trifecta!",
                                                                "good": "0",
                                                                "bad": "0",
                                                                "replies": [
                                                                    {
                                                                        "user_name": "GreenSword",
                                                                        "time": "2 September, 2022",
                                                                        "context": "I’m not “in Doubt”",
                                                                        "good": "0",
                                                                        "bad": "0",
                                                                        "replies": [
                                                                            {
                                                                                "user_name": "yabbadabbadu",
                                                                                "time": "2 September, 2022",
                                                                                "context": "I'm sure you're the smartest guy in your head - \"no doubt.\"",
                                                                                "good": "0",
                                                                                "bad": "0",
                                                                                "replies": [
                                                                                    {
                                                                                        "user_name": "GreenSword",
                                                                                        "time": "9 September, 2022",
                                                                                        "context": "Gawbage",
                                                                                        "good": "0",
                                                                                        "bad": "0",
                                                                                        "replies": []
                                                                                    }
                                                                                ]
                                                                            }
                                                                        ]
                                                                    }
                                                                ]
                                                            }
                                                        ]
                                                    }
                                                ]
                                            }
                                        ]
                                    },
                                    {
                                        "user_name": "GreenSword",
                                        "time": "1 September, 2022",
                                        "context": "There is always the FBI you can hide behind...sure it works for people like you ...try to disarm you with kindness or reasonabilty...right before you stick the whatever in their back...nice try...but you are perfect for them..tooo funny..\n\nHi I'm Peter Whatever...I got fired from this fine organization for breaking their rules..but you should listen to what I say when I say trust them.... I mean they did hire me didn't they??\n\nFool me once...Good Day to You!",
                                        "good": "0",
                                        "bad": "1",
                                        "replies": [
                                            {
                                                "user_name": "challenger4016",
                                                "time": "2 September, 2022",
                                                "context": "That's a pretty cynical outlook, bigdog33. If you change your mind, I assure you I'm not going to stick the whatever in anyone's back. I would love to have a reasonable discussion as described above.",
                                                "good": "1",
                                                "bad": "0",
                                                "replies": []
                                            },
                                            {
                                                "user_name": "yabbadabbadu",
                                                "time": "2 September, 2022",
                                                "context": "Like hiding behind a great conspiracy theory - #973?",
                                                "good": "0",
                                                "bad": "0",
                                                "replies": []
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "user_name": "GreenSword",
                        "time": "1 September, 2022",
                        "context": "Maybe you should Hide behind Garland and the FBI",
                        "good": "0",
                        "bad": "1",
                        "replies": []
                    },
                    {
                        "user_name": "GreenSword",
                        "time": "1 September, 2022",
                        "context": "They are getting more popular every day ya know..baaahaaa",
                        "good": "0",
                        "bad": "1",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "yabbadabbadu",
                "time": "1 September, 2022",
                "context": "TDS made you post that...",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "GreenSword",
                        "time": "2 September, 2022",
                        "context": "Nobody made me post anything…As an American I have the right to an Opinion",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "yabbadabbadu",
                                "time": "2 September, 2022",
                                "context": "That is the definition of TDS, thanks for the tip in.",
                                "good": "0",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "GreenSword",
                                        "time": "2 September, 2022",
                                        "context": "Have no idea what you are talking about and do not care",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": [
                                            {
                                                "user_name": "yabbadabbadu",
                                                "time": "2 September, 2022",
                                                "context": "Yet hear you are, busy responding to every post, especially the ones where you think a poster has offended your Lord. How many acronyms scare you?",
                                                "good": "0",
                                                "bad": "0",
                                                "replies": [
                                                    {
                                                        "user_name": "GreenSword",
                                                        "time": "2 September, 2022",
                                                        "context": "None…best wishes to you",
                                                        "good": "0",
                                                        "bad": "0",
                                                        "replies": []
                                                    },
                                                    {
                                                        "user_name": "GreenSword",
                                                        "time": "2 September, 2022",
                                                        "context": "oh and thanks fir figuring it out",
                                                        "good": "0",
                                                        "bad": "0",
                                                        "replies": []
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "user_name": "atlan0101",
        "time": "1 September, 2022",
        "context": "The fanatical radical Socialist Democrat / RINO Party has no fear any longer in imposing a savagely criminal martial law police state over the American people. We have a savagely criminal government ruling over us, and it has let a savagely unnatural and criminal society eat civilization among us.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "grazer",
        "time": "1 September, 2022",
        "context": "Can't argue with anything he is saying here.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "midorsey166",
        "time": "1 September, 2022",
        "context": "This should be taken seriously. Gingrich is someone who understands corruption. He wrote the book. I especially appreciate his shout out to Eugene Debs. The irony of Newt Gingrich implying that Debs was unfairly imprisoned is so rich I'm going to gain five pounds.",
        "good": "4",
        "bad": "4",
        "replies": []
    },
    {
        "user_name": "ichorous",
        "time": "1 September, 2022",
        "context": "Americans if you want the truth... you have to dump the Democrats in large numbers ! Four generation of Democrat nepotism has to be dismantled !",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "yabbadabbadu",
                "time": "1 September, 2022",
                "context": "Thanks Dimitri.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "commonsense911136",
        "time": "1 September, 2022",
        "context": "Gingrich is so full of it! After trump started a riot on our capital that resulted in people dying \nand over 400 rioters found guilty. Then trump steals secret documents, lies about it and finally gets caught red handed. Gingrich has NO CREDIBILITY, NONE.",
        "good": "4",
        "bad": "5",
        "replies": [
            {
                "user_name": "grazer",
                "time": "1 September, 2022",
                "context": "And that proof is where?  These clowns didn't find what they were looking for, buddy.  You're up the creek again!",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "bulldog22",
                "time": "2 September, 2022",
                "context": "The only one who died in the capital that day was an unarmed female air force veteran shot by a capitol police lieutenant who was exonerated without even being interviewed on the matter. Video shows her in group making no threatening moves. Complete whitewash.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "jmmul123",
        "time": "1 September, 2022",
        "context": "Newt...don't you have some young aide to seduce?",
        "good": "5",
        "bad": "4",
        "replies": [
            {
                "user_name": "azzir036",
                "time": "1 September, 2022",
                "context": "Don't you have some hot pockets to eat?",
                "good": "1",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "grazer",
                        "time": "1 September, 2022",
                        "context": "Do you think he's old enough for solid food?",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "user_name": "azzir036",
        "time": "1 September, 2022",
        "context": "Lord help us if with what is going on in this country right now, people with sense, that is, Conservatives, don't retake the House and Senate this cycle.\nThere are just SO MANY people who actually think that voting for free stuff can go on forever.",
        "good": "8",
        "bad": "5",
        "replies": [
            {
                "user_name": "yabbadabbadu",
                "time": "1 September, 2022",
                "context": "What story do you think you are reading?",
                "good": "2",
                "bad": "2",
                "replies": [
                    {
                        "user_name": "azzir036",
                        "time": "1 September, 2022",
                        "context": "If you intend to comment, kindly use coherent thoughts.",
                        "good": "1",
                        "bad": "1",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "trmkc",
                "time": "2 September, 2022",
                "context": "I believe we've passed the point where Democrats can give away other people's money because there's none left.",
                "good": "1",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "marky750",
                        "time": "4 September, 2022",
                        "context": "Plenty left.  Trump blew through 8 trillion.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "ossie234",
                                "time": "4 September, 2022",
                                "context": "Left us with a $23 trillion deficit when he came lame duck 🦆",
                                "good": "0",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "azzir036",
                                        "time": "10 September, 2022",
                                        "context": "To ossieosborne and markymark, I'm tired of you.  Go eat your hot pockets and burn some cities in peaceful protest. I won't be responding to you any more.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": [
                                            {
                                                "user_name": "ossie234",
                                                "time": "10 September, 2022",
                                                "context": "Can’t handle the Truth… 😂😂😂😂😂",
                                                "good": "0",
                                                "bad": "0",
                                                "replies": []
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "ossie234",
                "time": "2 September, 2022",
                "context": "Man the crazy’s are out ..\nIt’s because of orange man our country has become the way it is now .,",
                "good": "1",
                "bad": "2",
                "replies": [
                    {
                        "user_name": "smokeyj",
                        "time": "2 September, 2022",
                        "context": "Yep, a crazy just posted something about an orange man.  Must be a crazy.",
                        "good": "1",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "ossie234",
                                "time": "2 September, 2022",
                                "context": "Your cult leader just said TS/TCI documents were in his top drawer..\nNot on the floor..\nYep the orange crazy’s are out.,",
                                "good": "1",
                                "bad": "1",
                                "replies": [
                                    {
                                        "user_name": "smokeyj",
                                        "time": "2 September, 2022",
                                        "context": "No, he is not my cult leader but you are really funny.  Or maybe a little strange with your comments. One would think you could come up with something more original than \"the orange man\" but that would require some intelligence.",
                                        "good": "1",
                                        "bad": "0",
                                        "replies": [
                                            {
                                                "user_name": "marky750",
                                                "time": "9 September, 2022",
                                                "context": "I can come up with an alternative.  Treasonous criminal.",
                                                "good": "0",
                                                "bad": "0",
                                                "replies": [
                                                    {
                                                        "user_name": "smokeyj",
                                                        "time": "11 September, 2022",
                                                        "context": "You should not be referring to slow joe like that, even if he is a treasonous criiminal.",
                                                        "good": "0",
                                                        "bad": "0",
                                                        "replies": []
                                                    }
                                                ]
                                            }
                                        ]
                                    },
                                    {
                                        "user_name": "azzir036",
                                        "time": "2 September, 2022",
                                        "context": "America and American freedom is NOT a cult.  Liberal progressive values ARE cultlike.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": [
                                            {
                                                "user_name": "ossie234",
                                                "time": "2 September, 2022",
                                                "context": "What Freedoms have been talking away from you ….\nPlease tell",
                                                "good": "0",
                                                "bad": "0",
                                                "replies": [
                                                    {
                                                        "user_name": "azzir036",
                                                        "time": "3 September, 2022",
                                                        "context": "1st amendment, 2nd amendment 4th amendment, 14th amendment.\nUS energy independence, freedom from excessive government spending and regulation, and on and on.",
                                                        "good": "0",
                                                        "bad": "0",
                                                        "replies": [
                                                            {
                                                                "user_name": "marky750",
                                                                "time": "4 September, 2022",
                                                                "context": "One of Trump’s lesser known but profoundly damaging legacies will be the  explosive rise in the national debt that occurred on his watch. The \nfinancial burden that he’s inflicted on our government will wreak havoc \nfor decades, saddling our kids and grandkids with debt.             \n \nThe national debt has risen by almost $7.8 trillion during Trump’s time in office.  That’s nearly twice as much as what Americans owe on student loans, car loans, credit cards and every other type of debt other than mortgages, combined, according to the Federal Reserve Bank of New York.\n\nAs for Trump’s suggestion that the U.S. was “exporting energy for the first time ever in the history of our country” when he was president, that’s false.  The USy has been supplying international markets with various forms of energy for decades.  Those who tout this so-called “energy independence” may be referring to the fact that, on net, the country either produced more energy than it consumed, exported more energy than it imported, or, more specifically, had a greater number of exports than imports of petroleum, which includes crude oil and refined products from crude oil, such as gasoline and various fuels.\n\nHowever, by any of those definitions, the U.S. was still “energy independent” in 2021 under Biden contrary to claims made by Republicans who have suggested otherwise.",
                                                                "good": "1",
                                                                "bad": "1",
                                                                "replies": [
                                                                    {
                                                                        "user_name": "ossie234",
                                                                        "time": "4 September, 2022",
                                                                        "context": "cult members don’t like the Truth ..",
                                                                        "good": "0",
                                                                        "bad": "1",
                                                                        "replies": [
                                                                            {
                                                                                "user_name": "marky750",
                                                                                "time": "4 September, 2022",
                                                                                "context": "To them truth is like daylight to a vampire",
                                                                                "good": "0",
                                                                                "bad": "0",
                                                                                "replies": [
                                                                                    {
                                                                                        "user_name": "azzir036",
                                                                                        "time": "5 September, 2022",
                                                                                        "context": "You haven't spoken any truth yet.",
                                                                                        "good": "0",
                                                                                        "bad": "0",
                                                                                        "replies": [
                                                                                            {
                                                                                                "user_name": "marky750",
                                                                                                "time": "5 September, 2022",
                                                                                                "context": "Every word I type is a verifiable fact.\nYour words is simply parroting what your handlers tell you to believe.",
                                                                                                "good": "0",
                                                                                                "bad": "0",
                                                                                                "replies": [
                                                                                                    {
                                                                                                        "user_name": "azzir036",
                                                                                                        "time": "6 September, 2022",
                                                                                                        "context": "So, no truth yet.",
                                                                                                        "good": "0",
                                                                                                        "bad": "0",
                                                                                                        "replies": [
                                                                                                            {
                                                                                                                "user_name": "marky750",
                                                                                                                "time": "6 September, 2022",
                                                                                                                "context": "You can't handle the truth.",
                                                                                                                "good": "0",
                                                                                                                "bad": "0",
                                                                                                                "replies": [
                                                                                                                    {
                                                                                                                        "user_name": "azzir036",
                                                                                                                        "time": "6 September, 2022",
                                                                                                                        "context": "At least I recognize truth, something sadly you can't seem to do.",
                                                                                                                        "good": "0",
                                                                                                                        "bad": "0",
                                                                                                                        "replies": [
                                                                                                                            {
                                                                                                                                "user_name": "marky750",
                                                                                                                                "time": "6 September, 2022",
                                                                                                                                "context": "Grab your AR-15, your Bible and your confederate flag and get out there and spread the truth!",
                                                                                                                                "good": "0",
                                                                                                                                "bad": "0",
                                                                                                                                "replies": [
                                                                                                                                    {
                                                                                                                                        "user_name": "azzir036",
                                                                                                                                        "time": "7 September, 2022",
                                                                                                                                        "context": "No need.  You and yours are already doing a great job of eating your own.",
                                                                                                                                        "good": "0",
                                                                                                                                        "bad": "0",
                                                                                                                                        "replies": [
                                                                                                                                            {
                                                                                                                                                "user_name": "ossie234",
                                                                                                                                                "time": "7 September, 2022",
                                                                                                                                                "context": "Man you need to stop having what Don jr is on .. You can’t handle it..",
                                                                                                                                                "good": "1",
                                                                                                                                                "bad": "0",
                                                                                                                                                "replies": [
                                                                                                                                                    {
                                                                                                                                                        "user_name": "azzir036",
                                                                                                                                                        "time": "8 September, 2022",
                                                                                                                                                        "context": "Pardon me?  If you are telling me to enjoy my freedom and liberty, I'll have that all day long.  You can take you dictatorship and go to communist China.  ",
                                                                                                                                                        "good": "0",
                                                                                                                                                        "bad": "0",
                                                                                                                                                        "replies": [
                                                                                                                                                            {
                                                                                                                                                                "user_name": "ossie234",
                                                                                                                                                                "time": "9 September, 2022",
                                                                                                                                                                "context": "Pardon me ..\nWhat freedoms have you lost ..\nNo you haven’t lost your guns\nNo you haven’t lost your free speech \nThat’s all the cult members say you can’t take away our 2nd Amendment\nAnd no our 1st Amendment hasn’t been taken away as well..\nSo like I said you personally what freedoms have been taken away from you?",
                                                                                                                                                                "good": "0",
                                                                                                                                                                "bad": "0",
                                                                                                                                                                "replies": [
                                                                                                                                                                    {
                                                                                                                                                                        "user_name": "marky750",
                                                                                                                                                                        "time": "9 September, 2022",
                                                                                                                                                                        "context": "The things is they believe the 2nd Amendment grants them the right to murder every government employee who they decide have become tyrants.  I assume they also believe they can appoint replacements as well, but I haven't seen it stated",
                                                                                                                                                                        "good": "1",
                                                                                                                                                                        "bad": "0",
                                                                                                                                                                        "replies": []
                                                                                                                                                                    },
                                                                                                                                                                    {
                                                                                                                                                                        "user_name": "azzir036",
                                                                                                                                                                        "time": "10 September, 2022",
                                                                                                                                                                        "context": "You are sadly mistaken.",
                                                                                                                                                                        "good": "0",
                                                                                                                                                                        "bad": "0",
                                                                                                                                                                        "replies": [
                                                                                                                                                                            {
                                                                                                                                                                                "user_name": "marky750",
                                                                                                                                                                                "time": "10 September, 2022",
                                                                                                                                                                                "context": "You are sad and mistaken.",
                                                                                                                                                                                "good": "0",
                                                                                                                                                                                "bad": "0",
                                                                                                                                                                                "replies": []
                                                                                                                                                                            }
                                                                                                                                                                        ]
                                                                                                                                                                    }
                                                                                                                                                                ]
                                                                                                                                                            },
                                                                                                                                                            {
                                                                                                                                                                "user_name": "marky750",
                                                                                                                                                                "time": "9 September, 2022",
                                                                                                                                                                "context": "Who took a constitutional right away from American citizens on June 24, 2022?  Which one will be next?",
                                                                                                                                                                "good": "0",
                                                                                                                                                                "bad": "0",
                                                                                                                                                                "replies": [
                                                                                                                                                                    {
                                                                                                                                                                        "user_name": "azzir036",
                                                                                                                                                                        "time": "10 September, 2022",
                                                                                                                                                                        "context": "If you're referring to the right to kill unborns, no one took it away because it never existed.",
                                                                                                                                                                        "good": "0",
                                                                                                                                                                        "bad": "0",
                                                                                                                                                                        "replies": [
                                                                                                                                                                            {
                                                                                                                                                                                "user_name": "marky750",
                                                                                                                                                                                "time": "10 September, 2022",
                                                                                                                                                                                "context": "Yeah, I know.  The classified info at Mar a Lago was planted.\nRoe v. Wade, 410 U.S. 113 (1973), was a landmark decision of the U.S. Supreme Court in which the Court ruled that the Constitution of the United States conferred the right to have an abortion.  It doesn't address 'unborn babies' its about a human right which has inexplicitly withdrawn.\nSeparation of Church and State never was a republican ideal.  Its the $.",
                                                                                                                                                                                "good": "1",
                                                                                                                                                                                "bad": "0",
                                                                                                                                                                                "replies": []
                                                                                                                                                                            }
                                                                                                                                                                        ]
                                                                                                                                                                    }
                                                                                                                                                                ]
                                                                                                                                                            },
                                                                                                                                                            {
                                                                                                                                                                "user_name": "marky750",
                                                                                                                                                                "time": "10 September, 2022",
                                                                                                                                                                "context": "Do you understand what a dictatorship is?",
                                                                                                                                                                "good": "0",
                                                                                                                                                                "bad": "0",
                                                                                                                                                                "replies": []
                                                                                                                                                            }
                                                                                                                                                        ]
                                                                                                                                                    }
                                                                                                                                                ]
                                                                                                                                            },
                                                                                                                                            {
                                                                                                                                                "user_name": "marky750",
                                                                                                                                                "time": "9 September, 2022",
                                                                                                                                                "context": "You post a lot trash, but never anything to support it.   When you see them on sale, stock up on tissues.  You will need them soon.",
                                                                                                                                                "good": "1",
                                                                                                                                                "bad": "0",
                                                                                                                                                "replies": [
                                                                                                                                                    {
                                                                                                                                                        "user_name": "azzir036",
                                                                                                                                                        "time": "10 September, 2022",
                                                                                                                                                        "context": "My eyes support the facts by observing the world.  You see the world on fire and say \"everything is great!\"",
                                                                                                                                                        "good": "0",
                                                                                                                                                        "bad": "0",
                                                                                                                                                        "replies": [
                                                                                                                                                            {
                                                                                                                                                                "user_name": "marky750",
                                                                                                                                                                "time": "10 September, 2022",
                                                                                                                                                                "context": "You are now told the world is on fire after you were told how fine everything was here while the rest of the world fought COVID and your guy said \"I take no responsibility at all\" when asked about the delay in getting his vaccine out to Americans.\nWe are in MUCH better shape than we were in 2020.",
                                                                                                                                                                "good": "0",
                                                                                                                                                                "bad": "0",
                                                                                                                                                                "replies": []
                                                                                                                                                            }
                                                                                                                                                        ]
                                                                                                                                                    }
                                                                                                                                                ]
                                                                                                                                            }
                                                                                                                                        ]
                                                                                                                                    }
                                                                                                                                ]
                                                                                                                            }
                                                                                                                        ]
                                                                                                                    }
                                                                                                                ]
                                                                                                            }
                                                                                                        ]
                                                                                                    }
                                                                                                ]
                                                                                            }
                                                                                        ]
                                                                                    }
                                                                                ]
                                                                            },
                                                                            {
                                                                                "user_name": "azzir036",
                                                                                "time": "7 September, 2022",
                                                                                "context": "ESPECIALLY the democrat cult.",
                                                                                "good": "0",
                                                                                "bad": "0",
                                                                                "replies": [
                                                                                    {
                                                                                        "user_name": "marky750",
                                                                                        "time": "9 September, 2022",
                                                                                        "context": "Democrats support truth.  Connies avoid it at all costs.",
                                                                                        "good": "1",
                                                                                        "bad": "0",
                                                                                        "replies": []
                                                                                    }
                                                                                ]
                                                                            }
                                                                        ]
                                                                    }
                                                                ]
                                                            },
                                                            {
                                                                "user_name": "marky750",
                                                                "time": "4 September, 2022",
                                                                "context": "In order for a constitutional right to be struck down, the SCOTUS must order it unconstitutional. The only time that has happened, in my lifetime, was when the current Court ruled against Roe v. Wade, a decision which means that \"young women today will come of age with fewer rights than their mothers and grandmothers.\" The dissenting side of the SCOTUS said \"from the very moment of fertilization, a woman has no rights to speak of. A state can force her to bring a pregnancy to term even at the steepest personal and familial costs.\" \"With sorrow for this Court, but more, for the many millions of American women who have today lost a fundamental constitutional protection — we dissent\" Can you quote the dissenting side of the SCOTUS that was written in response to the opinion that removed any or all of your rights under the 1st amendment, 2nd amendment 4th amendment, 14th amendment. See my other posts on US energy independence. Biden gave us freedom from excessive government spending shortly after he took office. So far he reduced the federal debt. I guess you're OK with corporations working under less regulation. In NYC wildlife has returned to surrounding waters and lands. Thanks to previous work done since 1970. Do you want future generations to live like we used to and worse? So far your side has done all they can to make it happen. DONT BE LATE FOR YOUR NEXT SMOKE INSERTION TREATMENT",
                                                                "good": "1",
                                                                "bad": "1",
                                                                "replies": [
                                                                    {
                                                                        "user_name": "ossie234",
                                                                        "time": "4 September, 2022",
                                                                        "context": "Well said ..",
                                                                        "good": "1",
                                                                        "bad": "1",
                                                                        "replies": []
                                                                    },
                                                                    {
                                                                        "user_name": "ossie234",
                                                                        "time": "9 September, 2022",
                                                                        "context": "Well said",
                                                                        "good": "1",
                                                                        "bad": "0",
                                                                        "replies": []
                                                                    }
                                                                ]
                                                            }
                                                        ]
                                                    },
                                                    {
                                                        "user_name": "marky750",
                                                        "time": "4 September, 2022",
                                                        "context": "I have asked that question 1,000 + times of the 'patriots'.  Since none of their trainers have told them, they can't answer questions.  Parrots can only mimic what has been taught to them and they never forget it.",
                                                        "good": "1",
                                                        "bad": "0",
                                                        "replies": [
                                                            {
                                                                "user_name": "ossie234",
                                                                "time": "4 September, 2022",
                                                                "context": "100% agree with you .",
                                                                "good": "0",
                                                                "bad": "0",
                                                                "replies": []
                                                            }
                                                        ]
                                                    },
                                                    {
                                                        "user_name": "azzir036",
                                                        "time": "10 September, 2022",
                                                        "context": "I won't waste my time on this nonsense question.",
                                                        "good": "0",
                                                        "bad": "0",
                                                        "replies": [
                                                            {
                                                                "user_name": "marky750",
                                                                "time": "10 September, 2022",
                                                                "context": "You can't answer the questions because your trainers never told you more than 'Ya gotta believe'.",
                                                                "good": "1",
                                                                "bad": "0",
                                                                "replies": []
                                                            }
                                                        ]
                                                    }
                                                ]
                                            },
                                            {
                                                "user_name": "marky750",
                                                "time": "4 September, 2022",
                                                "context": "American freedom is not breaking every American law you can.",
                                                "good": "0",
                                                "bad": "0",
                                                "replies": [
                                                    {
                                                        "user_name": "azzir036",
                                                        "time": "5 September, 2022",
                                                        "context": "Which the dems are doing constantly.",
                                                        "good": "0",
                                                        "bad": "0",
                                                        "replies": []
                                                    },
                                                    {
                                                        "user_name": "azzir036",
                                                        "time": "10 September, 2022",
                                                        "context": "Then why do libs break laws and people's lives?",
                                                        "good": "0",
                                                        "bad": "0",
                                                        "replies": [
                                                            {
                                                                "user_name": "marky750",
                                                                "time": "10 September, 2022",
                                                                "context": "You've got to be pulling my chain.  I already told you that you make statements that you can't back up.  Twice I posted to you actual statistics stating the numbers of Reps and Dems who have been convicted of serious crimes.  Find those posts and explain how your trainers tell you dems are criminals?.",
                                                                "good": "0",
                                                                "bad": "0",
                                                                "replies": []
                                                            }
                                                        ]
                                                    }
                                                ]
                                            },
                                            {
                                                "user_name": "marky750",
                                                "time": "9 September, 2022",
                                                "context": "Connie's are a cult and they have no values.",
                                                "good": "1",
                                                "bad": "1",
                                                "replies": [
                                                    {
                                                        "user_name": "azzir036",
                                                        "time": "10 September, 2022",
                                                        "context": "If by \"Connies\" you mean Conservatives, your words are laughable.  Libs are a cult and they have no values.",
                                                        "good": "0",
                                                        "bad": "0",
                                                        "replies": [
                                                            {
                                                                "user_name": "marky750",
                                                                "time": "10 September, 2022",
                                                                "context": "Why are there many more libs than Connie's.?\nIn 2020 dem got what, 7 million more votes in an election where the majority said 'we won't be fooled again'.  \nKeep in mind.  Cons came last.  ",
                                                                "good": "1",
                                                                "bad": "1",
                                                                "replies": []
                                                            },
                                                            {
                                                                "user_name": "marky750",
                                                                "time": "10 September, 2022",
                                                                "context": "What 'values' do Cons have?",
                                                                "good": "1",
                                                                "bad": "0",
                                                                "replies": []
                                                            },
                                                            {
                                                                "user_name": "marky750",
                                                                "time": "10 September, 2022",
                                                                "context": "Libs are the majority; cults are comparatively small.",
                                                                "good": "0",
                                                                "bad": "0",
                                                                "replies": []
                                                            }
                                                        ]
                                                    }
                                                ]
                                            }
                                        ]
                                    },
                                    {
                                        "user_name": "marky750",
                                        "time": "5 September, 2022",
                                        "context": "Since they are for the demise of the United States its no surprise.",
                                        "good": "0",
                                        "bad": "1",
                                        "replies": [
                                            {
                                                "user_name": "azzir036",
                                                "time": "7 September, 2022",
                                                "context": "You're talking about the democrats, right?  If you're not, you should be.",
                                                "good": "0",
                                                "bad": "0",
                                                "replies": []
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "user_name": "azzir036",
                        "time": "2 September, 2022",
                        "context": "Nope.  This is Brandon's mess.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "marky750",
                "time": "3 September, 2022",
                "context": "Look what happened in '17-'20.  A country run amok.",
                "good": "0",
                "bad": "0",
                "replies": [
                    {
                        "user_name": "azzir036",
                        "time": "4 September, 2022",
                        "context": "Amok with a soaring economy, low gas prices, record low unemployment especially among minorities, business and manufacturing returning to the US.  Amok, indeed!  Give me that kind of amok over Brandon's amok anyday.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "marky750",
                "time": "3 September, 2022",
                "context": "What free stuff has been voted on?",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "dimebagdonnie",
        "time": "1 September, 2022",
        "context": "I hope tRump signs my new licence plate...after he makes it :0",
        "good": "3",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "murica572",
        "time": "1 September, 2022",
        "context": "Trump supporters aren't a threat to democracy, they are a threat to the corrupt democrat's power . Don't get the two confused.",
        "good": "4",
        "bad": "3",
        "replies": [
            {
                "user_name": "challenger4016",
                "time": "1 September, 2022",
                "context": "The Trump supporters who believe Trump's Big Lie are a danger to democracy--it's because of them that many Big Lie believers are being elected to various positions in government. If enough of them get in to the right positions, our elections are potentially doomed. They will change vote outcomes if they don't like them, just like Trump attempted. \n\nThe other and more direct way that SOME Trump supporters are a danger is that they are easily inflamed to violence by Trump's lies. Trump says, \"I've been raided! This is unprecedented! [I'M A VICTIM OF THE BIG, BAD GOVERNMENT!]\" and people literally die to defend him by attacking the FBI. \n\nTrump knows this all too well, and he throws gasoline on his easily inflamed supporters whenever he's in trouble. This COULD lead to a civil war or \"riots in the streets\" if Trump doesn't lose this power. Or his supporters don't learn to see through his dark intentions.",
                "good": "3",
                "bad": "2",
                "replies": [
                    {
                        "user_name": "muaddib015197",
                        "time": "1 September, 2022",
                        "context": "listen to you parrot the phrases spoon fed to you by your masters.\nPull your head out and look around you.....stop watching so much msnbc for heavens sake",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    },
                    {
                        "user_name": "murica572",
                        "time": "1 September, 2022",
                        "context": "His dark intentions lol.  All Trump has to do is snap his fingers and say NO quarter and his 75 million supporters will know exactly what to do.                 Did you ever hear of the Night of the Long Knives?",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "challenger4016",
                                "time": "1 September, 2022",
                                "context": "Just read about it, thanks! Trump's 2024 plan to fire thousands of federal workers (and start over) is rather similar!!",
                                "good": "0",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "murica572",
                                        "time": "1 September, 2022",
                                        "context": "it's best.",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": [
                                            {
                                                "user_name": "challenger4016",
                                                "time": "1 September, 2022",
                                                "context": "Can you say why that plan would be best? I have seen the caliber of people Trump sees as \"great,\" and it more than worries me (not that I think he could be elected). Trump's idea of a good federal employee is one who agrees with him and is willing to do his bidding. Talk about creating a fascist government!",
                                                "good": "0",
                                                "bad": "0",
                                                "replies": [
                                                    {
                                                        "user_name": "murica572",
                                                        "time": "1 September, 2022",
                                                        "context": "a good federal employee is one that is not a saboteur",
                                                        "good": "0",
                                                        "bad": "0",
                                                        "replies": [
                                                            {
                                                                "user_name": "challenger4016",
                                                                "time": "1 September, 2022",
                                                                "context": "Can you say more? Do you think the thousands of federal employees that Trump plans to replace are rife with saboteurs? If so, why do you think so? Also, why do you think that Trump's new employees would NOT be saboteurs?",
                                                                "good": "0",
                                                                "bad": "0",
                                                                "replies": []
                                                            }
                                                        ]
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "muaddib015197",
                "time": "1 September, 2022",
                "context": "exactly",
                "good": "1",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "annika4",
        "time": "1 September, 2022",
        "context": "\"Justice\" department.",
        "good": "1",
        "bad": "0",
        "replies": [
            {
                "user_name": "yabbadabbadu",
                "time": "2 September, 2022",
                "context": "Like Donnie's Dept. of Health?",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "error": "error"
    },
    {
        "user_name": "ichorous",
        "time": "1 September, 2022",
        "context": "The DOJ Biden's SS.",
        "good": "2",
        "bad": "1",
        "replies": [
            {
                "user_name": "muaddib015197",
                "time": "1 September, 2022",
                "context": "and about to add 87,000 armed IRS shock troops",
                "good": "2",
                "bad": "1",
                "replies": [
                    {
                        "user_name": "challenger4016",
                        "time": "1 September, 2022",
                        "context": "This has to be satire, right?",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "muaddib015197",
                                "time": "1 September, 2022",
                                "context": "nope....it's happening.\nThe job requirement posting lists one of the requirements as \"Must be willing to use deadly force\"",
                                "good": "0",
                                "bad": "0",
                                "replies": [
                                    {
                                        "user_name": "challenger4016",
                                        "time": "1 September, 2022",
                                        "context": "Sounds interesting, thanks. I'll check it out and get back to you.",
                                        "good": "1",
                                        "bad": "0",
                                        "replies": [
                                            {
                                                "user_name": "muaddib015197",
                                                "time": "1 September, 2022",
                                                "context": "crazy stuff going on in our country.....lots of damaging things.",
                                                "good": "0",
                                                "bad": "0",
                                                "replies": []
                                            }
                                        ]
                                    },
                                    {
                                        "user_name": "dimebagdonnie",
                                        "time": "1 September, 2022",
                                        "context": "Maybe if the Rubes would stop claiming their AR-15s as dependents we wouldn't need the extra agents",
                                        "good": "0",
                                        "bad": "0",
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "challenger4016",
                "time": "1 September, 2022",
                "context": "You do realize that Trump is the one who used the DOJ for his own good, are you not? Barr's covering for him is one example, but the most damning is that he tried to install Jeffrey Clark as the Attorney General who would then strong-arm Georgia to change its presidential votes. \n\nAnd can you please tell us why you see the DOJ as the SS? The more specific and thorough you are in your explanation, the better.",
                "good": "1",
                "bad": "3",
                "replies": []
            },
            {
                "user_name": "marky750",
                "time": "3 September, 2022",
                "context": "Why?  Because they will prosecute CRIMINALS?",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "rsx",
        "time": "2 September, 2022",
        "context": "Look who is saying Garland is corrupt ?!",
        "good": "1",
        "bad": "2",
        "replies": [
            {
                "user_name": "marky750",
                "time": "3 September, 2022",
                "context": "Hilarious, isn't it?",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "rowanrules",
        "time": "2 September, 2022",
        "context": "Absolutely",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "oafkeepr",
        "time": "3 September, 2022",
        "context": "Corrupt? Because he investigated a guy that clearly broke the law? Come on, Newt. Trump is not worth whatever self-respect you might have left.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "marky750",
        "time": "3 September, 2022",
        "context": "Who actually gives a hoot about an aged out lifelong criminal and his cult of hate?",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "arch_stanton",
        "time": "2 September, 2022",
        "context": "Garland is definitely firing squad material.",
        "good": "1",
        "bad": "4",
        "replies": [
            {
                "user_name": "realist85",
                "time": "2 September, 2022",
                "context": "Right after trump who has sold our top secret info, “the empty folders“ to Russia and china, who are starting War Games today, gets it first.\nOr we could just have a bunch of white cops go and wake him in his bed and do the deed as they do so well.",
                "good": "2",
                "bad": "4",
                "replies": [
                    {
                        "user_name": "arch_stanton",
                        "time": "2 September, 2022",
                        "context": "The lying DOJ and FBI wouldn’t even attempt to sell that lie.",
                        "good": "0",
                        "bad": "0",
                        "replies": [
                            {
                                "user_name": "marky750",
                                "time": "4 September, 2022",
                                "context": "What lie?",
                                "good": "0",
                                "bad": "0",
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "user_name": "marky750",
                "time": "4 September, 2022",
                "context": "Yeah.  Maybe he could serve on the squad to take out the man who stole classified US Government property.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "grazer",
        "time": "2 September, 2022",
        "context": "I am tired of being bullied by the Democommies.  They have become uncivilized.",
        "good": "1",
        "bad": "1",
        "replies": [
            {
                "user_name": "objectiveuno089",
                "time": "2 September, 2022",
                "context": "We didn't invade the capitol and try to overturn an election that didn't go our way.",
                "good": "0",
                "bad": "1",
                "replies": []
            }
        ]
    },
    {
        "user_name": "objectiveuno089",
        "time": "2 September, 2022",
        "context": "Newt didn't seem to mind Trump's DOJ acting as his personal legal service and meddled on The Donald's side all the time. Newt says what he's told to say.  Total hack. Be interesting as to what he has to say to the Jan. 6th commission now that he's being compelled to testify.",
        "good": "1",
        "bad": "3",
        "replies": []
    },
    {
        "user_name": "bigbopper111",
        "time": "2 September, 2022",
        "context": "OUR GREAT FBI PROTECTING US FROM VILLIANS LIKE TRUMP!!!!!!!",
        "good": "0",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "bobmelvin",
        "time": "2 September, 2022",
        "context": "He knows if this Trump thing in Florida fails, he and most of those on the seventh floor of the FBI building are going to prison.  Plus, the big social platforms are going to be facing heavy campaign finance fines.  Hey, that now we will pay the student loans campaign finance fines.",
        "good": "5",
        "bad": "0",
        "replies": [
            {
                "user_name": "yabbadabbadu",
                "time": "2 September, 2022",
                "context": "In a cell next to the fat orange man...",
                "good": "0",
                "bad": "1",
                "replies": []
            },
            {
                "user_name": "marky750",
                "time": "3 September, 2022",
                "context": "Failed?  It was a search warrant to take possession of government property that was stolen for eventual sale to enemies of the US.",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "marky750",
                "time": "3 September, 2022",
                "context": "How about the $1.6 billion that got dropped on the GOP?",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "marky750",
                "time": "4 September, 2022",
                "context": "Too bad the DOJ in place at the time turned its back on us citizens.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "oldcenterist",
        "time": "3 September, 2022",
        "context": "As usual ... Deny, Deflect, Delay. Anything but Truth, Honesty, and an Apology when necessary.\nThe election wasn't stolen but THE BIG LIE lives on in the minds of the ignorant.",
        "good": "2",
        "bad": "1",
        "replies": []
    },
    {
        "error": "error"
    },
    {
        "user_name": "Truth_Betold",
        "time": "3 September, 2022",
        "context": "FOX's-Steve Doucey owes President Trump and Patriots an Apology....!!!!!!!!!!!!!!!!",
        "good": "0",
        "bad": "0",
        "replies": [
            {
                "user_name": "Cincinnatus737",
                "time": "3 September, 2022",
                "context": "Trump owes America an apology.",
                "good": "1",
                "bad": "1",
                "replies": []
            },
            {
                "user_name": "marky750",
                "time": "4 September, 2022",
                "context": "Patriots?  Are those the kindergarten drop outs who want to overthrow my country?",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "162nd",
        "time": "2 September, 2022",
        "context": "Garlan needs to be tried for treason and when found guilty, HUNG.",
        "good": "2",
        "bad": "1",
        "replies": [
            {
                "user_name": "objectiveuno089",
                "time": "2 September, 2022",
                "context": "Why would Garland [SIC] be tried for treason while enforcing laws that Trump signed into law?",
                "good": "3",
                "bad": "2",
                "replies": [
                    {
                        "user_name": "marky750",
                        "time": "4 September, 2022",
                        "context": "Its the authoritarian way to go.",
                        "good": "0",
                        "bad": "0",
                        "replies": []
                    }
                ]
            },
            {
                "user_name": "yabbadabbadu",
                "time": "2 September, 2022",
                "context": "What if the obese orange man breaks it when he is hung?",
                "good": "1",
                "bad": "3",
                "replies": []
            }
        ]
    },
    {
        "user_name": "Cincinnatus737",
        "time": "3 September, 2022",
        "context": "Gingrich is a master of phony indignation.. he claims to be a patriotic conservative yet he avoided military service himself, much like Donald Trump, Cadet Bone Spurs!",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "OleAbeLinc",
        "time": "1 September, 2022",
        "context": "Anytime you have to former leaders with girths over 50 inches in\ncircumference don’t trust their states unless it involves food. Now, that’s where the major expertise lies the most. \nNow, let’s all tie our shoes up, standing.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ossie234",
        "time": "2 September, 2022",
        "context": "😩😩😩😩😩😩😩😩😩😩😩😩😩😩😩😩😩😩🥴😩\nTrump is a Traitor to our country….\nPoor poor Fox ….. \npoor poor Cult members..\nOnly criminal plead the Fifth..\nNo one is Above the law ..\nIt’s mind blowing 🤯\nHow Fox is making excuses for someone whom has broken a law ..\nHe put in place …. 🫡",
        "good": "1",
        "bad": "2",
        "replies": []
    },
    {
        "user_name": "macmurray",
        "time": "3 September, 2022",
        "context": "Trump lookin’ weak and scared, like a chihuahua with its nuts cut off.",
        "good": "1",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "crazyeddie896",
        "time": "2 September, 2022",
        "context": "We should all be thankful that Garland never made it to the SCOTUS. If this is how is administering the DOJ, just imagine what he would have made of the SCOTUS.",
        "good": "7",
        "bad": "0",
        "replies": [
            {
                "user_name": "objectiveuno089",
                "time": "2 September, 2022",
                "context": "What's wrong with fair and impartial? Lot better than Trump's DOJ. Newt had no problems with the evident bias back then.",
                "good": "0",
                "bad": "1",
                "replies": []
            },
            {
                "user_name": "marky750",
                "time": "3 September, 2022",
                "context": "Trump ran his DOJ.  Ask Barr and Sessions.\n\nAt least Garland wouldn't have cried like Kavanaugh and Garland wouldn't have lied about his position on issues.\n\nWho is the Justice Don the Con appointed who never tried a case?",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "marky750",
                "time": "4 September, 2022",
                "context": "Yeah. American women wouldn't have lost a constitutional right.",
                "good": "0",
                "bad": "0",
                "replies": []
            },
            {
                "user_name": "andym663",
                "time": "6 September, 2022",
                "context": "No different than Ketani Brown-Jackson intends to when given the chance",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "vetomania",
        "time": "3 September, 2022",
        "context": "People receive serious federal time for federal racketeering convictions.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "TheRepublicMatters🎬",
        "time": "2 September, 2022",
        "context": "This is incredibly sad to say the least.",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "-13%",
        "time": "2 September, 2022",
        "context": "The Red Wave is coming. . . . .",
        "good": "0",
        "bad": "1",
        "replies": [
            {
                "user_name": "marky750",
                "time": "3 September, 2022",
                "context": "You're joking, right?",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "@TheRealPat",
        "time": "2 September, 2022",
        "context": "Turns out Newt was behind ads that pushed the election lie, intended to stoke anger and outrage.",
        "good": "3",
        "bad": "3",
        "replies": [
            {
                "user_name": "marky750",
                "time": "3 September, 2022",
                "context": "Part of the group who wanted to sit on the Board of Directors of Trump's new government.  A few, like him, will hang on post sentencing hoping to grab some crumbs.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "asyouaskforit073",
        "time": "2 September, 2022",
        "context": "Democracy is now is now being threatened by corrupt politicians and their puppets  in  the DOJ, FBI and the CIA!",
        "good": "3",
        "bad": "3",
        "replies": [
            {
                "user_name": "marky750",
                "time": "3 September, 2022",
                "context": "Sure they are.....",
                "good": "0",
                "bad": "1",
                "replies": []
            },
            {
                "user_name": "marky750",
                "time": "4 September, 2022",
                "context": "The ones Trump put there and support?\n\nWhy do you believe a private citizen should have possession of US Government property and what happens when he mails photocopies to his dictator pals?\n\nDo you really want your ascendants to live like 1942 Europe?  Who is going to cone save THEM?",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "drdtm",
        "time": "3 September, 2022",
        "context": "Hasn't this been typical of Biden's cabinet?  It is like a ship of fools. But Biden gets proped up by the liberal press like MSNBC. Check out this article: Maddow Blog | The Republicans’ case against Merrick Garland is amazingly weak.....",
        "good": "0",
        "bad": "1",
        "replies": []
    },
    {
        "user_name": "jackwade",
        "time": "2 September, 2022",
        "context": "Newt is a has-been. He sold out decades ago and has been trying to be relevant over the last 20 years.",
        "good": "2",
        "bad": "3",
        "replies": [
            {
                "user_name": "unmarked_map_test",
                "time": "2 September, 2022",
                "context": "Precisely. \n\nThis was a greedy has-been's last shot at being a KingMaker.",
                "good": "0",
                "bad": "0",
                "replies": []
            }
        ]
    },
    {
        "user_name": "rationality",
        "time": "4 September, 2022",
        "context": "Newt Gingrich is one of the most astute and insightful people to have ever served our nation. If he is calling Garland's DOJ out he most certainly can support the allegations he has made. \n\nThis stinks like an FBI/DOJ effort to hide evidence of their misdeeds in Russiagate, Huntergate and Extortion by the hiden Bidens.\n\nGeheimstadtspolitzei behavior all the way.",
        "good": "1",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "ossie234",
        "time": "11 September, 2022",
        "context": "So the head of the FBI was appointed by Trump..,\nTrump praise him in the RUSSIA Russia Probe against him said Wray was a fantastic leader of the FBI .. \nbut what I can’t understand if how many cult members haven’t got a problem with Trump being a TRAITOR to AMERICA …",
        "good": "0",
        "bad": "0",
        "replies": []
    },
    {
        "user_name": "larryljames",
        "time": "18 September, 2022",
        "context": "Biden says that MAGA republicans are fascists. The Dems want to penalize those who post comments they don't agree with. The Dems have been indoctrinating our children in schools for years. The Dems have two sets of laws for those who disagree and those who do agree with them. The Dems allow BLM to riot and burn building and murder people and yet when conservatives invade the capital building they call it treason and put them in prison, even though that building belong to all citizens. The Dems open the borders to force border states who are conservative, into submission, and when they send these illegals to Dem states the Dems want to start and investigation into kidnapping the illegals, something they won't do for a US citizen. Biden wants to steal the money from social security from the people who have paid into it their whole life. He says he has better things to do with it. Biden's weaponized DOJ persecutes anyone who is against Dems,  and yet the real criminals (Hunter Biden, Hillary Clinton ect) still walk free. Dems tell their police not to chase criminals, when they do catch them they are released a couple of hours later. Biden wants to hire an army of IRS agents. Sounds like they are going to twist you until every penny you have is theirs. How come this scenario reminds me of the same things Hitler did back in the late 30s in Germany just before the Nazi's took over.",
        "good": "0",
        "bad": "0",
        "replies": []
    }
]